[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AMA", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My step sons bio dad is a real piece of garbage... He had to live with him for several years because the courts didn&amp;#39;t want the kid to leave the state.. But court finally agreed it was DEF in his best interest... His dad made sure he had FIVE cavities in ADULT teeth, he developed a speech impediment and had untreated medical issues.. Courts made it very difficult for the right thing to happen.. Kiddo is doing AMAZING now.. AMA about the step fathering thing, the court stuff, the biological dad stuff. I will help all I can with any similar situations and let you know what finally worked for us!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My step sons bio dad is a real piece of garbage... He had to live with him for several years because the courts didn't want the kid to leave the state.. But court finally agreed it was DEF in his best interest... His dad made sure he had FIVE cavities in ADULT teeth, he developed a speech impediment and had untreated medical issues.. Courts made it very difficult for the right thing to happen.. Kiddo is doing AMAZING now.. AMA about the step fathering thing, the court stuff, the biological dad stuff. I will help all I can with any similar situations and let you know what finally worked for us!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64xshv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "strainbrain0304", "saved": false, "mod_reports": [], "name": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "approved_by": null, "over_18": false, "domain": "self.AMA", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r4eo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AMA/comments/64xshv/i_am_a_step_father_dealing_with_a_biological_dad/", "num_reports": null, "locked": false, "stickied": false, "created": 1492028480.0, "url": "https://www.reddit.com/r/AMA/comments/64xshv/i_am_a_step_father_dealing_with_a_biological_dad/", "author_flair_text": null, "quarantine": false, "title": "I am a step father, dealing with a biological dad who has done NOTHING for his child, and continues to what little damage he can with the new custody agreement... AMA!", "created_utc": 1491999680.0, "distinguished": null, "media": null, "upvote_ratio": 0.61, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg5yd6w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg5y239", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Oh and I just re read that... When I tell him \"oh your dad is probably very busy working\"...: his dad doesn't work... Hasn't in a long time.. He lives with his mommy at 33 and doesn't have a car, a cell phone, and THE KID has a bigger bank account than him... Literally.. Haha. Told kid that he can spend allowance or change I give him or whatever money he has on toys or whatever he can afford with it, OR he can put it in his savings account and I will match whatever he puts in.. So he saves EVERYTHING lol.. He could buy his own PlayStation 4 and games right now if he wanted... (What his dad promised and never delivered)... But you know what this kid said? \"Well, I will be 16 in 6 years so I think I'm going to keep saving for a car.\"!!!!!! Can you believe that lol? You can have a PS4 RIGHT NOW but you choose to save for a car! That is amazing! And I have been, and will continue to match what he puts in there. At the rate he is saving now, he will be able to spend 15k ish on a car lol. Amazing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh and I just re read that... When I tell him &amp;quot;oh your dad is probably very busy working&amp;quot;...: his dad doesn&amp;#39;t work... Hasn&amp;#39;t in a long time.. He lives with his mommy at 33 and doesn&amp;#39;t have a car, a cell phone, and THE KID has a bigger bank account than him... Literally.. Haha. Told kid that he can spend allowance or change I give him or whatever money he has on toys or whatever he can afford with it, OR he can put it in his savings account and I will match whatever he puts in.. So he saves EVERYTHING lol.. He could buy his own PlayStation 4 and games right now if he wanted... (What his dad promised and never delivered)... But you know what this kid said? &amp;quot;Well, I will be 16 in 6 years so I think I&amp;#39;m going to keep saving for a car.&amp;quot;!!!!!! Can you believe that lol? You can have a PS4 RIGHT NOW but you choose to save for a car! That is amazing! And I have been, and will continue to match what he puts in there. At the rate he is saving now, he will be able to spend 15k ish on a car lol. Amazing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg5yd6w", "score_hidden": false, "stickied": false, "created": 1492037050.0, "created_utc": 1492008250.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y239", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg5x3pu", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "The support means a lot man thanks! Yeah the kid knows I love him. And this year for Veterans Day he gave me the nicest card I ever received in my entire life... I got down on one knee to hug him and we both cried a bit lol.. He wrote something to the effect of \"Steve you were in the army and you are an awesome commander at home! I know I am a (bio dad last name) but I feel like a (my last name) and I love you!\" Asked teacher if she helped him write it, nope he did that all on his own... Gave me chills, made EVERYTHING worth it... It still sucks tho, I have such an AMAZING relationship with my dad... Don't know what I would do wiThout him.. And I want the kid to have that too!! Truly! I'm Not forcing the dad out or trying to replace, I think a relationship with his dad really should happen... But his dad refuses.. Hasn't called his kid since February 28th... He PROMISED the kid something specific for his birthday, gave him NOTHING... like not even a cheapo toy or card or candy... Nothing... Same thing for Easter last year, Christmas... This Easter weekend is supposed to be a day for his dad to visit, and he may, we told the kid that his dad said he was going to come get him and spend the day with him and this is the first time that the kid actually frowned and \"awwwww why?\" Made me sad... Just keep telling him \"cause your dad loves you very much... He wants to see you\"... Well he doesn't call me?? \"Uhhhhhhhh well he is probably very busy working, but he should call still, and still loves you very much.\" \"Yeah.... Ok..\"\n\nI try to make excuses for him, cause I don't want to be like \"look kid, your dad sucks... Sometimes dads suck..\" Lol.. But I'm running out of excuses and the kid is catching on.. Very smart.. His last school year at his dad's, in that one school year alone he missed FORTY days of school... 40, four zero days of school.. And the state pressed NO charges, no consequences... His report cards literally said \"kid has little to no understanding of grade level work\" for EVERY subject...  Now he has perfect attendance and literally straight As... Such a smart kid, and his dad did SO much damage.. I don't even have time to list the things.. I know if we did HALF of that to him in our state, we would be in states prison right now for neglect and child abuse.. It baffles me that it took this long to get primary custody and that no charges were filed on him.. We even called CPS on Him.. \"Well the apartment was dirty but we can do anything for a dirty apartment...\" WHAT ABOUT MISSING 40 days of school!? What about cavities in adult teeth!? What about him NOT HAVING A BED AND HAVING TO SLEEP ON THE FLOOR IN A SLEEPING BAG!? What about getting zeros in EVERY subject!? Etc..... Sucks it took so long, but he is safe and good now.. He LOVES having his own room, he loves showing off his good grades, he loves that I taught him to ride a bike... Me... Not his dad.. He loves actually celebrating holidays and getting gifts, he loves the family board game nights and the rule that no matter what is going on, we always sit as a family for dinner.. He makes me very proud with how hard he is working and how well he is doing.. That Veterans Day card was the best though... I have it hanging to look at it I'm ever frustrated or having a bad day.. I made a difference in this kids life... I showed him what a father and a MAN actually is.. And he can use that to raise HIS kids right.. I am a happy, lucky man.. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The support means a lot man thanks! Yeah the kid knows I love him. And this year for Veterans Day he gave me the nicest card I ever received in my entire life... I got down on one knee to hug him and we both cried a bit lol.. He wrote something to the effect of &amp;quot;Steve you were in the army and you are an awesome commander at home! I know I am a (bio dad last name) but I feel like a (my last name) and I love you!&amp;quot; Asked teacher if she helped him write it, nope he did that all on his own... Gave me chills, made EVERYTHING worth it... It still sucks tho, I have such an AMAZING relationship with my dad... Don&amp;#39;t know what I would do wiThout him.. And I want the kid to have that too!! Truly! I&amp;#39;m Not forcing the dad out or trying to replace, I think a relationship with his dad really should happen... But his dad refuses.. Hasn&amp;#39;t called his kid since February 28th... He PROMISED the kid something specific for his birthday, gave him NOTHING... like not even a cheapo toy or card or candy... Nothing... Same thing for Easter last year, Christmas... This Easter weekend is supposed to be a day for his dad to visit, and he may, we told the kid that his dad said he was going to come get him and spend the day with him and this is the first time that the kid actually frowned and &amp;quot;awwwww why?&amp;quot; Made me sad... Just keep telling him &amp;quot;cause your dad loves you very much... He wants to see you&amp;quot;... Well he doesn&amp;#39;t call me?? &amp;quot;Uhhhhhhhh well he is probably very busy working, but he should call still, and still loves you very much.&amp;quot; &amp;quot;Yeah.... Ok..&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I try to make excuses for him, cause I don&amp;#39;t want to be like &amp;quot;look kid, your dad sucks... Sometimes dads suck..&amp;quot; Lol.. But I&amp;#39;m running out of excuses and the kid is catching on.. Very smart.. His last school year at his dad&amp;#39;s, in that one school year alone he missed FORTY days of school... 40, four zero days of school.. And the state pressed NO charges, no consequences... His report cards literally said &amp;quot;kid has little to no understanding of grade level work&amp;quot; for EVERY subject...  Now he has perfect attendance and literally straight As... Such a smart kid, and his dad did SO much damage.. I don&amp;#39;t even have time to list the things.. I know if we did HALF of that to him in our state, we would be in states prison right now for neglect and child abuse.. It baffles me that it took this long to get primary custody and that no charges were filed on him.. We even called CPS on Him.. &amp;quot;Well the apartment was dirty but we can do anything for a dirty apartment...&amp;quot; WHAT ABOUT MISSING 40 days of school!? What about cavities in adult teeth!? What about him NOT HAVING A BED AND HAVING TO SLEEP ON THE FLOOR IN A SLEEPING BAG!? What about getting zeros in EVERY subject!? Etc..... Sucks it took so long, but he is safe and good now.. He LOVES having his own room, he loves showing off his good grades, he loves that I taught him to ride a bike... Me... Not his dad.. He loves actually celebrating holidays and getting gifts, he loves the family board game nights and the rule that no matter what is going on, we always sit as a family for dinner.. He makes me very proud with how hard he is working and how well he is doing.. That Veterans Day card was the best though... I have it hanging to look at it I&amp;#39;m ever frustrated or having a bad day.. I made a difference in this kids life... I showed him what a father and a MAN actually is.. And he can use that to raise HIS kids right.. I am a happy, lucky man.. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg5y239", "score_hidden": false, "stickied": false, "created": 1492036693.0, "created_utc": 1492007893.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x3pu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "QuarterMileOfNasty", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "I don't have a question but wanted to send a message of support.\nI've been in your shoes. Raised two children that weren't my own while bio-dad did the absolute bare minimum to skirt by. She'd take him to court for support and once the automatic payments were setup, he'd quit the job and go get another to start the process all over again. She and I both worked hard to provide for the kids and give them a good life. If we tried to do anything nice for ourselves or the family (vacation, new family vehicle) I'd be attacked with claims of his once every six month child support payment footing the bill...\n\n On one hand, it can be the most rewarding thing you'll ever do.. on the other, there's going to be a lot of frustration involved. Above anything else, just make sure that your love for the kid shows. The kid will see it and it'll pay you back tenfold someday. Try to keep your opinions of bio-dad away from the ears of the kid. That kind of drama can really screw with them. And not knowing any better, they can talk and cause more issues for you down the road. Hold your head high and keep fighting the good fight, man. ", "edited": 1492007004.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a question but wanted to send a message of support.\nI&amp;#39;ve been in your shoes. Raised two children that weren&amp;#39;t my own while bio-dad did the absolute bare minimum to skirt by. She&amp;#39;d take him to court for support and once the automatic payments were setup, he&amp;#39;d quit the job and go get another to start the process all over again. She and I both worked hard to provide for the kids and give them a good life. If we tried to do anything nice for ourselves or the family (vacation, new family vehicle) I&amp;#39;d be attacked with claims of his once every six month child support payment footing the bill...&lt;/p&gt;\n\n&lt;p&gt;On one hand, it can be the most rewarding thing you&amp;#39;ll ever do.. on the other, there&amp;#39;s going to be a lot of frustration involved. Above anything else, just make sure that your love for the kid shows. The kid will see it and it&amp;#39;ll pay you back tenfold someday. Try to keep your opinions of bio-dad away from the ears of the kid. That kind of drama can really screw with them. And not knowing any better, they can talk and cause more issues for you down the road. Hold your head high and keep fighting the good fight, man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg5x3pu", "score_hidden": false, "stickied": false, "created": 1492035565.0, "created_utc": 1492006765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg5w27u", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "She's with me. She is awesome.. She left the original state with her son because the father was abusive among other things... I won't mention the original state... But they threatened kidnapping charges.. Kid went back to dad, who lives in his mommys ONE BEDROOM shithole apartment... For 5 years she, then we, Fought for custody with the state... Got\nMore and more little by little, then state finally agreed that kid needed to go with us ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s with me. She is awesome.. She left the original state with her son because the father was abusive among other things... I won&amp;#39;t mention the original state... But they threatened kidnapping charges.. Kid went back to dad, who lives in his mommys ONE BEDROOM shithole apartment... For 5 years she, then we, Fought for custody with the state... Got\nMore and more little by little, then state finally agreed that kid needed to go with us &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg5w27u", "score_hidden": false, "stickied": false, "created": 1492034264.0, "created_utc": 1492005464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg8ni46", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ginger_trelf", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Thank you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg8ni46", "score_hidden": false, "stickied": false, "created": 1492166921.0, "created_utc": 1492138121.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg5ujmi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Leafs_43", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Where was/is the kids mother?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where was/is the kids mother?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg5ujmi", "score_hidden": false, "stickied": false, "created": 1492032199.0, "created_utc": 1492003399.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg6gjjf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg6fgef", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Thank you sir I appreciate it! no, I got hurt last deployment pretty good and my arMy days were over.. Even tho I'm a step dad, I feel like his real father... He brought me a keychain home from the school store the other dAy (tHat he could have just as easily given to his dad if he shows up this weekend) that said worlds best dad on it! Made me a little buttery inside lol.. Also if u read the other comments u will read about a card he have me before.. Amazing.. I know he looks up to me and I'm so glad.. And it helps keep me from slipping, or getting a little lazy sometimes... I want him to know what a man really is, and what a man really does.. He hadn't been getting those lessons obviously.. It baffles me tho.. I don't understand why his dad doesn't just walk away. He does more harm than good, he NEVER calls his kid, barely ever sees him. Just enough to get kiddo nervous and unhappy then leaves again. AND we could go after him for child support now... I don't need it, I make more than enough, but that money is for the kid... Not me or his mom.. And it would maybe teach his dad a lesson in responsibility, OR give him the reason to walk away. He hasn't worked in YEARS, and probably won't. So it would just go into rears and be deducted from his check if he ever does get a job... Kiddo used to tell me that his dad worked at unemployment... So that's why he got government checks... Ohhhh my kid... He got that because he refuses to work lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you sir I appreciate it! no, I got hurt last deployment pretty good and my arMy days were over.. Even tho I&amp;#39;m a step dad, I feel like his real father... He brought me a keychain home from the school store the other dAy (tHat he could have just as easily given to his dad if he shows up this weekend) that said worlds best dad on it! Made me a little buttery inside lol.. Also if u read the other comments u will read about a card he have me before.. Amazing.. I know he looks up to me and I&amp;#39;m so glad.. And it helps keep me from slipping, or getting a little lazy sometimes... I want him to know what a man really is, and what a man really does.. He hadn&amp;#39;t been getting those lessons obviously.. It baffles me tho.. I don&amp;#39;t understand why his dad doesn&amp;#39;t just walk away. He does more harm than good, he NEVER calls his kid, barely ever sees him. Just enough to get kiddo nervous and unhappy then leaves again. AND we could go after him for child support now... I don&amp;#39;t need it, I make more than enough, but that money is for the kid... Not me or his mom.. And it would maybe teach his dad a lesson in responsibility, OR give him the reason to walk away. He hasn&amp;#39;t worked in YEARS, and probably won&amp;#39;t. So it would just go into rears and be deducted from his check if he ever does get a job... Kiddo used to tell me that his dad worked at unemployment... So that&amp;#39;s why he got government checks... Ohhhh my kid... He got that because he refuses to work lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6gjjf", "score_hidden": false, "stickied": false, "created": 1492056062.0, "created_utc": 1492027262.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fgef", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BIGNUTSJACKSON", "parent_id": "t1_dg6cudg", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Sounds like he has a father to me.  Anybody can be a sperm donor, but it takes a real man to be a father.  Keep it up!  Are you still in the military?  I ask because I would hate for you to get deployed right now.  \n\nAs a father of a 9 year old girl I couldn't imagine letting her down.  It takes a true piece of shit to break a kid's heart, and it sounds like he does it time and again.  But hey, if he is willing to let you experience all the joy of raising a child then enjoy every minute of it.  \n\nThank you for your service!!   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like he has a father to me.  Anybody can be a sperm donor, but it takes a real man to be a father.  Keep it up!  Are you still in the military?  I ask because I would hate for you to get deployed right now.  &lt;/p&gt;\n\n&lt;p&gt;As a father of a 9 year old girl I couldn&amp;#39;t imagine letting her down.  It takes a true piece of shit to break a kid&amp;#39;s heart, and it sounds like he does it time and again.  But hey, if he is willing to let you experience all the joy of raising a child then enjoy every minute of it.  &lt;/p&gt;\n\n&lt;p&gt;Thank you for your service!!   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6fgef", "score_hidden": false, "stickied": false, "created": 1492054959.0, "created_utc": 1492026159.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cudg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg6c9cr", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "He uses... I'm not sure of how deep the addiction.. I honestly never saw the dude til the last court hearing... Never had a need to. But he looked clean cut, healthy weight and all. But he has several DUIs and has done time for it.. My fiancé also tells me stories about drugs. And abuse .. I think he is lazy.. His mom bails him out, gives him a place to live rent free, lets him use her car etc.. But at 33 he is sleeping on a lazy boy in his moms living room of a dingy 1 bedroom... I guess that is enough for him... Not for me lol. Not for most guys I would imagine.. I just think it is CRAZY how Much time, money, effort, it took to get kiddo down here.. As I've said before, if we did even ONE of the things he has done to his kid, we would be in prison in this state..  It was ALL because she moved out of state to be with family... He separated her from her support system and abused her mentally and physically.. But the shitty state he is in didn't want the kid taken out of his school (even tho he was missing LITERALLY 40 days + a year) and out of state... The fact that the state signed off on sending kiddo to another state and changing schools and all that shows how bad it was... When kiddo came to us to stay he basically needed to be taught how to live everyday life..\n\nWe FINALLY got kid to stop wetting the bed, but have now noticed that whenever he is SUPPOSED to see his dad (his dad bails and doesn't usually come) he starts wetting the bed again, and behaviors become worse.. I just wish WHATEVER is wrong with his dad, be it drugs, alcohol, low IQ... I wish it would get figured out.. It makes me super sad that he doesn't have a father.. And that doesn't appear to be changing any time soon.. But he has me. I'm ex army and I am a loyal, hard working family man.. I will do my best to teach him the way of the Jedi, hoping he doesn't follow the dark side... Haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He uses... I&amp;#39;m not sure of how deep the addiction.. I honestly never saw the dude til the last court hearing... Never had a need to. But he looked clean cut, healthy weight and all. But he has several DUIs and has done time for it.. My fiancé also tells me stories about drugs. And abuse .. I think he is lazy.. His mom bails him out, gives him a place to live rent free, lets him use her car etc.. But at 33 he is sleeping on a lazy boy in his moms living room of a dingy 1 bedroom... I guess that is enough for him... Not for me lol. Not for most guys I would imagine.. I just think it is CRAZY how Much time, money, effort, it took to get kiddo down here.. As I&amp;#39;ve said before, if we did even ONE of the things he has done to his kid, we would be in prison in this state..  It was ALL because she moved out of state to be with family... He separated her from her support system and abused her mentally and physically.. But the shitty state he is in didn&amp;#39;t want the kid taken out of his school (even tho he was missing LITERALLY 40 days + a year) and out of state... The fact that the state signed off on sending kiddo to another state and changing schools and all that shows how bad it was... When kiddo came to us to stay he basically needed to be taught how to live everyday life..&lt;/p&gt;\n\n&lt;p&gt;We FINALLY got kid to stop wetting the bed, but have now noticed that whenever he is SUPPOSED to see his dad (his dad bails and doesn&amp;#39;t usually come) he starts wetting the bed again, and behaviors become worse.. I just wish WHATEVER is wrong with his dad, be it drugs, alcohol, low IQ... I wish it would get figured out.. It makes me super sad that he doesn&amp;#39;t have a father.. And that doesn&amp;#39;t appear to be changing any time soon.. But he has me. I&amp;#39;m ex army and I am a loyal, hard working family man.. I will do my best to teach him the way of the Jedi, hoping he doesn&amp;#39;t follow the dark side... Haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6cudg", "score_hidden": false, "stickied": false, "created": 1492052259.0, "created_utc": 1492023459.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6c9cr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BIGNUTSJACKSON", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Does Dad have a drug problem?  If not, he sure as hell is acting like it.  I have a friend that was one of the best fathers I ever seen, but got strung out on opiates and quickly spiraled downhill.  He lost everything including his home, family, car, ect.  He didn't care about anyone or anything but getting high.  He stole from me and his family to get high.  He finally got clean after about 5 years of drug abuse and has been clean for a couple of years now.  He is back to his old self and has managed to patch things up with his son.  He has a lot of making up to do, but its great to see him taking care of business again.  I say all of this because drugs are the only thing I have ever seen that will make a person duck out on even his own flesh and blood.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does Dad have a drug problem?  If not, he sure as hell is acting like it.  I have a friend that was one of the best fathers I ever seen, but got strung out on opiates and quickly spiraled downhill.  He lost everything including his home, family, car, ect.  He didn&amp;#39;t care about anyone or anything but getting high.  He stole from me and his family to get high.  He finally got clean after about 5 years of drug abuse and has been clean for a couple of years now.  He is back to his old self and has managed to patch things up with his son.  He has a lot of making up to do, but its great to see him taking care of business again.  I say all of this because drugs are the only thing I have ever seen that will make a person duck out on even his own flesh and blood.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6c9cr", "score_hidden": false, "stickied": false, "created": 1492051652.0, "created_utc": 1492022852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg6f3u4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg6eeeo", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Haha fair enough... My apologies", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha fair enough... My apologies&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6f3u4", "score_hidden": false, "stickied": false, "created": 1492054598.0, "created_utc": 1492025798.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6eeeo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "grimripple", "parent_id": "t1_dg6dn2f", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "But I am interested honestly!   And it is ask me ANYTHING! \n\n.........:)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But I am interested honestly!   And it is ask me ANYTHING! &lt;/p&gt;\n\n&lt;p&gt;.........:)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6eeeo", "score_hidden": false, "stickied": false, "created": 1492053875.0, "created_utc": 1492025075.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dn2f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg6dlhc", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Good thing you don't have to!.....:................ Haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good thing you don&amp;#39;t have to!.....:................ Haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6dn2f", "score_hidden": false, "stickied": false, "created": 1492053095.0, "created_utc": 1492024295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dlhc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "grimripple", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Why all the dot dot dots?.....\n\nI don't mean to criticize but it makes it really hard to read!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why all the dot dot dots?.....&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t mean to criticize but it makes it really hard to read!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6dlhc", "score_hidden": false, "stickied": false, "created": 1492053052.0, "created_utc": 1492024252.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg6phuf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cranguy", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "do your hair colours match?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;do your hair colours match?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg6phuf", "score_hidden": false, "stickied": false, "created": 1492066311.0, "created_utc": 1492037511.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg8nccb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg8jfkk", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Pretty much the same as with being a parent.. Decide what kind of parent/step parent you want to be. Be prepared as a step parent to deal with Exs... That's the name of the game. But it HAS to stay about the kid. What is in the best interest of the kid. It's easy to side with your spouse and just have a vendetta against your step kids other parent, but you have to do what's best for the kid and realize that sometimes, things are up to THEM, their kid, you not the main decision maker. \n\nAbove all, put yourself in the kiddos shoes.. Imagine what he or she is going through. They may take YEARS to warm up to you, and they may NEVER warm up to you. The important thing is that you make yourself available, respect boundaries, and model the man/woman that this kiddo should have to look up to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty much the same as with being a parent.. Decide what kind of parent/step parent you want to be. Be prepared as a step parent to deal with Exs... That&amp;#39;s the name of the game. But it HAS to stay about the kid. What is in the best interest of the kid. It&amp;#39;s easy to side with your spouse and just have a vendetta against your step kids other parent, but you have to do what&amp;#39;s best for the kid and realize that sometimes, things are up to THEM, their kid, you not the main decision maker. &lt;/p&gt;\n\n&lt;p&gt;Above all, put yourself in the kiddos shoes.. Imagine what he or she is going through. They may take YEARS to warm up to you, and they may NEVER warm up to you. The important thing is that you make yourself available, respect boundaries, and model the man/woman that this kiddo should have to look up to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg8nccb", "score_hidden": false, "stickied": false, "created": 1492166690.0, "created_utc": 1492137890.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8jfkk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ginger_trelf", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Do you have any general advice for current/future step parents?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any general advice for current/future step parents?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg8jfkk", "score_hidden": false, "stickied": false, "created": 1492161199.0, "created_utc": 1492132399.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg8n6c5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg8mmr4", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Yeah... Ok", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah... Ok&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg8n6c5", "score_hidden": false, "stickied": false, "created": 1492166447.0, "created_utc": 1492137647.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mmr4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Elfish-Phantom", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "This is one of the dumbest things you could've done", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is one of the dumbest things you could&amp;#39;ve done&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg8mmr4", "score_hidden": false, "stickied": false, "created": 1492165658.0, "created_utc": 1492136858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_64xshv", "likes": null, "replies": "", "user_reports": [], "id": "dg641y5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "strainbrain0304", "parent_id": "t1_dg631oa", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Lol why do people take the time to ask questions like this that have nothing at all to do with the topic?? Haha guess it is an ask me ANYTHING tho...\n\nEh not a lot of favorite \"singers\".. I'm a guitar player so I appreciate the music more than the lyrics a lot of the time.. Herman Li from dragon force is a badass guitarist.. Misha monsoor from periphery is great... So eh... I don't know lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol why do people take the time to ask questions like this that have nothing at all to do with the topic?? Haha guess it is an ask me ANYTHING tho...&lt;/p&gt;\n\n&lt;p&gt;Eh not a lot of favorite &amp;quot;singers&amp;quot;.. I&amp;#39;m a guitar player so I appreciate the music more than the lyrics a lot of the time.. Herman Li from dragon force is a badass guitarist.. Misha monsoor from periphery is great... So eh... I don&amp;#39;t know lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg641y5", "score_hidden": false, "stickied": false, "created": 1492043283.0, "created_utc": 1492014483.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg631oa", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "strawberrygirl1000", "parent_id": "t3_64xshv", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Favorite singers and bands?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Favorite singers and bands?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg631oa", "score_hidden": false, "stickied": false, "created": 1492042218.0, "created_utc": 1492013418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]