[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AMA", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;A little bit of information. I tried to post this on a Ask reddit post, but for some reason it didn&amp;#39;t send. After reading all these stories of people getting raped, I just wanted to share mine. Since I couldn&amp;#39;t post it on that thread, I decided to make an AMA. Tbh, this is my first AMA...so idk how to carry this out properly. Go easy on me in the comments please?*&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;For the past few months I have been reading these kind of horror stories. Reading about people being taken advantage of, their own rights being violated.... Reading about how all these things happen but then no form of justice or true closure is made. \nI&amp;#39;ve been reading to just find some sort of connection with people...to know that im not alone. But then every time I read stories like these I just get so angry ( at myself) and sad. To be honest, I don&amp;#39;&amp;#39;t understand why I keep coming back to these threads when it makes me like that. I have a choice to simply avoid these triggers and just go on with my life, but my head just forces me to look at these things.&lt;/p&gt;\n\n&lt;p&gt;Im just ranting on now. I guess i&amp;#39;ll just start.&lt;/p&gt;\n\n&lt;p&gt;I am a 17 yr old male who is graduating in June. Heading out of the New York so I could go straight into the college of my dreamd after graduation. \nI am gay. I mention this because its somewhat relevant in this story.\nIt happened during my early teen years - maybe 11 or 12. Anyway, I was just discovering myself (Or maybe I was just stumbling about, because I would just be staring at pictures of male wrestlers for hours but then still think of myself as straight. The concept of even being gay wasn&amp;#39;t even known to me at the time). I had been having some attractions to men, and I didn&amp;#39;t reach the stage of....uh...masturbating and ejaculating(idk what you would call that time in your life). TMI, but was pretty sexually immature before it happened. My birthday was coming up, and my mom recommended that I invite one of my elementary pals that I haven&amp;#39;t seen in a while ( we were just looking through a list of people to invite, and he...lets call him Ken...just came to thought) to the party that we were having in the backyard. I agree, and he comes. I mean, I was excited to see him again since we were good friends. He also seemed pretty nice as well ( of course he was a manipulator in disguise ).  We hit it off pretty well, and he started just coming over to my house on normal grounds. You know, like to watch a show or to talk or something. After a few visits, Ken asked me if I wanted to wrestle with him. I said yes to it, and we just started play wrestling together. I would think on the first day that we started wrestling, the actual event occurred. While we fought, Ken got the upper hand and threw me on the floor. As a joke, I decided to act as if I was knocked out. Ken saw that I wasn&amp;#39;t moving, and used it to his advantage. He rolled me over and pulled down my pants. As naive and immature as I was, I didn&amp;#39;t think much of it and so I let him pull my pants down. He then started to unbuckle his pants. I was such an idiot, I should have at least looked at what he was trying to do when I heard the noises of pants being undone and pulled down.  Once he was ready, he laid right on top of me and placed his penis in the crevasse of my ass. He didn&amp;#39;t really penetrate, but he just let it lay there. I felt his penis on me, and I did try to get him off me. But then, after a while, I succumbed. I kind of....started to like it a bit. Hell, after a few minutes of letting him do that I even tried to do it to him ( he wouldn&amp;#39;t let me though). Something like that would happen everytime we wrestled from that day forward, where he would push me down onto the floor and then have his way with me. I never did resist, because, in a sort of twisted way, I loved it. I loved wrestling with Ken, and I loved it when he would do whatever with me once he pinned me down. But then, after a while, I started actually loving Ken ( for his sex, not his full character. Shit, just associating all of this with sex just seems wrong). On day I accidently said that I loved him, but then took it back...&lt;/p&gt;\n\n&lt;p&gt;It continued for a year. Ken started making threats against me after another B-day passed ( He also had his way with me on my B-day, but then he was letting me do some stuff to him. I&amp;#39;m not proud to say that, since at that moment in my life I didn&amp;#39;t register what Ken was doing as wrong. I do now consider it as rape, or, at least, sexual assault). I just scoffed at the threats ( I was a young, immature kid who allowed a person to sexually manipulate me, while I had all the opportunities to escape.Of course I would be that dumb) and kept having sex with him. I guess I can actually say, without hesitation, that I was having sex with Ken, since he was now letting me have my way with him, to an extent. Unprotected too ( I was lucky that I didn&amp;#39;t get HIV or anything else)! That nonsense lasted for a while until my dad talked to me about how friends arent real friends if they take advantage of you ( somewhere on those lines. This was years ago so I can&amp;#39;t remember everything off my head). When my dad gave me that talk, I reflected on what me and Ken were doing, and how, in some cases, he would force me to do things that I didn&amp;#39;t really want to do. I ended up telling them everything, and I thought that they would hate me. They didn&amp;#39;t. My mom and dad embraced me and made sure to make me think that I could get through this. I remember very well the cries of my mom when I went downstairs to the basememt. When I was out of their sights, I just curled up on the basement couch and tried to wake up, because I thought it was a nightmare. I went to therapy for a few months. I don&amp;#39;t even remember what we talked about, but the sessions did heal me ( to an extent). I think I got tested - they stuck a swab up my anus and took a sample of my pee- but im not sure since I didn&amp;#39;t really know the procedure for detecting such and I don&amp;#39;t remember anyone talking to me about it ( you know what is sick about this? During the time I was being used by Ken, I asked him if I would get a disease from having sex with him. I didn&amp;#39;t even know what HIV and AIDS were at that stage in my life. He took advantage of me again, and said that I couldn&amp;#39;t. I bet he said it so that I wouldn&amp;#39;t get scared and tell someone. He&amp;#39;s a fucking bastard). I&amp;#39;m not taking any pills or whatever, and when I get my check-ups there is no mention of any disease...so I&amp;#39;m pretty sure i&amp;#39;m well on that note. &lt;/p&gt;\n\n&lt;p&gt;The whole ordeal itself left me in a crappy state. Going back to the present now, and I look at myself as  fucked up.  Despite knowing that im gay and that there is just nothing wrong with being gay, I still hate the fact that I know. I hate it because I found out through the worst way possible, and now when I think of where I discovered myself it always goes back to the time I was taken advantage of by my....rapist. When I read stories about how people at my age found out they were gay through positive experiences, like them just kissing someone they trust or discovering they like gay porn or maybe experimenting, I get jealous because my experience wasn&amp;#39;t positive at all. \nOn another note, Ken ended up just falling off the face of the earth. Idk what happened, but he was gone. I used to do my morning jog around where he lived, but I never seen him or any of his family members. I would like to think they moved away, but I feel as if he was sent away or disowned. This is a christian community, so idk...\nHowever, despite him possibly leaving my neighborhood, he still hasnt left my life. TMI coming your way, but when im exploring my sexual fantasies in my head while I masturbate, my mind  goes back to Ken and the times he had his way with me. And all the time, I end up up climaxing with him on my mind. Give it a few moments, and I&amp;#39;ll feel like a living piece of shit. Its as if he hijacked my mind, and uses it to make me think of him when something sexual is happening. If you think I want it, then prepare to be mistakened. I really just want him out of my head - I want to stop remembering him period. I want to forget that part of my life and just act as if it never happened. I just want it to disappear, but the reality is that those events play over and over again in my mind, with Ken as the main character. Tbh, im scared about this. Like, what happenes if I actually have sex with a man that I truely love,  but then Ken just comes up in my mind? I can&amp;#39;t bare to think about it.\nIt socially fucked me up too. Its like everytime I see one of my male friends, I fall head over heels for them. God, this happenes with every male friend. I try to keep it to myself ( I really do). Hell, i&amp;#39;m starting to feel attracted to my male 10th grade english teacher and thats just fucked up. I don&amp;#39;t want to, but it just happens. I really just want an actual relationship with someone that I can trust, but I don&amp;#39;t even know anyone that I can trust like that in school. That, and the gay male count in my school is practically non-existent. That desire to love and to be loved made me sort of clingy, and it also made me create unrealistic expectations. Not only that, but now I have trust issues. My group of friends is small, and I like it that way because I feel as if others would just take advantage of me. Wait, feel? They WILL take advantage of me. This one guy used to harrass me for money, and i would usually give him thr few dollars just to make him piss off. He said he would pay me back, but I knew he wouldn&amp;#39;t. I can&amp;#39;t fucking trust anyone in my school! Its BS!\n...\nI just don&amp;#39;t want another Ken.&lt;/p&gt;\n\n&lt;p&gt;For the past few months, i&amp;#39;ve been searching for people who experienced the same pain I went through, or even more. I wanted to be able to know that there are people that I can relate to. But as I keep reading these stories, I feel like my experience was NOTHING. People being held hostage for years on end, people being hurt by their families, people just destroying the lives of others, people being violated on the highest order and not getting the justice they deserve...it keeps going on. What is my situation compared to the situation to a person who was held in a cage for 10 years, and raped across those 10 years? It just makes me so fucking mad and disgusted at the fact that these things are happening to so many people, while others are comfortable and safe. Its horrible to know that these things are actually happening. Tbh, I just want to be able to end all of this. To stop more people from experiencing the pain of not having control over oneself. But I know that screaming about it on reddit won&amp;#39;t do shit. I just don&amp;#39;t know where to start, and I just dont know if what i&amp;#39;ll do would even do anything.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: The person that I thought was my friend repeatedly took advantage of my naivety and immaturity to have sex with me over a whole year. Made me clingy and socially awkward. Now I want to burn the cancerous act of rape into the ground, and get justice for those who deserve it.&lt;br/&gt;\nFuck you Ken. Just fuck you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "* A little bit of information. I tried to post this on a Ask reddit post, but for some reason it didn't send. After reading all these stories of people getting raped, I just wanted to share mine. Since I couldn't post it on that thread, I decided to make an AMA. Tbh, this is my first AMA...so idk how to carry this out properly. Go easy on me in the comments please?*\n\nFor the past few months I have been reading these kind of horror stories. Reading about people being taken advantage of, their own rights being violated.... Reading about how all these things happen but then no form of justice or true closure is made. \nI've been reading to just find some sort of connection with people...to know that im not alone. But then every time I read stories like these I just get so angry ( at myself) and sad. To be honest, I don''t understand why I keep coming back to these threads when it makes me like that. I have a choice to simply avoid these triggers and just go on with my life, but my head just forces me to look at these things.\n\nIm just ranting on now. I guess i'll just start.\n\nI am a 17 yr old male who is graduating in June. Heading out of the New York so I could go straight into the college of my dreamd after graduation. \nI am gay. I mention this because its somewhat relevant in this story.\nIt happened during my early teen years - maybe 11 or 12. Anyway, I was just discovering myself (Or maybe I was just stumbling about, because I would just be staring at pictures of male wrestlers for hours but then still think of myself as straight. The concept of even being gay wasn't even known to me at the time). I had been having some attractions to men, and I didn't reach the stage of....uh...masturbating and ejaculating(idk what you would call that time in your life). TMI, but was pretty sexually immature before it happened. My birthday was coming up, and my mom recommended that I invite one of my elementary pals that I haven't seen in a while ( we were just looking through a list of people to invite, and he...lets call him Ken...just came to thought) to the party that we were having in the backyard. I agree, and he comes. I mean, I was excited to see him again since we were good friends. He also seemed pretty nice as well ( of course he was a manipulator in disguise ).  We hit it off pretty well, and he started just coming over to my house on normal grounds. You know, like to watch a show or to talk or something. After a few visits, Ken asked me if I wanted to wrestle with him. I said yes to it, and we just started play wrestling together. I would think on the first day that we started wrestling, the actual event occurred. While we fought, Ken got the upper hand and threw me on the floor. As a joke, I decided to act as if I was knocked out. Ken saw that I wasn't moving, and used it to his advantage. He rolled me over and pulled down my pants. As naive and immature as I was, I didn't think much of it and so I let him pull my pants down. He then started to unbuckle his pants. I was such an idiot, I should have at least looked at what he was trying to do when I heard the noises of pants being undone and pulled down.  Once he was ready, he laid right on top of me and placed his penis in the crevasse of my ass. He didn't really penetrate, but he just let it lay there. I felt his penis on me, and I did try to get him off me. But then, after a while, I succumbed. I kind of....started to like it a bit. Hell, after a few minutes of letting him do that I even tried to do it to him ( he wouldn't let me though). Something like that would happen everytime we wrestled from that day forward, where he would push me down onto the floor and then have his way with me. I never did resist, because, in a sort of twisted way, I loved it. I loved wrestling with Ken, and I loved it when he would do whatever with me once he pinned me down. But then, after a while, I started actually loving Ken ( for his sex, not his full character. Shit, just associating all of this with sex just seems wrong). On day I accidently said that I loved him, but then took it back...\n\nIt continued for a year. Ken started making threats against me after another B-day passed ( He also had his way with me on my B-day, but then he was letting me do some stuff to him. I'm not proud to say that, since at that moment in my life I didn't register what Ken was doing as wrong. I do now consider it as rape, or, at least, sexual assault). I just scoffed at the threats ( I was a young, immature kid who allowed a person to sexually manipulate me, while I had all the opportunities to escape.Of course I would be that dumb) and kept having sex with him. I guess I can actually say, without hesitation, that I was having sex with Ken, since he was now letting me have my way with him, to an extent. Unprotected too ( I was lucky that I didn't get HIV or anything else)! That nonsense lasted for a while until my dad talked to me about how friends arent real friends if they take advantage of you ( somewhere on those lines. This was years ago so I can't remember everything off my head). When my dad gave me that talk, I reflected on what me and Ken were doing, and how, in some cases, he would force me to do things that I didn't really want to do. I ended up telling them everything, and I thought that they would hate me. They didn't. My mom and dad embraced me and made sure to make me think that I could get through this. I remember very well the cries of my mom when I went downstairs to the basememt. When I was out of their sights, I just curled up on the basement couch and tried to wake up, because I thought it was a nightmare. I went to therapy for a few months. I don't even remember what we talked about, but the sessions did heal me ( to an extent). I think I got tested - they stuck a swab up my anus and took a sample of my pee- but im not sure since I didn't really know the procedure for detecting such and I don't remember anyone talking to me about it ( you know what is sick about this? During the time I was being used by Ken, I asked him if I would get a disease from having sex with him. I didn't even know what HIV and AIDS were at that stage in my life. He took advantage of me again, and said that I couldn't. I bet he said it so that I wouldn't get scared and tell someone. He's a fucking bastard). I'm not taking any pills or whatever, and when I get my check-ups there is no mention of any disease...so I'm pretty sure i'm well on that note. \n\nThe whole ordeal itself left me in a crappy state. Going back to the present now, and I look at myself as  fucked up.  Despite knowing that im gay and that there is just nothing wrong with being gay, I still hate the fact that I know. I hate it because I found out through the worst way possible, and now when I think of where I discovered myself it always goes back to the time I was taken advantage of by my....rapist. When I read stories about how people at my age found out they were gay through positive experiences, like them just kissing someone they trust or discovering they like gay porn or maybe experimenting, I get jealous because my experience wasn't positive at all. \nOn another note, Ken ended up just falling off the face of the earth. Idk what happened, but he was gone. I used to do my morning jog around where he lived, but I never seen him or any of his family members. I would like to think they moved away, but I feel as if he was sent away or disowned. This is a christian community, so idk...\nHowever, despite him possibly leaving my neighborhood, he still hasnt left my life. TMI coming your way, but when im exploring my sexual fantasies in my head while I masturbate, my mind  goes back to Ken and the times he had his way with me. And all the time, I end up up climaxing with him on my mind. Give it a few moments, and I'll feel like a living piece of shit. Its as if he hijacked my mind, and uses it to make me think of him when something sexual is happening. If you think I want it, then prepare to be mistakened. I really just want him out of my head - I want to stop remembering him period. I want to forget that part of my life and just act as if it never happened. I just want it to disappear, but the reality is that those events play over and over again in my mind, with Ken as the main character. Tbh, im scared about this. Like, what happenes if I actually have sex with a man that I truely love,  but then Ken just comes up in my mind? I can't bare to think about it.\nIt socially fucked me up too. Its like everytime I see one of my male friends, I fall head over heels for them. God, this happenes with every male friend. I try to keep it to myself ( I really do). Hell, i'm starting to feel attracted to my male 10th grade english teacher and thats just fucked up. I don't want to, but it just happens. I really just want an actual relationship with someone that I can trust, but I don't even know anyone that I can trust like that in school. That, and the gay male count in my school is practically non-existent. That desire to love and to be loved made me sort of clingy, and it also made me create unrealistic expectations. Not only that, but now I have trust issues. My group of friends is small, and I like it that way because I feel as if others would just take advantage of me. Wait, feel? They WILL take advantage of me. This one guy used to harrass me for money, and i would usually give him thr few dollars just to make him piss off. He said he would pay me back, but I knew he wouldn't. I can't fucking trust anyone in my school! Its BS!\n...\nI just don't want another Ken.\n\nFor the past few months, i've been searching for people who experienced the same pain I went through, or even more. I wanted to be able to know that there are people that I can relate to. But as I keep reading these stories, I feel like my experience was NOTHING. People being held hostage for years on end, people being hurt by their families, people just destroying the lives of others, people being violated on the highest order and not getting the justice they deserve...it keeps going on. What is my situation compared to the situation to a person who was held in a cage for 10 years, and raped across those 10 years? It just makes me so fucking mad and disgusted at the fact that these things are happening to so many people, while others are comfortable and safe. Its horrible to know that these things are actually happening. Tbh, I just want to be able to end all of this. To stop more people from experiencing the pain of not having control over oneself. But I know that screaming about it on reddit won't do shit. I just don't know where to start, and I just dont know if what i'll do would even do anything.\n\ntl;dr: The person that I thought was my friend repeatedly took advantage of my naivety and immaturity to have sex with me over a whole year. Made me clingy and socially awkward. Now I want to burn the cancerous act of rape into the ground, and get justice for those who deserve it.  \nFuck you Ken. Just fuck you.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65cqgt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "Pkpulsefall", "saved": false, "mod_reports": [], "name": "t3_65cqgt", "subreddit_name_prefixed": "r/AMA", "approved_by": null, "over_18": false, "domain": "self.AMA", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r4eo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AMA/comments/65cqgt/i_was_raped_by_a_person_who_i_thought_was_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492207944.0, "url": "https://www.reddit.com/r/AMA/comments/65cqgt/i_was_raped_by_a_person_who_i_thought_was_my/", "author_flair_text": null, "quarantine": false, "title": "I was raped by a person who I thought was my friend", "created_utc": 1492179144.0, "distinguished": null, "media": null, "upvote_ratio": 0.56, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_65cqgt", "likes": null, "replies": "", "user_reports": [], "id": "dg9qsdn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "absloan12", "parent_id": "t3_65cqgt", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Sorry that happened to you. Don't hate yourself for not knowing what was going on (I hated myself for the longest time after my incident), you were naive and confused and he sounds like he has some mental instabilities.\n\nWhat made you want to do an AMA about this? (Like specifically why an AMA if you originally wanted to do Ask Reddit?) Do you just feel the need to talk about it or is there some hidden question you hope to answer?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry that happened to you. Don&amp;#39;t hate yourself for not knowing what was going on (I hated myself for the longest time after my incident), you were naive and confused and he sounds like he has some mental instabilities.&lt;/p&gt;\n\n&lt;p&gt;What made you want to do an AMA about this? (Like specifically why an AMA if you originally wanted to do Ask Reddit?) Do you just feel the need to talk about it or is there some hidden question you hope to answer?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dg9qsdn", "score_hidden": false, "stickied": false, "created": 1492232346.0, "created_utc": 1492203546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_65cqgt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r4eo", "removal_reason": null, "link_id": "t3_65cqgt", "likes": null, "replies": "", "user_reports": [], "id": "dgaain1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pkpulsefall", "parent_id": "t1_dga0fif", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "The first ( and last) time I had sex/raped  was during the time that I associated myself with Ken. The first time he ever did anything, I felt a sensation that was so new at the moment. I loved it. It was sick...but I wanted more of it. I felt that I would only feel this sensation with Ken since he introduced it to me and I wasnt interested in anyone else at that time in my life. So I became attached, and let him have his way with my so that I could keep having this feeling. As time went on, I started to love him. I started to seek out more than him using me...I wanted to use him( or, really, I wanted to be able to do the same things he did to me to him, and for him to want me to do so. I wanted to actually have real sex with Ken). I wanted to get on top of him and do what he did to me. I wanted him to kiss me when he did these things, and I wanted to kiss him. I wanted him to smile ( in a loving manner) when we were doing it. I wanted so much more from Ken. \n\nHe  never did kiss me.\nHe never did  let me have sex with him.\nHe never did smile when he did it to me.\nHe never did look me in the eyes and talk to me while he did it to me. \n\nI wanted so much, but he never delivered. He got what he wanted and left. I, truely, wanted a relationship with him at that moment. Once I finally removed him from my life, I still wanted that relationship with him. I just felt like he left me without giving me what I desired, and I just kept dreaming that it would happen one day.\n\nWhen im in my sexual fantasies, I always dream of the best fantasy there is - someone that I can trust and care about being over me and delivering the most pleasurable experience I could imagine. I dream of him smiling and talking. I dream of both of us being happy within a happy setting. And so when I dream of that, I always end up remembering Ken because I associated this desire with my rapist before. Or really, I associated my fantasy with the person that I wished I had met - A Ken that looked like my rapist but actually loved and gave a damn about me...something to be desired.\n\nIdk if this answered your question at all...but I guess it expanded on the whole fantasy stuff. About the Stockholm syndrome thing...then maybe I do have it.  I feel as if I need Ken in my life to feel love, pleasure, and trust.  I sometimes feel like im nothing without him. Its bullshit, since I have awesome as hell friends and family members, but the feeling is still lingering. I never really was in a relationship after that, so its not like I can replace the image of Ken with someone else. \n\nAlso about the last thing you said....what do you mean? Maybe I wasn't really clear...but my parents were quick to accept the fact that I was raped by Ken. They were silent on the whole sexuality thing ( well at least my mom was). I have yet to tell them anything on my perferences, and I wish to keep it that way until I can support myself without them. In other words, they haven't really gotten the chance to accept me being gay, but they did accept the fact that I was raped. \n\nSorry if this was such a long read or if it made you even more confused. Im trying to answer these questions in the best way possible, but I feel like im doing it wrong. Hopefully you got something out of my reply. \n\nAlso, thank you for reading my post (:\nIm happy to just put my story out there and have people read. I feel less and less alone with every comment. Again, thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The first ( and last) time I had sex/raped  was during the time that I associated myself with Ken. The first time he ever did anything, I felt a sensation that was so new at the moment. I loved it. It was sick...but I wanted more of it. I felt that I would only feel this sensation with Ken since he introduced it to me and I wasnt interested in anyone else at that time in my life. So I became attached, and let him have his way with my so that I could keep having this feeling. As time went on, I started to love him. I started to seek out more than him using me...I wanted to use him( or, really, I wanted to be able to do the same things he did to me to him, and for him to want me to do so. I wanted to actually have real sex with Ken). I wanted to get on top of him and do what he did to me. I wanted him to kiss me when he did these things, and I wanted to kiss him. I wanted him to smile ( in a loving manner) when we were doing it. I wanted so much more from Ken. &lt;/p&gt;\n\n&lt;p&gt;He  never did kiss me.\nHe never did  let me have sex with him.\nHe never did smile when he did it to me.\nHe never did look me in the eyes and talk to me while he did it to me. &lt;/p&gt;\n\n&lt;p&gt;I wanted so much, but he never delivered. He got what he wanted and left. I, truely, wanted a relationship with him at that moment. Once I finally removed him from my life, I still wanted that relationship with him. I just felt like he left me without giving me what I desired, and I just kept dreaming that it would happen one day.&lt;/p&gt;\n\n&lt;p&gt;When im in my sexual fantasies, I always dream of the best fantasy there is - someone that I can trust and care about being over me and delivering the most pleasurable experience I could imagine. I dream of him smiling and talking. I dream of both of us being happy within a happy setting. And so when I dream of that, I always end up remembering Ken because I associated this desire with my rapist before. Or really, I associated my fantasy with the person that I wished I had met - A Ken that looked like my rapist but actually loved and gave a damn about me...something to be desired.&lt;/p&gt;\n\n&lt;p&gt;Idk if this answered your question at all...but I guess it expanded on the whole fantasy stuff. About the Stockholm syndrome thing...then maybe I do have it.  I feel as if I need Ken in my life to feel love, pleasure, and trust.  I sometimes feel like im nothing without him. Its bullshit, since I have awesome as hell friends and family members, but the feeling is still lingering. I never really was in a relationship after that, so its not like I can replace the image of Ken with someone else. &lt;/p&gt;\n\n&lt;p&gt;Also about the last thing you said....what do you mean? Maybe I wasn&amp;#39;t really clear...but my parents were quick to accept the fact that I was raped by Ken. They were silent on the whole sexuality thing ( well at least my mom was). I have yet to tell them anything on my perferences, and I wish to keep it that way until I can support myself without them. In other words, they haven&amp;#39;t really gotten the chance to accept me being gay, but they did accept the fact that I was raped. &lt;/p&gt;\n\n&lt;p&gt;Sorry if this was such a long read or if it made you even more confused. Im trying to answer these questions in the best way possible, but I feel like im doing it wrong. Hopefully you got something out of my reply. &lt;/p&gt;\n\n&lt;p&gt;Also, thank you for reading my post (:\nIm happy to just put my story out there and have people read. I feel less and less alone with every comment. Again, thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dgaain1", "score_hidden": false, "stickied": false, "created": 1492259965.0, "created_utc": 1492231165.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga0fif", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Fuggincupcakes", "parent_id": "t3_65cqgt", "subreddit_name_prefixed": "r/AMA", "controversiality": 0, "body": "Do you feel you had some sort of Stockholm syndrome from all of this? This could be my only thought on why you'd go back to the thought of him, but I'm far from a doctor. I'm sorry this happened to you OP, but I'm happy that your family accepts you and supports you. I can't imagine manipulation and domination is the best way to discover your sexual orientation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you feel you had some sort of Stockholm syndrome from all of this? This could be my only thought on why you&amp;#39;d go back to the thought of him, but I&amp;#39;m far from a doctor. I&amp;#39;m sorry this happened to you OP, but I&amp;#39;m happy that your family accepts you and supports you. I can&amp;#39;t imagine manipulation and domination is the best way to discover your sexual orientation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AMA", "name": "t1_dga0fif", "score_hidden": false, "stickied": false, "created": 1492245018.0, "created_utc": 1492216218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]