[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "italy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Stamattina avrei dovuto fare un corso per un certo documento utilizzabile in ambito professionale, a mie spese. Ho oscurato alcune parti del racconto.&lt;/p&gt;\n\n&lt;p&gt;Per il corso ci si registrava online, l&amp;#39;invito era quello di pagare un acconto a distanza ma si poteva anche non fare, e io non l&amp;#39;avevo fatto, volevo pagare in contanti.&lt;/p&gt;\n\n&lt;p&gt;Il corso sarebbe dovuto iniziare alle 9 ma il docente ci ha messo un po&amp;#39; a raccogliere i documenti, fare ricevute, chiama l&amp;#39;azienda, eccetera. Inoltre non c&amp;#39;eravamo tutti quelli che si erano &lt;del&gt;presentati&lt;/del&gt; registrati (cioè prenotati), ma chissà, forse sarebbero arrivati dopo? Io gli do i contanti e mi fa una ricevuta con firma, data e importo ma senza numero: né scritto a penna né il numero che ho visto nelle normali ricevute. Inoltre è una quantità tale dove mi sembra ci voglia la marca da bollo, ma magari per questo tipo di ricevute non è necessaria la marca da bollo. Ma se non sono ben informato non voglio fare polemica, e così non dico niente.&lt;/p&gt;\n\n&lt;p&gt;A un certo punto della preparazione il docente notato che qua non è come a XXXXX dove il/la XXXXX viene a fare i controlli e a vedere se siamo veramente in aula.&lt;/p&gt;\n\n&lt;p&gt;Pochi secondi dopo aver iniziato la spiegazione il docente viene chiamato dall&amp;#39;azienda. Finita la telefonata ci dice che -- come lui immaginava sarebbe successo, ma non ha detto niente -- l&amp;#39;azienda gli ha detto che, siccome sarebbero in perdita con così poche persone, il corso l&amp;#39;avremmo fatto in una giornata invece che in due giornate (facendo, effettivamente, solo due terzi delle ore richieste) e quindi o eravamo d&amp;#39;accordo o ce ne andavamo.&lt;/p&gt;\n\n&lt;p&gt;Ora ancora se faccio polemica devo essere informato, quindi non voglio lamentarmi della durata del corso. Che ne so io che è illegale? Però gli faccio notare che non ho intenzione di dichiarare il falso quindi se devo dichiarare che domani sono lì, allora per me non si fa niente.&lt;/p&gt;\n\n&lt;p&gt;Mi dice che sarebbe lui a dichiarare il falso, e non io, perché se poi domani faccio una rapina se la prendono con lui.&lt;/p&gt;\n\n&lt;p&gt;Dico che però io intanto dovrei firmare che domani sono lì quando non ci sarei.&lt;/p&gt;\n\n&lt;p&gt;Quindi niente, gli restituisco la ricevuta (o &amp;quot;ricevuta&amp;quot;?), mi restituisce tutti i contanti, potrò registrarmi per il prossimo corso. Gli restituisco anche il blocchetto e la penna. Il docente osserva anche che loro non mi hanno chiesto l&amp;#39;acconto e si sono fidati. Considerando il viaggio di andata e ritorno ho perso circa tre ore di tempo.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;Riflessioni:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Forse quando ho restituito la ricevuta (o &amp;quot;ricevuta&amp;quot;) avrei dovuto farci qualche segno.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Sarebbe proprio il caso che imparassi come riconoscere una ricevuta da una &amp;quot;ricevuta&amp;quot;.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Fare pagamenti non in contanti ha il vantaggio che se mi fanno una ricevuta senza valore posso dimostrare che ho pagato e pretendere una ricevuta vera.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Non versare l&amp;#39;acconto ha il vantaggio che adesso posso rivolgermi a un&amp;#39;altra azienda per fare questo corso.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Non posso saperlo, ma immagino che, se voleva che firmassi il registro per domani, probabilmente qualche legge o regolamento gli chiede di fare un tot di ore per darmi quell&amp;#39;attestato. Per me possiamo anche diminuire il numero delle leggi e liberalizzare questo tipo di corsi e attestati, ma finché lo Stato chiede certi standard vanno rispettati. Tra l&amp;#39;altro a XXXXX il/la XXXXX li controlla in aula mentre a quanto pare nella mia città non si aspetta tali controlli.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Supponendo che ho capito come funziona il corso e l&amp;#39;attestato dal punto di vista normativo, fra l&amp;#39;azienda e i corsisti esiste un certo conflitto d&amp;#39;interesse ai danni dello Stato nel dare questo attestato. Quindi se lo Stato vuole regolamentare questo attestato è importante che controlli che le regole vengano seguite.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Dal punto di vista di quell&amp;#39;azienda, le cose si devono fare bene. Quindi avrebbero potuto pretendere un acconto a tutti. Oppure se hanno pochi corsisti potrebbero fare i corsi meno spesso. Oppure non facevano il corso finché non avevano un numero di acconti sufficienti a coprire le spese. Il risultato è che io ho perso tempo, e loro hanno perso un corsista, perché se riuscirò mi rivolgerò altrove per avere questo attestato.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Il docente inizialmente ha detto che sarebbe stato lui a dichiarae il falso e non io, ma in realtà avrei dovuto firmare il registro. Quindi ho dovuto riformulare la mia richiesta di chiarimento per confermare che in effetti mi sarebbe stato richiesto di dichiarare il falso. Non apprezzo quando mi viene detta una cosa al posto di un&amp;#39;altra quasi come se ci fosse un accordo non scritto che se uno è veramente interessato allora deve insistere.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;Edit: &lt;del&gt;presentati&lt;/del&gt; registrati (cioè prenotati)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Stamattina avrei dovuto fare un corso per un certo documento utilizzabile in ambito professionale, a mie spese. Ho oscurato alcune parti del racconto.\n\nPer il corso ci si registrava online, l'invito era quello di pagare un acconto a distanza ma si poteva anche non fare, e io non l'avevo fatto, volevo pagare in contanti.\n\nIl corso sarebbe dovuto iniziare alle 9 ma il docente ci ha messo un po' a raccogliere i documenti, fare ricevute, chiama l'azienda, eccetera. Inoltre non c'eravamo tutti quelli che si erano ~~presentati~~ registrati (cioè prenotati), ma chissà, forse sarebbero arrivati dopo? Io gli do i contanti e mi fa una ricevuta con firma, data e importo ma senza numero: né scritto a penna né il numero che ho visto nelle normali ricevute. Inoltre è una quantità tale dove mi sembra ci voglia la marca da bollo, ma magari per questo tipo di ricevute non è necessaria la marca da bollo. Ma se non sono ben informato non voglio fare polemica, e così non dico niente.\n\nA un certo punto della preparazione il docente notato che qua non è come a XXXXX dove il/la XXXXX viene a fare i controlli e a vedere se siamo veramente in aula.\n\nPochi secondi dopo aver iniziato la spiegazione il docente viene chiamato dall'azienda. Finita la telefonata ci dice che -- come lui immaginava sarebbe successo, ma non ha detto niente -- l'azienda gli ha detto che, siccome sarebbero in perdita con così poche persone, il corso l'avremmo fatto in una giornata invece che in due giornate (facendo, effettivamente, solo due terzi delle ore richieste) e quindi o eravamo d'accordo o ce ne andavamo.\n\nOra ancora se faccio polemica devo essere informato, quindi non voglio lamentarmi della durata del corso. Che ne so io che è illegale? Però gli faccio notare che non ho intenzione di dichiarare il falso quindi se devo dichiarare che domani sono lì, allora per me non si fa niente.\n\nMi dice che sarebbe lui a dichiarare il falso, e non io, perché se poi domani faccio una rapina se la prendono con lui.\n\nDico che però io intanto dovrei firmare che domani sono lì quando non ci sarei.\n\nQuindi niente, gli restituisco la ricevuta (o \"ricevuta\"?), mi restituisce tutti i contanti, potrò registrarmi per il prossimo corso. Gli restituisco anche il blocchetto e la penna. Il docente osserva anche che loro non mi hanno chiesto l'acconto e si sono fidati. Considerando il viaggio di andata e ritorno ho perso circa tre ore di tempo.\n\n--\n\n\n\nRiflessioni:\n\n* Forse quando ho restituito la ricevuta (o \"ricevuta\") avrei dovuto farci qualche segno.\n\n* Sarebbe proprio il caso che imparassi come riconoscere una ricevuta da una \"ricevuta\".\n\n* Fare pagamenti non in contanti ha il vantaggio che se mi fanno una ricevuta senza valore posso dimostrare che ho pagato e pretendere una ricevuta vera.\n\n* Non versare l'acconto ha il vantaggio che adesso posso rivolgermi a un'altra azienda per fare questo corso.\n\n* Non posso saperlo, ma immagino che, se voleva che firmassi il registro per domani, probabilmente qualche legge o regolamento gli chiede di fare un tot di ore per darmi quell'attestato. Per me possiamo anche diminuire il numero delle leggi e liberalizzare questo tipo di corsi e attestati, ma finché lo Stato chiede certi standard vanno rispettati. Tra l'altro a XXXXX il/la XXXXX li controlla in aula mentre a quanto pare nella mia città non si aspetta tali controlli.\n\n* Supponendo che ho capito come funziona il corso e l'attestato dal punto di vista normativo, fra l'azienda e i corsisti esiste un certo conflitto d'interesse ai danni dello Stato nel dare questo attestato. Quindi se lo Stato vuole regolamentare questo attestato è importante che controlli che le regole vengano seguite.\n\n* Dal punto di vista di quell'azienda, le cose si devono fare bene. Quindi avrebbero potuto pretendere un acconto a tutti. Oppure se hanno pochi corsisti potrebbero fare i corsi meno spesso. Oppure non facevano il corso finché non avevano un numero di acconti sufficienti a coprire le spese. Il risultato è che io ho perso tempo, e loro hanno perso un corsista, perché se riuscirò mi rivolgerò altrove per avere questo attestato.\n\n* Il docente inizialmente ha detto che sarebbe stato lui a dichiarae il falso e non io, ma in realtà avrei dovuto firmare il registro. Quindi ho dovuto riformulare la mia richiesta di chiarimento per confermare che in effetti mi sarebbe stato richiesto di dichiarare il falso. Non apprezzo quando mi viene detta una cosa al posto di un'altra quasi come se ci fosse un accordo non scritto che se uno è veramente interessato allora deve insistere.\n\n--\n\nEdit: ~~presentati~~ registrati (cioè prenotati)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64py7p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 38, "report_reasons": null, "author": "Not_Relevant_Usernei", "saved": false, "mod_reports": [], "name": "t3_64py7p", "subreddit_name_prefixed": "r/italy", "approved_by": null, "over_18": false, "domain": "self.italy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qkhk", "edited": 1491980521.0, "link_flair_css_class": null, "author_flair_css_class": "piemonte", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/italy/comments/64py7p/stamattina_ho_iniziato_un_corso_e_volevano_farmi/", "num_reports": null, "locked": false, "stickied": false, "created": 1491934226.0, "url": "https://www.reddit.com/r/italy/comments/64py7p/stamattina_ho_iniziato_un_corso_e_volevano_farmi/", "author_flair_text": "", "quarantine": false, "title": "Stamattina ho iniziato un corso e volevano farmi firmare più ore di quelle che avremmo fatto. Me ne sono andato.", "created_utc": 1491905426.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": "", "user_reports": [], "id": "dg5l5dp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Not_Relevant_Usernei", "parent_id": "t1_dg441rn", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Non andrei così sicuro nel seguire quella strategia perché temo di ritrovarmi una denuncia per diffamazione.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Non andrei così sicuro nel seguire quella strategia perché temo di ritrovarmi una denuncia per diffamazione.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg5l5dp", "score_hidden": false, "stickied": false, "created": 1492009108.0, "created_utc": 1491980308.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg441rn", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "panicClark", "parent_id": "t1_dg43tnt", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "&gt; Come faccio a riconoscere una vera ricevuta?\n\nOttima domanda, [sul sito della GdF ci sono un po' di indicazioni su cosa rende una ricevuta \"fiscale\"](http://www.gdf.gov.it/servizi-per-il-cittadino/consigli-utili/scontrini-e-ricevute-fiscali). Mi pare che la marca da bollo non c'entri.\n\n&gt; poi come faccio a dimostrare che mi hanno proposto un prodotto diverso\n\nEcco, questo è il problema di tutti i piccoli abusi che siamo da sempre costretti ad \"abbozzare\" in quanto si sa già che le vie legali sono enormemente più costose del torto subito. Io non ho mai saputo farlo (ma sono un fesso e non fa testo), ho sperimentato però che generalmente l'unica strategia valida è piantare casino e minacciare di far venire le guardie (ed eventualmente farle venire davvero). Un giorno di questi racconterò i motivi più disparati per cui ho visto arrivare i carabinieri quando lavoravo allo sportello di un ufficio pubblico.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Come faccio a riconoscere una vera ricevuta?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ottima domanda, &lt;a href=\"http://www.gdf.gov.it/servizi-per-il-cittadino/consigli-utili/scontrini-e-ricevute-fiscali\"&gt;sul sito della GdF ci sono un po&amp;#39; di indicazioni su cosa rende una ricevuta &amp;quot;fiscale&amp;quot;&lt;/a&gt;. Mi pare che la marca da bollo non c&amp;#39;entri.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;poi come faccio a dimostrare che mi hanno proposto un prodotto diverso&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ecco, questo è il problema di tutti i piccoli abusi che siamo da sempre costretti ad &amp;quot;abbozzare&amp;quot; in quanto si sa già che le vie legali sono enormemente più costose del torto subito. Io non ho mai saputo farlo (ma sono un fesso e non fa testo), ho sperimentato però che generalmente l&amp;#39;unica strategia valida è piantare casino e minacciare di far venire le guardie (ed eventualmente farle venire davvero). Un giorno di questi racconterò i motivi più disparati per cui ho visto arrivare i carabinieri quando lavoravo allo sportello di un ufficio pubblico.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg441rn", "score_hidden": false, "stickied": false, "created": 1491937199.0, "created_utc": 1491908399.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43tnt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Not_Relevant_Usernei", "parent_id": "t1_dg43m53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "&gt; L'uso di rilasciare \"ricevute\" e non vere ricevute è uno dei motivi per cui non uso mai il contante per pagamenti superiori ai 50 euro.\n\nCome faccio a riconoscere una vera ricevuta?\n\n&gt; Peraltro anche se avessero chiesto un acconto, avresti avuto tutto il diritto di chiederlo indietro di fronte alla ridefinizione dell'offerta, visto che sostanzialmente ti hanno proposto un prodotto diverso da quello per cui avevi versato l'acconto.\n\nIl problema è che se non volessero ridarmeli poi come faccio a dimostrare che mi hanno proposto un prodotto diverso? E se anche potessi dimostrarlo non ho molta voglia di andare in tribunale.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;L&amp;#39;uso di rilasciare &amp;quot;ricevute&amp;quot; e non vere ricevute è uno dei motivi per cui non uso mai il contante per pagamenti superiori ai 50 euro.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Come faccio a riconoscere una vera ricevuta?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Peraltro anche se avessero chiesto un acconto, avresti avuto tutto il diritto di chiederlo indietro di fronte alla ridefinizione dell&amp;#39;offerta, visto che sostanzialmente ti hanno proposto un prodotto diverso da quello per cui avevi versato l&amp;#39;acconto.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Il problema è che se non volessero ridarmeli poi come faccio a dimostrare che mi hanno proposto un prodotto diverso? E se anche potessi dimostrarlo non ho molta voglia di andare in tribunale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg43tnt", "score_hidden": false, "stickied": false, "created": 1491936611.0, "created_utc": 1491907811.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43m53", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "panicClark", "parent_id": "t3_64py7p", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "L'uso di rilasciare \"ricevute\" e non vere ricevute è uno dei motivi per cui non uso mai il contante per pagamenti superiori ai 50 euro.\n\nPeraltro anche se avessero chiesto un acconto, avresti avuto tutto il diritto di chiederlo indietro di fronte alla ridefinizione dell'offerta, visto che sostanzialmente ti hanno proposto un prodotto diverso da quello per cui avevi versato l'acconto.\n\nIl fatto che abbiano pochi corsisti è un problema tutto loro. Al limite fai come fanno i tanti peracottari, che ti dicono _prima_ che il corso non si attiverà a meno che non giungano tot iscrizioni, e che in caso di mancata attivazione ti avvertono _prima_ e ti restituiscono l'acconto.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;L&amp;#39;uso di rilasciare &amp;quot;ricevute&amp;quot; e non vere ricevute è uno dei motivi per cui non uso mai il contante per pagamenti superiori ai 50 euro.&lt;/p&gt;\n\n&lt;p&gt;Peraltro anche se avessero chiesto un acconto, avresti avuto tutto il diritto di chiederlo indietro di fronte alla ridefinizione dell&amp;#39;offerta, visto che sostanzialmente ti hanno proposto un prodotto diverso da quello per cui avevi versato l&amp;#39;acconto.&lt;/p&gt;\n\n&lt;p&gt;Il fatto che abbiano pochi corsisti è un problema tutto loro. Al limite fai come fanno i tanti peracottari, che ti dicono &lt;em&gt;prima&lt;/em&gt; che il corso non si attiverà a meno che non giungano tot iscrizioni, e che in caso di mancata attivazione ti avvertono &lt;em&gt;prima&lt;/em&gt; e ti restituiscono l&amp;#39;acconto.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg43m53", "score_hidden": false, "stickied": false, "created": 1491936055.0, "created_utc": 1491907255.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": "", "user_reports": [], "id": "dg5l3rj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Not_Relevant_Usernei", "parent_id": "t1_dg4ju62", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Penso spesso che basterebbe fare le cose bene dall'inizio e si eviterebbero tanti problemi.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Penso spesso che basterebbe fare le cose bene dall&amp;#39;inizio e si eviterebbero tanti problemi.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg5l3rj", "score_hidden": false, "stickied": false, "created": 1492008987.0, "created_utc": 1491980187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ju62", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "EnderStarways", "parent_id": "t3_64py7p", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Hai avuto un comportamento impeccabile. Loro invece hanno avuto una professionalità pari a zero.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hai avuto un comportamento impeccabile. Loro invece hanno avuto una professionalità pari a zero.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg4ju62", "score_hidden": false, "stickied": false, "created": 1491958829.0, "created_utc": 1491930029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": "", "user_reports": [], "id": "dg4cykb", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Lollemberg", "parent_id": "t1_dg46lqx", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Non ho capito perché non hai firmato oggi e fatto la rapina domani", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Non ho capito perché non hai firmato oggi e fatto la rapina domani&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg4cykb", "score_hidden": false, "stickied": false, "created": 1491951237.0, "created_utc": 1491922437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg46lqx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64py7p", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg46lqx", "score_hidden": false, "stickied": false, "created": 1491942583.0, "created_utc": 1491913783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": "", "user_reports": [], "id": "dg4cdm0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ElMetchio", "parent_id": "t1_dg44adv", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "anche io non ho capito cosa intendesse\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;anche io non ho capito cosa intendesse&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg4cdm0", "score_hidden": false, "stickied": false, "created": 1491950567.0, "created_utc": 1491921767.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44adv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Not_Relevant_Usernei", "parent_id": "t1_dg448zi", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Sono molto prudente in questo perché non conosco la normativa che c'è dietro, ma se la pratica è corretta allora perché voleva che gli firmassi più ore di quelle che ho fatto?\n\n&gt; Sarebbe stato molto più grave, a mio avviso, se ti avessero fatto dichiarare che erano state fatte meno ore di quelle dichiarate.\n\nPerché?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sono molto prudente in questo perché non conosco la normativa che c&amp;#39;è dietro, ma se la pratica è corretta allora perché voleva che gli firmassi più ore di quelle che ho fatto?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sarebbe stato molto più grave, a mio avviso, se ti avessero fatto dichiarare che erano state fatte meno ore di quelle dichiarate.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Perché?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg44adv", "score_hidden": false, "stickied": false, "created": 1491937803.0, "created_utc": 1491909003.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": "", "user_reports": [], "id": "dg44jbm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "panicClark", "parent_id": "t1_dg448zi", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "OP non ha dato dettagli sul corso o sul certificato rilasciato, ma non è inverosimile che l'attestato sia collegato alla frequenza di un certo numero di ore obbligatorie.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP non ha dato dettagli sul corso o sul certificato rilasciato, ma non è inverosimile che l&amp;#39;attestato sia collegato alla frequenza di un certo numero di ore obbligatorie.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg44jbm", "score_hidden": false, "stickied": false, "created": 1491938395.0, "created_utc": 1491909595.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg448zi", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "justtosaythis5466", "parent_id": "t3_64py7p", "subreddit_name_prefixed": "r/italy", "controversiality": 1, "body": "Non ho capito se il punto è sapere se una pratica del genere è corretta, però penso che una certa flessibilità sia tollerabile. Le ore di tempo sono stimate sugli argomenti da svolgere, la velocità di apprendimento e contrattempi vari. Sul \"dichiarare il falso\" non sarei così fiscale, è un modo come un altro per venirsi incontro. Sarebbe stato molto più grave, a mio avviso, se ti avessero fatto dichiarare che erano state fatte meno ore di quelle dichiarate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Non ho capito se il punto è sapere se una pratica del genere è corretta, però penso che una certa flessibilità sia tollerabile. Le ore di tempo sono stimate sugli argomenti da svolgere, la velocità di apprendimento e contrattempi vari. Sul &amp;quot;dichiarare il falso&amp;quot; non sarei così fiscale, è un modo come un altro per venirsi incontro. Sarebbe stato molto più grave, a mio avviso, se ti avessero fatto dichiarare che erano state fatte meno ore di quelle dichiarate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg448zi", "score_hidden": false, "stickied": false, "created": 1491937708.0, "created_utc": 1491908908.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_64py7p", "likes": null, "replies": "", "user_reports": [], "id": "dg4nik5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BiscottoneFarcito", "parent_id": "t1_dg43pxf", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Offensivo e sterile il commento sulla tua scrittura. Però devo dire che ho trovato il testo un po prolisso e poco piacevole da leggere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Offensivo e sterile il commento sulla tua scrittura. Però devo dire che ho trovato il testo un po prolisso e poco piacevole da leggere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg4nik5", "score_hidden": false, "stickied": false, "created": 1491962854.0, "created_utc": 1491934054.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43pxf", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Not_Relevant_Usernei", "parent_id": "t1_dg43lt5", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Non ti ho downvotato, sentiti libero di darmi consigli.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Non ti ho downvotato, sentiti libero di darmi consigli.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg43pxf", "score_hidden": false, "stickied": false, "created": 1491936335.0, "created_utc": 1491907535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43lt5", "gilded": 0, "archived": false, "score": -12, "report_reasons": null, "author": "geppebrillo", "parent_id": "t3_64py7p", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "come scrivi male", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;come scrivi male&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg43lt5", "score_hidden": false, "stickied": false, "created": 1491936029.0, "created_utc": 1491907229.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -12}}], "after": null, "before": null}}]