[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "italy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ho già scritto questo post, ma l&amp;#39;app si è buggata e mi tocca riscriverlo.\nSi parla di mia madre, è un problema per tutta la mia famiglia, basta pochissimo di un normale discorso e comincia ad incazzarsi e ad urlare per qualsiasi futile motivo. Quando attacca ad urlare spesso costringe uno ad uno tutti i presenti ad andarsene sfiniti dalla stanza (eh sì, inizia a fare la matta con una persona finché non scappa, poi con un&amp;#39;altra, poi con un&amp;#39;altra), sempre se non rincorre la gente per continuare ad urlargli dietro. Quando si mette ad urlare si basa inizialmente sul discorso da cui è partita, ovviamente ripete tutto quello che è stato detto nella maniera in cui l&amp;#39;ha capito (mai corrispondente al vero, si inventa sempre parti di storie o fraintende il fraintendibile), non conviene correggerla e farle capire che ha frainteso qualcosa (è qui che quasi sempre cerchiamo tutti di scappare al coperto). Non conviene perché se rendi invalidi i suoi argomenti passa a quelli che ha testato nel corso degli anni: Inizia ad elencare difetti, aggiunge insulti (che vengono dal cuore, li dice e li ripete e li pensa davvero), spesso parla di come odia questa famiglia e magari di come ci ucciderebbe tutti per liberarsene. In pratica se la contraddici cambia argomento e continua a dire cose a caso (a caso perché non hanno senso, ma durante questi deliri non è che parla e basta, viene tutto dal cuore e sceglie con precisione le parole più cattive) ma più mirate a ferirti. Io negli anni ho iniziato a parlare con lei il minimo possibile, magari spesso a dirle il possibile per concludere subito il discorso (ovviamente poi questi atteggiamenti a lungo andare mi hanno anche reso la persona di merda che sono). Ultimamente ha iniziato allora a usare come motivo per incazzarsi (ci si impegna proprio, sembra farlo apposta) il fatto che io le parlo poco, vuole e pretende che io mi apra perché magari ogni tanto mi compra qualcosa (me lo rinfaccia sempre, è uno dei suoi argomenti testati). Ogni tanto provo a dirle durante i litigi quello che sbaglia nel rapportarsi con la gente, ma non capisce mai. Anzi, nel casi ne approfitta coi veri e propri momenti di follia, comincia a fare paura, sembra possa ucciderti da un momento all&amp;#39;altro, spesso tira oggetti, rompe cose, si mette a piangere, tira i capelli, picchia (in ogni caso cerca proprio di farti male, ha degli scatti d&amp;#39;ira incontenibili). Rifiuta ogni tipo di critica alla sua persona, ogni colpa. Ad esempio: se io faccio cadere un piatto e lo rompo, inizia a fare tutto quello che ho descritto, se lo rompe lei è un semplice &amp;quot;mannaggia, SI È rotto&amp;quot;. Questi momenti poi non fanno da valvola di sfogo, lei non si sfoga, anzi, diventa sempre più pericolosa, sempre più cattiva. È in grado di far durare un&amp;#39;incazzatura per giorni. Ci sarebbe altro da dire, ma il post è fin troppo lungo. Ci sto chiedendo aiuto, credo che mia madre abbia qualche problema psicologico. A confermarlo, è stata anche anoressica per un periodo, da giovane, ancora ha qualche rimanenza e comunque ha molte paranoia per l&amp;#39;alimentazione (insultare me e mia sorella per la nostra ciccia è anche quello un argomento testato). Se pensate che io sia solo un ragazzino che frigna, per favore ignorate il post e lasciatelo a chi può aiutare.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ho già scritto questo post, ma l'app si è buggata e mi tocca riscriverlo.\nSi parla di mia madre, è un problema per tutta la mia famiglia, basta pochissimo di un normale discorso e comincia ad incazzarsi e ad urlare per qualsiasi futile motivo. Quando attacca ad urlare spesso costringe uno ad uno tutti i presenti ad andarsene sfiniti dalla stanza (eh sì, inizia a fare la matta con una persona finché non scappa, poi con un'altra, poi con un'altra), sempre se non rincorre la gente per continuare ad urlargli dietro. Quando si mette ad urlare si basa inizialmente sul discorso da cui è partita, ovviamente ripete tutto quello che è stato detto nella maniera in cui l'ha capito (mai corrispondente al vero, si inventa sempre parti di storie o fraintende il fraintendibile), non conviene correggerla e farle capire che ha frainteso qualcosa (è qui che quasi sempre cerchiamo tutti di scappare al coperto). Non conviene perché se rendi invalidi i suoi argomenti passa a quelli che ha testato nel corso degli anni: Inizia ad elencare difetti, aggiunge insulti (che vengono dal cuore, li dice e li ripete e li pensa davvero), spesso parla di come odia questa famiglia e magari di come ci ucciderebbe tutti per liberarsene. In pratica se la contraddici cambia argomento e continua a dire cose a caso (a caso perché non hanno senso, ma durante questi deliri non è che parla e basta, viene tutto dal cuore e sceglie con precisione le parole più cattive) ma più mirate a ferirti. Io negli anni ho iniziato a parlare con lei il minimo possibile, magari spesso a dirle il possibile per concludere subito il discorso (ovviamente poi questi atteggiamenti a lungo andare mi hanno anche reso la persona di merda che sono). Ultimamente ha iniziato allora a usare come motivo per incazzarsi (ci si impegna proprio, sembra farlo apposta) il fatto che io le parlo poco, vuole e pretende che io mi apra perché magari ogni tanto mi compra qualcosa (me lo rinfaccia sempre, è uno dei suoi argomenti testati). Ogni tanto provo a dirle durante i litigi quello che sbaglia nel rapportarsi con la gente, ma non capisce mai. Anzi, nel casi ne approfitta coi veri e propri momenti di follia, comincia a fare paura, sembra possa ucciderti da un momento all'altro, spesso tira oggetti, rompe cose, si mette a piangere, tira i capelli, picchia (in ogni caso cerca proprio di farti male, ha degli scatti d'ira incontenibili). Rifiuta ogni tipo di critica alla sua persona, ogni colpa. Ad esempio: se io faccio cadere un piatto e lo rompo, inizia a fare tutto quello che ho descritto, se lo rompe lei è un semplice \"mannaggia, SI È rotto\". Questi momenti poi non fanno da valvola di sfogo, lei non si sfoga, anzi, diventa sempre più pericolosa, sempre più cattiva. È in grado di far durare un'incazzatura per giorni. Ci sarebbe altro da dire, ma il post è fin troppo lungo. Ci sto chiedendo aiuto, credo che mia madre abbia qualche problema psicologico. A confermarlo, è stata anche anoressica per un periodo, da giovane, ancora ha qualche rimanenza e comunque ha molte paranoia per l'alimentazione (insultare me e mia sorella per la nostra ciccia è anche quello un argomento testato). Se pensate che io sia solo un ragazzino che frigna, per favore ignorate il post e lasciatelo a chi può aiutare.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650v53", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "XLNBot", "saved": false, "mod_reports": [], "name": "t3_650v53", "subreddit_name_prefixed": "r/italy", "approved_by": null, "over_18": false, "domain": "self.italy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qkhk", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/italy/comments/650v53/probabilmente_non_leggerà_nessuno_ma_voglio/", "num_reports": null, "locked": false, "stickied": false, "created": 1492058535.0, "url": "https://www.reddit.com/r/italy/comments/650v53/probabilmente_non_leggerà_nessuno_ma_voglio/", "author_flair_text": null, "quarantine": false, "title": "Probabilmente non leggerà nessuno ma voglio sfogarmi", "created_utc": 1492029735.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 24, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg6woo1", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "DharmaBird", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Fare finta di nulla non è un'opzione. Avete a casa una persona con problemi psichiatrici (non psicologici: è diverso). Fareste finta di nulla se uno di voi avesse una malattia infettiva, un'intossicazione acuta, una gamba fratturata? Ecco, è un problema di salute serio quello che tuo padre sta ignorando, a spese di tutta la famiglia. Chiedi aiuto.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fare finta di nulla non è un&amp;#39;opzione. Avete a casa una persona con problemi psichiatrici (non psicologici: è diverso). Fareste finta di nulla se uno di voi avesse una malattia infettiva, un&amp;#39;intossicazione acuta, una gamba fratturata? Ecco, è un problema di salute serio quello che tuo padre sta ignorando, a spese di tutta la famiglia. Chiedi aiuto.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg6woo1", "score_hidden": false, "stickied": false, "created": 1492075123.0, "created_utc": 1492046323.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg6kedv", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "fbWright", "parent_id": "t1_dg6k11i", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Mi dispiace, ma tuo padre è un coglione. Tenere insieme una famiglia a costo di traumatizzarla è da coglioni. Tentare di comprendere è un conto; accettare passivamente violenze ed abusi un altro. Un malato di Alzheimer pericoloso per gli altri non è trattato male, ma gli viene comunque impedito di nuocere.\n\nNel frattempo vai a parlarne con uno psicologo, se disponibile attraverso la scuola, o con qualcuno in un consultorio. Ma non sarà questo a risolvere il problema, e ti prego - se ti dovessi trovare in pericolo, non ti fare pare riguardo \"è mia madre\", o \"sto disgregando la famiglia\", o \"è malata\": la tua sicurezza, e quella di chi sta intorno, viene prima di tutto.\n\nAnzi, è possibile che lei abbia qualche tipo di problema \"facilmente\" trattabile, e rimanere in queste condizioni non giova a nessuno.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mi dispiace, ma tuo padre è un coglione. Tenere insieme una famiglia a costo di traumatizzarla è da coglioni. Tentare di comprendere è un conto; accettare passivamente violenze ed abusi un altro. Un malato di Alzheimer pericoloso per gli altri non è trattato male, ma gli viene comunque impedito di nuocere.&lt;/p&gt;\n\n&lt;p&gt;Nel frattempo vai a parlarne con uno psicologo, se disponibile attraverso la scuola, o con qualcuno in un consultorio. Ma non sarà questo a risolvere il problema, e ti prego - se ti dovessi trovare in pericolo, non ti fare pare riguardo &amp;quot;è mia madre&amp;quot;, o &amp;quot;sto disgregando la famiglia&amp;quot;, o &amp;quot;è malata&amp;quot;: la tua sicurezza, e quella di chi sta intorno, viene prima di tutto.&lt;/p&gt;\n\n&lt;p&gt;Anzi, è possibile che lei abbia qualche tipo di problema &amp;quot;facilmente&amp;quot; trattabile, e rimanere in queste condizioni non giova a nessuno.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg6kedv", "score_hidden": false, "stickied": false, "created": 1492060144.0, "created_utc": 1492031344.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg6nu2v", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "TheSandaman69", "parent_id": "t1_dg6k11i", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "&gt; mio padre non vuole che la famiglia si disgreghi per evitare tutti i problemi che sorgerebbero dopo (probabilmente sono anche meno brutti che sopportare finché posso)\n\nPurtroppo penso che tu abbia centrato il problema;  per quanto la disgregazione della famiglia possa essere brutta, crescere in un ambiente così disfunzionale è sicuramente peggio per te che una strada di vita dovrai creartela.\n\nSei minorenne, se la situazione è insostenibile vai in un consultorio ASL e parla di questi abusi con qualcuno che possa aiutarti;  più che risolvere i suoi problemi devi pensare a te e a subire meno danni possibili dalla vicenda.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;mio padre non vuole che la famiglia si disgreghi per evitare tutti i problemi che sorgerebbero dopo (probabilmente sono anche meno brutti che sopportare finché posso)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Purtroppo penso che tu abbia centrato il problema;  per quanto la disgregazione della famiglia possa essere brutta, crescere in un ambiente così disfunzionale è sicuramente peggio per te che una strada di vita dovrai creartela.&lt;/p&gt;\n\n&lt;p&gt;Sei minorenne, se la situazione è insostenibile vai in un consultorio ASL e parla di questi abusi con qualcuno che possa aiutarti;  più che risolvere i suoi problemi devi pensare a te e a subire meno danni possibili dalla vicenda.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg6nu2v", "score_hidden": false, "stickied": false, "created": 1492064263.0, "created_utc": 1492035463.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7bkwu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "srandtimenull", "parent_id": "t1_dg6k11i", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "&gt; mio padre non vuole che la famiglia si disgreghi per evitare tutti i problemi che sorgerebbero dopo (probabilmente sono anche meno brutti che sopportare finché posso)\n\nIl problema è che è il **non intervento che farà disgregare la famiglia**. Non oggi, non domani, magari tra mesi, magari tra anni.\n\nTi parlo per esperienza diretta. Se con mia madre si fosse intervenuti anche solo qualche anno prima, la mia famiglia sarebbe in uno stato completamente diverso. \n\nChiedete aiuto, subito. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;mio padre non vuole che la famiglia si disgreghi per evitare tutti i problemi che sorgerebbero dopo (probabilmente sono anche meno brutti che sopportare finché posso)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Il problema è che è il &lt;strong&gt;non intervento che farà disgregare la famiglia&lt;/strong&gt;. Non oggi, non domani, magari tra mesi, magari tra anni.&lt;/p&gt;\n\n&lt;p&gt;Ti parlo per esperienza diretta. Se con mia madre si fosse intervenuti anche solo qualche anno prima, la mia famiglia sarebbe in uno stato completamente diverso. &lt;/p&gt;\n\n&lt;p&gt;Chiedete aiuto, subito. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7bkwu", "score_hidden": false, "stickied": false, "created": 1492101411.0, "created_utc": 1492072611.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7hqq2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Spaturno", "parent_id": "t1_dg6k11i", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "&gt; Mi dispiace, ma tuo padre è un coglione.\n\nConcordo con /u/fbWright. Quello che disgrega la famiglia è farvi sopportare sta cosa ogni giorno.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Mi dispiace, ma tuo padre è un coglione.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Concordo con &lt;a href=\"/u/fbWright\"&gt;/u/fbWright&lt;/a&gt;. Quello che disgrega la famiglia è farvi sopportare sta cosa ogni giorno.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7hqq2", "score_hidden": false, "stickied": false, "created": 1492116561.0, "created_utc": 1492087761.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7bdwg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CalamaroJoe", "parent_id": "t1_dg6k11i", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Scusa, solo un'appunto: non è mica obbligatorio che la famiglia si disgreghi. Tua madre deve accettare di farsi aiutare e curare.\nAl limite è l'opposto: è più facile che la famiglia si disgreghi se le cose vanno avanti così.\n\nNon dico altro, perché la tua situazione mi ricorda quella in cui vivo e non riesco a commentare.\nComunque i commenti di u/SheIsHanna e u/capitanomifune sotto sono oro.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Scusa, solo un&amp;#39;appunto: non è mica obbligatorio che la famiglia si disgreghi. Tua madre deve accettare di farsi aiutare e curare.\nAl limite è l&amp;#39;opposto: è più facile che la famiglia si disgreghi se le cose vanno avanti così.&lt;/p&gt;\n\n&lt;p&gt;Non dico altro, perché la tua situazione mi ricorda quella in cui vivo e non riesco a commentare.\nComunque i commenti di &lt;a href=\"/u/SheIsHanna\"&gt;u/SheIsHanna&lt;/a&gt; e &lt;a href=\"/u/capitanomifune\"&gt;u/capitanomifune&lt;/a&gt; sotto sono oro.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7bdwg", "score_hidden": false, "stickied": false, "created": 1492100824.0, "created_utc": 1492072024.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6k11i", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "XLNBot", "parent_id": "t1_dg6jiy3", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Io sono l'unico minorenne. Probabilmente andrò prima o poi a parlare con uno di quegli psicologi per gli studenti. Provvedimenti seri sono fuori discussione, mio padre non vuole che la famiglia si disgreghi per evitare tutti i problemi che sorgerebbero dopo (probabilmente sono anche meno brutti che sopportare finché posso). Mio padre si comporta piuttosto stranamente riguardo a questa situazione. Lui non vuole problemi e basta, pure lui nei 25 anni di matrimonio con lei ha imparato a sopportarla e a lasciarla perdere dove deve. Sembra sforzarsi di comprenderla nella maniera in cui farei tipo io quando ho a che fare con un malato di alzheimer. Non so se mi spiego", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Io sono l&amp;#39;unico minorenne. Probabilmente andrò prima o poi a parlare con uno di quegli psicologi per gli studenti. Provvedimenti seri sono fuori discussione, mio padre non vuole che la famiglia si disgreghi per evitare tutti i problemi che sorgerebbero dopo (probabilmente sono anche meno brutti che sopportare finché posso). Mio padre si comporta piuttosto stranamente riguardo a questa situazione. Lui non vuole problemi e basta, pure lui nei 25 anni di matrimonio con lei ha imparato a sopportarla e a lasciarla perdere dove deve. Sembra sforzarsi di comprenderla nella maniera in cui farei tipo io quando ho a che fare con un malato di alzheimer. Non so se mi spiego&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg6k11i", "score_hidden": false, "stickied": false, "created": 1492059718.0, "created_utc": 1492030918.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jiy3", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "fbWright", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Sì, lei ha bisogno di uno psicologo, e voi avete bisogno di scappare di lì. Quelli che commette sono abusi, e conterebbero probabilmente come crimini (lanciare oggetti, tirare i capelli); non ho idea se le punizioni corporali siano ancora permesse o se tu sia minorenne, ma dubito che un eventuale giudice vedrebbe la cosa di buon occhio.\n\nQuanti anni hai, OP? Quanti tua sorella? Gli altri familiari, se ci sono, cosa stanno facendo?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sì, lei ha bisogno di uno psicologo, e voi avete bisogno di scappare di lì. Quelli che commette sono abusi, e conterebbero probabilmente come crimini (lanciare oggetti, tirare i capelli); non ho idea se le punizioni corporali siano ancora permesse o se tu sia minorenne, ma dubito che un eventuale giudice vedrebbe la cosa di buon occhio.&lt;/p&gt;\n\n&lt;p&gt;Quanti anni hai, OP? Quanti tua sorella? Gli altri familiari, se ci sono, cosa stanno facendo?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg6jiy3", "score_hidden": false, "stickied": false, "created": 1492059164.0, "created_utc": 1492030364.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg77wqq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "IsabellaEste", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Rivolgetevi a dei medici per l'amor di dio. Una madre che afferma di essere disposta ad uccidere la famiglia non sta chiaramente bene. Tuo padre non vuole per non disgregare la famiglia? Fallo tu, anche se sei minorenne ci sarà qualcuno che potrà darti ascolto. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rivolgetevi a dei medici per l&amp;#39;amor di dio. Una madre che afferma di essere disposta ad uccidere la famiglia non sta chiaramente bene. Tuo padre non vuole per non disgregare la famiglia? Fallo tu, anche se sei minorenne ci sarà qualcuno che potrà darti ascolto. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg77wqq", "score_hidden": false, "stickied": false, "created": 1492091617.0, "created_utc": 1492062817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg6jcq6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "not-much", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Nessun consiglio da dare sorry. Pero mi hai fatto tornare in mente anni fa che per un breve periodo avevo frequentato una ragazza e ci stavo discretamente bene, poi il rapporto si è fatto più serio e lei ha mostrato anche il dark side. Era, in piccolo, come descrivi tua mamma.\n\nSon scappato a gambe levate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nessun consiglio da dare sorry. Pero mi hai fatto tornare in mente anni fa che per un breve periodo avevo frequentato una ragazza e ci stavo discretamente bene, poi il rapporto si è fatto più serio e lei ha mostrato anche il dark side. Era, in piccolo, come descrivi tua mamma.&lt;/p&gt;\n\n&lt;p&gt;Son scappato a gambe levate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg6jcq6", "score_hidden": false, "stickied": false, "created": 1492058978.0, "created_utc": 1492030178.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg75a6x", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Riverbero19", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Per un attimo ho pensato che mia sorella scrivesse qui.\n\nMia madre è simile alla tua. \nIo sono un tipo calmissimo, solo mia madre riesce a farmi perdere la pazienza. Una volta, anni fa, tornò a casa, trovò la lavastoviglie ancora da caricare, e inizio a urlare, solitamente va avanti 20-30 minuti, a più riprese, e come la tua parte dall'evento scatenante e passa ad ogni altra cosa.\n\nTanto per farvi capire, persino a mia sorella minore fa perdere la pazienza, qualche mese fa dopo un po' che le urlava addosso mia sorella ha iniziato a risponderle e a un certo punto si è alzata e le ha tirato uno schiaffo (poi se ne è beccati 3-4 di fila).\n\nah, sia chiaro, io non le ho mai messo le mani addosso, anche quando perdo la pazienza mi limito a prenderle per le braccia, farla sedere e dirle di starsene zitta\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Per un attimo ho pensato che mia sorella scrivesse qui.&lt;/p&gt;\n\n&lt;p&gt;Mia madre è simile alla tua. \nIo sono un tipo calmissimo, solo mia madre riesce a farmi perdere la pazienza. Una volta, anni fa, tornò a casa, trovò la lavastoviglie ancora da caricare, e inizio a urlare, solitamente va avanti 20-30 minuti, a più riprese, e come la tua parte dall&amp;#39;evento scatenante e passa ad ogni altra cosa.&lt;/p&gt;\n\n&lt;p&gt;Tanto per farvi capire, persino a mia sorella minore fa perdere la pazienza, qualche mese fa dopo un po&amp;#39; che le urlava addosso mia sorella ha iniziato a risponderle e a un certo punto si è alzata e le ha tirato uno schiaffo (poi se ne è beccati 3-4 di fila).&lt;/p&gt;\n\n&lt;p&gt;ah, sia chiaro, io non le ho mai messo le mani addosso, anche quando perdo la pazienza mi limito a prenderle per le braccia, farla sedere e dirle di starsene zitta&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg75a6x", "score_hidden": false, "stickied": false, "created": 1492086724.0, "created_utc": 1492057924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg78wpx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "EigengrauDildos", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Tua madre ha più problemi di un libro di matematica. Ha urgente bisogno di uno psichiatra e tu hai urgente bisogno di scappartene da quella casa (magari da dei parenti, se vivono vicino?) Mi dispiace molto per quello che stai passando, cerca davvero di allontanarti.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tua madre ha più problemi di un libro di matematica. Ha urgente bisogno di uno psichiatra e tu hai urgente bisogno di scappartene da quella casa (magari da dei parenti, se vivono vicino?) Mi dispiace molto per quello che stai passando, cerca davvero di allontanarti.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg78wpx", "score_hidden": false, "stickied": false, "created": 1492093962.0, "created_utc": 1492065162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7ed1h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SheIsHanna", "parent_id": "t1_dg7d52t", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Io non conosco esattamente la situazione familiare di OP, ma il TSO è comunque un'opzione estrema e non la via più semplice! Non ho fortunatamente esperienze dirette, ma ad amici è capitato e non è stata una passeggiata, tutt'altro!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Io non conosco esattamente la situazione familiare di OP, ma il TSO è comunque un&amp;#39;opzione estrema e non la via più semplice! Non ho fortunatamente esperienze dirette, ma ad amici è capitato e non è stata una passeggiata, tutt&amp;#39;altro!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7ed1h", "score_hidden": false, "stickied": false, "created": 1492109747.0, "created_utc": 1492080947.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d52t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg790qj", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Probabilmente l'unico modo per forzare la cosa potrebbe essere chiamare la polizia nel momento dello sclero violento, in modo tale che l'opzione TSO sia fattibile. Attenzione, non vuole essere un consiglio, è solo un mio ragionamento scritto. Putroppo il problema a monte di questi problemi è che le persone affette non sono coscienti della situazione o non vogliono affrontare un percorso (faticosissimo) di cura.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probabilmente l&amp;#39;unico modo per forzare la cosa potrebbe essere chiamare la polizia nel momento dello sclero violento, in modo tale che l&amp;#39;opzione TSO sia fattibile. Attenzione, non vuole essere un consiglio, è solo un mio ragionamento scritto. Putroppo il problema a monte di questi problemi è che le persone affette non sono coscienti della situazione o non vogliono affrontare un percorso (faticosissimo) di cura.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7d52t", "score_hidden": false, "stickied": false, "created": 1492106208.0, "created_utc": 1492077408.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg790qj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SheIsHanna", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Rivolgersi a dei medici potrebbe essere una soluzione, tuttavia se tua madre non prende coscienza di questo suo problema non puoi obbligarla a farsi seguire da uno specialista, a meno di un TSO.\nSe tu sei minorenne e tuo padre non agisce in questo senso non credo riuscirai a risolvere la situazione in questo modo.\nPotresti provare a scriverle una lettera, in cui le spieghi tutto ciò che hai scritto qui e come ti fa sentire: può essere utile ad aprire un dialogo, ma in questo caso fai lo sforzo di non usare toni accusatori e di spiegare bene i tuoi sentimenti. La lettera è il primo passo, sicuramente non risolutivo, ma utile ad aprire un canale di comunicazione da cui partire per risolvere i suoi problemi. Attenzione anche a non dare per scontato le sue di emozioni: magari tua madre dà in escandescenza per un piatto rotto perché ci vede poca attenzione da parte tua, ad esempio. Ricorda che la comunicazione è a due vie e risolvere problemi del genere richiede comunque fatica e impegno.\nNel caso in cui non riusciate a trovare una soluzione a questi suoi comportamenti, il consiglio che ti do è quello di imparare a farti scivolare addosso quello che ti dice. Anche questa non è una cosa semplice, ma se sei già consapevole che alcuni tuoi comportamenti derivano da questa situazione non continuare a farti influenzare, prendine coscienza e agisci di conseguenza. Staccarsi da un genitore non è mai semplice, ma se è l'unica soluzione allo stare bene è a volte necessario. Anche in questo caso potrebbe trattarsi di un processo lungo e faticoso.\nBuona fortuna :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rivolgersi a dei medici potrebbe essere una soluzione, tuttavia se tua madre non prende coscienza di questo suo problema non puoi obbligarla a farsi seguire da uno specialista, a meno di un TSO.\nSe tu sei minorenne e tuo padre non agisce in questo senso non credo riuscirai a risolvere la situazione in questo modo.\nPotresti provare a scriverle una lettera, in cui le spieghi tutto ciò che hai scritto qui e come ti fa sentire: può essere utile ad aprire un dialogo, ma in questo caso fai lo sforzo di non usare toni accusatori e di spiegare bene i tuoi sentimenti. La lettera è il primo passo, sicuramente non risolutivo, ma utile ad aprire un canale di comunicazione da cui partire per risolvere i suoi problemi. Attenzione anche a non dare per scontato le sue di emozioni: magari tua madre dà in escandescenza per un piatto rotto perché ci vede poca attenzione da parte tua, ad esempio. Ricorda che la comunicazione è a due vie e risolvere problemi del genere richiede comunque fatica e impegno.\nNel caso in cui non riusciate a trovare una soluzione a questi suoi comportamenti, il consiglio che ti do è quello di imparare a farti scivolare addosso quello che ti dice. Anche questa non è una cosa semplice, ma se sei già consapevole che alcuni tuoi comportamenti derivano da questa situazione non continuare a farti influenzare, prendine coscienza e agisci di conseguenza. Staccarsi da un genitore non è mai semplice, ma se è l&amp;#39;unica soluzione allo stare bene è a volte necessario. Anche in questo caso potrebbe trattarsi di un processo lungo e faticoso.\nBuona fortuna :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg790qj", "score_hidden": false, "stickied": false, "created": 1492094249.0, "created_utc": 1492065449.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7cf2w", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "derperio", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Sia mia moglie sia mia madre sono cresciute in famiglie così, in entrambi i casi con madri abusive e narcisiste. Si portano ancora i problemi causati dal crescere in una situazione del genere, nonostante siano riuscite ad avere vite abbastanza normali. L'unico consiglio che posso dare è di andare via al più presto e chiudere totalmente i contatti, perché da solo questo problema non si risolve. Guarda anche qui per conoscere storie simili: https://www.reddit.com/r/raisedbynarcissists/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sia mia moglie sia mia madre sono cresciute in famiglie così, in entrambi i casi con madri abusive e narcisiste. Si portano ancora i problemi causati dal crescere in una situazione del genere, nonostante siano riuscite ad avere vite abbastanza normali. L&amp;#39;unico consiglio che posso dare è di andare via al più presto e chiudere totalmente i contatti, perché da solo questo problema non si risolve. Guarda anche qui per conoscere storie simili: &lt;a href=\"https://www.reddit.com/r/raisedbynarcissists/\"&gt;https://www.reddit.com/r/raisedbynarcissists/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7cf2w", "score_hidden": false, "stickied": false, "created": 1492103989.0, "created_utc": 1492075189.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg791ho", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "capitanomifune", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Mi domando se lei si renda conto della situazione, delle reazioni che ha, perché nel caso non se ne rendesse conto il primo passo per risolvere un problema è rendersi conto di averne uno.\nPotrei consigliarti di registrarla ed in un momento di calma in casa farle riascoltare/rivedere l'episodio, potrebbe stimolarla a consultare uno psicologo/psichiatra.\nCapisco la tua urgenza di fuggire da questa situazione ma anche lasciarla completamente sola non credo sarebbe una buona mossa.\n\nIn bocca al lupo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mi domando se lei si renda conto della situazione, delle reazioni che ha, perché nel caso non se ne rendesse conto il primo passo per risolvere un problema è rendersi conto di averne uno.\nPotrei consigliarti di registrarla ed in un momento di calma in casa farle riascoltare/rivedere l&amp;#39;episodio, potrebbe stimolarla a consultare uno psicologo/psichiatra.\nCapisco la tua urgenza di fuggire da questa situazione ma anche lasciarla completamente sola non credo sarebbe una buona mossa.&lt;/p&gt;\n\n&lt;p&gt;In bocca al lupo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg791ho", "score_hidden": false, "stickied": false, "created": 1492094303.0, "created_utc": 1492065503.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7a43r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nic0nic", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Altro che ragazzino che frigna, sti qua son cazzi. Pensa che situazioni simili, ma con ordine di grandezza minore capitano a me con la mia compagna: per fortuna, piano piano, riesco a influenzarla e capisce (con moolto tempo e molte battaglie).\n\nAd ogni modo, mi spiace tanto per te fratello. Di positivo c'è che non è tua moglie con figli, ergo non sei costretto a restarci insieme per sempre: tra un po' te ne andrai di casa e ti farai la tua vita.\n\nIl resto sta già negli altri commenti. Tieni duro, un sentito abbraccio", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Altro che ragazzino che frigna, sti qua son cazzi. Pensa che situazioni simili, ma con ordine di grandezza minore capitano a me con la mia compagna: per fortuna, piano piano, riesco a influenzarla e capisce (con moolto tempo e molte battaglie).&lt;/p&gt;\n\n&lt;p&gt;Ad ogni modo, mi spiace tanto per te fratello. Di positivo c&amp;#39;è che non è tua moglie con figli, ergo non sei costretto a restarci insieme per sempre: tra un po&amp;#39; te ne andrai di casa e ti farai la tua vita.&lt;/p&gt;\n\n&lt;p&gt;Il resto sta già negli altri commenti. Tieni duro, un sentito abbraccio&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7a43r", "score_hidden": false, "stickied": false, "created": 1492097150.0, "created_utc": 1492068350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7aey7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mccplusplus", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Chiama il suo medico e digli che tua madre necessita di un TSO per motivi psichiatrici e spiegagli la situazione. Fallo presente anche al sindaco che è l'autorità sanitaria comunale responsabile nell'emettere un TSO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chiama il suo medico e digli che tua madre necessita di un TSO per motivi psichiatrici e spiegagli la situazione. Fallo presente anche al sindaco che è l&amp;#39;autorità sanitaria comunale responsabile nell&amp;#39;emettere un TSO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7aey7", "score_hidden": false, "stickied": false, "created": 1492097991.0, "created_utc": 1492069191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7covz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Matagyah", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "TSO", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TSO&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7covz", "score_hidden": false, "stickied": false, "created": 1492104824.0, "created_utc": 1492076024.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7959d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iosonoxenu", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Va avanti da molto? A me è successa una cosa simile ed è finita parecchio male. A distanza di 2 anni stiamo ancora raccogliendo i cocci. Dovresti chiedere aiuto. Puoi provare ad un consultorio . Ci vuole culo a trovare la persona giusta e questo non dipende da quanto paghi", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Va avanti da molto? A me è successa una cosa simile ed è finita parecchio male. A distanza di 2 anni stiamo ancora raccogliendo i cocci. Dovresti chiedere aiuto. Puoi provare ad un consultorio . Ci vuole culo a trovare la persona giusta e questo non dipende da quanto paghi&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7959d", "score_hidden": false, "stickied": false, "created": 1492094566.0, "created_utc": 1492065766.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7bwvj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "th4", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Ho entrambi i genitori che hanno avuto problemi psichiatrici e capisco quanto sia difficile e sfiancante convivere con una cosa del genere. Purtroppo non c'è una soluzione facile, né rapida.\n\nTuo padre è il punto cardine di qualsiasi azione. Devi parlare con tua sorella, e poi entrambi con lui riguardo lo stato in cui verte tua madre. Probabilmente lui ha razionalizzato la cosa, e come la storia della rana nell'acqua bollente non si è accorto che tratti della personalità di tua madre che probabilmente ha sempre avuto si sono tramutati lentamente in un quadro che ormai è fuori norma, ma che lui vive ancora come naturale e per quieto vivere decide di sopportare senza far niente.\n\nSta a voi convincerlo che c'è qualcosa di serio che necessita di un intervento, e starà poi a lui parlare con tua madre per iniziare un percorso di aiuto. Sarà ahimé una strada in salita, piena di ostacoli sia nel pubblico che nel privato, una strada in cui fondamentalmente vi sentirete soli e abbandonati a voi stessi, quindi cercate di rimanere uniti e parlate spesso, cercate ognuno di alleggerire il carico degli altri, creando le circostanze per le quali sia possibile a turno tirare una boccata d'aria fresca e ricaricarsi. \n\nIn bocca al lupo!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ho entrambi i genitori che hanno avuto problemi psichiatrici e capisco quanto sia difficile e sfiancante convivere con una cosa del genere. Purtroppo non c&amp;#39;è una soluzione facile, né rapida.&lt;/p&gt;\n\n&lt;p&gt;Tuo padre è il punto cardine di qualsiasi azione. Devi parlare con tua sorella, e poi entrambi con lui riguardo lo stato in cui verte tua madre. Probabilmente lui ha razionalizzato la cosa, e come la storia della rana nell&amp;#39;acqua bollente non si è accorto che tratti della personalità di tua madre che probabilmente ha sempre avuto si sono tramutati lentamente in un quadro che ormai è fuori norma, ma che lui vive ancora come naturale e per quieto vivere decide di sopportare senza far niente.&lt;/p&gt;\n\n&lt;p&gt;Sta a voi convincerlo che c&amp;#39;è qualcosa di serio che necessita di un intervento, e starà poi a lui parlare con tua madre per iniziare un percorso di aiuto. Sarà ahimé una strada in salita, piena di ostacoli sia nel pubblico che nel privato, una strada in cui fondamentalmente vi sentirete soli e abbandonati a voi stessi, quindi cercate di rimanere uniti e parlate spesso, cercate ognuno di alleggerire il carico degli altri, creando le circostanze per le quali sia possibile a turno tirare una boccata d&amp;#39;aria fresca e ricaricarsi. &lt;/p&gt;\n\n&lt;p&gt;In bocca al lupo!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7bwvj", "score_hidden": false, "stickied": false, "created": 1492102430.0, "created_utc": 1492073630.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7h2k9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chronowheel983", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "cerca aiuto principalmente per te. anni di abusi non possono tirare fuori una personalità stabile: ne va del tuo futuro (e delle tue relazioni interpersonali). come detto, vai in un consultorio, vai da uno psicologo, chiedi aiuto. non so se sia possibile fare qualcosa per lei, ma puoi fare qualcosa per come tu ti approcci a lei. in bocca al lupo", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;cerca aiuto principalmente per te. anni di abusi non possono tirare fuori una personalità stabile: ne va del tuo futuro (e delle tue relazioni interpersonali). come detto, vai in un consultorio, vai da uno psicologo, chiedi aiuto. non so se sia possibile fare qualcosa per lei, ma puoi fare qualcosa per come tu ti approcci a lei. in bocca al lupo&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7h2k9", "score_hidden": false, "stickied": false, "created": 1492115469.0, "created_utc": 1492086669.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkhk", "removal_reason": null, "link_id": "t3_650v53", "likes": null, "replies": "", "user_reports": [], "id": "dg7a2gu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Modena89", "parent_id": "t3_650v53", "subreddit_name_prefixed": "r/italy", "controversiality": 0, "body": "Mettile la paroxetina nel caffè della mattina \n\nSeriamente ha bisogno di psicofarmaci, quindi dì a tuo padre che la porti da un bravo psichiatra. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mettile la paroxetina nel caffè della mattina &lt;/p&gt;\n\n&lt;p&gt;Seriamente ha bisogno di psicofarmaci, quindi dì a tuo padre che la porti da un bravo psichiatra. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "italy", "name": "t1_dg7a2gu", "score_hidden": false, "stickied": false, "created": 1492097021.0, "created_utc": 1492068221.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]