[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "summonerschool", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;How Tilt Forms&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The essence of tilt is the desire for control. Frustration is fundamentally defined by the anger felt towards a situation that you don&amp;#39;t have any direct control over. League of Legends is a punishing game. One mistake, if not properly adapted to, can throw entire games or set the chain of events that lead up to a loss. &lt;/p&gt;\n\n&lt;p&gt;Example: Your Lux midlane feeds Zed 4 kills by the 10 minute mark. Objectively this is terrible for the game, since Zed is a snowballing champion and with his new gold income (assuming CS is similar) he has a ton of opportunities to influence the game that were previously not open to him. With more gold, he has more items, and with more items he becomes more effective at killing champions. You are the botlane ADC, immobile and for the most part positioned in a way that someone might normally be positioned in a lane. You have vision of the river bush, but you get pushed in by the enemy. Zed comes down to tribush, ults you, and kills you while you&amp;#39;re under tower. There is no counterplay. &lt;/p&gt;\n\n&lt;p&gt;To most higher tier players there are some obvious metagame counter-plays you could take advantage of such as saving your flash, keeping tribush warded, or even playing a more compatible bot lane that would more easily survive a Zed dive. But what opportunities you do have are unimportant for the sake of the analogy.&lt;/p&gt;\n\n&lt;p&gt;The core reason why this is an important example is because afterwards, the hypothetical ADC is tilted. Not because there truly was nothing that they could&amp;#39;ve done, but in their scope of awareness they didn&amp;#39;t see anything that they could&amp;#39;ve done to prevent their situation or properly cope with it. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ineffective Coping&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Frustration and tilt is inherently tied to a perceived lack of control. Lack of control when you are trying to achieve a goal leads to stress. Regardless of whether there was an actual, realistic opportunity for you to take advantage of, if you don&amp;#39;t have the knowledge or awareness to properly &lt;em&gt;know&lt;/em&gt; that and use it, you will feel like you are at a loss.&lt;/p&gt;\n\n&lt;p&gt;Stress and lack of control leads to defense mechanisms. Because their goal is threatened, they naturally look for a way to explain, blame, or deny the stressful nature of the experience. This takes form in different ways, such as:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Blaming support for not warding&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Blaming the midlane for feeding&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Excusing the event as not a big deal with statements like &amp;quot;It&amp;#39;s okay, we have late game&amp;quot; (regardless of the truth of that statement)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Denying that there&amp;#39;s any reason to be upset, minimizing the impact that the stressful event had on the game&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;We&amp;#39;ve all done it if we&amp;#39;re human, whether it&amp;#39;s in or outside of League or even competitive games in general. If there is room for stress, there&amp;#39;s room for a defense mechanism, especially if blame and contempt are directed at you from your teammates or even those around you in real life. &lt;/p&gt;\n\n&lt;p&gt;However, these defense mechanisms are ineffective at properly coping with the problems that a League game brings. Unless you are Challenger on a good day, there is likely an opportunity that you might not have taken advantage of due to whatever circumstance. This circumstance is what differentiates Bronze from Challenger. Upper-tier players have explored the metagame and what real control they have in a number of game circumstances, which they&amp;#39;ve memorized and stored for future reference by experience. This is game sense. &lt;/p&gt;\n\n&lt;p&gt;A player with little game sense is more likely to become frustrated and tilted at a perceived lack of control, because their perception is narrow due to their ignorance from either a lack of research or lack of experience with the game. Effective, true learning can take place once you learn how to cope with a situation without resorting to frustration.&lt;/p&gt;\n\n&lt;p&gt;Specifically I&amp;#39;d like to talk about &lt;em&gt;blame,&lt;/em&gt; more specifically how blame turns into flame and bitterness. Flame, 90% of the time, will not help someone. Ultimately it is where a lot of frustrated people end up, due to the loss associated with people playing poorly. &lt;/p&gt;\n\n&lt;p&gt;When you flame someone, typically they are prompted with a similar fight or flight response and will enter a chain of verbal offense and defense in relation to the flame. This is distracting from their play, and more often than not can result in people going AFK, feeding, or generally demoralizing the team which effectively will make you perform even worse than how you might&amp;#39;ve been doing before. There are those with a heightened awareness of themselves and of others, but even then there are better ways to communicate that someone is playing poorly without resorting to disrespect.&lt;/p&gt;\n\n&lt;p&gt;There is a small percent window where flame might be helpful, and it&amp;#39;s not inherently rooted in flame itself. A person might take a positive out of the negative experience by reflecting on their play if there really was a problem with the way they were playing for the standards they should hold at their rank. However, this doesn&amp;#39;t justify flame since the majority of the time flaming overwhelmingly has a negative impact on the game and the people playing. &lt;/p&gt;\n\n&lt;p&gt;A better alternative is to give advice, although I wouldn&amp;#39;t recommend it in most circumstances. If you ever come across the rare circumstance where someone&amp;#39;s play is so overwhelmingly bad that they seem to not pick up on the simple basics yet are still in ranked, it might be more beneficial than not to advise them. It&amp;#39;s very easy to mess up in League since it is snowball-y by nature, so advising your 0/4/0 Lux to not overextend or engage can come off as patronizing. I follow the principle of not &lt;em&gt;giving&lt;/em&gt; unless it&amp;#39;s asked for, since I believe everyone is entitled to give and receive, whether it be advice or food or money or whatever, at their terms and within their boundaries.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Coping and Learning&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you notice yourself becoming overwhelmingly frustrated, try:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Taking deep breaths. Deep, slow (&lt;em&gt;slowwww&lt;/em&gt;) breaths help to deactivate your fight-or-flight response, which prompts your body and mind to deal with potential stress. The fight-or-flight response creates tension which isn&amp;#39;t useful when directed at your teammates&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Reminding yourself of your rank and the rank of those around you. You are flawed, just like the people around you are flawed. You will make misplays and won&amp;#39;t be performing optimally like a Challenger player would, so it&amp;#39;s important to accept yourself and your teammates as not being perfect or even &lt;em&gt;good.&lt;/em&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Watch for potential defense mechanisms, Mindfulness Meditation is useful particularly for restructuring how you think by paying attention to the things that you think. Silence is golden if you are experiencing frustration, expressing flame and contempt will only make things worse for yourself and will throw away a lot of potential for you to change how you think.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The essence of advice recommending you ask yourself &amp;quot;What could I have done better?&amp;quot; is rooted in disabling frustration. Once you have exhausted all real possible methods of influence, that is when frustration has a real world justification. If you have looked over every avenue of opportunity for you to do things to adjust to your team&amp;#39;s misplays, then it would make sense to be frustrated.&lt;/p&gt;\n\n&lt;p&gt;Once the game is over, look back at things that you could&amp;#39;ve done better or asks questions about why things ended up the way they did. Often times there are advanced concepts that you might not be aware of that you aren&amp;#39;t putting into practice which would&amp;#39;ve prevented a loss or death. This is particularly what this sub is for, so that you can learn more and improve your practice based on what you know.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;However, Frustration isn&amp;#39;t Always Useful&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Negative emotions drive us to make a change in our life in order to achieve our goals. In the case of League of Legends, if you have exhausted every possible resource to get better, there is absolutely nothing that you can do to change your circumstances. You have two choices in a situation of frustration. You either continue to play and accept the interdependent nature of League, or you don&amp;#39;t play at all. You&amp;#39;re going to win and lose games over factors that you often times have absolutely no control over, since it&amp;#39;s a team game. &lt;/p&gt;\n\n&lt;p&gt;If you truly like playing League and want to continue playing, but feel limited by your frustration at events that you totally can&amp;#39;t control, it would be beneficial to research the concept of &lt;a href=\"http://www.testandcalc.com/Self_Defeating_Beliefs/bel4.asp\"&gt;&lt;em&gt;frustration tolerance.&lt;/em&gt;&lt;/a&gt; Changing the way you think about League will ultimately affect how you play, how you enjoy the game, and how you can improve the experience of others.&lt;/p&gt;\n\n&lt;p&gt;League just isn&amp;#39;t a game for some people. If you have decided that you don&amp;#39;t want your success to be reliant on other people, then it&amp;#39;s okay to put it down for another game that isn&amp;#39;t as team reliant. Even then, there are still opportunities for those that want more control over their success. Flex queue and League teams are concepts to look into. This allows you to pick players and hold them to a specific, agreed standard in order for them to participate.&lt;/p&gt;\n\n&lt;p&gt;Hope that this guide was helpful to those seeking to understand themselves better and improve their gameplay. I contemplated posting this before but didn&amp;#39;t since I thought it was common knowledge on this sub, so feedback would be appreciated if you would like to see more content like this in the future or if you thought this was helpful at all.&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**How Tilt Forms**\n\nThe essence of tilt is the desire for control. Frustration is fundamentally defined by the anger felt towards a situation that you don't have any direct control over. League of Legends is a punishing game. One mistake, if not properly adapted to, can throw entire games or set the chain of events that lead up to a loss. \n\nExample: Your Lux midlane feeds Zed 4 kills by the 10 minute mark. Objectively this is terrible for the game, since Zed is a snowballing champion and with his new gold income (assuming CS is similar) he has a ton of opportunities to influence the game that were previously not open to him. With more gold, he has more items, and with more items he becomes more effective at killing champions. You are the botlane ADC, immobile and for the most part positioned in a way that someone might normally be positioned in a lane. You have vision of the river bush, but you get pushed in by the enemy. Zed comes down to tribush, ults you, and kills you while you're under tower. There is no counterplay. \n\nTo most higher tier players there are some obvious metagame counter-plays you could take advantage of such as saving your flash, keeping tribush warded, or even playing a more compatible bot lane that would more easily survive a Zed dive. But what opportunities you do have are unimportant for the sake of the analogy.\n\nThe core reason why this is an important example is because afterwards, the hypothetical ADC is tilted. Not because there truly was nothing that they could've done, but in their scope of awareness they didn't see anything that they could've done to prevent their situation or properly cope with it. \n\n**Ineffective Coping**\n\nFrustration and tilt is inherently tied to a perceived lack of control. Lack of control when you are trying to achieve a goal leads to stress. Regardless of whether there was an actual, realistic opportunity for you to take advantage of, if you don't have the knowledge or awareness to properly *know* that and use it, you will feel like you are at a loss.\n\nStress and lack of control leads to defense mechanisms. Because their goal is threatened, they naturally look for a way to explain, blame, or deny the stressful nature of the experience. This takes form in different ways, such as:\n\n* Blaming support for not warding\n\n* Blaming the midlane for feeding\n\n* Excusing the event as not a big deal with statements like \"It's okay, we have late game\" (regardless of the truth of that statement)\n\n* Denying that there's any reason to be upset, minimizing the impact that the stressful event had on the game\n\nWe've all done it if we're human, whether it's in or outside of League or even competitive games in general. If there is room for stress, there's room for a defense mechanism, especially if blame and contempt are directed at you from your teammates or even those around you in real life. \n\nHowever, these defense mechanisms are ineffective at properly coping with the problems that a League game brings. Unless you are Challenger on a good day, there is likely an opportunity that you might not have taken advantage of due to whatever circumstance. This circumstance is what differentiates Bronze from Challenger. Upper-tier players have explored the metagame and what real control they have in a number of game circumstances, which they've memorized and stored for future reference by experience. This is game sense. \n\nA player with little game sense is more likely to become frustrated and tilted at a perceived lack of control, because their perception is narrow due to their ignorance from either a lack of research or lack of experience with the game. Effective, true learning can take place once you learn how to cope with a situation without resorting to frustration.\n\nSpecifically I'd like to talk about *blame,* more specifically how blame turns into flame and bitterness. Flame, 90% of the time, will not help someone. Ultimately it is where a lot of frustrated people end up, due to the loss associated with people playing poorly. \n\nWhen you flame someone, typically they are prompted with a similar fight or flight response and will enter a chain of verbal offense and defense in relation to the flame. This is distracting from their play, and more often than not can result in people going AFK, feeding, or generally demoralizing the team which effectively will make you perform even worse than how you might've been doing before. There are those with a heightened awareness of themselves and of others, but even then there are better ways to communicate that someone is playing poorly without resorting to disrespect.\n\nThere is a small percent window where flame might be helpful, and it's not inherently rooted in flame itself. A person might take a positive out of the negative experience by reflecting on their play if there really was a problem with the way they were playing for the standards they should hold at their rank. However, this doesn't justify flame since the majority of the time flaming overwhelmingly has a negative impact on the game and the people playing. \n\nA better alternative is to give advice, although I wouldn't recommend it in most circumstances. If you ever come across the rare circumstance where someone's play is so overwhelmingly bad that they seem to not pick up on the simple basics yet are still in ranked, it might be more beneficial than not to advise them. It's very easy to mess up in League since it is snowball-y by nature, so advising your 0/4/0 Lux to not overextend or engage can come off as patronizing. I follow the principle of not *giving* unless it's asked for, since I believe everyone is entitled to give and receive, whether it be advice or food or money or whatever, at their terms and within their boundaries.\n\n\n\n**Coping and Learning**\n\nIf you notice yourself becoming overwhelmingly frustrated, try:\n\n* Taking deep breaths. Deep, slow (*slowwww*) breaths help to deactivate your fight-or-flight response, which prompts your body and mind to deal with potential stress. The fight-or-flight response creates tension which isn't useful when directed at your teammates\n\n* Reminding yourself of your rank and the rank of those around you. You are flawed, just like the people around you are flawed. You will make misplays and won't be performing optimally like a Challenger player would, so it's important to accept yourself and your teammates as not being perfect or even *good.*\n\n* Watch for potential defense mechanisms, Mindfulness Meditation is useful particularly for restructuring how you think by paying attention to the things that you think. Silence is golden if you are experiencing frustration, expressing flame and contempt will only make things worse for yourself and will throw away a lot of potential for you to change how you think.\n\n\nThe essence of advice recommending you ask yourself \"What could I have done better?\" is rooted in disabling frustration. Once you have exhausted all real possible methods of influence, that is when frustration has a real world justification. If you have looked over every avenue of opportunity for you to do things to adjust to your team's misplays, then it would make sense to be frustrated.\n\nOnce the game is over, look back at things that you could've done better or asks questions about why things ended up the way they did. Often times there are advanced concepts that you might not be aware of that you aren't putting into practice which would've prevented a loss or death. This is particularly what this sub is for, so that you can learn more and improve your practice based on what you know.\n\n**However, Frustration isn't Always Useful**\n\nNegative emotions drive us to make a change in our life in order to achieve our goals. In the case of League of Legends, if you have exhausted every possible resource to get better, there is absolutely nothing that you can do to change your circumstances. You have two choices in a situation of frustration. You either continue to play and accept the interdependent nature of League, or you don't play at all. You're going to win and lose games over factors that you often times have absolutely no control over, since it's a team game. \n\nIf you truly like playing League and want to continue playing, but feel limited by your frustration at events that you totally can't control, it would be beneficial to research the concept of [*frustration tolerance.*](http://www.testandcalc.com/Self_Defeating_Beliefs/bel4.asp) Changing the way you think about League will ultimately affect how you play, how you enjoy the game, and how you can improve the experience of others.\n\nLeague just isn't a game for some people. If you have decided that you don't want your success to be reliant on other people, then it's okay to put it down for another game that isn't as team reliant. Even then, there are still opportunities for those that want more control over their success. Flex queue and League teams are concepts to look into. This allows you to pick players and hold them to a specific, agreed standard in order for them to participate.\n\nHope that this guide was helpful to those seeking to understand themselves better and improve their gameplay. I contemplated posting this before but didn't since I thought it was common knowledge on this sub, so feedback would be appreciated if you would like to see more content like this in the future or if you thought this was helpful at all.\n\nThanks for reading\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rg99", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "kazoodles", "saved": false, "mod_reports": [], "name": "t3_64rg99", "subreddit_name_prefixed": "r/summonerschool", "approved_by": null, "over_18": false, "domain": "self.summonerschool", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t9x3", "edited": 1491924845.0, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/summonerschool/comments/64rg99/how_tilt_snowballs_into_toxicity_and_what_to_do/", "num_reports": null, "locked": false, "stickied": false, "created": 1491952664.0, "url": "https://www.reddit.com/r/summonerschool/comments/64rg99/how_tilt_snowballs_into_toxicity_and_what_to_do/", "author_flair_text": "Silver IV", "quarantine": false, "title": "How Tilt Snowballs into Toxicity, and What to do about it", "created_utc": 1491923864.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": "", "user_reports": [], "id": "dg5dzb1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "abrakadouche", "parent_id": "t1_dg51r0h", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yea you miss it maybe cause you're too eager or your timing is too slow. Then maybe you get eager for the next one cause you wanna redeem yourself. You fail to redeem yourself and you lose sight of cannon 3 or 4 to come, decide to all in, die , lose cannon 3 and 4 anyways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea you miss it maybe cause you&amp;#39;re too eager or your timing is too slow. Then maybe you get eager for the next one cause you wanna redeem yourself. You fail to redeem yourself and you lose sight of cannon 3 or 4 to come, decide to all in, die , lose cannon 3 and 4 anyways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5dzb1", "score_hidden": false, "stickied": false, "created": 1491995442.0, "created_utc": 1491966642.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51r0h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sub_Salac", "parent_id": "t1_dg50m21", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "It's still about surprise. Anyone who has played long enough will know the surreal sensation of even something as subtle as missing consecutive cs or even consecutive cannon minions. You just do not **expect** to miss another, so when you actually do, you're very prone to tilt because there's just no *way* you could possibly miss the next one, right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s still about surprise. Anyone who has played long enough will know the surreal sensation of even something as subtle as missing consecutive cs or even consecutive cannon minions. You just do not &lt;strong&gt;expect&lt;/strong&gt; to miss another, so when you actually do, you&amp;#39;re very prone to tilt because there&amp;#39;s just no &lt;em&gt;way&lt;/em&gt; you could possibly miss the next one, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg51r0h", "score_hidden": false, "stickied": false, "created": 1491979068.0, "created_utc": 1491950268.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50m21", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kazoodles", "parent_id": "t1_dg4yqkr", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Whenever I see my ADC auto cancel 3-4 times I definitely make some outbursts like \"WHAT?!\" \n\nExcellent point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whenever I see my ADC auto cancel 3-4 times I definitely make some outbursts like &amp;quot;WHAT?!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Excellent point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg50m21", "score_hidden": false, "stickied": false, "created": 1491977622.0, "created_utc": 1491948822.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4yqkr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Sub_Salac", "parent_id": "t3_64rg99", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "&gt; The essence of tilt is the desire for control\n\nI think I'd distill this down further and say it's when negative outcomes surprise us. The first word you hear before anyone tilts is usually something like \"WHAT!?\" \n\nThe control part is us having a desire for our expectations to be more or less met, and in a very dynamic game this can sometimes surprise us with disaster, and that makes us mad. Once mad, the rest is history. You can't play properly and then you're already slipping.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The essence of tilt is the desire for control&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think I&amp;#39;d distill this down further and say it&amp;#39;s when negative outcomes surprise us. The first word you hear before anyone tilts is usually something like &amp;quot;WHAT!?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The control part is us having a desire for our expectations to be more or less met, and in a very dynamic game this can sometimes surprise us with disaster, and that makes us mad. Once mad, the rest is history. You can&amp;#39;t play properly and then you&amp;#39;re already slipping.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg4yqkr", "score_hidden": false, "stickied": false, "created": 1491975307.0, "created_utc": 1491946507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": "", "user_reports": [], "id": "dg5hq5j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bananas21", "parent_id": "t1_dg4shhf", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "It's pretty difficult.. getting berated by teammates is no fun.. supps taking cs is no fun either. It all just rolls up into a big messy ball of salt and sludge", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s pretty difficult.. getting berated by teammates is no fun.. supps taking cs is no fun either. It all just rolls up into a big messy ball of salt and sludge&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5hq5j", "score_hidden": false, "stickied": false, "created": 1492001590.0, "created_utc": 1491972790.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4shhf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kazoodles", "parent_id": "t1_dg4ryqg", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I'm glad it helped, most normal people don't want to hurt anyone. at least, beneath any potential resentment and anger they don't have any malicious feelings. through self-understanding and self-discipline people can socialize more pleasantly, and i'm happy you felt inspired by this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad it helped, most normal people don&amp;#39;t want to hurt anyone. at least, beneath any potential resentment and anger they don&amp;#39;t have any malicious feelings. through self-understanding and self-discipline people can socialize more pleasantly, and i&amp;#39;m happy you felt inspired by this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg4shhf", "score_hidden": false, "stickied": false, "created": 1491968214.0, "created_utc": 1491939414.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ryqg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bananas21", "parent_id": "t3_64rg99", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Your post is helping me a lot right now. I'm very frustrated and took it out on my friends. :( I don't like being rude but that lack of control is very stressful", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your post is helping me a lot right now. I&amp;#39;m very frustrated and took it out on my friends. :( I don&amp;#39;t like being rude but that lack of control is very stressful&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg4ryqg", "score_hidden": false, "stickied": false, "created": 1491967646.0, "created_utc": 1491938846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64rg99", "likes": null, "replies": "", "user_reports": [], "id": "dg4y9vf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheOfficialRooK", "parent_id": "t3_64rg99", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Nice post", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice post&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg4y9vf", "score_hidden": false, "stickied": false, "created": 1491974747.0, "created_utc": 1491945947.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]