[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "summonerschool", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So the amumu changes have been pretty strong. Currently the passive is a 15% amp to magic damage on the target by applying it again as true damage. Next patch it is being dropped to 8% but the calculation is done before mitigation instead of post mitigation. Unless my brain is turned off, this is a buff to the passive if the target has at least 100 mr against the damage after all pen is accounted for. 50% damage reduction means half the damage would be reduced so 8% pre mitigation would match 16% post mitigation. It is also most likely a nerf to how much it helps wombo (squishies shouldn&amp;#39;t have over 100 mr that still exists vs ap champs building pen, so 8% true is less bonus damage from a fed mid).&lt;/p&gt;\n\n&lt;p&gt;It seems like this is probably a hit to him at high elo where you might focus on tanking more and working with the carries, but may actually be another buff for low elo &amp;quot;carry yourself&amp;quot; amumu playstyles. Building AP on amumu void staff doesn&amp;#39;t fit well into the build if you aren&amp;#39;t 100% glass cannon, so Amumu is likely to not have much pen and thus end up getting more damage bonus on his abilities from the passive change and less on the damage from the carries on his team. Am I missing something or does this change help low elo ap bruiser amumu and hurt his utility to buff teammates? It seems like this would be the opposite of what you want for balance given his current state right?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So the amumu changes have been pretty strong. Currently the passive is a 15% amp to magic damage on the target by applying it again as true damage. Next patch it is being dropped to 8% but the calculation is done before mitigation instead of post mitigation. Unless my brain is turned off, this is a buff to the passive if the target has at least 100 mr against the damage after all pen is accounted for. 50% damage reduction means half the damage would be reduced so 8% pre mitigation would match 16% post mitigation. It is also most likely a nerf to how much it helps wombo (squishies shouldn't have over 100 mr that still exists vs ap champs building pen, so 8% true is less bonus damage from a fed mid).\n\nIt seems like this is probably a hit to him at high elo where you might focus on tanking more and working with the carries, but may actually be another buff for low elo \"carry yourself\" amumu playstyles. Building AP on amumu void staff doesn't fit well into the build if you aren't 100% glass cannon, so Amumu is likely to not have much pen and thus end up getting more damage bonus on his abilities from the passive change and less on the damage from the carries on his team. Am I missing something or does this change help low elo ap bruiser amumu and hurt his utility to buff teammates? It seems like this would be the opposite of what you want for balance given his current state right?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Amumu", "id": "64s8qi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "Cawvey", "saved": false, "mod_reports": [], "name": "t3_64s8qi", "subreddit_name_prefixed": "r/summonerschool", "approved_by": null, "over_18": false, "domain": "self.summonerschool", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t9x3", "edited": false, "link_flair_css_class": "Amumu", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/summonerschool/comments/64s8qi/amumu_this_patch_and_the_next/", "num_reports": null, "locked": false, "stickied": false, "created": 1491960077.0, "url": "https://www.reddit.com/r/summonerschool/comments/64s8qi/amumu_this_patch_and_the_next/", "author_flair_text": null, "quarantine": false, "title": "Amumu this patch and the next", "created_utc": 1491931277.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": "", "user_reports": [], "id": "dg63nry", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cawvey", "parent_id": "t1_dg51td3", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "If you finish the sentence you quoted it says \"smaller than 15% of the modified damage.\" I guess the structure of the sentence could be better, but let me clarify here in case it did not make sense. \n\nLet's assume that the raw damage is 1000 damage and the mitigated damage is EITHER 800 or 500 based on how much pen the caster has (for instance Amumu or a bruiser top probably has less pen than the glass cannon APC mid). 8% of 1000 is 80 true damage being dealt with Amumu passive next patch regardless of who casts the 1000 damage ability and how much pen they have. On the current patch however, it is calculated as 15% of either 800 or 500 damage based on the caster and how much pen they have. 15% of 800 is 120 damage dealt as true damage again (which is 50% more than the 80 damage it would be next patch). 15% of 500 is only 75 damage dealt as true damage on the current patch, which is obviously less than the 80 damage the same ability would cause with the passive that is on the pbe.\n\nThe point I was trying to illustrate is that I think the change in passive is a nerf to the damage of your team's high damage carries, but possibly a buff to the damage of low pen bruisers (which is generally my favorite way to build Amumu). It seems weird that the change would damage the ability of Amumu to amplify his teammates damage and would buff his ability to do damage with non pen Apmumu builds. I would think that in higher elo you have to work with your team more to gain advantages because individual players make fewer mistakes so wins are less often one player getting fed to the point of 1v5ing the enemy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you finish the sentence you quoted it says &amp;quot;smaller than 15% of the modified damage.&amp;quot; I guess the structure of the sentence could be better, but let me clarify here in case it did not make sense. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s assume that the raw damage is 1000 damage and the mitigated damage is EITHER 800 or 500 based on how much pen the caster has (for instance Amumu or a bruiser top probably has less pen than the glass cannon APC mid). 8% of 1000 is 80 true damage being dealt with Amumu passive next patch regardless of who casts the 1000 damage ability and how much pen they have. On the current patch however, it is calculated as 15% of either 800 or 500 damage based on the caster and how much pen they have. 15% of 800 is 120 damage dealt as true damage again (which is 50% more than the 80 damage it would be next patch). 15% of 500 is only 75 damage dealt as true damage on the current patch, which is obviously less than the 80 damage the same ability would cause with the passive that is on the pbe.&lt;/p&gt;\n\n&lt;p&gt;The point I was trying to illustrate is that I think the change in passive is a nerf to the damage of your team&amp;#39;s high damage carries, but possibly a buff to the damage of low pen bruisers (which is generally my favorite way to build Amumu). It seems weird that the change would damage the ability of Amumu to amplify his teammates damage and would buff his ability to do damage with non pen Apmumu builds. I would think that in higher elo you have to work with your team more to gain advantages because individual players make fewer mistakes so wins are less often one player getting fed to the point of 1v5ing the enemy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg63nry", "score_hidden": false, "stickied": false, "created": 1492042872.0, "created_utc": 1492014072.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51td3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Youbestnotmisss", "parent_id": "t1_dg51dno", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "&gt;If the APC does not penetrate enough mr to make 8% of the raw damage \n\nBut raw damage is before mitigation, so there's no MR to penetrate\n\nIt's certainly true that penetration becomes less valuable if you have Amumu vs low-medium MR targets though", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If the APC does not penetrate enough mr to make 8% of the raw damage &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But raw damage is before mitigation, so there&amp;#39;s no MR to penetrate&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s certainly true that penetration becomes less valuable if you have Amumu vs low-medium MR targets though&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg51td3", "score_hidden": false, "stickied": false, "created": 1491979152.0, "created_utc": 1491950352.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51dno", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cawvey", "parent_id": "t1_dg4mk8a", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "The change is to 8% of damage measured premitigation from 15% of damage measured postmitigation. If the APC does not penetrate enough mr to make 8% of the raw damage smaller than 15% of the modified damage then the new one is more powerful. My thought was that with mpen reds, sorc boots, void staff (maybe guise of liandry's on some even) that relatively lower mr champions will end up below the cut off for where the extra percent is out weighed by the mitigation. You bring up a good point in the delay of build though. If they don't build void early on and enemies pick up a bit of mr this may be better than live, and only hit the damage of your APC late game when they are full build (at which point it means an increase in damage to tanks possibly because even with pen tanks my hit the mr threshold if they stack against double ap or something).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The change is to 8% of damage measured premitigation from 15% of damage measured postmitigation. If the APC does not penetrate enough mr to make 8% of the raw damage smaller than 15% of the modified damage then the new one is more powerful. My thought was that with mpen reds, sorc boots, void staff (maybe guise of liandry&amp;#39;s on some even) that relatively lower mr champions will end up below the cut off for where the extra percent is out weighed by the mitigation. You bring up a good point in the delay of build though. If they don&amp;#39;t build void early on and enemies pick up a bit of mr this may be better than live, and only hit the damage of your APC late game when they are full build (at which point it means an increase in damage to tanks possibly because even with pen tanks my hit the mr threshold if they stack against double ap or something).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg51dno", "score_hidden": false, "stickied": false, "created": 1491978595.0, "created_utc": 1491949795.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": "", "user_reports": [], "id": "dg5otya", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lovebus", "parent_id": "t1_dg4mk8a", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "They mentioned that they were giving mr per level to all champs who don't currently have it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They mentioned that they were giving mr per level to all champs who don&amp;#39;t currently have it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5otya", "score_hidden": false, "stickied": false, "created": 1492020194.0, "created_utc": 1491991394.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mk8a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Youbestnotmisss", "parent_id": "t3_64s8qi", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Ya pretty much. Technically breakpoint is 87.5 MR for it to be stronger than current patch. \n\n87.5 really isn't that much though. Scaling MR runes + QSS on an ADC = 87 MR or so at 18. Abyssal Mids will have more. Hexdrinker junglers will have more etc\n\nAs for \n\n&gt;squishies shouldn't have over 100 mr that still exists vs ap champs building pen, so 8% true is less bonus damage from a fed mid\n\nIf they're calculating damage before mitigation it's damage before void/pen is taken into account. So it's still good even if APC has void. In a way it makes void less necessary mid game for midlaners which is situationally pretty handy.\n\nIt's a weird change. Could see him potentially being a pretty useful pick if you have a high DPS mage midlaner. Could build tank to initiate and then peel back and amp up the damage of your APC. Bonus if you build abyssal.\n\nI'm not sure if it's actually a buff to him though. Pretty team comp dependent for sure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ya pretty much. Technically breakpoint is 87.5 MR for it to be stronger than current patch. &lt;/p&gt;\n\n&lt;p&gt;87.5 really isn&amp;#39;t that much though. Scaling MR runes + QSS on an ADC = 87 MR or so at 18. Abyssal Mids will have more. Hexdrinker junglers will have more etc&lt;/p&gt;\n\n&lt;p&gt;As for &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;squishies shouldn&amp;#39;t have over 100 mr that still exists vs ap champs building pen, so 8% true is less bonus damage from a fed mid&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If they&amp;#39;re calculating damage before mitigation it&amp;#39;s damage before void/pen is taken into account. So it&amp;#39;s still good even if APC has void. In a way it makes void less necessary mid game for midlaners which is situationally pretty handy.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a weird change. Could see him potentially being a pretty useful pick if you have a high DPS mage midlaner. Could build tank to initiate and then peel back and amp up the damage of your APC. Bonus if you build abyssal.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if it&amp;#39;s actually a buff to him though. Pretty team comp dependent for sure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg4mk8a", "score_hidden": false, "stickied": false, "created": 1491961807.0, "created_utc": 1491933007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": "", "user_reports": [], "id": "dg63vnw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cawvey", "parent_id": "t1_dg4syxd", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Possibly, but it is also in an odd way a nerf to the damage your APC does to sqishies when you land an ultimate on them (ult applies passive now iirc), while being a buff to the damage Amumu and other bruisers do to less tanky targets (because AP bruisers have less pen often and may leave enough mr on even relatively squishy targets that 8% of raw damage is more than 15% of the mitigated damage). My thought was in high elo you would work with your team more, compared to low elo where you may just kill the carries yourself before they can kill you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Possibly, but it is also in an odd way a nerf to the damage your APC does to sqishies when you land an ultimate on them (ult applies passive now iirc), while being a buff to the damage Amumu and other bruisers do to less tanky targets (because AP bruisers have less pen often and may leave enough mr on even relatively squishy targets that 8% of raw damage is more than 15% of the mitigated damage). My thought was in high elo you would work with your team more, compared to low elo where you may just kill the carries yourself before they can kill you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg63vnw", "score_hidden": false, "stickied": false, "created": 1492043102.0, "created_utc": 1492014302.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4syxd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WizardXZDYoutube", "parent_id": "t3_64s8qi", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Wait, this deals more damage to tanks, so wouldn't this be better higher elo where you can't Q onto out of position ADCs?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait, this deals more damage to tanks, so wouldn&amp;#39;t this be better higher elo where you can&amp;#39;t Q onto out of position ADCs?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg4syxd", "score_hidden": false, "stickied": false, "created": 1491968732.0, "created_utc": 1491939932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": "", "user_reports": [], "id": "dg63wv4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cawvey", "parent_id": "t1_dg5i9zl", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "God I wish there was ever a reason to build tear on Amumu.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God I wish there was ever a reason to build tear on Amumu.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg63wv4", "score_hidden": false, "stickied": false, "created": 1492043138.0, "created_utc": 1492014338.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5i9zl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "imspookin", "parent_id": "t1_dg59c5u", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "5 tears to increase the ws max range. But honestly ap burn. Runic into rylias and liandrys. Maybe throw in tabi or a negatron early max w. Ap bruiser is ok too build like gragas max e.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;5 tears to increase the ws max range. But honestly ap burn. Runic into rylias and liandrys. Maybe throw in tabi or a negatron early max w. Ap bruiser is ok too build like gragas max e.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5i9zl", "score_hidden": false, "stickied": false, "created": 1492002634.0, "created_utc": 1491973834.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": "", "user_reports": [], "id": "dg6vron", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zme1", "parent_id": "t1_dg64g5j", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "ty", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ty&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6vron", "score_hidden": false, "stickied": false, "created": 1492073988.0, "created_utc": 1492045188.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64g5j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cawvey", "parent_id": "t1_dg59c5u", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Basically focusing on a bit more damage w/ your durability instead of being a cc tank. Amumu w/ cinderhulk, hp and resists, plus 40% cdr is a good team fighter because he is hard to kill, does some ambient damage, and has a pretty low cool down ranged stun, but the damage isn't that much so you're relying on your team to kill stuff probably.\n\nA while back there was a popular KR build that was AP jungle enchant, sunfire and abyssal. Gave a bit of resists and HP so you did't die immediately and also gave decent damage so you could burst squishies. I've been playing him AP bruiser sort of recently and it is wrecking the low elo games I'm in (trexhastinyarms, na server). Runic gives good mana sustain and damge early, then you just go w/ whatever combo of hybrid items works for the current game (been having decent results w/ just boots to mitigate damage, then either sunfire or rylai's (think deadman's might be good here w/ ms quints) to increase aoe or keep them in it, followed by the other or some MR if absolutely needed, then adding liandry's which can go after runic, rylai's, boots if you get fed early and want the damage/hp because the enemy is squish and has mixed damage)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically focusing on a bit more damage w/ your durability instead of being a cc tank. Amumu w/ cinderhulk, hp and resists, plus 40% cdr is a good team fighter because he is hard to kill, does some ambient damage, and has a pretty low cool down ranged stun, but the damage isn&amp;#39;t that much so you&amp;#39;re relying on your team to kill stuff probably.&lt;/p&gt;\n\n&lt;p&gt;A while back there was a popular KR build that was AP jungle enchant, sunfire and abyssal. Gave a bit of resists and HP so you did&amp;#39;t die immediately and also gave decent damage so you could burst squishies. I&amp;#39;ve been playing him AP bruiser sort of recently and it is wrecking the low elo games I&amp;#39;m in (trexhastinyarms, na server). Runic gives good mana sustain and damge early, then you just go w/ whatever combo of hybrid items works for the current game (been having decent results w/ just boots to mitigate damage, then either sunfire or rylai&amp;#39;s (think deadman&amp;#39;s might be good here w/ ms quints) to increase aoe or keep them in it, followed by the other or some MR if absolutely needed, then adding liandry&amp;#39;s which can go after runic, rylai&amp;#39;s, boots if you get fed early and want the damage/hp because the enemy is squish and has mixed damage)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg64g5j", "score_hidden": false, "stickied": false, "created": 1492043695.0, "created_utc": 1492014895.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59c5u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zme1", "parent_id": "t3_64s8qi", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "what's the low elo carry yourself build?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what&amp;#39;s the low elo carry yourself build?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg59c5u", "score_hidden": false, "stickied": false, "created": 1491989113.0, "created_utc": 1491960313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": "", "user_reports": [], "id": "dg64j6r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cawvey", "parent_id": "t1_dg5ibaq", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Shit, I hadn't thought about that. This is actually pretty huge. Part of what I think has made Amumu so darn strong in my recent low elo games is that he stays so healthy in the jungle and clears fast so lower elo jungles cannot punish your first couple clears as easily as they used to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shit, I hadn&amp;#39;t thought about that. This is actually pretty huge. Part of what I think has made Amumu so darn strong in my recent low elo games is that he stays so healthy in the jungle and clears fast so lower elo jungles cannot punish your first couple clears as easily as they used to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg64j6r", "score_hidden": false, "stickied": false, "created": 1492043785.0, "created_utc": 1492014985.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ibaq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tinhboe", "parent_id": "t3_64s8qi", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "it's a heavy nerf to his jungle clear though. Most camp have low MR", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s a heavy nerf to his jungle clear though. Most camp have low MR&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5ibaq", "score_hidden": false, "stickied": false, "created": 1492002702.0, "created_utc": 1491973902.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64s8qi", "likes": null, "replies": "", "user_reports": [], "id": "dg64uzc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cawvey", "parent_id": "t1_dg5ihag", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "It is a nerf to his utility for the team, but how often do you build pen on Amumu? Usually I just have the pen from mpen reds and liandry's/abyssal maybe. On rare occasion I might build sorc boots, but usually you get more damage from taking tabis or mercs to have some minor resists to live longer. If that is the only pen you have then the numbers for MR can be much lower to break even. That means you are break even or possibly ahead in skirmishes your APC isn't there, fights before the APC build void/other pen if they rush raw damage, and ganks on bot/top lane early. I feel like that probably covers enough areas that at least mid/early game or for just the damage Amumu does this could be less of a nerf than you would expect from the numbers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is a nerf to his utility for the team, but how often do you build pen on Amumu? Usually I just have the pen from mpen reds and liandry&amp;#39;s/abyssal maybe. On rare occasion I might build sorc boots, but usually you get more damage from taking tabis or mercs to have some minor resists to live longer. If that is the only pen you have then the numbers for MR can be much lower to break even. That means you are break even or possibly ahead in skirmishes your APC isn&amp;#39;t there, fights before the APC build void/other pen if they rush raw damage, and ganks on bot/top lane early. I feel like that probably covers enough areas that at least mid/early game or for just the damage Amumu does this could be less of a nerf than you would expect from the numbers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg64uzc", "score_hidden": false, "stickied": false, "created": 1492044120.0, "created_utc": 1492015320.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ihag", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Contrite17", "parent_id": "t3_64s8qi", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "The change to 8% is a nerf to the champion overall, he will still be better then last patch but losing that much damage amp for his AP carries is a big deal. To break even with current values the enemy target needs 160-170 MR if the AP carry has sorc shoes and void which is REALLY high.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The change to 8% is a nerf to the champion overall, he will still be better then last patch but losing that much damage amp for his AP carries is a big deal. To break even with current values the enemy target needs 160-170 MR if the AP carry has sorc shoes and void which is REALLY high.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5ihag", "score_hidden": false, "stickied": false, "created": 1492003020.0, "created_utc": 1491974220.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]