[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "summonerschool", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you want to improve your macro in general you have to get into a certain mindset when playing games, which is: always think ahead when you do anything. Every move you make will result into something else happening and if you don&amp;#39;t think about the consequences of your moves you can not control the future of the game. This mindset is very important because it is not champion/role specific. This mindset not being role/champion specific is crucial because not every game will be the same and you can&amp;#39;t play macro the same every game, so your strategy has to be adaptable. That being said you have to combine this mindset with prioritizing the right objectives at the right time.&lt;/p&gt;\n\n&lt;p&gt;To go a little bit more in depth, let&amp;#39;s start in the early game in the bottom lane. You leash your junglers red and get to lane a little bit late. The enemy bot lane does not show early as well, but the enemy toplane does so you have to immedeatly start thinking ahead: the enemy jungle started blue --&amp;gt; can the enemy jungler gank early (Lee sin, elise), if yes make sure you ward and play safe. If not, he is probably going to full clear his jungle so you have up to 3 minutes to play your lane very aggresively because the jungler will be clearing topside and will be unable to gank you. Together with this you have to take into consideration at what time you and the enemy bottom lane will arrive to lane and what this means for the macro game as a whole. If you arrive early you can acquire wave control, if you arrive later than the enemy botlane this means that your lvl 2 is delayed compared to the enemy and that you are at a slight disadvantage if you dont play out your lane well.&lt;/p&gt;\n\n&lt;p&gt;Now that the laning phase has started and you have a general idea about what is going to happen on the map and in your lane in the following few minutes you have to start thinking about objectives. One of the most important, yet straightforward objectives is towers. To take this you have to take a lot of things into consideration: how good is my champ at this point in the game?, can we force a kill/ force the enemy lane to base?, can/will my jungler assist me or do other lanes need more assistance?, at what time can the enemy jungler gank me? Do I have control of the wave and can I use this control to put the enemy at a disadvantage?\nAnswering these questions will give you a general idea about not only what will happen right now, but also about what is going to happen in the future. This ties in with another very important concept of Macro and that is pressure. Pressure/Priority/tempo (whatever you want to call it) in LoL is the single most important concept of the macro game, because pressure = objectives = wins. For example: you are playing Lucian into vayne. Lucian is strong early, vayne is weak early. You get a kill on the vayne, push in the wave and recall. This means that you will be ahead of levels on the Vayne and because you pushed the wave into tower the wave will be pushing towards you. Because you are overleveled and you have control of the wave you now have pressure on the enemy lane. Pressure in general is the ability to create a bigger advantage. You can have pressure just by having a winning matchup champion wise, but you can also create pressure by outplaying your enemy. This pressure means you can: freeze and if the enemy approaches the wave kill her (together with your jungler) and take the tower, Push in the wave (if the enemy cant cs well under tower) and get chip damage onto the tower/poke them under tower untill they are forced to recall so you can take the tower or, if you are not able to poke them, push in the wave and call over your jungler for a tower dive kill them and take the turret.&lt;/p&gt;\n\n&lt;p&gt;What I do want to underline here is that if you are the Vayne here (you don&amp;#39;t have pressure) the best thing to do is play defensive untill your powerspikes kick in later and you can create pressure.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s go a little bit further into the game: Baron. In order to succesfully take barons we are going to apply the same concepts as the ones mentioned above: Thinking ahead, taking the right objectives at the right time and pressure. First of all Baron in itself is a tool which hugely increases the amount of pressure you already have. If you don&amp;#39;t have pressure and take Baron you suddenly get a little more pressure and if you are already winning Baron means you can win even faster. You can use pressure to take a baron without contest as well.&lt;/p&gt;\n\n&lt;p&gt;What does this look like in game? By the time that Baron becomes a serious objective, you also get a new pressure tool: Pushing lanes. More towers have fallen by this point, so minion waves can become bigger. A pushing lane occurs when your minion wave is larger than the enemy minion wave and therefore moves away from your base. You can utilize this to take baron. For example: Baron spawns in 2 minutes and you really want to take it. In order to prepare you can create pressure away from baron to force the enemy into a lose-lose situation. You can for example start a slow push(creating a large minion wave) in the bottom lane, recall and quickly push out mid and top lane. Because you did this, by the time baron spawns your minion wave will be huge in the botlane and the lanes that are closest to baron are pushed in, so the enemy does not have any vision around baron. Now here comes the intense macro: because the minion wave in the botlane is very big, if someone does not clear that minion wave, that wave is going to push for the turret/inhib. This means that if your team goes to baron and their entire team goes to baron, you can peel off the baron and let the minions in the botlane take inhib/tower or your toplaner can tp to take it while the rest of you peel off and try not to die. If an enemy goes to clear botlane to prevent a tower/inhib from falling you win as well because you can force a 4v5 at Baron which should be easier to win than a 5v5.&lt;/p&gt;\n\n&lt;p&gt;This works even better for Lanes in which the inhibitor has already fallen. A super minion lane will always push in and therefore you always have pressure in a super minion lane. For example: You have destroyed top inhib and went to base afterwards what do you do? First and always: think ahead. You have taken toplane inhib what does this mean --&amp;gt; pressure in toplane. You can use this pressure to create pressure elsewhere on the map. To keep it simple, you can now go 5 man into the mid lane --&amp;gt; if they come for a 5v5 the super minions will eventually take the enemy base. If they send 1 person to clear toplane you can force a 4v5 in the midlane which they either lose and die or they get low and are forced back which results in an easy tower.&lt;/p&gt;\n\n&lt;p&gt;VERY IMPORTANT: Pressure on its own does not win you games. Pressure has to be used together with everything else you have learned about LoL. You have to comunicate what you want to do and the state of the game with your teammates. Tell your team if you need help, how strong you are right now, how easy it is to gank your lane, where you want to go next, where your team should go next etc. You also have to ward accordingly. Before taking any objective: ward the shit out of it. Make sure you are in control of that area and can see any enemy approaching that objective from any angle. Also take into consideration the strengths and the weaknesses of the enemy teamcomp and your teamcomp and play around it. (for example: if you have a tryndamere on your team you have to immedeatly start playing around it. Let the trynda splitpush on one side of the map while you take an objective on the other side. If they send 2 people to answer the trynd you can 4v3. if they only send 1 person to answer trynd, trynd is probably going to win that so dont take too many risks and let trynd split while holding the enemy there. If they dont send anyone to answer trynd, he will take their base, but you have to be extra carefull because you are now fighting 4v5.)&lt;/p&gt;\n\n&lt;p&gt;In conclusion, macro in LoL is a very broad concept with a lot of different aspects. Every concept mentioned above here could have a 10k-word essay written about it but i dont have time for that now. However, the core concepts of macro are: thinking ahead, taking the right objectives at the right time and pressure. Thinking ahead starts in champion select. Look at the teamcomps and try to figure out which lane is going to win/lose, the most likely path of the enemy jungler, at what time do which champs powerspike etc. Then in game you have to always think a minute ahead: If i push this lane now --&amp;gt; where is the wave going to be in a minute, if you think you are able to kill someone --&amp;gt; what are you going to do afterwards/where could the enemy jungler be/how can i get the most out of this kill(wave manipulation/freezing). This mindset is very important in order to properly execute good macro. The other, more intertwined, conepts of macro are pressure and knowing when to take which objective. Having pressure means the ability to further your advantage and you have to know at which moment you can further this advantage. Pressure can be created by many things: champion picks, junglers, superminion waves, wave control/wave manipulation or simply a difference in skill-level. Use this to take the map and get those wins.&lt;/p&gt;\n\n&lt;p&gt;Hope this helped!&lt;/p&gt;\n\n&lt;p&gt;Edit: Will do something about the format when I have some more time later&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "If you want to improve your macro in general you have to get into a certain mindset when playing games, which is: always think ahead when you do anything. Every move you make will result into something else happening and if you don't think about the consequences of your moves you can not control the future of the game. This mindset is very important because it is not champion/role specific. This mindset not being role/champion specific is crucial because not every game will be the same and you can't play macro the same every game, so your strategy has to be adaptable. That being said you have to combine this mindset with prioritizing the right objectives at the right time.\n\nTo go a little bit more in depth, let's start in the early game in the bottom lane. You leash your junglers red and get to lane a little bit late. The enemy bot lane does not show early as well, but the enemy toplane does so you have to immedeatly start thinking ahead: the enemy jungle started blue --&gt; can the enemy jungler gank early (Lee sin, elise), if yes make sure you ward and play safe. If not, he is probably going to full clear his jungle so you have up to 3 minutes to play your lane very aggresively because the jungler will be clearing topside and will be unable to gank you. Together with this you have to take into consideration at what time you and the enemy bottom lane will arrive to lane and what this means for the macro game as a whole. If you arrive early you can acquire wave control, if you arrive later than the enemy botlane this means that your lvl 2 is delayed compared to the enemy and that you are at a slight disadvantage if you dont play out your lane well.\n\nNow that the laning phase has started and you have a general idea about what is going to happen on the map and in your lane in the following few minutes you have to start thinking about objectives. One of the most important, yet straightforward objectives is towers. To take this you have to take a lot of things into consideration: how good is my champ at this point in the game?, can we force a kill/ force the enemy lane to base?, can/will my jungler assist me or do other lanes need more assistance?, at what time can the enemy jungler gank me? Do I have control of the wave and can I use this control to put the enemy at a disadvantage?\nAnswering these questions will give you a general idea about not only what will happen right now, but also about what is going to happen in the future. This ties in with another very important concept of Macro and that is pressure. Pressure/Priority/tempo (whatever you want to call it) in LoL is the single most important concept of the macro game, because pressure = objectives = wins. For example: you are playing Lucian into vayne. Lucian is strong early, vayne is weak early. You get a kill on the vayne, push in the wave and recall. This means that you will be ahead of levels on the Vayne and because you pushed the wave into tower the wave will be pushing towards you. Because you are overleveled and you have control of the wave you now have pressure on the enemy lane. Pressure in general is the ability to create a bigger advantage. You can have pressure just by having a winning matchup champion wise, but you can also create pressure by outplaying your enemy. This pressure means you can: freeze and if the enemy approaches the wave kill her (together with your jungler) and take the tower, Push in the wave (if the enemy cant cs well under tower) and get chip damage onto the tower/poke them under tower untill they are forced to recall so you can take the tower or, if you are not able to poke them, push in the wave and call over your jungler for a tower dive kill them and take the turret.\n\nWhat I do want to underline here is that if you are the Vayne here (you don't have pressure) the best thing to do is play defensive untill your powerspikes kick in later and you can create pressure.\n\nLet's go a little bit further into the game: Baron. In order to succesfully take barons we are going to apply the same concepts as the ones mentioned above: Thinking ahead, taking the right objectives at the right time and pressure. First of all Baron in itself is a tool which hugely increases the amount of pressure you already have. If you don't have pressure and take Baron you suddenly get a little more pressure and if you are already winning Baron means you can win even faster. You can use pressure to take a baron without contest as well.\n\nWhat does this look like in game? By the time that Baron becomes a serious objective, you also get a new pressure tool: Pushing lanes. More towers have fallen by this point, so minion waves can become bigger. A pushing lane occurs when your minion wave is larger than the enemy minion wave and therefore moves away from your base. You can utilize this to take baron. For example: Baron spawns in 2 minutes and you really want to take it. In order to prepare you can create pressure away from baron to force the enemy into a lose-lose situation. You can for example start a slow push(creating a large minion wave) in the bottom lane, recall and quickly push out mid and top lane. Because you did this, by the time baron spawns your minion wave will be huge in the botlane and the lanes that are closest to baron are pushed in, so the enemy does not have any vision around baron. Now here comes the intense macro: because the minion wave in the botlane is very big, if someone does not clear that minion wave, that wave is going to push for the turret/inhib. This means that if your team goes to baron and their entire team goes to baron, you can peel off the baron and let the minions in the botlane take inhib/tower or your toplaner can tp to take it while the rest of you peel off and try not to die. If an enemy goes to clear botlane to prevent a tower/inhib from falling you win as well because you can force a 4v5 at Baron which should be easier to win than a 5v5.\n\nThis works even better for Lanes in which the inhibitor has already fallen. A super minion lane will always push in and therefore you always have pressure in a super minion lane. For example: You have destroyed top inhib and went to base afterwards what do you do? First and always: think ahead. You have taken toplane inhib what does this mean --&gt; pressure in toplane. You can use this pressure to create pressure elsewhere on the map. To keep it simple, you can now go 5 man into the mid lane --&gt; if they come for a 5v5 the super minions will eventually take the enemy base. If they send 1 person to clear toplane you can force a 4v5 in the midlane which they either lose and die or they get low and are forced back which results in an easy tower.\n\nVERY IMPORTANT: Pressure on its own does not win you games. Pressure has to be used together with everything else you have learned about LoL. You have to comunicate what you want to do and the state of the game with your teammates. Tell your team if you need help, how strong you are right now, how easy it is to gank your lane, where you want to go next, where your team should go next etc. You also have to ward accordingly. Before taking any objective: ward the shit out of it. Make sure you are in control of that area and can see any enemy approaching that objective from any angle. Also take into consideration the strengths and the weaknesses of the enemy teamcomp and your teamcomp and play around it. (for example: if you have a tryndamere on your team you have to immedeatly start playing around it. Let the trynda splitpush on one side of the map while you take an objective on the other side. If they send 2 people to answer the trynd you can 4v3. if they only send 1 person to answer trynd, trynd is probably going to win that so dont take too many risks and let trynd split while holding the enemy there. If they dont send anyone to answer trynd, he will take their base, but you have to be extra carefull because you are now fighting 4v5.)\n\nIn conclusion, macro in LoL is a very broad concept with a lot of different aspects. Every concept mentioned above here could have a 10k-word essay written about it but i dont have time for that now. However, the core concepts of macro are: thinking ahead, taking the right objectives at the right time and pressure. Thinking ahead starts in champion select. Look at the teamcomps and try to figure out which lane is going to win/lose, the most likely path of the enemy jungler, at what time do which champs powerspike etc. Then in game you have to always think a minute ahead: If i push this lane now --&gt; where is the wave going to be in a minute, if you think you are able to kill someone --&gt; what are you going to do afterwards/where could the enemy jungler be/how can i get the most out of this kill(wave manipulation/freezing). This mindset is very important in order to properly execute good macro. The other, more intertwined, conepts of macro are pressure and knowing when to take which objective. Having pressure means the ability to further your advantage and you have to know at which moment you can further this advantage. Pressure can be created by many things: champion picks, junglers, superminion waves, wave control/wave manipulation or simply a difference in skill-level. Use this to take the map and get those wins.\n\nHope this helped!\n\nEdit: Will do something about the format when I have some more time later", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64w2pt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 37, "report_reasons": null, "author": "BlackStarfish", "saved": false, "mod_reports": [], "name": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "approved_by": null, "over_18": false, "domain": "self.summonerschool", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t9x3", "edited": 1492006675.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/summonerschool/comments/64w2pt/just_posted_this_as_a_comment_in_the_megathread/", "num_reports": null, "locked": false, "stickied": false, "created": 1492000374.0, "url": "https://www.reddit.com/r/summonerschool/comments/64w2pt/just_posted_this_as_a_comment_in_the_megathread/", "author_flair_text": null, "quarantine": false, "title": "Just posted this as a comment in the Megathread: how to improve your macro.", "created_utc": 1491971574.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": "", "user_reports": [], "id": "dg5mz17", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "apexjnr", "parent_id": "t1_dg5hxoe", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "&gt;In conclusion, macro in LoL is a very broad concept with a lot of different aspects. Every concept mentioned above here could have a 10k-word essay written about it but i dont have time for that now. However, the core concepts of macro are:   \nthinking ahead, taking the right objectives at the right time and pressure. Thinking ahead starts in champion select. Look at the teamcomps and try to figure out which lane is going to win/lose, the most likely path of the enemy jungler, at what time do which champs powerspike etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In conclusion, macro in LoL is a very broad concept with a lot of different aspects. Every concept mentioned above here could have a 10k-word essay written about it but i dont have time for that now. However, the core concepts of macro are:&lt;br/&gt;\nthinking ahead, taking the right objectives at the right time and pressure. Thinking ahead starts in champion select. Look at the teamcomps and try to figure out which lane is going to win/lose, the most likely path of the enemy jungler, at what time do which champs powerspike etc.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5mz17", "score_hidden": false, "stickied": false, "created": 1492014335.0, "created_utc": 1491985535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hxoe", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "StormsEye", "parent_id": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Can't you format this? Like give this huge wall of text some subheadings and bold points and a TLDR as well as good spacing. it's not very easy to read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t you format this? Like give this huge wall of text some subheadings and bold points and a TLDR as well as good spacing. it&amp;#39;s not very easy to read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5hxoe", "score_hidden": false, "stickied": false, "created": 1492001984.0, "created_utc": 1491973184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": "", "user_reports": [], "id": "dg5lnxg", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "RuCat", "parent_id": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Tl;DR cause huge messy wall:\n\nearly game: play around jungler's positions and use wavecontrol  \nmid- and endgame: sidewave control and objective foresight\n\nThe majority of the text are examples.\n\n&gt; the core concepts of macro are: thinking ahead, taking the right objectives at the right time and pressure. Thinking ahead starts in champion select. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tl;DR cause huge messy wall:&lt;/p&gt;\n\n&lt;p&gt;early game: play around jungler&amp;#39;s positions and use wavecontrol&lt;br/&gt;\nmid- and endgame: sidewave control and objective foresight&lt;/p&gt;\n\n&lt;p&gt;The majority of the text are examples.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the core concepts of macro are: thinking ahead, taking the right objectives at the right time and pressure. Thinking ahead starts in champion select. &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5lnxg", "score_hidden": false, "stickied": false, "created": 1492010492.0, "created_utc": 1491981692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": "", "user_reports": [], "id": "dg5wxq8", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ademarrosar", "parent_id": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Come on guys, the dude takes his time to write a good informative guide about macro with examples and you complain about the formatting? It isnt hard to read, no wonder people cant improve, they want a tl dr to everything because reading takes time", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Come on guys, the dude takes his time to write a good informative guide about macro with examples and you complain about the formatting? It isnt hard to read, no wonder people cant improve, they want a tl dr to everything because reading takes time&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5wxq8", "score_hidden": false, "stickied": false, "created": 1492035365.0, "created_utc": 1492006565.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": "", "user_reports": [], "id": "dg5oq6b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "itsallabigshow", "parent_id": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Hm you're making a good point and before this I never thought about it but now I realize that I'm guilty of this: I always set myself one \"task\" and 99% of the time only when I succeeded or failed at that task I think about what to do next. \n\nNow I'm rather experienced so it doesn't take a lot of time but it's still some crucial seconds that I'm losing not to mention the amount of games where I lost more than I gained because I got lost after finishing that task. \n\nThis is actually one more of those times when I am playing on autopilot. Dang. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hm you&amp;#39;re making a good point and before this I never thought about it but now I realize that I&amp;#39;m guilty of this: I always set myself one &amp;quot;task&amp;quot; and 99% of the time only when I succeeded or failed at that task I think about what to do next. &lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m rather experienced so it doesn&amp;#39;t take a lot of time but it&amp;#39;s still some crucial seconds that I&amp;#39;m losing not to mention the amount of games where I lost more than I gained because I got lost after finishing that task. &lt;/p&gt;\n\n&lt;p&gt;This is actually one more of those times when I am playing on autopilot. Dang. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5oq6b", "score_hidden": false, "stickied": false, "created": 1492019866.0, "created_utc": 1491991066.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": "", "user_reports": [], "id": "dg5v587", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NEIKT", "parent_id": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Hi! I was the one who asked. Thanks again really usefull ^^.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I was the one who asked. Thanks again really usefull &lt;sup&gt;&lt;sup&gt;.&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5v587", "score_hidden": false, "stickied": false, "created": 1492033043.0, "created_utc": 1492004243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": "", "user_reports": [], "id": "dg5vc0v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DoYouEvenCyka", "parent_id": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Well written and informative.\n\nHowever I agree with others that you may want to format better, at least split into more paragraphs of less lines.\nHere is how to [insert a blank line](https://www.reddit.com/r/help/comments/1vjfm9/how_do_i_insert_a_blank_line_between_2_lines_of/cesu6f6/).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well written and informative.&lt;/p&gt;\n\n&lt;p&gt;However I agree with others that you may want to format better, at least split into more paragraphs of less lines.\nHere is how to &lt;a href=\"https://www.reddit.com/r/help/comments/1vjfm9/how_do_i_insert_a_blank_line_between_2_lines_of/cesu6f6/\"&gt;insert a blank line&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg5vc0v", "score_hidden": false, "stickied": false, "created": 1492033301.0, "created_utc": 1492004501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_64w2pt", "likes": null, "replies": "", "user_reports": [], "id": "dg64scu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yvaelle", "parent_id": "t3_64w2pt", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yva's Short Guide to Macro: \n\n1. Everytime you do something, ask yourself, \"Where next?\"\n2. Unless a new opportunity presents itself (reaction roam, etc) - stick to the plan. \n3. When you are comfortable with that, ask yourself, \"Where after?\"\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yva&amp;#39;s Short Guide to Macro: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Everytime you do something, ask yourself, &amp;quot;Where next?&amp;quot;&lt;/li&gt;\n&lt;li&gt;Unless a new opportunity presents itself (reaction roam, etc) - stick to the plan. &lt;/li&gt;\n&lt;li&gt;When you are comfortable with that, ask yourself, &amp;quot;Where after?&amp;quot;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg64scu", "score_hidden": false, "stickied": false, "created": 1492044048.0, "created_utc": 1492015248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]