[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "summonerschool", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Writer and credits: &lt;a href=\"https://twitter.com/HazelCoaching\"&gt;https://twitter.com/HazelCoaching&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Cheating. &lt;/p&gt;\n\n&lt;p&gt;Today I want to talk a little bit about cheating. As you all know, I work in sports, I work in E-sports, and in both fields I find myself surrounded by people who cheat, including myself.&lt;/p&gt;\n\n&lt;p&gt;Now I do not want to talk about doping. There&amp;#39;s rules for that, and I adhere to them. I do not want to talk about hacking or DDOS&amp;#39;ing, for I do none of these and have experience with none of it. I want to talk about why you and I cheat, and why it means we will never be what we want to be.&lt;/p&gt;\n\n&lt;p&gt;Every once in a while, I get a message or an e-mail or even sometimes a guy on the street who approaches me, full of enthusiasm, and they ask me a question that I&amp;#39;ve come to dread. &amp;quot;How do I get better at League of Legends?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Take a moment to look at that question. You try and answer it.\nCan you?\nNeither can I. I&amp;#39;ve tried, for sure. &amp;quot;Focus on your vision control&amp;quot;, &amp;quot;Learn your limits&amp;quot;, &amp;quot;Play simpler champions.&amp;quot; I say it because it makes you happy, it gives you hope and it pushes you to try again. But it won&amp;#39;t make you better. You already know any piece of advice that I can tell you in such a short amount of time, you already know that there is no golden ticket, no secret advice that the pro&amp;#39;s understand and that we just haven&amp;#39;t shared with you. I see people paying $5, $10, $20 to ask pro&amp;#39;s questions about climbing on Stream, and you&amp;#39;ve all seen that &amp;quot;Oh shit&amp;quot; expression when they try to come up with a respectable answer. They never can, nobody can. So if we all know it, why do we still ask? We ask, because it gives us the illusion of having tried. If Lee &amp;#39;Faker&amp;#39; Sang-Hyeok told you &amp;quot;To be the best, you must read two books a day and exercise for an hour&amp;quot;, how many of you would do it?\nWe don&amp;#39;t want the real answer. We want to give ourselves the illusion of trying. Having asked somebody &amp;quot;How do I get better?&amp;quot;, you can now tick off the little box that says &amp;#39;Today I strived to reach my goal.&amp;#39; Don&amp;#39;t get me wrong though, asking questions is important, but only if you can open your mind and accept whatever answer you get.&lt;/p&gt;\n\n&lt;p&gt;I am a cheater. You are a cheater. We are cheaters. We cheat because it&amp;#39;s easier. It&amp;#39;s easier to call me a hack for not having an answer to your question than it is to look to yourself and say &amp;quot;maybe I&amp;#39;m asking the wrong questions?&amp;quot;\nIt&amp;#39;s easier to blame the system, or the coach, or the computer, or the League than it is to look yourself in the mirror and say &amp;quot;I did not try hard enough.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You want the golden ticket? Here&amp;#39;s what you need to do to get success in any field in the entire world:\nFrom your body - Preparation\nFrom your mind - Cunning\nFrom your heart - Determination&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s talk about how we cheat in these three areas.\nWe cheat with our bodies, because we should have started earlier. We are not mad because our teammates are bad, we&amp;#39;re mad because our sleeping schedule is out of whack and we have caffeine pumping through our veins.\nWe did not lose the BO5 because we had a bad pick and ban phase. We lost because you based your entire lifestyle on dopamine release, and since you lost game one, the whole series is spoiled.&lt;/p&gt;\n\n&lt;p&gt;Every single task in the world has a physical component. This is the component that you must address first. Shape yourself to be a tool of success, there are no excuses to not start yesterday. It does not have to be exercise, but you must control your body before you can control your life. If the brain is the only muscle you&amp;#39;ll need, then by GOD you treat that muscle with respect.&lt;/p&gt;\n\n&lt;p&gt;We cheat with our mind because we want freedom. To succeed, we must have a plan. But a plan entails commitment. Feeling free while giving up most of our days to work hurts. So we cheat. When was the last time you made an excuse for yourself? &amp;quot;I don&amp;#39;t actually need to warm up.&amp;quot;, &amp;quot;I&amp;#39;ll just wing it at practice tonight&amp;quot;, &amp;quot;I&amp;#39;m sure I can ACE that test without studying.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In order to regain your freedom while working hard, you must be cunning. You must find the most efficient way to achieve any goal you set for yourself. Write it down, make one that adheres to your physiology and stick to strategies that do not require you to burn yourself out. No professional player can survive 8 hour scrim blocks followed by 6 hours of solo queue. It will kill your mind, your body and your soul. Design your life to be cunning and efficient.&lt;/p&gt;\n\n&lt;p&gt;We cheat with our hearts, because the hardest truth of them all is that we are not good enough. When you fantasize about being a professional League of Legends player, you dream of the money, the roar of the stage, the interviews or maybe the dream of &amp;quot;five guys hangin&amp;#39; out and playing video games&amp;quot;.\nDo you dream of back pain, neck pain, wrist pain and headaches? This is your future.\nDo you dream of having millions of people looking over your shoulder, scrutinizing your every word and analyzing every click of your mouse, upholding you to impossible standards? This is your future.&lt;/p&gt;\n\n&lt;p&gt;We tell ourselves lies to spare ourselves the pain of admitting the truth. &amp;quot;He had talent&amp;quot;, &amp;quot;She was lucky&amp;quot;. You must be aware of external factors, but ultimately, the day you go home unable to find something to improve in yourself is the day you stop improving. You have hit a plateau from which it is almost impossible to keep climbing. You MUST be an idealist and a perfectionist if you wish to succeed. You must be able to criticize yourself and accept criticism without letting your mood suffer. I have worked with many people who get paid to play games or do sports, I have worked with few who are professional, so many of them will be too caught up in their own ego to EVER ask themselves, &amp;quot;what can I do differently?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Learn to be determined, learn to love finding and working on your own short-comings and you will be successful.&lt;/p&gt;\n\n&lt;p&gt;There are a lot of you out there who play video games because you want the competition that comes from sports, but for one reason or the other you cannot perform. I do not ask of you that you be athletes, you need not touch a weight in your life. But I so would wish that you would all be winners. A true winner does not win on stage, a true winner secures victory about three months before, when everybody allowed him to lie to himself and he refused. Those around you want for you what makes you feel good, but not always what makes you be good. If your mum let&amp;#39;s you skip homework, it is YOUR responsibility to say &amp;quot;No mum, today I must study.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If you can push yourself without hating yourself, you&amp;#39;ll go far.\n-Hazel out&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Incredible read, made me realise that even though I wanted to think that I had been doing everthing I can to improve, I hadn&amp;#39;t really, I just did it to give myself the illusion of trying. I hope this helps a lot of you out as I feel this attitude is rampant in this sub.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Writer and credits: https://twitter.com/HazelCoaching\n\nCheating. \n\nToday I want to talk a little bit about cheating. As you all know, I work in sports, I work in E-sports, and in both fields I find myself surrounded by people who cheat, including myself.\n\nNow I do not want to talk about doping. There's rules for that, and I adhere to them. I do not want to talk about hacking or DDOS'ing, for I do none of these and have experience with none of it. I want to talk about why you and I cheat, and why it means we will never be what we want to be.\n\nEvery once in a while, I get a message or an e-mail or even sometimes a guy on the street who approaches me, full of enthusiasm, and they ask me a question that I've come to dread. \"How do I get better at League of Legends?\"\n\nTake a moment to look at that question. You try and answer it.\nCan you?\nNeither can I. I've tried, for sure. \"Focus on your vision control\", \"Learn your limits\", \"Play simpler champions.\" I say it because it makes you happy, it gives you hope and it pushes you to try again. But it won't make you better. You already know any piece of advice that I can tell you in such a short amount of time, you already know that there is no golden ticket, no secret advice that the pro's understand and that we just haven't shared with you. I see people paying $5, $10, $20 to ask pro's questions about climbing on Stream, and you've all seen that \"Oh shit\" expression when they try to come up with a respectable answer. They never can, nobody can. So if we all know it, why do we still ask? We ask, because it gives us the illusion of having tried. If Lee 'Faker' Sang-Hyeok told you \"To be the best, you must read two books a day and exercise for an hour\", how many of you would do it?\nWe don't want the real answer. We want to give ourselves the illusion of trying. Having asked somebody \"How do I get better?\", you can now tick off the little box that says 'Today I strived to reach my goal.' Don't get me wrong though, asking questions is important, but only if you can open your mind and accept whatever answer you get.\n\nI am a cheater. You are a cheater. We are cheaters. We cheat because it's easier. It's easier to call me a hack for not having an answer to your question than it is to look to yourself and say \"maybe I'm asking the wrong questions?\"\nIt's easier to blame the system, or the coach, or the computer, or the League than it is to look yourself in the mirror and say \"I did not try hard enough.\"\n\nYou want the golden ticket? Here's what you need to do to get success in any field in the entire world:\nFrom your body - Preparation\nFrom your mind - Cunning\nFrom your heart - Determination\n\nSo let's talk about how we cheat in these three areas.\nWe cheat with our bodies, because we should have started earlier. We are not mad because our teammates are bad, we're mad because our sleeping schedule is out of whack and we have caffeine pumping through our veins.\nWe did not lose the BO5 because we had a bad pick and ban phase. We lost because you based your entire lifestyle on dopamine release, and since you lost game one, the whole series is spoiled.\n\nEvery single task in the world has a physical component. This is the component that you must address first. Shape yourself to be a tool of success, there are no excuses to not start yesterday. It does not have to be exercise, but you must control your body before you can control your life. If the brain is the only muscle you'll need, then by GOD you treat that muscle with respect.\n\nWe cheat with our mind because we want freedom. To succeed, we must have a plan. But a plan entails commitment. Feeling free while giving up most of our days to work hurts. So we cheat. When was the last time you made an excuse for yourself? \"I don't actually need to warm up.\", \"I'll just wing it at practice tonight\", \"I'm sure I can ACE that test without studying.\"\n\nIn order to regain your freedom while working hard, you must be cunning. You must find the most efficient way to achieve any goal you set for yourself. Write it down, make one that adheres to your physiology and stick to strategies that do not require you to burn yourself out. No professional player can survive 8 hour scrim blocks followed by 6 hours of solo queue. It will kill your mind, your body and your soul. Design your life to be cunning and efficient.\n\nWe cheat with our hearts, because the hardest truth of them all is that we are not good enough. When you fantasize about being a professional League of Legends player, you dream of the money, the roar of the stage, the interviews or maybe the dream of \"five guys hangin' out and playing video games\".\nDo you dream of back pain, neck pain, wrist pain and headaches? This is your future.\nDo you dream of having millions of people looking over your shoulder, scrutinizing your every word and analyzing every click of your mouse, upholding you to impossible standards? This is your future.\n\nWe tell ourselves lies to spare ourselves the pain of admitting the truth. \"He had talent\", \"She was lucky\". You must be aware of external factors, but ultimately, the day you go home unable to find something to improve in yourself is the day you stop improving. You have hit a plateau from which it is almost impossible to keep climbing. You MUST be an idealist and a perfectionist if you wish to succeed. You must be able to criticize yourself and accept criticism without letting your mood suffer. I have worked with many people who get paid to play games or do sports, I have worked with few who are professional, so many of them will be too caught up in their own ego to EVER ask themselves, \"what can I do differently?\"\n\nLearn to be determined, learn to love finding and working on your own short-comings and you will be successful.\n\n\nThere are a lot of you out there who play video games because you want the competition that comes from sports, but for one reason or the other you cannot perform. I do not ask of you that you be athletes, you need not touch a weight in your life. But I so would wish that you would all be winners. A true winner does not win on stage, a true winner secures victory about three months before, when everybody allowed him to lie to himself and he refused. Those around you want for you what makes you feel good, but not always what makes you be good. If your mum let's you skip homework, it is YOUR responsibility to say \"No mum, today I must study.\"\n\nIf you can push yourself without hating yourself, you'll go far.\n-Hazel out\n\n\n------------------------------------------------------------------\n\nIncredible read, made me realise that even though I wanted to think that I had been doing everthing I can to improve, I hadn't really, I just did it to give myself the illusion of trying. I hope this helps a lot of you out as I feel this attitude is rampant in this sub.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65088m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 584, "report_reasons": null, "author": "Owneh", "saved": false, "mod_reports": [], "name": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "approved_by": null, "over_18": false, "domain": "self.summonerschool", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t9x3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/summonerschool/comments/65088m/ex_origen_coach_breaks_down_why_most_people_dont/", "num_reports": null, "locked": false, "stickied": false, "created": 1492052571.0, "url": "https://www.reddit.com/r/summonerschool/comments/65088m/ex_origen_coach_breaks_down_why_most_people_dont/", "author_flair_text": null, "quarantine": false, "title": "Ex Origen coach breaks down why most people don't climb, even if they THINK they blame themselves. Incredible read.", "created_utc": 1492023771.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 146, "visited": false, "subreddit_type": "public", "ups": 584}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7hm7f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ieou", "parent_id": "t1_dg78l0b", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Heavy ivern nerfs on pbe! They're trying out e CD increase, w range decease, and increasing passive timer from 2.5 to 3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heavy ivern nerfs on pbe! They&amp;#39;re trying out e CD increase, w range decease, and increasing passive timer from 2.5 to 3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7hm7f", "score_hidden": false, "stickied": false, "created": 1492116359.0, "created_utc": 1492087559.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7nnyf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "That0neSummoner", "parent_id": "t1_dg7k4l3", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "it needs to have a broken active, with ok gold efficiency, and a useless mess of stats to be good for supports", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it needs to have a broken active, with ok gold efficiency, and a useless mess of stats to be good for supports&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7nnyf", "score_hidden": false, "stickied": false, "created": 1492124202.0, "created_utc": 1492095402.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k4l3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "My_Dearest_Leblanc", "parent_id": "t1_dg78l0b", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "redemption is fucking broken", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;redemption is fucking broken&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7k4l3", "score_hidden": false, "stickied": false, "created": 1492119943.0, "created_utc": 1492091143.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tux9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ATXLegend7", "parent_id": "t1_dg7siy0", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I might be wrong here, but I feel like mage supports like Zyra/Malz are a bigger counter to tank supports than shield/healing supports\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I might be wrong here, but I feel like mage supports like Zyra/Malz are a bigger counter to tank supports than shield/healing supports&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7tux9", "score_hidden": false, "stickied": false, "created": 1492130849.0, "created_utc": 1492102049.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7siy0", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Youbestnotmisss", "parent_id": "t1_dg7qytr", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I don't think the healing/shielding offered by Janna/Sona is fine at all. Or even Raka really.\n\nWindspeaker's is biggest offender imo, the amount of free resists it gives are pretty unnecessary\n\nCurrently windspeakers + shielding itemization helps ranged utility supports scale far too well and makes tank supports pretty irrelevant overall", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think the healing/shielding offered by Janna/Sona is fine at all. Or even Raka really.&lt;/p&gt;\n\n&lt;p&gt;Windspeaker&amp;#39;s is biggest offender imo, the amount of free resists it gives are pretty unnecessary&lt;/p&gt;\n\n&lt;p&gt;Currently windspeakers + shielding itemization helps ranged utility supports scale far too well and makes tank supports pretty irrelevant overall&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7siy0", "score_hidden": false, "stickied": false, "created": 1492129418.0, "created_utc": 1492100618.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qytr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ATXLegend7", "parent_id": "t1_dg7oxwu", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Nerf his shield and Lulu shield IMO. Windspeakers and all of the heal/shield buffing I think is fine. It doesn't seem too strong on things like Nami, Sona, Karma, Raka, etc. \n\nBut Ivern and Lulu's shield is already huge without any forbidden idols. It's kind of ridiculous", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nerf his shield and Lulu shield IMO. Windspeakers and all of the heal/shield buffing I think is fine. It doesn&amp;#39;t seem too strong on things like Nami, Sona, Karma, Raka, etc. &lt;/p&gt;\n\n&lt;p&gt;But Ivern and Lulu&amp;#39;s shield is already huge without any forbidden idols. It&amp;#39;s kind of ridiculous&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7qytr", "score_hidden": false, "stickied": false, "created": 1492127762.0, "created_utc": 1492098962.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7vbdf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Youbestnotmisss", "parent_id": "t1_dg7tfr3", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "That's an idea, might be weird to implement though, and might be hard to restrict to supports\n\nI don't have a great solution. + shielding/healing items were a good idea to boost support power level as there's very few solo laners that can really use them effectively. But for tank supports it's totally different. Tank supports are good for tankiness + CC, and you can't really make an item that boosts either.\n\nWhat they've done is probably the only way to do it, which is to give strong item actives with worse base stats, and then limit effectiveness of a team buying multiple of that item like they did with locket and redemption. And it has made tank supports stronger. But the issue remains that if they don't curb shield itemization tank supports lack a niche over ranged supports as they're noticeably weaker early and barely stronger lategame if at all (and I'd argue not at all). Sure tanks have some uses in terms of gank setup, engage, facechecking baron etc, but they're too weak as long as shield itemization is this strong. \n\nI really think they just need to nerf shield itemization/windspeakers. Even if it means buffing redemption again, because at least all supports benefit from redemption. Or buff gold income items or something. Tune support power levels as a whole while nerfing top tier shield supports. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s an idea, might be weird to implement though, and might be hard to restrict to supports&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have a great solution. + shielding/healing items were a good idea to boost support power level as there&amp;#39;s very few solo laners that can really use them effectively. But for tank supports it&amp;#39;s totally different. Tank supports are good for tankiness + CC, and you can&amp;#39;t really make an item that boosts either.&lt;/p&gt;\n\n&lt;p&gt;What they&amp;#39;ve done is probably the only way to do it, which is to give strong item actives with worse base stats, and then limit effectiveness of a team buying multiple of that item like they did with locket and redemption. And it has made tank supports stronger. But the issue remains that if they don&amp;#39;t curb shield itemization tank supports lack a niche over ranged supports as they&amp;#39;re noticeably weaker early and barely stronger lategame if at all (and I&amp;#39;d argue not at all). Sure tanks have some uses in terms of gank setup, engage, facechecking baron etc, but they&amp;#39;re too weak as long as shield itemization is this strong. &lt;/p&gt;\n\n&lt;p&gt;I really think they just need to nerf shield itemization/windspeakers. Even if it means buffing redemption again, because at least all supports benefit from redemption. Or buff gold income items or something. Tune support power levels as a whole while nerfing top tier shield supports. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7vbdf", "score_hidden": false, "stickied": false, "created": 1492132386.0, "created_utc": 1492103586.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8a809", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "filthyireliamain", "parent_id": "t1_dg7tfr3", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "please god. there needs to be something that we can do to counterplay shields. so frusturating to deal with", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;please god. there needs to be something that we can do to counterplay shields. so frusturating to deal with&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8a809", "score_hidden": false, "stickied": false, "created": 1492148879.0, "created_utc": 1492120079.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tfr3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VernacularRobot", "parent_id": "t1_dg7oxwu", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Maybe an item that reduces shielding that tank supports are encouraged to buy? Hard to say because as you say, riot wants more supports. As a dirty Janna main, I can't complain. Shits busted. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe an item that reduces shielding that tank supports are encouraged to buy? Hard to say because as you say, riot wants more supports. As a dirty Janna main, I can&amp;#39;t complain. Shits busted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7tfr3", "score_hidden": false, "stickied": false, "created": 1492130399.0, "created_utc": 1492101599.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7oxwu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Youbestnotmisss", "parent_id": "t1_dg78l0b", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "The nerf I want is a nerf to support healing/shielding itemization in general + a windspeaker's nerf, but they won't do that because they want supports to be powerful, which while I don't think it's good for game balance it encourages people to play support so I'm OK with it I guess\n\nDirect nerfs are needed, not really sure where I'd hit. I don't hate his Q personally, it's daisy, the shield, and his clear that are the problem\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The nerf I want is a nerf to support healing/shielding itemization in general + a windspeaker&amp;#39;s nerf, but they won&amp;#39;t do that because they want supports to be powerful, which while I don&amp;#39;t think it&amp;#39;s good for game balance it encourages people to play support so I&amp;#39;m OK with it I guess&lt;/p&gt;\n\n&lt;p&gt;Direct nerfs are needed, not really sure where I&amp;#39;d hit. I don&amp;#39;t hate his Q personally, it&amp;#39;s daisy, the shield, and his clear that are the problem&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7oxwu", "score_hidden": false, "stickied": false, "created": 1492125605.0, "created_utc": 1492096805.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78l0b", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "VernacularRobot", "parent_id": "t1_dg6o2w3", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I think Ivern's fundamental problem is that he's a support with a jungler's income. His kit, unless the change it drastically, will always allow him to skip spending gold on jungle items and go directly for the support items. \n\nSupport items are really, really strong this season. Ivern gets a stronger and earlier locket/redemption than anyone in the game. He also benefits from the rapid decline in lethality junglers who could invade him a bit more safely than the current ones, and the rise of BORK.    \n\nSome nerfs I could think of: further nerf daisy HP and/or CD     \nMaybe increase charge time on his camps    \nDecrease range on Q or root time    \nmake the E pop conditional on the shield still being up (is this already in? can't remember)    \n\n\nHe's gonna be hell to balance if the meta shifts to tanky junglers. No matter what happens, he's Janna with levels, income, and a utility tibbers. Riot might be able to push him to late game or to general balance with itemization changes/direct nerfs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Ivern&amp;#39;s fundamental problem is that he&amp;#39;s a support with a jungler&amp;#39;s income. His kit, unless the change it drastically, will always allow him to skip spending gold on jungle items and go directly for the support items. &lt;/p&gt;\n\n&lt;p&gt;Support items are really, really strong this season. Ivern gets a stronger and earlier locket/redemption than anyone in the game. He also benefits from the rapid decline in lethality junglers who could invade him a bit more safely than the current ones, and the rise of BORK.    &lt;/p&gt;\n\n&lt;p&gt;Some nerfs I could think of: further nerf daisy HP and/or CD&lt;br/&gt;\nMaybe increase charge time on his camps&lt;br/&gt;\nDecrease range on Q or root time&lt;br/&gt;\nmake the E pop conditional on the shield still being up (is this already in? can&amp;#39;t remember)    &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s gonna be hell to balance if the meta shifts to tanky junglers. No matter what happens, he&amp;#39;s Janna with levels, income, and a utility tibbers. Riot might be able to push him to late game or to general balance with itemization changes/direct nerfs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg78l0b", "score_hidden": false, "stickied": false, "created": 1492093163.0, "created_utc": 1492064363.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6o2w3", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Youbestnotmisss", "parent_id": "t1_dg6l7mo", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "There has never been a champ holding this sort of winrate for that long. Janna was up there but it was still usually around 55%, not 57 or whatever\n\nNo idea why they haven't addressed it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There has never been a champ holding this sort of winrate for that long. Janna was up there but it was still usually around 55%, not 57 or whatever&lt;/p&gt;\n\n&lt;p&gt;No idea why they haven&amp;#39;t addressed it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6o2w3", "score_hidden": false, "stickied": false, "created": 1492064567.0, "created_utc": 1492035767.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8cm98", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "superworking", "parent_id": "t1_dg6quwa", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I mean how do you get off a good dive when there's 2 redemptions, 2 shield/cc bots, and 4 exhausts wandering the map.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean how do you get off a good dive when there&amp;#39;s 2 redemptions, 2 shield/cc bots, and 4 exhausts wandering the map.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8cm98", "score_hidden": false, "stickied": false, "created": 1492151986.0, "created_utc": 1492123186.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8a9ep", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "filthyireliamain", "parent_id": "t1_dg6quwa", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "cant even blame him. with 4 exhausts and so many shields if there is a window of time to go in itd be extremely slim", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;cant even blame him. with 4 exhausts and so many shields if there is a window of time to go in itd be extremely slim&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8a9ep", "score_hidden": false, "stickied": false, "created": 1492148928.0, "created_utc": 1492120128.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6quwa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "briastkam", "parent_id": "t1_dg6qmja", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "our bot lane actually managed to not die too much until mid game. we had a mid talon that was hard carrying, and then he started doing bad dive after bad dive and he lost his lead hard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;our bot lane actually managed to not die too much until mid game. we had a mid talon that was hard carrying, and then he started doing bad dive after bad dive and he lost his lead hard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6quwa", "score_hidden": false, "stickied": false, "created": 1492068017.0, "created_utc": 1492039217.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7gjtj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kr4zykilla", "parent_id": "t1_dg79zjc", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Perhaps, but in soloq it's more likely 2 or more people with stack an exhaust on 1 person which lowers the value of having more than 1 available. On the plus side, it is incredibly likely you will always have atleast 1 exhaust so that's good. Idk how I feel about it but I mean if it works I don't really see a problem...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps, but in soloq it&amp;#39;s more likely 2 or more people with stack an exhaust on 1 person which lowers the value of having more than 1 available. On the plus side, it is incredibly likely you will always have atleast 1 exhaust so that&amp;#39;s good. Idk how I feel about it but I mean if it works I don&amp;#39;t really see a problem...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7gjtj", "score_hidden": false, "stickied": false, "created": 1492114556.0, "created_utc": 1492085756.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79zjc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IPlei", "parent_id": "t1_dg6qmja", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "i feel like 4 exhaust would be really good if like the other team was talon rengar/yi vayne", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i feel like 4 exhaust would be really good if like the other team was talon rengar/yi vayne&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg79zjc", "score_hidden": false, "stickied": false, "created": 1492096799.0, "created_utc": 1492067999.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qmja", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Kr4zykilla", "parent_id": "t1_dg6o66i", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "How in the world did a 4 exhaust comp work, did the rest of your team fall behind?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How in the world did a 4 exhaust comp work, did the rest of your team fall behind?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qmja", "score_hidden": false, "stickied": false, "created": 1492067729.0, "created_utc": 1492038929.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6o66i", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "briastkam", "parent_id": "t1_dg6mehh", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "yep... i just had a ranked game as darius against a tankplank with exhaust, a janna with exhaust, an ahri with exhaust and an ivern with exhaust. i was pretty far ahead - had an excellent laning phase - but once they started grouping, it was IMPOSSIBLE to kill them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yep... i just had a ranked game as darius against a tankplank with exhaust, a janna with exhaust, an ahri with exhaust and an ivern with exhaust. i was pretty far ahead - had an excellent laning phase - but once they started grouping, it was IMPOSSIBLE to kill them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6o66i", "score_hidden": false, "stickied": false, "created": 1492064683.0, "created_utc": 1492035883.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7erkl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Simsons2", "parent_id": "t1_dg6mehh", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yeah, had a game where we had ivern/soraka and karma on our team. Heals and shields were on the point and nothing coulda really be done by enemy team to stop that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, had a game where we had ivern/soraka and karma on our team. Heals and shields were on the point and nothing coulda really be done by enemy team to stop that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7erkl", "score_hidden": false, "stickied": false, "created": 1492110777.0, "created_utc": 1492081977.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mehh", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Natho74", "parent_id": "t1_dg6l7mo", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Ivern is so cancer and if you combine him with defensive support like Lulu or Karma your team couldn't kill themselves if they ran it down mid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ivern is so cancer and if you combine him with defensive support like Lulu or Karma your team couldn&amp;#39;t kill themselves if they ran it down mid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6mehh", "score_hidden": false, "stickied": false, "created": 1492062496.0, "created_utc": 1492033696.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6l7mo", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "briastkam", "parent_id": "t1_dg6jcx9", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "i've never been one to complain about champs being OP, but it really is mind boggling that Ivern is allowed to exist in his current state, given how easy he is", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;ve never been one to complain about champs being OP, but it really is mind boggling that Ivern is allowed to exist in his current state, given how easy he is&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6l7mo", "score_hidden": false, "stickied": false, "created": 1492061081.0, "created_utc": 1492032281.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7z9e1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ElSanju", "parent_id": "t1_dg6jcx9", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I mean, I play Janna :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, I play Janna :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7z9e1", "score_hidden": false, "stickied": false, "created": 1492136580.0, "created_utc": 1492107780.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7f25g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Exotic_Aura", "parent_id": "t1_dg6jcx9", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yeah I started playing Ivern some weeks ago and from D5 I got to D4 with Ivern only.. 7 wins in a row...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I started playing Ivern some weeks ago and from D5 I got to D4 with Ivern only.. 7 wins in a row...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7f25g", "score_hidden": false, "stickied": false, "created": 1492111477.0, "created_utc": 1492082677.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg9aoea", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "raikmond", "parent_id": "t1_dg84hie", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Hmmm, one of the reasons being argued is that precisely his cooldowns were too high for what they did. I'm talking about Ivern when released, and I'm unaware of further changes he underwent, so basically I have no clue how accurate these comments are. Thank for explaining tho :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmmm, one of the reasons being argued is that precisely his cooldowns were too high for what they did. I&amp;#39;m talking about Ivern when released, and I&amp;#39;m unaware of further changes he underwent, so basically I have no clue how accurate these comments are. Thank for explaining tho :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg9aoea", "score_hidden": false, "stickied": false, "created": 1492213442.0, "created_utc": 1492184642.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84hie", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ImSoRude", "parent_id": "t1_dg7o8am", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "A combination of low cooldowns and decent utility; his actual abilities aren't broken individually but when you combine it with the low ass cooldowns he's basically a fed support every game since he's jungling, which is super good for keeping a hyper carry like twitch alive. Also, fuck Daisy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A combination of low cooldowns and decent utility; his actual abilities aren&amp;#39;t broken individually but when you combine it with the low ass cooldowns he&amp;#39;s basically a fed support every game since he&amp;#39;s jungling, which is super good for keeping a hyper carry like twitch alive. Also, fuck Daisy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg84hie", "score_hidden": false, "stickied": false, "created": 1492142224.0, "created_utc": 1492113424.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7o8am", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "raikmond", "parent_id": "t1_dg6jcx9", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I'm low elo but I don't get why is he that strong. In fact his numbers when he was released looked not really great compared with other champions with similar abilities. Is really his unique camp-clearing mechanics and bush creation that overpowered? Ivern looks almost useless in all the games I see one, in comparison with other champions alike.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m low elo but I don&amp;#39;t get why is he that strong. In fact his numbers when he was released looked not really great compared with other champions with similar abilities. Is really his unique camp-clearing mechanics and bush creation that overpowered? Ivern looks almost useless in all the games I see one, in comparison with other champions alike.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7o8am", "score_hidden": false, "stickied": false, "created": 1492124822.0, "created_utc": 1492096022.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8a69h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "filthyireliamain", "parent_id": "t1_dg6jcx9", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "and janna, to some extent", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;and janna, to some extent&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8a69h", "score_hidden": false, "stickied": false, "created": 1492148819.0, "created_utc": 1492120019.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8hsov", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hydes_zar94", "parent_id": "t1_dg6jcx9", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "there used to be Skarner too!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;there used to be Skarner too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8hsov", "score_hidden": false, "stickied": false, "created": 1492158976.0, "created_utc": 1492130176.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg78gd1", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Astrrum", "parent_id": "t1_dg6jcx9", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yeah but he's probably the most boring champion in the game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah but he&amp;#39;s probably the most boring champion in the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg78gd1", "score_hidden": false, "stickied": false, "created": 1492092860.0, "created_utc": 1492064060.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jcx9", "gilded": 0, "archived": false, "score": 90, "report_reasons": null, "author": "Dispray", "parent_id": "t1_dg6j4pm", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I mean there is ivern ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean there is ivern &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6jcx9", "score_hidden": false, "stickied": false, "created": 1492058985.0, "created_utc": 1492030185.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 90}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7mb6f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Maxumilian", "parent_id": "t1_dg6j4pm", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I was just informed yesterday by this very sub-reddit and multiple users that all tank supports in bot lane auto-lose lane.\n\nSo, according to this subreddit you're wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was just informed yesterday by this very sub-reddit and multiple users that all tank supports in bot lane auto-lose lane.&lt;/p&gt;\n\n&lt;p&gt;So, according to this subreddit you&amp;#39;re wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7mb6f", "score_hidden": false, "stickied": false, "created": 1492122641.0, "created_utc": 1492093841.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7owsd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "A1t2o", "parent_id": "t1_dg7o04v", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "One of the main skills that an ADC needs to learn is positioning. If you can't save yourself with your slow or ult as a failsafe, then you are way out of position. I agree that it is a weakness, but it is a controllable one to teach a bigger lesson. An easy to exploit weakness would be more like kalista where she is mechanically difficult and very squishy. You just don't see her played in bronze because her weaknesses require too much skill to overcome. At least with Ashe they gave her a slow on everything so that it is easier to overcome her weaknesses.\n\nIn bronze 3 positioning mistakes are much worse than in higher elos. As you climb people do position better and you learn more about where you should be because everyone else is more where they should be. B3 really doesn't provide a good example, since I have been there myself and most people are not playing to improve, they are playing for kills and to win that one game. Playing to improve requires a certain mindset that you are not looking for immediate results and that you are likely to get worse as you break habits before you get better and form better habits.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the main skills that an ADC needs to learn is positioning. If you can&amp;#39;t save yourself with your slow or ult as a failsafe, then you are way out of position. I agree that it is a weakness, but it is a controllable one to teach a bigger lesson. An easy to exploit weakness would be more like kalista where she is mechanically difficult and very squishy. You just don&amp;#39;t see her played in bronze because her weaknesses require too much skill to overcome. At least with Ashe they gave her a slow on everything so that it is easier to overcome her weaknesses.&lt;/p&gt;\n\n&lt;p&gt;In bronze 3 positioning mistakes are much worse than in higher elos. As you climb people do position better and you learn more about where you should be because everyone else is more where they should be. B3 really doesn&amp;#39;t provide a good example, since I have been there myself and most people are not playing to improve, they are playing for kills and to win that one game. Playing to improve requires a certain mindset that you are not looking for immediate results and that you are likely to get worse as you break habits before you get better and form better habits.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7owsd", "score_hidden": false, "stickied": false, "created": 1492125571.0, "created_utc": 1492096771.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7o04v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "S0_B00sted", "parent_id": "t1_dg7naq8", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Ashe's weaknesses are *so* easy to exploit. She has absolutely no escape. If you catch her out of position in a team fight she's dead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ashe&amp;#39;s weaknesses are &lt;em&gt;so&lt;/em&gt; easy to exploit. She has absolutely no escape. If you catch her out of position in a team fight she&amp;#39;s dead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7o04v", "score_hidden": false, "stickied": false, "created": 1492124573.0, "created_utc": 1492095773.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7naq8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "A1t2o", "parent_id": "t1_dg6j4pm", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I disagree. It is possible to have a champ that is balanced yet a go to pick for climbing. Those champs would be good for learning and training. There are several champs like this who are the jack of all trades, master of none. Ashe ADC for example. You play them to teach you the basics and not have really easy to exploit weaknesses.\n\nSo no one champ is going to make you suddenly win more games, but there are champs that are better learning tools to get you better at the game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree. It is possible to have a champ that is balanced yet a go to pick for climbing. Those champs would be good for learning and training. There are several champs like this who are the jack of all trades, master of none. Ashe ADC for example. You play them to teach you the basics and not have really easy to exploit weaknesses.&lt;/p&gt;\n\n&lt;p&gt;So no one champ is going to make you suddenly win more games, but there are champs that are better learning tools to get you better at the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7naq8", "score_hidden": false, "stickied": false, "created": 1492123785.0, "created_utc": 1492094985.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg893da", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Frolossus", "parent_id": "t1_dg6j4pm", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "it was called ap tryndamere once ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it was called ap tryndamere once &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg893da", "score_hidden": false, "stickied": false, "created": 1492147480.0, "created_utc": 1492118680.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8k3aa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6j4pm", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "ivern nunu panth... look at easy high winrate champs. it takes very little skil to climb out of low elo with them", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ivern nunu panth... look at easy high winrate champs. it takes very little skil to climb out of low elo with them&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8k3aa", "score_hidden": false, "stickied": false, "created": 1492162113.0, "created_utc": 1492133313.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6j4pm", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "S0_B00sted", "parent_id": "t1_dg6emam", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "If there was a champion so good that *anyone* could climb just by playing said champion, it'd be pick/ban and Riot would have failed miserably at champion balance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If there was a champion so good that &lt;em&gt;anyone&lt;/em&gt; could climb just by playing said champion, it&amp;#39;d be pick/ban and Riot would have failed miserably at champion balance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6j4pm", "score_hidden": false, "stickied": false, "created": 1492058742.0, "created_utc": 1492029942.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7plrc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "A1t2o", "parent_id": "t1_dg6j5nx", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I don't have pro aspirations, I have 2 kids and a wife, but I still like this too because it bluntly says that how far you go in the time you have available (however you want to take that) is up to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have pro aspirations, I have 2 kids and a wife, but I still like this too because it bluntly says that how far you go in the time you have available (however you want to take that) is up to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7plrc", "score_hidden": false, "stickied": false, "created": 1492126311.0, "created_utc": 1492097511.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6j5nx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Howligan", "parent_id": "t1_dg6emam", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I have pro aspirations and I like that this touches on it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have pro aspirations and I like that this touches on it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6j5nx", "score_hidden": false, "stickied": false, "created": 1492058770.0, "created_utc": 1492029970.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6kal7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tmboett", "parent_id": "t1_dg6emam", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "That moment you look OPs op.gg 6 months later after he asked for help in this subreddit and he didnt follow a single advice given in his thread..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That moment you look OPs op.gg 6 months later after he asked for help in this subreddit and he didnt follow a single advice given in his thread..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6kal7", "score_hidden": false, "stickied": false, "created": 1492060020.0, "created_utc": 1492031220.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7m91p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tigermaw", "parent_id": "t1_dg6emam", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I find it interesting that people actually believe they are trying to climb. I know im just grinding soloQ games and not doing nearly enough to improve. Then again there are people stuck in bronze 5 so i guess it isnt to unrealistic", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find it interesting that people actually believe they are trying to climb. I know im just grinding soloQ games and not doing nearly enough to improve. Then again there are people stuck in bronze 5 so i guess it isnt to unrealistic&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7m91p", "score_hidden": false, "stickied": false, "created": 1492122571.0, "created_utc": 1492093771.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7oi6m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "raikmond", "parent_id": "t1_dg7mmso", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Of course it's a generalization that holds true for 99% of people, who don't have a problem like yours. You are that 1% that require a different, much more specific advice. Sorry about that, by the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course it&amp;#39;s a generalization that holds true for 99% of people, who don&amp;#39;t have a problem like yours. You are that 1% that require a different, much more specific advice. Sorry about that, by the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7oi6m", "score_hidden": false, "stickied": false, "created": 1492125124.0, "created_utc": 1492096324.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7ph3i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "A1t2o", "parent_id": "t1_dg7mmso", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "You would have the same issue if you looked for advice on becoming a body builder. A genetic problem goes beyond a general motivational statement to the masses on the internet. Not everyone has the same potential or the same disadvantages in life and you can't blame them on others. I'm sorry that you have a genetic problem that limits your potential, but the point was that you should look at this in the mindset of \"what you do from here is up to you\". If you really want something then you should work hard for it. \n\nComplaining about someone saying \"there is nothing holding you back\" won't get you anywhere. You could give examples of starving kids in Africa that don't have computer access being held back as well, but that's life and you just have to work with your situation. No one knows your situation like you do, so you are the one with the most control over yourself. Its the same as people blaming their teammates, you can't control them you can only control yourself so focus on that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You would have the same issue if you looked for advice on becoming a body builder. A genetic problem goes beyond a general motivational statement to the masses on the internet. Not everyone has the same potential or the same disadvantages in life and you can&amp;#39;t blame them on others. I&amp;#39;m sorry that you have a genetic problem that limits your potential, but the point was that you should look at this in the mindset of &amp;quot;what you do from here is up to you&amp;quot;. If you really want something then you should work hard for it. &lt;/p&gt;\n\n&lt;p&gt;Complaining about someone saying &amp;quot;there is nothing holding you back&amp;quot; won&amp;#39;t get you anywhere. You could give examples of starving kids in Africa that don&amp;#39;t have computer access being held back as well, but that&amp;#39;s life and you just have to work with your situation. No one knows your situation like you do, so you are the one with the most control over yourself. Its the same as people blaming their teammates, you can&amp;#39;t control them you can only control yourself so focus on that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7ph3i", "score_hidden": false, "stickied": false, "created": 1492126175.0, "created_utc": 1492097375.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8agkr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skeron", "parent_id": "t1_dg7mmso", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "It was an open letter to the general population, and not to extremely fringe cases. Of course there's going to be outliers to which is advice won't apply.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was an open letter to the general population, and not to extremely fringe cases. Of course there&amp;#39;s going to be outliers to which is advice won&amp;#39;t apply.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8agkr", "score_hidden": false, "stickied": false, "created": 1492149178.0, "created_utc": 1492120378.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mmso", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Maxumilian", "parent_id": "t1_dg6emam", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "&gt;  You get out what you put in\n\nNot always. Sometimes you get less out than you put in. My biggest problem with this post was his comment on the physical. It comes from a person who has no impediments to their success.\n\nI have a genetic problem in my arms that causes me to have recurring tumors which cause me pain when playing League. My mouse accuracy is awful. I can't change that no matter how much I practice. It physically pains me to play League and no matter how much effort I put in I'll never be as quick or accurate as my brain is. I can see everything in my head but my hands simply can't move fast enough because of the pain and genetic restrictions.\n\nSo it's all well and good to say there's nothing holding you back, you just aren't putting in enough effort. But there can be things holding you back regardless of your effort. You don't always get out what you put in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You get out what you put in&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not always. Sometimes you get less out than you put in. My biggest problem with this post was his comment on the physical. It comes from a person who has no impediments to their success.&lt;/p&gt;\n\n&lt;p&gt;I have a genetic problem in my arms that causes me to have recurring tumors which cause me pain when playing League. My mouse accuracy is awful. I can&amp;#39;t change that no matter how much I practice. It physically pains me to play League and no matter how much effort I put in I&amp;#39;ll never be as quick or accurate as my brain is. I can see everything in my head but my hands simply can&amp;#39;t move fast enough because of the pain and genetic restrictions.&lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s all well and good to say there&amp;#39;s nothing holding you back, you just aren&amp;#39;t putting in enough effort. But there can be things holding you back regardless of your effort. You don&amp;#39;t always get out what you put in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7mmso", "score_hidden": false, "stickied": false, "created": 1492123018.0, "created_utc": 1492094218.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6emam", "gilded": 0, "archived": false, "score": 112, "report_reasons": null, "author": "Youbestnotmisss", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "&gt;We don't want the real answer. We want to give ourselves the illusion of trying\n\nTotally agree with this. The most frustrating part of this sub is people looking for the easy answer to climbing, particularly with champion pool questions. If the answer to climbing was *play X champion* everyone would climb. But the truth is that if you're stuck in soloQ it often takes some decent level of commitment to climb, and asking a couple of simple questions on summoner school is not the answer. You get out what you put in, as with most stuff in life\n\n\nThe rest... seems a bit more applicable to players with serious pro aspirations than your average soloQ guy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We don&amp;#39;t want the real answer. We want to give ourselves the illusion of trying&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Totally agree with this. The most frustrating part of this sub is people looking for the easy answer to climbing, particularly with champion pool questions. If the answer to climbing was &lt;em&gt;play X champion&lt;/em&gt; everyone would climb. But the truth is that if you&amp;#39;re stuck in soloQ it often takes some decent level of commitment to climb, and asking a couple of simple questions on summoner school is not the answer. You get out what you put in, as with most stuff in life&lt;/p&gt;\n\n&lt;p&gt;The rest... seems a bit more applicable to players with serious pro aspirations than your average soloQ guy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6emam", "score_hidden": false, "stickied": false, "created": 1492054106.0, "created_utc": 1492025306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 112}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7kldx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rathyAro", "parent_id": "t1_dg7f886", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "The thing is, people only get to the point of putting in those hours if they feel compelled to. If you are good to start you will be encouraged to keep playing/practicing. If nothing else, talent at least motivates you to keep going.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is, people only get to the point of putting in those hours if they feel compelled to. If you are good to start you will be encouraged to keep playing/practicing. If nothing else, talent at least motivates you to keep going.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7kldx", "score_hidden": false, "stickied": false, "created": 1492120545.0, "created_utc": 1492091745.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8i0zj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Essex626", "parent_id": "t1_dg8g0be", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Right, talents aren't just a gift. Very few people are so gifted that it requires little effort to excel at something. But people have different levels of inherent ability. \n\nGeorge Fant is an offensive lineman for the Seattle Seahawks. He's not great compared to the NFL at large, but he's in the NFL. That makes him the top 1% of the top 1% of football players in the world. When the Seahawks signed him, he hadn't played football since junior high. He was a basketball player. His talent made him better suited to fill the position and perform than people who had been playing his position all through high school and college. \n\nSome people excel in school with very little effort. Some people study for hours to pass their classes. Some people can learn technology with ease. Some people can't use a smartphone. There's effort in all of this, but there's also innate ability. \n\nI'm not discounting hard work. Nobody excels workout hard work. But to ignore the effect of talent can lead to denigrating the efforts of those less talented than yourself. Sometimes someone puts all their effort towards something, but they will never be better than average. Their effort should not be ~~speed~~ sneered at just because the outcome is limited by their talent. \n\nEDIT: Spelling\n\n", "edited": 1492131528.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, talents aren&amp;#39;t just a gift. Very few people are so gifted that it requires little effort to excel at something. But people have different levels of inherent ability. &lt;/p&gt;\n\n&lt;p&gt;George Fant is an offensive lineman for the Seattle Seahawks. He&amp;#39;s not great compared to the NFL at large, but he&amp;#39;s in the NFL. That makes him the top 1% of the top 1% of football players in the world. When the Seahawks signed him, he hadn&amp;#39;t played football since junior high. He was a basketball player. His talent made him better suited to fill the position and perform than people who had been playing his position all through high school and college. &lt;/p&gt;\n\n&lt;p&gt;Some people excel in school with very little effort. Some people study for hours to pass their classes. Some people can learn technology with ease. Some people can&amp;#39;t use a smartphone. There&amp;#39;s effort in all of this, but there&amp;#39;s also innate ability. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not discounting hard work. Nobody excels workout hard work. But to ignore the effect of talent can lead to denigrating the efforts of those less talented than yourself. Sometimes someone puts all their effort towards something, but they will never be better than average. Their effort should not be &lt;del&gt;speed&lt;/del&gt; sneered at just because the outcome is limited by their talent. &lt;/p&gt;\n\n&lt;p&gt;EDIT: Spelling&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8i0zj", "score_hidden": false, "stickied": false, "created": 1492159288.0, "created_utc": 1492130488.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8g0be", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Shavark", "parent_id": "t1_dg7qxaw", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I'm still under the impression that talents aren't given, they are earned. 9 times out of 10, if you tell someone in the NBA \"Wow, you're really gifted to have such a talent\" They'll probably be Offended or a little irritated that there 20,000+ hours of hard work gets scratched off as \"a great talent\" instead of genuine deliberate practice.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m still under the impression that talents aren&amp;#39;t given, they are earned. 9 times out of 10, if you tell someone in the NBA &amp;quot;Wow, you&amp;#39;re really gifted to have such a talent&amp;quot; They&amp;#39;ll probably be Offended or a little irritated that there 20,000+ hours of hard work gets scratched off as &amp;quot;a great talent&amp;quot; instead of genuine deliberate practice.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8g0be", "score_hidden": false, "stickied": false, "created": 1492156506.0, "created_utc": 1492127706.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qxaw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Essex626", "parent_id": "t1_dg7f886", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "It is undeniable that excellence requires practice and effort.  It is also undeniable that anyone can achieve a level of expertise and excellence with sufficient practice.\n\nWhat I doubt the book proves, or even supposes, is that the same level of practice will result in the same level of expertise for two different people.  \n\nTalent comes in two forms: one is the innate ability that lets a person start more easily. The other is the ability to progress further in a field with the same amount of effort.  Whether that talent is a product of genetics, upbringing and experience, personality, or something else, it exists.\n\nIt's not an either/or proposition.  People who are truly great at something put in a lot of hard work, and most people can become experts at something with enough effort.  At the same time, people have talents that make it easier for them to become great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is undeniable that excellence requires practice and effort.  It is also undeniable that anyone can achieve a level of expertise and excellence with sufficient practice.&lt;/p&gt;\n\n&lt;p&gt;What I doubt the book proves, or even supposes, is that the same level of practice will result in the same level of expertise for two different people.  &lt;/p&gt;\n\n&lt;p&gt;Talent comes in two forms: one is the innate ability that lets a person start more easily. The other is the ability to progress further in a field with the same amount of effort.  Whether that talent is a product of genetics, upbringing and experience, personality, or something else, it exists.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not an either/or proposition.  People who are truly great at something put in a lot of hard work, and most people can become experts at something with enough effort.  At the same time, people have talents that make it easier for them to become great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7qxaw", "score_hidden": false, "stickied": false, "created": 1492127717.0, "created_utc": 1492098917.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7f886", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Shavark", "parent_id": "t1_dg6vzrv", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "The book peak: secrets from the new science of expertise Kind of debunks \"talent\" as a whole. I wont deny Genetic fortune as this helps tremendously in sports but any player has the power to learn/grow in there field.\n\n it all really comes down to thousands apon thousands of deliberate practice. Average casual playing isn't considered practice even though most people would count it as such. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The book peak: secrets from the new science of expertise Kind of debunks &amp;quot;talent&amp;quot; as a whole. I wont deny Genetic fortune as this helps tremendously in sports but any player has the power to learn/grow in there field.&lt;/p&gt;\n\n&lt;p&gt;it all really comes down to thousands apon thousands of deliberate practice. Average casual playing isn&amp;#39;t considered practice even though most people would count it as such. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7f886", "score_hidden": false, "stickied": false, "created": 1492111863.0, "created_utc": 1492083063.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vzrv", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Essex626", "parent_id": "t1_dg6h3zo", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "If you ask a professional athlete how they got there, and they were totally honest, they would answer: hard work, practice, freakish talent, genetic fortune, and a dash of luck.  Mind you, you never discover that you have the talent or the luck without the hard work and the practice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you ask a professional athlete how they got there, and they were totally honest, they would answer: hard work, practice, freakish talent, genetic fortune, and a dash of luck.  Mind you, you never discover that you have the talent or the luck without the hard work and the practice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6vzrv", "score_hidden": false, "stickied": false, "created": 1492074271.0, "created_utc": 1492045471.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg73fx4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GraySharpies", "parent_id": "t1_dg71pp5", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Bingo, mainly the secret \"ticket to success\" is just being open minded and thinking about the game critically,  abstractly and creativley and applying what you leanred from past mistakes into future situations and being mentally engaged with every game you play. Mainly its understanding how to actually learn, which alot of people were never taught how to actually learn, just how to memorize and regurgiate facts. When you understand how to learn and how to be okay with mistakes, being realistically optimistic and keeping and fostering a positive mindset focused around self growth you can start asking yourself the main question that you base all of your learning off of which is \"What is the most effective and efficent way to win a game of League\" . Once you break that.down to its core you have a foundation to start building and cultivating skill around", "edited": 1492057338.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bingo, mainly the secret &amp;quot;ticket to success&amp;quot; is just being open minded and thinking about the game critically,  abstractly and creativley and applying what you leanred from past mistakes into future situations and being mentally engaged with every game you play. Mainly its understanding how to actually learn, which alot of people were never taught how to actually learn, just how to memorize and regurgiate facts. When you understand how to learn and how to be okay with mistakes, being realistically optimistic and keeping and fostering a positive mindset focused around self growth you can start asking yourself the main question that you base all of your learning off of which is &amp;quot;What is the most effective and efficent way to win a game of League&amp;quot; . Once you break that.down to its core you have a foundation to start building and cultivating skill around&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg73fx4", "score_hidden": false, "stickied": false, "created": 1492083910.0, "created_utc": 1492055110.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7ae5n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hased", "parent_id": "t1_dg78otr", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "the pro adc freeze (dunno if he actually plays anymore) got into lcs and was considered as one of the best EU adcs after playing league for just a year. thats definitely possible without playing several thousand games", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the pro adc freeze (dunno if he actually plays anymore) got into lcs and was considered as one of the best EU adcs after playing league for just a year. thats definitely possible without playing several thousand games&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7ae5n", "score_hidden": false, "stickied": false, "created": 1492097932.0, "created_utc": 1492069132.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78otr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "akajohn15", "parent_id": "t1_dg71pp5", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "4k was a stretch, but challenger &gt;1000 games. I would doubt that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;4k was a stretch, but challenger &amp;gt;1000 games. I would doubt that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg78otr", "score_hidden": false, "stickied": false, "created": 1492093417.0, "created_utc": 1492064617.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7cfnj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baziltheblade", "parent_id": "t1_dg71pp5", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "In my experience, though, these people play a lot of games.\n\nSo although it looks as though they're absorbing massive amounts of new info, in reality they're putting new values into an existing framework.\n\nSo yeah, if you've played tons of Dota or Diablo or whstever at a decent level, you can hit challenger pretty quick. But that's not quite a fair comparison vs someone that has never played anything before.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience, though, these people play a lot of games.&lt;/p&gt;\n\n&lt;p&gt;So although it looks as though they&amp;#39;re absorbing massive amounts of new info, in reality they&amp;#39;re putting new values into an existing framework.&lt;/p&gt;\n\n&lt;p&gt;So yeah, if you&amp;#39;ve played tons of Dota or Diablo or whstever at a decent level, you can hit challenger pretty quick. But that&amp;#39;s not quite a fair comparison vs someone that has never played anything before.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7cfnj", "score_hidden": false, "stickied": false, "created": 1492104042.0, "created_utc": 1492075242.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71pp5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Whober", "parent_id": "t1_dg6y0ep", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "You don't need 4k games to get to challenger in 1 season of playing, you need to be able to absorb information very quickly and learn from/accept your mistakes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t need 4k games to get to challenger in 1 season of playing, you need to be able to absorb information very quickly and learn from/accept your mistakes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg71pp5", "score_hidden": false, "stickied": false, "created": 1492081468.0, "created_utc": 1492052668.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6yais", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tinyfred", "parent_id": "t1_dg6y0ep", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I don't think you understand my comment.\n\nI'm here to say that time invested in LoL doesn't directly correlate to better skills and higher elo.\n\nSome people will spend 1000 hours on League and become Challenger, some spend 5000 hours and are still bronze.\n\nThat's my point.\n\nEffective use of your time and practice is a real thing.\n\nGo on this website: https://wol.gg/\n\nAnd look and their ladder of players who have spent the most hours on League.\n\nYou'll understand my point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you understand my comment.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m here to say that time invested in LoL doesn&amp;#39;t directly correlate to better skills and higher elo.&lt;/p&gt;\n\n&lt;p&gt;Some people will spend 1000 hours on League and become Challenger, some spend 5000 hours and are still bronze.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s my point.&lt;/p&gt;\n\n&lt;p&gt;Effective use of your time and practice is a real thing.&lt;/p&gt;\n\n&lt;p&gt;Go on this website: &lt;a href=\"https://wol.gg/\"&gt;https://wol.gg/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And look and their ladder of players who have spent the most hours on League.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll understand my point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6yais", "score_hidden": false, "stickied": false, "created": 1492077111.0, "created_utc": 1492048311.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7d2xf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Morkinis", "parent_id": "t1_dg6y0ep", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "You could also just main support.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could also just main support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7d2xf", "score_hidden": false, "stickied": false, "created": 1492106022.0, "created_utc": 1492077222.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg89a9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Frolossus", "parent_id": "t1_dg6y0ep", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "rush did it in i think his first season or so", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;rush did it in i think his first season or so&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg89a9x", "score_hidden": false, "stickied": false, "created": 1492147714.0, "created_utc": 1492118914.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6y0ep", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Stenell", "parent_id": "t1_dg6rlld", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Sure, if you can fit thousands of games into that time period. But saying you crammed 4k games into a season isn't the same as saying \"I got challenger in a year\". It's \"I got challenger in 4k games\"\n\nAnd even that is a small amount.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure, if you can fit thousands of games into that time period. But saying you crammed 4k games into a season isn&amp;#39;t the same as saying &amp;quot;I got challenger in a year&amp;quot;. It&amp;#39;s &amp;quot;I got challenger in 4k games&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And even that is a small amount.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6y0ep", "score_hidden": false, "stickied": false, "created": 1492076762.0, "created_utc": 1492047962.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7m8d6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tinyfred", "parent_id": "t1_dg7kppj", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I specifically mentionned in my comment that while a part of it is intrinsic skill, a large majority has to do with people practicing smartly.\n\nSo no I'm not assuming everyone starts at 0.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I specifically mentionned in my comment that while a part of it is intrinsic skill, a large majority has to do with people practicing smartly.&lt;/p&gt;\n\n&lt;p&gt;So no I&amp;#39;m not assuming everyone starts at 0.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7m8d6", "score_hidden": false, "stickied": false, "created": 1492122548.0, "created_utc": 1492093748.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kppj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rathyAro", "parent_id": "t1_dg6rlld", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "You're assuming that everyone starts at 0 when they play league. If you played dota obviously you have an edge. If you played and competitive game you have an edge. So on and so forth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re assuming that everyone starts at 0 when they play league. If you played dota obviously you have an edge. If you played and competitive game you have an edge. So on and so forth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7kppj", "score_hidden": false, "stickied": false, "created": 1492120696.0, "created_utc": 1492091896.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rlld", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "tinyfred", "parent_id": "t1_dg6r3f2", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Im not talking about smurfs, I know people who started in S5 and are Masters/Chall.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im not talking about smurfs, I know people who started in S5 and are Masters/Chall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6rlld", "score_hidden": false, "stickied": false, "created": 1492068919.0, "created_utc": 1492040119.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7tdxd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PsychicFoxWithSpoons", "parent_id": "t1_dg78xmq", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I started in Bronze and it was wholly due to being new. My game sense was decent but my mechanics were just...bad. I couldn't win lane or CS. Without money I had nothing to turn into objectives.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started in Bronze and it was wholly due to being new. My game sense was decent but my mechanics were just...bad. I couldn&amp;#39;t win lane or CS. Without money I had nothing to turn into objectives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7tdxd", "score_hidden": false, "stickied": false, "created": 1492130344.0, "created_utc": 1492101544.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7gk9l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CUMGUZZLER_9000", "parent_id": "t1_dg78xmq", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "A ton of bronzies are really just new to the game. I don't think you meant it that way but to me your post comes across like you're just trashtalking bronzies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A ton of bronzies are really just new to the game. I don&amp;#39;t think you meant it that way but to me your post comes across like you&amp;#39;re just trashtalking bronzies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7gk9l", "score_hidden": false, "stickied": false, "created": 1492114577.0, "created_utc": 1492085777.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78xmq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Tadhgdagis", "parent_id": "t1_dg787p8", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Bronze is for those who literally don't and never will understand the objectives of the game. Even if all you ever want to do is get caught looking for a fight in the river, showing competency in pretty much any other aspect of the game will allow you to do just that in an entirely different skill tier.\n\nWhen I first played ranked, I went from unranked random matches against gold/play to placing in high silver, and tileted into bronze trying to force teams to split push. When I finally accepted my date to climb back was ridiculously easy. Bronze one tops have no idea how to CS or how to harass. None. I was at a party and an acquaintance started ranting about LoL. Nothing he said made sense/was absolutely counter to the right strats/analysis. Asked him what rank he was. Bronze. Bronze is there to demonstrate Dunning-Krueger", "edited": 1492065624.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bronze is for those who literally don&amp;#39;t and never will understand the objectives of the game. Even if all you ever want to do is get caught looking for a fight in the river, showing competency in pretty much any other aspect of the game will allow you to do just that in an entirely different skill tier.&lt;/p&gt;\n\n&lt;p&gt;When I first played ranked, I went from unranked random matches against gold/play to placing in high silver, and tileted into bronze trying to force teams to split push. When I finally accepted my date to climb back was ridiculously easy. Bronze one tops have no idea how to CS or how to harass. None. I was at a party and an acquaintance started ranting about LoL. Nothing he said made sense/was absolutely counter to the right strats/analysis. Asked him what rank he was. Bronze. Bronze is there to demonstrate Dunning-Krueger&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg78xmq", "score_hidden": false, "stickied": false, "created": 1492094027.0, "created_utc": 1492065227.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg787p8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PsychicFoxWithSpoons", "parent_id": "t1_dg6r3f2", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "And those who did already have tons of experience in other games. Dota, Starcraft, HON, WoW, anything with a similar control scheme and objective is going to give you a massive edge! Every game you play in one of those games counts as a game of League.\n\nAny genuine newbies will always end up in Bronze. They can end up in S5 at the end of the season because people throw hard at that point and you won't get demoted easily, but that's honestly still a bronze level of play.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And those who did already have tons of experience in other games. Dota, Starcraft, HON, WoW, anything with a similar control scheme and objective is going to give you a massive edge! Every game you play in one of those games counts as a game of League.&lt;/p&gt;\n\n&lt;p&gt;Any genuine newbies will always end up in Bronze. They can end up in S5 at the end of the season because people throw hard at that point and you won&amp;#39;t get demoted easily, but that&amp;#39;s honestly still a bronze level of play.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg787p8", "score_hidden": false, "stickied": false, "created": 1492092309.0, "created_utc": 1492063509.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6r3f2", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "tankmanlol", "parent_id": "t1_dg6pp65", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Challenger accounts with &lt;200 games played aren't people who just picked up the game and magically (or smartly) got great at it, they're new accounts of people who have been playing for way more than a single year. Not to discount the practicing smartly part, but even with smart practice it still takes years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Challenger accounts with &amp;lt;200 games played aren&amp;#39;t people who just picked up the game and magically (or smartly) got great at it, they&amp;#39;re new accounts of people who have been playing for way more than a single year. Not to discount the practicing smartly part, but even with smart practice it still takes years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6r3f2", "score_hidden": false, "stickied": false, "created": 1492068307.0, "created_utc": 1492039507.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7828v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Herculix", "parent_id": "t1_dg6pp65", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I don't know.  I would say actually playing a lot of League will make you automatically better, if you truly play every game with the intent to improve and are actively marking your successes and failures and measuring them up to a standard of perfection.  Simply playing the game without a concentrated effort, no.  If you don't want to be great at something you just won't be.  But if you want it and you keep trying, you will slowly approach expertise, even if it isn't greatness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know.  I would say actually playing a lot of League will make you automatically better, if you truly play every game with the intent to improve and are actively marking your successes and failures and measuring them up to a standard of perfection.  Simply playing the game without a concentrated effort, no.  If you don&amp;#39;t want to be great at something you just won&amp;#39;t be.  But if you want it and you keep trying, you will slowly approach expertise, even if it isn&amp;#39;t greatness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7828v", "score_hidden": false, "stickied": false, "created": 1492091959.0, "created_utc": 1492063159.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pp65", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tinyfred", "parent_id": "t1_dg6h3zo", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yeah I feel like effective practice is also a reality.\n\nSimply playing a lot of League isn't going to make you automatically better.\n\nWebsites like \"wasted on lol\" prove that.\n\nSome of the people with the most amount of hours played on League are still Bronze, while you have people in Masters/Chall who have been playing for less than a year.\n\nThere is part of it that is intrinsic skill, but also a large majority is people practicing smartly, and approaching the game in the right way.\n\nSummoner School fills that need very nicely. People who have already been through the grind can help others not make the same mistakes and hopefully take less time to get to the point they're at.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I feel like effective practice is also a reality.&lt;/p&gt;\n\n&lt;p&gt;Simply playing a lot of League isn&amp;#39;t going to make you automatically better.&lt;/p&gt;\n\n&lt;p&gt;Websites like &amp;quot;wasted on lol&amp;quot; prove that.&lt;/p&gt;\n\n&lt;p&gt;Some of the people with the most amount of hours played on League are still Bronze, while you have people in Masters/Chall who have been playing for less than a year.&lt;/p&gt;\n\n&lt;p&gt;There is part of it that is intrinsic skill, but also a large majority is people practicing smartly, and approaching the game in the right way.&lt;/p&gt;\n\n&lt;p&gt;Summoner School fills that need very nicely. People who have already been through the grind can help others not make the same mistakes and hopefully take less time to get to the point they&amp;#39;re at.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6pp65", "score_hidden": false, "stickied": false, "created": 1492066562.0, "created_utc": 1492037762.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg8cwuk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "superworking", "parent_id": "t1_dg6h3zo", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "It's like when someone asks me what they need to do to get better at downhill mountain biking... the only answer I can give is really to just stop sucking. I'm terrible at league and unlikely to really improve, but I'm 100% aware of the fact that it's because I'm really not working on it. I see a lot of people saying \"but I play one champ a million games\" and it's like yea that's not necessarily practice. Practice and repetition are not the same thing, and doing one without the other is completely ineffective, or at times even detrimental.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like when someone asks me what they need to do to get better at downhill mountain biking... the only answer I can give is really to just stop sucking. I&amp;#39;m terrible at league and unlikely to really improve, but I&amp;#39;m 100% aware of the fact that it&amp;#39;s because I&amp;#39;m really not working on it. I see a lot of people saying &amp;quot;but I play one champ a million games&amp;quot; and it&amp;#39;s like yea that&amp;#39;s not necessarily practice. Practice and repetition are not the same thing, and doing one without the other is completely ineffective, or at times even detrimental.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8cwuk", "score_hidden": false, "stickied": false, "created": 1492152373.0, "created_utc": 1492123573.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6h3zo", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "lostempireh", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "If you ask a professional athlete how they got to where they are now, they will tell you something equivalent to hard work and practice. If you ask a professional poker player how the got to their level, they will tell you it involved playing a lot of poker and working their way up gradually.\n\nLearning resources like summoner school simply point you in the right direction and help your practice hours to not go to waste (I'm sure you have seen posts warning against autopiloting)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you ask a professional athlete how they got to where they are now, they will tell you something equivalent to hard work and practice. If you ask a professional poker player how the got to their level, they will tell you it involved playing a lot of poker and working their way up gradually.&lt;/p&gt;\n\n&lt;p&gt;Learning resources like summoner school simply point you in the right direction and help your practice hours to not go to waste (I&amp;#39;m sure you have seen posts warning against autopiloting)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6h3zo", "score_hidden": false, "stickied": false, "created": 1492056649.0, "created_utc": 1492027849.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg75l1l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Serene_Potato", "parent_id": "t1_dg6xxps", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "and playing nothing but galio  \nObvious freelo\nONE PUNCH", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;and playing nothing but galio&lt;br/&gt;\nObvious freelo\nONE PUNCH&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg75l1l", "score_hidden": false, "stickied": false, "created": 1492087222.0, "created_utc": 1492058422.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xxps", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6xxps", "score_hidden": false, "stickied": false, "created": 1492076672.0, "created_utc": 1492047872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7gelv", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Vally1", "parent_id": "t1_dg7fu7i", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Maybe it's because I've been playing video games all of my life but any game i pick up i become pretty good at them and rather quickly. I don't take anything for granted and learn off of every play that happens. I also do use a computer almost every day so if that is your issue then it has nothing to do with the game itself. Sure being accurate in mouse/keyboard clicks is useful but getting used to that again is rather simple and fast. The main portion of being good at league is decision making which you don't need to use a computer to understand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe it&amp;#39;s because I&amp;#39;ve been playing video games all of my life but any game i pick up i become pretty good at them and rather quickly. I don&amp;#39;t take anything for granted and learn off of every play that happens. I also do use a computer almost every day so if that is your issue then it has nothing to do with the game itself. Sure being accurate in mouse/keyboard clicks is useful but getting used to that again is rather simple and fast. The main portion of being good at league is decision making which you don&amp;#39;t need to use a computer to understand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7gelv", "score_hidden": false, "stickied": false, "created": 1492114294.0, "created_utc": 1492085494.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fu7i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fitzy0404", "parent_id": "t1_dg7fg54", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "From my experience I definitely become rusty after even 3-4 days. Whilst basic mechanics might not be lost if you're using a mouse and keyboard in your day-to-day life, for me I certainly lose any semblance of mechanical skill without constant practice. \n\nBut as they say, practice makes perfect.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From my experience I definitely become rusty after even 3-4 days. Whilst basic mechanics might not be lost if you&amp;#39;re using a mouse and keyboard in your day-to-day life, for me I certainly lose any semblance of mechanical skill without constant practice. &lt;/p&gt;\n\n&lt;p&gt;But as they say, practice makes perfect.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7fu7i", "score_hidden": false, "stickied": false, "created": 1492113179.0, "created_utc": 1492084379.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fg54", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Vally1", "parent_id": "t1_dg6nqbg", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "My experience with league is that you shouldn't need practice or warmup games. Every single game is practice as long as you actively think about what you're doing and what you should be doing. League isn't one of those things you can become rusty at unless you completely forget everything. I have taken 6 month breaks and come back and dove straight into ranked and did extremely well. \n\nSure focusing on learning to cs is good in the long run but it isn't needed. I have seen people in lower ranks who are cs gods if they are left alone to cs but as soon as they get pressured or the enemy just has better movement/placement than them they don't know what they're doing and crumble. Also playing normals is a waste of time if you want to get better. \n\nThink of ranked as a learning experience and play it like such. I've heard people say don't play first time champs you've never playing in ranked but for myself i can take 2 minutes looking at a champs abilities and know how to play them. Some people like myself can do this and other people need to one trick champs to climb because it's easier for them. Find what works for you and stick to it and master it, don't try and copy pros but instead innovate your own ideas and figure out why they may may not work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My experience with league is that you shouldn&amp;#39;t need practice or warmup games. Every single game is practice as long as you actively think about what you&amp;#39;re doing and what you should be doing. League isn&amp;#39;t one of those things you can become rusty at unless you completely forget everything. I have taken 6 month breaks and come back and dove straight into ranked and did extremely well. &lt;/p&gt;\n\n&lt;p&gt;Sure focusing on learning to cs is good in the long run but it isn&amp;#39;t needed. I have seen people in lower ranks who are cs gods if they are left alone to cs but as soon as they get pressured or the enemy just has better movement/placement than them they don&amp;#39;t know what they&amp;#39;re doing and crumble. Also playing normals is a waste of time if you want to get better. &lt;/p&gt;\n\n&lt;p&gt;Think of ranked as a learning experience and play it like such. I&amp;#39;ve heard people say don&amp;#39;t play first time champs you&amp;#39;ve never playing in ranked but for myself i can take 2 minutes looking at a champs abilities and know how to play them. Some people like myself can do this and other people need to one trick champs to climb because it&amp;#39;s easier for them. Find what works for you and stick to it and master it, don&amp;#39;t try and copy pros but instead innovate your own ideas and figure out why they may may not work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7fg54", "score_hidden": false, "stickied": false, "created": 1492112355.0, "created_utc": 1492083555.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nqbg", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Jiaozy", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Indeed an incredible read.\n\nIt's so true it hurts.\n\nThere are ***far too many*** guides and videos and threads on how to get to Diamond, I read them all and watched 100s of hours of videos and guides about climbing.\n\nI'm honestly trying to improve but often times it actually happens that I slack on my CS practice, because \"15 minutes is enough, I don't need the 20 I planned on doing\" and jump into a ranked game straight away, without even doing a Normal.\n\n\"I won't feed and should I give up a kill I'll play super safe!\"\n\n**facechecks a bush 3 minutes later and dies to jungler + laner* *\n\n\"I'll try and punish my lane opponent should I get a kill and push him out of lane!\"\n\n**Dies like a moron to a gank because of no wards* *\n\nAnd so on and so forth...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indeed an incredible read.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so true it hurts.&lt;/p&gt;\n\n&lt;p&gt;There are &lt;strong&gt;&lt;em&gt;far too many&lt;/em&gt;&lt;/strong&gt; guides and videos and threads on how to get to Diamond, I read them all and watched 100s of hours of videos and guides about climbing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m honestly trying to improve but often times it actually happens that I slack on my CS practice, because &amp;quot;15 minutes is enough, I don&amp;#39;t need the 20 I planned on doing&amp;quot; and jump into a ranked game straight away, without even doing a Normal.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I won&amp;#39;t feed and should I give up a kill I&amp;#39;ll play super safe!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;*&lt;em&gt;facechecks a bush 3 minutes later and dies to jungler + laner&lt;/em&gt; *&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ll try and punish my lane opponent should I get a kill and push him out of lane!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;*&lt;em&gt;Dies like a moron to a gank because of no wards&lt;/em&gt; *&lt;/p&gt;\n\n&lt;p&gt;And so on and so forth...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6nqbg", "score_hidden": false, "stickied": false, "created": 1492064133.0, "created_utc": 1492035333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg78og0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "VernacularRobot", "parent_id": "t1_dg6jp8i", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "\"How many times must you lose because of 'not playing well' before you realize your bias [sic] memories of peak performances have mislead u ?\"     \nGahtzu, Top 100 SSBM Player    \n\nI come from Melee before LoL, and Melee players are the least toxic about their game of any major esport I know. The game is the game. We choose this. We could've left for brawl or smash4, but 15 years later, it's us vs eachother: no patches, no lies.     \n\nI enjoy watching QT a lot because while he'll occasionally complain about Riot, he has more of this mentality than a lot of streamers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;How many times must you lose because of &amp;#39;not playing well&amp;#39; before you realize your bias [sic] memories of peak performances have mislead u ?&amp;quot;&lt;br/&gt;\nGahtzu, Top 100 SSBM Player    &lt;/p&gt;\n\n&lt;p&gt;I come from Melee before LoL, and Melee players are the least toxic about their game of any major esport I know. The game is the game. We choose this. We could&amp;#39;ve left for brawl or smash4, but 15 years later, it&amp;#39;s us vs eachother: no patches, no lies.     &lt;/p&gt;\n\n&lt;p&gt;I enjoy watching QT a lot because while he&amp;#39;ll occasionally complain about Riot, he has more of this mentality than a lot of streamers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg78og0", "score_hidden": false, "stickied": false, "created": 1492093390.0, "created_utc": 1492064590.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7mord", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Nuhjeea", "parent_id": "t1_dg7i4w3", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Most people blaming all their teammates don't actually expect to get Challenger+ or anything. There's so many people stuck in Bronze and silver who could climb out with moderate, more concentrated practice sessions. If you train like Westballz constantly, forget getting out of bronze Elo hell, I'd expect to get Master+ or something.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most people blaming all their teammates don&amp;#39;t actually expect to get Challenger+ or anything. There&amp;#39;s so many people stuck in Bronze and silver who could climb out with moderate, more concentrated practice sessions. If you train like Westballz constantly, forget getting out of bronze Elo hell, I&amp;#39;d expect to get Master+ or something.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7mord", "score_hidden": false, "stickied": false, "created": 1492123083.0, "created_utc": 1492094283.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7i4w3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "metallicrooster", "parent_id": "t1_dg78f22", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "That's literally the point. If you put in less than the best, you will be less than the best. If you put in less effort and dedication to improve than people in Diamond 1, guess what? You probably won't be Diamond 1. If you other parts of your life mean you put in less effort than a Gold 1, you probably won't be Gold 1. If you're like me and you only play once every few days it will be almost impossible to improve.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s literally the point. If you put in less than the best, you will be less than the best. If you put in less effort and dedication to improve than people in Diamond 1, guess what? You probably won&amp;#39;t be Diamond 1. If you other parts of your life mean you put in less effort than a Gold 1, you probably won&amp;#39;t be Gold 1. If you&amp;#39;re like me and you only play once every few days it will be almost impossible to improve.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7i4w3", "score_hidden": false, "stickied": false, "created": 1492117161.0, "created_utc": 1492088361.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78f22", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Nuhjeea", "parent_id": "t1_dg6jp8i", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "If we put in that extreme level of commitment, we'd all have to quit school/jobs/raising family. Yes, most of us don't put enough of a concentrated effort, but expecting Westballz level dedication would be insane for the average LoL gamer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If we put in that extreme level of commitment, we&amp;#39;d all have to quit school/jobs/raising family. Yes, most of us don&amp;#39;t put enough of a concentrated effort, but expecting Westballz level dedication would be insane for the average LoL gamer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg78f22", "score_hidden": false, "stickied": false, "created": 1492092776.0, "created_utc": 1492063976.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jp8i", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "CynicalTree", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "\"People always ask me how you get good.\nMy answer is to put your heart and soul into it not just your free time.\" Westballz, Top 10 Professional SSBM Player  \n\nDecide for yourself if you are really dedicating yourself or just killing time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;People always ask me how you get good.\nMy answer is to put your heart and soul into it not just your free time.&amp;quot; Westballz, Top 10 Professional SSBM Player  &lt;/p&gt;\n\n&lt;p&gt;Decide for yourself if you are really dedicating yourself or just killing time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6jp8i", "score_hidden": false, "stickied": false, "created": 1492059352.0, "created_utc": 1492030552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6y8i9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thatsuperopguy", "parent_id": "t1_dg6m84b", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Thanks for the advice man, though I do have a therapist already. Great post, by the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the advice man, though I do have a therapist already. Great post, by the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6y8i9", "score_hidden": false, "stickied": false, "created": 1492077041.0, "created_utc": 1492048241.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m84b", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Hautamaki", "parent_id": "t1_dg6h3j5", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "If you believe you have a real problem with life skills, you should get a licensed clinical therapist/psychologist.  Psychologists are not just for the seriously mentally ill; psychologists can help with all aspects of your mental life, from basic life skills like motivation/self discipline, self control, anxiety, social skills, professional skills, and so on.  If there's any aspect of your life you aren't happy with, no matter how trivial it might seem (and it can't be that trivial to YOU if you really aren't happy), then meeting a psychologist just to talk it over and possibly make a plan to improve on it can do a world of good.\n\nIf you feel you can't afford it or you aren't sure if it would be worth it or have any other hesitation, I can recommend the lectures of Jordan Peterson on youtube.  Here's one example but he has literally hundreds of hours of great stuff on YT.\n\nhttps://www.youtube.com/watch?v=rabylMBCPKs", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you believe you have a real problem with life skills, you should get a licensed clinical therapist/psychologist.  Psychologists are not just for the seriously mentally ill; psychologists can help with all aspects of your mental life, from basic life skills like motivation/self discipline, self control, anxiety, social skills, professional skills, and so on.  If there&amp;#39;s any aspect of your life you aren&amp;#39;t happy with, no matter how trivial it might seem (and it can&amp;#39;t be that trivial to YOU if you really aren&amp;#39;t happy), then meeting a psychologist just to talk it over and possibly make a plan to improve on it can do a world of good.&lt;/p&gt;\n\n&lt;p&gt;If you feel you can&amp;#39;t afford it or you aren&amp;#39;t sure if it would be worth it or have any other hesitation, I can recommend the lectures of Jordan Peterson on youtube.  Here&amp;#39;s one example but he has literally hundreds of hours of great stuff on YT.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=rabylMBCPKs\"&gt;https://www.youtube.com/watch?v=rabylMBCPKs&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6m84b", "score_hidden": false, "stickied": false, "created": 1492062285.0, "created_utc": 1492033485.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7w0j9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thatsuperopguy", "parent_id": "t1_dg7b2ur", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "\n\nthanks for the kind words man. honestly, i find the toxic players kind of refreshing because it reminds me how far i'm come as a person. but also, i can be pretty toxic myself :(. takethis seems pretty cool, and I think I'm gonna start using 3). have a great day. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks for the kind words man. honestly, i find the toxic players kind of refreshing because it reminds me how far i&amp;#39;m come as a person. but also, i can be pretty toxic myself :(. takethis seems pretty cool, and I think I&amp;#39;m gonna start using 3). have a great day. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7w0j9", "score_hidden": false, "stickied": false, "created": 1492133132.0, "created_utc": 1492104332.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b2ur", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "neuroniky", "parent_id": "t1_dg6h3j5", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I used to suffer from depression and I still suffer from anxiety and I can understand where you're coming from.\n\nLoL can be hard on you if you're playing with strangers because of the toxic playerbase and the kind of insults you end up receiving. \"You're useless, uninstall\" is easy to cope with if you just file it as a 14 years old guy spewing random stuff at you, it's far more difficult to deal with if you're feeling like you're useless in your real life and you're fighting just to get up from the bed every morning. Ladder can be also bad for you if you suffer from anxiety and you let it become another source of anxiety.\n\nThat said, you can approach LoL with good results and it can actually be helpful. I'm no therapist, but I can tell you the things that worked, and still work for me:\n\n1) It's ok to play to escape from the world for a little while, to ease the pressure and get a little space just for you, but you shouldn't just hide behind videogaming all the time. If you are playing several hours straight, that wouldn't make you better, it will just make you feel like you're wasting your time. So be mindful and don't overexceed playing.\n\n2) Don't play out of boredom. Playing videogames should be your choice, not an automatic reflex to follow whenever you feel you can't do anything. Make those videogaming sessions matter to you. It's a little step towards understanding that you can do a lot of different things if you just choose to.\n\n3) Set yourself small objectives, and focus on those. Like, \"I want to play mid today, and get 100 cs by 20 minutes\" or something. When you reach your objective, take a little time to congratulate yourself. Grab a cup of chocolate and marshmallows, or something like that. Again, it's important that you understand through the game that you can actually DO whatever you set yourself to. Just keep your objective reachable as setting the bar too high won't help, and never, ever base your objectives on winning or losing. You're not here to win or lose. You're here to play. \n\n4) If you can, play with friends, and make those sessions a way to stay with somebody that can be positive to you. If you can't, or even if you can, consider muting everyone at game start (but for your friend, obv :) ). Most information can be inferred from the game map, communicated with pings or got with common sense. Most things that will be said to you in chat won't help you play, and will actually be harmful. Don't fool yourself in thinking that you can cope. Whatever you think you can overlook, your body will keep the score.\n\n5) You don't need to play on ladder. Actually, it's probably better if you don't. Life is not a competition, and there's no reason to play videogames as a competition if you don't feel like it.\n\nYou're not alone, friend. No one of us ever is. \n\nOh, and you can also check this site, http://www.takethis.org/, it has a lot of content related to videogaming and mental health.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to suffer from depression and I still suffer from anxiety and I can understand where you&amp;#39;re coming from.&lt;/p&gt;\n\n&lt;p&gt;LoL can be hard on you if you&amp;#39;re playing with strangers because of the toxic playerbase and the kind of insults you end up receiving. &amp;quot;You&amp;#39;re useless, uninstall&amp;quot; is easy to cope with if you just file it as a 14 years old guy spewing random stuff at you, it&amp;#39;s far more difficult to deal with if you&amp;#39;re feeling like you&amp;#39;re useless in your real life and you&amp;#39;re fighting just to get up from the bed every morning. Ladder can be also bad for you if you suffer from anxiety and you let it become another source of anxiety.&lt;/p&gt;\n\n&lt;p&gt;That said, you can approach LoL with good results and it can actually be helpful. I&amp;#39;m no therapist, but I can tell you the things that worked, and still work for me:&lt;/p&gt;\n\n&lt;p&gt;1) It&amp;#39;s ok to play to escape from the world for a little while, to ease the pressure and get a little space just for you, but you shouldn&amp;#39;t just hide behind videogaming all the time. If you are playing several hours straight, that wouldn&amp;#39;t make you better, it will just make you feel like you&amp;#39;re wasting your time. So be mindful and don&amp;#39;t overexceed playing.&lt;/p&gt;\n\n&lt;p&gt;2) Don&amp;#39;t play out of boredom. Playing videogames should be your choice, not an automatic reflex to follow whenever you feel you can&amp;#39;t do anything. Make those videogaming sessions matter to you. It&amp;#39;s a little step towards understanding that you can do a lot of different things if you just choose to.&lt;/p&gt;\n\n&lt;p&gt;3) Set yourself small objectives, and focus on those. Like, &amp;quot;I want to play mid today, and get 100 cs by 20 minutes&amp;quot; or something. When you reach your objective, take a little time to congratulate yourself. Grab a cup of chocolate and marshmallows, or something like that. Again, it&amp;#39;s important that you understand through the game that you can actually DO whatever you set yourself to. Just keep your objective reachable as setting the bar too high won&amp;#39;t help, and never, ever base your objectives on winning or losing. You&amp;#39;re not here to win or lose. You&amp;#39;re here to play. &lt;/p&gt;\n\n&lt;p&gt;4) If you can, play with friends, and make those sessions a way to stay with somebody that can be positive to you. If you can&amp;#39;t, or even if you can, consider muting everyone at game start (but for your friend, obv :) ). Most information can be inferred from the game map, communicated with pings or got with common sense. Most things that will be said to you in chat won&amp;#39;t help you play, and will actually be harmful. Don&amp;#39;t fool yourself in thinking that you can cope. Whatever you think you can overlook, your body will keep the score.&lt;/p&gt;\n\n&lt;p&gt;5) You don&amp;#39;t need to play on ladder. Actually, it&amp;#39;s probably better if you don&amp;#39;t. Life is not a competition, and there&amp;#39;s no reason to play videogames as a competition if you don&amp;#39;t feel like it.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not alone, friend. No one of us ever is. &lt;/p&gt;\n\n&lt;p&gt;Oh, and you can also check this site, &lt;a href=\"http://www.takethis.org/\"&gt;http://www.takethis.org/&lt;/a&gt;, it has a lot of content related to videogaming and mental health.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7b2ur", "score_hidden": false, "stickied": false, "created": 1492099910.0, "created_utc": 1492071110.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dgaaxrl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thatsuperopguy", "parent_id": "t1_dg8a2ws", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "yeh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dgaaxrl", "score_hidden": false, "stickied": false, "created": 1492260701.0, "created_utc": 1492231901.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8a2ws", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Endless-Nine", "parent_id": "t1_dg6h3j5", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Major depressive disorder ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Major depressive disorder ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg8a2ws", "score_hidden": false, "stickied": false, "created": 1492148705.0, "created_utc": 1492119905.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6h3j5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "thatsuperopguy", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "If you can push yourself without hating yourself, you'll go far. -Hazel out\n\nCan I get some steps on this. I'm an MDD sufferer and the harder I push myself, the harder I burn out and the more draining it is to push myself. Your thesis is that League skills are a reflection of life skills, but what do we do if we have a problem with life skills?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you can push yourself without hating yourself, you&amp;#39;ll go far. -Hazel out&lt;/p&gt;\n\n&lt;p&gt;Can I get some steps on this. I&amp;#39;m an MDD sufferer and the harder I push myself, the harder I burn out and the more draining it is to push myself. Your thesis is that League skills are a reflection of life skills, but what do we do if we have a problem with life skills?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6h3j5", "score_hidden": false, "stickied": false, "created": 1492056635.0, "created_utc": 1492027835.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7eex6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mrtransisteur", "parent_id": "t1_dg6qfb7", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "wait- that means this coke habit is a-ok then..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wait- that means this coke habit is a-ok then..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7eex6", "score_hidden": false, "stickied": false, "created": 1492109887.0, "created_utc": 1492081087.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg9jgty", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "The_Ds_Knees", "parent_id": "t1_dg6qfb7", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "No, \"is a human\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, &amp;quot;is a human&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg9jgty", "score_hidden": false, "stickied": false, "created": 1492223517.0, "created_utc": 1492194717.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qfb7", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "cathartis", "parent_id": "t1_dg6m9xz", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I think that's another way of saying \"is a gamer\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s another way of saying &amp;quot;is a gamer&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qfb7", "score_hidden": false, "stickied": false, "created": 1492067480.0, "created_utc": 1492038680.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m9xz", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "6ThornmailRammus", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "&gt; you based your entire lifestyle on dopamine release\n\nHOW THE FUCK DOES HE KNOW", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you based your entire lifestyle on dopamine release&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;HOW THE FUCK DOES HE KNOW&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6m9xz", "score_hidden": false, "stickied": false, "created": 1492062345.0, "created_utc": 1492033545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6qnzq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dpistol", "parent_id": "t1_dg6qhaw", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yes and it's more detrimental in hockey because the skills you use are more skill based. I.e. Skating, shooting, stickhandling vs Running jumping throwing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes and it&amp;#39;s more detrimental in hockey because the skills you use are more skill based. I.e. Skating, shooting, stickhandling vs Running jumping throwing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qnzq", "score_hidden": false, "stickied": false, "created": 1492067779.0, "created_utc": 1492038979.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg78rw7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "akajohn15", "parent_id": "t1_dg6qhaw", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "This is honestlu something I've ever heard or thought about lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is honestlu something I&amp;#39;ve ever heard or thought about lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg78rw7", "score_hidden": false, "stickied": false, "created": 1492093624.0, "created_utc": 1492064824.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qhaw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lostempireh", "parent_id": "t1_dg6pdr8", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "As someone born near the end of August and competed in sports that use the academic year to decide age group cut offs, I can tell you that this handicap is very real. \n\nWhen you have had effectively a full extra year to grow and develop as for example a 9 year old then you will get better results early on and that will more than likely motivate you to practice harder and improve further, widening the gap from an early age.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone born near the end of August and competed in sports that use the academic year to decide age group cut offs, I can tell you that this handicap is very real. &lt;/p&gt;\n\n&lt;p&gt;When you have had effectively a full extra year to grow and develop as for example a 9 year old then you will get better results early on and that will more than likely motivate you to practice harder and improve further, widening the gap from an early age.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qhaw", "score_hidden": false, "stickied": false, "created": 1492067550.0, "created_utc": 1492038750.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6qph2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dpistol", "parent_id": "t1_dg6pdr8", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yea it's such an advantage. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea it&amp;#39;s such an advantage. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qph2", "score_hidden": false, "stickied": false, "created": 1492067829.0, "created_utc": 1492039029.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7auoz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VagrantPoet", "parent_id": "t1_dg6pdr8", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Malcolm Gladwell has a really good bit on it. Either on his podcast or in Outliers. \n\nBasically though it's about compounding advantages. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Malcolm Gladwell has a really good bit on it. Either on his podcast or in Outliers. &lt;/p&gt;\n\n&lt;p&gt;Basically though it&amp;#39;s about compounding advantages. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7auoz", "score_hidden": false, "stickied": false, "created": 1492099246.0, "created_utc": 1492070446.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pdr8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thievian", "parent_id": "t1_dg6l2rh", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "75% of players are born Jan - mar? Wuttttttttt", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;75% of players are born Jan - mar? Wuttttttttt&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6pdr8", "score_hidden": false, "stickied": false, "created": 1492066170.0, "created_utc": 1492037370.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7clur", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "baziltheblade", "parent_id": "t1_dg6l2rh", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "It's nothing to do with the leg-up they have in knowledge lol.\n\nIt's because the older kids are bigger and smarter (because they're older) so they get put into the A team, then by the time their 6-month advantage doesn't matter, they've been in the a team playing at a higher level and getting encouraged and stuff, so they've got a big lead.\n\nPoint being, it's more about feedback than knowledge. Kids love to do what you tell them they're good at, and hate to do what you tell them they're bad at. You're much more willing to grind when you see positive results quickly", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s nothing to do with the leg-up they have in knowledge lol.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s because the older kids are bigger and smarter (because they&amp;#39;re older) so they get put into the A team, then by the time their 6-month advantage doesn&amp;#39;t matter, they&amp;#39;ve been in the a team playing at a higher level and getting encouraged and stuff, so they&amp;#39;ve got a big lead.&lt;/p&gt;\n\n&lt;p&gt;Point being, it&amp;#39;s more about feedback than knowledge. Kids love to do what you tell them they&amp;#39;re good at, and hate to do what you tell them they&amp;#39;re bad at. You&amp;#39;re much more willing to grind when you see positive results quickly&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7clur", "score_hidden": false, "stickied": false, "created": 1492104560.0, "created_utc": 1492075760.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6l2rh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Dpistol", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Coming from a guy who played at a high level in traditional sports and went into coaching, I whole heartedly agree with what he is saying. I can't tell you how many times players and parents come up to me and ask \"How my son can get better at ....?\"  When I break down that question you realize how dumb it is. \n\nThink about it this way...a game like league of legends or any traditional sport is essentially (put the memes aside) 5D chess. Now in the context of 2D chess, you wouldn't ask the best chess player in the world, \"how do I get better at chess?\". Even people who master a game much simpler than league wouldn't be able to sum it up. It takes split second decision making based on your knowledge base, prior experience, talent, and consistency. These take years to grow in no matter what you do, and if you want a quick fix, you are cheating yourself. \n\nAnother note to take into account...in the NHL, 75 PERCENT of players are born in the first 3 months of the year. This is because once someone owns a higher knowledge base than you, they have a leg up and will bury you. There is no quick fix for you to be as good as players who have been diamond since season 1. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Coming from a guy who played at a high level in traditional sports and went into coaching, I whole heartedly agree with what he is saying. I can&amp;#39;t tell you how many times players and parents come up to me and ask &amp;quot;How my son can get better at ....?&amp;quot;  When I break down that question you realize how dumb it is. &lt;/p&gt;\n\n&lt;p&gt;Think about it this way...a game like league of legends or any traditional sport is essentially (put the memes aside) 5D chess. Now in the context of 2D chess, you wouldn&amp;#39;t ask the best chess player in the world, &amp;quot;how do I get better at chess?&amp;quot;. Even people who master a game much simpler than league wouldn&amp;#39;t be able to sum it up. It takes split second decision making based on your knowledge base, prior experience, talent, and consistency. These take years to grow in no matter what you do, and if you want a quick fix, you are cheating yourself. &lt;/p&gt;\n\n&lt;p&gt;Another note to take into account...in the NHL, 75 PERCENT of players are born in the first 3 months of the year. This is because once someone owns a higher knowledge base than you, they have a leg up and will bury you. There is no quick fix for you to be as good as players who have been diamond since season 1. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6l2rh", "score_hidden": false, "stickied": false, "created": 1492060922.0, "created_utc": 1492032122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6qq9v", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "zacharyan100", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Most people don't have a resource to improve other than themselves and playing everyday. That will get you only so far IMO. You can go down to the park and play pick-up basketball everyday for a year and improve, but maybe not in the areas you need to. How many people have played ball with a dude that can knock down baskets from anywhere on the court *while standing still?* It's going to be very easy to shut these guys down when you realize that they can't dribble or pass. They can't dribble or pass because they haven't had someone watching them play and correcting every little technical error they make so it takes them significantly longer to figure it out. Gaming is very similar in that way. Most people are self-taught and don't have a dad or coach teaching them how to play right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most people don&amp;#39;t have a resource to improve other than themselves and playing everyday. That will get you only so far IMO. You can go down to the park and play pick-up basketball everyday for a year and improve, but maybe not in the areas you need to. How many people have played ball with a dude that can knock down baskets from anywhere on the court &lt;em&gt;while standing still?&lt;/em&gt; It&amp;#39;s going to be very easy to shut these guys down when you realize that they can&amp;#39;t dribble or pass. They can&amp;#39;t dribble or pass because they haven&amp;#39;t had someone watching them play and correcting every little technical error they make so it takes them significantly longer to figure it out. Gaming is very similar in that way. Most people are self-taught and don&amp;#39;t have a dad or coach teaching them how to play right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qq9v", "score_hidden": false, "stickied": false, "created": 1492067857.0, "created_utc": 1492039057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg71awz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "compy_mx", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "How to climb\n\n1. You must be willing to criticize yourself (the main obstacle for most people who see themselves as \"stuck\" with bad teams)\n\n2. ...Without letting your mood suffer. (The main obstacle for people like me who have serious depression and self-esteem issues)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How to climb&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;You must be willing to criticize yourself (the main obstacle for most people who see themselves as &amp;quot;stuck&amp;quot; with bad teams)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;...Without letting your mood suffer. (The main obstacle for people like me who have serious depression and self-esteem issues)&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg71awz", "score_hidden": false, "stickied": false, "created": 1492080923.0, "created_utc": 1492052123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7pe9g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Owneh", "parent_id": "t1_dg7paka", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I recommend watching koreans in the same matchup and watch how they deal with it. When you straight up lose trades, there's a lot of ways to circumvent this, just look for Akali 1tricks in KR or other regions, look for a kled on the enemy team and watch how it plays out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recommend watching koreans in the same matchup and watch how they deal with it. When you straight up lose trades, there&amp;#39;s a lot of ways to circumvent this, just look for Akali 1tricks in KR or other regions, look for a kled on the enemy team and watch how it plays out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7pe9g", "score_hidden": false, "stickied": false, "created": 1492126092.0, "created_utc": 1492097292.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7yce7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Prof_Bunghole", "parent_id": "t1_dg7paka", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "u/Owneh is right. You know the problem. Sure the surface problem is that you didn't have a high enough cs/min, but the real problem is you don't know how to play the match up. So go learn it. This is exactly what the post is saying. You know the problem, you just aren't looking for the solution.  \n\n&gt;So another game, again nothing learned and I end up in the loop you are describing.  \n\nYou did learn something though. You learned a little bit about the Akali match up that you didn't before, and you also learned that you don't know how to play the Kled/Akali lane. This means if you want to get better, you should look into how Akali works, and look into how the specific match up works.   \n\nTo learn Akali, either play her or watch some professor akali videos. Check [this](http://matchup.gg/matchup/Kled/Akali/TOP) out to start getting a better idea of what to do in the match up. It looks to me like it is a bad match up for you (I have never played it so I don't know for sure), so maybe consider having another top champion to play if you see an akali pick on the other team.  \n\nI could say so much more, but I hope this gets my general point across. You are ALWAYS learning something from a game. If you know the problem, but don't know how to solve it, ASK how to solve it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/Owneh\"&gt;u/Owneh&lt;/a&gt; is right. You know the problem. Sure the surface problem is that you didn&amp;#39;t have a high enough cs/min, but the real problem is you don&amp;#39;t know how to play the match up. So go learn it. This is exactly what the post is saying. You know the problem, you just aren&amp;#39;t looking for the solution.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So another game, again nothing learned and I end up in the loop you are describing.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You did learn something though. You learned a little bit about the Akali match up that you didn&amp;#39;t before, and you also learned that you don&amp;#39;t know how to play the Kled/Akali lane. This means if you want to get better, you should look into how Akali works, and look into how the specific match up works.   &lt;/p&gt;\n\n&lt;p&gt;To learn Akali, either play her or watch some professor akali videos. Check &lt;a href=\"http://matchup.gg/matchup/Kled/Akali/TOP\"&gt;this&lt;/a&gt; out to start getting a better idea of what to do in the match up. It looks to me like it is a bad match up for you (I have never played it so I don&amp;#39;t know for sure), so maybe consider having another top champion to play if you see an akali pick on the other team.  &lt;/p&gt;\n\n&lt;p&gt;I could say so much more, but I hope this gets my general point across. You are ALWAYS learning something from a game. If you know the problem, but don&amp;#39;t know how to solve it, ASK how to solve it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7yce7", "score_hidden": false, "stickied": false, "created": 1492135607.0, "created_utc": 1492106807.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7paka", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HolyCowly", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "My main problem with this is that I often have no idea what I did wrong on a deeper level.\n\nLet's take my last game for example. I was playing Kled against Akali. If you would look at my CS you would immediately say, there's your problem, you're supposed to have &gt; 70 after 10 minutes, you had 40, play customs and learn last hitting! Or that's what your run of the mill LoL guide would tell you.\n\nBut that's useless information. I have to dig deeper and ask myself, why did I have so little CS? Because I had no staying power in lane. I couldn't win any trade after she was level 3. So I tried staying safe under tower. Which means I lose some CS purely because of that. But she could still poke me and beeing melee I had to go back to base every now and then which lost me more CS.\n\nSo it's clear that I had too little CS, it's clear why, but it's absolutely  unclear what I could have done differently. Shouldn't I have bought more resistances? Would I have been able to trade her if I was sticking to my usual more damage focussed build instead? Should I have given up lane earlier to roam more? No idea.\n\nSo another game, again nothing learned and I end up in the loop you are describing.\n\nI've probably spend at least 200 hours watching LoL videos. Constantly adapting to the meta. Trying to stick with champs I have a good winrate with. Yet I make no progress. It's not that I don't want to, it's that I'm unable to do so. And every game with no improvement feels like crap, even if I win, because I know I didn't win because I got better.", "edited": 1492097457.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My main problem with this is that I often have no idea what I did wrong on a deeper level.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s take my last game for example. I was playing Kled against Akali. If you would look at my CS you would immediately say, there&amp;#39;s your problem, you&amp;#39;re supposed to have &amp;gt; 70 after 10 minutes, you had 40, play customs and learn last hitting! Or that&amp;#39;s what your run of the mill LoL guide would tell you.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s useless information. I have to dig deeper and ask myself, why did I have so little CS? Because I had no staying power in lane. I couldn&amp;#39;t win any trade after she was level 3. So I tried staying safe under tower. Which means I lose some CS purely because of that. But she could still poke me and beeing melee I had to go back to base every now and then which lost me more CS.&lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s clear that I had too little CS, it&amp;#39;s clear why, but it&amp;#39;s absolutely  unclear what I could have done differently. Shouldn&amp;#39;t I have bought more resistances? Would I have been able to trade her if I was sticking to my usual more damage focussed build instead? Should I have given up lane earlier to roam more? No idea.&lt;/p&gt;\n\n&lt;p&gt;So another game, again nothing learned and I end up in the loop you are describing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve probably spend at least 200 hours watching LoL videos. Constantly adapting to the meta. Trying to stick with champs I have a good winrate with. Yet I make no progress. It&amp;#39;s not that I don&amp;#39;t want to, it&amp;#39;s that I&amp;#39;m unable to do so. And every game with no improvement feels like crap, even if I win, because I know I didn&amp;#39;t win because I got better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7paka", "score_hidden": false, "stickied": false, "created": 1492125981.0, "created_utc": 1492097181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6rokw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ddow13", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "This is definitely something that applies to everyone in about everything, very good read, thanks for the share. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is definitely something that applies to everyone in about everything, very good read, thanks for the share. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6rokw", "score_hidden": false, "stickied": false, "created": 1492069022.0, "created_utc": 1492040222.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6rxxu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CloudCritic", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Brutal honesty. Doesn't just apply to league either, you could really expand this to almost every aspect of life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Brutal honesty. Doesn&amp;#39;t just apply to league either, you could really expand this to almost every aspect of life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6rxxu", "score_hidden": false, "stickied": false, "created": 1492069340.0, "created_utc": 1492040540.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg741tp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wolfling217", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I don't understand why people still ask how to \"climb\", as if climbing is something that magically happens.  Climbing is a second order effect.  The question they should be asking, the question that gets to the cause, is \"How to improve?\"  But unless they are willing to think about it enough to find their own answer, even that is meaningless to them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand why people still ask how to &amp;quot;climb&amp;quot;, as if climbing is something that magically happens.  Climbing is a second order effect.  The question they should be asking, the question that gets to the cause, is &amp;quot;How to improve?&amp;quot;  But unless they are willing to think about it enough to find their own answer, even that is meaningless to them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg741tp", "score_hidden": false, "stickied": false, "created": 1492084818.0, "created_utc": 1492056018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg77em1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iredditwhileiwork", "parent_id": "t1_dg6onhq", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I'll start by agreeing that natural talent is the icing of the cake that makes a Faker but every other ingredient is hardwork.\n\nBlindness is an extreme example but in very few cases do physical or mental limitations of an individual prevent them from being capable of reaching, let's say, the top 1% of anything. A fine example is the Paralympics which is full of people that have no right to be in the top 1% of their respective sport yet somehow they all are. Every time I think that I am not capable of something, I just think of people that have succeeded from a worse position than me. With that in mind, what is my excuse?\n\nIt frustrates me to no end that people continually blame their shortcomings on \"external factors\" (I am not talking about you here). Sure, some people will pick up things quicker than others but that just means if you are picking something up slower then you have to work harder; always be the hardest worker in the room. When talent doesn't work hard then hard work beats talent.\n\nSome kid has been brought in a musical family and is at an advantage to you, huh? Well you're going to have practice every single free second you have, no days off. When that kid is at school and playing with their friends, you're going to need to be watching recordings of yourself playing and see where you have messed up, you are going to spend hours playing a difficult part of a song you hate. When you're not able to play you are going to listen to music, you are going to fall asleep to. If you know this is what it takes to get better than the kid and you're no longer interested then the question is: did you ever REALLY want greatness of just like the idea of it?\n\nOP has made an excellent post which should be stickied imo because it is relevant to almost every single post in this subreddit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll start by agreeing that natural talent is the icing of the cake that makes a Faker but every other ingredient is hardwork.&lt;/p&gt;\n\n&lt;p&gt;Blindness is an extreme example but in very few cases do physical or mental limitations of an individual prevent them from being capable of reaching, let&amp;#39;s say, the top 1% of anything. A fine example is the Paralympics which is full of people that have no right to be in the top 1% of their respective sport yet somehow they all are. Every time I think that I am not capable of something, I just think of people that have succeeded from a worse position than me. With that in mind, what is my excuse?&lt;/p&gt;\n\n&lt;p&gt;It frustrates me to no end that people continually blame their shortcomings on &amp;quot;external factors&amp;quot; (I am not talking about you here). Sure, some people will pick up things quicker than others but that just means if you are picking something up slower then you have to work harder; always be the hardest worker in the room. When talent doesn&amp;#39;t work hard then hard work beats talent.&lt;/p&gt;\n\n&lt;p&gt;Some kid has been brought in a musical family and is at an advantage to you, huh? Well you&amp;#39;re going to have practice every single free second you have, no days off. When that kid is at school and playing with their friends, you&amp;#39;re going to need to be watching recordings of yourself playing and see where you have messed up, you are going to spend hours playing a difficult part of a song you hate. When you&amp;#39;re not able to play you are going to listen to music, you are going to fall asleep to. If you know this is what it takes to get better than the kid and you&amp;#39;re no longer interested then the question is: did you ever REALLY want greatness of just like the idea of it?&lt;/p&gt;\n\n&lt;p&gt;OP has made an excellent post which should be stickied imo because it is relevant to almost every single post in this subreddit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg77em1", "score_hidden": false, "stickied": false, "created": 1492090528.0, "created_utc": 1492061728.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6viro", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GrayHyena", "parent_id": "t1_dg6onhq", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "A combination of nature and nurture. Both matter, but like you said, anyone can at least get something like low diamond if they dedicate themselves (and aren't blind or something, obviously).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A combination of nature and nurture. Both matter, but like you said, anyone can at least get something like low diamond if they dedicate themselves (and aren&amp;#39;t blind or something, obviously).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6viro", "score_hidden": false, "stickied": false, "created": 1492073686.0, "created_utc": 1492044886.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6onhq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Ryswick", "parent_id": "t1_dg6kjjx", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "This is true to some extent. I'd say it's 95% hard work and dedication. The rest is out of your control, external factors.\n\nExtreme examples would be: Someone who is blind isn't ever going to be a professional League player. Some people have natural gifts to be musically talented at extremely young ages. Some people could be the next Faker but the world will never find out because they weren't born into the right environment to foster that.\n\nLet's not kid ourselves, though. Diamond is attainable for everyone who puts in the time and dedication. That extra 5% is what makes players like Faker an anomaly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is true to some extent. I&amp;#39;d say it&amp;#39;s 95% hard work and dedication. The rest is out of your control, external factors.&lt;/p&gt;\n\n&lt;p&gt;Extreme examples would be: Someone who is blind isn&amp;#39;t ever going to be a professional League player. Some people have natural gifts to be musically talented at extremely young ages. Some people could be the next Faker but the world will never find out because they weren&amp;#39;t born into the right environment to foster that.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s not kid ourselves, though. Diamond is attainable for everyone who puts in the time and dedication. That extra 5% is what makes players like Faker an anomaly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6onhq", "score_hidden": false, "stickied": false, "created": 1492065284.0, "created_utc": 1492036484.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kjjx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DOzenas", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yet the harsh truth that nothing and no one is equal in this world makes me both sad and happy.\n\nAnyway I don't think that for this reason anybody should stop smashing that wall to get through. Essentially the world doesn't give a sh** about you and there is nothing but you to brake through it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yet the harsh truth that nothing and no one is equal in this world makes me both sad and happy.&lt;/p&gt;\n\n&lt;p&gt;Anyway I don&amp;#39;t think that for this reason anybody should stop smashing that wall to get through. Essentially the world doesn&amp;#39;t give a sh** about you and there is nothing but you to brake through it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6kjjx", "score_hidden": false, "stickied": false, "created": 1492060307.0, "created_utc": 1492031507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6qthj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ferventdenial", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "You know this sounded jaded and tired from the sports/esports scene. Sorry but in my head I was thinking I and a lot of people I know and in my friends list started Silver, now is in Diamond. You CAN get better. WTF is that person talking about?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know this sounded jaded and tired from the sports/esports scene. Sorry but in my head I was thinking I and a lot of people I know and in my friends list started Silver, now is in Diamond. You CAN get better. WTF is that person talking about?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qthj", "score_hidden": false, "stickied": false, "created": 1492067969.0, "created_utc": 1492039169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6j8sp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "jaybasin", "parent_id": "t1_dg6e72m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Deleted comments are no fun ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Deleted comments are no fun &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6j8sp", "score_hidden": false, "stickied": false, "created": 1492058862.0, "created_utc": 1492030062.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e72m", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "apexjnr", "parent_id": "t1_dg6dr75", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Holy shit wrong post, mb", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit wrong post, mb&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6e72m", "score_hidden": false, "stickied": false, "created": 1492053667.0, "created_utc": 1492024867.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dr75", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Owneh", "parent_id": "t1_dg6dlxb", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6dr75", "score_hidden": false, "stickied": false, "created": 1492053209.0, "created_utc": 1492024409.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dlxb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6dlxb", "score_hidden": false, "stickied": false, "created": 1492053064.0, "created_utc": 1492024264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg74n8k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TerroristOgre", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I can answer this question without being melodramatic and telling you to look within yourself:\n\nMap Awareness - If you really have good map awareness, you know what's happening around the map. You'll be ready for ganks. You'll know the right thing to do when you see 3 man gank top etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can answer this question without being melodramatic and telling you to look within yourself:&lt;/p&gt;\n\n&lt;p&gt;Map Awareness - If you really have good map awareness, you know what&amp;#39;s happening around the map. You&amp;#39;ll be ready for ganks. You&amp;#39;ll know the right thing to do when you see 3 man gank top etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg74n8k", "score_hidden": false, "stickied": false, "created": 1492085712.0, "created_utc": 1492056912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7fxs7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Darkwoth81Dyoni", "parent_id": "t1_dg7d3d3", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "THIS.\n\nI'm not going to overshoot myself here, but if I could play more than a game every 2 days, I'd say I could at least hit low gold when I put in maximum effort (and a bit of luck from the pick/ban system). Until then, if I take the L, that L is going to last a week or more before I get the points back, or lose even more points.\n\nFor the summer I hope I can climb up nicely, but during the school year, I have too much work, both in and out of school, to focus on climbing. Notice how a large majority of people in master rank are streamers or have the huge amounts of free time required to grind?\n40 minutes is a large investment, but if the 10-20 minute breaks I had could be LoL games it would go a lot faster.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;THIS.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to overshoot myself here, but if I could play more than a game every 2 days, I&amp;#39;d say I could at least hit low gold when I put in maximum effort (and a bit of luck from the pick/ban system). Until then, if I take the L, that L is going to last a week or more before I get the points back, or lose even more points.&lt;/p&gt;\n\n&lt;p&gt;For the summer I hope I can climb up nicely, but during the school year, I have too much work, both in and out of school, to focus on climbing. Notice how a large majority of people in master rank are streamers or have the huge amounts of free time required to grind?\n40 minutes is a large investment, but if the 10-20 minute breaks I had could be LoL games it would go a lot faster.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7fxs7", "score_hidden": false, "stickied": false, "created": 1492113390.0, "created_utc": 1492084590.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d3d3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Syryus", "parent_id": "t1_dg77cl2", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I do not think people have limits when it comes to the game, I think they have limits when it comes to the time.\n\nI was high Diamond few seasons ago while I took a one year break after my first university. Now I'm finishing my 3rd university, already did my master degree and going for PhD. I simply can't climb that high again because I'm not playing that much. I hovered around plat for 2 seasons with less than 100 rankeds played. I even deleted my accounts so I would stop playing (didn't work).\n\nSo I think that Master is a rank available to anyone with enough free time and will to improve. You don't need \"talent\", you don't need to have it \"in your blood\". Just a whole lot of work and time to invest into it. \n\nAs for \"why sacrifice your time for a game\", I think that as long as you don't have a negative impact on others in your life, you can use as much time as you want on League. It's a legit sport and legit hobby and no one should be ashamed of that. It requires practice, dedication, intelligence and reflexes. \n\n**TL;DR:** You need free time to get really good. League is legit and you're awesome for being good at it, don't let anyone tell you otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not think people have limits when it comes to the game, I think they have limits when it comes to the time.&lt;/p&gt;\n\n&lt;p&gt;I was high Diamond few seasons ago while I took a one year break after my first university. Now I&amp;#39;m finishing my 3rd university, already did my master degree and going for PhD. I simply can&amp;#39;t climb that high again because I&amp;#39;m not playing that much. I hovered around plat for 2 seasons with less than 100 rankeds played. I even deleted my accounts so I would stop playing (didn&amp;#39;t work).&lt;/p&gt;\n\n&lt;p&gt;So I think that Master is a rank available to anyone with enough free time and will to improve. You don&amp;#39;t need &amp;quot;talent&amp;quot;, you don&amp;#39;t need to have it &amp;quot;in your blood&amp;quot;. Just a whole lot of work and time to invest into it. &lt;/p&gt;\n\n&lt;p&gt;As for &amp;quot;why sacrifice your time for a game&amp;quot;, I think that as long as you don&amp;#39;t have a negative impact on others in your life, you can use as much time as you want on League. It&amp;#39;s a legit sport and legit hobby and no one should be ashamed of that. It requires practice, dedication, intelligence and reflexes. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; You need free time to get really good. League is legit and you&amp;#39;re awesome for being good at it, don&amp;#39;t let anyone tell you otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7d3d3", "score_hidden": false, "stickied": false, "created": 1492106060.0, "created_utc": 1492077260.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77cl2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bookwizards", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I think a lot of people need to learn that they won't simply improve. People have limits when it comes to the game and when you find yourself in ELO hell it's because that's where you belong. You're going to have to put in hours upon hours and years upon years to improve.. Is it worth it?..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of people need to learn that they won&amp;#39;t simply improve. People have limits when it comes to the game and when you find yourself in ELO hell it&amp;#39;s because that&amp;#39;s where you belong. You&amp;#39;re going to have to put in hours upon hours and years upon years to improve.. Is it worth it?..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg77cl2", "score_hidden": false, "stickied": false, "created": 1492090408.0, "created_utc": 1492061608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg77elo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HangedCole", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Amazing. I haven't played League in a while, but this is completely applicable to all sorts of aspirations in your life. To accept the good as well as the bad that comes with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amazing. I haven&amp;#39;t played League in a while, but this is completely applicable to all sorts of aspirations in your life. To accept the good as well as the bad that comes with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg77elo", "score_hidden": false, "stickied": false, "created": 1492090527.0, "created_utc": 1492061727.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7f8ht", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "imnotarobotdammit", "parent_id": "t1_dg7elxg", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "No, this is wrong. In short, there is no shortcut to climbing. Play more, keep playing, and stay in control of your emotions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, this is wrong. In short, there is no shortcut to climbing. Play more, keep playing, and stay in control of your emotions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7f8ht", "score_hidden": false, "stickied": false, "created": 1492111880.0, "created_utc": 1492083080.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7fcc5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eloiole", "parent_id": "t1_dg7elxg", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "That's really not how I would sum that up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s really not how I would sum that up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7fcc5", "score_hidden": false, "stickied": false, "created": 1492112120.0, "created_utc": 1492083320.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7elxg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mazter00", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "In short, as a bronze V'er, **you** have to be the climber, the carry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In short, as a bronze V&amp;#39;er, &lt;strong&gt;you&lt;/strong&gt; have to be the climber, the carry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7elxg", "score_hidden": false, "stickied": false, "created": 1492110392.0, "created_utc": 1492081592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7ky22", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kazoodles", "parent_id": "t1_dg7kt1s", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "In my experience, there are people who value genuine progress, and people who don't know themselves and value the illusion of progress. There aren't many of them, but when you find them there's the potential for you to know. \n\nRegardless of what you believe about people fundamentally, give the idea some thought. Just because it's a common phenomenon doesn't mean that humans are fundamentally looking for the easy street or to live under poorly constructed perceptions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience, there are people who value genuine progress, and people who don&amp;#39;t know themselves and value the illusion of progress. There aren&amp;#39;t many of them, but when you find them there&amp;#39;s the potential for you to know. &lt;/p&gt;\n\n&lt;p&gt;Regardless of what you believe about people fundamentally, give the idea some thought. Just because it&amp;#39;s a common phenomenon doesn&amp;#39;t mean that humans are fundamentally looking for the easy street or to live under poorly constructed perceptions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7ky22", "score_hidden": false, "stickied": false, "created": 1492120998.0, "created_utc": 1492092198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kt1s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Owneh", "parent_id": "t1_dg7kreg", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Yes they are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes they are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7kt1s", "score_hidden": false, "stickied": false, "created": 1492120820.0, "created_utc": 1492092020.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kreg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kazoodles", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Not everyone is a cheater. However there's still some truth in the idea that there are people who are looking for an easy way out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not everyone is a cheater. However there&amp;#39;s still some truth in the idea that there are people who are looking for an easy way out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7kreg", "score_hidden": false, "stickied": false, "created": 1492120759.0, "created_utc": 1492091959.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7udkv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chriscim", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "This applies to everything. There are no quick fixes to being great at something. Do you think world class athletes/scientists/whoever have a balanced life? No, they dedicate their lives to being better at something then the rest of us who will always be mediocre because we won't put in the work needed. Because it's actual work, not all fun times. \n\nI have no delusions of being a high elo player. The only reason I play ranked is because of the competitive nature of the games. People actually try (for the most part). If more players looked at it this way, I guarantee soloq would be a whole hell of a lot less toxic. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This applies to everything. There are no quick fixes to being great at something. Do you think world class athletes/scientists/whoever have a balanced life? No, they dedicate their lives to being better at something then the rest of us who will always be mediocre because we won&amp;#39;t put in the work needed. Because it&amp;#39;s actual work, not all fun times. &lt;/p&gt;\n\n&lt;p&gt;I have no delusions of being a high elo player. The only reason I play ranked is because of the competitive nature of the games. People actually try (for the most part). If more players looked at it this way, I guarantee soloq would be a whole hell of a lot less toxic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7udkv", "score_hidden": false, "stickied": false, "created": 1492131395.0, "created_utc": 1492102595.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7yi3q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Prof_Bunghole", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "This is exactly what the youtuber/redditor Danyon Togia has been saying all along. You can say you want to get better all day long, but if you don't actually DO anything to improve, you aren't getting better any time soon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is exactly what the youtuber/redditor Danyon Togia has been saying all along. You can say you want to get better all day long, but if you don&amp;#39;t actually DO anything to improve, you aren&amp;#39;t getting better any time soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7yi3q", "score_hidden": false, "stickied": false, "created": 1492135776.0, "created_utc": 1492106976.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7z7dl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DawwGeez", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Wow, that applies to so much more than just League, too. That's incredible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that applies to so much more than just League, too. That&amp;#39;s incredible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7z7dl", "score_hidden": false, "stickied": false, "created": 1492136525.0, "created_utc": 1492107725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dgbacwr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Owneh", "parent_id": "t1_dgb90eg", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "you need an iq over 50 to understand", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you need an iq over 50 to understand&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dgbacwr", "score_hidden": false, "stickied": false, "created": 1492324825.0, "created_utc": 1492296025.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb90eg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "R_O_F_L", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "This is gibberish... Like 40 fortune cookies in stream of consciousness form.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is gibberish... Like 40 fortune cookies in stream of consciousness form.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dgb90eg", "score_hidden": false, "stickied": false, "created": 1492322883.0, "created_utc": 1492294083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg77gal", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bookwizards", "parent_id": "t1_dg6lw53", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "Or have a life* but I agree with your last statement. If people are playing this game and are not having fun because they just want to climb, they're searching for some validation they're never going to find in a video game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or have a life* but I agree with your last statement. If people are playing this game and are not having fun because they just want to climb, they&amp;#39;re searching for some validation they&amp;#39;re never going to find in a video game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg77gal", "score_hidden": false, "stickied": false, "created": 1492090625.0, "created_utc": 1492061825.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6lw53", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Hautamaki", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "One thing you'll notice if you pay attention is that the pros of today did not get there by asking the pros of yesterday 'how do you climb soloqueue?' and getting some perfect answer.  They got there by playing the game to get better for 8 or more hours a day.  If you want to be a pro, you have to enjoy playing to improve at least 8 hours a day, and you have to have the natural ability for those 8 hours to be enough to catch up to today's pros.  If you don't have what it takes, you should be able to realize that pretty quickly.  No more than 2 weeks I'd reckon; if you can't put in about 100 hours of solid playing to improve in the next 2 weeks, you will probably never be able to go pro, sorry.  If you thought that was your life's ambition, you should plan again.  You should either be able to have fun at the game knowing you will never go pro, or you should find another hobby.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing you&amp;#39;ll notice if you pay attention is that the pros of today did not get there by asking the pros of yesterday &amp;#39;how do you climb soloqueue?&amp;#39; and getting some perfect answer.  They got there by playing the game to get better for 8 or more hours a day.  If you want to be a pro, you have to enjoy playing to improve at least 8 hours a day, and you have to have the natural ability for those 8 hours to be enough to catch up to today&amp;#39;s pros.  If you don&amp;#39;t have what it takes, you should be able to realize that pretty quickly.  No more than 2 weeks I&amp;#39;d reckon; if you can&amp;#39;t put in about 100 hours of solid playing to improve in the next 2 weeks, you will probably never be able to go pro, sorry.  If you thought that was your life&amp;#39;s ambition, you should plan again.  You should either be able to have fun at the game knowing you will never go pro, or you should find another hobby.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6lw53", "score_hidden": false, "stickied": false, "created": 1492061885.0, "created_utc": 1492033085.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg6qezv", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "I_Main_TwistedFate", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "I just read this and got challenger. I think its working!!!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just read this and got challenger. I think its working!!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg6qezv", "score_hidden": false, "stickied": false, "created": 1492067469.0, "created_utc": 1492038669.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg7f7ti", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "imnotarobotdammit", "parent_id": "t1_dg791bx", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "You're missing the point. Read it all or none at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re missing the point. Read it all or none at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7f7ti", "score_hidden": false, "stickied": false, "created": 1492111838.0, "created_utc": 1492083038.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t9x3", "removal_reason": null, "link_id": "t3_65088m", "likes": null, "replies": "", "user_reports": [], "id": "dg9k0lc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Ds_Knees", "parent_id": "t1_dg7dz7t", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg9k0lc", "score_hidden": false, "stickied": false, "created": 1492224179.0, "created_utc": 1492195379.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dz7t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kasper_X", "parent_id": "t1_dg7d1f1", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "There is in britain?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is in britain?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7dz7t", "score_hidden": false, "stickied": false, "created": 1492108676.0, "created_utc": 1492079876.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d1f1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lostempireh", "parent_id": "t1_dg791bx", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "No such thing as a free lunch, if you want to get better you have to work for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No such thing as a free lunch, if you want to get better you have to work for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg7d1f1", "score_hidden": false, "stickied": false, "created": 1492105890.0, "created_utc": 1492077090.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg791bx", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "umren", "parent_id": "t3_65088m", "subreddit_name_prefixed": "r/summonerschool", "controversiality": 0, "body": "tl; dr ???", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;tl; dr ???&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "summonerschool", "name": "t1_dg791bx", "score_hidden": false, "stickied": false, "created": 1492094291.0, "created_utc": 1492065491.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]