[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "medicine", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In his books (and articles such as &lt;a href=\"https://aeon.co/essays/why-are-people-still-dying-of-cancer\"&gt;https://aeon.co/essays/why-are-people-still-dying-of-cancer&lt;/a&gt;) DeVita claims that standardized care is a significant factor in death rate. He seems to hint at aggressive and specific treatments instead of &amp;quot;mainstream&amp;quot; therapies that may lag behind. I&amp;#39;d love to believe him, but I&amp;#39;d like to have inputs from people in the field.&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance for your time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "In his books (and articles such as https://aeon.co/essays/why-are-people-still-dying-of-cancer) DeVita claims that standardized care is a significant factor in death rate. He seems to hint at aggressive and specific treatments instead of \"mainstream\" therapies that may lag behind. I'd love to believe him, but I'd like to have inputs from people in the field.\n\nThanks in advance for your time.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rn87", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "agumonkey", "saved": false, "mod_reports": [], "name": "t3_64rn87", "subreddit_name_prefixed": "r/medicine", "approved_by": null, "over_18": false, "domain": "self.medicine", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhff", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/medicine/comments/64rn87/what_is_the_views_on_vince_devita_message_about/", "num_reports": null, "locked": false, "stickied": false, "created": 1491954496.0, "url": "https://www.reddit.com/r/medicine/comments/64rn87/what_is_the_views_on_vince_devita_message_about/", "author_flair_text": "layperson", "quarantine": false, "title": "What is the views on Vince DeVita message about regulations ?", "created_utc": 1491925696.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_64rn87", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_64rn87", "likes": null, "replies": "", "user_reports": [], "id": "dg5m1zq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "agumonkey", "parent_id": "t1_dg50tqf", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "Fair enough. My issues is that non research centers (the average hospital) has thus defined a process where they'd attempt the vetted therapies and as soon as it fails, they mostly call defeat. Which for some patient is god spell so they too drop everything. Any attempt at asking for secondary advices, or specific help passes as a naive foolish denial.\n\nDeVita mentions a few times that it's not regulation he is against, it's inappropriate regulation. So far trials were limited to single molecule, and he saw that combinations can be powerful (synergistic effects) alas there's no protocol for such studies.\n\nNote that I don't advocate for unregulated medical care, at all. In my case I let the doctors do they job, without intervention; because I understand the amount of insight there is in approved therapies.\n\nps: another thing, this also make doctors reluctant at mentioning \"alternative\" adjuvants, such as CBD, many many patients say it helped them, but without doctors approval some people will refuse to test it on their case.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough. My issues is that non research centers (the average hospital) has thus defined a process where they&amp;#39;d attempt the vetted therapies and as soon as it fails, they mostly call defeat. Which for some patient is god spell so they too drop everything. Any attempt at asking for secondary advices, or specific help passes as a naive foolish denial.&lt;/p&gt;\n\n&lt;p&gt;DeVita mentions a few times that it&amp;#39;s not regulation he is against, it&amp;#39;s inappropriate regulation. So far trials were limited to single molecule, and he saw that combinations can be powerful (synergistic effects) alas there&amp;#39;s no protocol for such studies.&lt;/p&gt;\n\n&lt;p&gt;Note that I don&amp;#39;t advocate for unregulated medical care, at all. In my case I let the doctors do they job, without intervention; because I understand the amount of insight there is in approved therapies.&lt;/p&gt;\n\n&lt;p&gt;ps: another thing, this also make doctors reluctant at mentioning &amp;quot;alternative&amp;quot; adjuvants, such as CBD, many many patients say it helped them, but without doctors approval some people will refuse to test it on their case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dg5m1zq", "score_hidden": false, "stickied": false, "created": 1492011592.0, "created_utc": 1491982792.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50tqf", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "michael22joseph", "parent_id": "t3_64rn87", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "Someday, maybe, we can get to a point in medicine where we deliver personlized care on a molecular level, especially for cancer. \n\nBut, today, we have to work with what we've got. There's a reason various treatments are \"standard of care\"--most of the time, for most people, they work the best. Unfortunately, that means there will necessarily be patients in whom they do not work the best, or at all. Hopefully, we have enough time with these patients to attempt other treatment methodologies. Some of the time, however, we don't have that time, and the patient dies. It sucks, but it's where we are. We can't do genome analysis and targeted therapy for every patient with every disease. Not yet, anyways.\n\nAggressive treatments are not unharmful, either. He seems to be advocating for fast-tracking of experimental treatments, and there have been several instances of severe harm to experimental groups. If we allow research to run roughshod, we risk exposing thousands of patients to treatments that haven't been thoroughly vetted and investigated. Is it hair-pullingly frustrating to see the slow pace of advancement? Are there ways we can do better? In both cases--of course. But research is, and should be, done at a conservative pace, lest we unwittingly harm our patients. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Someday, maybe, we can get to a point in medicine where we deliver personlized care on a molecular level, especially for cancer. &lt;/p&gt;\n\n&lt;p&gt;But, today, we have to work with what we&amp;#39;ve got. There&amp;#39;s a reason various treatments are &amp;quot;standard of care&amp;quot;--most of the time, for most people, they work the best. Unfortunately, that means there will necessarily be patients in whom they do not work the best, or at all. Hopefully, we have enough time with these patients to attempt other treatment methodologies. Some of the time, however, we don&amp;#39;t have that time, and the patient dies. It sucks, but it&amp;#39;s where we are. We can&amp;#39;t do genome analysis and targeted therapy for every patient with every disease. Not yet, anyways.&lt;/p&gt;\n\n&lt;p&gt;Aggressive treatments are not unharmful, either. He seems to be advocating for fast-tracking of experimental treatments, and there have been several instances of severe harm to experimental groups. If we allow research to run roughshod, we risk exposing thousands of patients to treatments that haven&amp;#39;t been thoroughly vetted and investigated. Is it hair-pullingly frustrating to see the slow pace of advancement? Are there ways we can do better? In both cases--of course. But research is, and should be, done at a conservative pace, lest we unwittingly harm our patients. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dg50tqf", "score_hidden": false, "stickied": false, "created": 1491977892.0, "created_utc": 1491949092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}]