[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "medicine", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The FSFI is a standard survey for judging women&amp;#39;s sexual health. Scores below 26.55 are considered dysfunctional. The questions and their scores are here:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.fsfiquestionnaire.com/FSFI%20Scoring%20Appendix.pdf\"&gt;http://www.fsfiquestionnaire.com/FSFI%20Scoring%20Appendix.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;but this survey can&amp;#39;t differentiate between sexually inactive, lesbian, and sexually dysfucntional women, and the group I&amp;#39;m interested in are typically at least two of sexually inactive, lesbian or dysfunctional.  Can anyone suggest a more appropriate standard survey of comparable length and simplicity?  I&amp;#39;m aware of the FGSIS but I&amp;#39;m looking for something specific to sexual activity and function.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The FSFI is a standard survey for judging women's sexual health. Scores below 26.55 are considered dysfunctional. The questions and their scores are here:\n\nhttp://www.fsfiquestionnaire.com/FSFI%20Scoring%20Appendix.pdf\n\nbut this survey can't differentiate between sexually inactive, lesbian, and sexually dysfucntional women, and the group I'm interested in are typically at least two of sexually inactive, lesbian or dysfunctional.  Can anyone suggest a more appropriate standard survey of comparable length and simplicity?  I'm aware of the FGSIS but I'm looking for something specific to sexual activity and function.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qvul", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "OnceMoreWithFelines", "saved": false, "mod_reports": [], "name": "t3_65qvul", "subreddit_name_prefixed": "r/medicine", "approved_by": null, "over_18": false, "domain": "self.medicine", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhff", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/medicine/comments/65qvul/alternatives_to_the_fsfi_female_sexual_function/", "num_reports": null, "locked": false, "stickied": false, "created": 1492399482.0, "url": "https://www.reddit.com/r/medicine/comments/65qvul/alternatives_to_the_fsfi_female_sexual_function/", "author_flair_text": null, "quarantine": false, "title": "Alternatives to the FSFI (female sexual function index)?", "created_utc": 1492370682.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhff", "removal_reason": null, "link_id": "t3_65qvul", "likes": null, "replies": "", "user_reports": [], "id": "dgeuf2r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OnceMoreWithFelines", "parent_id": "t1_dgeiaa8", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "Strictly speaking I'm looking for a measurement of \"good function\" that's *not* independent of quality outcomes: the end goal is always improving people's quality of life, and since the various surgeries create varying types of functional genitals, it's important to find a measure which captures these various functionalities so that the community can work out which ones give the most improvement in quality of life.  At the moment the various surgeons are siloed off from one another doing their own little thing, with no-one measuring anything coherent.\n\nThe FSFI for Buncamper et al, 2017, had to disregard around 60% of patients because they were sexually inactive.  This makes the FSFI unsuitable for trying to find what about function is most important in improving quality of life.\n\n&gt; It starts to sound like \"everyone is unique and has different needs/desires for sexual function...but you should still want a cis vagina\" and risks invalidating some women.\n\nI don't want to invalidate anyone, and I appreciate that you've introduced a difficult topic into the conversation in a constructive way; thank you.  At the extreme other end of the spectrum would be the idea that every surgical outcome is okay.  At the moment, we're closer to the \"anything goes\" end of the spectrum than \"rigid goals\" end.\n\nEDIT: Perhaps I could phrase it this way: when testing what QoL depends upon, the input is the actions of the surgeon.  But that's too big and complicated a variable, so we want simpler proxy measures to represent our input.  Buncamper et al used the FSFI and FGSIS as their input proxy measures; they found good correlation between the FGSIS and QoL, but found the FSFI didn't apply because too many of their patients were sexually inactive.  I'm looking for a similar but more suitable input proxy measurement that can be used to understand, in detail, what makes QoL rise.", "edited": 1492501191.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Strictly speaking I&amp;#39;m looking for a measurement of &amp;quot;good function&amp;quot; that&amp;#39;s &lt;em&gt;not&lt;/em&gt; independent of quality outcomes: the end goal is always improving people&amp;#39;s quality of life, and since the various surgeries create varying types of functional genitals, it&amp;#39;s important to find a measure which captures these various functionalities so that the community can work out which ones give the most improvement in quality of life.  At the moment the various surgeons are siloed off from one another doing their own little thing, with no-one measuring anything coherent.&lt;/p&gt;\n\n&lt;p&gt;The FSFI for Buncamper et al, 2017, had to disregard around 60% of patients because they were sexually inactive.  This makes the FSFI unsuitable for trying to find what about function is most important in improving quality of life.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It starts to sound like &amp;quot;everyone is unique and has different needs/desires for sexual function...but you should still want a cis vagina&amp;quot; and risks invalidating some women.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t want to invalidate anyone, and I appreciate that you&amp;#39;ve introduced a difficult topic into the conversation in a constructive way; thank you.  At the extreme other end of the spectrum would be the idea that every surgical outcome is okay.  At the moment, we&amp;#39;re closer to the &amp;quot;anything goes&amp;quot; end of the spectrum than &amp;quot;rigid goals&amp;quot; end.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Perhaps I could phrase it this way: when testing what QoL depends upon, the input is the actions of the surgeon.  But that&amp;#39;s too big and complicated a variable, so we want simpler proxy measures to represent our input.  Buncamper et al used the FSFI and FGSIS as their input proxy measures; they found good correlation between the FGSIS and QoL, but found the FSFI didn&amp;#39;t apply because too many of their patients were sexually inactive.  I&amp;#39;m looking for a similar but more suitable input proxy measurement that can be used to understand, in detail, what makes QoL rise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgeuf2r", "score_hidden": true, "stickied": false, "created": 1492529409.0, "created_utc": 1492500609.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeiaa8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ManicChipmunk", "parent_id": "t1_dge57k8", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "I'm genuinely curious what you consider to be an objective measurement of \"good function\" thats independent of quality outcomes. It starts to sound like \"everyone is unique and has different needs/desires for sexual function...but you should still want a cis vagina\" and risks invalidating some women.", "edited": 1492482021.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m genuinely curious what you consider to be an objective measurement of &amp;quot;good function&amp;quot; thats independent of quality outcomes. It starts to sound like &amp;quot;everyone is unique and has different needs/desires for sexual function...but you should still want a cis vagina&amp;quot; and risks invalidating some women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgeiaa8", "score_hidden": false, "stickied": false, "created": 1492509393.0, "created_utc": 1492480593.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge57k8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OnceMoreWithFelines", "parent_id": "t1_dgdkpo3", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "I didn't say \"normal\"; please don't put words like that in my mouth.\n\nTrans women receiving surgery should receive high-quality surgery that delivers good function.  So many surgeons can understand and agree on what 'good function' is, it should be measured by an accepted, popular standard that's easy to get an intuition for.  I would rephrase your \"normal\" sentence like this: trans women's post-operative sexual function ought to be, on average, as good as cis women's sexual function, allowing for differences in demographic and understanding that individuals are all different.  Not measuring the various quality of outcomes doesn't mean those variable quality of outcomes goes away; it just means you're not measuring them.\n\nThank you for your help; I don't think you and I are likely to come to an agreement on philosophies of data by talking on the internet about this.  I'll look into the avenues you've suggested but otherwise I am happy for us to stop the conversation here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t say &amp;quot;normal&amp;quot;; please don&amp;#39;t put words like that in my mouth.&lt;/p&gt;\n\n&lt;p&gt;Trans women receiving surgery should receive high-quality surgery that delivers good function.  So many surgeons can understand and agree on what &amp;#39;good function&amp;#39; is, it should be measured by an accepted, popular standard that&amp;#39;s easy to get an intuition for.  I would rephrase your &amp;quot;normal&amp;quot; sentence like this: trans women&amp;#39;s post-operative sexual function ought to be, on average, as good as cis women&amp;#39;s sexual function, allowing for differences in demographic and understanding that individuals are all different.  Not measuring the various quality of outcomes doesn&amp;#39;t mean those variable quality of outcomes goes away; it just means you&amp;#39;re not measuring them.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your help; I don&amp;#39;t think you and I are likely to come to an agreement on philosophies of data by talking on the internet about this.  I&amp;#39;ll look into the avenues you&amp;#39;ve suggested but otherwise I am happy for us to stop the conversation here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dge57k8", "score_hidden": false, "stickied": false, "created": 1492492888.0, "created_utc": 1492464088.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkpo3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ManicChipmunk", "parent_id": "t1_dgdjkuy", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "So you're specifically looking at comparing neovagina sexual function to a cis \"normal\"?  I just think there are some inherent problems with that approach.  You could look at work that's been done in mullerian anomalies or extrophy patients, even those who had pelvic radiation, other populations that undergo vaginal procedures to increase sexual function.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you&amp;#39;re specifically looking at comparing neovagina sexual function to a cis &amp;quot;normal&amp;quot;?  I just think there are some inherent problems with that approach.  You could look at work that&amp;#39;s been done in mullerian anomalies or extrophy patients, even those who had pelvic radiation, other populations that undergo vaginal procedures to increase sexual function.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgdkpo3", "score_hidden": false, "stickied": false, "created": 1492469650.0, "created_utc": 1492440850.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjkuy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OnceMoreWithFelines", "parent_id": "t1_dgdhtn2", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "Buncamper et al, 2017, showed FGSIS and various QoL metrics cover the non-functional aspects, and that the FSIS was inappropriate for this population, so it is specifically function I want to measure.  Everything else is covered.\n\nCurrently there is no standard set of follow-up surveys for post-operative trans women.  Surgery can vary from skin graft, penile inversion with or without scrotal graft, ileum or sigmoid pedicled bowel segments, to various experimental procedures using cultured epithelial cells e.g. Dessy et al, 2014.  The lack of standard measure makes it impossible to track improvements in function across the literature as surgical methods change.  In the case of Dessy et al a standard set of follow-up surveys would let the reader compare their outcomes with the reference population of cis women, and a reference population of trans women who underwent surgery without their experimental procedure[*].  No standards exist, so no such comparison is possible.\n\nSince I want to propose a standard set of questions for surgeons to track, every deviation from an already proven standard makes it less likely that I will convince others to adopt it, and makes it impossible for me to compare against a reference population.  This is why I don't want to cook up my own specific version.\n\nI'll check out some variants of Sexual Satisfaction Surveys -- thanks for the suggestion.\n\n[*] Dessy et al is a pilot study so likely wouldn't have statistical significance even if they presented standardized measures, but it would give a sense of the size of the gains from their research.  The authors saying all patients were sexu-\nally active after the operation and were happy with their sexual function just doesn't give a concrete sense of the change.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Buncamper et al, 2017, showed FGSIS and various QoL metrics cover the non-functional aspects, and that the FSIS was inappropriate for this population, so it is specifically function I want to measure.  Everything else is covered.&lt;/p&gt;\n\n&lt;p&gt;Currently there is no standard set of follow-up surveys for post-operative trans women.  Surgery can vary from skin graft, penile inversion with or without scrotal graft, ileum or sigmoid pedicled bowel segments, to various experimental procedures using cultured epithelial cells e.g. Dessy et al, 2014.  The lack of standard measure makes it impossible to track improvements in function across the literature as surgical methods change.  In the case of Dessy et al a standard set of follow-up surveys would let the reader compare their outcomes with the reference population of cis women, and a reference population of trans women who underwent surgery without their experimental procedure[*].  No standards exist, so no such comparison is possible.&lt;/p&gt;\n\n&lt;p&gt;Since I want to propose a standard set of questions for surgeons to track, every deviation from an already proven standard makes it less likely that I will convince others to adopt it, and makes it impossible for me to compare against a reference population.  This is why I don&amp;#39;t want to cook up my own specific version.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll check out some variants of Sexual Satisfaction Surveys -- thanks for the suggestion.&lt;/p&gt;\n\n&lt;p&gt;[*] Dessy et al is a pilot study so likely wouldn&amp;#39;t have statistical significance even if they presented standardized measures, but it would give a sense of the size of the gains from their research.  The authors saying all patients were sexu-\nally active after the operation and were happy with their sexual function just doesn&amp;#39;t give a concrete sense of the change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgdjkuy", "score_hidden": false, "stickied": false, "created": 1492468175.0, "created_utc": 1492439375.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhtn2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ManicChipmunk", "parent_id": "t1_dgdh9we", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "It sounds like what you are looking for is more sexual satisfaction or sexual practices than sexual function.  I would just ask some of those questions separately, and use them to adjust the results of the FSFI.  If you just ask up front \"are you sexually active\" and \"what types of sex do you participate in/enjoy\" (oral, anal penetrative, vaginal penetrative, etc) and add a Sexual Satisfaction Survey component and I think you've covered most of those confounders.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like what you are looking for is more sexual satisfaction or sexual practices than sexual function.  I would just ask some of those questions separately, and use them to adjust the results of the FSFI.  If you just ask up front &amp;quot;are you sexually active&amp;quot; and &amp;quot;what types of sex do you participate in/enjoy&amp;quot; (oral, anal penetrative, vaginal penetrative, etc) and add a Sexual Satisfaction Survey component and I think you&amp;#39;ve covered most of those confounders.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgdhtn2", "score_hidden": false, "stickied": false, "created": 1492465675.0, "created_utc": 1492436875.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh9we", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "OnceMoreWithFelines", "parent_id": "t1_dgdfnp4", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "Thanks for your response.\n\nIt's not so much that the questions don't *apply*, it's that they'll fall afoul of some hidden variables i.e. I won't know simply from the survey results whether someone has answered 0 because their normal sexual expression is non-penetrative or because they haven't had sex.  I'm specifically not assuming that the questions don't apply; the survey is assuming they *do* apply.\n\nI'm comparing post-operative trans women's sexual function with that of cis women.  Trans women are more likely to be sexually inactive, lesbian and physically sexually dysfunctional than cis women, so this confounding is a serious problem for data quality.\n\nTo be honest I'm not impressed with the scoring of the questions: the difference between \"more than half the time\" and \"almost always\" to \"in the last four weeks how often did you feel sexual desire or interest?\" is not going to tell anyone anything when the survey considers higher scores to be more functional.\n\nCan you make any suggestions of better standard surveys for sexual function for this group?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your response.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not so much that the questions don&amp;#39;t &lt;em&gt;apply&lt;/em&gt;, it&amp;#39;s that they&amp;#39;ll fall afoul of some hidden variables i.e. I won&amp;#39;t know simply from the survey results whether someone has answered 0 because their normal sexual expression is non-penetrative or because they haven&amp;#39;t had sex.  I&amp;#39;m specifically not assuming that the questions don&amp;#39;t apply; the survey is assuming they &lt;em&gt;do&lt;/em&gt; apply.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m comparing post-operative trans women&amp;#39;s sexual function with that of cis women.  Trans women are more likely to be sexually inactive, lesbian and physically sexually dysfunctional than cis women, so this confounding is a serious problem for data quality.&lt;/p&gt;\n\n&lt;p&gt;To be honest I&amp;#39;m not impressed with the scoring of the questions: the difference between &amp;quot;more than half the time&amp;quot; and &amp;quot;almost always&amp;quot; to &amp;quot;in the last four weeks how often did you feel sexual desire or interest?&amp;quot; is not going to tell anyone anything when the survey considers higher scores to be more functional.&lt;/p&gt;\n\n&lt;p&gt;Can you make any suggestions of better standard surveys for sexual function for this group?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgdh9we", "score_hidden": false, "stickied": false, "created": 1492464826.0, "created_utc": 1492436026.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfnp4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ManicChipmunk", "parent_id": "t1_dgda308", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "I'm a lesbian, I have penetrative sex, just doesn't happen to be with a penis.  I can't cite a study on what percentage that is true for, but I don't think you can necessarily assume that question doesn't apply to lesbians. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a lesbian, I have penetrative sex, just doesn&amp;#39;t happen to be with a penis.  I can&amp;#39;t cite a study on what percentage that is true for, but I don&amp;#39;t think you can necessarily assume that question doesn&amp;#39;t apply to lesbians. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgdfnp4", "score_hidden": false, "stickied": false, "created": 1492462085.0, "created_utc": 1492433285.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda308", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OnceMoreWithFelines", "parent_id": "t1_dgcu5pv", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "Questions 17, 18, 19 assume vaginal penetration within the last four weeks, and their answers don't make coherent sense if you answer with sex that isn't penetrative.  This is going to lower the score of lesbian women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Questions 17, 18, 19 assume vaginal penetration within the last four weeks, and their answers don&amp;#39;t make coherent sense if you answer with sex that isn&amp;#39;t penetrative.  This is going to lower the score of lesbian women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgda308", "score_hidden": false, "stickied": false, "created": 1492446395.0, "created_utc": 1492417595.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu5pv", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ManicChipmunk", "parent_id": "t3_65qvul", "subreddit_name_prefixed": "r/medicine", "controversiality": 0, "body": "Why do you say this survey doesn't differentiate between lesbians and sexually dysfunctional women?  All those questions seem to apply to lesbians.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you say this survey doesn&amp;#39;t differentiate between lesbians and sexually dysfunctional women?  All those questions seem to apply to lesbians.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "medicine", "name": "t1_dgcu5pv", "score_hidden": false, "stickied": false, "created": 1492418263.0, "created_utc": 1492389463.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]