[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "keto", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay so I&amp;#39;ve been doing keto for a couple of years, and managed to drop quite a bit.  The only problem is that I was a lot bigger than I realized (337 when this journey began) and while I&amp;#39;ve dropped quite a bit I&amp;#39;m still a big guy.  So after a few setbacks and wake up calls, I&amp;#39;m not considering this a progress post, this is my new start.  The reboot.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 253.4 as of today&amp;#39;s weigh-in.  I was 175 when I got married 20 years ago.  My goal weight is 225, then I will re-evaluate my objectives.  &lt;/p&gt;\n\n&lt;p&gt;Now time for the hard truth.  I know why I haven&amp;#39;t dropped more weight:  alcohol.  I am a daily drinker, and I&amp;#39;ve justified it by drinking low carb beer and dry wine, but I&amp;#39;ve had to come to grips with the truth that I have a problem and even in moderation the alcohol is slowing any progress.  And recently I&amp;#39;ve been reacting to some personal stress by looking for the bottom of the bottle, which is never the right answer.  &lt;/p&gt;\n\n&lt;p&gt;So here&amp;#39;s the commitment:  I&amp;#39;ll be 40 on 9/1/17, and my goal is to both quit the drinking and get this last 28 pounds of to reach my first weight goal.  I&amp;#39;m putting this out there to hold myself accountable.  I hope to check in regularly with real progress.&lt;/p&gt;\n\n&lt;p&gt;For anyone who read this, thank you.  Obesity and alcoholism are diseases, and they are both diseases that I want to beat.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Okay so I've been doing keto for a couple of years, and managed to drop quite a bit.  The only problem is that I was a lot bigger than I realized (337 when this journey began) and while I've dropped quite a bit I'm still a big guy.  So after a few setbacks and wake up calls, I'm not considering this a progress post, this is my new start.  The reboot.\n\nI'm 253.4 as of today's weigh-in.  I was 175 when I got married 20 years ago.  My goal weight is 225, then I will re-evaluate my objectives.  \n\nNow time for the hard truth.  I know why I haven't dropped more weight:  alcohol.  I am a daily drinker, and I've justified it by drinking low carb beer and dry wine, but I've had to come to grips with the truth that I have a problem and even in moderation the alcohol is slowing any progress.  And recently I've been reacting to some personal stress by looking for the bottom of the bottle, which is never the right answer.  \n\nSo here's the commitment:  I'll be 40 on 9/1/17, and my goal is to both quit the drinking and get this last 28 pounds of to reach my first weight goal.  I'm putting this out there to hold myself accountable.  I hope to check in regularly with real progress.\n\nFor anyone who read this, thank you.  Obesity and alcoholism are diseases, and they are both diseases that I want to beat.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6559s5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 74, "report_reasons": null, "author": "Biznesox", "saved": false, "mod_reports": [], "name": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "approved_by": null, "over_18": false, "domain": "self.keto", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rske", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/keto/comments/6559s5/the_reboot/", "num_reports": null, "locked": false, "stickied": false, "created": 1492116810.0, "url": "https://www.reddit.com/r/keto/comments/6559s5/the_reboot/", "author_flair_text": null, "quarantine": false, "title": "The reboot", "created_utc": 1492088010.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 74}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7te6q", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "LadyHye", "parent_id": "t1_dg7ly5c", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "A lot of former alcoholics turn to overeating to fill the void. They trade one vice for another. Being addicted to food myself, I can begin to understand what you're going through and feel you're super brave to even say out loud that you might have a problem. Baby steps... You'll do great!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of former alcoholics turn to overeating to fill the void. They trade one vice for another. Being addicted to food myself, I can begin to understand what you&amp;#39;re going through and feel you&amp;#39;re super brave to even say out loud that you might have a problem. Baby steps... You&amp;#39;ll do great!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7te6q", "score_hidden": false, "stickied": false, "created": 1492130351.0, "created_utc": 1492101551.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ly5c", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "yobsmezn", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Best of luck.\n\nNot only are obesity and alcoholism diseases, they're closely related diseases, I have learned. All the mechanisms that make us want to eat are there for the drink as well --biological and psychological.\n\nI'm pretty much done drinking. Used to be what we cheerfully called \"a lush, not a drunk\". But I've had 35 years of stiff drinks and lakes of beer and it's time for me to stop. I'll drink a toast now and again, but no more drinking for effect.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best of luck.&lt;/p&gt;\n\n&lt;p&gt;Not only are obesity and alcoholism diseases, they&amp;#39;re closely related diseases, I have learned. All the mechanisms that make us want to eat are there for the drink as well --biological and psychological.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pretty much done drinking. Used to be what we cheerfully called &amp;quot;a lush, not a drunk&amp;quot;. But I&amp;#39;ve had 35 years of stiff drinks and lakes of beer and it&amp;#39;s time for me to stop. I&amp;#39;ll drink a toast now and again, but no more drinking for effect.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7ly5c", "score_hidden": false, "stickied": false, "created": 1492122216.0, "created_utc": 1492093416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7m2mr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "heavyabc", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Good for you for recognizing this. I have too and have equated wine to kryptonite. I'm finding that on strict keto I don't feel like I did before-- I don't crave that glass (or 3) of wine at bed time anymore. I also know that alcohol=carb cravings so I just don't go there. Hop on over to r/stopdrinking for some add'l inspo. Good luck OP", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good for you for recognizing this. I have too and have equated wine to kryptonite. I&amp;#39;m finding that on strict keto I don&amp;#39;t feel like I did before-- I don&amp;#39;t crave that glass (or 3) of wine at bed time anymore. I also know that alcohol=carb cravings so I just don&amp;#39;t go there. Hop on over to &lt;a href=\"/r/stopdrinking\"&gt;r/stopdrinking&lt;/a&gt; for some add&amp;#39;l inspo. Good luck OP&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7m2mr", "score_hidden": false, "stickied": false, "created": 1492122359.0, "created_utc": 1492093559.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7knzc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fibonacheese", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "I am very close to several people with alcohol issues, and I am prone to addiction myself. I have quit daily drinking (I was downing 1-2 bottles of champagne daily for several years) and now only drink on Friday &amp; Saturday. I've been considering giving that up as well. It's definitely a money saver, and I feel much better. I'm here if you need anything and I agree with Barca that this community is a great support system. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am very close to several people with alcohol issues, and I am prone to addiction myself. I have quit daily drinking (I was downing 1-2 bottles of champagne daily for several years) and now only drink on Friday &amp;amp; Saturday. I&amp;#39;ve been considering giving that up as well. It&amp;#39;s definitely a money saver, and I feel much better. I&amp;#39;m here if you need anything and I agree with Barca that this community is a great support system. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7knzc", "score_hidden": false, "stickied": false, "created": 1492120636.0, "created_utc": 1492091836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7plor", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aacceerr", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "I got 40 last august. I /r/stopdrinking/ I rode 9000km on my motorcycle. I also /r/coldshowers/ and /r/keto \n\nThat 40 years old just transformed me. Enjoy life, it getting better everyday !", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got 40 last august. I &lt;a href=\"/r/stopdrinking/\"&gt;/r/stopdrinking/&lt;/a&gt; I rode 9000km on my motorcycle. I also &lt;a href=\"/r/coldshowers/\"&gt;/r/coldshowers/&lt;/a&gt; and &lt;a href=\"/r/keto\"&gt;/r/keto&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;That 40 years old just transformed me. Enjoy life, it getting better everyday !&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7plor", "score_hidden": false, "stickied": false, "created": 1492126308.0, "created_utc": 1492097508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg84vul", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Skuffukaka", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "I used to drink daily - a glass of wine or two - and gave it up for keto about 6 weeks ago. Best decision ever! I feel so much better! My sleep is amazing and I feel ten years younger. Also I've found that I can easily handle stress and problems without reaching for the bottle. I've switched to yoga and, whenever life or people p*ss me off, I go lift heavy things. 10/10 can totally recommend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to drink daily - a glass of wine or two - and gave it up for keto about 6 weeks ago. Best decision ever! I feel so much better! My sleep is amazing and I feel ten years younger. Also I&amp;#39;ve found that I can easily handle stress and problems without reaching for the bottle. I&amp;#39;ve switched to yoga and, whenever life or people p*ss me off, I go lift heavy things. 10/10 can totally recommend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg84vul", "score_hidden": false, "stickied": false, "created": 1492142668.0, "created_utc": 1492113868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg80k7b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JimDunlap", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Alcohol is probably the main reason I have any struggles at all with staying on keto.  However, I found going to the gym after work gave me something to do and when I got home I was too tired to drink.  Develop and interest or hobby that you can occupy yourself with when you would be drinking in the evenings.  That's worked for me in the past.  I find deciding on days when you absolutely will not drink are easier to follow.  A \"don't drink during the work week\" policy is a good, simple start. You'll feel better getting up in the morning too!  I find it hard once I've had one drink to say \"no\" to the next one. My willpower to stay on keto and avoid overeating starts declining as well once I start drinking. \n\nFound this on the internet for ways to reduce alcohol consumption: \n\n\n\nSmall changes can make a big difference in reducing your chances of having alcohol-related problems. Whatever strategies you choose, give them a fair trial. If one approach doesn't work, try something else. But if you haven't made progress in cutting down after 2 to 3 months, consider quitting drinking altogether, seeking professional help, or both.\n\nKeep track. Keep track of how much you drink. Find a way that works for you: Carry a drinking tracker card in your wallet, make check marks on a kitchen calendar, or enter notes in a mobile phone notepad or personal digital assistant. Making note of each drink before you drink it may help you slow down when needed.\n\nCount and measure. Know the standard drink sizes so you can count your drinks accurately. Measure drinks at home. Away from home, it can be hard to keep track, especially with mixed drinks, and at times, you may be getting more alcohol than you think. With wine, you may need to ask the host or server not to \"top off\" a partially filled glass.\n\nSet goals. Decide how many days a week you want to drink and how many drinks you'll have on those days. It's a good idea to have some days when you don't drink. People who always stay within the low-risk limits when they drink have the lowest rates of alcohol-related problems.\n\nPace and space. When you do drink, pace yourself. Sip slowly. Have no more than one standard drink with alcohol per hour. Have \"drink spacers\"—make every other drink a non-alcoholic one, such as water, soda, or juice.\n\nInclude food. Don't drink on an empty stomach. Eat some food so the alcohol will be absorbed into your system more slowly.\nFind alternatives. If drinking has occupied a lot of your time, then fill free time by developing new, healthy activities, hobbies, and relationships, or renewing ones you've missed. If you have counted on alcohol to be more comfortable in social situations, manage moods, or cope with problems, then seek other, healthy ways to deal with those areas of your life.\n\nAvoid \"triggers.\" What triggers your urge to drink? If certain people or places make you drink even when you don't want to, try to avoid them. If certain activities, times of day, or feelings trigger the urge, plan something else to do instead of drinking. If drinking at home is a problem, keep little or no alcohol there.\n\nPlan to handle urges. When you cannot avoid a trigger and an urge hits, consider these options: Remind yourself of your reasons for changing (it can help to carry them in writing or store them in an electronic message you can access easily). Or talk things through with someone you trust. Or get involved with a healthy, distracting activity, such as physical exercise or a hobby that doesn't involve drinking. Or, instead of fighting the feeling, accept it and ride it out without giving in, knowing that it will soon crest like a wave and pass. Also, see the short module to help you handle urges to drink.\nKnow your \"no.\" You're likely to be offered a drink at times when you don't want one. Have a polite, convincing \"no, thanks\" ready. The faster you can say no to these offers, the less likely you are to give in. If you hesitate, it allows you time to think of excuses to go along. \n\nSource:  https://www.rethinkingdrinking.niaaa.nih.gov/Thinking-about-a-change/Strategies-for-cutting-down/Tips-To-Try.aspx\n\nNOTE:  I have no affiliation with that web site. ", "edited": 1492110025.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alcohol is probably the main reason I have any struggles at all with staying on keto.  However, I found going to the gym after work gave me something to do and when I got home I was too tired to drink.  Develop and interest or hobby that you can occupy yourself with when you would be drinking in the evenings.  That&amp;#39;s worked for me in the past.  I find deciding on days when you absolutely will not drink are easier to follow.  A &amp;quot;don&amp;#39;t drink during the work week&amp;quot; policy is a good, simple start. You&amp;#39;ll feel better getting up in the morning too!  I find it hard once I&amp;#39;ve had one drink to say &amp;quot;no&amp;quot; to the next one. My willpower to stay on keto and avoid overeating starts declining as well once I start drinking. &lt;/p&gt;\n\n&lt;p&gt;Found this on the internet for ways to reduce alcohol consumption: &lt;/p&gt;\n\n&lt;p&gt;Small changes can make a big difference in reducing your chances of having alcohol-related problems. Whatever strategies you choose, give them a fair trial. If one approach doesn&amp;#39;t work, try something else. But if you haven&amp;#39;t made progress in cutting down after 2 to 3 months, consider quitting drinking altogether, seeking professional help, or both.&lt;/p&gt;\n\n&lt;p&gt;Keep track. Keep track of how much you drink. Find a way that works for you: Carry a drinking tracker card in your wallet, make check marks on a kitchen calendar, or enter notes in a mobile phone notepad or personal digital assistant. Making note of each drink before you drink it may help you slow down when needed.&lt;/p&gt;\n\n&lt;p&gt;Count and measure. Know the standard drink sizes so you can count your drinks accurately. Measure drinks at home. Away from home, it can be hard to keep track, especially with mixed drinks, and at times, you may be getting more alcohol than you think. With wine, you may need to ask the host or server not to &amp;quot;top off&amp;quot; a partially filled glass.&lt;/p&gt;\n\n&lt;p&gt;Set goals. Decide how many days a week you want to drink and how many drinks you&amp;#39;ll have on those days. It&amp;#39;s a good idea to have some days when you don&amp;#39;t drink. People who always stay within the low-risk limits when they drink have the lowest rates of alcohol-related problems.&lt;/p&gt;\n\n&lt;p&gt;Pace and space. When you do drink, pace yourself. Sip slowly. Have no more than one standard drink with alcohol per hour. Have &amp;quot;drink spacers&amp;quot;—make every other drink a non-alcoholic one, such as water, soda, or juice.&lt;/p&gt;\n\n&lt;p&gt;Include food. Don&amp;#39;t drink on an empty stomach. Eat some food so the alcohol will be absorbed into your system more slowly.\nFind alternatives. If drinking has occupied a lot of your time, then fill free time by developing new, healthy activities, hobbies, and relationships, or renewing ones you&amp;#39;ve missed. If you have counted on alcohol to be more comfortable in social situations, manage moods, or cope with problems, then seek other, healthy ways to deal with those areas of your life.&lt;/p&gt;\n\n&lt;p&gt;Avoid &amp;quot;triggers.&amp;quot; What triggers your urge to drink? If certain people or places make you drink even when you don&amp;#39;t want to, try to avoid them. If certain activities, times of day, or feelings trigger the urge, plan something else to do instead of drinking. If drinking at home is a problem, keep little or no alcohol there.&lt;/p&gt;\n\n&lt;p&gt;Plan to handle urges. When you cannot avoid a trigger and an urge hits, consider these options: Remind yourself of your reasons for changing (it can help to carry them in writing or store them in an electronic message you can access easily). Or talk things through with someone you trust. Or get involved with a healthy, distracting activity, such as physical exercise or a hobby that doesn&amp;#39;t involve drinking. Or, instead of fighting the feeling, accept it and ride it out without giving in, knowing that it will soon crest like a wave and pass. Also, see the short module to help you handle urges to drink.\nKnow your &amp;quot;no.&amp;quot; You&amp;#39;re likely to be offered a drink at times when you don&amp;#39;t want one. Have a polite, convincing &amp;quot;no, thanks&amp;quot; ready. The faster you can say no to these offers, the less likely you are to give in. If you hesitate, it allows you time to think of excuses to go along. &lt;/p&gt;\n\n&lt;p&gt;Source:  &lt;a href=\"https://www.rethinkingdrinking.niaaa.nih.gov/Thinking-about-a-change/Strategies-for-cutting-down/Tips-To-Try.aspx\"&gt;https://www.rethinkingdrinking.niaaa.nih.gov/Thinking-about-a-change/Strategies-for-cutting-down/Tips-To-Try.aspx&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;NOTE:  I have no affiliation with that web site. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg80k7b", "score_hidden": false, "stickied": false, "created": 1492137973.0, "created_utc": 1492109173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg8mvhs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "valleyisle", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Same boat here. Turning 40 in June and had a rude awakening regarding alcohol about a month ago. Been keto 2 weeks and alcohol free for 4 weeks. Feel fantastic. Keep at it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same boat here. Turning 40 in June and had a rude awakening regarding alcohol about a month ago. Been keto 2 weeks and alcohol free for 4 weeks. Feel fantastic. Keep at it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg8mvhs", "score_hidden": false, "stickied": false, "created": 1492166015.0, "created_utc": 1492137215.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7kaxj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Barca1313", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Good luck my man! Like you said, alcoholism and obesity are addictions, fortunately they can be reversed. It looks like you have a plan and the willpower to get through this, just know you have a support system here on r/keto as well. Best of luck and don't be afraid to post on here if shit gets rough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck my man! Like you said, alcoholism and obesity are addictions, fortunately they can be reversed. It looks like you have a plan and the willpower to get through this, just know you have a support system here on &lt;a href=\"/r/keto\"&gt;r/keto&lt;/a&gt; as well. Best of luck and don&amp;#39;t be afraid to post on here if shit gets rough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7kaxj", "score_hidden": false, "stickied": false, "created": 1492120175.0, "created_utc": 1492091375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7uzix", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aznanarchy", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Congratulations on your commitment to beating your addictions. I wish you all the luck in the world. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congratulations on your commitment to beating your addictions. I wish you all the luck in the world. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7uzix", "score_hidden": false, "stickied": false, "created": 1492132038.0, "created_utc": 1492103238.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7x9p5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KetoPup", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Former functional alcoholic here! Wishing you nothing but the best of luck. There's a lot of support out there! Never hesitate to reach out for it if you need it! You got this :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Former functional alcoholic here! Wishing you nothing but the best of luck. There&amp;#39;s a lot of support out there! Never hesitate to reach out for it if you need it! You got this :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7x9p5", "score_hidden": false, "stickied": false, "created": 1492134471.0, "created_utc": 1492105671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7yh0y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tanklesmith", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "You got this! Holding yourself accountable is key and you have a great support system here!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You got this! Holding yourself accountable is key and you have a great support system here!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7yh0y", "score_hidden": false, "stickied": false, "created": 1492135745.0, "created_utc": 1492106945.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg7za7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blinks1483", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "I have personally used alcohol to deal with stress. Luckily I was able to stop. I'll have a drink now and then but now that I've gone keto I see it being a complete rarity. Which is fine.\n\nGood luck with your journey!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have personally used alcohol to deal with stress. Luckily I was able to stop. I&amp;#39;ll have a drink now and then but now that I&amp;#39;ve gone keto I see it being a complete rarity. Which is fine.&lt;/p&gt;\n\n&lt;p&gt;Good luck with your journey!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg7za7i", "score_hidden": false, "stickied": false, "created": 1492136605.0, "created_utc": 1492107805.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg830c1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "geniel1", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "I've found small changes are the key.  I would try repeatedly to get all healthy at once and it never worked for me.  I couldn't maintain the discipline and I failed at it for decades.\n\nWhat has worked for me though is to just change one thing each year. One year I just made the change of going to the gym occasionally.  For the next couple of years, I'd just up the frequency.  Then one year I quit tobacoo.  The next year, drinking. \n Now I'm tackling my last bad habit (my diet).  God I wished I had taken this step-wise approach back when I was in my 20's or 30's because it has really worked for me.  I've been able to keep with the plan without any back sliding.\n\nI'm not going to lie though.  Alcohol was a pretty big step to give up.  It took me about 6-10 months of white-knuckling through sobriety before I started to realize just how detrimental drinking had been to me.  Not only did it cause weight and other health issues, but it completely fucked with my thinking process.  I look back and absolutely cringe at some decisions I made.  Even when my blood alcohol content was 0 and therefore technically \"sober\", alcohol clouded my judgement and drove most of the decisions I made.  (Example: I used to think it was no big deal to take my kids with me to a happy hour so they could do their homework while I got plowed.)\n\nAnyway, I guess I don't really have an overall point to make.  Your situation reminds me of myself in a number of ways, so I just thought I'd share my experience with booze, keto, and just getting healthy in general.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve found small changes are the key.  I would try repeatedly to get all healthy at once and it never worked for me.  I couldn&amp;#39;t maintain the discipline and I failed at it for decades.&lt;/p&gt;\n\n&lt;p&gt;What has worked for me though is to just change one thing each year. One year I just made the change of going to the gym occasionally.  For the next couple of years, I&amp;#39;d just up the frequency.  Then one year I quit tobacoo.  The next year, drinking. \n Now I&amp;#39;m tackling my last bad habit (my diet).  God I wished I had taken this step-wise approach back when I was in my 20&amp;#39;s or 30&amp;#39;s because it has really worked for me.  I&amp;#39;ve been able to keep with the plan without any back sliding.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to lie though.  Alcohol was a pretty big step to give up.  It took me about 6-10 months of white-knuckling through sobriety before I started to realize just how detrimental drinking had been to me.  Not only did it cause weight and other health issues, but it completely fucked with my thinking process.  I look back and absolutely cringe at some decisions I made.  Even when my blood alcohol content was 0 and therefore technically &amp;quot;sober&amp;quot;, alcohol clouded my judgement and drove most of the decisions I made.  (Example: I used to think it was no big deal to take my kids with me to a happy hour so they could do their homework while I got plowed.)&lt;/p&gt;\n\n&lt;p&gt;Anyway, I guess I don&amp;#39;t really have an overall point to make.  Your situation reminds me of myself in a number of ways, so I just thought I&amp;#39;d share my experience with booze, keto, and just getting healthy in general.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg830c1", "score_hidden": false, "stickied": false, "created": 1492140625.0, "created_utc": 1492111825.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg881lb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "darwinuser", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "I think booze was a big factor in my weight gain. I was always a social butterfly and did far too much bar hopping in my late 20s. I wasn't ever addicted but I sure was a pretty fucking heavy boozer at the time and also did the drowning sorrows thing a decent few times. \n\nNow I seldom drink and I actually can't remember the last time I got drunk! I can honestly say I just got to the point where I realized it wasn't healthy but more to the point I just really didn't enjoy any aspect of doing it anymore.\n\nI wish you all the best fella, you can do it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think booze was a big factor in my weight gain. I was always a social butterfly and did far too much bar hopping in my late 20s. I wasn&amp;#39;t ever addicted but I sure was a pretty fucking heavy boozer at the time and also did the drowning sorrows thing a decent few times. &lt;/p&gt;\n\n&lt;p&gt;Now I seldom drink and I actually can&amp;#39;t remember the last time I got drunk! I can honestly say I just got to the point where I realized it wasn&amp;#39;t healthy but more to the point I just really didn&amp;#39;t enjoy any aspect of doing it anymore.&lt;/p&gt;\n\n&lt;p&gt;I wish you all the best fella, you can do it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg881lb", "score_hidden": false, "stickied": false, "created": 1492146217.0, "created_utc": 1492117417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg8ktek", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Duckism", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Don't put it out here to be held accountable. Don't rely on others to do things. Now that you have found out your problem you have the power to do it yourself. Just think of how great it will be without the hang over everyday ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t put it out here to be held accountable. Don&amp;#39;t rely on others to do things. Now that you have found out your problem you have the power to do it yourself. Just think of how great it will be without the hang over everyday &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg8ktek", "score_hidden": false, "stickied": false, "created": 1492163113.0, "created_utc": 1492134313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg8nfxr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Knurling_Turtle", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Excellent decision. Keep coming back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent decision. Keep coming back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg8nfxr", "score_hidden": false, "stickied": false, "created": 1492166835.0, "created_utc": 1492138035.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rske", "removal_reason": null, "link_id": "t3_6559s5", "likes": null, "replies": "", "user_reports": [], "id": "dg8p0bn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "siren_blue", "parent_id": "t3_6559s5", "subreddit_name_prefixed": "r/keto", "controversiality": 0, "body": "Lots of strength to out this out there.  I hope you have some support to get you through this.  Take up exercise instead of drinking!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of strength to out this out there.  I hope you have some support to get you through this.  Take up exercise instead of drinking!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "keto", "name": "t1_dg8p0bn", "score_hidden": false, "stickied": false, "created": 1492169193.0, "created_utc": 1492140393.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]