[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DarkSouls2", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ok this is just a personal story and opinions post. Thanks for listening. &lt;strong&gt;Also there are some spoilers.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR/WR&lt;/strong&gt; Despite my continuous attempts I couldn&amp;#39;t get into DS2 for a long time but I was amazed at DS3&amp;#39;s brilliance so I gave DS2 another chance after finishing DS3. Now that I played DS2 I cannot go back to DS3. DS2 is more like a journey and more like a game while DS3 has a much better atmosphere and storytelling. That&amp;#39;s why I think the hate DS2 is getting is ridiculous and DS2 is not a bad game it is just different. And from purely gameplay perspective it is way better than DS3.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;LONG VERSION&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;So I have had DS2 since it was released and I have honestly tried playing it quite a few times with a few months in between. Everytime I did, I just couldn&amp;#39;t get into it. I didn&amp;#39;t like the game. I gave it another few chances but results were all the same. So after DS3 was released and since I had a lot of time I said let me give it a try and I pirated it just to see if I like the game and if it would run on my laptop. &lt;/p&gt;\n\n&lt;p&gt;The game was amazing. It was a blast. As someone who never gone past Majula in DS2, it is safe to say that DS3 is actually my first souls game. So I was hooked especially after I started watching lore videos etc. I was greatly amazed. After finishing the game I just went ahead and bought it but since I had to go out of the city for a few weeks I only had my laptop and DS3 didn&amp;#39;t work there. I said I should give DS2 a go.&lt;/p&gt;\n\n&lt;p&gt;Now after playing for a few hours I really missed DS3. Especially graphics were killing me but i was determined. First big change happened when I finally fought the looking glass. I was like WTF? I was seriously expecting the Drangleic Castle to be the last location but then came the Shrine of Amana and many more after that. Game was long and I really had that feeling of journey and RPG in DS2. So I kept playing DS2 and got 2 characters to 200+ levels and a few around 100 levels. Also I am mainly an offline player as DS3 was a pirated copy but I enjoyed some little PvP and a lot of Coop with summoning or being summoned. There were amazing fights like Fume Knight. I helped at least a few dozen guys kill that boss and never got bored. Anyway I was dying to experience DS3 again now that I have better souls experience with DS2. &lt;/p&gt;\n\n&lt;p&gt;I came back home a few days back and started playing DS3 again now that I installed the game on Steam I also wanted to take a look at online features too. This is where the problem is starting to rise tho. I am still trying to finish DS3 because after an hour or so I find myself going back to DS2. Unlike DS2, because I finished DS3 I don&amp;#39;t want to play it again. And no matter how great DS3 is for a first playthrough, when it comes to replayability I like DS2 much better.&lt;/p&gt;\n\n&lt;p&gt;I think DS3 is a great game but as an RPG it is DS2 where its at. Many times I found myself looking at tactics, changing gear according to the boss, trying different approaches to the fights etc. while I played all DS3 with a great shield+broadsword combo. I never used Weapon Arts (which imho are completely bullshit and poorly designed) either. I never considered if boss has a poison/dark/lightning/strike damage weakness etc. and I just played. I didn&amp;#39;t consider getting defensive rings for bossfights. DS2 had this and it was great. Getting a together Flame Quartz Ring + Flash Sweat + orange burr with penal set just to fight the dragon or having a +10 Strike weapon just to get past some areas of the game despite being a katana user felt more gamey. When I compare the inventory you have for the same progression in the game, DS2 offers much greater variety. Have you ever run around in jester set with serpent rings in DS3? And what about fashion souls? Where the hell is my Black Witch skirt or Desert Sorceress top??? It is because of those gamey things I think that DS2 is a better game than DS3. DS3 is a better story but as a game DS2 wins it for me.&lt;/p&gt;\n\n&lt;hr/&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ok this is just a personal story and opinions post. Thanks for listening. **Also there are some spoilers.**\n\n-------------------------------------------------------------------------------\n\n**TL;DR/WR** Despite my continuous attempts I couldn't get into DS2 for a long time but I was amazed at DS3's brilliance so I gave DS2 another chance after finishing DS3. Now that I played DS2 I cannot go back to DS3. DS2 is more like a journey and more like a game while DS3 has a much better atmosphere and storytelling. That's why I think the hate DS2 is getting is ridiculous and DS2 is not a bad game it is just different. And from purely gameplay perspective it is way better than DS3.\n\n----------------------------------------------------------------------------\n\n**LONG VERSION** \n\nSo I have had DS2 since it was released and I have honestly tried playing it quite a few times with a few months in between. Everytime I did, I just couldn't get into it. I didn't like the game. I gave it another few chances but results were all the same. So after DS3 was released and since I had a lot of time I said let me give it a try and I pirated it just to see if I like the game and if it would run on my laptop. \n\nThe game was amazing. It was a blast. As someone who never gone past Majula in DS2, it is safe to say that DS3 is actually my first souls game. So I was hooked especially after I started watching lore videos etc. I was greatly amazed. After finishing the game I just went ahead and bought it but since I had to go out of the city for a few weeks I only had my laptop and DS3 didn't work there. I said I should give DS2 a go.\n\nNow after playing for a few hours I really missed DS3. Especially graphics were killing me but i was determined. First big change happened when I finally fought the looking glass. I was like WTF? I was seriously expecting the Drangleic Castle to be the last location but then came the Shrine of Amana and many more after that. Game was long and I really had that feeling of journey and RPG in DS2. So I kept playing DS2 and got 2 characters to 200+ levels and a few around 100 levels. Also I am mainly an offline player as DS3 was a pirated copy but I enjoyed some little PvP and a lot of Coop with summoning or being summoned. There were amazing fights like Fume Knight. I helped at least a few dozen guys kill that boss and never got bored. Anyway I was dying to experience DS3 again now that I have better souls experience with DS2. \n\nI came back home a few days back and started playing DS3 again now that I installed the game on Steam I also wanted to take a look at online features too. This is where the problem is starting to rise tho. I am still trying to finish DS3 because after an hour or so I find myself going back to DS2. Unlike DS2, because I finished DS3 I don't want to play it again. And no matter how great DS3 is for a first playthrough, when it comes to replayability I like DS2 much better.\n\nI think DS3 is a great game but as an RPG it is DS2 where its at. Many times I found myself looking at tactics, changing gear according to the boss, trying different approaches to the fights etc. while I played all DS3 with a great shield+broadsword combo. I never used Weapon Arts (which imho are completely bullshit and poorly designed) either. I never considered if boss has a poison/dark/lightning/strike damage weakness etc. and I just played. I didn't consider getting defensive rings for bossfights. DS2 had this and it was great. Getting a together Flame Quartz Ring + Flash Sweat + orange burr with penal set just to fight the dragon or having a +10 Strike weapon just to get past some areas of the game despite being a katana user felt more gamey. When I compare the inventory you have for the same progression in the game, DS2 offers much greater variety. Have you ever run around in jester set with serpent rings in DS3? And what about fashion souls? Where the hell is my Black Witch skirt or Desert Sorceress top??? It is because of those gamey things I think that DS2 is a better game than DS3. DS3 is a better story but as a game DS2 wins it for me.\n\n---------------------------------------------------------------------------\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655hek", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "ForThatNotSoSmartSub", "saved": false, "mod_reports": [], "name": "t3_655hek", "subreddit_name_prefixed": "r/DarkSouls2", "approved_by": null, "over_18": false, "domain": "self.DarkSouls2", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2vqni", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DarkSouls2/comments/655hek/ds3_was_so_good_it_made_me_give_another_chance_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492119164.0, "url": "https://www.reddit.com/r/DarkSouls2/comments/655hek/ds3_was_so_good_it_made_me_give_another_chance_to/", "author_flair_text": null, "quarantine": false, "title": "DS3 was so good it made me give another chance to DS2. Now that I played DS2 I cannot go back to DS3. DS2 is not bad it is just different.", "created_utc": 1492090364.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vqni", "removal_reason": null, "link_id": "t3_655hek", "likes": null, "replies": "", "user_reports": [], "id": "dg851pt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Prerequisiteqt", "parent_id": "t3_655hek", "subreddit_name_prefixed": "r/DarkSouls2", "controversiality": 0, "body": "Started as a Dark Souls 2 kid back 2 years ago with the release of SotFS and died a million times. I probably clocked over 300 hours within a 2 month span on that game. Loved it, all my friends claimed DS1 was better so I was alone in my mission to git gud. Quit after beating the game a lot and then trying PvP (which is still by far my favorite of the series). DS3 came out and clocked another 300+ hours in a short time. Came back for DLCs and felt hollow agaiin. Loved TRC DLC in 3 but the PvP to me was too stale to be honest. I'm a bit of a lore nut so I loved all the inspiration coming from DS2 in the newest DLC. Playing DS2 again and I couldn't feel more at home if I tried. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Started as a Dark Souls 2 kid back 2 years ago with the release of SotFS and died a million times. I probably clocked over 300 hours within a 2 month span on that game. Loved it, all my friends claimed DS1 was better so I was alone in my mission to git gud. Quit after beating the game a lot and then trying PvP (which is still by far my favorite of the series). DS3 came out and clocked another 300+ hours in a short time. Came back for DLCs and felt hollow agaiin. Loved TRC DLC in 3 but the PvP to me was too stale to be honest. I&amp;#39;m a bit of a lore nut so I loved all the inspiration coming from DS2 in the newest DLC. Playing DS2 again and I couldn&amp;#39;t feel more at home if I tried. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DarkSouls2", "name": "t1_dg851pt", "score_hidden": false, "stickied": false, "created": 1492142849.0, "created_utc": 1492114049.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vqni", "removal_reason": null, "link_id": "t3_655hek", "likes": null, "replies": "", "user_reports": [], "id": "dg7kcbr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NextDoorNeighbrrs", "parent_id": "t3_655hek", "subreddit_name_prefixed": "r/DarkSouls2", "controversiality": 0, "body": "DS3 is a brilliant experience. I really like the way the story unfolds and there are some brilliant moments with the level design I really enjoyed, like finding the shortcuts back to the Cleansing Chapel in the Cathedral of the Deep and the oppressive creepiness of Irithyll Dungeon. What I think DS3 lacks is a lot of depth and replay ability. Other than some nicer rings, the NG+ cycles have nothing new to offer. The PVP, although they seem to be working on it, leaves so much to be desired. It is still fun but invading is brutal and a lot of time summoning completely trivializes everything, which it does in DS1 and 2 as well, but not to the same extent. \n\nI appreciated them bringing in elements of Bloodborne but I think they kind of fucked the game in some ways for its longevity. Unless there are some serious changes to the PVP, I think interest will die in it pretty shortly after The Fire Fades edition releases. Of course, like any Souls game, it will always have a community but it doesn't seem like people have as strong of a connection to DS3 as they did the other games in the series. A lot of the prominent Youtubers seem to be moving on elsewhere or producing a lot less content for DS3.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DS3 is a brilliant experience. I really like the way the story unfolds and there are some brilliant moments with the level design I really enjoyed, like finding the shortcuts back to the Cleansing Chapel in the Cathedral of the Deep and the oppressive creepiness of Irithyll Dungeon. What I think DS3 lacks is a lot of depth and replay ability. Other than some nicer rings, the NG+ cycles have nothing new to offer. The PVP, although they seem to be working on it, leaves so much to be desired. It is still fun but invading is brutal and a lot of time summoning completely trivializes everything, which it does in DS1 and 2 as well, but not to the same extent. &lt;/p&gt;\n\n&lt;p&gt;I appreciated them bringing in elements of Bloodborne but I think they kind of fucked the game in some ways for its longevity. Unless there are some serious changes to the PVP, I think interest will die in it pretty shortly after The Fire Fades edition releases. Of course, like any Souls game, it will always have a community but it doesn&amp;#39;t seem like people have as strong of a connection to DS3 as they did the other games in the series. A lot of the prominent Youtubers seem to be moving on elsewhere or producing a lot less content for DS3.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DarkSouls2", "name": "t1_dg7kcbr", "score_hidden": false, "stickied": false, "created": 1492120225.0, "created_utc": 1492091425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vqni", "removal_reason": null, "link_id": "t3_655hek", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vqni", "removal_reason": null, "link_id": "t3_655hek", "likes": null, "replies": "", "user_reports": [], "id": "dg8309m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ForThatNotSoSmartSub", "parent_id": "t1_dg7qf2a", "subreddit_name_prefixed": "r/DarkSouls2", "controversiality": 0, "body": "Thanks for taking the time to read it. I only played Softs version but more than the story it was the gameplay which actually caught my attention. As I said going into a battle with proper preperation is something I never experienced in DS3. I looked at the guides while playing DS2 and changed my equipment accordingly for every boss fight. Sometimes I used pellets, dragon charms, poison weapon lightning, strike/slash weapons accordingly.  It has that RPG element into it. As I said DS3 was too pure and linear or at least that's how I felt. A broadsword and simple R1 spam is all I had against almost every enemy in the game. I still don't know if there is a clear poise mechanic in DS3 but Heide knights for example are perfect enemies for demonstrating POISE in DS2. I had a hard time against them until I realized I could simply use ultragreatswords to break their poise for a moment and kill quickly. I couldn't fight off NPC invader until I realized rapiers. I liked strategic combat aspect there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for taking the time to read it. I only played Softs version but more than the story it was the gameplay which actually caught my attention. As I said going into a battle with proper preperation is something I never experienced in DS3. I looked at the guides while playing DS2 and changed my equipment accordingly for every boss fight. Sometimes I used pellets, dragon charms, poison weapon lightning, strike/slash weapons accordingly.  It has that RPG element into it. As I said DS3 was too pure and linear or at least that&amp;#39;s how I felt. A broadsword and simple R1 spam is all I had against almost every enemy in the game. I still don&amp;#39;t know if there is a clear poise mechanic in DS3 but Heide knights for example are perfect enemies for demonstrating POISE in DS2. I had a hard time against them until I realized I could simply use ultragreatswords to break their poise for a moment and kill quickly. I couldn&amp;#39;t fight off NPC invader until I realized rapiers. I liked strategic combat aspect there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DarkSouls2", "name": "t1_dg8309m", "score_hidden": false, "stickied": false, "created": 1492140623.0, "created_utc": 1492111823.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qf2a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JimmyBoy21", "parent_id": "t3_655hek", "subreddit_name_prefixed": "r/DarkSouls2", "controversiality": 0, "body": "Always glad to see someone enjoying these games. About your complaint for the black witch and desert sorceress, they added the full sets with the second dlc. I can see your point though even though I have 80 hours on DS2 and a character over level 200, I never understood the replayability factor everyone praises DS2 for. I like the other games better but I had a good time with DS2 and even got 100%. For me all games have great replayability as long as you change your build, red phantoms in NG+2 were more annoying than fun. Did you play Vanilla or SOFTS?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Always glad to see someone enjoying these games. About your complaint for the black witch and desert sorceress, they added the full sets with the second dlc. I can see your point though even though I have 80 hours on DS2 and a character over level 200, I never understood the replayability factor everyone praises DS2 for. I like the other games better but I had a good time with DS2 and even got 100%. For me all games have great replayability as long as you change your build, red phantoms in NG+2 were more annoying than fun. Did you play Vanilla or SOFTS?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DarkSouls2", "name": "t1_dg7qf2a", "score_hidden": false, "stickied": false, "created": 1492127178.0, "created_utc": 1492098378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vqni", "removal_reason": null, "link_id": "t3_655hek", "likes": null, "replies": "", "user_reports": [], "id": "dg88zzu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ahawk_one", "parent_id": "t3_655hek", "subreddit_name_prefixed": "r/DarkSouls2", "controversiality": 0, "body": "Preach brother!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Preach brother!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DarkSouls2", "name": "t1_dg88zzu", "score_hidden": false, "stickied": false, "created": 1492147368.0, "created_utc": 1492118568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vqni", "removal_reason": null, "link_id": "t3_655hek", "likes": null, "replies": "", "user_reports": [], "id": "dg8khe3", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "beernd1", "parent_id": "t3_655hek", "subreddit_name_prefixed": "r/DarkSouls2", "controversiality": 0, "body": "I personally, actually think that Dark Souls 2's story (at least, the full version in SOTFS) was much more gripping than that of 1 and 3, mainly because of the characters and the world of Drangleic itself. \n\nWhen you look into DS2's lore everything starts to connect and make sense, and I think it was presented much better in this game than in the others. The conversations you have with King Vendrick (post-DLC) and his brother Aldia throughout the game are all really memorable and made me love these characters, along with all the other characters that tie into their stories (such as Velstadt and Raime, the Emerald Herald, the \"Ancient Dragon\").\n\nPlaying through DS2 for the first time felt like an epic journey for your character, and it felt meaningful all the way through as things became clear. That moment when you finally find King Vendrick in the Undead Crypt, for example, after going through so much, was heartbreaking.\n\nReally though it comes down to personal preference. I just didn't really care for the story told in Ds1 &amp; 3, despite really trying to, as they just didn't feel like very personal stories, more like an epic tale. DS2's story focuses more on characters and humanity as a whole, how they struggle with the terrible curse of the undead, and all this really made me think. \n\nAside from the story though, what really made me fall in love with this particular entry in the Souls series is how RPG-ey DS2 feels, like you said. There are so many armor sets, weapons, consumables, etc. for all kinds of situations, and so many ways to build your character. RPGs are my favourite genre of games in general so I suppose DS2 just really did everything right for me.\n\nThat's not to say that DS1 and 3 aren't amazing games though. I loved playing through them, but wouldn't really wanna stick around for a second playthrough as the games feel a lot more linear/confined than DS2 does, at least in my opinion! I can't wait to go back to DS3 in a while for the Ringed City DLC though.", "edited": 1492134465.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally, actually think that Dark Souls 2&amp;#39;s story (at least, the full version in SOTFS) was much more gripping than that of 1 and 3, mainly because of the characters and the world of Drangleic itself. &lt;/p&gt;\n\n&lt;p&gt;When you look into DS2&amp;#39;s lore everything starts to connect and make sense, and I think it was presented much better in this game than in the others. The conversations you have with King Vendrick (post-DLC) and his brother Aldia throughout the game are all really memorable and made me love these characters, along with all the other characters that tie into their stories (such as Velstadt and Raime, the Emerald Herald, the &amp;quot;Ancient Dragon&amp;quot;).&lt;/p&gt;\n\n&lt;p&gt;Playing through DS2 for the first time felt like an epic journey for your character, and it felt meaningful all the way through as things became clear. That moment when you finally find King Vendrick in the Undead Crypt, for example, after going through so much, was heartbreaking.&lt;/p&gt;\n\n&lt;p&gt;Really though it comes down to personal preference. I just didn&amp;#39;t really care for the story told in Ds1 &amp;amp; 3, despite really trying to, as they just didn&amp;#39;t feel like very personal stories, more like an epic tale. DS2&amp;#39;s story focuses more on characters and humanity as a whole, how they struggle with the terrible curse of the undead, and all this really made me think. &lt;/p&gt;\n\n&lt;p&gt;Aside from the story though, what really made me fall in love with this particular entry in the Souls series is how RPG-ey DS2 feels, like you said. There are so many armor sets, weapons, consumables, etc. for all kinds of situations, and so many ways to build your character. RPGs are my favourite genre of games in general so I suppose DS2 just really did everything right for me.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s not to say that DS1 and 3 aren&amp;#39;t amazing games though. I loved playing through them, but wouldn&amp;#39;t really wanna stick around for a second playthrough as the games feel a lot more linear/confined than DS2 does, at least in my opinion! I can&amp;#39;t wait to go back to DS3 in a while for the Ringed City DLC though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DarkSouls2", "name": "t1_dg8khe3", "score_hidden": false, "stickied": false, "created": 1492162655.0, "created_utc": 1492133855.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]