[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "netflix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We just launched the Netflix app on Roku then selected a profile and it forced us to watch an ad for Sandy Wexler before being able to see any lists or select a show. I contacted support (they were very helpful) and they said it was a fluke and that shouldn&amp;#39;t be happening. I know that sometimes companies will neglect to inform their support personnel about changes so I thought I might ask others that use Netflix. &lt;/p&gt;\n\n&lt;p&gt;Edit: It should also be noted that we were not presented with any watch now or add to list buttons. There was nothing but the ad. &lt;/p&gt;\n\n&lt;p&gt;Edit2: It looks like another thread was posted for the same thing. &lt;a href=\"https://www.reddit.com/r/netflix/comments/65gxpg/for_the_first_time_i_got_an_unskippable_add_on_my/\"&gt;https://www.reddit.com/r/netflix/comments/65gxpg/for_the_first_time_i_got_an_unskippable_add_on_my/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit3: I just contacted support again and apparently it is a thing but support said it&amp;#39;s only temporary.  &lt;a href=\"http://i.imgur.com/sSA2gQy.png\"&gt;http://i.imgur.com/sSA2gQy.png&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We just launched the Netflix app on Roku then selected a profile and it forced us to watch an ad for Sandy Wexler before being able to see any lists or select a show. I contacted support (they were very helpful) and they said it was a fluke and that shouldn't be happening. I know that sometimes companies will neglect to inform their support personnel about changes so I thought I might ask others that use Netflix. \n\nEdit: It should also be noted that we were not presented with any watch now or add to list buttons. There was nothing but the ad. \n\nEdit2: It looks like another thread was posted for the same thing. https://www.reddit.com/r/netflix/comments/65gxpg/for_the_first_time_i_got_an_unskippable_add_on_my/\n\nEdit3: I just contacted support again and apparently it is a thing but support said it's only temporary.  http://i.imgur.com/sSA2gQy.png", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[META]", "id": "65gix2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 40, "report_reasons": null, "author": "NavelBarricade", "saved": false, "mod_reports": [], "name": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "approved_by": null, "over_18": false, "domain": "self.netflix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qoxj", "edited": 1492320129.0, "link_flair_css_class": "one", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/netflix/comments/65gix2/has_anybody_else_been_forced_to_sit_through_an_ad/", "num_reports": null, "locked": false, "stickied": false, "created": 1492248098.0, "url": "https://www.reddit.com/r/netflix/comments/65gix2/has_anybody_else_been_forced_to_sit_through_an_ad/", "author_flair_text": null, "quarantine": false, "title": "Has Anybody Else Been Forced To Sit Through An Ad? [ALL]", "created_utc": 1492219298.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 24, "visited": false, "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgak88m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dga975l", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "Please contact support via the built in web chat. If they know that we don't like it and won't tolerate it then they're likely to stop it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please contact support via the built in web chat. If they know that we don&amp;#39;t like it and won&amp;#39;t tolerate it then they&amp;#39;re likely to stop it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgak88m", "score_hidden": false, "stickied": false, "created": 1492285350.0, "created_utc": 1492256550.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga975l", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dsDoan", "parent_id": "t1_dga3gd9", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "I was forced to watch the same ad on PS4, immediately upon entering my profile. I tried closing it multiple times, but I was prevented from accessing my profile until I watched the entire ad.\n\nI've never experienced this before the recent Netflix app update.  I immediately gave the show a negative rating.", "edited": 1492229219.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was forced to watch the same ad on PS4, immediately upon entering my profile. I tried closing it multiple times, but I was prevented from accessing my profile until I watched the entire ad.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never experienced this before the recent Netflix app update.  I immediately gave the show a negative rating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dga975l", "score_hidden": false, "stickied": false, "created": 1492257700.0, "created_utc": 1492228900.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3gd9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dga3b19", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "It's certainly possible that it was a glitch, I guess. When my wife saw it though she backed up to the profile screen and when back in to be greeted the same way. After the ad was finished we were able to select a different show.  \n\nEdit: removed a paragraph that didn't make any sense. ", "edited": 1492220845.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s certainly possible that it was a glitch, I guess. When my wife saw it though she backed up to the profile screen and when back in to be greeted the same way. After the ad was finished we were able to select a different show.  &lt;/p&gt;\n\n&lt;p&gt;Edit: removed a paragraph that didn&amp;#39;t make any sense. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dga3gd9", "score_hidden": false, "stickied": false, "created": 1492249143.0, "created_utc": 1492220343.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgal5r7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dgajucj", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "Xfinity/Comcast customers can watch whenever and wherever too. They have an app that allows customers to watch live television on the go. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Xfinity/Comcast customers can watch whenever and wherever too. They have an app that allows customers to watch live television on the go. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgal5r7", "score_hidden": false, "stickied": false, "created": 1492287689.0, "created_utc": 1492258889.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgarsfk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Zinthaniel", "parent_id": "t1_dgajucj", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "You can watch cable on your tablet and phones. If Netflix adds ads to their service, again, there is nothing to distinguish them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can watch cable on your tablet and phones. If Netflix adds ads to their service, again, there is nothing to distinguish them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgarsfk", "score_hidden": false, "stickied": false, "created": 1492299264.0, "created_utc": 1492270464.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajucj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Firecreeper42", "parent_id": "t1_dga3b19", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "&gt; it's literally the only thing that distinguishes it from television\n\nexcept of course the fact that you can watch whatever you want whenever you want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s literally the only thing that distinguishes it from television&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;except of course the fact that you can watch whatever you want whenever you want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgajucj", "score_hidden": false, "stickied": false, "created": 1492284289.0, "created_utc": 1492255489.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgakzs8", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "wakey87433", "parent_id": "t1_dga93vs", "subreddit_name_prefixed": "r/netflix", "controversiality": 1, "body": "Don't know why I'm getting downvoted for stating an opinion with some valid basis rather than you lot and your self-entitlement.\n\nIt's easy to look at it from a selfish viewpoint but surely you want Netflix to succeed so you have to look at the bigger picture. We see constant complaints about lack of content but a big part of that is Netflix are small fry in the grand scheme of things. They need more money to spend in content if we want them to provide anything close to that dream service and certainly, need to actually be turning a profit rather than having to take on debt each year to remain viable (As people being willing to provide this debt will dry up if they don't show a massively profitable business at some point). Are people happy being the ones who provide that extra income despite previously there being complaints about even a $1 rise. We can't have our cake and eat it and there has to be a compromise somewhere and that means either lowering our expectations of the service, accepting much higher prices or accepting minimal ads (or a combination of the 3).\n\nAnd on the content do we really want them spending so much on say The Crown when they can't even get 5% of their subscribers to watch it and most who do finish it in a week and watch it in within a month of launching meaning that 5% of the userbase needs a new original the month after to keep them subscribing. Viewership of the originals seems to be really low based on the monitoring firms and a big part of that has to come down to exposure. While for us here we may get exposed to the trailers so can make a decision thats not the case for the normal user, their exposure come only from inside Netflix and all they know about each original is the image and if that draws them in enough the blurb.  \n\nAgain I will use HBO as an example, very few of their recent shows have captured me based on the show title or even a brief premise, the promos before shows I do watch though have turned me on to a number that I wouldn't have watched. The annoying thing with HBO Now is you often get the same promo over and over again, with some more intelligence to whats being shown it would be a major tool for getting people to try content that the name and image might turn them off (And name can have a major impact. I never had any desire to watch Veronica Mars based on the name and basic description and I didn't watch a single episode until it was about 15 episodes into season 1, it was only friends raving about it that made me check it out. If I had seen a trailer I think there would have been a big chance I would have checked it out)\n\nAt the end of the day if Netflix continue the way they are where everything they earn goes out on content, where they are overspending massively on originals that hardly anyone is watching and where they have backed themselves in a corner with the price they aren't going to still be around in 10 years, they will go the way of many other web-based services that were great at the building stage but couldn't work out how to make it work financially once they got passed the stage where losing money wasn't an issue", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t know why I&amp;#39;m getting downvoted for stating an opinion with some valid basis rather than you lot and your self-entitlement.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s easy to look at it from a selfish viewpoint but surely you want Netflix to succeed so you have to look at the bigger picture. We see constant complaints about lack of content but a big part of that is Netflix are small fry in the grand scheme of things. They need more money to spend in content if we want them to provide anything close to that dream service and certainly, need to actually be turning a profit rather than having to take on debt each year to remain viable (As people being willing to provide this debt will dry up if they don&amp;#39;t show a massively profitable business at some point). Are people happy being the ones who provide that extra income despite previously there being complaints about even a $1 rise. We can&amp;#39;t have our cake and eat it and there has to be a compromise somewhere and that means either lowering our expectations of the service, accepting much higher prices or accepting minimal ads (or a combination of the 3).&lt;/p&gt;\n\n&lt;p&gt;And on the content do we really want them spending so much on say The Crown when they can&amp;#39;t even get 5% of their subscribers to watch it and most who do finish it in a week and watch it in within a month of launching meaning that 5% of the userbase needs a new original the month after to keep them subscribing. Viewership of the originals seems to be really low based on the monitoring firms and a big part of that has to come down to exposure. While for us here we may get exposed to the trailers so can make a decision thats not the case for the normal user, their exposure come only from inside Netflix and all they know about each original is the image and if that draws them in enough the blurb.  &lt;/p&gt;\n\n&lt;p&gt;Again I will use HBO as an example, very few of their recent shows have captured me based on the show title or even a brief premise, the promos before shows I do watch though have turned me on to a number that I wouldn&amp;#39;t have watched. The annoying thing with HBO Now is you often get the same promo over and over again, with some more intelligence to whats being shown it would be a major tool for getting people to try content that the name and image might turn them off (And name can have a major impact. I never had any desire to watch Veronica Mars based on the name and basic description and I didn&amp;#39;t watch a single episode until it was about 15 episodes into season 1, it was only friends raving about it that made me check it out. If I had seen a trailer I think there would have been a big chance I would have checked it out)&lt;/p&gt;\n\n&lt;p&gt;At the end of the day if Netflix continue the way they are where everything they earn goes out on content, where they are overspending massively on originals that hardly anyone is watching and where they have backed themselves in a corner with the price they aren&amp;#39;t going to still be around in 10 years, they will go the way of many other web-based services that were great at the building stage but couldn&amp;#39;t work out how to make it work financially once they got passed the stage where losing money wasn&amp;#39;t an issue&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgakzs8", "score_hidden": false, "stickied": false, "created": 1492287291.0, "created_utc": 1492258491.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dga93vs", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "wakey87433", "parent_id": "t1_dga3b19", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "Personally, I don't have a problem with them showing promos for their content as long as it's done smartly. After all, they are blowing a ridiculous amount on the content but the viewing estimates are never exactly what you would call stellar rather they end up being more niche content. Long term they can't keep that up, they are always going to have to put out more originals than traditional outlets due to the binge nature but if that content is niche thats even more they need to put out to ensure there is a new original each month that appeals to every user and keeps them subscribing.\n\nThe big problem for them is making people aware of the content and its style and tone because you can't judge that based on the image and blurb but if they give you a taster via a promo that can be a good thing (it works well on HBO Now for example)\n\nHowever, it should use the metadata they collect to help serve the promos. They know if i've watched a promo for a show before so I shouldn't get the same promo, they know where I am in a show so with OITNB i'm on Season 3 so I shouldn't be shown s5 promos as that could provide spoilers and the likes.They should also probably limit how many per session as you don't want to be in the middle of a binge but get promos in between episodes.\n\n\nTBH I probally wouldn't be adverse to actual ads if done like the ones some of Hulu's Ad-free service have to include on certain shows. That shows an ad before and after the show, the end one is useless as im sure most people back out rather than watch those (after all the shows not covered by ad free are just the currently airing ones son people are less likely to be waiting for the next episode) so could be got rid of but a single short ad before a show  (or a binge session of a show)  really isn't all that inconvenient and if it provided Netflix a way of actually being financially viable unlike, providing more for content buys while keeping the price at the price people are happy with that would actually be a positive thing.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I don&amp;#39;t have a problem with them showing promos for their content as long as it&amp;#39;s done smartly. After all, they are blowing a ridiculous amount on the content but the viewing estimates are never exactly what you would call stellar rather they end up being more niche content. Long term they can&amp;#39;t keep that up, they are always going to have to put out more originals than traditional outlets due to the binge nature but if that content is niche thats even more they need to put out to ensure there is a new original each month that appeals to every user and keeps them subscribing.&lt;/p&gt;\n\n&lt;p&gt;The big problem for them is making people aware of the content and its style and tone because you can&amp;#39;t judge that based on the image and blurb but if they give you a taster via a promo that can be a good thing (it works well on HBO Now for example)&lt;/p&gt;\n\n&lt;p&gt;However, it should use the metadata they collect to help serve the promos. They know if i&amp;#39;ve watched a promo for a show before so I shouldn&amp;#39;t get the same promo, they know where I am in a show so with OITNB i&amp;#39;m on Season 3 so I shouldn&amp;#39;t be shown s5 promos as that could provide spoilers and the likes.They should also probably limit how many per session as you don&amp;#39;t want to be in the middle of a binge but get promos in between episodes.&lt;/p&gt;\n\n&lt;p&gt;TBH I probally wouldn&amp;#39;t be adverse to actual ads if done like the ones some of Hulu&amp;#39;s Ad-free service have to include on certain shows. That shows an ad before and after the show, the end one is useless as im sure most people back out rather than watch those (after all the shows not covered by ad free are just the currently airing ones son people are less likely to be waiting for the next episode) so could be got rid of but a single short ad before a show  (or a binge session of a show)  really isn&amp;#39;t all that inconvenient and if it provided Netflix a way of actually being financially viable unlike, providing more for content buys while keeping the price at the price people are happy with that would actually be a positive thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dga93vs", "score_hidden": false, "stickied": false, "created": 1492257551.0, "created_utc": 1492228751.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -9}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3b19", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Zinthaniel", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "I have never seen an ad on netflix.  \n\nNetflix's foundation is advertisement free entertainment. It would be suicidal to change that in that it's literally the only thing that distinguishes it from television, so I going to side with the representative you spoke to who said it was a glitch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have never seen an ad on netflix.  &lt;/p&gt;\n\n&lt;p&gt;Netflix&amp;#39;s foundation is advertisement free entertainment. It would be suicidal to change that in that it&amp;#39;s literally the only thing that distinguishes it from television, so I going to side with the representative you spoke to who said it was a glitch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dga3b19", "score_hidden": false, "stickied": false, "created": 1492248937.0, "created_utc": 1492220137.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dga99te", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Viltrac", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "This literally just happened to me! I tried backing out and then going back in, and I still couldn't access my stuff until it had played. Mind you it's only the 15 second trailer, but still, kinda uncool in my opinion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This literally just happened to me! I tried backing out and then going back in, and I still couldn&amp;#39;t access my stuff until it had played. Mind you it&amp;#39;s only the 15 second trailer, but still, kinda uncool in my opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dga99te", "score_hidden": false, "stickied": false, "created": 1492257818.0, "created_utc": 1492229018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgar3gb", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "mertcan1k2", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "Netflix must be fucking stupid to do such a moronic thing... fucking adam sandler, who wants to watch adam sandler anyway?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Netflix must be fucking stupid to do such a moronic thing... fucking adam sandler, who wants to watch adam sandler anyway?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgar3gb", "score_hidden": false, "stickied": false, "created": 1492298279.0, "created_utc": 1492269479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dga5o5g", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dga5m4t", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "It looks like once you've seen it you won't be shown it again. Still, even once is too much, especially for an Adam Sandler movie. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like once you&amp;#39;ve seen it you won&amp;#39;t be shown it again. Still, even once is too much, especially for an Adam Sandler movie. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dga5o5g", "score_hidden": false, "stickied": false, "created": 1492252294.0, "created_utc": 1492223494.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dga5m4t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "netflixist", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "I saw this today,but only once, until now.\n\nI don't know if it's possible to skip it though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw this today,but only once, until now.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if it&amp;#39;s possible to skip it though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dga5m4t", "score_hidden": false, "stickied": false, "created": 1492252217.0, "created_utc": 1492223417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgac9d6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "real-dreamer", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "I pulled up Netflix on my computer and was able to mute it and scroll down. People on other systems certainly deserve the similar ability. You did the right thing in calling them up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I pulled up Netflix on my computer and was able to mute it and scroll down. People on other systems certainly deserve the similar ability. You did the right thing in calling them up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgac9d6", "score_hidden": false, "stickied": false, "created": 1492263217.0, "created_utc": 1492234417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgaifcd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Captain_Jake_K", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "I just had this in the UK using my PS4. I could exit out of it to search, but I couldn't skip it or do anything with it. I had to watch it. I really hope this isn't a trend.\n\nI just tried resetting my PS4 and loading it on my laptop and it didn't happen again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just had this in the UK using my PS4. I could exit out of it to search, but I couldn&amp;#39;t skip it or do anything with it. I had to watch it. I really hope this isn&amp;#39;t a trend.&lt;/p&gt;\n\n&lt;p&gt;I just tried resetting my PS4 and loading it on my laptop and it didn&amp;#39;t happen again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgaifcd", "score_hidden": false, "stickied": false, "created": 1492279922.0, "created_utc": 1492251122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dganrk6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dganqd9", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "We were on the Roku so maybe that's the difference? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We were on the Roku so maybe that&amp;#39;s the difference? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dganrk6", "score_hidden": false, "stickied": false, "created": 1492293008.0, "created_utc": 1492264208.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dganqd9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "solid437", "parent_id": "t1_dganmd5", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "Ps3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ps3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dganqd9", "score_hidden": false, "stickied": false, "created": 1492292947.0, "created_utc": 1492264147.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dganmd5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dgamhiw", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "We weren't able to hit anything but fast forward to get it to go away. What device were you watching it on?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We weren&amp;#39;t able to hit anything but fast forward to get it to go away. What device were you watching it on?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dganmd5", "score_hidden": false, "stickied": false, "created": 1492292746.0, "created_utc": 1492263946.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgamhiw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "solid437", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "Happened to me too you can hit cancel and it goes away", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happened to me too you can hit cancel and it goes away&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgamhiw", "score_hidden": false, "stickied": false, "created": 1492290583.0, "created_utc": 1492261783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgbog2b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dgbobhn", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "Well, they have started with ads. I'm curious how long it will last though. In the past they've been very clear that they are not going to have ads on their service. They even have help documentation that says they will never push ads on their customers.  \n\nI strongly feel that if people contact customer service when they see the ads to let them know they don't want to see them that the practice will stop. Netflix has, up until this point, had a good idea of what their customers want. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, they have started with ads. I&amp;#39;m curious how long it will last though. In the past they&amp;#39;ve been very clear that they are not going to have ads on their service. They even have help documentation that says they will never push ads on their customers.  &lt;/p&gt;\n\n&lt;p&gt;I strongly feel that if people contact customer service when they see the ads to let them know they don&amp;#39;t want to see them that the practice will stop. Netflix has, up until this point, had a good idea of what their customers want. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgbog2b", "score_hidden": false, "stickied": false, "created": 1492345638.0, "created_utc": 1492316838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbobhn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deepit6431", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "If they start with ads I'm going straight back to piracy,", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If they start with ads I&amp;#39;m going straight back to piracy,&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgbobhn", "score_hidden": false, "stickied": false, "created": 1492345416.0, "created_utc": 1492316616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgeilw0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kminnick215", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "I had a trailer for Girlboss after I finished the dwindling seasons of Bob's Burgers. Not sure if I was able to skip it or not, don't think I tried. The worst part was the fact it was a red band trailer (language) immediately after a family-friendly show.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a trailer for Girlboss after I finished the dwindling seasons of Bob&amp;#39;s Burgers. Not sure if I was able to skip it or not, don&amp;#39;t think I tried. The worst part was the fact it was a red band trailer (language) immediately after a family-friendly show.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgeilw0", "score_hidden": false, "stickied": false, "created": 1492509773.0, "created_utc": 1492480973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qoxj", "removal_reason": null, "link_id": "t3_65gix2", "likes": null, "replies": "", "user_reports": [], "id": "dgas9hc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NavelBarricade", "parent_id": "t1_dgas8eb", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "If you read the comments in this post you'll see there are more. Also, it was confirmed by their customer support to be happening as an attempt to promote their original content. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you read the comments in this post you&amp;#39;ll see there are more. Also, it was confirmed by their customer support to be happening as an attempt to promote their original content. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgas9hc", "score_hidden": false, "stickied": false, "created": 1492299933.0, "created_utc": 1492271133.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas8eb", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Gremlinonline", "parent_id": "t3_65gix2", "subreddit_name_prefixed": "r/netflix", "controversiality": 0, "body": "This has only been reported by two people so far. This thread and then another made by user \"throwawayaccount-4\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This has only been reported by two people so far. This thread and then another made by user &amp;quot;throwawayaccount-4&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "netflix", "name": "t1_dgas8eb", "score_hidden": false, "stickied": false, "created": 1492299890.0, "created_utc": 1492271090.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]