[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "startrek", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What does your crew look like?  Tell me about your Captain, 1st officer, Medical Chief, Cheif Engineer, and some of your key positions (like helm officer, maybe science officer, ops, coms, etc.)&lt;/p&gt;\n\n&lt;p&gt;Who is  your &amp;quot;Pinocchio / not quite human / Spok, Data, 7 of 9, EMH, Odo&amp;quot; character or characters?  What is their story?&lt;/p&gt;\n\n&lt;p&gt;What is the new tech on the Enterprise?  What part of space are you in?  What are the major themes, and what is your first major arc?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What does your crew look like?  Tell me about your Captain, 1st officer, Medical Chief, Cheif Engineer, and some of your key positions (like helm officer, maybe science officer, ops, coms, etc.)\n\nWho is  your \"Pinocchio / not quite human / Spok, Data, 7 of 9, EMH, Odo\" character or characters?  What is their story?\n\nWhat is the new tech on the Enterprise?  What part of space are you in?  What are the major themes, and what is your first major arc?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64snnw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "stos313", "saved": false, "mod_reports": [], "name": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "approved_by": null, "over_18": false, "domain": "self.startrek", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qixm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/startrek/comments/64snnw/paramount_taps_you_to_write_a_pilot_for_a_star/", "num_reports": null, "locked": false, "stickied": false, "created": 1491963739.0, "url": "https://www.reddit.com/r/startrek/comments/64snnw/paramount_taps_you_to_write_a_pilot_for_a_star/", "author_flair_text": null, "quarantine": false, "title": "Paramount taps YOU to write a pilot for a Star Trek show about the Enterprise NCC-1701 H....", "created_utc": 1491934939.0, "distinguished": null, "media": null, "upvote_ratio": 0.6, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg51tvp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "iamnotsteven", "parent_id": "t1_dg500fb", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Like cockroaches when the lights are turned on", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like cockroaches when the lights are turned on&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg51tvp", "score_hidden": false, "stickied": false, "created": 1491979171.0, "created_utc": 1491950371.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg500fb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TheChesterChesterton", "parent_id": "t1_dg4prph", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Uh-oh they're onto us.... quick, SCATTER!\n\n*execs scurry quickly out of view*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh-oh they&amp;#39;re onto us.... quick, SCATTER!&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;execs scurry quickly out of view&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg500fb", "score_hidden": false, "stickied": false, "created": 1491976860.0, "created_utc": 1491948060.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4prph", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "nerd0001", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Nice Try Paramount...but you can't afford me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice Try Paramount...but you can&amp;#39;t afford me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4prph", "score_hidden": false, "stickied": false, "created": 1491965321.0, "created_utc": 1491936521.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg5xp04", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cole-Spudmoney", "parent_id": "t1_dg5ddk4", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "I'm glad you like it. Trouble is, a lot of it really isn't easily adaptable to being set on the Enterprise-H, which would have to be sometime in the mid-25th century at the earliest. Even though it'd be written so any newcomer could dive right into it, a lot of the backstory and character history I came up with relies on it being set in the 2390s. The Hobus disaster that destroyed Romulus in 2387 was less than ten years ago, so even though the region's not in utter chaos any more it's still very volatile and unpredictable. And it's also been about 20 years since the Dominion War ended, which means that the main characters either fought in it when they were young adults or lived through it when they were children. So that's why I was like \"Screw it, I'm not changing the time period.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad you like it. Trouble is, a lot of it really isn&amp;#39;t easily adaptable to being set on the Enterprise-H, which would have to be sometime in the mid-25th century at the earliest. Even though it&amp;#39;d be written so any newcomer could dive right into it, a lot of the backstory and character history I came up with relies on it being set in the 2390s. The Hobus disaster that destroyed Romulus in 2387 was less than ten years ago, so even though the region&amp;#39;s not in utter chaos any more it&amp;#39;s still very volatile and unpredictable. And it&amp;#39;s also been about 20 years since the Dominion War ended, which means that the main characters either fought in it when they were young adults or lived through it when they were children. So that&amp;#39;s why I was like &amp;quot;Screw it, I&amp;#39;m not changing the time period.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5xp04", "score_hidden": false, "stickied": false, "created": 1492036269.0, "created_utc": 1492007469.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ddk4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stos313", "parent_id": "t1_dg5ceos", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "This is great!!  Good call!  I think Romulan space is where we need to go next!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is great!!  Good call!  I think Romulan space is where we need to go next!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5ddk4", "score_hidden": false, "stickied": false, "created": 1491994573.0, "created_utc": 1491965773.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg783tw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tomcfc87", "parent_id": "t1_dg5ceos", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "All I could think looking at that image of the second Ds9 is \"why on earth would they connect all the docking pylons together? That means fewer ships can dock\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All I could think looking at that image of the second Ds9 is &amp;quot;why on earth would they connect all the docking pylons together? That means fewer ships can dock&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg783tw", "score_hidden": false, "stickied": false, "created": 1492092058.0, "created_utc": 1492063258.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ceos", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Cole-Spudmoney", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Aw, man, does it have to be so far ahead? I've got plenty of ideas for a series set in the 2390s (fifteen years after *Nemesis*, since that movie came out fifteen years ago), building on the events of DS9, tech introduced in \"Voyager\", and the backstory from the 2009 movie... but the Enterprise-E would probably still be around. Okay, I'll give you my pitch for the 2390s show instead. \n\nThey're exploring former Romulan space in the Beta Quadrant: territory that used to be cut off by the Neutral Zone. Since the Hobus disaster that destroyed Romulus (thank you, 2009 movie) the Romulan Star Empire has collapsed: in its place there are several successor states, factions that want to restore the empire, a faction that still wants reunification with Vulcan, a bunch of alien species formerly ruled by the Romulans who now have independence (and some of whom want to try building their own empires now), Klingons looking at expanding their own territory... plus of course plenty of completely unrelated strange new worlds.\n\nNew tech: our starship (let's call it the Odyssey because that's a cool name) is about ten years old, and its most obvious technological advance is that it has a quantum slipstream drive. This allows near-instantaneous travel to wherever they want to go, but unfortunately it takes a lot of power so they need to use it sparingly and generally rely on warp drive. \n\nNow, the crew. I think I would better distinguish the differences between the science, ops and tactical stations, because in TNG and VOY they all seem to overlap. So: the science officer is a senior staff member again, they're the coordinator of all the ship's scientific divisions, and their station deals with external sensors and data interpretation; the ops officer deals with internal sensors, system functions and operations; the tactical officer is not a senior staff member, is entirely separate to being chief of security, and their job is basically weapons plus comms. \n\nThe captain: she's a Coridanite, ideally played by Gina Torres. She fought in the Dominion War when she was fresh out of the Academy. I'd recycle something from the \"Enterprise Relaunch\" novels: that the Romulans devastated Coridan in the 2150s, which is why they didn't join the UFP until a century later.\n\nThe first officer: he's human, say mid-fifties, also a Dominion War veteran – after which he was involved in the joint Federation-Klingon-Romulan occupation of Cardassia (meaning he has an up-close-and-personal view of how Romulans operate). He also used to work for Starfleet Intelligence.\n\nThe science officer is our everyman character – he's also a Bolian. He's nice, sensible, kind of dorky, like someone's uncool dad. (And he actually is a parent: Bolians are polygamists, and he has a wife who's a civilian on a starbase who has another husband who has another wife – the latter two are back on the homeworld raising the kids.)\n\nThe ops officer and the helm officer are best friends who used to date back in the Academy, both about 27 years old – they're our funny playful Tom-and-Harry characters. The ops officer is a Bajoran woman, and the helm officer is a human man. One way they really differ is on politics, though: the ops officer is much more cynical about the Federation in general (Bajor joined when she was a pre-teen) and tends to look at it in terms of how it can benefit Bajor, while the helm officer is more idealistic about all its utopian principles. \n\nOur not-quite-human character is the chief engineer: he's a Vulcan, sort of in the mould of Ambassador Soval. There could be something interesting made out of his dealing with his repressed emotional reactions and prejudices – not only with the openly emotional crew of the Odyssey, but also in reaction to the Romulans who are to some extent emotional Vulcans.\n\nAnd the security chief is an Andorian woman, and if I could woo her away from NCIS then I would totally cast Pauley Perrette. So now you know what the security chief is like.\n\nThere are other characters as well, but they'd be more in the background. We'd see the chief medical officer, but also others in the medical staff who work under her. We'd see the tactical officer, a male Deltan ensign who would end up dating the helm officer partway through the first season. We'd see the various specialist team leaders of the science division (e.g. chief biologist, geologist, environmental scientist, anthropologist...) and of the engineering division (for the quantum drive, the warp drive, the environmental systems, the mainframe...), junior officers for all of these, the second-in-command of security and the junior officers there, etc. etc. Basically, there's a *lot* of variety with who gets to go on away missions.\n\nOh, and because they're actually venturing into a region of space where there's been zero former Federation presence, every time they return to a starbase they're actually going to the same place: a space station in the former Neutral Zone, which I'll call Deep Space 12. It looks like [the second Deep Space 9](https://vignette3.wikia.nocookie.net/startrek/images/5/53/Deep_Space_9_%282%29.jpg/revision/latest?cb=20150130143622) from the books. There'll be some recurring characters who are stationed there, including the science officer's wife.\n\n(Yeah, I had a lot of fun thinking this stuff up.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aw, man, does it have to be so far ahead? I&amp;#39;ve got plenty of ideas for a series set in the 2390s (fifteen years after &lt;em&gt;Nemesis&lt;/em&gt;, since that movie came out fifteen years ago), building on the events of DS9, tech introduced in &amp;quot;Voyager&amp;quot;, and the backstory from the 2009 movie... but the Enterprise-E would probably still be around. Okay, I&amp;#39;ll give you my pitch for the 2390s show instead. &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re exploring former Romulan space in the Beta Quadrant: territory that used to be cut off by the Neutral Zone. Since the Hobus disaster that destroyed Romulus (thank you, 2009 movie) the Romulan Star Empire has collapsed: in its place there are several successor states, factions that want to restore the empire, a faction that still wants reunification with Vulcan, a bunch of alien species formerly ruled by the Romulans who now have independence (and some of whom want to try building their own empires now), Klingons looking at expanding their own territory... plus of course plenty of completely unrelated strange new worlds.&lt;/p&gt;\n\n&lt;p&gt;New tech: our starship (let&amp;#39;s call it the Odyssey because that&amp;#39;s a cool name) is about ten years old, and its most obvious technological advance is that it has a quantum slipstream drive. This allows near-instantaneous travel to wherever they want to go, but unfortunately it takes a lot of power so they need to use it sparingly and generally rely on warp drive. &lt;/p&gt;\n\n&lt;p&gt;Now, the crew. I think I would better distinguish the differences between the science, ops and tactical stations, because in TNG and VOY they all seem to overlap. So: the science officer is a senior staff member again, they&amp;#39;re the coordinator of all the ship&amp;#39;s scientific divisions, and their station deals with external sensors and data interpretation; the ops officer deals with internal sensors, system functions and operations; the tactical officer is not a senior staff member, is entirely separate to being chief of security, and their job is basically weapons plus comms. &lt;/p&gt;\n\n&lt;p&gt;The captain: she&amp;#39;s a Coridanite, ideally played by Gina Torres. She fought in the Dominion War when she was fresh out of the Academy. I&amp;#39;d recycle something from the &amp;quot;Enterprise Relaunch&amp;quot; novels: that the Romulans devastated Coridan in the 2150s, which is why they didn&amp;#39;t join the UFP until a century later.&lt;/p&gt;\n\n&lt;p&gt;The first officer: he&amp;#39;s human, say mid-fifties, also a Dominion War veteran – after which he was involved in the joint Federation-Klingon-Romulan occupation of Cardassia (meaning he has an up-close-and-personal view of how Romulans operate). He also used to work for Starfleet Intelligence.&lt;/p&gt;\n\n&lt;p&gt;The science officer is our everyman character – he&amp;#39;s also a Bolian. He&amp;#39;s nice, sensible, kind of dorky, like someone&amp;#39;s uncool dad. (And he actually is a parent: Bolians are polygamists, and he has a wife who&amp;#39;s a civilian on a starbase who has another husband who has another wife – the latter two are back on the homeworld raising the kids.)&lt;/p&gt;\n\n&lt;p&gt;The ops officer and the helm officer are best friends who used to date back in the Academy, both about 27 years old – they&amp;#39;re our funny playful Tom-and-Harry characters. The ops officer is a Bajoran woman, and the helm officer is a human man. One way they really differ is on politics, though: the ops officer is much more cynical about the Federation in general (Bajor joined when she was a pre-teen) and tends to look at it in terms of how it can benefit Bajor, while the helm officer is more idealistic about all its utopian principles. &lt;/p&gt;\n\n&lt;p&gt;Our not-quite-human character is the chief engineer: he&amp;#39;s a Vulcan, sort of in the mould of Ambassador Soval. There could be something interesting made out of his dealing with his repressed emotional reactions and prejudices – not only with the openly emotional crew of the Odyssey, but also in reaction to the Romulans who are to some extent emotional Vulcans.&lt;/p&gt;\n\n&lt;p&gt;And the security chief is an Andorian woman, and if I could woo her away from NCIS then I would totally cast Pauley Perrette. So now you know what the security chief is like.&lt;/p&gt;\n\n&lt;p&gt;There are other characters as well, but they&amp;#39;d be more in the background. We&amp;#39;d see the chief medical officer, but also others in the medical staff who work under her. We&amp;#39;d see the tactical officer, a male Deltan ensign who would end up dating the helm officer partway through the first season. We&amp;#39;d see the various specialist team leaders of the science division (e.g. chief biologist, geologist, environmental scientist, anthropologist...) and of the engineering division (for the quantum drive, the warp drive, the environmental systems, the mainframe...), junior officers for all of these, the second-in-command of security and the junior officers there, etc. etc. Basically, there&amp;#39;s a &lt;em&gt;lot&lt;/em&gt; of variety with who gets to go on away missions.&lt;/p&gt;\n\n&lt;p&gt;Oh, and because they&amp;#39;re actually venturing into a region of space where there&amp;#39;s been zero former Federation presence, every time they return to a starbase they&amp;#39;re actually going to the same place: a space station in the former Neutral Zone, which I&amp;#39;ll call Deep Space 12. It looks like &lt;a href=\"https://vignette3.wikia.nocookie.net/startrek/images/5/53/Deep_Space_9_%282%29.jpg/revision/latest?cb=20150130143622\"&gt;the second Deep Space 9&lt;/a&gt; from the books. There&amp;#39;ll be some recurring characters who are stationed there, including the science officer&amp;#39;s wife.&lt;/p&gt;\n\n&lt;p&gt;(Yeah, I had a lot of fun thinking this stuff up.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5ceos", "score_hidden": false, "stickied": false, "created": 1491993222.0, "created_utc": 1491964422.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg4s4m3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BebopRocksteady82", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "I think an animated show sort of like Archer. \n\nData is now the captain of the enterprise with a whole new cast of characters ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think an animated show sort of like Archer. &lt;/p&gt;\n\n&lt;p&gt;Data is now the captain of the enterprise with a whole new cast of characters &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4s4m3", "score_hidden": false, "stickied": false, "created": 1491967827.0, "created_utc": 1491939027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg4zera", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "psycholepzy", "parent_id": "t1_dg4uxd1", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Because someone real has to be the back up to fix everything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because someone real has to be the back up to fix everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4zera", "score_hidden": false, "stickied": false, "created": 1491976116.0, "created_utc": 1491947316.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4uxd1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crunchthenumbers01", "parent_id": "t1_dg4u198", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Why is the Chief Engineer not a,hologram", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why is the Chief Engineer not a,hologram&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4uxd1", "score_hidden": false, "stickied": false, "created": 1491970887.0, "created_utc": 1491942087.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4u198", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "greenvortex", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Star Trek: Prometheus. Set one year after the return of *Voyager*,  on a Federation starship completely crewed by holograms, except for the chief engineer. To give them distinct personalities, the holograms are based on real Starfleet personnel, including a few we've met before. They get Starfleet's most dangerous missions, since the crew is expendable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Star Trek: Prometheus. Set one year after the return of &lt;em&gt;Voyager&lt;/em&gt;,  on a Federation starship completely crewed by holograms, except for the chief engineer. To give them distinct personalities, the holograms are based on real Starfleet personnel, including a few we&amp;#39;ve met before. They get Starfleet&amp;#39;s most dangerous missions, since the crew is expendable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4u198", "score_hidden": false, "stickied": false, "created": 1491969889.0, "created_utc": 1491941089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg78csa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tomcfc87", "parent_id": "t1_dg4z2nb", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Do you not feel the twist in Planet of the Titans has already been done before tho. Seems very similar to the ending of modern Battlestar Galactica.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you not feel the twist in Planet of the Titans has already been done before tho. Seems very similar to the ending of modern Battlestar Galactica.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg78csa", "score_hidden": false, "stickied": false, "created": 1492092631.0, "created_utc": 1492063831.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4z2nb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SirDreward", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "I would resurrect [Star Trek: Federation](http://memory-alpha.wikia.com/wiki/Star_Trek:_Federation) and would resurrect and do a slight re-write of the original concept for [Star Trek: Planet of the Titans](http://memory-alpha.wikia.com/wiki/Star_Trek:_Planet_of_the_Titans) as a movie tie-in.", "edited": 1491947332.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would resurrect &lt;a href=\"http://memory-alpha.wikia.com/wiki/Star_Trek:_Federation\"&gt;Star Trek: Federation&lt;/a&gt; and would resurrect and do a slight re-write of the original concept for &lt;a href=\"http://memory-alpha.wikia.com/wiki/Star_Trek:_Planet_of_the_Titans\"&gt;Star Trek: Planet of the Titans&lt;/a&gt; as a movie tie-in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4z2nb", "score_hidden": false, "stickied": false, "created": 1491975711.0, "created_utc": 1491946911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg4zkzv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "psycholepzy", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "My show would take place in the 27th century for a number of reasons.\n\n1. It would be far enough away from the other series that it could stand on its own.\n\n2. Enough time would have passed to completely change the political landscape we're used to. Part of the allure would be introducing the audience to what has changed and what hasn't\n\n3. There are a couple things hinted at in the other series that occur in the 27th century. New stories can emerge from these callbacks\n\n4. Some characters can live this long - Data, Guinan. It would be fun to explore more of them or have cameos.\n\n5. Create technology that has as much of a wow factor for 21st century audiences as TOS had for 1960s audiences.\n\nI have actually drafted a ten episode synopsis of this show and written a few scenes. I'm still excited about that a year later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My show would take place in the 27th century for a number of reasons.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;It would be far enough away from the other series that it could stand on its own.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Enough time would have passed to completely change the political landscape we&amp;#39;re used to. Part of the allure would be introducing the audience to what has changed and what hasn&amp;#39;t&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There are a couple things hinted at in the other series that occur in the 27th century. New stories can emerge from these callbacks&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Some characters can live this long - Data, Guinan. It would be fun to explore more of them or have cameos.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Create technology that has as much of a wow factor for 21st century audiences as TOS had for 1960s audiences.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I have actually drafted a ten episode synopsis of this show and written a few scenes. I&amp;#39;m still excited about that a year later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4zkzv", "score_hidden": false, "stickied": false, "created": 1491976323.0, "created_utc": 1491947523.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg5ado0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Valianttheywere", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Setting: We are not the crew that will ultimately explore in this vessel. We are the engineering team testing the ship...and oh my god something has gone horribly wrong. Half the crew are melted through the hull and we are on the edge of some other galaxy.\nAnd to make matters worse we are unable to get home without strapping one crewman down after the next to a table and extracting the possibility entanglement from their brains that literally connects that crewman to our moment of existence in space-time. We are lost not in space or time but in space-time.\n\nThe story is about what we are prepared to sacrifice to get home. The ethical choices. The instability of the man or woman in charge. \nBut first we need to violate the prime directive just to repair the ship. We need the help of a backwards people who believe in the existence of their god and that they are god's chosen few. And by giving them warp technology we set in motion the rise of genocidal idiots who make the romulans apealing. So in this galaxy there will be ships that look oddly federation but are crewed by xenophobic nutters bent on exterminating aliens.", "edited": 1491962633.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Setting: We are not the crew that will ultimately explore in this vessel. We are the engineering team testing the ship...and oh my god something has gone horribly wrong. Half the crew are melted through the hull and we are on the edge of some other galaxy.\nAnd to make matters worse we are unable to get home without strapping one crewman down after the next to a table and extracting the possibility entanglement from their brains that literally connects that crewman to our moment of existence in space-time. We are lost not in space or time but in space-time.&lt;/p&gt;\n\n&lt;p&gt;The story is about what we are prepared to sacrifice to get home. The ethical choices. The instability of the man or woman in charge. \nBut first we need to violate the prime directive just to repair the ship. We need the help of a backwards people who believe in the existence of their god and that they are god&amp;#39;s chosen few. And by giving them warp technology we set in motion the rise of genocidal idiots who make the romulans apealing. So in this galaxy there will be ships that look oddly federation but are crewed by xenophobic nutters bent on exterminating aliens.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5ado0", "score_hidden": false, "stickied": false, "created": 1491990474.0, "created_utc": 1491961674.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg5c87u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nmsbleezbalb", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Break the usual tropes. No need to emulate former crew characters. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Break the usual tropes. No need to emulate former crew characters. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5c87u", "score_hidden": false, "stickied": false, "created": 1491992973.0, "created_utc": 1491964173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg5i6xq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cyrius", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "I say no, because that far in the future Star Trek doesn't make sense anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I say no, because that far in the future Star Trek doesn&amp;#39;t make sense anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5i6xq", "score_hidden": false, "stickied": false, "created": 1492002476.0, "created_utc": 1491973676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg773te", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tomcfc87", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Not a pilot as such but my pitch for a full length multi season arc\n\nA crew in which humans are not the majority species would be interesting. A non human captain would be a must. Possibly the first Xindi captain in Starfleet as we know by the time of Enterprise J they will be members.\n\nThe galaxy would be a much smaller place. Things like transwarp technology would have developed to a point that has allowed the federation (as well as other civilisations) to expand their borders with colonies in all 4 qudrants. As such the show would focus less on exploration and more on diplomacy and conflict as the major powers are now vying not just to be the dominant power over a single quadrant but the entire galaxy. \n\nThe initial mission of the Enterprise H will be to patrol these newly expanded borders in the delta Quadrant. Essentially as a way for the show to revisit some of the more interesting planets and species from Voyager that we only got a brief glimpse of and to introduce some new ones that Voyager didn't encounter on its way home. Also to fill out the galaxy map a bit more in the space between Voyagers point of depature in the delta quadtant and the known borders of the alpha/beta quadrants. \n\nTensions are running strong within the federation resulting in entire planets opting to leave (rather than just small bands of assorted rebels as the Marquis were) and either declare independence or to join another alliance such as the Dominion. Trek has always been good at highliting issues in modern society and this would paralell modern political issues such as Brexit.\n\nThe destruction of Romulus will remain cannon and the remains of the Romulan Empire will have formed their own Federation type alliance with many other species who came to their aid. One story arc will involve the possibility of Vulcan leaving the Federation to join the new Romulan alliance due to the close links between the two species. At some point somebody will mention how this would never have happened if Ambassador Spock hadnt gone missing and to which someone will jokingly suggest they should go on a \"search for Spock\" (sorry).\n\nInitially the borg would still be a threat but not the fearsome force they one were as Starfleet (under the guidance of admirals Picard and Janeway) will have developed technology and tactics to keep a lid on them. That is until long awaited showdown between the Borg and the Dominion. The Borg emerge victorious and with an army of assimilated Jem Hadar battle drones and nanite controlled shapshifter agents become a force than once again threatens the entire galaxy.\n\nAt some point (probably around season 5/6) there would be an episode in which the Enterprise H travels to the bajoran wormhole in order to attempt to make contact with Sisko and the prophets in order to beg them for help against the new \"Borgminion\" threat. Sisko will sympathise and want to help as he recieved help before but the rest of the prophets will refuse as they have already helped him once before. A compromise will be reached in that they will not directly intervene as they did before but instead offer some of their classic cryptic guidance that leads to the Enterprise crew discovering how to defeat the borg themselves.\n\nI recognise there is a lot of fan service in there but I think that there is only so far you can take a franchise about exploring the galaxy before people start to ask why haven't they explored everywhere yet? You can only introduce so many technologically advanced species before people start asking why we have never seen them before. The only alternative is to start expanding the franchise beyond the milmy way galaxy which I feel would kind of reset Trek back to square one.", "edited": 1492063688.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not a pilot as such but my pitch for a full length multi season arc&lt;/p&gt;\n\n&lt;p&gt;A crew in which humans are not the majority species would be interesting. A non human captain would be a must. Possibly the first Xindi captain in Starfleet as we know by the time of Enterprise J they will be members.&lt;/p&gt;\n\n&lt;p&gt;The galaxy would be a much smaller place. Things like transwarp technology would have developed to a point that has allowed the federation (as well as other civilisations) to expand their borders with colonies in all 4 qudrants. As such the show would focus less on exploration and more on diplomacy and conflict as the major powers are now vying not just to be the dominant power over a single quadrant but the entire galaxy. &lt;/p&gt;\n\n&lt;p&gt;The initial mission of the Enterprise H will be to patrol these newly expanded borders in the delta Quadrant. Essentially as a way for the show to revisit some of the more interesting planets and species from Voyager that we only got a brief glimpse of and to introduce some new ones that Voyager didn&amp;#39;t encounter on its way home. Also to fill out the galaxy map a bit more in the space between Voyagers point of depature in the delta quadtant and the known borders of the alpha/beta quadrants. &lt;/p&gt;\n\n&lt;p&gt;Tensions are running strong within the federation resulting in entire planets opting to leave (rather than just small bands of assorted rebels as the Marquis were) and either declare independence or to join another alliance such as the Dominion. Trek has always been good at highliting issues in modern society and this would paralell modern political issues such as Brexit.&lt;/p&gt;\n\n&lt;p&gt;The destruction of Romulus will remain cannon and the remains of the Romulan Empire will have formed their own Federation type alliance with many other species who came to their aid. One story arc will involve the possibility of Vulcan leaving the Federation to join the new Romulan alliance due to the close links between the two species. At some point somebody will mention how this would never have happened if Ambassador Spock hadnt gone missing and to which someone will jokingly suggest they should go on a &amp;quot;search for Spock&amp;quot; (sorry).&lt;/p&gt;\n\n&lt;p&gt;Initially the borg would still be a threat but not the fearsome force they one were as Starfleet (under the guidance of admirals Picard and Janeway) will have developed technology and tactics to keep a lid on them. That is until long awaited showdown between the Borg and the Dominion. The Borg emerge victorious and with an army of assimilated Jem Hadar battle drones and nanite controlled shapshifter agents become a force than once again threatens the entire galaxy.&lt;/p&gt;\n\n&lt;p&gt;At some point (probably around season 5/6) there would be an episode in which the Enterprise H travels to the bajoran wormhole in order to attempt to make contact with Sisko and the prophets in order to beg them for help against the new &amp;quot;Borgminion&amp;quot; threat. Sisko will sympathise and want to help as he recieved help before but the rest of the prophets will refuse as they have already helped him once before. A compromise will be reached in that they will not directly intervene as they did before but instead offer some of their classic cryptic guidance that leads to the Enterprise crew discovering how to defeat the borg themselves.&lt;/p&gt;\n\n&lt;p&gt;I recognise there is a lot of fan service in there but I think that there is only so far you can take a franchise about exploring the galaxy before people start to ask why haven&amp;#39;t they explored everywhere yet? You can only introduce so many technologically advanced species before people start asking why we have never seen them before. The only alternative is to start expanding the franchise beyond the milmy way galaxy which I feel would kind of reset Trek back to square one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg773te", "score_hidden": false, "stickied": false, "created": 1492089908.0, "created_utc": 1492061108.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg88k1w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "headvoice73", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "This is a repost of a comment I had in another thread but here goes the pitch:\n\nI think there is a great story post Nem in which the Federation, and age old enemies of the federation like the klingons, romulans and cardasians, all find themselves coming up against the reality that warp drive is destroying the very fabric of space and those ill effects are being seen everywhere now. There were warnings in the past (TNG episode about this), but they went largely unheeded. The main problem turns out to be the very thing that powers warp drive - dilythium crystals. An alternative to dilithium crystals has to be found.\n\nIn an act of desperation and as a symbol of hope, one crew is put together comprised of officers and beings from not only the federation but also many of their enemies. This ship is given the task of exploring the galaxy for a solution to 'The Dilithium Problem.' The name of the ship they will travel on is also a symbol, a symbol of the spirit of exploration - ENTERPRISE.\n\nAs a passing of the torch, Jean Luc Picard, now a fleet admiral, speerheads the idea, putting the crew together through his many diplomatic contacts and arranges to get the most advanced ship in the fleet. This would be a good opportunity to tie the new crew to the heritage of all the Trek that has come before it. Not to mention, it would be really cool fan service to see Picard in action one last time and to give him a better farewell than NEM.\n\nIdeas for crewmembers: Gem Hadar security officer, a science officer that is a physical representation of the AI that runs the ship (essentially the ship is another character), a human captain that was once a POW of one of the other crewmember's worlds. A hot head romulan 2nd in command...... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a repost of a comment I had in another thread but here goes the pitch:&lt;/p&gt;\n\n&lt;p&gt;I think there is a great story post Nem in which the Federation, and age old enemies of the federation like the klingons, romulans and cardasians, all find themselves coming up against the reality that warp drive is destroying the very fabric of space and those ill effects are being seen everywhere now. There were warnings in the past (TNG episode about this), but they went largely unheeded. The main problem turns out to be the very thing that powers warp drive - dilythium crystals. An alternative to dilithium crystals has to be found.&lt;/p&gt;\n\n&lt;p&gt;In an act of desperation and as a symbol of hope, one crew is put together comprised of officers and beings from not only the federation but also many of their enemies. This ship is given the task of exploring the galaxy for a solution to &amp;#39;The Dilithium Problem.&amp;#39; The name of the ship they will travel on is also a symbol, a symbol of the spirit of exploration - ENTERPRISE.&lt;/p&gt;\n\n&lt;p&gt;As a passing of the torch, Jean Luc Picard, now a fleet admiral, speerheads the idea, putting the crew together through his many diplomatic contacts and arranges to get the most advanced ship in the fleet. This would be a good opportunity to tie the new crew to the heritage of all the Trek that has come before it. Not to mention, it would be really cool fan service to see Picard in action one last time and to give him a better farewell than NEM.&lt;/p&gt;\n\n&lt;p&gt;Ideas for crewmembers: Gem Hadar security officer, a science officer that is a physical representation of the AI that runs the ship (essentially the ship is another character), a human captain that was once a POW of one of the other crewmember&amp;#39;s worlds. A hot head romulan 2nd in command...... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg88k1w", "score_hidden": false, "stickied": false, "created": 1492146832.0, "created_utc": 1492118032.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg7zq1u", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "DataThomasWillLore", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "I think the commanding officer should either be Old McCoy (\"Encounter at Farpoint\") or that old fart admiral from \"Too Short a Season.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the commanding officer should either be Old McCoy (&amp;quot;Encounter at Farpoint&amp;quot;) or that old fart admiral from &amp;quot;Too Short a Season.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg7zq1u", "score_hidden": false, "stickied": false, "created": 1492137069.0, "created_utc": 1492108269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64snnw", "likes": null, "replies": "", "user_reports": [], "id": "dg4sdun", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Conchobair", "parent_id": "t3_64snnw", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "It'd wind up being a porno.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;d wind up being a porno.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4sdun", "score_hidden": false, "stickied": false, "created": 1491968106.0, "created_utc": 1491939306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]