[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "startrek", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t remember if it was a solo concert, or with a group, but this was one of those subtle little ways the TNG crew went about insulting Data for being an android--condemning him for lacking the kinds of flaws that are potentially present in the performances of human musicians.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't remember if it was a solo concert, or with a group, but this was one of those subtle little ways the TNG crew went about insulting Data for being an android--condemning him for lacking the kinds of flaws that are potentially present in the performances of human musicians.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64t6wl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Sly_Lupin", "saved": false, "mod_reports": [], "name": "t3_64t6wl", "subreddit_name_prefixed": "r/startrek", "approved_by": null, "over_18": false, "domain": "self.startrek", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qixm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/startrek/comments/64t6wl/anyone_remember_the_specific_tng_episode_where/", "num_reports": null, "locked": false, "stickied": false, "created": 1491968484.0, "url": "https://www.reddit.com/r/startrek/comments/64t6wl/anyone_remember_the_specific_tng_episode_where/", "author_flair_text": null, "quarantine": false, "title": "Anyone remember the specific TNG episode where Data is criticized for playing music \"too perfectly?\"", "created_utc": 1491939684.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": "", "user_reports": [], "id": "dg54ifn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "boommicfucker", "parent_id": "t1_dg4vhvl", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "&gt; For the classical pieces Data was playing, I wouldn't call his playing too perfect or too good.\n\nThis. He probably played it exactly as it was written down, like a high-quality synthesizer. That's not bad, but it's missing personality, reaction to the audience, and so on. Playing music in front of a crowd is mean to be a performance art, after all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For the classical pieces Data was playing, I wouldn&amp;#39;t call his playing too perfect or too good.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This. He probably played it exactly as it was written down, like a high-quality synthesizer. That&amp;#39;s not bad, but it&amp;#39;s missing personality, reaction to the audience, and so on. Playing music in front of a crowd is mean to be a performance art, after all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg54ifn", "score_hidden": false, "stickied": false, "created": 1491982754.0, "created_utc": 1491953954.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": "", "user_reports": [], "id": "dg898ci", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "amoeba3", "parent_id": "t1_dg7wp57", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "The mere fact that Data was not emulating one past violinist, but around five of them mixed together, I think firmly rebuts your idea that there is only one way to play a score. Not to mention the basic fact that the majority of classical music notation makes it literally impossible to be played the same way by everyone. Tempo indications, for instance are generally not written in specific metronomic beats per minute, rather, they're indicated as slow, fast, faster, etc. It is up to the performer to choose precisely how slow or fast to interpret this. Similarly, indications of how loud to play are not written in decibel levels. One has to again make their own specific choice. That's why classical music fans such as myself don't just get one version of a piece and be done with it forever. It's why I love comparing Leonard Bernstein's version of the opening movement to Beethoven's Seventh with the NY Phil with Christoph Eschenbach's version with the Philly Orchestra (I prefer the latter) and what makes it possible for me to love Glenn Gould's versions of Bach's piano pieces far above anyone else's (and how it was possible for him to be viewed as such a genius). \n\nClassical music is certainly not jazz, but it so, so far from being a static thing. It simply isn't. For instance, are you aware that the concept of cadenzas is of playing an improvised solo? Just like jazz, a cadenza is a blank space where the lead soloist is expected to improvise based on what happened previously in the notated piece. Written down cadenzas today are merely transcriptions of popular solos done by popular past instrumentals. And sometimes even entire pieces are looser. Many of Chopin's works were different every time he performed them, and the written scores used today are simply one version of what he did.\n\nA Vulcan, given all of these realities would never have had the opportunity to be offered the same criticism as Data, because they would find it neither logical nor possible to do what Data did. They wouldn't have the physical capability of precisely averaging out five other people to the point of playing exactly the same every time. They would simply do what any good performer does - give their own interpretation. I imagine they would probably use less vibrato than a human would, for instance. If playing Bach, I imagine they would play the tempo more smooth and evenly, as Gould did, without as much pushing or pulling on the tempo as others would perhaps do. And all of this comes from simply reading the music on the paper. Just as much so as someone else playing it in a way that sounds very different. They're both equally playing it \"correctly.\" As opposed to their only being one way.\n\nThese truths being evident, that is why I have respect for the crew giving Data the feedback they did. Their critiques were based in the reality of how classical music is interpreted from page to performance - aspects of which it didn't seem you were fully aware of - and they were coming from the most generous possible position: from the inherent assumption that Data was fully capable of giving his own unique performance, drawn fully from himself, as opposed to precisely simply mimicking others. The ship's computer, after all, could have simply done that. But I doubt it could have made its own truly original version, as the crew inspired Data to. And that's why he is indeed a conscious human(oid), and not just Starfleet property.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mere fact that Data was not emulating one past violinist, but around five of them mixed together, I think firmly rebuts your idea that there is only one way to play a score. Not to mention the basic fact that the majority of classical music notation makes it literally impossible to be played the same way by everyone. Tempo indications, for instance are generally not written in specific metronomic beats per minute, rather, they&amp;#39;re indicated as slow, fast, faster, etc. It is up to the performer to choose precisely how slow or fast to interpret this. Similarly, indications of how loud to play are not written in decibel levels. One has to again make their own specific choice. That&amp;#39;s why classical music fans such as myself don&amp;#39;t just get one version of a piece and be done with it forever. It&amp;#39;s why I love comparing Leonard Bernstein&amp;#39;s version of the opening movement to Beethoven&amp;#39;s Seventh with the NY Phil with Christoph Eschenbach&amp;#39;s version with the Philly Orchestra (I prefer the latter) and what makes it possible for me to love Glenn Gould&amp;#39;s versions of Bach&amp;#39;s piano pieces far above anyone else&amp;#39;s (and how it was possible for him to be viewed as such a genius). &lt;/p&gt;\n\n&lt;p&gt;Classical music is certainly not jazz, but it so, so far from being a static thing. It simply isn&amp;#39;t. For instance, are you aware that the concept of cadenzas is of playing an improvised solo? Just like jazz, a cadenza is a blank space where the lead soloist is expected to improvise based on what happened previously in the notated piece. Written down cadenzas today are merely transcriptions of popular solos done by popular past instrumentals. And sometimes even entire pieces are looser. Many of Chopin&amp;#39;s works were different every time he performed them, and the written scores used today are simply one version of what he did.&lt;/p&gt;\n\n&lt;p&gt;A Vulcan, given all of these realities would never have had the opportunity to be offered the same criticism as Data, because they would find it neither logical nor possible to do what Data did. They wouldn&amp;#39;t have the physical capability of precisely averaging out five other people to the point of playing exactly the same every time. They would simply do what any good performer does - give their own interpretation. I imagine they would probably use less vibrato than a human would, for instance. If playing Bach, I imagine they would play the tempo more smooth and evenly, as Gould did, without as much pushing or pulling on the tempo as others would perhaps do. And all of this comes from simply reading the music on the paper. Just as much so as someone else playing it in a way that sounds very different. They&amp;#39;re both equally playing it &amp;quot;correctly.&amp;quot; As opposed to their only being one way.&lt;/p&gt;\n\n&lt;p&gt;These truths being evident, that is why I have respect for the crew giving Data the feedback they did. Their critiques were based in the reality of how classical music is interpreted from page to performance - aspects of which it didn&amp;#39;t seem you were fully aware of - and they were coming from the most generous possible position: from the inherent assumption that Data was fully capable of giving his own unique performance, drawn fully from himself, as opposed to precisely simply mimicking others. The ship&amp;#39;s computer, after all, could have simply done that. But I doubt it could have made its own truly original version, as the crew inspired Data to. And that&amp;#39;s why he is indeed a conscious human(oid), and not just Starfleet property.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg898ci", "score_hidden": false, "stickied": false, "created": 1492147648.0, "created_utc": 1492118848.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7wp57", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Sly_Lupin", "parent_id": "t1_dg4vhvl", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "A solid argument, but I'm not totally sold on the necessity or even practicality or even applicability of emulating other musicians.\n\nData isn't playing jazz... he's playing classical music based on a score. There is really only one way to play it. So long as one plays the proper notes in the proper rhythm, the result will always be the same. Data's best possible performance here is no better (nor any different) than any other musician's. The only difference is that his *worst* possible performance is (arguably) better than his peers.\n\nBecause, see, what bugs me is that I don't really view the feedback as \"honest.\" To me, it seems unduly biased. If a Vulcan had performed the exact same piece and said the exact same things as Data (about being influenced by other musicians), would they have responded with the same criticism?\n\nI don't really think so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A solid argument, but I&amp;#39;m not totally sold on the necessity or even practicality or even applicability of emulating other musicians.&lt;/p&gt;\n\n&lt;p&gt;Data isn&amp;#39;t playing jazz... he&amp;#39;s playing classical music based on a score. There is really only one way to play it. So long as one plays the proper notes in the proper rhythm, the result will always be the same. Data&amp;#39;s best possible performance here is no better (nor any different) than any other musician&amp;#39;s. The only difference is that his &lt;em&gt;worst&lt;/em&gt; possible performance is (arguably) better than his peers.&lt;/p&gt;\n\n&lt;p&gt;Because, see, what bugs me is that I don&amp;#39;t really view the feedback as &amp;quot;honest.&amp;quot; To me, it seems unduly biased. If a Vulcan had performed the exact same piece and said the exact same things as Data (about being influenced by other musicians), would they have responded with the same criticism?&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really think so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg7wp57", "score_hidden": false, "stickied": false, "created": 1492133861.0, "created_utc": 1492105061.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vhvl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "amoeba3", "parent_id": "t1_dg4u7v3", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Well I guess there's two halves of it really. \n\nThere's the larger trend in the series you mentioned, the notion that he'd have to handicap himself. On the one hand, the crew accepts and advocates for his being a being, a \"man.\" Like Measure of a Man of course. But then there's the ongoing desire on Data's part to transition from what he currently is -- a desire that would necessitate placing some handicaps on himself -- like not being able think as clearheadedly if he's laughing really hard at something or drunk or having sex. So it's not something imposed by the other crewmates, it's something Data truly wants.\n\nThe other half I think pertains more to the specific situation in this episode. For the classical pieces Data was playing, I wouldn't call his playing too perfect or too good. Because the real perfection lies in one's interpretations of the pieces. As he wanted to be the best player he could be, it would have been worse in my opinion for him not to be given advice on how to perform better. By giving him him honest feedback they enabled him to be better than he would have otherwise; they enabled him to give his own interpretive performance instead of being an amalgamated jukebox of all the other musicians he said he was emulating and combining. After all, playing like five different violinists from history averaged out doesn't equate to perfection.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I guess there&amp;#39;s two halves of it really. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s the larger trend in the series you mentioned, the notion that he&amp;#39;d have to handicap himself. On the one hand, the crew accepts and advocates for his being a being, a &amp;quot;man.&amp;quot; Like Measure of a Man of course. But then there&amp;#39;s the ongoing desire on Data&amp;#39;s part to transition from what he currently is -- a desire that would necessitate placing some handicaps on himself -- like not being able think as clearheadedly if he&amp;#39;s laughing really hard at something or drunk or having sex. So it&amp;#39;s not something imposed by the other crewmates, it&amp;#39;s something Data truly wants.&lt;/p&gt;\n\n&lt;p&gt;The other half I think pertains more to the specific situation in this episode. For the classical pieces Data was playing, I wouldn&amp;#39;t call his playing too perfect or too good. Because the real perfection lies in one&amp;#39;s interpretations of the pieces. As he wanted to be the best player he could be, it would have been worse in my opinion for him not to be given advice on how to perform better. By giving him him honest feedback they enabled him to be better than he would have otherwise; they enabled him to give his own interpretive performance instead of being an amalgamated jukebox of all the other musicians he said he was emulating and combining. After all, playing like five different violinists from history averaged out doesn&amp;#39;t equate to perfection.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4vhvl", "score_hidden": false, "stickied": false, "created": 1491971528.0, "created_utc": 1491942728.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4u7v3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sly_Lupin", "parent_id": "t1_dg4tm7a", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "I don't think they were *intended* as insults, but at the same time they *are* kind of insulting, ya' know? They're basically saying that in order to become more like a human, Data needs to handicap himself. \n\nEDIT: And then there's the element of disdain. The whole \"I couldn't really enjoy/appreciate your music because it was *too* good.\"\n\nI mean, really? That's one hell of a backhanded compliment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think they were &lt;em&gt;intended&lt;/em&gt; as insults, but at the same time they &lt;em&gt;are&lt;/em&gt; kind of insulting, ya&amp;#39; know? They&amp;#39;re basically saying that in order to become more like a human, Data needs to handicap himself. &lt;/p&gt;\n\n&lt;p&gt;EDIT: And then there&amp;#39;s the element of disdain. The whole &amp;quot;I couldn&amp;#39;t really enjoy/appreciate your music because it was &lt;em&gt;too&lt;/em&gt; good.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I mean, really? That&amp;#39;s one hell of a backhanded compliment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4u7v3", "score_hidden": false, "stickied": false, "created": 1491970098.0, "created_utc": 1491941298.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tm7a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "amoeba3", "parent_id": "t3_64t6wl", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "I don't think it's quite fair to consider the crewmembers' comments as insults or condemnations. It was Dana's own initiative that he wanted to become more like a conventional human. Considering that, I think they're more just trying to help him achieve his goal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think it&amp;#39;s quite fair to consider the crewmembers&amp;#39; comments as insults or condemnations. It was Dana&amp;#39;s own initiative that he wanted to become more like a conventional human. Considering that, I think they&amp;#39;re more just trying to help him achieve his goal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4tm7a", "score_hidden": false, "stickied": false, "created": 1491969430.0, "created_utc": 1491940630.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": "", "user_reports": [], "id": "dg4u4tb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sly_Lupin", "parent_id": "t1_dg4t355", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Thanks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4u4tb", "score_hidden": false, "stickied": false, "created": 1491970002.0, "created_utc": 1491941202.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": "", "user_reports": [], "id": "dg51q8k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iamnotsteven", "parent_id": "t1_dg4t355", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Ooo! I just watched that episode the other day! Small world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooo! I just watched that episode the other day! Small world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg51q8k", "score_hidden": false, "stickied": false, "created": 1491979039.0, "created_utc": 1491950239.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4t355", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Derailedone", "parent_id": "t3_64t6wl", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "Its the opening scene from \"The Ensigns of Command\" (TNG 3x02).  Great ep.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its the opening scene from &amp;quot;The Ensigns of Command&amp;quot; (TNG 3x02).  Great ep.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg4t355", "score_hidden": false, "stickied": false, "created": 1491968853.0, "created_utc": 1491940053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": "", "user_reports": [], "id": "dg7wedp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sly_Lupin", "parent_id": "t1_dg5fhds", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "That's even worse. \"Soul\" is a completely and utterly meaningless term, and his \"lack\" of a \"soul\" was one of the primary arguments in the Measure of a Man against his status as a free individual.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s even worse. &amp;quot;Soul&amp;quot; is a completely and utterly meaningless term, and his &amp;quot;lack&amp;quot; of a &amp;quot;soul&amp;quot; was one of the primary arguments in the Measure of a Man against his status as a free individual.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg7wedp", "score_hidden": false, "stickied": false, "created": 1492133543.0, "created_utc": 1492104743.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fhds", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DataThomasWillLore", "parent_id": "t3_64t6wl", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "You're not remembering the episode correctly. Data states that his fellow musicians say that he \"lacks soul.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not remembering the episode correctly. Data states that his fellow musicians say that he &amp;quot;lacks soul.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5fhds", "score_hidden": false, "stickied": false, "created": 1491997732.0, "created_utc": 1491968932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_64t6wl", "likes": null, "replies": "", "user_reports": [], "id": "dg5z6vy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FPSD", "parent_id": "t3_64t6wl", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "He also mentions how his Mum played the same piece identically, but on different occasions in \"Inheritance\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He also mentions how his Mum played the same piece identically, but on different occasions in &amp;quot;Inheritance&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg5z6vy", "score_hidden": false, "stickied": false, "created": 1492037985.0, "created_utc": 1492009185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]