[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "startrek", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a kid I was aware of TOS and had seen clips of the series here and there.  This was usually on entertainment shows since this was way before Youtube.  I remember being at a friend&amp;#39;s house and on ABC sunday night move was TMP .  It was the opening scene where Kirk is getting a glimpse of his old ship made new again.  I didn&amp;#39;t get to watch the whole thing but I remember being wowed by it.  &lt;/p&gt;\n\n&lt;p&gt;My next experience was the Wrath of Khan.  It was awesome to see on the big screen. I was 8 years old and I saw it at the Drive in Movie and I remember being so engrossed with it.  I didn&amp;#39;t see search for Spock in theaters but I did watch it on ABC a couple years after and it was as if there had been no time at all in between.  Times were tough so going to the movies was a rare treat so when TNG came on TV I was ecstatic.  I missed a lot of the first season but by the second season I was watching regularly.  My stepdad wasn&amp;#39;t so keen on Star Trek but let me watch it because it didn&amp;#39;t conflict with anything he wanted to watch.  I believe it ran on a Saturday evening on our local CBS affiliate.  I remember getting the Star Trek Technical manual for the TNG and eventually getting the TOS one as well.  I remember taking a month to convince my mom to get me the Worlds of the Federation book that I still have .  &lt;/p&gt;\n\n&lt;p&gt;DS9 I must admit that I did not watch as much until they started getting into the Dominion plot heavily.  Even then it wasn&amp;#39;t as much fun to me as TNG had been.  Later as an adult I can remember going back and viewing DS9 much more favorably and seeing some episodes as some of the best of Trek.  When I got to college, I rented TOS episodes from the local video store and got to see most of the original series that way.  By then I was making my own money and would buy the movies when I could.  &lt;/p&gt;\n\n&lt;p&gt;Voyager I completely missed out on.  When it came out, I was in college and UPN was not available on the cable packages where I lived.  Later in life I discovered one day that my then mother in law was a Star Trek fan much to the chagrin to the rest of her family. I then found out that the only Trek that she liked was Voyager so for the next couple years whenever we were visiting the family she would always put on videos that she had recorded of her favorite episodes.  A few years later, my Christmas gift to her was a set of DVDs of Voyager.   Even to this day, she tells me that she pops them into the dvd player and watches them.   &lt;/p&gt;\n\n&lt;p&gt;I missed out on Enterprise as well during its first run and only recently have I watched through the series.  I&amp;#39;m really happy for Netflix  because it has given me the opportunity to go back and enjoy it.  I have been skeptical of the news about Discovery but I keep thinking of how I viewed DS9 and Enterprise so I will give it a chance and find a way to watch it.  My next goal is to watch TAS and see how it holds up.   &lt;/p&gt;\n\n&lt;p&gt;I grew up on TNG and consider the Enterprise D a sentimental favorite but my earliest memory is TMP watching the camera pan towards the original Enterprise in all of it&amp;#39;s glory.  The whole sequence of getting the ship ready with the lights coming on left a lingering impression in my mind.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As a kid I was aware of TOS and had seen clips of the series here and there.  This was usually on entertainment shows since this was way before Youtube.  I remember being at a friend's house and on ABC sunday night move was TMP .  It was the opening scene where Kirk is getting a glimpse of his old ship made new again.  I didn't get to watch the whole thing but I remember being wowed by it.  \n\nMy next experience was the Wrath of Khan.  It was awesome to see on the big screen. I was 8 years old and I saw it at the Drive in Movie and I remember being so engrossed with it.  I didn't see search for Spock in theaters but I did watch it on ABC a couple years after and it was as if there had been no time at all in between.  Times were tough so going to the movies was a rare treat so when TNG came on TV I was ecstatic.  I missed a lot of the first season but by the second season I was watching regularly.  My stepdad wasn't so keen on Star Trek but let me watch it because it didn't conflict with anything he wanted to watch.  I believe it ran on a Saturday evening on our local CBS affiliate.  I remember getting the Star Trek Technical manual for the TNG and eventually getting the TOS one as well.  I remember taking a month to convince my mom to get me the Worlds of the Federation book that I still have .  \n\n DS9 I must admit that I did not watch as much until they started getting into the Dominion plot heavily.  Even then it wasn't as much fun to me as TNG had been.  Later as an adult I can remember going back and viewing DS9 much more favorably and seeing some episodes as some of the best of Trek.  When I got to college, I rented TOS episodes from the local video store and got to see most of the original series that way.  By then I was making my own money and would buy the movies when I could.  \n\nVoyager I completely missed out on.  When it came out, I was in college and UPN was not available on the cable packages where I lived.  Later in life I discovered one day that my then mother in law was a Star Trek fan much to the chagrin to the rest of her family. I then found out that the only Trek that she liked was Voyager so for the next couple years whenever we were visiting the family she would always put on videos that she had recorded of her favorite episodes.  A few years later, my Christmas gift to her was a set of DVDs of Voyager.   Even to this day, she tells me that she pops them into the dvd player and watches them.   \n\nI missed out on Enterprise as well during its first run and only recently have I watched through the series.  I'm really happy for Netflix  because it has given me the opportunity to go back and enjoy it.  I have been skeptical of the news about Discovery but I keep thinking of how I viewed DS9 and Enterprise so I will give it a chance and find a way to watch it.  My next goal is to watch TAS and see how it holds up.   \n\nI grew up on TNG and consider the Enterprise D a sentimental favorite but my earliest memory is TMP watching the camera pan towards the original Enterprise in all of it's glory.  The whole sequence of getting the ship ready with the lights coming on left a lingering impression in my mind.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653fvv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "CMS1974", "saved": false, "mod_reports": [], "name": "t3_653fvv", "subreddit_name_prefixed": "r/startrek", "approved_by": null, "over_18": false, "domain": "self.startrek", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qixm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/startrek/comments/653fvv/my_earliest_star_trek_memories/", "num_reports": null, "locked": false, "stickied": false, "created": 1492087554.0, "url": "https://www.reddit.com/r/startrek/comments/653fvv/my_earliest_star_trek_memories/", "author_flair_text": null, "quarantine": false, "title": "My earliest Star Trek memories.", "created_utc": 1492058754.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qixm", "removal_reason": null, "link_id": "t3_653fvv", "likes": null, "replies": "", "user_reports": [], "id": "dg7ob90", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TeasingPigeon", "parent_id": "t3_653fvv", "subreddit_name_prefixed": "r/startrek", "controversiality": 0, "body": "My earliest memories of Star Trek involve my Grandmother. So recorded every episode of TNG. It was a form of babysitting for her to watch it with us. I was maybe 4/5 at the time I could really remember watching it with her. \nWhen I got a little older I remember watching DS9 religiously. I would always say, \"Here comes the snowy rock!\" DS9 will always be my favorite.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My earliest memories of Star Trek involve my Grandmother. So recorded every episode of TNG. It was a form of babysitting for her to watch it with us. I was maybe 4/5 at the time I could really remember watching it with her. \nWhen I got a little older I remember watching DS9 religiously. I would always say, &amp;quot;Here comes the snowy rock!&amp;quot; DS9 will always be my favorite.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startrek", "name": "t1_dg7ob90", "score_hidden": false, "stickied": false, "created": 1492124912.0, "created_utc": 1492096112.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]