[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "running", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h3&gt;Race information&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;What?&lt;/strong&gt; BAA 5K + WGBH 5K&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;When?&lt;/strong&gt; April 15, 2017&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;How far?&lt;/strong&gt; 5k + 5k&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Where?&lt;/strong&gt; Boston, MA&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Website:&lt;/strong&gt; &lt;a href=\"http://www.baa.org/races/5k.asp\"&gt;http://www.baa.org/races/5k.asp&lt;/a&gt; | &lt;a href=\"http://www.wgbh.org/support/5K_faq.cfm\"&gt;http://www.wgbh.org/support/5K_faq.cfm&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Goals&lt;/h3&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th&gt;Goal&lt;/th&gt;\n&lt;th&gt;Description&lt;/th&gt;\n&lt;th&gt;Completed?&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td&gt;A&lt;/td&gt;\n&lt;td&gt;Finish Both&lt;/td&gt;\n&lt;td&gt;&lt;em&gt;Yes&lt;/em&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td&gt;B&lt;/td&gt;\n&lt;td&gt;Have Fun&lt;/td&gt;\n&lt;td&gt;&lt;em&gt;Yes&lt;/em&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n\n&lt;h3&gt;Pictures&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"http://imgur.com/a/hKuoQ\"&gt;On Imgur&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Intro&lt;/h3&gt;\n\n&lt;p&gt;Always make sure to look at your calendar when you sign up for a race. I didn&amp;#39;t and ended up signing up for two back-to-back 5Ks in Boston: the BAA 5k and the WBGH 5K Run for Public Media. I really did these races for the fun of them, although the BAA race is the first in my Distance Medley (with the 10k and 1/2). Unfortunately, the times were revised this week for the BAA run, which made me worry that I might not arrive in time for the WGBH run, but it worked out!&lt;/p&gt;\n\n&lt;h3&gt;Pre-race - BAA&lt;/h3&gt;\n\n&lt;p&gt;The weather was perfect for the run. I arrived at the Boston Common with about 20 minutes to walk around. BAA does a great job in a small space for so many people. Personally, I was impressed that New England Coffee was there handing out coffee, which I passed on. Because I was going to be pressed for time at the tail end, I grabbed my race shirt before the run and threw it in my bag. From beginning to end, bag check was about two minutes and I headed over to the corrals to wait out the time until the run. &lt;/p&gt;\n\n&lt;h3&gt;Kilometers 0 to 5&lt;/h3&gt;\n\n&lt;p&gt;I was familiar with the route from last year&amp;#39;s BAA 10K. It heads out from the Boston Commons to Commonwealth Ave, which is great for its tree-lined and Back Bay townhome feel. I was in the second wave, which crossed the start around 9:40 (the paper start of the race was 9:30). Crossing the start, I was impressed by how many people were out cheering folks on along the whole route. It was pretty uneventful, except there were a few people who self-seeded about 5 corrals too fast. I love that races like this have people all shapes, ages, and paces, but it is annoying trying to dodge people walking in the first half mile. The race heads out the beginning of Kenmore Square and loops back to the starting line along the Boston Marathon route which is super awesome. Following the &amp;quot;last mile stripes&amp;quot;, you get to enjoy the last bit of Comm Ave before taking the famous &amp;quot;right on Hereford, left on Boylston&amp;quot;. After running through the Marathon finish line, you continue a bit to the 5K finish! To be honest, I had a hard time around Mile 2.5 when my asthma kicked in. I didn&amp;#39;t have my inhaler so the last few minutes was really painful. I apologize to any fellow runners I might of frightened with my wheezing. &lt;/p&gt;\n\n&lt;h3&gt;Post-race/Pre-race&lt;/h3&gt;\n\n&lt;p&gt;I had finished faster than expected, but I only had about 45 minutes to grab my stuff and head to Artesani Park in Brighton for the next run. The organizers funnel you through the food and water tent before you get to roam free, which I think is for crowding reasons, and it was really efficient and fast. I then grabbed my bag, which I think they have a special section for Distance Medley runners, which made it even easier. I had to make a port-a-potty stop which was empty (unlike before the race) and tried calling an Uber. As you can imagine, the area around the run was insane, so I walked about 0.25 miles to &lt;a href=\"https://en.wikipedia.org/wiki/Louisburg_Square\"&gt;Louisberg Square&lt;/a&gt;, which is one of the most beautiful places in the city (and where John Kerry lives, I believe). From there, it was a quick dash by car across town for the WGBH run. &lt;/p&gt;\n\n&lt;p&gt;This is only the second annual run for WGBH, the PBS and NPR affiliate in Boston, and the (co-)producers of shows you may enjoy like Masterpiece Theatre (Sherlock and Downton Abbey), Curious George, Antiques Roadshow, Nova, Frontline, etc. Now, let&amp;#39;s also take a moment to remind you to donate to your local PBS or NPR affiliate because their funding comes from viewers and listeners like you, and runners like me. The event was super organized, with a bag check table no less! I gave them all the stuff from the BAA run and grabbed my badge and waited with my friend who was going to run. Since we had some time, I took a picture with Curious George, who I was hoping would also run the race, but alas he did not. &lt;/p&gt;\n\n&lt;p&gt;I ran into a few people who also just come from the BAA run, seeing some with their medals still on, or the new shirts. It was cool to have a contingent running both. &lt;/p&gt;\n\n&lt;h3&gt;Kilometers [0] to [5]&lt;/h3&gt;\n\n&lt;p&gt;The race is basically a path run around part of the Charles River basin. The best part is that at this time of day, a lot of other people were out along the river--kids in the playground, dog walkers, crew teams practicing. Being along the river, the wind picked up which offset the slightly warmer air temperatures. The pace of the run was definitely more relaxed, which was nice. But most notable were the volunteers. At every possible fork along the path was at least one person. Unlike the BAA run, I did grab some water right before the turn back to the finish at the Eliot Bridge, which was perhaps the least scenic part, but with most being along the banks of the River, it was a beautiful, flat and fast run. With only 400 runners, there was also a lot of room, generally speaking, to really enjoy yourself on the run. I was worried about my asthma again, but I think the breeze kept it a little more at bay &lt;/p&gt;\n\n&lt;h3&gt;Post-race&lt;/h3&gt;\n\n&lt;p&gt;Again, their organization was on point. I didn&amp;#39;t see Curious George around, but there were yummy cookies from a local notable bakery, Flour, fruit and water from Whole Foods, and Cabot cheese (who also had amazing Utz chips). My buddy and I finished 4 seconds apart although we didn&amp;#39;t run together, so we hung out for a little bit before heading home. WGBH--you did a fine job with your run!&lt;/p&gt;\n\n&lt;p&gt;All in all, it was a fun day with the two races. I would probably do it again too if they both end up on the same day again. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;This post was generated using &lt;a href=\"https://martellaj.github.io/race-reportr/\"&gt;the new race reportr&lt;/a&gt;, a tool built by &lt;a href=\"https://www.reddit.com/u/bbqlays\"&gt;/u/BBQLays&lt;/a&gt; for making organized, easy-to-read, and beautiful race reports.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "### Race information\n* **What?** BAA 5K + WGBH 5K\n* **When?** April 15, 2017\n* **How far?** 5k + 5k\n* **Where?** Boston, MA\n* **Website:** [http://www.baa.org/races/5k.asp](http://www.baa.org/races/5k.asp) | [http://www.wgbh.org/support/5K_faq.cfm](http://www.wgbh.org/support/5K_faq.cfm)\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Finish Both | *Yes* |\n| B | Have Fun | *Yes* |\n\n### Pictures\n* [On Imgur](http://imgur.com/a/hKuoQ)\n\n### Intro\nAlways make sure to look at your calendar when you sign up for a race. I didn't and ended up signing up for two back-to-back 5Ks in Boston: the BAA 5k and the WBGH 5K Run for Public Media. I really did these races for the fun of them, although the BAA race is the first in my Distance Medley (with the 10k and 1/2). Unfortunately, the times were revised this week for the BAA run, which made me worry that I might not arrive in time for the WGBH run, but it worked out!\n\n### Pre-race - BAA\nThe weather was perfect for the run. I arrived at the Boston Common with about 20 minutes to walk around. BAA does a great job in a small space for so many people. Personally, I was impressed that New England Coffee was there handing out coffee, which I passed on. Because I was going to be pressed for time at the tail end, I grabbed my race shirt before the run and threw it in my bag. From beginning to end, bag check was about two minutes and I headed over to the corrals to wait out the time until the run. \n\n### Kilometers 0 to 5\nI was familiar with the route from last year's BAA 10K. It heads out from the Boston Commons to Commonwealth Ave, which is great for its tree-lined and Back Bay townhome feel. I was in the second wave, which crossed the start around 9:40 (the paper start of the race was 9:30). Crossing the start, I was impressed by how many people were out cheering folks on along the whole route. It was pretty uneventful, except there were a few people who self-seeded about 5 corrals too fast. I love that races like this have people all shapes, ages, and paces, but it is annoying trying to dodge people walking in the first half mile. The race heads out the beginning of Kenmore Square and loops back to the starting line along the Boston Marathon route which is super awesome. Following the \"last mile stripes\", you get to enjoy the last bit of Comm Ave before taking the famous \"right on Hereford, left on Boylston\". After running through the Marathon finish line, you continue a bit to the 5K finish! To be honest, I had a hard time around Mile 2.5 when my asthma kicked in. I didn't have my inhaler so the last few minutes was really painful. I apologize to any fellow runners I might of frightened with my wheezing. \n\n### Post-race/Pre-race\nI had finished faster than expected, but I only had about 45 minutes to grab my stuff and head to Artesani Park in Brighton for the next run. The organizers funnel you through the food and water tent before you get to roam free, which I think is for crowding reasons, and it was really efficient and fast. I then grabbed my bag, which I think they have a special section for Distance Medley runners, which made it even easier. I had to make a port-a-potty stop which was empty (unlike before the race) and tried calling an Uber. As you can imagine, the area around the run was insane, so I walked about 0.25 miles to [Louisberg Square](https://en.wikipedia.org/wiki/Louisburg_Square), which is one of the most beautiful places in the city (and where John Kerry lives, I believe). From there, it was a quick dash by car across town for the WGBH run. \n\nThis is only the second annual run for WGBH, the PBS and NPR affiliate in Boston, and the (co-)producers of shows you may enjoy like Masterpiece Theatre (Sherlock and Downton Abbey), Curious George, Antiques Roadshow, Nova, Frontline, etc. Now, let's also take a moment to remind you to donate to your local PBS or NPR affiliate because their funding comes from viewers and listeners like you, and runners like me. The event was super organized, with a bag check table no less! I gave them all the stuff from the BAA run and grabbed my badge and waited with my friend who was going to run. Since we had some time, I took a picture with Curious George, who I was hoping would also run the race, but alas he did not. \n\nI ran into a few people who also just come from the BAA run, seeing some with their medals still on, or the new shirts. It was cool to have a contingent running both. \n\n### Kilometers [0] to [5]\nThe race is basically a path run around part of the Charles River basin. The best part is that at this time of day, a lot of other people were out along the river--kids in the playground, dog walkers, crew teams practicing. Being along the river, the wind picked up which offset the slightly warmer air temperatures. The pace of the run was definitely more relaxed, which was nice. But most notable were the volunteers. At every possible fork along the path was at least one person. Unlike the BAA run, I did grab some water right before the turn back to the finish at the Eliot Bridge, which was perhaps the least scenic part, but with most being along the banks of the River, it was a beautiful, flat and fast run. With only 400 runners, there was also a lot of room, generally speaking, to really enjoy yourself on the run. I was worried about my asthma again, but I think the breeze kept it a little more at bay \n\n### Post-race\nAgain, their organization was on point. I didn't see Curious George around, but there were yummy cookies from a local notable bakery, Flour, fruit and water from Whole Foods, and Cabot cheese (who also had amazing Utz chips). My buddy and I finished 4 seconds apart although we didn't run together, so we hung out for a little bit before heading home. WGBH--you did a fine job with your run!\n\nAll in all, it was a fun day with the two races. I would probably do it again too if they both end up on the same day again. \n\n\n\n\n*This post was generated using [the new race reportr](https://martellaj.github.io/race-reportr/), a tool built by [/u/BBQLays](https://www.reddit.com/u/bbqlays) for making organized, easy-to-read, and beautiful race reports.*", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Race Report", "id": "65nlip", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "downtownblue", "saved": false, "mod_reports": [], "name": "t3_65nlip", "subreddit_name_prefixed": "r/running", "approved_by": null, "over_18": false, "domain": "self.running", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qlit", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/running/comments/65nlip/race_report_baa_5k_wgbh_5k_back_to_back/", "num_reports": null, "locked": false, "stickied": false, "created": 1492348332.0, "url": "https://www.reddit.com/r/running/comments/65nlip/race_report_baa_5k_wgbh_5k_back_to_back/", "author_flair_text": null, "quarantine": false, "title": "[Race Report] BAA 5K + WGBH 5K -- Back to Back", "created_utc": 1492319532.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": "", "user_reports": [], "id": "dgcdo2u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "downtownblue", "parent_id": "t1_dgbzdic", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "&gt; I don't think many of the people comprehend their impact. \n\nAgree. I think the 5K attracts a lot of first timers, which is fantastic, but it does hinder the experience. The runDisney runs publish a simple \"Rules of the Road\" one-pager, which I think BAA could include. Among the items listed were to not run as a group shoulder to shoulder (which probably irritates me the most), to stay to the side if you're slower, and if you're slower, hang to the back. \n\nI also agree that when the corrals started shifting to the start, mayhem ensued with the self-seeding. I did not appreciate seeing some very obviously slow participants pushing up toward the 6-minute miler group. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t think many of the people comprehend their impact. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agree. I think the 5K attracts a lot of first timers, which is fantastic, but it does hinder the experience. The runDisney runs publish a simple &amp;quot;Rules of the Road&amp;quot; one-pager, which I think BAA could include. Among the items listed were to not run as a group shoulder to shoulder (which probably irritates me the most), to stay to the side if you&amp;#39;re slower, and if you&amp;#39;re slower, hang to the back. &lt;/p&gt;\n\n&lt;p&gt;I also agree that when the corrals started shifting to the start, mayhem ensued with the self-seeding. I did not appreciate seeing some very obviously slow participants pushing up toward the 6-minute miler group. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgcdo2u", "score_hidden": false, "stickied": false, "created": 1492396299.0, "created_utc": 1492367499.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzdic", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jayast", "parent_id": "t1_dgbyrli", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I don't think many of the people comprehend their impact. There were at least a few people I heard say something to the effect of \"well everyone can just go around me.\" The self-seeding appeared to get worse when the corrals started moving towards the start line. People on the outside started to panic a bit and began to just hop in wherever they could, even moving fencing to make openings.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think many of the people comprehend their impact. There were at least a few people I heard say something to the effect of &amp;quot;well everyone can just go around me.&amp;quot; The self-seeding appeared to get worse when the corrals started moving towards the start line. People on the outside started to panic a bit and began to just hop in wherever they could, even moving fencing to make openings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgbzdic", "score_hidden": false, "stickied": false, "created": 1492374945.0, "created_utc": 1492346145.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": "", "user_reports": [], "id": "dgdhhxw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "schmiddy0", "parent_id": "t1_dgdcfio", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I self-seeded myself into wave 2 (6:xx pace). People definitely self-seeded themselves into the wave ahead of me (5:xx pace). I suspect they segregate the elite corral from the rest of the wave 1 masses at least a little bit, but the self-seeded wave 1 folks seem to go out within a few seconds or so of the elites based on the gun time / net time results.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I self-seeded myself into wave 2 (6:xx pace). People definitely self-seeded themselves into the wave ahead of me (5:xx pace). I suspect they segregate the elite corral from the rest of the wave 1 masses at least a little bit, but the self-seeded wave 1 folks seem to go out within a few seconds or so of the elites based on the gun time / net time results.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdhhxw", "score_hidden": false, "stickied": false, "created": 1492465175.0, "created_utc": 1492436375.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcfio", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TomOwens", "parent_id": "t1_dgd2e44", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "They don't control wave 1? I thought wave 1 were pros only (the people with names on their bibs) and wave 2 was the start of everyone else. I've always properly seeded myself, so I never saw who was in wave 1.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They don&amp;#39;t control wave 1? I thought wave 1 were pros only (the people with names on their bibs) and wave 2 was the start of everyone else. I&amp;#39;ve always properly seeded myself, so I never saw who was in wave 1.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdcfio", "score_hidden": false, "stickied": false, "created": 1492454362.0, "created_utc": 1492425562.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": "", "user_reports": [], "id": "dgdhjwl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "schmiddy0", "parent_id": "t1_dgdcq1c", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "Yeah Bolder Boulder is exactly what I was thinking of. I was injured last year and didn't get a chance to run it but was very impressed with their setup and reviews of the race I read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah Bolder Boulder is exactly what I was thinking of. I was injured last year and didn&amp;#39;t get a chance to run it but was very impressed with their setup and reviews of the race I read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdhjwl", "score_hidden": false, "stickied": false, "created": 1492465262.0, "created_utc": 1492436462.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": "", "user_reports": [], "id": "dgeahad", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jayast", "parent_id": "t1_dgdhqdg", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "Correct me if I'm wrong, it's been a few years since I lived there. You have the option of putting in a previous race time and you will be seeded based on that. There are a lot of waves that go off in fairly rapid succession ~1-2 min differences. You are only allowed in the corral that you bib is for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Correct me if I&amp;#39;m wrong, it&amp;#39;s been a few years since I lived there. You have the option of putting in a previous race time and you will be seeded based on that. There are a lot of waves that go off in fairly rapid succession ~1-2 min differences. You are only allowed in the corral that you bib is for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgeahad", "score_hidden": false, "stickied": false, "created": 1492499585.0, "created_utc": 1492470785.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhqdg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TomOwens", "parent_id": "t1_dgdcq1c", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "How does Boulder Boulder do their waves?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does Boulder Boulder do their waves?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdhqdg", "score_hidden": false, "stickied": false, "created": 1492465535.0, "created_utc": 1492436735.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcq1c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jayast", "parent_id": "t1_dgd2e44", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "It would be nice to see an approach similar to how the Bolder Boulder does their waves. It's a much larger race, but almost no chaos. Probably would require more effort from the B.A.A. to make that happen....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would be nice to see an approach similar to how the Bolder Boulder does their waves. It&amp;#39;s a much larger race, but almost no chaos. Probably would require more effort from the B.A.A. to make that happen....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdcq1c", "score_hidden": false, "stickied": false, "created": 1492455255.0, "created_utc": 1492426455.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2e44", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "schmiddy0", "parent_id": "t1_dgbyrli", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "The BAA needs to enforce pre-assigned starting corrals. The number of idiots who self-seeded themselves in corral #1, i.e. trying to go off right next to Ben True, and proceed to walk or jog at 10 minute pace was ridiculous. There were 8900 finishers, the race has gotten big enough that self-seeding just doesn't cut it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The BAA needs to enforce pre-assigned starting corrals. The number of idiots who self-seeded themselves in corral #1, i.e. trying to go off right next to Ben True, and proceed to walk or jog at 10 minute pace was ridiculous. There were 8900 finishers, the race has gotten big enough that self-seeding just doesn&amp;#39;t cut it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgd2e44", "score_hidden": false, "stickied": false, "created": 1492429629.0, "created_utc": 1492400829.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbyrli", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TomOwens", "parent_id": "t1_dgbykl0", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I have no problems with people walking a 5k (I don't know if the BAA prohibits it or not), but they really do need to self-seed at the end. I think it's an inherent problem in self-seeding. I honestly wonder if these people don't understand the impact of their behavior on other runners. I'm no pro, but I'd like a good measure of my performance. Being slowed down by people doesn't help me get what I want from the race.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have no problems with people walking a 5k (I don&amp;#39;t know if the BAA prohibits it or not), but they really do need to self-seed at the end. I think it&amp;#39;s an inherent problem in self-seeding. I honestly wonder if these people don&amp;#39;t understand the impact of their behavior on other runners. I&amp;#39;m no pro, but I&amp;#39;d like a good measure of my performance. Being slowed down by people doesn&amp;#39;t help me get what I want from the race.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgbyrli", "score_hidden": false, "stickied": false, "created": 1492373428.0, "created_utc": 1492344628.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbykl0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hclynn10", "parent_id": "t1_dgbwvb3", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I agree. I was expecting to PR based on my training lately but couldn't get past the walkers, selfie takers, and people who seeded themselves incorrectly. I ended up adding about one minute to my expected time!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. I was expecting to PR based on my training lately but couldn&amp;#39;t get past the walkers, selfie takers, and people who seeded themselves incorrectly. I ended up adding about one minute to my expected time!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgbykl0", "score_hidden": false, "stickied": false, "created": 1492372905.0, "created_utc": 1492344105.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbwvb3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TomOwens", "parent_id": "t3_65nlip", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "&gt; but it is annoying trying to dodge people walking in the first half mile\n\nYou got lucky, I was dodging walkers for almost a mile. Even under Mass Ave (which is, what, 1 1/2 miles in?), there were plenty of people who weren't respectful of other runners - walking three wide, causing bottlenecks of people trying to go around them. Between dodging walkers, getting stuck in a pack of joggers, and having half a dozen people (including a few dragging kids) trying to cross the street, and almost getting hit by some guy on rollerblades, my time took a huge hit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but it is annoying trying to dodge people walking in the first half mile&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You got lucky, I was dodging walkers for almost a mile. Even under Mass Ave (which is, what, 1 1/2 miles in?), there were plenty of people who weren&amp;#39;t respectful of other runners - walking three wide, causing bottlenecks of people trying to go around them. Between dodging walkers, getting stuck in a pack of joggers, and having half a dozen people (including a few dragging kids) trying to cross the street, and almost getting hit by some guy on rollerblades, my time took a huge hit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgbwvb3", "score_hidden": false, "stickied": false, "created": 1492367676.0, "created_utc": 1492338876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": "", "user_reports": [], "id": "dgdcu5v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jayast", "parent_id": "t3_65nlip", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I like the second picture you posted. It captures the back of my head beautifully.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like the second picture you posted. It captures the back of my head beautifully.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdcu5v", "score_hidden": false, "stickied": false, "created": 1492455593.0, "created_utc": 1492426793.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65nlip", "likes": null, "replies": "", "user_reports": [], "id": "dgdcif6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TomOwens", "parent_id": "t1_dgcql0z", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "Yeah. Big Bird seeded himself ahead of me. I passed him on Comm Ave. Don't remember where. I think it was kind of close to the turn around. It was quite clear he wasn't running a 9 minute mile or better.\n\nThe Easter Bunny seeded himself behind me. He was doing quite well at the beginning, catching up and pacing me until I got caught up in a slow crowd on the left, but I think his costume took a toll and he fell off pace. He finished after I had gone through the gates at the end and got (and ate most of) my King's Hawaiian rolls and water.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. Big Bird seeded himself ahead of me. I passed him on Comm Ave. Don&amp;#39;t remember where. I think it was kind of close to the turn around. It was quite clear he wasn&amp;#39;t running a 9 minute mile or better.&lt;/p&gt;\n\n&lt;p&gt;The Easter Bunny seeded himself behind me. He was doing quite well at the beginning, catching up and pacing me until I got caught up in a slow crowd on the left, but I think his costume took a toll and he fell off pace. He finished after I had gone through the gates at the end and got (and ate most of) my King&amp;#39;s Hawaiian rolls and water.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdcif6", "score_hidden": false, "stickied": false, "created": 1492454612.0, "created_utc": 1492425812.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcql0z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeeJane338", "parent_id": "t3_65nlip", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "Did you see the guy running dressed as Big Bird? Funny, but created a pretty serious logjam if you were behind him...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you see the guy running dressed as Big Bird? Funny, but created a pretty serious logjam if you were behind him...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgcql0z", "score_hidden": false, "stickied": false, "created": 1492413422.0, "created_utc": 1492384622.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]