[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "running", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h3&gt;Race information&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;What?&lt;/strong&gt; Hot Springs Trail Runs 18 miler&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;When?&lt;/strong&gt; April 15, 2017&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;How far?&lt;/strong&gt; 18 miles&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Where?&lt;/strong&gt; McKenzie Bridge, OR&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Website:&lt;/strong&gt; &lt;a href=\"http://www.pinkbuffaloracing.com/hstr.html\"&gt;http://www.pinkbuffaloracing.com/hstr.html&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Goals&lt;/h3&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th&gt;Goal&lt;/th&gt;\n&lt;th&gt;Description&lt;/th&gt;\n&lt;th&gt;Completed?&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td&gt;A&lt;/td&gt;\n&lt;td&gt;Finish.&lt;/td&gt;\n&lt;td&gt;&lt;em&gt;Yes&lt;/em&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td&gt;B&lt;/td&gt;\n&lt;td&gt;Don&amp;#39;t injure myself&lt;/td&gt;\n&lt;td&gt;&lt;em&gt;Yes&lt;/em&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n\n&lt;h3&gt;Pictures&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"http://imgur.com/a/xcvpD\"&gt;Here are a few pictures from the race&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Training&lt;/h3&gt;\n\n&lt;p&gt;I ran 4 days a week with weekly long runs, usually on Sundays. I did a 25k back in February, so I knew an 18 miler was an attainable goal. At the beginning of March, my long runs were hovering around 12 miles, give or take a bit, and I started to slowly increase my long runs every week. Two weeks before this race, I ran 16 miles, including about 1200 feet of elevation gain, mostly on trail, then tapered for the past 2 weeks. 18 miles is the longest I&amp;#39;ve ever run, so I honestly just wanted to finish. I am trying to be less afraid of signing up for a full marathon, so I like finding races between the half and full distance to work my way up.&lt;/p&gt;\n\n&lt;h3&gt;Miles 0 to 5: don&amp;#39;t go too fast, don&amp;#39;t faceplant. Also watch out for that hundred-foot drop on the left.&lt;/h3&gt;\n\n&lt;p&gt;The race started at 9 am, and it was pretty chilly, but no snow on the course! We&amp;#39;ve had a ton of snow and ice this year, so they actually had to reroute the course due to too much leftover snow. The race was fairly small (I think the cap it at 100 people), and I fell somewhere in the middle of everyone. The entire course is single track, so it felt like I was going pretty slow the first few miles since much of it was spent being stuck behind other runners. That was fine in my book, because I was NOT going for time here. It was a little stressful being passed on such narrow trail, and a lot of times, there would be a huge drop-off to my left. Yikes. Lots of rocks, roots, etc. to watch out for, so although it was ridiculously beautiful, I was looking at the ground most of the time. It felt like an easy, slow pace, and I was averaging about 11:40s or so. Super slow, but fine in my book.&lt;/p&gt;\n\n&lt;h3&gt;Miles 5 to 10: so many other humans on a skinny little trail. Such slow, very mud.&lt;/h3&gt;\n\n&lt;p&gt;Mile 5 we crossed a road where the 5-milers started. After crossing the road, I ended up at the back of the pack of the 5-milers, and ended up passing a lot of people. I was super grateful to them, because when I called out that I was passing, everyone immediately pulled off the course, and they called out to other 5 miler runners that there was an 18-mile runner coming up behind. Yay for trail etiquette!\nMile 8 came up, and I had the realization that I still had 10 miles left to go. I tried to break up the race into smaller chunks mentally, and tried to focus on feeling out my &amp;quot;comfy&amp;quot; pace instead of being intimidated by the immense challenges ahead of me. Everything was muddy, and people kept slowing down to dodge mud and water. Personally, when it comes to puddles, I run through the first one, get my feet wet, and then stop worrying about dodging puddles. I think running around water is actually more exhausting. It&amp;#39;s going to happen anyway, might as well get it over with as soon as possible. \nAt mile 10, we hit the road near the finish line, and my awesome boyfriend was there to cheer me on, take pictures, etc. Seeing him definitely gave me a good morale boost to finish the next several miles! I was leading a nice little pack of other runners, who were all super friendly.&lt;/p&gt;\n\n&lt;h3&gt;Miles 11 to 14: ate shit, but stood up and continued along.&lt;/h3&gt;\n\n&lt;p&gt;Around mile 10.5, runners who were finishing the course came back the opposite direction, and everyone cheered each other on. The runner who was clearly winning the race was absolutely CRUSHING it, so that was really cool to see. At some point, part of my shoe caught a rock, and I went down hard. My fall made an impressive echo on the forest floor, and I heard someone in the distance ask if I was ok. I dusted myself off, wasn&amp;#39;t injured, and kept going. Didn&amp;#39;t even break the skin! As I reached the turnaround point, I was a little disheartened to see that it was at the top of a hill. This was the part of the course where my training really paid off; as other runners stopped to walk, I was able to slowly chug up the hills without too much effort. My body was absolutely exhausted, but cardio-wise I was good to go.&lt;/p&gt;\n\n&lt;h3&gt;Miles 15 to 18: the highest highs, and the lowest lows&lt;/h3&gt;\n\n&lt;p&gt;Around mile 14.5, I hit the weirdest runner&amp;#39;s high of my life. I know I had a shit-eating grin on for a few miles, and I literally felt so happy I could cry. I think I was just focused on how far I&amp;#39;ve come; I could barely run 3 miles two years ago, and I definitely couldn&amp;#39;t do anything on trail without twisting my ankles. It also helped that my playlist was absolutely killing it, so I was having a great time! Then mile 17 happened, and I sort of fell apart. There was a pretty significant incline that seemed to go on forever, and even though it wasn&amp;#39;t that steep, my legs tightened up, and it took so much effort to keep going. I did stop to walk for about 15 seconds or so, but I started running again as soon as I hit the top of the hill. Eventually, I saw several cars, and I knew I was quickly approaching the end. We turned onto a paved road leading to the finish at the hot springs lodge. I turned a corner, saw the finish sign, and pushed through for a finish time of 3:36:28. This was by far the slowest I&amp;#39;ve ever run (typically closer to a 9:00 pace on flat pavement, 10:00 pace on hilly courses), but I did not care. There were a ton of people cheering my name at the finish (they announce it over the speaker as you finish), and I definitely shed some tears after I crossed the line. I couldn&amp;#39;t believe I had actually finished such a challenging course, and I really couldn&amp;#39;t believe that I was able to run for such a long period of time. I finished 68/100, and placed first in my age group by default (lulz). I was also the youngest person in the whole race. I felt super happy to not be running anymore, and was glad the race was behind me so that I could stop stressing out about it.&lt;/p&gt;\n\n&lt;h3&gt;Post-race&lt;/h3&gt;\n\n&lt;p&gt;They had some local craft beer at the end (because Oregon), and we got an hour-long soak in the hot springs after! Running, trails, beer, and hot springs are some of my favorite things in the world. It was a great way to end the course! I went home, ate a burger, and went to bed at 8 pm. I can&amp;#39;t wait to do the race again next year. It was beautifully executed, and I would heartily recommend it to everyone. Now, I&amp;#39;m going to try to decide which marathon to set me sights on next. :)&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;This post was generated using &lt;a href=\"https://martellaj.github.io/race-reportr/\"&gt;the new race reportr&lt;/a&gt;, a tool built by &lt;a href=\"https://www.reddit.com/u/bbqlays\"&gt;/u/BBQLays&lt;/a&gt; for making organized, easy-to-read, and beautiful race reports.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "### Race information\n* **What?** Hot Springs Trail Runs 18 miler\n* **When?** April 15, 2017\n* **How far?** 18 miles\n* **Where?** McKenzie Bridge, OR\n* **Website:** [http://www.pinkbuffaloracing.com/hstr.html](http://www.pinkbuffaloracing.com/hstr.html)\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Finish. | *Yes* |\n| B | Don't injure myself | *Yes* |\n\n### Pictures\n* [Here are a few pictures from the race](http://imgur.com/a/xcvpD)\n\n\n### Training\nI ran 4 days a week with weekly long runs, usually on Sundays. I did a 25k back in February, so I knew an 18 miler was an attainable goal. At the beginning of March, my long runs were hovering around 12 miles, give or take a bit, and I started to slowly increase my long runs every week. Two weeks before this race, I ran 16 miles, including about 1200 feet of elevation gain, mostly on trail, then tapered for the past 2 weeks. 18 miles is the longest I've ever run, so I honestly just wanted to finish. I am trying to be less afraid of signing up for a full marathon, so I like finding races between the half and full distance to work my way up.\n\n### Miles 0 to 5: don't go too fast, don't faceplant. Also watch out for that hundred-foot drop on the left.\n\nThe race started at 9 am, and it was pretty chilly, but no snow on the course! We've had a ton of snow and ice this year, so they actually had to reroute the course due to too much leftover snow. The race was fairly small (I think the cap it at 100 people), and I fell somewhere in the middle of everyone. The entire course is single track, so it felt like I was going pretty slow the first few miles since much of it was spent being stuck behind other runners. That was fine in my book, because I was NOT going for time here. It was a little stressful being passed on such narrow trail, and a lot of times, there would be a huge drop-off to my left. Yikes. Lots of rocks, roots, etc. to watch out for, so although it was ridiculously beautiful, I was looking at the ground most of the time. It felt like an easy, slow pace, and I was averaging about 11:40s or so. Super slow, but fine in my book.\n \n### Miles 5 to 10: so many other humans on a skinny little trail. Such slow, very mud.\n\nMile 5 we crossed a road where the 5-milers started. After crossing the road, I ended up at the back of the pack of the 5-milers, and ended up passing a lot of people. I was super grateful to them, because when I called out that I was passing, everyone immediately pulled off the course, and they called out to other 5 miler runners that there was an 18-mile runner coming up behind. Yay for trail etiquette!\nMile 8 came up, and I had the realization that I still had 10 miles left to go. I tried to break up the race into smaller chunks mentally, and tried to focus on feeling out my \"comfy\" pace instead of being intimidated by the immense challenges ahead of me. Everything was muddy, and people kept slowing down to dodge mud and water. Personally, when it comes to puddles, I run through the first one, get my feet wet, and then stop worrying about dodging puddles. I think running around water is actually more exhausting. It's going to happen anyway, might as well get it over with as soon as possible. \nAt mile 10, we hit the road near the finish line, and my awesome boyfriend was there to cheer me on, take pictures, etc. Seeing him definitely gave me a good morale boost to finish the next several miles! I was leading a nice little pack of other runners, who were all super friendly.\n\n### Miles 11 to 14: ate shit, but stood up and continued along.\n\nAround mile 10.5, runners who were finishing the course came back the opposite direction, and everyone cheered each other on. The runner who was clearly winning the race was absolutely CRUSHING it, so that was really cool to see. At some point, part of my shoe caught a rock, and I went down hard. My fall made an impressive echo on the forest floor, and I heard someone in the distance ask if I was ok. I dusted myself off, wasn't injured, and kept going. Didn't even break the skin! As I reached the turnaround point, I was a little disheartened to see that it was at the top of a hill. This was the part of the course where my training really paid off; as other runners stopped to walk, I was able to slowly chug up the hills without too much effort. My body was absolutely exhausted, but cardio-wise I was good to go.\n\n### Miles 15 to 18: the highest highs, and the lowest lows\n\nAround mile 14.5, I hit the weirdest runner's high of my life. I know I had a shit-eating grin on for a few miles, and I literally felt so happy I could cry. I think I was just focused on how far I've come; I could barely run 3 miles two years ago, and I definitely couldn't do anything on trail without twisting my ankles. It also helped that my playlist was absolutely killing it, so I was having a great time! Then mile 17 happened, and I sort of fell apart. There was a pretty significant incline that seemed to go on forever, and even though it wasn't that steep, my legs tightened up, and it took so much effort to keep going. I did stop to walk for about 15 seconds or so, but I started running again as soon as I hit the top of the hill. Eventually, I saw several cars, and I knew I was quickly approaching the end. We turned onto a paved road leading to the finish at the hot springs lodge. I turned a corner, saw the finish sign, and pushed through for a finish time of 3:36:28. This was by far the slowest I've ever run (typically closer to a 9:00 pace on flat pavement, 10:00 pace on hilly courses), but I did not care. There were a ton of people cheering my name at the finish (they announce it over the speaker as you finish), and I definitely shed some tears after I crossed the line. I couldn't believe I had actually finished such a challenging course, and I really couldn't believe that I was able to run for such a long period of time. I finished 68/100, and placed first in my age group by default (lulz). I was also the youngest person in the whole race. I felt super happy to not be running anymore, and was glad the race was behind me so that I could stop stressing out about it.\n\n### Post-race\n\nThey had some local craft beer at the end (because Oregon), and we got an hour-long soak in the hot springs after! Running, trails, beer, and hot springs are some of my favorite things in the world. It was a great way to end the course! I went home, ate a burger, and went to bed at 8 pm. I can't wait to do the race again next year. It was beautifully executed, and I would heartily recommend it to everyone. Now, I'm going to try to decide which marathon to set me sights on next. :)\n\n*This post was generated using [the new race reportr](https://martellaj.github.io/race-reportr/), a tool built by [/u/BBQLays](https://www.reddit.com/u/bbqlays) for making organized, easy-to-read, and beautiful race reports.*", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Race Report", "id": "65rml0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "asanabanana", "saved": false, "mod_reports": [], "name": "t3_65rml0", "subreddit_name_prefixed": "r/running", "approved_by": null, "over_18": false, "domain": "self.running", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qlit", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/running/comments/65rml0/race_reporthot_springs_trail_runs_18_miler/", "num_reports": null, "locked": false, "stickied": false, "created": 1492408055.0, "url": "https://www.reddit.com/r/running/comments/65rml0/race_reporthot_springs_trail_runs_18_miler/", "author_flair_text": null, "quarantine": false, "title": "[Race Report]Hot Springs Trail Runs 18 miler", "created_utc": 1492379255.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65rml0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65rml0", "likes": null, "replies": "", "user_reports": [], "id": "dgctpwh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "asanabanana", "parent_id": "t1_dgcrqwd", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I can't decide!! I'm doing the Eugene half this year, but am sort of wishing I had done the full. I'm thinking possibly Portland marathon in October, but I almost don't want to wait that long. That could be a great first full though. Suggestions are welcome!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t decide!! I&amp;#39;m doing the Eugene half this year, but am sort of wishing I had done the full. I&amp;#39;m thinking possibly Portland marathon in October, but I almost don&amp;#39;t want to wait that long. That could be a great first full though. Suggestions are welcome!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgctpwh", "score_hidden": false, "stickied": false, "created": 1492417660.0, "created_utc": 1492388860.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrqwd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rake_the_great", "parent_id": "t3_65rml0", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I was just thinking the other day how lovely it would be to have a hot springs after a run. You killed it! Especially because trail runs are more challenging than paved.\n\nAny ideas for your first marathon?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was just thinking the other day how lovely it would be to have a hot springs after a run. You killed it! Especially because trail runs are more challenging than paved.&lt;/p&gt;\n\n&lt;p&gt;Any ideas for your first marathon?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgcrqwd", "score_hidden": false, "stickied": false, "created": 1492414985.0, "created_utc": 1492386185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]