[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "running", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A new round is about to start at &lt;a href=\"/r/90DaysGoal\"&gt;/r/90DaysGoal&lt;/a&gt;, and we would love for you to come join us! &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What 90days is and what it isn’t&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;90daysgoal is a community that is all about self-improvement and support. Whether you want to change a lot or a little, gain muscle or lose weight, learn skills or break habits, or work on things that aren&amp;#39;t necessarily related to fitness (school, work, hobbies, friendships/family/relationships), everyone is welcome! &lt;/p&gt;\n\n&lt;p&gt;More than anything else, this group will provide you with a place to talk to other people about health, fitness, and general self-improvement in a completely open and friendly environment.  The support of others going through similar struggles is one of the things that makes 90DG so special: this is a group of people working together to better themselves. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Goals&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Our goal is to help you tackle big things, one day at a time. While it’s tempting to want to change many things at once, there&amp;#39;s always a lot on our plates. If we bite off more than we can chew, it can be easy to be overwhelmed and give up. But, when you break a big goal down into small goals that you can check off daily or weekly, it doesn’t seem so intimidating.&lt;/p&gt;\n\n&lt;p&gt;So, what do you want to accomplish in the next 90 days?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What’s the format?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Every day the mods post a Daily Goal thread where you can post your goals for the day, ask questions, or read through other people’s updates. There&amp;#39;s a weekly check-in thread every Monday and several themed posts throughout the week to keep us all on track. At the end of every 30 days, we take a few days off to set new goals for the next 30 days and then dive back in.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;d like to join us for the next round, stop by and tell us about yourself and your goals in the &lt;a href=\"https://www.reddit.com/r/90daysgoal/comments/65uuv6/mod_official_round_23_introduction_post/\"&gt;official introduction thread&lt;/a&gt;. Round 23 will officially begin on Monday, April 24th. On Day 1 there will be a signup form to fill out so that we can keep track of group statistics.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; If you’re interested in changing or growing with us, subscribe to &lt;a href=\"/r/90daysgoal\"&gt;/r/90daysgoal&lt;/a&gt;. Day 1 is April 24th and the final day will be August 1st. There will be informational posts throughout the first couple weeks to get everyone started toward their goals. We&amp;#39;ll have a progress/recovery week at the end of each month. Feel free to look at the recent daily goal threads and last round’s introduction thread if you’d like an idea of what to expect. Feel free to ask any and all questions here!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A new round is about to start at /r/90DaysGoal, and we would love for you to come join us! \n\n**What 90days is and what it isn’t**\n\n90daysgoal is a community that is all about self-improvement and support. Whether you want to change a lot or a little, gain muscle or lose weight, learn skills or break habits, or work on things that aren't necessarily related to fitness (school, work, hobbies, friendships/family/relationships), everyone is welcome! \n\nMore than anything else, this group will provide you with a place to talk to other people about health, fitness, and general self-improvement in a completely open and friendly environment.  The support of others going through similar struggles is one of the things that makes 90DG so special: this is a group of people working together to better themselves. \n\n**Goals**\n\nOur goal is to help you tackle big things, one day at a time. While it’s tempting to want to change many things at once, there's always a lot on our plates. If we bite off more than we can chew, it can be easy to be overwhelmed and give up. But, when you break a big goal down into small goals that you can check off daily or weekly, it doesn’t seem so intimidating.\n\nSo, what do you want to accomplish in the next 90 days?\n\n**What’s the format?**\n\nEvery day the mods post a Daily Goal thread where you can post your goals for the day, ask questions, or read through other people’s updates. There's a weekly check-in thread every Monday and several themed posts throughout the week to keep us all on track. At the end of every 30 days, we take a few days off to set new goals for the next 30 days and then dive back in.\n\nIf you'd like to join us for the next round, stop by and tell us about yourself and your goals in the [official introduction thread](https://www.reddit.com/r/90daysgoal/comments/65uuv6/mod_official_round_23_introduction_post/). Round 23 will officially begin on Monday, April 24th. On Day 1 there will be a signup form to fill out so that we can keep track of group statistics.\n\n**TL;DR:** If you’re interested in changing or growing with us, subscribe to /r/90daysgoal. Day 1 is April 24th and the final day will be August 1st. There will be informational posts throughout the first couple weeks to get everyone started toward their goals. We'll have a progress/recovery week at the end of each month. Feel free to look at the recent daily goal threads and last round’s introduction thread if you’d like an idea of what to expect. Feel free to ask any and all questions here!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Misc", "id": "65x2jl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "goosiegirl", "saved": false, "mod_reports": [], "name": "t3_65x2jl", "subreddit_name_prefixed": "r/running", "approved_by": null, "over_18": false, "domain": "self.running", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qlit", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/running/comments/65x2jl/new_round_beginning_at_90daysgoal/", "num_reports": null, "locked": false, "stickied": false, "created": 1492479709.0, "url": "https://www.reddit.com/r/running/comments/65x2jl/new_round_beginning_at_90daysgoal/", "author_flair_text": null, "quarantine": false, "title": "New Round Beginning at 90daysgoal!", "created_utc": 1492450909.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65x2jl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qlit", "removal_reason": null, "link_id": "t3_65x2jl", "likes": null, "replies": "", "user_reports": [], "id": "dgdzhur", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "goosiegirl", "parent_id": "t1_dgdygxc", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "I'm not sure about the science behind it, but I think it's commonly said that it takes three weeks to build a habit. As many participants are looking to create or improve habits, four weeks makes a great start for that. We found that the 90 days broken into 30 day sprints makes it more manageable but still allows time for noticeable change. I think one of the best aspects is the community. You gain a bit of accountability by posting in the threads, can seek advice from others when you hit a roadblock, and find others who are going after similar goals. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure about the science behind it, but I think it&amp;#39;s commonly said that it takes three weeks to build a habit. As many participants are looking to create or improve habits, four weeks makes a great start for that. We found that the 90 days broken into 30 day sprints makes it more manageable but still allows time for noticeable change. I think one of the best aspects is the community. You gain a bit of accountability by posting in the threads, can seek advice from others when you hit a roadblock, and find others who are going after similar goals. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdzhur", "score_hidden": false, "stickied": false, "created": 1492486418.0, "created_utc": 1492457618.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdygxc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dogebiscuit", "parent_id": "t3_65x2jl", "subreddit_name_prefixed": "r/running", "controversiality": 0, "body": "Hey, this subreddit sounds awesome! Thanks for sharing. I'll check it out and see about becoming a part of the community. \n\nIs this based on the science that it takes a certain amount of time for a habit, behavior, or mindset to become cemented in the brain? I think it was neuroscientist Carolina Leaf who is huge on this concept. (fun &amp; inspirational watch: https://www.youtube.com/watch?v=yjhANyrKpv8)\n\nWhen you set out to create a goal and have scientific proof to back it up, that creates a lot of hope. Hope, in this instance, is confidence and sureness that your efforts *will* pay off and produce benefits. It creates a powerful forward momentum. That's why placebos work, because people believe it's going to help them. This belief  literally rewires their reality, creating what they hope for to be true for themselves.\n\nHope seems harder to get as you age. As a child, life comes at you. You're new in the world; there are so many things to do, places to explore, and so much fun to have. But after a certain age, life stops coming at you, and you have to work harder for things. You lose hope.\n\nSomeone without hope has nothing to set his/her mind on. When there's no anchor, negativity spreads quite easily. Someone without hope may become angry or bitter. They may settle for less or turn to escapisms (another fun watch: https://www.ted.com/talks/brene_brown_on_vulnerability)\n\nComing back around - setting a positive goal and knowing that your efforts will pay off will give you something to look forward to; it will create a positive momentum. This is coming from my own personal experience from the past few months. I've been under more stress than... well, as long as I can recall. It's becoming obvious that I have few good things to look forward to. Obviously, this is a lie. There are so many things, but I have to intentionally set my mind on them.\n\nMy striving to become a competitive runner is based on this hope. Running is just one aspect. I'm assessing all aspects of my life and finding other things to set my mind on.\n\nSorry if this is scattered. I had this whole thing written out and my computer crashed so I had to start over, salvaging all of the thoughts. Anyway, I hope this helps anyone who reads it. Feel free to ask questions :-)\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, this subreddit sounds awesome! Thanks for sharing. I&amp;#39;ll check it out and see about becoming a part of the community. &lt;/p&gt;\n\n&lt;p&gt;Is this based on the science that it takes a certain amount of time for a habit, behavior, or mindset to become cemented in the brain? I think it was neuroscientist Carolina Leaf who is huge on this concept. (fun &amp;amp; inspirational watch: &lt;a href=\"https://www.youtube.com/watch?v=yjhANyrKpv8\"&gt;https://www.youtube.com/watch?v=yjhANyrKpv8&lt;/a&gt;)&lt;/p&gt;\n\n&lt;p&gt;When you set out to create a goal and have scientific proof to back it up, that creates a lot of hope. Hope, in this instance, is confidence and sureness that your efforts &lt;em&gt;will&lt;/em&gt; pay off and produce benefits. It creates a powerful forward momentum. That&amp;#39;s why placebos work, because people believe it&amp;#39;s going to help them. This belief  literally rewires their reality, creating what they hope for to be true for themselves.&lt;/p&gt;\n\n&lt;p&gt;Hope seems harder to get as you age. As a child, life comes at you. You&amp;#39;re new in the world; there are so many things to do, places to explore, and so much fun to have. But after a certain age, life stops coming at you, and you have to work harder for things. You lose hope.&lt;/p&gt;\n\n&lt;p&gt;Someone without hope has nothing to set his/her mind on. When there&amp;#39;s no anchor, negativity spreads quite easily. Someone without hope may become angry or bitter. They may settle for less or turn to escapisms (another fun watch: &lt;a href=\"https://www.ted.com/talks/brene_brown_on_vulnerability\"&gt;https://www.ted.com/talks/brene_brown_on_vulnerability&lt;/a&gt;)&lt;/p&gt;\n\n&lt;p&gt;Coming back around - setting a positive goal and knowing that your efforts will pay off will give you something to look forward to; it will create a positive momentum. This is coming from my own personal experience from the past few months. I&amp;#39;ve been under more stress than... well, as long as I can recall. It&amp;#39;s becoming obvious that I have few good things to look forward to. Obviously, this is a lie. There are so many things, but I have to intentionally set my mind on them.&lt;/p&gt;\n\n&lt;p&gt;My striving to become a competitive runner is based on this hope. Running is just one aspect. I&amp;#39;m assessing all aspects of my life and finding other things to set my mind on.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this is scattered. I had this whole thing written out and my computer crashed so I had to start over, salvaging all of the thoughts. Anyway, I hope this helps anyone who reads it. Feel free to ask questions :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "running", "name": "t1_dgdygxc", "score_hidden": false, "stickied": false, "created": 1492485243.0, "created_utc": 1492456443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]