[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Cooking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t even bother attempting the filling because I made so many mistakes with the cookie portion.\nI tried following the recipe I saw here: &lt;a href=\"http://loveandmacarons.blogspot.ca/2013/01/macaron-recipe-italian-meringue-method.html?m=1\"&gt;http://loveandmacarons.blogspot.ca/2013/01/macaron-recipe-italian-meringue-method.html?m=1&lt;/a&gt;\nThe main problems (that I could see) were that:\nthe mass wasn&amp;#39;t doughy at all, but way more fluid. I wasn&amp;#39;t super sure where I went wrong with this, I made sure that all the ingredients were present in the correct mass. I was just mixing it by hand with a spatula -- did I just not mix it well enough? I added in the egg whites all at once as well. Should I have let the egg whites get to room temp?\nThe almond meal couldn&amp;#39;t be sifted. The blog said to get slivered almonds and blend them in a food processor. I found that I couldn&amp;#39;t get the grains fine enough and it essentially didn&amp;#39;t sift (plus it kind of got... oily?). I gave up and just put it in along with the powdered sugar. I researched this bit and apparently you&amp;#39;re supposed to put in the powdered sugar with the almonds beforehand and mix them both at once. Would this have helped. Should I have used a blender instead of a food processer?\nMy meringue didn&amp;#39;t become anything resembling any sort of peaks. I think this was probably the biggest error. I don&amp;#39;t have a stand mixer, but I have a hand mixer with a whisk attachment. I whisked it for about 20 seconds, added in the sugar gradually while whisking on high, then added in the sugar syrup (it was bubbling at this point) and then kept whisking on high. Nothing really formed, the entire thing was very runny.\nI&amp;#39;m going to give this thing another go tomorrow, any tips/suggestions for next time?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I didn't even bother attempting the filling because I made so many mistakes with the cookie portion.\nI tried following the recipe I saw here: http://loveandmacarons.blogspot.ca/2013/01/macaron-recipe-italian-meringue-method.html?m=1\nThe main problems (that I could see) were that:\nthe mass wasn't doughy at all, but way more fluid. I wasn't super sure where I went wrong with this, I made sure that all the ingredients were present in the correct mass. I was just mixing it by hand with a spatula -- did I just not mix it well enough? I added in the egg whites all at once as well. Should I have let the egg whites get to room temp?\nThe almond meal couldn't be sifted. The blog said to get slivered almonds and blend them in a food processor. I found that I couldn't get the grains fine enough and it essentially didn't sift (plus it kind of got... oily?). I gave up and just put it in along with the powdered sugar. I researched this bit and apparently you're supposed to put in the powdered sugar with the almonds beforehand and mix them both at once. Would this have helped. Should I have used a blender instead of a food processer?\nMy meringue didn't become anything resembling any sort of peaks. I think this was probably the biggest error. I don't have a stand mixer, but I have a hand mixer with a whisk attachment. I whisked it for about 20 seconds, added in the sugar gradually while whisking on high, then added in the sugar syrup (it was bubbling at this point) and then kept whisking on high. Nothing really formed, the entire thing was very runny.\nI'm going to give this thing another go tomorrow, any tips/suggestions for next time?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6540jx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "nachime", "saved": false, "mod_reports": [], "name": "t3_6540jx", "subreddit_name_prefixed": "r/Cooking", "approved_by": null, "over_18": false, "domain": "self.Cooking", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh7f", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Cooking/comments/6540jx/i_utterly_failed_at_making_macarons_any_help/", "num_reports": null, "locked": false, "stickied": false, "created": 1492096656.0, "url": "https://www.reddit.com/r/Cooking/comments/6540jx/i_utterly_failed_at_making_macarons_any_help/", "author_flair_text": null, "quarantine": false, "title": "I utterly failed at making macarons. Any help?", "created_utc": 1492067856.0, "distinguished": null, "media": null, "upvote_ratio": 0.64, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_6540jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_6540jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_6540jx", "likes": null, "replies": "", "user_reports": [], "id": "dg8yqmr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "axlloveshobbits", "parent_id": "t1_dg83443", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "it's not like a sudden thing, it's just the more you touch it, the flatter it gets.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s not like a sudden thing, it&amp;#39;s just the more you touch it, the flatter it gets.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dg8yqmr", "score_hidden": false, "stickied": false, "created": 1492191551.0, "created_utc": 1492162751.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83443", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ateck5", "parent_id": "t1_dg7czrp", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "I heard that overmixing the dry ingredients doesn't necessarily deflate the merengues, at least not significantly. I hope someone could confirm that it's just a myth though ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I heard that overmixing the dry ingredients doesn&amp;#39;t necessarily deflate the merengues, at least not significantly. I hope someone could confirm that it&amp;#39;s just a myth though &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dg83443", "score_hidden": false, "stickied": false, "created": 1492140741.0, "created_utc": 1492111941.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7czrp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "axlloveshobbits", "parent_id": "t3_6540jx", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "I usually grind the almonds in a coffee grinder. You have to be careful not to over grind them, though, or you start to get almond butter (which it sounds like happened to you). You can also buy almond meal, which is easier. \n\nSince your almonds were a mess, you couldn't sift it together with the powdered sugar, which is definitely essential.\n\nAs for your meringue, the hand mixer should have worked fine. It's more likely that your whites were contaminated by a tiny bit of yolk or something else. Stiff peaks are essential, or things get too soupy as you found out.\n\nIt's also important not to over mix the dry ingredients into the meringue, or you'll deflate it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I usually grind the almonds in a coffee grinder. You have to be careful not to over grind them, though, or you start to get almond butter (which it sounds like happened to you). You can also buy almond meal, which is easier. &lt;/p&gt;\n\n&lt;p&gt;Since your almonds were a mess, you couldn&amp;#39;t sift it together with the powdered sugar, which is definitely essential.&lt;/p&gt;\n\n&lt;p&gt;As for your meringue, the hand mixer should have worked fine. It&amp;#39;s more likely that your whites were contaminated by a tiny bit of yolk or something else. Stiff peaks are essential, or things get too soupy as you found out.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also important not to over mix the dry ingredients into the meringue, or you&amp;#39;ll deflate it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dg7czrp", "score_hidden": false, "stickied": false, "created": 1492105752.0, "created_utc": 1492076952.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_6540jx", "likes": null, "replies": "", "user_reports": [], "id": "dg7b23b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "strangechicken", "parent_id": "t3_6540jx", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "I buy macaroons then tell my family and friends I am a master baker and they sing my praises about the macaroons. I've been told I should start a bakery and sell macaroons, which is where I get them obviously. I'm so far in this lie that I already went to the bank for a loan and going to submit the paper work to City Hall to get a business license based on my lie. I'm too deep now. Please help. \n\n\nOh and what you should do is be absolutely 100% sure no egg yolk or other fats got into the whites as this would prevent them from coming together. Also, use a metal or glass bowl and put it in the freezer so it'll be nice and cold. This will help achieve the desired effect. Also know that the older the egg, the harder it takes to beat the whites. About the almonds, you can find almond meal at most places nowadays, but with a food processor, use pulses not a long continuous session as this will begin to melt the fat and make it oily. Of course you might be doing all this already and I was of no help at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I buy macaroons then tell my family and friends I am a master baker and they sing my praises about the macaroons. I&amp;#39;ve been told I should start a bakery and sell macaroons, which is where I get them obviously. I&amp;#39;m so far in this lie that I already went to the bank for a loan and going to submit the paper work to City Hall to get a business license based on my lie. I&amp;#39;m too deep now. Please help. &lt;/p&gt;\n\n&lt;p&gt;Oh and what you should do is be absolutely 100% sure no egg yolk or other fats got into the whites as this would prevent them from coming together. Also, use a metal or glass bowl and put it in the freezer so it&amp;#39;ll be nice and cold. This will help achieve the desired effect. Also know that the older the egg, the harder it takes to beat the whites. About the almonds, you can find almond meal at most places nowadays, but with a food processor, use pulses not a long continuous session as this will begin to melt the fat and make it oily. Of course you might be doing all this already and I was of no help at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dg7b23b", "score_hidden": false, "stickied": false, "created": 1492099848.0, "created_utc": 1492071048.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_6540jx", "likes": null, "replies": "", "user_reports": [], "id": "dg7cufl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stupid_foreigner", "parent_id": "t3_6540jx", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "I managed to get macarons right on my 2nd attempt, surprisingly. Now, I'm no pastry chef or anything but this is atleast how I did it. \n\n*Sifted the almond meal and powdered sugar. Whatever doesn't pass through the sift is too big to put in the batter\n\n*Beat the egg whites for a few seconds until it got foamy, then added sugar and kept beating on high until we got nice peaks. \n\n*Mixing the egg whites with the almond, sugar mixture. This is propably the most important step, and hardest step to get right. If you undermix it, it will get a cracked and uneven surface and no feet. If you overmix it they will just be flat. So you just gotta fold the mixture carefully until it kind of resembles molten lava. This usually takes like 60-70 folds, but don't use those numbers liberally, it could be more and it could be less. \n\n*Pipe the macarons on a baking tray and slam the tray a few times on a surface to get rid of air bubbles inside the piped macarons. \n\n*Let them rest for 30-60 minutes. This dries out the surface a bit, making it easier for them to rise up, rather then out, giving them those signature feet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I managed to get macarons right on my 2nd attempt, surprisingly. Now, I&amp;#39;m no pastry chef or anything but this is atleast how I did it. &lt;/p&gt;\n\n&lt;p&gt;*Sifted the almond meal and powdered sugar. Whatever doesn&amp;#39;t pass through the sift is too big to put in the batter&lt;/p&gt;\n\n&lt;p&gt;*Beat the egg whites for a few seconds until it got foamy, then added sugar and kept beating on high until we got nice peaks. &lt;/p&gt;\n\n&lt;p&gt;*Mixing the egg whites with the almond, sugar mixture. This is propably the most important step, and hardest step to get right. If you undermix it, it will get a cracked and uneven surface and no feet. If you overmix it they will just be flat. So you just gotta fold the mixture carefully until it kind of resembles molten lava. This usually takes like 60-70 folds, but don&amp;#39;t use those numbers liberally, it could be more and it could be less. &lt;/p&gt;\n\n&lt;p&gt;*Pipe the macarons on a baking tray and slam the tray a few times on a surface to get rid of air bubbles inside the piped macarons. &lt;/p&gt;\n\n&lt;p&gt;*Let them rest for 30-60 minutes. This dries out the surface a bit, making it easier for them to rise up, rather then out, giving them those signature feet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dg7cufl", "score_hidden": false, "stickied": false, "created": 1492105304.0, "created_utc": 1492076504.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_6540jx", "likes": null, "replies": "", "user_reports": [], "id": "dg7mazj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "getmesomemangoes", "parent_id": "t3_6540jx", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Macaroons are not easy, there are many critical points to be aware of. That being said, once you get the technique down (may take a few tries), they're not too hard to make.\n\nMy thoughts on your recipe: the almond meal got pasty because you are basically making almond butter when you put the almonds in the food processor. I would advice mixing the almonds with the powdered sugar (powdered sugar already contains some starch, like cornstarch, to keep it from sticking, and that will also help prevent your almonds to become a paste). I also believe your dough might be too liquid because of the almond oil released when you processed them. Don't over process, either. Pulse the almonds and sugar to a powder, and then sift them. Whatever you can't sift, process again and repeat.\n\nAs for the egg whites: they should be at room temperature, and unless you are making a lot of macaroons, you should be able to easily beat them by hand (not a lot of egg whites are needed for a small-ish batch). I wouldn't do the italian meringue method either, it's extra work and I don't think it's needed. Just adding granulated sugar will be fine, but I will leave that up to you. In any case, in italian meringue, you have to make sure some peaks are forming before adding the sugar (the whites should be frothy and starting to stiffen a little bit). Yo do need peaks (I think soft is good enough) when making macaroons.\n\nWith all of that said, your macaroon mass shouldn't be very doughy, but more of a thick batter that you can pipe.\n\nLet me direct you to [this video](https://youtu.be/sP7cW1BlC_s), which I feel explains it quite well. I find he is a little to precise with measurements (when I see 71 grams, I know that if what I have is 70 -and likely 75, even-, it won't make a big difference), but his explanations are very easy to follow.\n\nI hope this helped. Don't give up, and good luck!\n\nedited for spelling", "edited": 1492107514.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Macaroons are not easy, there are many critical points to be aware of. That being said, once you get the technique down (may take a few tries), they&amp;#39;re not too hard to make.&lt;/p&gt;\n\n&lt;p&gt;My thoughts on your recipe: the almond meal got pasty because you are basically making almond butter when you put the almonds in the food processor. I would advice mixing the almonds with the powdered sugar (powdered sugar already contains some starch, like cornstarch, to keep it from sticking, and that will also help prevent your almonds to become a paste). I also believe your dough might be too liquid because of the almond oil released when you processed them. Don&amp;#39;t over process, either. Pulse the almonds and sugar to a powder, and then sift them. Whatever you can&amp;#39;t sift, process again and repeat.&lt;/p&gt;\n\n&lt;p&gt;As for the egg whites: they should be at room temperature, and unless you are making a lot of macaroons, you should be able to easily beat them by hand (not a lot of egg whites are needed for a small-ish batch). I wouldn&amp;#39;t do the italian meringue method either, it&amp;#39;s extra work and I don&amp;#39;t think it&amp;#39;s needed. Just adding granulated sugar will be fine, but I will leave that up to you. In any case, in italian meringue, you have to make sure some peaks are forming before adding the sugar (the whites should be frothy and starting to stiffen a little bit). Yo do need peaks (I think soft is good enough) when making macaroons.&lt;/p&gt;\n\n&lt;p&gt;With all of that said, your macaroon mass shouldn&amp;#39;t be very doughy, but more of a thick batter that you can pipe.&lt;/p&gt;\n\n&lt;p&gt;Let me direct you to &lt;a href=\"https://youtu.be/sP7cW1BlC_s\"&gt;this video&lt;/a&gt;, which I feel explains it quite well. I find he is a little to precise with measurements (when I see 71 grams, I know that if what I have is 70 -and likely 75, even-, it won&amp;#39;t make a big difference), but his explanations are very easy to follow.&lt;/p&gt;\n\n&lt;p&gt;I hope this helped. Don&amp;#39;t give up, and good luck!&lt;/p&gt;\n\n&lt;p&gt;edited for spelling&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dg7mazj", "score_hidden": false, "stickied": false, "created": 1492122634.0, "created_utc": 1492093834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]