[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Cooking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I used to really dig tinga before I went veg. If you don&amp;#39;t know it, it&amp;#39;s shredded chicken cooked in a sauce made of chilis, tomatos, and vineagar. There are a bunch of variations, but here&amp;#39;s what I make that&amp;#39;s veg friendly.&lt;/p&gt;\n\n&lt;p&gt;Ingredients:\nQuorn Cutlets (box of 4) - cut into long, thin strips&lt;/p&gt;\n\n&lt;p&gt;Small onion, half a big one, whatever - diced&lt;/p&gt;\n\n&lt;p&gt;Half a green pepper - diced&lt;/p&gt;\n\n&lt;p&gt;2 tbsp garlic&lt;/p&gt;\n\n&lt;p&gt;1 tsp whole cumin seeds&lt;/p&gt;\n\n&lt;p&gt;Chipotles in adobo&lt;/p&gt;\n\n&lt;p&gt;Tomato sauce&lt;/p&gt;\n\n&lt;p&gt;Water&lt;/p&gt;\n\n&lt;p&gt;2-3 tbsp apple cider vineagar &lt;/p&gt;\n\n&lt;p&gt;Flour Tortillas&lt;/p&gt;\n\n&lt;p&gt;1 Lime&lt;/p&gt;\n\n&lt;p&gt;Cilantro, sour cream, lettuce (optional - dress it however you want)&lt;/p&gt;\n\n&lt;p&gt;Directions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Slice the Quorn cutlets into long, thin strips. You&amp;#39;ll need to thaw them first (2-3 minutes in the microwave will do the trick). Set aside.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The sauce is made of chipotles in adobo plus tomato sauce, and a bit of water depending on your preference. You&amp;#39;re going to blend them in a food processor, but first we need to talk about how much you&amp;#39;re using. Personally, I pull 3 peppers out, add about 2 tbsp of the adobo, combine it with 5-6 tbsp of tomato sauce, and about 3 tbsp of water. This sauce is fairly mild-to-moderate in spice. If you like it hotter, shift the balance of these ingredients to the peppers. If you want it real mild, go the other way. Got it? Okay, let&amp;#39;s move on.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In your favorite pan, heat 2 tbsp olive oil on medium high heat. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Toss in the cumin seeds first and let them start to sizzle just a bit. Not long; they&amp;#39;ll burn fast on their own if you&amp;#39;re not watching. When they&amp;#39;re good to go they should start jumping a little. Let the garlic and onions join them in the bounce castle then and cook for a few minutes, until you&amp;#39;ve got translucent onions. Toss in your salt now, stir it in.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now throw in the quorn. Toss it around with the veggies for 7-8 minutes, until the Quorn starts to brown a bit. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now it&amp;#39;s sauce time, boy. Oh yea. Scoop it out of the processor (or into the bowl you put it in after the processor if you&amp;#39;re like a fancy TV chef and just use a million bowls when you&amp;#39;re cooking). Stir it in real good.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now add your apple cider vinegar and reduce the heat down to medium low. Let it simmer in that vinegar for 5 minutes or so. It&amp;#39;s going to start smelling real nice about now, but resist the urge and finish up. At this point, it&amp;#39;s done when you say it is. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Serve on small flour tortillas (corn is fine, I like these better on flour). Garnish with whatever - sour cream, cilantro, and a slice of lime are a real good choice though. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Sorry I did not take a picture when I made these last night! But make it yourself - this dish always looks amazing when  you&amp;#39;re cooking it.&lt;/p&gt;\n\n&lt;p&gt;Yield: 8-10 tacos, depending how you stuff em.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I used to really dig tinga before I went veg. If you don't know it, it's shredded chicken cooked in a sauce made of chilis, tomatos, and vineagar. There are a bunch of variations, but here's what I make that's veg friendly.\n\nIngredients:\nQuorn Cutlets (box of 4) - cut into long, thin strips\n\nSmall onion, half a big one, whatever - diced\n\nHalf a green pepper - diced\n\n2 tbsp garlic\n\n1 tsp whole cumin seeds\n\nChipotles in adobo\n\nTomato sauce\n\nWater\n\n2-3 tbsp apple cider vineagar \n\nFlour Tortillas\n\n1 Lime\n\nCilantro, sour cream, lettuce (optional - dress it however you want)\n\nDirections:\n\n1. Slice the Quorn cutlets into long, thin strips. You'll need to thaw them first (2-3 minutes in the microwave will do the trick). Set aside.\n\n2. The sauce is made of chipotles in adobo plus tomato sauce, and a bit of water depending on your preference. You're going to blend them in a food processor, but first we need to talk about how much you're using. Personally, I pull 3 peppers out, add about 2 tbsp of the adobo, combine it with 5-6 tbsp of tomato sauce, and about 3 tbsp of water. This sauce is fairly mild-to-moderate in spice. If you like it hotter, shift the balance of these ingredients to the peppers. If you want it real mild, go the other way. Got it? Okay, let's move on.\n\n3. In your favorite pan, heat 2 tbsp olive oil on medium high heat. \n\n4. Toss in the cumin seeds first and let them start to sizzle just a bit. Not long; they'll burn fast on their own if you're not watching. When they're good to go they should start jumping a little. Let the garlic and onions join them in the bounce castle then and cook for a few minutes, until you've got translucent onions. Toss in your salt now, stir it in.\n\n5. Now throw in the quorn. Toss it around with the veggies for 7-8 minutes, until the Quorn starts to brown a bit. \n\n6. Now it's sauce time, boy. Oh yea. Scoop it out of the processor (or into the bowl you put it in after the processor if you're like a fancy TV chef and just use a million bowls when you're cooking). Stir it in real good.\n\n7. Now add your apple cider vinegar and reduce the heat down to medium low. Let it simmer in that vinegar for 5 minutes or so. It's going to start smelling real nice about now, but resist the urge and finish up. At this point, it's done when you say it is. \n\n8. Serve on small flour tortillas (corn is fine, I like these better on flour). Garnish with whatever - sour cream, cilantro, and a slice of lime are a real good choice though. \n\nSorry I did not take a picture when I made these last night! But make it yourself - this dish always looks amazing when  you're cooking it.\n\nYield: 8-10 tacos, depending how you stuff em.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65euo0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "phoenixsuperman", "saved": false, "mod_reports": [], "name": "t3_65euo0", "subreddit_name_prefixed": "r/Cooking", "approved_by": null, "over_18": false, "domain": "self.Cooking", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh7f", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Cooking/comments/65euo0/vegetarian_tinga_tacos_quorn/", "num_reports": null, "locked": false, "stickied": false, "created": 1492228951.0, "url": "https://www.reddit.com/r/Cooking/comments/65euo0/vegetarian_tinga_tacos_quorn/", "author_flair_text": null, "quarantine": false, "title": "Vegetarian Tinga Tacos - Quorn", "created_utc": 1492200151.0, "distinguished": null, "media": null, "upvote_ratio": 0.63, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]