[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Cooking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read that the worst stuff to use are those modern knife sharpeners. It&amp;#39;s recommended to get your knives sharpened regulatory by professionals. Is this true?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've read that the worst stuff to use are those modern knife sharpeners. It's recommended to get your knives sharpened regulatory by professionals. Is this true?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kqf3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "NYCMAC90", "saved": false, "mod_reports": [], "name": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "approved_by": null, "over_18": false, "domain": "self.Cooking", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh7f", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Cooking/comments/65kqf3/whats_the_best_way_to_maintain_your_knives_as/", "num_reports": null, "locked": false, "stickied": false, "created": 1492311111.0, "url": "https://www.reddit.com/r/Cooking/comments/65kqf3/whats_the_best_way_to_maintain_your_knives_as/", "author_flair_text": null, "quarantine": false, "title": "What's the best way to maintain your knives, as well as keep them sharp?", "created_utc": 1492282311.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb2glq", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "clearmoon247", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Personally, if you take a bit of time to practice on lower quality knives (~$10-15 knives) using a whet stone, you can learn to maintain proper angles, identify a burr, and sharpen it to a near razor edge.\n\nI would recommend the king 1000 and 6000 grit stones, which can both be found on Amazon. \n\nhttps://www.amazon.com/dp/B00201M960/ref=cm_sw_r_cp_apa_quN8ybND0HVWJ\n\nAdditionally, here is an amazing guide on how to learn how to sharpen knives:\n\nLearn How To Sharpen: http://www.youtube.com/playlist?list=PLsSxXLQSZIe__A5THcrFGto9_PSkXWiN6", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, if you take a bit of time to practice on lower quality knives (~$10-15 knives) using a whet stone, you can learn to maintain proper angles, identify a burr, and sharpen it to a near razor edge.&lt;/p&gt;\n\n&lt;p&gt;I would recommend the king 1000 and 6000 grit stones, which can both be found on Amazon. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.amazon.com/dp/B00201M960/ref=cm_sw_r_cp_apa_quN8ybND0HVWJ\"&gt;https://www.amazon.com/dp/B00201M960/ref=cm_sw_r_cp_apa_quN8ybND0HVWJ&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Additionally, here is an amazing guide on how to learn how to sharpen knives:&lt;/p&gt;\n\n&lt;p&gt;Learn How To Sharpen: &lt;a href=\"http://www.youtube.com/playlist?list=PLsSxXLQSZIe__A5THcrFGto9_PSkXWiN6\"&gt;http://www.youtube.com/playlist?list=PLsSxXLQSZIe__A5THcrFGto9_PSkXWiN6&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb2glq", "score_hidden": false, "stickied": false, "created": 1492313878.0, "created_utc": 1492285078.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb94c7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "zapatodefuego", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "First of all r/chefknives is a good sub for this kind of question.\n\nMost people don't take care of their knives and so most knives are designed with toughness in mind, but toughness typically detracts from a knives ability to stay sharp when sharpened. A tough knife, like a Wusthof or a Victorinox, made razer sharp will not stay that way for long.  However the same knife sharpened to a much lesser extent will do well holding an edge at that level much longer.  \n\nIn general if you keep your knives out of the dishwasher, don't let them stay wet for too long, and only use a wooden or plastic cutting board you should be good to go.  For about a week.  \n\nThis is where honing comes in which does wonderful things to tougher (ie. softer) steels by realigning a deformed edge.  This should be done​ on average once a week to maintain an edge.  After a while honing will not work so well as the metal will fatigue and will then need to be removed which will need to be done maybe every six months, maybe once a year.  At that point you can either pay for someone to do it for you or invest in some whetstones.\n\nOn whetstones, these are not too difficult to learn how to use and it's fairly difficult to accidentally do permanent damage while learning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all &lt;a href=\"/r/chefknives\"&gt;r/chefknives&lt;/a&gt; is a good sub for this kind of question.&lt;/p&gt;\n\n&lt;p&gt;Most people don&amp;#39;t take care of their knives and so most knives are designed with toughness in mind, but toughness typically detracts from a knives ability to stay sharp when sharpened. A tough knife, like a Wusthof or a Victorinox, made razer sharp will not stay that way for long.  However the same knife sharpened to a much lesser extent will do well holding an edge at that level much longer.  &lt;/p&gt;\n\n&lt;p&gt;In general if you keep your knives out of the dishwasher, don&amp;#39;t let them stay wet for too long, and only use a wooden or plastic cutting board you should be good to go.  For about a week.  &lt;/p&gt;\n\n&lt;p&gt;This is where honing comes in which does wonderful things to tougher (ie. softer) steels by realigning a deformed edge.  This should be done​ on average once a week to maintain an edge.  After a while honing will not work so well as the metal will fatigue and will then need to be removed which will need to be done maybe every six months, maybe once a year.  At that point you can either pay for someone to do it for you or invest in some whetstones.&lt;/p&gt;\n\n&lt;p&gt;On whetstones, these are not too difficult to learn how to use and it&amp;#39;s fairly difficult to accidentally do permanent damage while learning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb94c7", "score_hidden": false, "stickied": false, "created": 1492323036.0, "created_utc": 1492294236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb1kfj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Razoredgeknife", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Get a smooth steel and learn to use it. Don't cut on hard surfaces (glass,metal, ceramic) And when the steel no longer brings the edge back send it to ~~me~~ a professional sharpener. Or get a set of stones and learn to do it yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a smooth steel and learn to use it. Don&amp;#39;t cut on hard surfaces (glass,metal, ceramic) And when the steel no longer brings the edge back send it to &lt;del&gt;me&lt;/del&gt; a professional sharpener. Or get a set of stones and learn to do it yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb1kfj", "score_hidden": false, "stickied": false, "created": 1492312686.0, "created_utc": 1492283886.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb5yn1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Exr29070", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "I'm terrible with a steel and know I'd lose my hand so I use a Magic Chef electric sharpener on cheaper knives like my Calphalon Contemporary set and for my better knives, Wusthof Ikon Classic, I use the two step sharpener from Wusthof.  I haven't found a professional knife sharpener in my area, otherwise I'd use that service.\n\nAside from that, like others said, don't let them soak and don't put them in the dishwasher.  Wash by hand against a small wooden board and dry immediately.  Always store on a magnetic strip or in a wooden block designed for knives.  Cut on a wooden board ideally that you've kept conditioned with food-grade wax and oil.  When you're in the middle of prep just wipe them clean with a kitchen towel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m terrible with a steel and know I&amp;#39;d lose my hand so I use a Magic Chef electric sharpener on cheaper knives like my Calphalon Contemporary set and for my better knives, Wusthof Ikon Classic, I use the two step sharpener from Wusthof.  I haven&amp;#39;t found a professional knife sharpener in my area, otherwise I&amp;#39;d use that service.&lt;/p&gt;\n\n&lt;p&gt;Aside from that, like others said, don&amp;#39;t let them soak and don&amp;#39;t put them in the dishwasher.  Wash by hand against a small wooden board and dry immediately.  Always store on a magnetic strip or in a wooden block designed for knives.  Cut on a wooden board ideally that you&amp;#39;ve kept conditioned with food-grade wax and oil.  When you&amp;#39;re in the middle of prep just wipe them clean with a kitchen towel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb5yn1", "score_hidden": false, "stickied": false, "created": 1492318648.0, "created_utc": 1492289848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgbsevn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mihir_lavande", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "A good sharpening stone. It may set you back a bit (I have two 800 grit, a 1000 grit and a 6000 grit all for about $ 80 each) but they are worth it. Start from lower grit and move up to higher grit. Take your time to sharpen and practice with cheap knives first.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A good sharpening stone. It may set you back a bit (I have two 800 grit, a 1000 grit and a 6000 grit all for about $ 80 each) but they are worth it. Start from lower grit and move up to higher grit. Take your time to sharpen and practice with cheap knives first.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgbsevn", "score_hidden": false, "stickied": false, "created": 1492353732.0, "created_utc": 1492324932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgbsqwi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheShnoff", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Sharpen your knives yourself. It's not all that hard, you will save money, and a whet stone and leather strop will always beat a \"modern knife sharpener\". I took the first chef knife I ever bought to a sharpener at the mall. Not only did the guy butcher the blade (took off an inch of heal and was covered in scratches) but he refused to take responsibility, he tried to tell me it was this way when I brought it in (it was not). Never went back, bought a stone and strop for 80 monies (Canadian). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sharpen your knives yourself. It&amp;#39;s not all that hard, you will save money, and a whet stone and leather strop will always beat a &amp;quot;modern knife sharpener&amp;quot;. I took the first chef knife I ever bought to a sharpener at the mall. Not only did the guy butcher the blade (took off an inch of heal and was covered in scratches) but he refused to take responsibility, he tried to tell me it was this way when I brought it in (it was not). Never went back, bought a stone and strop for 80 monies (Canadian). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgbsqwi", "score_hidden": false, "stickied": false, "created": 1492354583.0, "created_utc": 1492325783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb1rht", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ComicManket77", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Don't let your knives soak in water, so if you're washing your dishes, keep them off to the side (it's also not safe to leave your knife in the sink with other dishes because you might cut yourself reaching for other things).  Speaking of letting your knives near water.  Though you should let you dishes air dry, I would advise against letting you knives near and drip of water as much as you can, dry them off with a paper towel or something when you're done.  And be careful not to cut your hand.\n\nAlso, you should try to clean your knife right after you're done using it, but that goes for everything you will reuse in the kitchen, clean as you go.  \n\nSharpen your knives after you're done using them as well.  The type of knife sharpener I use is SIMILAR to this https://www.amazon.com/Buck-Knives-97082-Tri-Grit-Sharpener/dp/B006YBY8V6 .  It isn't exactly this, the one I have came with a knife set that I bought so I can't point you in the immediate direction.  I'm sorry.  To advise how to use something like this and you're not used to it, have the point resting on a dry rag or towel on the table, then using a little bit of force, let the blade fall against the sharpener at (not 100% sure) a 15-25 degree angle from heel (which is like where the sharp part starts after the bolster) to tip.  Do it on the each side of the blade.  Using opposite sides of the sharpener for each side of the blade.  When you get used to it, you don't have to do it with the point on a rag on the table all-together. \n\nAlso, if you're not using your knives, keep them in their individual sheaths.\n\nTry to cut on cutting boards and no other surfaces if you have an option.\n\nIf you take care of your knives daily then you won't need to bring them to professionals often.  But if they are beyond a certain part and you aren't used to sharpening your knives with something like a whetstone, you should go see a professional.  ", "edited": 1492284620.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t let your knives soak in water, so if you&amp;#39;re washing your dishes, keep them off to the side (it&amp;#39;s also not safe to leave your knife in the sink with other dishes because you might cut yourself reaching for other things).  Speaking of letting your knives near water.  Though you should let you dishes air dry, I would advise against letting you knives near and drip of water as much as you can, dry them off with a paper towel or something when you&amp;#39;re done.  And be careful not to cut your hand.&lt;/p&gt;\n\n&lt;p&gt;Also, you should try to clean your knife right after you&amp;#39;re done using it, but that goes for everything you will reuse in the kitchen, clean as you go.  &lt;/p&gt;\n\n&lt;p&gt;Sharpen your knives after you&amp;#39;re done using them as well.  The type of knife sharpener I use is SIMILAR to this &lt;a href=\"https://www.amazon.com/Buck-Knives-97082-Tri-Grit-Sharpener/dp/B006YBY8V6\"&gt;https://www.amazon.com/Buck-Knives-97082-Tri-Grit-Sharpener/dp/B006YBY8V6&lt;/a&gt; .  It isn&amp;#39;t exactly this, the one I have came with a knife set that I bought so I can&amp;#39;t point you in the immediate direction.  I&amp;#39;m sorry.  To advise how to use something like this and you&amp;#39;re not used to it, have the point resting on a dry rag or towel on the table, then using a little bit of force, let the blade fall against the sharpener at (not 100% sure) a 15-25 degree angle from heel (which is like where the sharp part starts after the bolster) to tip.  Do it on the each side of the blade.  Using opposite sides of the sharpener for each side of the blade.  When you get used to it, you don&amp;#39;t have to do it with the point on a rag on the table all-together. &lt;/p&gt;\n\n&lt;p&gt;Also, if you&amp;#39;re not using your knives, keep them in their individual sheaths.&lt;/p&gt;\n\n&lt;p&gt;Try to cut on cutting boards and no other surfaces if you have an option.&lt;/p&gt;\n\n&lt;p&gt;If you take care of your knives daily then you won&amp;#39;t need to bring them to professionals often.  But if they are beyond a certain part and you aren&amp;#39;t used to sharpening your knives with something like a whetstone, you should go see a professional.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb1rht", "score_hidden": false, "stickied": false, "created": 1492312943.0, "created_utc": 1492284143.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb1qho", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mister_Sporks_Hands", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 1, "body": "I use an electric 'modern' sharpener and it does just fine. A pro with the gear is probably better but sharp is sharp. Maybe enthusiasts can split hairs (HA! Get it?) and quibble over micro-geometry or some such but having a system you use regularly beats the heck out of nothing and perhaps more importantly, it takes me seconds so I don't put off the task until I can haul them down to someone in the city. And of course it's free now that I have the gizmo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I use an electric &amp;#39;modern&amp;#39; sharpener and it does just fine. A pro with the gear is probably better but sharp is sharp. Maybe enthusiasts can split hairs (HA! Get it?) and quibble over micro-geometry or some such but having a system you use regularly beats the heck out of nothing and perhaps more importantly, it takes me seconds so I don&amp;#39;t put off the task until I can haul them down to someone in the city. And of course it&amp;#39;s free now that I have the gizmo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb1qho", "score_hidden": false, "stickied": false, "created": 1492312905.0, "created_utc": 1492284105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb2qqe", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Sabnitron", "parent_id": "t1_dgb2f5n", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "That's why he said to learn how to use it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s why he said to learn how to use it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb2qqe", "score_hidden": false, "stickied": false, "created": 1492314255.0, "created_utc": 1492285455.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb3otr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "interstellargator", "parent_id": "t1_dgb2f5n", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Who is \"they\"? Because if it's the companies who profit from you needing your knives professionally sharpened then they aren't a reliable source of info.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who is &amp;quot;they&amp;quot;? Because if it&amp;#39;s the companies who profit from you needing your knives professionally sharpened then they aren&amp;#39;t a reliable source of info.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb3otr", "score_hidden": false, "stickied": false, "created": 1492315552.0, "created_utc": 1492286752.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgb2zzp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "InTwenteeForty", "parent_id": "t1_dgb2f5n", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "I took a 2 hour class and my knives are constantly sharp now. I'm sure I could be better at it, but it's easy to get proficient.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took a 2 hour class and my knives are constantly sharp now. I&amp;#39;m sure I could be better at it, but it&amp;#39;s easy to get proficient.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb2zzp", "score_hidden": false, "stickied": false, "created": 1492314595.0, "created_utc": 1492285795.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2f5n", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "NYCMAC90", "parent_id": "t1_dgb1gnq", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "They advise against using a stone if you're not trained. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They advise against using a stone if you&amp;#39;re not trained. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb2f5n", "score_hidden": false, "stickied": false, "created": 1492313825.0, "created_utc": 1492285025.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1gnq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "interstellargator", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Yes and no. Professional sharpeners are pretty variable. Some will do a fantastic job, others will just re-grind the blade on a machine and after 5 or 6 sharpenings you won't have a knife any more. They're also pretty expensive if you just have 2 or 3 knives for home use, as they normally do a whole restaurant kitchen of 30-40 knives.\n\nYou can buy a whetstone for like £20 online, and a steel (honing rod) for a similar price and learn to do it yourself. It takes a little getting used to, but you can absolutely achieve professional-grade results with a little practice. Just sharpen with the whetstone every 6 months or so, and hone with the steel before every use. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes and no. Professional sharpeners are pretty variable. Some will do a fantastic job, others will just re-grind the blade on a machine and after 5 or 6 sharpenings you won&amp;#39;t have a knife any more. They&amp;#39;re also pretty expensive if you just have 2 or 3 knives for home use, as they normally do a whole restaurant kitchen of 30-40 knives.&lt;/p&gt;\n\n&lt;p&gt;You can buy a whetstone for like £20 online, and a steel (honing rod) for a similar price and learn to do it yourself. It takes a little getting used to, but you can absolutely achieve professional-grade results with a little practice. Just sharpen with the whetstone every 6 months or so, and hone with the steel before every use. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgb1gnq", "score_hidden": false, "stickied": false, "created": 1492312546.0, "created_utc": 1492283746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgbcsof", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Linuxxx", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "I say it would depend on how comfortable you are working with materials. I maintain my knives with a steel, and sharpen with a [lansky](http://lansky.com/) deluxe 5 stone kit. I typically sharpen and hone at a 20 degree angle. If you are OK with taking a small risk (the kit is very simple to use), you can get excellent results. Another redditor suggested experimenting on an inexpensive knife, which I think is a great idea. Once you get to the point that you can consistently create a sharp edge on a junk knife (yes, I know that there are going to be folks who say that certain steels won't sharpen well), the techniques are exactly the same to get a great edge on your good hardware. Good luck either way!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I say it would depend on how comfortable you are working with materials. I maintain my knives with a steel, and sharpen with a &lt;a href=\"http://lansky.com/\"&gt;lansky&lt;/a&gt; deluxe 5 stone kit. I typically sharpen and hone at a 20 degree angle. If you are OK with taking a small risk (the kit is very simple to use), you can get excellent results. Another redditor suggested experimenting on an inexpensive knife, which I think is a great idea. Once you get to the point that you can consistently create a sharp edge on a junk knife (yes, I know that there are going to be folks who say that certain steels won&amp;#39;t sharpen well), the techniques are exactly the same to get a great edge on your good hardware. Good luck either way!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgbcsof", "score_hidden": false, "stickied": false, "created": 1492328363.0, "created_utc": 1492299563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7f", "removal_reason": null, "link_id": "t3_65kqf3", "likes": null, "replies": "", "user_reports": [], "id": "dgc2u9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "threespruces", "parent_id": "t3_65kqf3", "subreddit_name_prefixed": "r/Cooking", "controversiality": 0, "body": "Hone them before every use, and store them with the edges protected.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hone them before every use, and store them with the edges protected.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Cooking", "name": "t1_dgc2u9x", "score_hidden": false, "stickied": false, "created": 1492381516.0, "created_utc": 1492352716.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]