[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LSD", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pretty bored on a Sunday afternoon, thought I&amp;#39;d share this experience. &lt;/p&gt;\n\n&lt;p&gt;Ok so this is the story of my first very intense acid trip. I had tripped once before this and it was only about 100ug from a blotter than I&amp;#39;m pretty sure was under dosed.  During that trip I experienced some bright colors, great euphoria, insightful thoughts, and just over all &amp;quot;what the fuck do I do with myself&amp;quot; feeling you get on acid. After this experience I had the mindset of &amp;quot;oh this is what acid is like? This isn&amp;#39;t too intense I can definitely handle more.&amp;quot; Boy was I fucking wrong. &lt;/p&gt;\n\n&lt;p&gt;A little while later my buds and I were itching for another trip. My friend, who we can just call E, was house sitting his aunt and uncles house for 2 weeks while they were on vacation, and we were very keen on tripping in the open house. This house was fucking incredible, a 3 story multimillion dollar mansion in the Sunset District of San Francisco about 30 blocks from Ocean Beach. You can probably understand why we wanted to trip there. There was only one problem, our dealer didn&amp;#39;t have any acid. &lt;/p&gt;\n\n&lt;p&gt;So we proceeded to do something very fucking stupid. &lt;/p&gt;\n\n&lt;p&gt;We went over to a specific Park in Berkeley where we knew gangs of homeless people would sell you any sort of drug you could want. We had had friends who bought LSD from a specific group of hippie homeless people and been fine. So we decided just to check things out, not getting our hopes too high that we would actually score some acid. &lt;/p&gt;\n\n&lt;p&gt;In short, we did score some acid. From a very nice homeless lady named Jen. She dropped a drop of acid onto 6 different gummy bears and said that each drop should be about 200ug. However her drops weren&amp;#39;t the cleanest drops, sometimes she&amp;#39;d fuck up and do like 1.5 drops and then just be like &amp;quot;fuck it&amp;quot; and give it to us anyway. So I&amp;#39;m sure there was more than 200ug in some of the gummies. &lt;/p&gt;\n\n&lt;p&gt;We took Bart and muni back to the McMansion and proceeded to eat 2 of the gummies each. Now I know it was really fucking stupid to take this random drug we received from a homeless lady, I always test any drugs I receive nowadays, but back then I was pretty fucking autistic. In my defense Jen seemed to be a pretty nice lady lol. My other bud, who we&amp;#39;ll call K, and I hopped on the the roof to look at the sick view while my friend took a shit in the bathroom. And within 20 minutes I knew I was in for some fucking shit. &lt;/p&gt;\n\n&lt;p&gt;I started to feel reaaaaaally fucking weird. Everything was bright as fuck, my vision was wobbly and I felt this sort of energy in my core that was telling me I needed to move around. I go &amp;quot;hey K, I&amp;#39;m coming up extra fucking hard.&amp;quot; And he goes &amp;quot;fuckin yea me too man.&amp;quot; That&amp;#39;s when E comes out of the bathroom and is like &amp;quot;I didn&amp;#39;t even shit in there I just spent like 10 minutes looking at shit in the bathroom I&amp;#39;m coming up super fucking hard.&amp;quot; Slightly overwhelmed by the rapid onset of our trip we decided to take a walk outside of the house in the beautiful city. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when my mom texts me. Apparently I had forgotten to lock the door when I left the house, and she was pretty pissed about it. I could feel her hostility through the text messages and it freaked me the fuck out. I had no idea how the fuck to respond to what she was saying so I just kept saying &amp;quot;I&amp;#39;m sorry I&amp;#39;m sorry I&amp;#39;m sorry.&amp;quot; All the while the letters on my phone are in fucking 3D and spinning around and pulsating like a motherfucker. Miraculously I manage to pull off a conversation and get her to stop yelling at me. But then I realized my phone was dying, and that I needed to go to the Safeway around the corner to get a phone charger for some reason. &lt;/p&gt;\n\n&lt;p&gt;On the walk to the Safeway I remember my friends talking about how fucking cool the graffiti looked on the walls. Yes the graffiti was cool, but I remember the cracks on the sidewalk being far more stimulating to me. Shit was fucking wild, I don&amp;#39;t even know how to describe it. But anyway we get to the Safeway and walk in. Immediately we all knew this was a mistake. At this point we&amp;#39;re all full on tripping and everyone in this Safeway was full on sober. The soberness of everyone I the store was like fucking gamma rays blasting their way into my brain. It was so apparent that us acid children DID NOT belong in this sober world. So we had to act fast. I pretty much ran over to a dude, and basically yelled at him, &amp;quot;WHERE ARE THE PHONE CHARGERS!&amp;quot; And he replies with, &amp;quot;uh...I don&amp;#39;t know man...I don&amp;#39;t work here.&amp;quot; Embarrassed, I apologized, grabbed a water and left the store. Why we didn&amp;#39;t just go back to the house to get a phone charger I don&amp;#39;t know. Pretty sure Safeway doesn&amp;#39;t even have phone chargers. &lt;/p&gt;\n\n&lt;p&gt;Both E and K think they need to shit, they&amp;#39;re not sure, but they say we should head back to the house to try and shit. I agree to come along. Nobody wanted to hold the plastic water bottle I had gotten from Safeway, it was like some otherworldly toxic thing that was interfering with my earth created body. But I knew there was earth created life water inside the bottle, so I figured the plastic was a necessary evil. I couldn&amp;#39;t figure out how to hold the bottle however, so I ended up cradling it like a baby for the whole walk back. &lt;/p&gt;\n\n&lt;p&gt;We got back and my friends went into separate bathrooms to take simultaneous shits. And I stayed in the living room with the two dogs E&amp;#39;s aunt and uncle had. I tried to get down with the one dog and he barked at me. It scared the living fuck out of me, so I jumped up and ran away saying &amp;quot;I&amp;#39;m sorry I&amp;#39;m sorry I&amp;#39;m sorry&amp;quot; and went into a bedroom. I laid down in the bed and just looked up at the ceiling, or at least I tried to. My whole vision was filled up with fucking phantom of the opera masks. And they were spinning and spinning and multiplying and morphing out of control. Overwhelmed by this, I knocked on the door to the bathroom K was in, and told him I wanted to leave the house again. He came out of the bathroom and said he couldn&amp;#39;t take a shit, and soon after E came out also saying he couldn&amp;#39;t take a shit. And off we went again. &lt;/p&gt;\n\n&lt;p&gt;This time we walked to a park that was a couple blocks away and sat in some trees. There were fucking gigantic cross walks that we crossed to get there, and all of the cars that were stopped for just us made me feel like fucking Moses parting the Red Sea, it was throughly overwhelming. At the park every single plant that I looked at looked like a time lapse of a plant growing, spinning and twirling and moving almost as if it was alive. It was very cool to look at. We then decided to lay in the grass. I closed my eyes, and as I did this my brain sort of drifted off into acid land, and I sort of forgot where I was and what was going on. When I realized that I was slightly losing myself I sat up a little bit nervous. But also enthralled by what this drug was doing to my brain. After a while in the park we decided we should eat (none of us were hungry but we hadn&amp;#39;t ate for several hours and figured we should). So we went back to the house once again. &lt;/p&gt;\n\n&lt;p&gt;Before going back into the house to get food we sat on the steps outside just to get our bearings. The inside of the house was extra overstimulating as things are a lot closer to you than things outside, so it is impossible to escape the visuals you were getting looking at literally anything lol.  Sitting on the steps I felt like I was on a ship in the middle of the sea. The whole world was swaying back and forth and back and forth while the steps stayed still. I tried to articulate this feeling to my friends but couldn&amp;#39;t get the words out. Bumbling over what I was trying to describe, E put his hand on me, and said &amp;quot;dude, we know what you mean, we&amp;#39;re feeling it too.&amp;quot; Shit blew my ass away. It was still very frustrating not being able to say what I was feeling however. Also at this point I noticed having auditory hallucinations. Everything sounded deep and far away, like someone was talking through a tunnel. Shit was weird. After about 20 minutes of this we decided we needed to brave going inside and get food. &lt;/p&gt;\n\n&lt;p&gt;We ate cheerios, and turned on Pink Floyd in the kitchen. You really don&amp;#39;t understand Pink Floyd unless you listen to it on a psychedelic, I&amp;#39;m sure that sounds kind of dumb but it&amp;#39;s really true. The cheerios were morphing and pulsating in the bowl and they tasted like straight cardboard. But I forced them down anyway. By this point I was over the peak of the acid trip, and the plateau I was coming down into was very pleasant and euphoric and it wasn&amp;#39;t quite as overwhelming and the come up and peak. I was thoroughly enjoying myself at this point. &lt;/p&gt;\n\n&lt;p&gt;We hopped up on to the roof and turned our Spotify on shuffle. Every single song was fucking incredible, didn&amp;#39;t matter what genre, it was spectacular, I felt like I was apart of the music and was moving with it. Truly incredible. With the wind and fog blasting around us, I was suddenly overwhelmed with the fact that I needed to be nicer to my little brother. It was a heavy realization that acid brought me, and in that moment I cried about it, and wanted my brother to be with me so I could tell him I loved him. It was such a sudden, raw, and powerful emotion and I haven&amp;#39;t experienced anything like it since. Absolutely beautiful. &lt;/p&gt;\n\n&lt;p&gt;The come down was a lot less eventful than the rest of the trip, we sat around the house and laughed about nonsense and played with dogs and explored different things we could look at and describe what we were seeing. I vividly remember looking at my forearm and seeing tribal patten snake like things that were pushing up and pulsating from beneath my skin. This happens to me every acid trip now and it&amp;#39;s one of my favorite things to look at. &lt;/p&gt;\n\n&lt;p&gt;I took a shower near the end of my trip and it was seriously the best shower I&amp;#39;ve ever taken and was probably top 10 best things I&amp;#39;ve ever done in my life. I probably spent an hour in there. Their McMansion had a fancy ass shower with 3 shower heads, digital temperature settings, a steam machine, and a bench. I hope one day I become wealthy enough to own a shower of that capacity. &lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s pretty much it, it was fun typing this out and reliving some of these moments. This acid trip, while incredibly overwhelming was one of the best experiences I&amp;#39;ve ever had in my life with my best friends who are still my best friends to this day. All love, insight and positivity. Acid is a beautiful and powerful drug, this trip made me fully realize that and fully respect this wondrous molecule. I went into this trip thinking I could handle my shit and be fine, and the acid said fuck no and gave me this, and boy am I glad it did.  &lt;/p&gt;\n\n&lt;p&gt;Also, every time I would take a piss during this trip I seriously could not tell if I had pissed on my hands or not. Pretty weird but also hilarious. &lt;/p&gt;\n\n&lt;p&gt;TL;DR bought acid from a homeless lady with my buds, tripped my fucking ass off in 3 story house in San Francisco, had a blast and couldn&amp;#39;t tell if I pissed on myself. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Pretty bored on a Sunday afternoon, thought I'd share this experience. \n\nOk so this is the story of my first very intense acid trip. I had tripped once before this and it was only about 100ug from a blotter than I'm pretty sure was under dosed.  During that trip I experienced some bright colors, great euphoria, insightful thoughts, and just over all \"what the fuck do I do with myself\" feeling you get on acid. After this experience I had the mindset of \"oh this is what acid is like? This isn't too intense I can definitely handle more.\" Boy was I fucking wrong. \n\nA little while later my buds and I were itching for another trip. My friend, who we can just call E, was house sitting his aunt and uncles house for 2 weeks while they were on vacation, and we were very keen on tripping in the open house. This house was fucking incredible, a 3 story multimillion dollar mansion in the Sunset District of San Francisco about 30 blocks from Ocean Beach. You can probably understand why we wanted to trip there. There was only one problem, our dealer didn't have any acid. \n\nSo we proceeded to do something very fucking stupid. \n\nWe went over to a specific Park in Berkeley where we knew gangs of homeless people would sell you any sort of drug you could want. We had had friends who bought LSD from a specific group of hippie homeless people and been fine. So we decided just to check things out, not getting our hopes too high that we would actually score some acid. \n\nIn short, we did score some acid. From a very nice homeless lady named Jen. She dropped a drop of acid onto 6 different gummy bears and said that each drop should be about 200ug. However her drops weren't the cleanest drops, sometimes she'd fuck up and do like 1.5 drops and then just be like \"fuck it\" and give it to us anyway. So I'm sure there was more than 200ug in some of the gummies. \n\nWe took Bart and muni back to the McMansion and proceeded to eat 2 of the gummies each. Now I know it was really fucking stupid to take this random drug we received from a homeless lady, I always test any drugs I receive nowadays, but back then I was pretty fucking autistic. In my defense Jen seemed to be a pretty nice lady lol. My other bud, who we'll call K, and I hopped on the the roof to look at the sick view while my friend took a shit in the bathroom. And within 20 minutes I knew I was in for some fucking shit. \n\nI started to feel reaaaaaally fucking weird. Everything was bright as fuck, my vision was wobbly and I felt this sort of energy in my core that was telling me I needed to move around. I go \"hey K, I'm coming up extra fucking hard.\" And he goes \"fuckin yea me too man.\" That's when E comes out of the bathroom and is like \"I didn't even shit in there I just spent like 10 minutes looking at shit in the bathroom I'm coming up super fucking hard.\" Slightly overwhelmed by the rapid onset of our trip we decided to take a walk outside of the house in the beautiful city. \n\nThat's when my mom texts me. Apparently I had forgotten to lock the door when I left the house, and she was pretty pissed about it. I could feel her hostility through the text messages and it freaked me the fuck out. I had no idea how the fuck to respond to what she was saying so I just kept saying \"I'm sorry I'm sorry I'm sorry.\" All the while the letters on my phone are in fucking 3D and spinning around and pulsating like a motherfucker. Miraculously I manage to pull off a conversation and get her to stop yelling at me. But then I realized my phone was dying, and that I needed to go to the Safeway around the corner to get a phone charger for some reason. \n\nOn the walk to the Safeway I remember my friends talking about how fucking cool the graffiti looked on the walls. Yes the graffiti was cool, but I remember the cracks on the sidewalk being far more stimulating to me. Shit was fucking wild, I don't even know how to describe it. But anyway we get to the Safeway and walk in. Immediately we all knew this was a mistake. At this point we're all full on tripping and everyone in this Safeway was full on sober. The soberness of everyone I the store was like fucking gamma rays blasting their way into my brain. It was so apparent that us acid children DID NOT belong in this sober world. So we had to act fast. I pretty much ran over to a dude, and basically yelled at him, \"WHERE ARE THE PHONE CHARGERS!\" And he replies with, \"uh...I don't know man...I don't work here.\" Embarrassed, I apologized, grabbed a water and left the store. Why we didn't just go back to the house to get a phone charger I don't know. Pretty sure Safeway doesn't even have phone chargers. \n\nBoth E and K think they need to shit, they're not sure, but they say we should head back to the house to try and shit. I agree to come along. Nobody wanted to hold the plastic water bottle I had gotten from Safeway, it was like some otherworldly toxic thing that was interfering with my earth created body. But I knew there was earth created life water inside the bottle, so I figured the plastic was a necessary evil. I couldn't figure out how to hold the bottle however, so I ended up cradling it like a baby for the whole walk back. \n\nWe got back and my friends went into separate bathrooms to take simultaneous shits. And I stayed in the living room with the two dogs E's aunt and uncle had. I tried to get down with the one dog and he barked at me. It scared the living fuck out of me, so I jumped up and ran away saying \"I'm sorry I'm sorry I'm sorry\" and went into a bedroom. I laid down in the bed and just looked up at the ceiling, or at least I tried to. My whole vision was filled up with fucking phantom of the opera masks. And they were spinning and spinning and multiplying and morphing out of control. Overwhelmed by this, I knocked on the door to the bathroom K was in, and told him I wanted to leave the house again. He came out of the bathroom and said he couldn't take a shit, and soon after E came out also saying he couldn't take a shit. And off we went again. \n\nThis time we walked to a park that was a couple blocks away and sat in some trees. There were fucking gigantic cross walks that we crossed to get there, and all of the cars that were stopped for just us made me feel like fucking Moses parting the Red Sea, it was throughly overwhelming. At the park every single plant that I looked at looked like a time lapse of a plant growing, spinning and twirling and moving almost as if it was alive. It was very cool to look at. We then decided to lay in the grass. I closed my eyes, and as I did this my brain sort of drifted off into acid land, and I sort of forgot where I was and what was going on. When I realized that I was slightly losing myself I sat up a little bit nervous. But also enthralled by what this drug was doing to my brain. After a while in the park we decided we should eat (none of us were hungry but we hadn't ate for several hours and figured we should). So we went back to the house once again. \n\nBefore going back into the house to get food we sat on the steps outside just to get our bearings. The inside of the house was extra overstimulating as things are a lot closer to you than things outside, so it is impossible to escape the visuals you were getting looking at literally anything lol.  Sitting on the steps I felt like I was on a ship in the middle of the sea. The whole world was swaying back and forth and back and forth while the steps stayed still. I tried to articulate this feeling to my friends but couldn't get the words out. Bumbling over what I was trying to describe, E put his hand on me, and said \"dude, we know what you mean, we're feeling it too.\" Shit blew my ass away. It was still very frustrating not being able to say what I was feeling however. Also at this point I noticed having auditory hallucinations. Everything sounded deep and far away, like someone was talking through a tunnel. Shit was weird. After about 20 minutes of this we decided we needed to brave going inside and get food. \n\nWe ate cheerios, and turned on Pink Floyd in the kitchen. You really don't understand Pink Floyd unless you listen to it on a psychedelic, I'm sure that sounds kind of dumb but it's really true. The cheerios were morphing and pulsating in the bowl and they tasted like straight cardboard. But I forced them down anyway. By this point I was over the peak of the acid trip, and the plateau I was coming down into was very pleasant and euphoric and it wasn't quite as overwhelming and the come up and peak. I was thoroughly enjoying myself at this point. \n\nWe hopped up on to the roof and turned our Spotify on shuffle. Every single song was fucking incredible, didn't matter what genre, it was spectacular, I felt like I was apart of the music and was moving with it. Truly incredible. With the wind and fog blasting around us, I was suddenly overwhelmed with the fact that I needed to be nicer to my little brother. It was a heavy realization that acid brought me, and in that moment I cried about it, and wanted my brother to be with me so I could tell him I loved him. It was such a sudden, raw, and powerful emotion and I haven't experienced anything like it since. Absolutely beautiful. \n\nThe come down was a lot less eventful than the rest of the trip, we sat around the house and laughed about nonsense and played with dogs and explored different things we could look at and describe what we were seeing. I vividly remember looking at my forearm and seeing tribal patten snake like things that were pushing up and pulsating from beneath my skin. This happens to me every acid trip now and it's one of my favorite things to look at. \n\nI took a shower near the end of my trip and it was seriously the best shower I've ever taken and was probably top 10 best things I've ever done in my life. I probably spent an hour in there. Their McMansion had a fancy ass shower with 3 shower heads, digital temperature settings, a steam machine, and a bench. I hope one day I become wealthy enough to own a shower of that capacity. \n\nAnd that's pretty much it, it was fun typing this out and reliving some of these moments. This acid trip, while incredibly overwhelming was one of the best experiences I've ever had in my life with my best friends who are still my best friends to this day. All love, insight and positivity. Acid is a beautiful and powerful drug, this trip made me fully realize that and fully respect this wondrous molecule. I went into this trip thinking I could handle my shit and be fine, and the acid said fuck no and gave me this, and boy am I glad it did.  \n\n\nAlso, every time I would take a piss during this trip I seriously could not tell if I had pissed on my hands or not. Pretty weird but also hilarious. \n\n\nTL;DR bought acid from a homeless lady with my buds, tripped my fucking ass off in 3 story house in San Francisco, had a blast and couldn't tell if I pissed on myself. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65rb92", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 43, "report_reasons": null, "author": "EATTHEMUFFINBITCH", "saved": false, "mod_reports": [], "name": "t3_65rb92", "subreddit_name_prefixed": "r/LSD", "approved_by": null, "over_18": false, "domain": "self.LSD", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhvj", "edited": 1492377650.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LSD/comments/65rb92/intense_ass_trip_report/", "num_reports": null, "locked": false, "stickied": false, "created": 1492404378.0, "url": "https://www.reddit.com/r/LSD/comments/65rb92/intense_ass_trip_report/", "author_flair_text": null, "quarantine": false, "title": "Intense ass trip report.", "created_utc": 1492375578.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 43}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": "", "user_reports": [], "id": "dgcvv05", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Chezdon", "parent_id": "t1_dgcvlw3", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "Cheers man. Yeah you're right. Was just a little something to spice it up. Very shitty indeed! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cheers man. Yeah you&amp;#39;re right. Was just a little something to spice it up. Very shitty indeed! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgcvv05", "score_hidden": false, "stickied": false, "created": 1492420508.0, "created_utc": 1492391708.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvlw3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EATTHEMUFFINBITCH", "parent_id": "t1_dgcvdu9", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "Sorry to hear that man. I try to not push my limits, if I'm having a good time on one substance I don't feel inclined to add another with the risk of ruining the experience of the first one. But I've also had some shitty trips due to poor set and setting, and they're pretty damn terrible, it's a shitty thing to go through. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to hear that man. I try to not push my limits, if I&amp;#39;m having a good time on one substance I don&amp;#39;t feel inclined to add another with the risk of ruining the experience of the first one. But I&amp;#39;ve also had some shitty trips due to poor set and setting, and they&amp;#39;re pretty damn terrible, it&amp;#39;s a shitty thing to go through. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgcvlw3", "score_hidden": false, "stickied": false, "created": 1492420177.0, "created_utc": 1492391377.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvdu9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chezdon", "parent_id": "t1_dgcuwn7", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "I only did a few puffs. Had a really bad trip once and the worst 4 hours of my life. Think it was my state of mind rather than the weed but yeah, gotta tread carefully.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only did a few puffs. Had a really bad trip once and the worst 4 hours of my life. Think it was my state of mind rather than the weed but yeah, gotta tread carefully.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgcvdu9", "score_hidden": false, "stickied": false, "created": 1492419891.0, "created_utc": 1492391091.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuwn7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EATTHEMUFFINBITCH", "parent_id": "t1_dgcu55w", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "Hahahaha. No problem man, thank you for taking the time out of your day to read my story. I believe in the kitchen we had on Brain Damage and when it seamlessly transitioned into Eclipse I damn near collapsed. However up on the roof I think I remember we listened to the entirety of Dogs off the Animals album. And although it's not Pink Floyd, the Rain Song by Led Zeppelin was blowin me away as well. I haven't smoked weed while high on LSD because weed sometimes gives me pretty bad anxiety, and I'm always scared to ruin a great LSD trip with the unfortunate effects THC has on my brain. :( My friends however have taken bong rips whilst peaking during a trip and said that moment was the highest they've ever been on anything lol. My friend said he felt like he was living in a cartoon land lol. And yes, in your head it makes perfect sense, there just seems to be a disconnect between your acid brain and your mouth haha. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hahahaha. No problem man, thank you for taking the time out of your day to read my story. I believe in the kitchen we had on Brain Damage and when it seamlessly transitioned into Eclipse I damn near collapsed. However up on the roof I think I remember we listened to the entirety of Dogs off the Animals album. And although it&amp;#39;s not Pink Floyd, the Rain Song by Led Zeppelin was blowin me away as well. I haven&amp;#39;t smoked weed while high on LSD because weed sometimes gives me pretty bad anxiety, and I&amp;#39;m always scared to ruin a great LSD trip with the unfortunate effects THC has on my brain. :( My friends however have taken bong rips whilst peaking during a trip and said that moment was the highest they&amp;#39;ve ever been on anything lol. My friend said he felt like he was living in a cartoon land lol. And yes, in your head it makes perfect sense, there just seems to be a disconnect between your acid brain and your mouth haha. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgcuwn7", "score_hidden": false, "stickied": false, "created": 1492419263.0, "created_utc": 1492390463.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu55w", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Chezdon", "parent_id": "t3_65rb92", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "Thanks for typing that out. It was a joy to read and hilarious. Brought back very vivid memories of some of my trips. The newness of the first few trips are something else. \n\nWhat PF were you listening to if you remember? \n\nI know what you mean about trying to articulate what you're feeling, but it's impossible. I remember smoking a spliff and going in to the next dimension and I started making up words to describe what was happening. Complete garbage was coming out of my mouth but it was so funny. Like, \"Womblegarblefumbledomblit\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for typing that out. It was a joy to read and hilarious. Brought back very vivid memories of some of my trips. The newness of the first few trips are something else. &lt;/p&gt;\n\n&lt;p&gt;What PF were you listening to if you remember? &lt;/p&gt;\n\n&lt;p&gt;I know what you mean about trying to articulate what you&amp;#39;re feeling, but it&amp;#39;s impossible. I remember smoking a spliff and going in to the next dimension and I started making up words to describe what was happening. Complete garbage was coming out of my mouth but it was so funny. Like, &amp;quot;Womblegarblefumbledomblit&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgcu55w", "score_hidden": false, "stickied": false, "created": 1492418242.0, "created_utc": 1492389442.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": "", "user_reports": [], "id": "dgdqaob", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EATTHEMUFFINBITCH", "parent_id": "t1_dgdacf4", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "Personally acid gives me the most energy in the world. During another trip my buds and I walked 40 blocks to get to a beach that took about an hour, and when we had come down and were ready to come back, we had to call an uber because our legs hurt so bad from walking there lol. \n\nSo this acid energy paired with the nervousness I was feeling from rapidly getting fucked in the ass by LSD for the first time made me feel like I needed to take a walk haha. Being in the house was vastly too overwhelming for me at that point. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally acid gives me the most energy in the world. During another trip my buds and I walked 40 blocks to get to a beach that took about an hour, and when we had come down and were ready to come back, we had to call an uber because our legs hurt so bad from walking there lol. &lt;/p&gt;\n\n&lt;p&gt;So this acid energy paired with the nervousness I was feeling from rapidly getting fucked in the ass by LSD for the first time made me feel like I needed to take a walk haha. Being in the house was vastly too overwhelming for me at that point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgdqaob", "score_hidden": false, "stickied": false, "created": 1492476124.0, "created_utc": 1492447324.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdacf4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TaloKrafar", "parent_id": "t3_65rb92", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "&gt; Slightly overwhelmed by the rapid onset of our trip we decided to take a walk outside of the house in the beautiful city. \n\nI'm always amazed at the different paths people take at certain crossroads. I would've just hit the couch and lost my mind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Slightly overwhelmed by the rapid onset of our trip we decided to take a walk outside of the house in the beautiful city. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m always amazed at the different paths people take at certain crossroads. I would&amp;#39;ve just hit the couch and lost my mind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgdacf4", "score_hidden": false, "stickied": false, "created": 1492447278.0, "created_utc": 1492418478.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": "", "user_reports": [], "id": "dgckdi3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CherryTea123", "parent_id": "t3_65rb92", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "Are you still tripping now o.O?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you still tripping now o.O?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgckdi3", "score_hidden": false, "stickied": false, "created": 1492405083.0, "created_utc": 1492376283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": "", "user_reports": [], "id": "dgd77l2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "peachisanut", "parent_id": "t3_65rb92", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "This was so awesome. Human beings and experiences like these are the reason I think people will live on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was so awesome. Human beings and experiences like these are the reason I think people will live on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgd77l2", "score_hidden": false, "stickied": false, "created": 1492438720.0, "created_utc": 1492409920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": "", "user_reports": [], "id": "dgcpvp3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EATTHEMUFFINBITCH", "parent_id": "t1_dgcpnrz", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "I fuckin love the Bay Area man, I've been to many places around the country and I wouldn't live anywhere else. Too bad it's so damn expensive lol. You should definitely take a trip sometime. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fuckin love the Bay Area man, I&amp;#39;ve been to many places around the country and I wouldn&amp;#39;t live anywhere else. Too bad it&amp;#39;s so damn expensive lol. You should definitely take a trip sometime. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgcpvp3", "score_hidden": false, "stickied": false, "created": 1492412439.0, "created_utc": 1492383639.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpnrz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "marko9173", "parent_id": "t3_65rb92", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "great story man, enjoyed reading it a lot. That's like the second san fran acid story in a few days that made me wanna visit so bad :D\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;great story man, enjoyed reading it a lot. That&amp;#39;s like the second san fran acid story in a few days that made me wanna visit so bad :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgcpnrz", "score_hidden": false, "stickied": false, "created": 1492412133.0, "created_utc": 1492383333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhvj", "removal_reason": null, "link_id": "t3_65rb92", "likes": null, "replies": "", "user_reports": [], "id": "dgd6cu4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ckinz16", "parent_id": "t3_65rb92", "subreddit_name_prefixed": "r/LSD", "controversiality": 0, "body": "Awesome. Such a classic trip. Very similar to what me and my friends do and how we do it hahaha. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome. Such a classic trip. Very similar to what me and my friends do and how we do it hahaha. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LSD", "name": "t1_dgd6cu4", "score_hidden": false, "stickied": false, "created": 1492436867.0, "created_utc": 1492408067.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]