[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s ironic how we sometimes blame situations for messing up our lives when in fact, they save us from terrible fate. When I had to stay back at the university for a group project and therefore miss out a sleepover at my friend’s place, I thought life couldn’t get any worse. But in the greater scheme of things, that assignment saved me from a horrible death.&lt;/p&gt;\n\n&lt;p&gt;This happened about eight months ago when I was at the University in my final year of undergrad. We are three sisters and I am the middle child. My father is a high-ranking police officer so we led a comfortable and privileged life. Despite the abundant opportunities to pile up fortunes as a police officer in Pakistan, my father somehow managed to remain honest and scale up the career ladder. The downside of this honesty was that he made many enemies including hardened criminals, senior police officers and even some politicians. Eventually, four years ago, he got posted out to a small town in Punjab and so began our new life. &lt;/p&gt;\n\n&lt;p&gt;Soon after moving to the town, my father appointed a driver-cum-guard for our family. He was a mature man, about 50 years old, average build and about three inches of greying beard. His real name was Sharif but we called him ‘Uncle’. Uncle never said much, which was convenient for us sisters, as he’d never tell our dad about our secret rendezvous with friends, after classes. Over the years, we developed an almost fatherly bond with Uncle. He’d drop me at the university in the morning and I’d call him at the end of lectures to pick me. &lt;/p&gt;\n\n&lt;p&gt;Life went on. My elder sister graduated med school. My little sister got into med school and I entered the final year of my mechanical engineering degree. Dad was usually late from work and always busy on phone. We weren’t allowed to attend the home landline or his cell for safety reasons. Our parents were very protective, which was a bit annoying because we didn’t get to hang out a lot with friends. &lt;/p&gt;\n\n&lt;p&gt;My best friend Sarah was getting married. We were a group of three girls – Sarah, Natasha (we called her ‘Nat’) and I –  and we were inseparable throughout the four years of university. Despite our busy work schedules due to approaching final exams and project submissions, Sarah decided to have a sleepover for the four of us before her wedding. We agreed, of course. All arrangements were made. It was decided that Nat would go with Sarah to her place after classes. As I finished late, I’d join them a couple of hours later and we’d watch girly movies and do all kinds of crazy stuff all night. I was excited because I hadn’t had this kind of fun in a long time. Honestly, there was very little anybody could do in this small town, not to mention my over-protective parents and the workload that comes with a degree like mechanical engineering. &lt;/p&gt;\n\n&lt;p&gt;At around 6:30 pm, Sarah and Nat texted me that they had reached Sarah’s place and were setting things up for the night. I texted back saying I was trying to finish as early as possible and be with them. Sarah joked that if I needed more time with Mister Jimmy, I could stay longer. Jimmy was a cute guy who played in the university football team. Sarah and Nat knew that I had a secret crush on him and would often tease me about it. He usually stayed back late after classes to practice his game with friends. I sent back angry emojies and promised retribution. &lt;/p&gt;\n\n&lt;p&gt;For our final year project, my team and I were working on an automatic solar powered mini-vehicle that would work within the campus. Everything was almost ready and we were putting together our final presentation, due in five days. We had decided to show a pre-recorded video demonstration of our project during the presentation so we could impress potential employers. We decided to do a test run before wrapping up for the day and if everything happened according to plan, we’d have the video ready by tomorrow. Aly, my project mate, started the test run. Miriam was taking notes. The mini-vehicle skidded across the empty university road with a buzzing sound that was amplified by the quietness of the night. Suddenly, as the vehicle made its programmed return to base, things went to hell. The car screeched. Aly desperately tried to abort the run but the vehicle toppled over and 80 percent of the project came undone. We stared at each other, horrified. A few moments ago, we were the favorites for the best project award and here we were staring at two years of hard work, gone in seconds. &lt;/p&gt;\n\n&lt;p&gt;“What now?”, Aly asked. &lt;/p&gt;\n\n&lt;p&gt;“I don’t know.”, I honestly replied. &lt;/p&gt;\n\n&lt;p&gt;After a pause, Aly suggested we go check it out. It seemed that the front wheel had come loose. Fortunately, the error was not in programming but the hardware, which was easier to fix. Without wasting any time, we started working on the fixes and lost all count of time. &lt;/p&gt;\n\n&lt;p&gt;The first call was at 8:00 pm from my dad, who was checking to make sure I had reached Sarah’s place. He had explicitly told Uncle to stay with me at the University until I finished and only come back once he had dropped me at Sarah’s home. I felt guilty for keeping him there since morning. I told my father about the whole ordeal. He wasn’t too happy with the idea of me working late at the university. After some convincing,  he agreed to let me work until 10:00 pm maximum, after which I was to return home and not go to Sarah’s place. He said he’d personally come to pick me on his way back from work. In my mind, I swore with every curse word I knew, before angrily hanging up. I proceeded to call up Sarah and Nat and let them know about the situation. They sympathized but sounded disappointed. I cursed my luck again and blamed my stars for ruining this only opportunity of fun in a long time. Little did I know that fate had just saved me from the worst nightmare I could possibly imagine, in my privileged and sheltered life. &lt;/p&gt;\n\n&lt;p&gt;Miriam however, did not get permission to work so late at the university. Usually, she would either go back with her mother who picked her up after work, or with me if we finished early, as her home was in the same neighborhood as mine. She was a shy little person but extremely sweet and caring towards others. Aly and I said goodbye to Miriam and she headed out. &lt;/p&gt;\n\n&lt;p&gt;“Don’t run off early tomorrow! Talk to your mom, so we can finish this nasty piece of extra work, okay?”, Aly called after her. &lt;/p&gt;\n\n&lt;p&gt;“I will.”, she promised and went out of the lab. &lt;/p&gt;\n\n&lt;p&gt;I went out with her to tell Uncle to go back home and apologize for keeping him waiting for so long. My father’s black sedan was the only car in the parking lot. Uncle was pacing in front of the car. He looked…aggravated? Nervous? When he spotted us, he immediately straightened and opened the car door. His expressions turned blank again as usual. While Uncle never spoke to any of us sisters loudly, I knew I had crossed the line of ethicality by keeping him waiting all day. I couldn’t even think of the right words to apologize. I started dumbly: &lt;/p&gt;\n\n&lt;p&gt;“Uncle, I’m so sorry I kept you waiting for so long. Really, we ran into some trouble with the project and I completely forgot you were still here.” &lt;/p&gt;\n\n&lt;p&gt;“It’s alright.”, he sounded impatient. Of course, he would be. He wanted to go home, eat and crash in bed. It wasn’t his project that had just crashed. A fresh wave of guilt washed over me as I continued:&lt;/p&gt;\n\n&lt;p&gt;“Umm... Uncle, I will have to stay a bit longer…”, I said, embarrassed to the core. He stared at me as if he would murder me. I hastily added:&lt;/p&gt;\n\n&lt;p&gt;“But you can go back. Daddy will come to pick me up when I’m done. I’m so sorry.”&lt;/p&gt;\n\n&lt;p&gt;“No, I stay. You finish your work. I will wait.”, Uncle said in a tone that conveyed finality. It sounded as if he was desperately trying to suppress the urge to strangle me. &lt;/p&gt;\n\n&lt;p&gt;I found it rather strange. I just told this man that his shift of labor is over and he is free to go back and do whatever he does after work, but he was insisting to stay with me. I chided myself for thinking this way about a man who was so loyal to my family. He probably didn’t want to bother my father and was willing to wait a few more hours to fulfill his responsibility. If there was a Guinness record for feeling guilty, I knew I was breaking it in that moment. \nMiriam was standing some distance away from us and talking to someone on the phone. She hanged up and started walking towards me looking a bit tense. &lt;/p&gt;\n\n&lt;p&gt;“Is something wrong, Miriam?”, I asked, concerned. &lt;/p&gt;\n\n&lt;p&gt;“Umm…actually I was wondering if you could drop me...”, she sounded embarrassed. &lt;/p&gt;\n\n&lt;p&gt;Miriam did not come from an affluent background. Her mother was a nurse at a local government hospital and her father had passed away 10 years ago. She had a younger brother in grade 7. Her mother was the only bread earner of the family. I understood how tough it was for her to manage everything alone. One of the reasons, I used to offer Miriam a ride home whenever I could, was to save her mom some time and money on picking her eldest daughter. Nonetheless, Miriam was a bright child, who aspired to be an air force engineer after graduation. Considering that she had already qualified psychological assessment and medical exams, I had no doubt that she’d make an outstanding air force engineer after her graduation later this year. So, I understood that her mother had suggested that Miriam come back home with me as she usually did. Her mom did not know that I was staying late and Miriam, being the sensitive and caring daughter that she was, had not told her mom, to save her the trouble. An idea came to my mind. I turned to Uncle and said:&lt;/p&gt;\n\n&lt;p&gt;“Uncle, could you please drop Miriam home on your way back? Daddy will pick me up later.”&lt;/p&gt;\n\n&lt;p&gt;Miriam looked at me hesitantly. She had always only travelled with Uncle when we were together. I gave a reassuring nod and she seemed to calm down considering that Uncle seemed non-threatening in his simple attire and white beard that gave him a Santa Claus like appearance. &lt;/p&gt;\n\n&lt;p&gt;Uncle seemed to contemplate the situation for a while. He looked at Miriam who was timidly standing next to me. After a long pause, he nodded tersely and motioned for Miriam to climb in the car. She thanked me and got in the backseat. &lt;/p&gt;\n\n&lt;p&gt;“See you tomorrow!”, I said, as the car sped off and she waved. &lt;/p&gt;\n\n&lt;p&gt;It was the last time she waved to anyone. &lt;/p&gt;\n\n&lt;p&gt;As promised, my dad had come to pick me in his official vehicle with his guards. On the way back, I had told him about the mess we landed in and how we had to stay back to fix it. I apologized for my mistreatment of Uncle and told him that I had sent him back. For some reason, I did not mention that Uncle had dropped Miriam on his way back. Perhaps, I considered it unnecessary information to share. We drove back in silence for the rest of the way. I got home around midnight. I hadn’t even reached my room when my phone rang. It was Miriam’s mom. She has probably called to thank me for giving Miriam a ride, I thought tiredly. I answered the phone and my life turned upside down. &lt;/p&gt;\n\n&lt;p&gt;Miriam’s mom was frantically asking if we had left and if Miriam was with me or not. I listened to her questions in stunned silence. It had been two hours since Uncle had left with Miriam and it usually took 30 minutes in heavy traffic to reach her place. At this time, it should have taken only 20 minutes for Miriam to be home. I ran to the living room and called out for my mom. &lt;/p&gt;\n\n&lt;p&gt;“Mom! Has Uncle returned? Where is he?”, I asked, breathless. &lt;/p&gt;\n\n&lt;p&gt;“What are you taking about, girl? He was with you, wasn’t he?”, my mother eyed me in disbelief. &lt;/p&gt;\n\n&lt;p&gt;I felt my stomach dropping into a bottomless pit. &lt;/p&gt;\n\n&lt;p&gt;“Honey, are you alright?”, I vaguely registered my mother’s concerned voice. Dad had joined her in the living room at some point. &lt;/p&gt;\n\n&lt;p&gt;“Dad… Miriam… she didn’t reach home. I think Uncle and Miriam had an accident. Please dad, check. Please.” I was crying now. Panic was eating at my insides. &lt;/p&gt;\n\n&lt;p&gt;“Calm down, Zoya! Tell me what happened. What about Miriam? Tell me everything.”, Dad held me from my arms and sat me on a sofa. &lt;/p&gt;\n\n&lt;p&gt;I regretfully quoted the incidents of the previous hours. \nInstantly, he was on the phone. Within five minutes, the police were looking for our black sedan. That was the most difficult night for our family. Miriam’s mother rushed to our house. She was half mad with grief and I could only imagine the horror she was going through. All night the police searched for the vehicle. There was no clue. There was no sign of an accident along any route from university to Miriam’s home. It was as if the earth had swallowed the car and its occupants. &lt;/p&gt;\n\n&lt;p&gt;The night turned to day and the day turned to another night. The wailing and weeping had stopped and a deadly calm had taken over our living room. Miriam’s mom was huddled in a corner, eyes closed, lips silently reciting prayers. Her 12-year-old son held her hand and looked ghostly white. My sisters were sitting on one of the sofas, tears trickling down their faces. It was like a silence before the storm. A storm that was about to destroy our lives forever. &lt;/p&gt;\n\n&lt;p&gt;Father entered the room. I had never seen that look on his face before tonight. His features were set hard and a nerve in his temple was ticking. &lt;/p&gt;\n\n&lt;p&gt;“Mrs. Sher, can we talk in private?”, my dad said in a low tone. &lt;/p&gt;\n\n&lt;p&gt;Miriam’s mother came out of her trance and sprang up. She followed my father to the side room. I couldn’t contain it anymore and ran to the wall. I pressed my ear against it and listened. I wish I hadn’t. &lt;/p&gt;\n\n&lt;p&gt;“Mrs. Sher, the police found the car near an abandoned factory 20 miles from the town. We believe that the factory was the base of a human trafficking crime group. The police caught a member of the group who told us that the driver had sold Miriam to this group and vanished. Miriam’s body was found cut in pieces and dumped in the bushes behind the factory. When she refused to cooperate with the abductors, they raped her repeatedly. She suffered critical injuries and became useless to the traffickers. So, they shot her, cut her and disposed of her body before packing and leaving. The police are on the hunt for this group. We will do everything in our power to find them.”&lt;/p&gt;\n\n&lt;p&gt;What followed were the most horrible screams of agony I’ve ever heard. To this day, Mrs. Sher’s screams haunt me in my nightmares. She cursed us for the horrific death of her daughter. On complaint of Mrs. Sher, an investigation was launched against my father by the police and he remained suspended until the investigation was complete. Although my father was cleared of any involvement in the abduction, rape and murder of Miriam Sher, his reputation suffered greatly. The media reported the incident and highlighted that his car was found at the site. My mother and sisters wept for months. My younger sister started suffering from sleeping and eating disorders. Father fired the cook, the maid and the gardener. &lt;/p&gt;\n\n&lt;p&gt;I withdrew from everyone. I refused to answer calls, even Sarah’s and Nat’s calls and messages. I have no idea how I managed to sit the exams but performed poorly and failed two courses. Everyone at the university looked at me strangely and I lost almost all friends. Some girls would openly taunt me or whisper where I could clearly hear them. &lt;/p&gt;\n\n&lt;p&gt;“Hey look! There she is. I think her dad was involved in this. I bet he took a lot of money from the kidnappers for Miriam.”&lt;/p&gt;\n\n&lt;p&gt;“I think she was always jealous of Miriam, because she scored better than her and was prettier. So, she and her driver sold her off. She is pathetic.” &lt;/p&gt;\n\n&lt;p&gt;The depression was so extreme that I started having suicidal thoughts. I was to blame. If I hadn’t told Miriam to go with Uncle that night, she’d still be here. If I had not offered her to go back with my driver, she would have waited for her mother. &lt;/p&gt;\n\n&lt;p&gt;Eight months have gone by and the police have neither caught the human traffickers nor the driver. Uncle’s family knew nothing of his whereabouts. &lt;/p&gt;\n\n&lt;p&gt;Last evening, I was back home early. My father’s car was already parked in the garage, which meant he was home too. I absentmindedly started climbing the stairs to my room when I overheard part of the conversation between my mom and dad, in their room. &lt;/p&gt;\n\n&lt;p&gt;“He was not after Miriam. He wanted Zoya.”, my father was saying. &lt;/p&gt;\n\n&lt;p&gt;“What do you mean?”, my mother sounded shocked. &lt;/p&gt;\n\n&lt;p&gt;“Sharif’s real name was Fazal. Four years ago, I arrested Fazal’s brother for murdering his wife and kids. Fazal was taking his brother’s revenge, from me. He planned to sell Zoya to the traffickers and use that money to bribe the police to let his bother go. He had already talked to his police ‘contact’ at the jail where his brother was held. Two days ago, we caught this contact and I found out about Fazal. There was a wolf among us all this time and I didn’t know. What kind of a father am I?” my father was completely broken. &lt;/p&gt;\n\n&lt;p&gt;“But, it doesn’t make sense. If he had come for revenge, why did he serve you so loyally for three years? Why plan it that night?” my mom asked. &lt;/p&gt;\n\n&lt;p&gt;“Because, I had a tracker on the car. I always knew the exact location of the car. Even when our daughters thought they were smart and that I didn’t know about their little adventures, I was following their every move. Fazal didn’t know about the tracker but would come back and tell me every detail, word to word. I began trusting him.&lt;/p&gt;\n\n&lt;p&gt;“Do you remember that I never let him take the car for maintenance? I either took it myself or went with him. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;When he had won my trust, a week before the night, I let him do it for the first time. I checked for the tracker after he brought the car back and it was there. &lt;/p&gt;\n\n&lt;p&gt;“My guess is, Fazal had probably learnt about the tracker long ago and hadn’t taken it off. Waiting for the right moment to violate my trust. That night, we found the tracker in Zoya’s University car park. He planned to sell her that night and vanish.&lt;/p&gt;\n\n&lt;p&gt;“When he knew that he couldn’t have Zoya that night and I’d find out he tampered with the tracker, he took the second best bet he could get. He sold Miriam and freed his brother. Now there are two of them out there, waiting for revenge on my family. I brought this on you all. Miriam became the collateral damage in this war for revenge, but the real target is my family. I need to catch these bastards before they harm anyone again. I won’t let them hurt any of you.” &lt;/p&gt;\n\n&lt;p&gt;I didn’t hear the rest. I ran to my room, fell on the bed and cried. He wanted me. My innocent friend died for me. And this wasn’t over. He will come back. The nightmare has just begun. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/650vvl/they_are_stalking_me_now/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It’s ironic how we sometimes blame situations for messing up our lives when in fact, they save us from terrible fate. When I had to stay back at the university for a group project and therefore miss out a sleepover at my friend’s place, I thought life couldn’t get any worse. But in the greater scheme of things, that assignment saved me from a horrible death.\n \nThis happened about eight months ago when I was at the University in my final year of undergrad. We are three sisters and I am the middle child. My father is a high-ranking police officer so we led a comfortable and privileged life. Despite the abundant opportunities to pile up fortunes as a police officer in Pakistan, my father somehow managed to remain honest and scale up the career ladder. The downside of this honesty was that he made many enemies including hardened criminals, senior police officers and even some politicians. Eventually, four years ago, he got posted out to a small town in Punjab and so began our new life. \n\nSoon after moving to the town, my father appointed a driver-cum-guard for our family. He was a mature man, about 50 years old, average build and about three inches of greying beard. His real name was Sharif but we called him ‘Uncle’. Uncle never said much, which was convenient for us sisters, as he’d never tell our dad about our secret rendezvous with friends, after classes. Over the years, we developed an almost fatherly bond with Uncle. He’d drop me at the university in the morning and I’d call him at the end of lectures to pick me. \n\nLife went on. My elder sister graduated med school. My little sister got into med school and I entered the final year of my mechanical engineering degree. Dad was usually late from work and always busy on phone. We weren’t allowed to attend the home landline or his cell for safety reasons. Our parents were very protective, which was a bit annoying because we didn’t get to hang out a lot with friends. \n\nMy best friend Sarah was getting married. We were a group of three girls – Sarah, Natasha (we called her ‘Nat’) and I –  and we were inseparable throughout the four years of university. Despite our busy work schedules due to approaching final exams and project submissions, Sarah decided to have a sleepover for the four of us before her wedding. We agreed, of course. All arrangements were made. It was decided that Nat would go with Sarah to her place after classes. As I finished late, I’d join them a couple of hours later and we’d watch girly movies and do all kinds of crazy stuff all night. I was excited because I hadn’t had this kind of fun in a long time. Honestly, there was very little anybody could do in this small town, not to mention my over-protective parents and the workload that comes with a degree like mechanical engineering. \n\nAt around 6:30 pm, Sarah and Nat texted me that they had reached Sarah’s place and were setting things up for the night. I texted back saying I was trying to finish as early as possible and be with them. Sarah joked that if I needed more time with Mister Jimmy, I could stay longer. Jimmy was a cute guy who played in the university football team. Sarah and Nat knew that I had a secret crush on him and would often tease me about it. He usually stayed back late after classes to practice his game with friends. I sent back angry emojies and promised retribution. \n\nFor our final year project, my team and I were working on an automatic solar powered mini-vehicle that would work within the campus. Everything was almost ready and we were putting together our final presentation, due in five days. We had decided to show a pre-recorded video demonstration of our project during the presentation so we could impress potential employers. We decided to do a test run before wrapping up for the day and if everything happened according to plan, we’d have the video ready by tomorrow. Aly, my project mate, started the test run. Miriam was taking notes. The mini-vehicle skidded across the empty university road with a buzzing sound that was amplified by the quietness of the night. Suddenly, as the vehicle made its programmed return to base, things went to hell. The car screeched. Aly desperately tried to abort the run but the vehicle toppled over and 80 percent of the project came undone. We stared at each other, horrified. A few moments ago, we were the favorites for the best project award and here we were staring at two years of hard work, gone in seconds. \n\n“What now?”, Aly asked. \n\n“I don’t know.”, I honestly replied. \n\nAfter a pause, Aly suggested we go check it out. It seemed that the front wheel had come loose. Fortunately, the error was not in programming but the hardware, which was easier to fix. Without wasting any time, we started working on the fixes and lost all count of time. \n\nThe first call was at 8:00 pm from my dad, who was checking to make sure I had reached Sarah’s place. He had explicitly told Uncle to stay with me at the University until I finished and only come back once he had dropped me at Sarah’s home. I felt guilty for keeping him there since morning. I told my father about the whole ordeal. He wasn’t too happy with the idea of me working late at the university. After some convincing,  he agreed to let me work until 10:00 pm maximum, after which I was to return home and not go to Sarah’s place. He said he’d personally come to pick me on his way back from work. In my mind, I swore with every curse word I knew, before angrily hanging up. I proceeded to call up Sarah and Nat and let them know about the situation. They sympathized but sounded disappointed. I cursed my luck again and blamed my stars for ruining this only opportunity of fun in a long time. Little did I know that fate had just saved me from the worst nightmare I could possibly imagine, in my privileged and sheltered life. \n\nMiriam however, did not get permission to work so late at the university. Usually, she would either go back with her mother who picked her up after work, or with me if we finished early, as her home was in the same neighborhood as mine. She was a shy little person but extremely sweet and caring towards others. Aly and I said goodbye to Miriam and she headed out. \n\n“Don’t run off early tomorrow! Talk to your mom, so we can finish this nasty piece of extra work, okay?”, Aly called after her. \n\n“I will.”, she promised and went out of the lab. \n\nI went out with her to tell Uncle to go back home and apologize for keeping him waiting for so long. My father’s black sedan was the only car in the parking lot. Uncle was pacing in front of the car. He looked…aggravated? Nervous? When he spotted us, he immediately straightened and opened the car door. His expressions turned blank again as usual. While Uncle never spoke to any of us sisters loudly, I knew I had crossed the line of ethicality by keeping him waiting all day. I couldn’t even think of the right words to apologize. I started dumbly: \n\n“Uncle, I’m so sorry I kept you waiting for so long. Really, we ran into some trouble with the project and I completely forgot you were still here.” \n\n“It’s alright.”, he sounded impatient. Of course, he would be. He wanted to go home, eat and crash in bed. It wasn’t his project that had just crashed. A fresh wave of guilt washed over me as I continued:\n\n“Umm... Uncle, I will have to stay a bit longer…”, I said, embarrassed to the core. He stared at me as if he would murder me. I hastily added:\n\n“But you can go back. Daddy will come to pick me up when I’m done. I’m so sorry.”\n\n“No, I stay. You finish your work. I will wait.”, Uncle said in a tone that conveyed finality. It sounded as if he was desperately trying to suppress the urge to strangle me. \n\nI found it rather strange. I just told this man that his shift of labor is over and he is free to go back and do whatever he does after work, but he was insisting to stay with me. I chided myself for thinking this way about a man who was so loyal to my family. He probably didn’t want to bother my father and was willing to wait a few more hours to fulfill his responsibility. If there was a Guinness record for feeling guilty, I knew I was breaking it in that moment. \nMiriam was standing some distance away from us and talking to someone on the phone. She hanged up and started walking towards me looking a bit tense. \n\n“Is something wrong, Miriam?”, I asked, concerned. \n\n“Umm…actually I was wondering if you could drop me...”, she sounded embarrassed. \n\nMiriam did not come from an affluent background. Her mother was a nurse at a local government hospital and her father had passed away 10 years ago. She had a younger brother in grade 7. Her mother was the only bread earner of the family. I understood how tough it was for her to manage everything alone. One of the reasons, I used to offer Miriam a ride home whenever I could, was to save her mom some time and money on picking her eldest daughter. Nonetheless, Miriam was a bright child, who aspired to be an air force engineer after graduation. Considering that she had already qualified psychological assessment and medical exams, I had no doubt that she’d make an outstanding air force engineer after her graduation later this year. So, I understood that her mother had suggested that Miriam come back home with me as she usually did. Her mom did not know that I was staying late and Miriam, being the sensitive and caring daughter that she was, had not told her mom, to save her the trouble. An idea came to my mind. I turned to Uncle and said:\n\n“Uncle, could you please drop Miriam home on your way back? Daddy will pick me up later.”\n\nMiriam looked at me hesitantly. She had always only travelled with Uncle when we were together. I gave a reassuring nod and she seemed to calm down considering that Uncle seemed non-threatening in his simple attire and white beard that gave him a Santa Claus like appearance. \n\nUncle seemed to contemplate the situation for a while. He looked at Miriam who was timidly standing next to me. After a long pause, he nodded tersely and motioned for Miriam to climb in the car. She thanked me and got in the backseat. \n\n“See you tomorrow!”, I said, as the car sped off and she waved. \n\nIt was the last time she waved to anyone. \n\nAs promised, my dad had come to pick me in his official vehicle with his guards. On the way back, I had told him about the mess we landed in and how we had to stay back to fix it. I apologized for my mistreatment of Uncle and told him that I had sent him back. For some reason, I did not mention that Uncle had dropped Miriam on his way back. Perhaps, I considered it unnecessary information to share. We drove back in silence for the rest of the way. I got home around midnight. I hadn’t even reached my room when my phone rang. It was Miriam’s mom. She has probably called to thank me for giving Miriam a ride, I thought tiredly. I answered the phone and my life turned upside down. \n\nMiriam’s mom was frantically asking if we had left and if Miriam was with me or not. I listened to her questions in stunned silence. It had been two hours since Uncle had left with Miriam and it usually took 30 minutes in heavy traffic to reach her place. At this time, it should have taken only 20 minutes for Miriam to be home. I ran to the living room and called out for my mom. \n\n“Mom! Has Uncle returned? Where is he?”, I asked, breathless. \n\n“What are you taking about, girl? He was with you, wasn’t he?”, my mother eyed me in disbelief. \n\nI felt my stomach dropping into a bottomless pit. \n\n“Honey, are you alright?”, I vaguely registered my mother’s concerned voice. Dad had joined her in the living room at some point. \n\n“Dad… Miriam… she didn’t reach home. I think Uncle and Miriam had an accident. Please dad, check. Please.” I was crying now. Panic was eating at my insides. \n\n“Calm down, Zoya! Tell me what happened. What about Miriam? Tell me everything.”, Dad held me from my arms and sat me on a sofa. \n\nI regretfully quoted the incidents of the previous hours. \nInstantly, he was on the phone. Within five minutes, the police were looking for our black sedan. That was the most difficult night for our family. Miriam’s mother rushed to our house. She was half mad with grief and I could only imagine the horror she was going through. All night the police searched for the vehicle. There was no clue. There was no sign of an accident along any route from university to Miriam’s home. It was as if the earth had swallowed the car and its occupants. \n\nThe night turned to day and the day turned to another night. The wailing and weeping had stopped and a deadly calm had taken over our living room. Miriam’s mom was huddled in a corner, eyes closed, lips silently reciting prayers. Her 12-year-old son held her hand and looked ghostly white. My sisters were sitting on one of the sofas, tears trickling down their faces. It was like a silence before the storm. A storm that was about to destroy our lives forever. \n\nFather entered the room. I had never seen that look on his face before tonight. His features were set hard and a nerve in his temple was ticking. \n\n“Mrs. Sher, can we talk in private?”, my dad said in a low tone. \n\nMiriam’s mother came out of her trance and sprang up. She followed my father to the side room. I couldn’t contain it anymore and ran to the wall. I pressed my ear against it and listened. I wish I hadn’t. \n\n“Mrs. Sher, the police found the car near an abandoned factory 20 miles from the town. We believe that the factory was the base of a human trafficking crime group. The police caught a member of the group who told us that the driver had sold Miriam to this group and vanished. Miriam’s body was found cut in pieces and dumped in the bushes behind the factory. When she refused to cooperate with the abductors, they raped her repeatedly. She suffered critical injuries and became useless to the traffickers. So, they shot her, cut her and disposed of her body before packing and leaving. The police are on the hunt for this group. We will do everything in our power to find them.”\n\nWhat followed were the most horrible screams of agony I’ve ever heard. To this day, Mrs. Sher’s screams haunt me in my nightmares. She cursed us for the horrific death of her daughter. On complaint of Mrs. Sher, an investigation was launched against my father by the police and he remained suspended until the investigation was complete. Although my father was cleared of any involvement in the abduction, rape and murder of Miriam Sher, his reputation suffered greatly. The media reported the incident and highlighted that his car was found at the site. My mother and sisters wept for months. My younger sister started suffering from sleeping and eating disorders. Father fired the cook, the maid and the gardener. \n\nI withdrew from everyone. I refused to answer calls, even Sarah’s and Nat’s calls and messages. I have no idea how I managed to sit the exams but performed poorly and failed two courses. Everyone at the university looked at me strangely and I lost almost all friends. Some girls would openly taunt me or whisper where I could clearly hear them. \n\n“Hey look! There she is. I think her dad was involved in this. I bet he took a lot of money from the kidnappers for Miriam.”\n\n“I think she was always jealous of Miriam, because she scored better than her and was prettier. So, she and her driver sold her off. She is pathetic.” \n\nThe depression was so extreme that I started having suicidal thoughts. I was to blame. If I hadn’t told Miriam to go with Uncle that night, she’d still be here. If I had not offered her to go back with my driver, she would have waited for her mother. \n\n\nEight months have gone by and the police have neither caught the human traffickers nor the driver. Uncle’s family knew nothing of his whereabouts. \n\nLast evening, I was back home early. My father’s car was already parked in the garage, which meant he was home too. I absentmindedly started climbing the stairs to my room when I overheard part of the conversation between my mom and dad, in their room. \n\n“He was not after Miriam. He wanted Zoya.”, my father was saying. \n\n“What do you mean?”, my mother sounded shocked. \n\n“Sharif’s real name was Fazal. Four years ago, I arrested Fazal’s brother for murdering his wife and kids. Fazal was taking his brother’s revenge, from me. He planned to sell Zoya to the traffickers and use that money to bribe the police to let his bother go. He had already talked to his police ‘contact’ at the jail where his brother was held. Two days ago, we caught this contact and I found out about Fazal. There was a wolf among us all this time and I didn’t know. What kind of a father am I?” my father was completely broken. \n\n“But, it doesn’t make sense. If he had come for revenge, why did he serve you so loyally for three years? Why plan it that night?” my mom asked. \n\n“Because, I had a tracker on the car. I always knew the exact location of the car. Even when our daughters thought they were smart and that I didn’t know about their little adventures, I was following their every move. Fazal didn’t know about the tracker but would come back and tell me every detail, word to word. I began trusting him.\n\n“Do you remember that I never let him take the car for maintenance? I either took it myself or went with him. \n\n\"When he had won my trust, a week before the night, I let him do it for the first time. I checked for the tracker after he brought the car back and it was there. \n\n“My guess is, Fazal had probably learnt about the tracker long ago and hadn’t taken it off. Waiting for the right moment to violate my trust. That night, we found the tracker in Zoya’s University car park. He planned to sell her that night and vanish.\n\n“When he knew that he couldn’t have Zoya that night and I’d find out he tampered with the tracker, he took the second best bet he could get. He sold Miriam and freed his brother. Now there are two of them out there, waiting for revenge on my family. I brought this on you all. Miriam became the collateral damage in this war for revenge, but the real target is my family. I need to catch these bastards before they harm anyone again. I won’t let them hurt any of you.” \n\nI didn’t hear the rest. I ran to my room, fell on the bed and cried. He wanted me. My innocent friend died for me. And this wasn’t over. He will come back. The nightmare has just begun. \n\n[Part 2](https://www.reddit.com/r/nosleep/comments/650vvl/they_are_stalking_me_now/)\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "64m9dk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 358, "report_reasons": null, "author": "Arakiss", "saved": false, "mod_reports": [], "name": "t3_64m9dk", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": true, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492030001.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64m9dk/a_latenight_assignment_saved_me_from_horrible/", "num_reports": null, "locked": false, "stickied": false, "created": 1491886002.0, "url": "https://www.reddit.com/r/nosleep/comments/64m9dk/a_latenight_assignment_saved_me_from_horrible/", "author_flair_text": null, "quarantine": false, "title": "A late-night assignment saved me from horrible death", "created_utc": 1491857202.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 358}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg4k9ma", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Sayquam", "parent_id": "t1_dg47olq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "No", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4k9ma", "score_hidden": false, "stickied": false, "created": 1491959303.0, "created_utc": 1491930503.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47olq", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "RainMaker323", "parent_id": "t1_dg43t6t", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You wouldn't by chance believe that I've made a typo? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You wouldn&amp;#39;t by chance believe that I&amp;#39;ve made a typo? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg47olq", "score_hidden": false, "stickied": false, "created": 1491944333.0, "created_utc": 1491915533.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43t6t", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Khaos_Demon", "parent_id": "t1_dg3oe1a", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Kebap is Turkish and kebab is Indian/Pakistani.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kebap is Turkish and kebab is Indian/Pakistani.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg43t6t", "score_hidden": false, "stickied": false, "created": 1491936577.0, "created_utc": 1491907777.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg3w3oh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "musicissweeter", "parent_id": "t1_dg3oe1a", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"I don't know who you are but you'll make fine sheesh kebab.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I don&amp;#39;t know who you are but you&amp;#39;ll make fine sheesh kebab.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3w3oh", "score_hidden": false, "stickied": false, "created": 1491916013.0, "created_utc": 1491887213.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3oe1a", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "RainMaker323", "parent_id": "t1_dg3gbz2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"I will find you - and I will kebap you.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I will find you - and I will kebap you.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3oe1a", "score_hidden": false, "stickied": false, "created": 1491904962.0, "created_utc": 1491876162.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg3qdnj", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Arakiss", "parent_id": "t1_dg3gbz2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I don't know. Things are rapidly going south. They are stalking me and my family. It's been two months since I've been receiving messages from them but they are getting much worse and scarier. They threatened me not to tell my dad but I think I have no other choice now. Will update soon, if I stay alive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know. Things are rapidly going south. They are stalking me and my family. It&amp;#39;s been two months since I&amp;#39;ve been receiving messages from them but they are getting much worse and scarier. They threatened me not to tell my dad but I think I have no other choice now. Will update soon, if I stay alive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3qdnj", "score_hidden": false, "stickied": false, "created": 1491907327.0, "created_utc": 1491878527.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3gbz2", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "Oppiken", "parent_id": "t3_64m9dk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Goddamn, OP. I hope you stay safe. Your dad sounds like the Pakistani version of Liam Neelson. I hope he catches the bastards. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Goddamn, OP. I hope you stay safe. Your dad sounds like the Pakistani version of Liam Neelson. I hope he catches the bastards. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3gbz2", "score_hidden": false, "stickied": false, "created": 1491894761.0, "created_utc": 1491865961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg3hodr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pyroroze", "parent_id": "t3_64m9dk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "OMG, I hope you all stay safe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OMG, I hope you all stay safe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3hodr", "score_hidden": false, "stickied": false, "created": 1491896544.0, "created_utc": 1491867744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg4nlms", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "keeperofnames", "parent_id": "t1_dg4msie", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Some places of worship require you to wear full length pants and cover your head (tying a cotton kerchief on your head works). Other than that you're good. Be on the lookout for pickpockets in crowded areas, and follow the usual drill you do in your home country or any tourist place to avoid getting mugged. And don't fall for people trying to help you with currency exchange and stuff. You'll pick up the local vibe pretty quickly. Ask the uni where you're going, to arrange for pickup or a guide the first time you arrive (to reach campus from the airport). And use their accounts office for all financial advice. People in Punjab are famously hospitable, I hope you have a wonderful stay :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some places of worship require you to wear full length pants and cover your head (tying a cotton kerchief on your head works). Other than that you&amp;#39;re good. Be on the lookout for pickpockets in crowded areas, and follow the usual drill you do in your home country or any tourist place to avoid getting mugged. And don&amp;#39;t fall for people trying to help you with currency exchange and stuff. You&amp;#39;ll pick up the local vibe pretty quickly. Ask the uni where you&amp;#39;re going, to arrange for pickup or a guide the first time you arrive (to reach campus from the airport). And use their accounts office for all financial advice. People in Punjab are famously hospitable, I hope you have a wonderful stay :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4nlms", "score_hidden": false, "stickied": false, "created": 1491962950.0, "created_utc": 1491934150.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4msie", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hindrik1997", "parent_id": "t1_dg4lvyp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I am male, is there any special clothing that is really not okay for males over there?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am male, is there any special clothing that is really not okay for males over there?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4msie", "score_hidden": false, "stickied": false, "created": 1491962060.0, "created_utc": 1491933260.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4lvyp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "keeperofnames", "parent_id": "t1_dg4iyz9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "India and Pakistan both have a Punjab province. OP is in Pakistani Punjab. You're going to Indian Punjab. They are two different places. If you're going to a campus, should be fine. Be careful of your surroundings and don't travel alone after dark in areas you don't know well. Don't get into unmarked cabs or other means of public transport. The basic drill. Only extra thing you might want to take care of is attire. So if you're headed to some remote area far from the big cities like Chandigarh, you might want to dress in more local clothing like salwar-kameez (if you're a girl).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;India and Pakistan both have a Punjab province. OP is in Pakistani Punjab. You&amp;#39;re going to Indian Punjab. They are two different places. If you&amp;#39;re going to a campus, should be fine. Be careful of your surroundings and don&amp;#39;t travel alone after dark in areas you don&amp;#39;t know well. Don&amp;#39;t get into unmarked cabs or other means of public transport. The basic drill. Only extra thing you might want to take care of is attire. So if you&amp;#39;re headed to some remote area far from the big cities like Chandigarh, you might want to dress in more local clothing like salwar-kameez (if you&amp;#39;re a girl).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4lvyp", "score_hidden": false, "stickied": false, "created": 1491961073.0, "created_utc": 1491932273.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg5lw8n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "heartfelt24", "parent_id": "t1_dg4iyz9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "indian punjab is smaller and sparsely populated. it is quite safe. Just don't get into fights and you will be fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;indian punjab is smaller and sparsely populated. it is quite safe. Just don&amp;#39;t get into fights and you will be fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5lw8n", "score_hidden": false, "stickied": false, "created": 1492011140.0, "created_utc": 1491982340.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg7w8a5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hindrik1997", "parent_id": "t1_dg7b9rc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7w8a5", "score_hidden": false, "stickied": false, "created": 1492133363.0, "created_utc": 1492104563.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b9rc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "musicissweeter", "parent_id": "t1_dg4iyz9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "My god, don't get scared. You're travelling to India...this is a civilized democratic nation you are talking about, one that has a history of being attacked and conquered and looted over and over in history because of their notoriously peaceful people who majorly invested their interests in spirituality,academics and inventions rather than expanding empires. Chill. Besides, you are going to *India* and not *Pakistan*, both of which have a Punjab province. I can tell you only about the Indian Punjab and the demographic consists mostly of Sikhs and Hindus (you could read up about the religions over net if you'd want some peace of mind), Punjabis are famous for their hospitality,food and boisterousness, so like someone said, don't start a fight and you should come back all right! Bon voyage!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My god, don&amp;#39;t get scared. You&amp;#39;re travelling to India...this is a civilized democratic nation you are talking about, one that has a history of being attacked and conquered and looted over and over in history because of their notoriously peaceful people who majorly invested their interests in spirituality,academics and inventions rather than expanding empires. Chill. Besides, you are going to &lt;em&gt;India&lt;/em&gt; and not &lt;em&gt;Pakistan&lt;/em&gt;, both of which have a Punjab province. I can tell you only about the Indian Punjab and the demographic consists mostly of Sikhs and Hindus (you could read up about the religions over net if you&amp;#39;d want some peace of mind), Punjabis are famous for their hospitality,food and boisterousness, so like someone said, don&amp;#39;t start a fight and you should come back all right! Bon voyage!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7b9rc", "score_hidden": false, "stickied": false, "created": 1492100485.0, "created_utc": 1492071685.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iyz9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Hindrik1997", "parent_id": "t3_64m9dk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Whoa, I read the word Punjab, that's where I am going in a few weeks. First time India. I am really looking forward to it, but I hope it isn't gonna be as bad as in your story. How bad is it over there?\n\nEDIT: As I'm reading this, you are on a campus I see? Well, that's where we are going too! It's a sort of exchange program. What campus are you on? It could be the same, that'd be pretty funny.\n\nEDIT2:\nWow, just wow... Now I finished this story... I seriously start to have some doubts...\n", "edited": 1491930145.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whoa, I read the word Punjab, that&amp;#39;s where I am going in a few weeks. First time India. I am really looking forward to it, but I hope it isn&amp;#39;t gonna be as bad as in your story. How bad is it over there?&lt;/p&gt;\n\n&lt;p&gt;EDIT: As I&amp;#39;m reading this, you are on a campus I see? Well, that&amp;#39;s where we are going too! It&amp;#39;s a sort of exchange program. What campus are you on? It could be the same, that&amp;#39;d be pretty funny.&lt;/p&gt;\n\n&lt;p&gt;EDIT2:\nWow, just wow... Now I finished this story... I seriously start to have some doubts...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4iyz9", "score_hidden": false, "stickied": false, "created": 1491957898.0, "created_utc": 1491929098.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg41mw6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aubsessivecompulsive", "parent_id": "t1_dg3mymc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "(Sorry, I don't know how to comment unless it's in reply to someone else's comment) This story is an especially sad read for me. Human trafficking is a HUGE issue that I feel very strongly about; something that's not addressed nearly as much as it should be considering how prevalent it is in so many countries.  Reading tales like this always makes me cry. \nOP, I sincerely hope you stay safe and that no one lays a finger on you or your family. I understand you feel bad about your friend, but it's NOT your fault. It's the fault of every dirty scum bag a**hole who exploited and abused and hurt your friend... it just makes me very sad and angry to think that the same guys who did that to her are still out there and are STILL  exploiting other innocent girls.\nBest of luck to you and your family's safety and well being. I will make sure to send positive thoughts your way in hopes it will somehow help to protect you and yours.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Sorry, I don&amp;#39;t know how to comment unless it&amp;#39;s in reply to someone else&amp;#39;s comment) This story is an especially sad read for me. Human trafficking is a HUGE issue that I feel very strongly about; something that&amp;#39;s not addressed nearly as much as it should be considering how prevalent it is in so many countries.  Reading tales like this always makes me cry. \nOP, I sincerely hope you stay safe and that no one lays a finger on you or your family. I understand you feel bad about your friend, but it&amp;#39;s NOT your fault. It&amp;#39;s the fault of every dirty scum bag a**hole who exploited and abused and hurt your friend... it just makes me very sad and angry to think that the same guys who did that to her are still out there and are STILL  exploiting other innocent girls.\nBest of luck to you and your family&amp;#39;s safety and well being. I will make sure to send positive thoughts your way in hopes it will somehow help to protect you and yours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg41mw6", "score_hidden": false, "stickied": false, "created": 1491929976.0, "created_utc": 1491901176.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3mymc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Nightmusicnonstop", "parent_id": "t3_64m9dk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Loved this!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Loved this!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3mymc", "score_hidden": false, "stickied": false, "created": 1491903223.0, "created_utc": 1491874423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg3g2dd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Krystalmichele1", "parent_id": "t1_dg3dgo0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It was a week before the night of the murder that he took it in, not a week from the conversation her father was having. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was a week before the night of the murder that he took it in, not a week from the conversation her father was having. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3g2dd", "score_hidden": false, "stickied": false, "created": 1491894413.0, "created_utc": 1491865613.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg3etcy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Arakiss", "parent_id": "t1_dg3dgo0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "A week before the night Miriam was kidnapped. Corrected.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A week before the night Miriam was kidnapped. Corrected.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3etcy", "score_hidden": false, "stickied": false, "created": 1491892811.0, "created_utc": 1491864011.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3dgo0", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "2quickdraw", "parent_id": "t3_64m9dk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Good story! I'm confused though. It's been eight or nine months since the incident,  but the driver who disappeared had access to the car a week ago? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good story! I&amp;#39;m confused though. It&amp;#39;s been eight or nine months since the incident,  but the driver who disappeared had access to the car a week ago? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3dgo0", "score_hidden": false, "stickied": false, "created": 1491891109.0, "created_utc": 1491862309.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64m9dk", "likes": null, "replies": "", "user_reports": [], "id": "dg6l0xl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arakiss", "parent_id": "t1_dg6hfli", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ah, yes. I measure height in in/ft and run a mile a day. So, it's sometimes easier for me to approximate length in in/ft/miles. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, yes. I measure height in in/ft and run a mile a day. So, it&amp;#39;s sometimes easier for me to approximate length in in/ft/miles. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6l0xl", "score_hidden": false, "stickied": false, "created": 1492060860.0, "created_utc": 1492032060.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hfli", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imhotep4", "parent_id": "t1_dg6h186", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "so the metric system? yeah, most of the world does, too, but i was just wondering why you used inches and miles in the post. not an issue at all, just a minor detail that's bugging me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;so the metric system? yeah, most of the world does, too, but i was just wondering why you used inches and miles in the post. not an issue at all, just a minor detail that&amp;#39;s bugging me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6hfli", "score_hidden": false, "stickied": false, "created": 1492056985.0, "created_utc": 1492028185.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6h186", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arakiss", "parent_id": "t1_dg6cn6n", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I've always used the MKS system. Find it easier. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always used the MKS system. Find it easier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6h186", "score_hidden": false, "stickied": false, "created": 1492056570.0, "created_utc": 1492027770.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cn6n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imhotep4", "parent_id": "t3_64m9dk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Wait - I am confused. You said you were Pakistani but then used US measurements to describe distances...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait - I am confused. You said you were Pakistani but then used US measurements to describe distances...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6cn6n", "score_hidden": false, "stickied": false, "created": 1492052053.0, "created_utc": 1492023253.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]