[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ever had an itch you can&amp;#39;t scratch? I once watched a documentary about people who had lost limbs but still had itches in places that no longer existed. From what I saw, it slowly drove them crazy, because it was all in their head. I sympathize, but my problem&amp;#39;s a bit worse than that. Try as I might, I can&amp;#39;t scratch &lt;em&gt;memories&lt;/em&gt;, and I certainly can&amp;#39;t squash the bugs that have gotten in them.&lt;/p&gt;\n\n&lt;p&gt;I first noticed the original insect when I was talking about an old story with friends. We were out for a drink at a bar, and a strange spiked-shell bug about the size of a dime began crawling across the table between us—wait, no, that&amp;#39;s not how it happened! They&amp;#39;re in my memories, you see? That bug is skittering through my memory of the bar &lt;em&gt;now&lt;/em&gt;, it wasn&amp;#39;t there the first time. I know because I wrote it down! I trust my writing.&lt;/p&gt;\n\n&lt;p&gt;No, the first bug I noticed was in a story I was recounting at the bar. I was talking about a concert I&amp;#39;d gone to about six years before, and I began describing a horrifying little bug that had crawled over my hand while I&amp;#39;d sat in the grass. It was unlike anything I&amp;#39;d ever seen, and I went on and on describing it; my friend had been there, but he didn&amp;#39;t remember the incident. Another friend confirmed. That led me to the strange notion that I was remembering events incorrectly.&lt;/p&gt;\n\n&lt;p&gt;But I could &lt;em&gt;see&lt;/em&gt; the bug. As much as it made me shudder, I focused my inner awareness upon the memory, and I watched it wander around the grass. Was I remembering it differently from moment to moment? It had a dark blue shell with tiny spines; the sight of it triggered innate disgust and revulsion, but I couldn&amp;#39;t control the me in my memory and jump away. Whenever I did try to move away, the bug vanished from sight, because I was really just imagining the motion—active change brought me out of memory and into imagination.&lt;/p&gt;\n\n&lt;p&gt;For that first week, most of my mental time was spent watching that bug. As I sat at work or in the car on the commute, I was only half-present, for my other half was at that concert six years ago watching a horrifying bug crawl upon oblivious friends and strangers. They were just memories clapping along to the music or drinking beers in clear plastic cups, but it still made me shudder to watch it crawl up their arms or around their faces. At one point, it fell into a sloshing beer and got trapped trying to move its repulsive little legs fruitlessly back and forth in the amber froth, and I thought my troubles were over.&lt;/p&gt;\n\n&lt;p&gt;I called up that friend and asked if he remembered a weird bug falling in his beer at that concert. He said that he &amp;quot;did, yeah man, at least I think. When was that again? Six years ago? Yeah, I think I remember that.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He didn&amp;#39;t seem convinced, and I began reading up on how memories are formed. Apparently, memory is very untrustworthy, and people form false interpretations of events all the time based on prompts and a little unconscious imagination. Did he really remember the bug in his beer? Or had I prompted him to envision something that had never happened?&lt;/p&gt;\n\n&lt;p&gt;Of course, I had other things to worry about at the time, so I let it go for a bit. Instead of staring at the bug at the concert six years before, I spent my nights staring at the divorce papers on my kitchen table. In some ways, my empty apartment was like the palace of memory I&amp;#39;d been reading about: every object and corner held some mental tag to a previous event, now soured and full of lies.&lt;/p&gt;\n\n&lt;p&gt;The second time it happened, I was sitting at that table staring at a particular paper cup that had been left out for several months. Like the concert, it was another memory of her; we were at a coffee shop doing nothing in particular when a smaller bug began crawling up her cup. It was not the same bug from before, but it was dark blue, spined, and clearly the same species. She just kept smiling. Did she not see the horrifying &lt;em&gt;thing&lt;/em&gt; moving down her fingers and along the back of her hand?&lt;/p&gt;\n\n&lt;p&gt;This time, instead of being captivated by the insect, I tried not to think about that coffee shop. If I just didn&amp;#39;t go near that memory, then everything would be alright.&lt;/p&gt;\n\n&lt;p&gt;But no. I could feel a &lt;em&gt;festering&lt;/em&gt; outside the edges of my awareness, and, next time I looked—once I finally couldn&amp;#39;t help it anymore—I also saw a number of small dots along the side of the coffee cup. I watched them day in and day out until they grew larger. Then, I knew. They were eggs.&lt;/p&gt;\n\n&lt;p&gt;I continued going to social events and nodding along to conversations as my friends talked around me, but I couldn&amp;#39;t really hear them. All I could think about was the disgusting horror growing in my mind. What would happen when those eggs hatched? How had the smaller bug gotten to a different memory from the concert? At times, someone would ask me if I was alright, but I just smiled and claimed that I was. How could I tell them that my brain was becoming infested?&lt;/p&gt;\n\n&lt;p&gt;Books. Articles. Online research. You know what&amp;#39;s amazing? Lucid dreaming actually worked for a little while. Each night, I practiced keeping my awareness as I sank into dreams. There, the fusion of imagination and memory allowed me to act for the first time, and I rushed forward, slapped the bug off her hand, and stomped the coffee cup and its dime-sized black eggs.&lt;/p&gt;\n\n&lt;p&gt;But when I woke up, I found that I&amp;#39;d just worsened the problem. I&amp;#39;d created a new memory of the coffee shop, the slapping, and the stomping, but the original memory still existed. Try as I might, I could never alter the original memory, and on the fifth successful lucid dreaming attempt I missed a few of the eggs and found that I&amp;#39;d just created more.&lt;/p&gt;\n\n&lt;p&gt;I was no longer staring at divorce papers on the kitchen table. Now, those were buried under piles of bills. I&amp;#39;d pay them eventually. I still went to work and sat through my day; I had money. I just really needed to deal with this infection of the mind first. After I paid the bills, I&amp;#39;d shower, too.&lt;/p&gt;\n\n&lt;p&gt;As I&amp;#39;d feared, they began wandering into other memories.&lt;/p&gt;\n\n&lt;p&gt;A woman approached me at the bar before my friends arrived, but all I could think about was how any memories I created with her would just be infested sooner rather than later. What&amp;#39;s a pretty face with bugs crawling on it?&lt;/p&gt;\n\n&lt;p&gt;At home, in the car, at work, out with friends, I was near to screaming every moment of every day. Two bugs, six bugs, ten. Fifty bugs, a hundred, a thousand crawling along every moment of the last six years of my life. Worse, they were starting to crawl on &lt;em&gt;me&lt;/em&gt;, and I could feel their horrible little legs as itching on my skin. Scratching my real arms didn&amp;#39;t help—the itch was on remembered skin, for the bugs were on remembered limbs. &lt;/p&gt;\n\n&lt;p&gt;Friends asked about my nervous itching and now-visible tension, but I just kept smiling and saying I was alright. There was no way to share this problem. They&amp;#39;d never believe me. They&amp;#39;d never understand.&lt;/p&gt;\n\n&lt;p&gt;So, I stopped going out with them.&lt;/p&gt;\n\n&lt;p&gt;The itching began small, but grew to maddening over the course of time. Scratching did nothing, even if I scraped down to lower layers of my skin. I turned to online research again, and I read about reflection therapy; those who had lost a limb and had itches there could assuage it by using a mirror to simulate the missing area while scratching the real one.&lt;/p&gt;\n\n&lt;p&gt;It was all in the mind, they said.&lt;/p&gt;\n\n&lt;p&gt;Real mirrors wouldn&amp;#39;t work for me, because the itch was not on a physical spot lost. What would work? At home and itching in the dark among piles of discarded fast food bags, I began envisioning an imagined version of me. He was happy, successful, and loved. Life was good for him. Brush the bugs off of me, I told him, and he came close and began slapping them away and stomping on their overturned and scrambling forms. For a moment, it worked.&lt;/p&gt;\n\n&lt;p&gt;But then the bugs covered him, too, and nickel and dimed his flesh until he was just bones. He screamed while it happened, but only in that half-heard hollow sense that imagined sounds hold.&lt;/p&gt;\n\n&lt;p&gt;Traumatized and demoralized, I kept doing research, kept telling myself I would beat this, that bugs in my memories had to have a vulnerability. If I began with the assumption that they were real, then they were creatures of the mental plane somehow. What connected them to my physical self? What &lt;em&gt;was&lt;/em&gt; consciousness? Scratching open sores constantly, stinking to high heaven, and constantly muttering to myself, I knew I was at my wit&amp;#39;s end. I could see it. I could see myself. In the mirror, the bugs were crawling upon my skin openly. It was awareness. It was thought.&lt;/p&gt;\n\n&lt;p&gt;It was all in the mind, they&amp;#39;d said.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what this note is about. I&amp;#39;ve crafted a careful plan, done my research, and mapped out as much as I could, but I&amp;#39;m still quite aware of the danger. I want you to know that I&amp;#39;m not insane, and that it&amp;#39;s not your fault. I also want it on the record that my friends had nothing to do with this; I stole the knives and drills without their knowledge. I&amp;#39;ve sanitized everything and set up as sterile an operation room as I can. I&amp;#39;m not crazy. This is really happening, and it&amp;#39;s the only way. I already know I&amp;#39;m right because I&amp;#39;ve made one drill hole and the bugs are beginning to spill out all over the floor and skitter away. I have to complete this surgery—because it&amp;#39;s all in my head.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"http://mattdymerski.com/\"&gt;+&lt;/a&gt;&lt;a href=\"https://www.facebook.com/MattDymerskiAuthor/\"&gt;+&lt;/a&gt;&lt;a href=\"https://twitter.com/MattDymerski\"&gt;+&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ever had an itch you can't scratch? I once watched a documentary about people who had lost limbs but still had itches in places that no longer existed. From what I saw, it slowly drove them crazy, because it was all in their head. I sympathize, but my problem's a bit worse than that. Try as I might, I can't scratch *memories*, and I certainly can't squash the bugs that have gotten in them.\n\nI first noticed the original insect when I was talking about an old story with friends. We were out for a drink at a bar, and a strange spiked-shell bug about the size of a dime began crawling across the table between us—wait, no, that's not how it happened! They're in my memories, you see? That bug is skittering through my memory of the bar *now*, it wasn't there the first time. I know because I wrote it down! I trust my writing.\n\nNo, the first bug I noticed was in a story I was recounting at the bar. I was talking about a concert I'd gone to about six years before, and I began describing a horrifying little bug that had crawled over my hand while I'd sat in the grass. It was unlike anything I'd ever seen, and I went on and on describing it; my friend had been there, but he didn't remember the incident. Another friend confirmed. That led me to the strange notion that I was remembering events incorrectly.\n\nBut I could *see* the bug. As much as it made me shudder, I focused my inner awareness upon the memory, and I watched it wander around the grass. Was I remembering it differently from moment to moment? It had a dark blue shell with tiny spines; the sight of it triggered innate disgust and revulsion, but I couldn't control the me in my memory and jump away. Whenever I did try to move away, the bug vanished from sight, because I was really just imagining the motion—active change brought me out of memory and into imagination.\n\nFor that first week, most of my mental time was spent watching that bug. As I sat at work or in the car on the commute, I was only half-present, for my other half was at that concert six years ago watching a horrifying bug crawl upon oblivious friends and strangers. They were just memories clapping along to the music or drinking beers in clear plastic cups, but it still made me shudder to watch it crawl up their arms or around their faces. At one point, it fell into a sloshing beer and got trapped trying to move its repulsive little legs fruitlessly back and forth in the amber froth, and I thought my troubles were over.\n\nI called up that friend and asked if he remembered a weird bug falling in his beer at that concert. He said that he \"did, yeah man, at least I think. When was that again? Six years ago? Yeah, I think I remember that.\"\n\nHe didn't seem convinced, and I began reading up on how memories are formed. Apparently, memory is very untrustworthy, and people form false interpretations of events all the time based on prompts and a little unconscious imagination. Did he really remember the bug in his beer? Or had I prompted him to envision something that had never happened?\n\nOf course, I had other things to worry about at the time, so I let it go for a bit. Instead of staring at the bug at the concert six years before, I spent my nights staring at the divorce papers on my kitchen table. In some ways, my empty apartment was like the palace of memory I'd been reading about: every object and corner held some mental tag to a previous event, now soured and full of lies.\n\nThe second time it happened, I was sitting at that table staring at a particular paper cup that had been left out for several months. Like the concert, it was another memory of her; we were at a coffee shop doing nothing in particular when a smaller bug began crawling up her cup. It was not the same bug from before, but it was dark blue, spined, and clearly the same species. She just kept smiling. Did she not see the horrifying *thing* moving down her fingers and along the back of her hand?\n\nThis time, instead of being captivated by the insect, I tried not to think about that coffee shop. If I just didn't go near that memory, then everything would be alright.\n\nBut no. I could feel a *festering* outside the edges of my awareness, and, next time I looked—once I finally couldn't help it anymore—I also saw a number of small dots along the side of the coffee cup. I watched them day in and day out until they grew larger. Then, I knew. They were eggs.\n\nI continued going to social events and nodding along to conversations as my friends talked around me, but I couldn't really hear them. All I could think about was the disgusting horror growing in my mind. What would happen when those eggs hatched? How had the smaller bug gotten to a different memory from the concert? At times, someone would ask me if I was alright, but I just smiled and claimed that I was. How could I tell them that my brain was becoming infested?\n\nBooks. Articles. Online research. You know what's amazing? Lucid dreaming actually worked for a little while. Each night, I practiced keeping my awareness as I sank into dreams. There, the fusion of imagination and memory allowed me to act for the first time, and I rushed forward, slapped the bug off her hand, and stomped the coffee cup and its dime-sized black eggs.\n\nBut when I woke up, I found that I'd just worsened the problem. I'd created a new memory of the coffee shop, the slapping, and the stomping, but the original memory still existed. Try as I might, I could never alter the original memory, and on the fifth successful lucid dreaming attempt I missed a few of the eggs and found that I'd just created more.\n\nI was no longer staring at divorce papers on the kitchen table. Now, those were buried under piles of bills. I'd pay them eventually. I still went to work and sat through my day; I had money. I just really needed to deal with this infection of the mind first. After I paid the bills, I'd shower, too.\n\nAs I'd feared, they began wandering into other memories.\n\nA woman approached me at the bar before my friends arrived, but all I could think about was how any memories I created with her would just be infested sooner rather than later. What's a pretty face with bugs crawling on it?\n\nAt home, in the car, at work, out with friends, I was near to screaming every moment of every day. Two bugs, six bugs, ten. Fifty bugs, a hundred, a thousand crawling along every moment of the last six years of my life. Worse, they were starting to crawl on *me*, and I could feel their horrible little legs as itching on my skin. Scratching my real arms didn't help—the itch was on remembered skin, for the bugs were on remembered limbs. \n\nFriends asked about my nervous itching and now-visible tension, but I just kept smiling and saying I was alright. There was no way to share this problem. They'd never believe me. They'd never understand.\n\nSo, I stopped going out with them.\n\nThe itching began small, but grew to maddening over the course of time. Scratching did nothing, even if I scraped down to lower layers of my skin. I turned to online research again, and I read about reflection therapy; those who had lost a limb and had itches there could assuage it by using a mirror to simulate the missing area while scratching the real one.\n\nIt was all in the mind, they said.\n\nReal mirrors wouldn't work for me, because the itch was not on a physical spot lost. What would work? At home and itching in the dark among piles of discarded fast food bags, I began envisioning an imagined version of me. He was happy, successful, and loved. Life was good for him. Brush the bugs off of me, I told him, and he came close and began slapping them away and stomping on their overturned and scrambling forms. For a moment, it worked.\n\nBut then the bugs covered him, too, and nickel and dimed his flesh until he was just bones. He screamed while it happened, but only in that half-heard hollow sense that imagined sounds hold.\n\nTraumatized and demoralized, I kept doing research, kept telling myself I would beat this, that bugs in my memories had to have a vulnerability. If I began with the assumption that they were real, then they were creatures of the mental plane somehow. What connected them to my physical self? What *was* consciousness? Scratching open sores constantly, stinking to high heaven, and constantly muttering to myself, I knew I was at my wit's end. I could see it. I could see myself. In the mirror, the bugs were crawling upon my skin openly. It was awareness. It was thought.\n\nIt was all in the mind, they'd said.\n\nThat's what this note is about. I've crafted a careful plan, done my research, and mapped out as much as I could, but I'm still quite aware of the danger. I want you to know that I'm not insane, and that it's not your fault. I also want it on the record that my friends had nothing to do with this; I stole the knives and drills without their knowledge. I've sanitized everything and set up as sterile an operation room as I can. I'm not crazy. This is really happening, and it's the only way. I already know I'm right because I've made one drill hole and the bugs are beginning to spill out all over the floor and skitter away. I have to complete this surgery—because it's all in my head.\n\n---\n\n[+](http://mattdymerski.com/)[+](https://www.facebook.com/MattDymerskiAuthor/)[+](https://twitter.com/MattDymerski)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64mq1g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 149, "report_reasons": null, "author": "M59Gar", "saved": false, "mod_reports": [], "name": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1491863147.0, "link_flair_css_class": null, "author_flair_css_class": "award", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64mq1g/the_insect_in_my_brain/", "num_reports": null, "locked": false, "stickied": false, "created": 1491890654.0, "url": "https://www.reddit.com/r/nosleep/comments/64mq1g/the_insect_in_my_brain/", "author_flair_text": "Best Multi-Part Story of 2012", "quarantine": false, "title": "The Insect In My Brain", "created_utc": 1491861854.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 149}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg4gpta", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NookFin", "parent_id": "t1_dg3k3zc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I fell in love with it too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fell in love with it too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4gpta", "score_hidden": false, "stickied": false, "created": 1491955428.0, "created_utc": 1491926628.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3k3zc", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "CleverGirl2014", "parent_id": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "&gt;...the itch was on remembered skin, for the bugs were on remembered limbs.   \n\nThat is a magnificent phrase.  Please don't drill so many holes that it messes up the part that thought of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;...the itch was on remembered skin, for the bugs were on remembered limbs.   &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is a magnificent phrase.  Please don&amp;#39;t drill so many holes that it messes up the part that thought of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3k3zc", "score_hidden": false, "stickied": false, "created": 1491899620.0, "created_utc": 1491870820.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg3ednj", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Seusstastic", "parent_id": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This 'memory' thing really seems to bug you, man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This &amp;#39;memory&amp;#39; thing really seems to bug you, man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3ednj", "score_hidden": false, "stickied": false, "created": 1491892254.0, "created_utc": 1491863454.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg3ieb7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Oxydepth", "parent_id": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Great story. It reminded me a bit of Phantom Possession Syndrome which I've always loved by you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story. It reminded me a bit of Phantom Possession Syndrome which I&amp;#39;ve always loved by you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3ieb7", "score_hidden": false, "stickied": false, "created": 1491897498.0, "created_utc": 1491868698.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg3q1u7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Feel_my_vote", "parent_id": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "What about your memories prior to 6 years ago? Are those bug-free? Is that when you got married? I think you should stop drilling and see a mental health specialist. Possibly your brain is rejecting the divorce and you are not dealing with it well. Please stop drilling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about your memories prior to 6 years ago? Are those bug-free? Is that when you got married? I think you should stop drilling and see a mental health specialist. Possibly your brain is rejecting the divorce and you are not dealing with it well. Please stop drilling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3q1u7", "score_hidden": false, "stickied": false, "created": 1491906935.0, "created_utc": 1491878135.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg4cwyg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "errsmi", "parent_id": "t1_dg3vxxh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm re-reading to find out this very thing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m re-reading to find out this very thing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4cwyg", "score_hidden": false, "stickied": false, "created": 1491951187.0, "created_utc": 1491922387.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg4qu3i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Verz", "parent_id": "t1_dg3vxxh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'd assume he doesn't want to seem insane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d assume he doesn&amp;#39;t want to seem insane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4qu3i", "score_hidden": false, "stickied": false, "created": 1491966445.0, "created_utc": 1491937645.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3vxxh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "choijason", "parent_id": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Why not just go to the doctor? Or did I miss something", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why not just go to the doctor? Or did I miss something&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3vxxh", "score_hidden": false, "stickied": false, "created": 1491915720.0, "created_utc": 1491886920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg42g48", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "youremomsgomjabbar", "parent_id": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ugh, I missed you. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh, I missed you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg42g48", "score_hidden": false, "stickied": false, "created": 1491932537.0, "created_utc": 1491903737.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mq1g", "likes": null, "replies": "", "user_reports": [], "id": "dg9n64k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "g0ing_postal", "parent_id": "t3_64mq1g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Is this an addiction metaphor? The bugs gradually take over all your good memories and eventually they're the only thing you can think about. The itching, the sores, the lack of hygiene are all signs of addiction as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this an addiction metaphor? The bugs gradually take over all your good memories and eventually they&amp;#39;re the only thing you can think about. The itching, the sores, the lack of hygiene are all signs of addiction as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9n64k", "score_hidden": false, "stickied": false, "created": 1492227980.0, "created_utc": 1492199180.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]