[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/62wn5k/clowntown_usa_part_1/\"&gt;part 1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/639cms/clowntown_usa_part_2/\"&gt;part 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/63p1ny/clowntown_usa_part_3/\"&gt;part 3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/643mom/clowntown_usa_part_4/\"&gt;part 4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I sat on the couch in my living room while my life fell apart around me. I could still hear the mechanic outside as he tinkered with my car, most likely ensuring it would never run again. My son had run away to play with the monstrous children in this town that was holding us both prisoner. &lt;/p&gt;\n\n&lt;p&gt;I know there were many things I could have done. Made the trek to the outside world on foot, on my own, and come back with the real police. Held a knife on the mechanic until he put my car back in working order, gone on a vehicular  rampage until they agreed to give my son back. But I was not the woman then that I am now. My thought process moved in panic loops. One thought kept coming back, no matter how many times I tried to banish it: &lt;em&gt;the clown knows something&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;I remembered his face as he looked at my son. You’d think the only living clown would be happy to see a new disciple. But no, he had looked dismayed at my son’s transformation. It was the first natural reaction I had seen since I&amp;#39;d come to town.&lt;/p&gt;\n\n&lt;p&gt;I waited until dark. The mechanic left hours before, leaving parts of my car scattered all over my driveway. The destroyed clown statues hadn’t been taken, but new ones sat  in the empty spaces until you couldn’t see a single inch of lawn. I resisted the urge to kick one over as I snuck out of my house.&lt;/p&gt;\n\n&lt;p&gt;I did not have any set plan at this point. I had packed one of my kitchen knives for self defense, but beyond that I was prepared for nothing. What would I do? What would I say? That would all depend on the clown.&lt;/p&gt;\n\n&lt;p&gt;I didn’t travel by the road, but skulked through yards and occasionally hopped fences. I was wary at all times of being watched, but by the time I hit the school I was fairly confident I hadn’t been followed.&lt;/p&gt;\n\n&lt;p&gt;The school had a baseball diamond and a soccer field to the south, beyond that was a cluster of trees probably left over from the town’s development. I crept through the bushes, not even sure of what I was looking for until I heard the sound of canned laughter.&lt;/p&gt;\n\n&lt;p&gt;A little ways into the trees was a shack made of corrugated tin. I could see the glow of light in the window as I crept up and peered inside. There were only four pieces of furniture in the shack: a metal cot, a bureau, a bar stool that held a black-and-white television, and a folding chair. The clown sat in the chair, nursing a bottle as he watched a rerun of Roseanne. I checked the room for weapons, saw none, and decided to make my entrance.&lt;/p&gt;\n\n&lt;p&gt;The door was situated within sight of the chair, so there was no element of surprise. I simply opened the door and walked in. The clown glanced up.&lt;/p&gt;\n\n&lt;p&gt;“Oh hey,” he said like he was casually greeting an old friend, “I was wondering when I&amp;#39;d see you here.” His normal voice was soft, not at all what I’d expected&lt;/p&gt;\n\n&lt;p&gt;I kept my hand on the knife in my pocket.&lt;/p&gt;\n\n&lt;p&gt;Up close, the clown was an even sadder picture than he’d been from a distance. His white makeup had cracked  away in big patches. I realized that he probably never washed it off, just slapped another layer on every morning. His poofy hair was lopsided and up close I could see that the red was peppered with grey. His eyes were sad and brown and bloodshot inside their greasepaint circles. He gave me a limp smile and took a pull from his bottle.&lt;/p&gt;\n\n&lt;p&gt;“Pull up a chair,” he said, “or don’t. S’up to you.”&lt;/p&gt;\n\n&lt;p&gt;Where could I start? “So you’re Buster Brown?”&lt;/p&gt;\n\n&lt;p&gt;He winced. “Ah. I hate that nickname. Call me Arthur. That’s my real name. You’re Mrs. Hughes?”&lt;/p&gt;\n\n&lt;p&gt;“&lt;em&gt;Ms.&lt;/em&gt;, actually. I’m divorced.”&lt;/p&gt;\n\n&lt;p&gt;He clicked his tongue. “That’s how they got ya. Steel Mill laid me off. That’s how they got me. I kept thinking ‘&lt;em&gt;where else am I going to find someplace this nice?&lt;/em&gt;’ Then it was too late. They dig at you, don’t they? Make you feel worthless?”&lt;/p&gt;\n\n&lt;p&gt;As odd as it was, this was the most normal conversation I&amp;#39;d had since I&amp;#39;d arrived in town. “You know what’s happening to my son?”&lt;/p&gt;\n\n&lt;p&gt;He got sad. “Yeah. Nice kid. What’s his name? That little bitch Missy just keeps calling him ‘new boy’.”&lt;/p&gt;\n\n&lt;p&gt;“His name is Joshua.”&lt;/p&gt;\n\n&lt;p&gt;The clown smiled slowly. “Huh. Mine was a J too. Jeremiah. That’s him over there.” He pointed an unsteady finger at the bureau. There was a picture frame made out of glued-together popsicle sticks sitting on top. The boy in the picture had red hair and sticking-out ears, he wore that style of brown-striped shirt that had been popular in the early eighties. The boy grinned mischievously at the camera, showing a missing front tooth.&lt;/p&gt;\n\n&lt;p&gt;“That was taken on his eighth. Before we came to this...place.” The clown knocked back another swig. “Sorry if I ramble. I haven’t really  talked to anyone in...god, it’s been years.”&lt;/p&gt;\n\n&lt;p&gt;“What’s happening to my son?” I asked curtly. He shot me an apologetic look.&lt;/p&gt;\n\n&lt;p&gt;“Sorry. You’ve noticed he’s changing, right? How none of the kids around here look right? Like they’ve got some sort of disease?”&lt;/p&gt;\n\n&lt;p&gt;I nodded.&lt;/p&gt;\n\n&lt;p&gt;“It’s this town. Changes people. Hang on—” he grunted as he heaved up from the chair. The clown waddled over to the bureau and opened the top drawer. After a minute of rustling, he tossed two photographs onto the chair where he’d been sitting.&lt;/p&gt;\n\n&lt;p&gt;“Had a hell of a time finding these. They were taken back when the town wasn’t so smart about leaving a record of things.”&lt;/p&gt;\n\n&lt;p&gt;The top photograph looked to be taken in the 1900’s or so. Whatever era it was still fashionable to photograph corpses being propped upright in their coffins. Five men, five dead men leered drunkenly at the camera. Their noses and lips were heavily swollen, so were their hands and feet. Their skin was so chalky white it made the sockets of their eyes vanish in darkness. Their hair was coarse and frizzy and stood out around their heads in a halo. In some horrible, monstrous way, they looked like—&lt;/p&gt;\n\n&lt;p&gt;“Clowns?” I asked.&lt;/p&gt;\n\n&lt;p&gt;He nodded grimly.&lt;/p&gt;\n\n&lt;p&gt;The second photo was also in black and white, but in much better condition. It was taken at a party of some sort. By the look of the clothing and hairstyles, it was in the fifties. A girl that looked like Missy Jackson minus the ugly stood in the front, wearing a hair bow and a party dress so aggressively ruffled it stood straight out from her waist. Behind her stood a man with an eerily familiar shit-eating grin. His hair was greased back and much darker, and his face was younger, but I could still see it was my welcoming committee Spencer Jackson.&lt;/p&gt;\n\n&lt;p&gt;I looked over the photos to the clown. “What does this mean?”&lt;/p&gt;\n\n&lt;p&gt;He had sat on the bed, twisting his bottle of cheap liquor. “Well, I&amp;#39;ll tell you what I put together. I might get a few things wrong, so take it as you will. You see what this town does to kids. How it twists ‘em. I think they used to become like these men, used to grow into these clown-lookin’ things before dying. People in town just accepted it. One in ten kids turns into a clown? Pfft. we can live with that. Then it became one in three. Then it was every single one.”&lt;/p&gt;\n\n&lt;p&gt;He took another drink to fortify himself. “I think at one point they figured out they couldn’t stop the whole thing, but they could stop it part of it. The thing about this...whatever it is, it makes ‘em obsessed with fun. They figgered out that if they indulged the hell out of the kids, they wouldn’t molt into these poor bastards. Trouble was the kids just &lt;em&gt;stopped&lt;/em&gt;, period. They don’t age, they don’t grow, and they don’t get any prettier, that’s for damn sure..”&lt;/p&gt;\n\n&lt;p&gt;I was struggling to take this all in, looking from photograph to photograph. “So the children used to turn into these...things, but don’t anymore? What happens if you stop indulging them, let them get angry? Do they turn into clowns?”&lt;/p&gt;\n\n&lt;p&gt;He shook his head. “They explode.”&lt;/p&gt;\n\n&lt;p&gt;I stared at him for a good long minute.&lt;/p&gt;\n\n&lt;p&gt;“Look, I know this is all a lot to swallow, but trust me. I’ve seen it firsthand. Your son run a lot of fevers these days? That’s part of it. They get real hot and then &lt;em&gt;boom&lt;/em&gt;! Like a meat grenade.”&lt;/p&gt;\n\n&lt;p&gt;“Do you have any proof of this?”&lt;/p&gt;\n\n&lt;p&gt;As an answer, he removed his leg below the knee. The clown chuckled a little at my expression. “Little souvenir from the last time I tried to go against the grain.” He tapped the metal shin rod of his prosthetic leg. “It was my little Jerry. The only reason I&amp;#39;m still here to talk to you is because of my wife. She was standing in front of me, took the blast full force.” His eyes got all misty. “I got lucky, as funny as that sounds. The older they are, the bigger the boom. Jerry was only here long enough to take out his mom ‘n me. When someone like Missy Jackson goes off…” he sucked air over his teeth.&lt;/p&gt;\n\n&lt;p&gt;I just stared at the pictures with a horrible sinking feeling. “How long were you here when Jerry went off?”&lt;/p&gt;\n\n&lt;p&gt;“Three weeks.”&lt;/p&gt;\n\n&lt;p&gt;I had been in the town for nearly two months.&lt;/p&gt;\n\n&lt;p&gt;“After I got out the hospital. They started in on me,” he said, “they had paid for my stay and now I owed ‘em. I was already low. Now they picked at me. Said if I had just been a better father, none of it would have happened. They told me I had upset the other kids with what I did, said I needed to fix that…”&lt;/p&gt;\n\n&lt;p&gt;At some point I had started shaking with rage.&lt;/p&gt;\n\n&lt;p&gt;“And that’s pretty much it. I’m a living ghost. I can just go into a store and take what I need, any time, and they won’t look twice at me. As long as I keep the kids busy, they don’t care” He took another swig. The bottle was nearly empty.&lt;/p&gt;\n\n&lt;p&gt;“I don’t get it,” I said, “if the town’s atmosphere is that dangerous, why do they invite more people in? Why would you want more children if that’s the end result?”&lt;/p&gt;\n\n&lt;p&gt;He shrugged heavily. “I guess in a sick way they need it. They wanna believe the way they live is the right way, and the best way to prove that is to get more converts.”&lt;/p&gt;\n\n&lt;p&gt;“That makes no logical sense.”&lt;/p&gt;\n\n&lt;p&gt;“Not sayin’ they run on logic. Just sayin’.”&lt;/p&gt;\n\n&lt;p&gt;I looked good and hard at him. “So if you’ve lived here so long without talking, why tell me now?”&lt;/p&gt;\n\n&lt;p&gt;“Not to get too personal, but I like you. You got spunk, I saw that on the first day of school. Been a long time since I&amp;#39;ve seen that here.” He grinned at me. &lt;/p&gt;\n\n&lt;p&gt;As oddly reassuring as that was, I didn’t feel any better after our talk. No, now I was just more aware of how much danger my son was in, and how helpless I was to stop it.&lt;/p&gt;\n\n&lt;p&gt;“I need to find Joshua,” I said, “I have to get him out of here and to a doctor, maybe. Find out what’s wrong with him. Maybe...” &lt;em&gt;maybe fix him&lt;/em&gt; were the words that caught in my throat.&lt;/p&gt;\n\n&lt;p&gt;He gave me a morose look.&lt;/p&gt;\n\n&lt;p&gt;“Hasn’t anyone else ever tried it?”&lt;/p&gt;\n\n&lt;p&gt;“There have been others, yeah.” The way he said it let me know exactly how well it went.&lt;/p&gt;\n\n&lt;p&gt;“I don’t care. My son is all I have left in this world. I’m going to fight for him.”&lt;/p&gt;\n\n&lt;p&gt;He toasted me with the empty bottle. “That’s the spirit.”&lt;/p&gt;\n\n&lt;p&gt;Before I went out the door, he gave me a sweaty handshake. “Best of luck to ya. Give ‘em one for me.”&lt;/p&gt;\n\n&lt;p&gt;“I will, Mr. Brown.”&lt;/p&gt;\n\n&lt;p&gt;“Arthur,” he reminded me.&lt;/p&gt;\n\n&lt;p&gt;“Arthur,” I repeated back, “...you can call me Denise.”&lt;/p&gt;\n\n&lt;p&gt;“Bye Denise. It was nice, talkin’ to someone real for once.”&lt;/p&gt;\n\n&lt;p&gt;“Yeah,” I said, “it was.”&lt;/p&gt;\n\n&lt;p&gt;Before I stepped out, I had to ask one last thing: “At some point, didn’t you stop feeling like you owed them? Why didn’t you leave? You don’t have anything left for them to take away.”&lt;/p&gt;\n\n&lt;p&gt;He gave me a morose look. “...I stay for the kids, Denise. It’s not their fault they’re like this.”&lt;/p&gt;\n\n&lt;p&gt;Outside the shack, I could see lights circling the hills surrounding Clanton. Probably search parties. My absence hadn’t gone unmissed. It would be a bad time to strike out on foot. I walked aimlessly through the school grounds, trying in vain to plan an escape. Perhaps I could start a fire as a distraction? I wasn’t too attached to my house anymore…&lt;/p&gt;\n\n&lt;p&gt;I could hear an excited whispering as I circled the baseball diamond. A cluster of children huddled under the bleachers, I could hear the croaking of some poor tortured animal. With horrible clarity, I could see the back of my son’s head and the shirt I had got him at the Grand Canyon.&lt;/p&gt;\n\n&lt;p&gt;“Joshua,” I called. The children scattered, giggling as they ran. Joshua ran too. Not fast enough.&lt;/p&gt;\n\n&lt;p&gt;I locked my hand around his upper arm. “Joshua, do &lt;em&gt;not&lt;/em&gt; run from me again.”&lt;/p&gt;\n\n&lt;p&gt;He twisted in my grip, bratty expression distorting his face. His bone structure was already becoming pronounced in that strange way the town’s children had. His arm burned in my grasp.&lt;/p&gt;\n\n&lt;p&gt;“Let me gooooooo,” he whined, face becoming redder and redder, “I wanna go playyyyyyy.”&lt;/p&gt;\n\n&lt;p&gt;I must say with absolute sincerity that I am not proud of what I did next. I was frightened that my own child was becoming a stranger to me and that I had no power to prevent it. So I grasped at the only tool left to me.&lt;/p&gt;\n\n&lt;p&gt;“Joshua,” I said, do you remember daddy?”&lt;/p&gt;\n\n&lt;p&gt;He stopped moving immediately.&lt;/p&gt;\n\n&lt;p&gt;“Do you remember how he left? How he took all his things out of the house and went away?” I pulled him until he faced me. “I will do that Joshua. I want to protect you, but in order for me to do that you have to listen to me, Joshua. If you don’t listen to me, I have to leave.”&lt;/p&gt;\n\n&lt;p&gt;His temperature dropped. “Mommy don’t leave,” he said in a tiny voice. He hugged me. It felt like years since he’d done that. I didn’t deserve that hug, but I returned it all the same.&lt;/p&gt;\n\n&lt;p&gt;“I won’t if I can help it,” I said, petting his hair, “but we do need to get out of here. This place isn’t really our home, Joshua. It’s like the candy house in Hansel and Gretel. It pretends to be nice but is really mean”&lt;/p&gt;\n\n&lt;p&gt;“How can we get out?” Josh said into my shirt. “Billy said all the dads in town are looking for you.”&lt;/p&gt;\n\n&lt;p&gt;I looked up at the searchlights in the hills. “I’ll think of something.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[part 1](https://www.reddit.com/r/nosleep/comments/62wn5k/clowntown_usa_part_1/)\n\n[part 2](https://www.reddit.com/r/nosleep/comments/639cms/clowntown_usa_part_2/)\n\n[part 3](https://www.reddit.com/r/nosleep/comments/63p1ny/clowntown_usa_part_3/)\n\n[part 4](https://www.reddit.com/r/nosleep/comments/643mom/clowntown_usa_part_4/)\n\nI sat on the couch in my living room while my life fell apart around me. I could still hear the mechanic outside as he tinkered with my car, most likely ensuring it would never run again. My son had run away to play with the monstrous children in this town that was holding us both prisoner. \n\nI know there were many things I could have done. Made the trek to the outside world on foot, on my own, and come back with the real police. Held a knife on the mechanic until he put my car back in working order, gone on a vehicular  rampage until they agreed to give my son back. But I was not the woman then that I am now. My thought process moved in panic loops. One thought kept coming back, no matter how many times I tried to banish it: *the clown knows something*.\n\nI remembered his face as he looked at my son. You’d think the only living clown would be happy to see a new disciple. But no, he had looked dismayed at my son’s transformation. It was the first natural reaction I had seen since I'd come to town.\n\nI waited until dark. The mechanic left hours before, leaving parts of my car scattered all over my driveway. The destroyed clown statues hadn’t been taken, but new ones sat  in the empty spaces until you couldn’t see a single inch of lawn. I resisted the urge to kick one over as I snuck out of my house.\n\nI did not have any set plan at this point. I had packed one of my kitchen knives for self defense, but beyond that I was prepared for nothing. What would I do? What would I say? That would all depend on the clown.\n\nI didn’t travel by the road, but skulked through yards and occasionally hopped fences. I was wary at all times of being watched, but by the time I hit the school I was fairly confident I hadn’t been followed.\n\nThe school had a baseball diamond and a soccer field to the south, beyond that was a cluster of trees probably left over from the town’s development. I crept through the bushes, not even sure of what I was looking for until I heard the sound of canned laughter.\n\nA little ways into the trees was a shack made of corrugated tin. I could see the glow of light in the window as I crept up and peered inside. There were only four pieces of furniture in the shack: a metal cot, a bureau, a bar stool that held a black-and-white television, and a folding chair. The clown sat in the chair, nursing a bottle as he watched a rerun of Roseanne. I checked the room for weapons, saw none, and decided to make my entrance.\n\nThe door was situated within sight of the chair, so there was no element of surprise. I simply opened the door and walked in. The clown glanced up.\n\n“Oh hey,” he said like he was casually greeting an old friend, “I was wondering when I'd see you here.” His normal voice was soft, not at all what I’d expected\n\nI kept my hand on the knife in my pocket.\n\nUp close, the clown was an even sadder picture than he’d been from a distance. His white makeup had cracked  away in big patches. I realized that he probably never washed it off, just slapped another layer on every morning. His poofy hair was lopsided and up close I could see that the red was peppered with grey. His eyes were sad and brown and bloodshot inside their greasepaint circles. He gave me a limp smile and took a pull from his bottle.\n\n“Pull up a chair,” he said, “or don’t. S’up to you.”\n\nWhere could I start? “So you’re Buster Brown?”\n\nHe winced. “Ah. I hate that nickname. Call me Arthur. That’s my real name. You’re Mrs. Hughes?”\n\n“*Ms.*, actually. I’m divorced.”\n\nHe clicked his tongue. “That’s how they got ya. Steel Mill laid me off. That’s how they got me. I kept thinking ‘*where else am I going to find someplace this nice?*’ Then it was too late. They dig at you, don’t they? Make you feel worthless?”\n\nAs odd as it was, this was the most normal conversation I'd had since I'd arrived in town. “You know what’s happening to my son?”\n\nHe got sad. “Yeah. Nice kid. What’s his name? That little bitch Missy just keeps calling him ‘new boy’.”\n\n“His name is Joshua.”\n\nThe clown smiled slowly. “Huh. Mine was a J too. Jeremiah. That’s him over there.” He pointed an unsteady finger at the bureau. There was a picture frame made out of glued-together popsicle sticks sitting on top. The boy in the picture had red hair and sticking-out ears, he wore that style of brown-striped shirt that had been popular in the early eighties. The boy grinned mischievously at the camera, showing a missing front tooth.\n\n“That was taken on his eighth. Before we came to this...place.” The clown knocked back another swig. “Sorry if I ramble. I haven’t really  talked to anyone in...god, it’s been years.”\n\n“What’s happening to my son?” I asked curtly. He shot me an apologetic look.\n\n“Sorry. You’ve noticed he’s changing, right? How none of the kids around here look right? Like they’ve got some sort of disease?”\n\nI nodded.\n\n“It’s this town. Changes people. Hang on—” he grunted as he heaved up from the chair. The clown waddled over to the bureau and opened the top drawer. After a minute of rustling, he tossed two photographs onto the chair where he’d been sitting.\n\n“Had a hell of a time finding these. They were taken back when the town wasn’t so smart about leaving a record of things.”\n\nThe top photograph looked to be taken in the 1900’s or so. Whatever era it was still fashionable to photograph corpses being propped upright in their coffins. Five men, five dead men leered drunkenly at the camera. Their noses and lips were heavily swollen, so were their hands and feet. Their skin was so chalky white it made the sockets of their eyes vanish in darkness. Their hair was coarse and frizzy and stood out around their heads in a halo. In some horrible, monstrous way, they looked like—\n\n“Clowns?” I asked.\n\nHe nodded grimly.\n\nThe second photo was also in black and white, but in much better condition. It was taken at a party of some sort. By the look of the clothing and hairstyles, it was in the fifties. A girl that looked like Missy Jackson minus the ugly stood in the front, wearing a hair bow and a party dress so aggressively ruffled it stood straight out from her waist. Behind her stood a man with an eerily familiar shit-eating grin. His hair was greased back and much darker, and his face was younger, but I could still see it was my welcoming committee Spencer Jackson.\n\nI looked over the photos to the clown. “What does this mean?”\n\nHe had sat on the bed, twisting his bottle of cheap liquor. “Well, I'll tell you what I put together. I might get a few things wrong, so take it as you will. You see what this town does to kids. How it twists ‘em. I think they used to become like these men, used to grow into these clown-lookin’ things before dying. People in town just accepted it. One in ten kids turns into a clown? Pfft. we can live with that. Then it became one in three. Then it was every single one.”\n\nHe took another drink to fortify himself. “I think at one point they figured out they couldn’t stop the whole thing, but they could stop it part of it. The thing about this...whatever it is, it makes ‘em obsessed with fun. They figgered out that if they indulged the hell out of the kids, they wouldn’t molt into these poor bastards. Trouble was the kids just *stopped*, period. They don’t age, they don’t grow, and they don’t get any prettier, that’s for damn sure..”\n\nI was struggling to take this all in, looking from photograph to photograph. “So the children used to turn into these...things, but don’t anymore? What happens if you stop indulging them, let them get angry? Do they turn into clowns?”\n\nHe shook his head. “They explode.”\n\nI stared at him for a good long minute.\n\n“Look, I know this is all a lot to swallow, but trust me. I’ve seen it firsthand. Your son run a lot of fevers these days? That’s part of it. They get real hot and then *boom*! Like a meat grenade.”\n\n“Do you have any proof of this?”\n\nAs an answer, he removed his leg below the knee. The clown chuckled a little at my expression. “Little souvenir from the last time I tried to go against the grain.” He tapped the metal shin rod of his prosthetic leg. “It was my little Jerry. The only reason I'm still here to talk to you is because of my wife. She was standing in front of me, took the blast full force.” His eyes got all misty. “I got lucky, as funny as that sounds. The older they are, the bigger the boom. Jerry was only here long enough to take out his mom ‘n me. When someone like Missy Jackson goes off…” he sucked air over his teeth.\n\nI just stared at the pictures with a horrible sinking feeling. “How long were you here when Jerry went off?”\n\n“Three weeks.”\n\nI had been in the town for nearly two months.\n\n“After I got out the hospital. They started in on me,” he said, “they had paid for my stay and now I owed ‘em. I was already low. Now they picked at me. Said if I had just been a better father, none of it would have happened. They told me I had upset the other kids with what I did, said I needed to fix that…”\n\nAt some point I had started shaking with rage.\n\n“And that’s pretty much it. I’m a living ghost. I can just go into a store and take what I need, any time, and they won’t look twice at me. As long as I keep the kids busy, they don’t care” He took another swig. The bottle was nearly empty.\n\n“I don’t get it,” I said, “if the town’s atmosphere is that dangerous, why do they invite more people in? Why would you want more children if that’s the end result?”\n\nHe shrugged heavily. “I guess in a sick way they need it. They wanna believe the way they live is the right way, and the best way to prove that is to get more converts.”\n\n“That makes no logical sense.”\n\n“Not sayin’ they run on logic. Just sayin’.”\n\nI looked good and hard at him. “So if you’ve lived here so long without talking, why tell me now?”\n\n“Not to get too personal, but I like you. You got spunk, I saw that on the first day of school. Been a long time since I've seen that here.” He grinned at me. \n\nAs oddly reassuring as that was, I didn’t feel any better after our talk. No, now I was just more aware of how much danger my son was in, and how helpless I was to stop it.\n\n“I need to find Joshua,” I said, “I have to get him out of here and to a doctor, maybe. Find out what’s wrong with him. Maybe...” *maybe fix him* were the words that caught in my throat.\n\nHe gave me a morose look.\n\n“Hasn’t anyone else ever tried it?”\n\n“There have been others, yeah.” The way he said it let me know exactly how well it went.\n\n“I don’t care. My son is all I have left in this world. I’m going to fight for him.”\n\nHe toasted me with the empty bottle. “That’s the spirit.”\n\nBefore I went out the door, he gave me a sweaty handshake. “Best of luck to ya. Give ‘em one for me.”\n\n“I will, Mr. Brown.”\n\n“Arthur,” he reminded me.\n\n“Arthur,” I repeated back, “...you can call me Denise.”\n\n“Bye Denise. It was nice, talkin’ to someone real for once.”\n\n“Yeah,” I said, “it was.”\n\nBefore I stepped out, I had to ask one last thing: “At some point, didn’t you stop feeling like you owed them? Why didn’t you leave? You don’t have anything left for them to take away.”\n\nHe gave me a morose look. “...I stay for the kids, Denise. It’s not their fault they’re like this.”\n\nOutside the shack, I could see lights circling the hills surrounding Clanton. Probably search parties. My absence hadn’t gone unmissed. It would be a bad time to strike out on foot. I walked aimlessly through the school grounds, trying in vain to plan an escape. Perhaps I could start a fire as a distraction? I wasn’t too attached to my house anymore…\n\nI could hear an excited whispering as I circled the baseball diamond. A cluster of children huddled under the bleachers, I could hear the croaking of some poor tortured animal. With horrible clarity, I could see the back of my son’s head and the shirt I had got him at the Grand Canyon.\n\n“Joshua,” I called. The children scattered, giggling as they ran. Joshua ran too. Not fast enough.\n\nI locked my hand around his upper arm. “Joshua, do *not* run from me again.”\n\nHe twisted in my grip, bratty expression distorting his face. His bone structure was already becoming pronounced in that strange way the town’s children had. His arm burned in my grasp.\n\n“Let me gooooooo,” he whined, face becoming redder and redder, “I wanna go playyyyyyy.”\n\nI must say with absolute sincerity that I am not proud of what I did next. I was frightened that my own child was becoming a stranger to me and that I had no power to prevent it. So I grasped at the only tool left to me.\n\n“Joshua,” I said, do you remember daddy?”\n\nHe stopped moving immediately.\n\n“Do you remember how he left? How he took all his things out of the house and went away?” I pulled him until he faced me. “I will do that Joshua. I want to protect you, but in order for me to do that you have to listen to me, Joshua. If you don’t listen to me, I have to leave.”\n\nHis temperature dropped. “Mommy don’t leave,” he said in a tiny voice. He hugged me. It felt like years since he’d done that. I didn’t deserve that hug, but I returned it all the same.\n\n“I won’t if I can help it,” I said, petting his hair, “but we do need to get out of here. This place isn’t really our home, Joshua. It’s like the candy house in Hansel and Gretel. It pretends to be nice but is really mean”\n\n“How can we get out?” Josh said into my shirt. “Billy said all the dads in town are looking for you.”\n\nI looked up at the searchlights in the hills. “I’ll think of something.”", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "64mz2u", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 326, "report_reasons": null, "author": "demons_dance_alone", "saved": false, "mod_reports": [], "name": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64mz2u/clowntown_usa_part_5/", "num_reports": null, "locked": false, "stickied": false, "created": 1491893294.0, "url": "https://www.reddit.com/r/nosleep/comments/64mz2u/clowntown_usa_part_5/", "author_flair_text": null, "quarantine": false, "title": "Clowntown, USA [part 5]", "created_utc": 1491864494.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 326}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg3fbrj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64mz2u%2Fclowntown_usa_part_5%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?to=RemindMeBot&amp;amp;subject=Reminder&amp;amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64mz2u%2Fclowntown_usa_part_5%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3fbrj", "score_hidden": true, "stickied": true, "created": 1491893453.0, "created_utc": 1491864653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg3uhft", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Feel_my_vote", "parent_id": "t1_dg3rby2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Blowing up the kids to escape! That's horrid and brilliant!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Blowing up the kids to escape! That&amp;#39;s horrid and brilliant!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3uhft", "score_hidden": false, "stickied": false, "created": 1491913206.0, "created_utc": 1491884406.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg3xly5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t1_dg3rby2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yes!!! Do this!! Activate momma bear mode and get you and your cub out of there!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes!!! Do this!! Activate momma bear mode and get you and your cub out of there!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3xly5", "score_hidden": false, "stickied": false, "created": 1491919048.0, "created_utc": 1491890248.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3rby2", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Notafraidofnotin", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There is a silver lining here. I know you feel terrible for what you said to your son, but I am glad you said it. Given his reaction I think it is safe to assume that you can still save your son, but you need to act fast!! Do it before they get their claws back into him and he starts to revert back to the horrible behavior the rest of the children display. In other words you need to formulate a plan and put it into motion tonight!! \n\nI think the only way you and your son are going to make it out is if you literally burn that God forsaken hell hole to the ground!! There is obviously some kind of curse on the place. And as horrible as it is for me to say this, I honestly think it is the truth, those other children can not be saved, they are to far gone. And while it may not be their fault, I hold the adults 100% accountable for not doing something to stop this and for bring more innocent parents and kids into it. I think that even if you removed those other children from the town nothing good would come of it. I see at least 3 possible very bad outcomes if you were to try and take any of the other children out of there, 1. They would instantly age to their actual age, which given the history could result in some very very old people suddenly thrust into the world, with this curse being lifted and them not having any idea as to what has happened to them. 2. It does not have any affect on them and you just released a bunch of horrible brats into the world. Or the worst of them all 3. What ever this curse is, and I truly believe it is some kind of curse, it is obviously contagious to children, what if taking those that have been under it's effect for such a long time caused it to spread outside of the town? You would be then releasing this horror into the world. You can not risk that. \n\nI think your only chance of escaping and putting an end to this hell is to literally burn the fucking place to the ground!!! Or start some kind of chain reaction that sets the kids off and make the place go up in a hell fire bomb!! You could start strategic fires that would make the kids angry and while everyone is scrambling to get things under control the two of you could slip out on foot. Start with the school, park and play ground, then move to the ice cream parlor, candy stores, all the kids favorite places and do it one after the other in rapid succession. I suggest doing it just after everyone tucks in for the night. They won't all be asleep yet, which you need some of them to be awake to spread the panick. Have your esentails packed in a back pack on you, then once you set the last fire take off into the woods and make a run for the main road outside of town. Stay hidden in the bush/tree line along the road until you come to the next town, just in case any of them come looking for you. Then once you make it to the next town, immediately contact the authorities, of course do this anonymously just in case they are in the know, being in such close proximity and all. Then the two of you get on the first bus, train or plane the hell out of there. \n\nGood luck OP, I have faith in you!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a silver lining here. I know you feel terrible for what you said to your son, but I am glad you said it. Given his reaction I think it is safe to assume that you can still save your son, but you need to act fast!! Do it before they get their claws back into him and he starts to revert back to the horrible behavior the rest of the children display. In other words you need to formulate a plan and put it into motion tonight!! &lt;/p&gt;\n\n&lt;p&gt;I think the only way you and your son are going to make it out is if you literally burn that God forsaken hell hole to the ground!! There is obviously some kind of curse on the place. And as horrible as it is for me to say this, I honestly think it is the truth, those other children can not be saved, they are to far gone. And while it may not be their fault, I hold the adults 100% accountable for not doing something to stop this and for bring more innocent parents and kids into it. I think that even if you removed those other children from the town nothing good would come of it. I see at least 3 possible very bad outcomes if you were to try and take any of the other children out of there, 1. They would instantly age to their actual age, which given the history could result in some very very old people suddenly thrust into the world, with this curse being lifted and them not having any idea as to what has happened to them. 2. It does not have any affect on them and you just released a bunch of horrible brats into the world. Or the worst of them all 3. What ever this curse is, and I truly believe it is some kind of curse, it is obviously contagious to children, what if taking those that have been under it&amp;#39;s effect for such a long time caused it to spread outside of the town? You would be then releasing this horror into the world. You can not risk that. &lt;/p&gt;\n\n&lt;p&gt;I think your only chance of escaping and putting an end to this hell is to literally burn the fucking place to the ground!!! Or start some kind of chain reaction that sets the kids off and make the place go up in a hell fire bomb!! You could start strategic fires that would make the kids angry and while everyone is scrambling to get things under control the two of you could slip out on foot. Start with the school, park and play ground, then move to the ice cream parlor, candy stores, all the kids favorite places and do it one after the other in rapid succession. I suggest doing it just after everyone tucks in for the night. They won&amp;#39;t all be asleep yet, which you need some of them to be awake to spread the panick. Have your esentails packed in a back pack on you, then once you set the last fire take off into the woods and make a run for the main road outside of town. Stay hidden in the bush/tree line along the road until you come to the next town, just in case any of them come looking for you. Then once you make it to the next town, immediately contact the authorities, of course do this anonymously just in case they are in the know, being in such close proximity and all. Then the two of you get on the first bus, train or plane the hell out of there. &lt;/p&gt;\n\n&lt;p&gt;Good luck OP, I have faith in you!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3rby2", "score_hidden": false, "stickied": false, "created": 1491908555.0, "created_utc": 1491879755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg3j2ai", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Ryaneurysm", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I've been enjoying this story a lot, I do hope you keep writing and you're okay", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been enjoying this story a lot, I do hope you keep writing and you&amp;#39;re okay&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3j2ai", "score_hidden": false, "stickied": false, "created": 1491898312.0, "created_utc": 1491869512.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg5jf0t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kalyan29883", "parent_id": "t1_dg4iuxq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Second that! This to me, is true horror.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Second that! This to me, is true horror.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5jf0t", "score_hidden": false, "stickied": false, "created": 1492004920.0, "created_utc": 1491976120.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iuxq", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "CorgRage", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Man this story is so underrated.  I love it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man this story is so underrated.  I love it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4iuxq", "score_hidden": false, "stickied": false, "created": 1491957777.0, "created_utc": 1491928977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg4lvug", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "musicissweeter", "parent_id": "t1_dg4inno", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That could be a plan. It wouldn't make the other kids flock to Denise's home for their fix, would it? Hope not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That could be a plan. It wouldn&amp;#39;t make the other kids flock to Denise&amp;#39;s home for their fix, would it? Hope not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4lvug", "score_hidden": false, "stickied": false, "created": 1491961069.0, "created_utc": 1491932269.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4inno", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CathrynMcCoy", "parent_id": "t1_dg47amq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I figured taking in Arthur would be a sign to the rest of the town that Denise finally gave up. At least Arthur is the one keeping the kids happy. She could explain that Joshua likes the entertainment so much that she decided to take the clown in so Joshua could get his entertaiment all the time?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I figured taking in Arthur would be a sign to the rest of the town that Denise finally gave up. At least Arthur is the one keeping the kids happy. She could explain that Joshua likes the entertainment so much that she decided to take the clown in so Joshua could get his entertaiment all the time?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4inno", "score_hidden": false, "stickied": false, "created": 1491957553.0, "created_utc": 1491928753.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47amq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "musicissweeter", "parent_id": "t1_dg41r96", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm not sure taking Arthur in will go down well for OP and her future plans. The other residents might become wary about a conspiracy against them and those kids sound dangerous.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure taking Arthur in will go down well for OP and her future plans. The other residents might become wary about a conspiracy against them and those kids sound dangerous.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg47amq", "score_hidden": false, "stickied": false, "created": 1491943724.0, "created_utc": 1491914924.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg41r96", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CathrynMcCoy", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I suggest you get your son's father involved. Since kids have a right to see their parents, it is time for your Ex to come and get the boy for a weekend.\n\nAnd as soon as your son is out of town, you need to find the graves of those 5 men in the picture Arthur showed you. Go there, dig out the bodies or whatever is left there and burn them. This might help to end the curse. In case it doesn't, get Arthur and leave town.\n\nAlso, until you can start all this, you might want to take Arthur in as a room mate. He definitely needs a bath and clothes and you need someone who is on your side and helps you.\n\nI wish you, Arthur and Joshua all the best.\nGet out there safe Denise, please get out there!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suggest you get your son&amp;#39;s father involved. Since kids have a right to see their parents, it is time for your Ex to come and get the boy for a weekend.&lt;/p&gt;\n\n&lt;p&gt;And as soon as your son is out of town, you need to find the graves of those 5 men in the picture Arthur showed you. Go there, dig out the bodies or whatever is left there and burn them. This might help to end the curse. In case it doesn&amp;#39;t, get Arthur and leave town.&lt;/p&gt;\n\n&lt;p&gt;Also, until you can start all this, you might want to take Arthur in as a room mate. He definitely needs a bath and clothes and you need someone who is on your side and helps you.&lt;/p&gt;\n\n&lt;p&gt;I wish you, Arthur and Joshua all the best.\nGet out there safe Denise, please get out there!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg41r96", "score_hidden": false, "stickied": false, "created": 1491930362.0, "created_utc": 1491901562.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg47g5b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "musicissweeter", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Please please get out safe OP. Your son might act as the perfect insider in the kids' gang for your plans to work. Don't let anyone know you're having rebellious tendencies right now and condition Joshua to act perfectly normal with his pals. Personally, I like the arson and blowing up the kids in unison to escape as the most kickass option for what they have done to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please please get out safe OP. Your son might act as the perfect insider in the kids&amp;#39; gang for your plans to work. Don&amp;#39;t let anyone know you&amp;#39;re having rebellious tendencies right now and condition Joshua to act perfectly normal with his pals. Personally, I like the arson and blowing up the kids in unison to escape as the most kickass option for what they have done to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg47g5b", "score_hidden": false, "stickied": false, "created": 1491943964.0, "created_utc": 1491915164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg4lfzo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Itsthematterhorn", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I love this series but gosh DANGIT why are they so short?!? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this series but gosh DANGIT why are they so short?!? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4lfzo", "score_hidden": false, "stickied": false, "created": 1491960592.0, "created_utc": 1491931792.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64mz2u", "likes": null, "replies": "", "user_reports": [], "id": "dg6wd7k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HopelesslyLibra", "parent_id": "t3_64mz2u", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "so you're telling me that the creepy clown *isn't* the bad guy here? That he's downright normal, and pretty much the only person with sanity?\n\nwell..... that was really unexpected. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;so you&amp;#39;re telling me that the creepy clown &lt;em&gt;isn&amp;#39;t&lt;/em&gt; the bad guy here? That he&amp;#39;s downright normal, and pretty much the only person with sanity?&lt;/p&gt;\n\n&lt;p&gt;well..... that was really unexpected. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6wd7k", "score_hidden": false, "stickied": false, "created": 1492074732.0, "created_utc": 1492045932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]