[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was two years old when I lost my legs.  They were amputated at the hip, leaving me with no stumps for prosthetics; therefore, I am confined to a wheelchair.  Not that I&amp;#39;m complaining; it&amp;#39;s all I&amp;#39;ve ever really known, and I&amp;#39;m used to it.  In fact, the only reason I&amp;#39;m bringing up my disability is because it plays an important role in the story I&amp;#39;m about to tell.&lt;/p&gt;\n\n&lt;p&gt;The story of Miss Dottie&amp;#39;s Autumn Harvest.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Aside from the obvious, my childhood was pretty normal.  I grew up believing I&amp;#39;d lost my legs to a nasty bout of meningitis, and got around just fine in my wheelchair.  Sure, I had to deal with the ignorance, pity, and occasional cruelty of others, but I wouldn&amp;#39;t describe my life as anything but happy.&lt;/p&gt;\n\n&lt;p&gt;My family lives in a small Ontario town that I will not name.  It&amp;#39;s about a two-hour drive from the capital city of Toronto, with a population of about twelve-thousand.  My father was a physical therapist at the local medical centre, and my mother was a graphic designer.  I have a brother, Henry, who&amp;#39;s four years my senior.  As kids, we often bickered, but shared a close bond nonetheless.  I had several good friends and was average in most school subjects, but quite gifted at math.  In other woods, a typical childhood.&lt;/p&gt;\n\n&lt;p&gt;Except for one thing: Miss Dottie.&lt;/p&gt;\n\n&lt;p&gt;She came to town every autumn, driving an old red car with a dented white trailer hitched to the back.  She always showed up at the end of September, when the air became frosty and the tree leaves turned beautiful shades of red, orange, and yellow.  She would park her trailer in the town square and set up a folding plastic table with her &amp;quot;handmade odds and ends.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To my naive, innocent eyes, Miss Dottie&amp;#39;s &amp;quot;odds and ends&amp;quot; were amazing: animals and figurines carved from smooth white ivory; belts, gloves, and purses made of leather; pearl jewelry; silk scarves in brilliant shades of red; and so much more.  All were beautifully handcrafted and were always a hit with the townspeople.&lt;/p&gt;\n\n&lt;p&gt;Miss Dottie herself, however, was rather... &lt;em&gt;eccentric&lt;/em&gt;, to say the least.  She was an older woman in her late fifties/early sixties, with curly auburn hair and shining dark eyes.  She always wore simple old-fashioned frocks and never seemed to age.  She always left town on the first of November, and nobody knew where she went or where she even came from in the first place.&lt;/p&gt;\n\n&lt;p&gt;Not scary so far?  Well, please bear with me here.  Whenever I saw Miss Dottie, the scars where my legs had been cut off began to sting and throb, as if still fresh and raw.  Even from a distance, the pain would set in, and I could never explain it.  It was as if my body knew something my mind did not, and Miss Dottie was inexplicably connected to it.&lt;/p&gt;\n\n&lt;p&gt;As I grew up, I began to notice something truly alarming: an awful lot of the town&amp;#39;s children-including some of my friends-were missing parts: fingers, toes, eyes, and ears.  Others had surgical scars on their stomachs and chests.  The mutilations extended to many of the adults, who had grown up in the town as well.  Every year, more and more children were mysteriously disfigured, and it always seemed to happen in autumn, when Miss Dottie was in town.&lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t the only one who noticed something was up; my own parents, as well as those of my friends, always seemed on edge whenever Miss Dottie was in town.  They would insist everything was okay, but their fear was palpable, and their relief at her departure even more so.  I began to suspect Miss Dottie had something to do with the yearly mutilations, but the idea sounded so absurd I simply couldn&amp;#39;t bring myself to speak it out loud.&lt;/p&gt;\n\n&lt;p&gt;One October morning, when I was thirteen years old, I went down to the grocery store to pick up a few groceries for my mother.  As I manoeuvred my wheelchair through the sliding glass doors, I nearly bumped into Miss Dottie.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh!&amp;quot; she exclaimed.  &amp;quot;I&amp;#39;m sorry, Caroline.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi, Miss Dottie,&amp;quot; I said, moulding my face into what I hoped was a genuine-looking smile.  &amp;quot;How are you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m well, my dear. Sales are great, as usual. Would you like some help with your shopping?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No thanks,&amp;quot; I said, a little sharper than I meant to.  Call me rude, but I hate it when people automatically assume I need help just because I have no legs.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ll be off then,&amp;quot; said Miss Dottie, who either hadn&amp;#39;t heard my tone or just didn&amp;#39;t care.  &amp;quot;My, look at how muscular your arms are! Turning those wheels must be quite the workout! I hope you&amp;#39;re grateful you still have your upper limbs.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;As she strode away, toting her single grocery bag on her hip, the pain in my hips came back with an intensity that left me doubled over and gasping.  Tears filled my eyes and my head began to spin.  I passed out and slid out of my chair, hitting the linoleum floor with a &lt;em&gt;splat.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;An ambulance was called, and despite my protests, they hauled me into the back of the vehicle and drove me to the hospital.  I told them over and over again that I was okay, but the doctors didn&amp;#39;t listen and insisted on performing test after pointless test.  By the time they finally sent me home with my mother, I was in a terrible mood.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Tell me,&amp;quot; I demanded as soon as we walked (or, in my case, rolled) through the front door.&lt;/p&gt;\n\n&lt;p&gt;My mother raised an eyebrow, clearly confused.  &amp;quot;Tell you what?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Miss Dottie!&amp;quot; I snapped.  &amp;quot;My hips began to hurt after she told me I should be grateful I still have arms!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Carrie, I&amp;#39;m sure-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No! Don&amp;#39;t lie to me, Mum! I know something is going on! Why are so many people in this town deformed? Why do kids always lose parts when that crazy old lady is around? Why do my hips kill me every time I see her?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Mum sighed and wheeled me into the living room.  She sat down across from me on the couch and told me, &amp;quot;I think you&amp;#39;re ready to know.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;To know &lt;em&gt;what&lt;/em&gt;?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She leaned forward, taking my hands in hers.  &amp;quot;Carrie, your father and I have always told you that you lost your legs to meningitis. Well, that&amp;#39;s not true. You &lt;em&gt;did&lt;/em&gt; get sick as a toddler, but it didn&amp;#39;t take your legs.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So what did?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Mum had gone pale, her eyes shiny with tears.  &amp;quot;Shortly after you were released from the hospital, I woke up one morning and found you with no legs. They had been surgically removed, stitched up, and bandaged. You weren&amp;#39;t in any pain, but you &lt;em&gt;were&lt;/em&gt; groggy and confused. Your father and I also felt a little &amp;#39;out of it&amp;#39;, as if on medication. It was terrifying.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I covered my mouth, holding back the bile climbing up my throat.  &amp;quot;So someone &lt;em&gt;came&lt;/em&gt; into my &lt;em&gt;room&lt;/em&gt; while I was sleeping and amputated my legs?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes. But worse, you weren&amp;#39;t the only one. At &lt;em&gt;least&lt;/em&gt; four other children were mutilated that autumn. It was a tradition that had been going on for decades, since &lt;em&gt;I&lt;/em&gt; was your age.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My mother lifted her sweater and motioned at the faint scar on her stomach.  &amp;quot;I was five years old when half my liver was mysteriously removed. Miss Dottie had only arrived in town the day before. Back then, she looked exactly the same as she does now; she doesn&amp;#39;t age!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Mum, are you &lt;em&gt;serious&lt;/em&gt;?&amp;quot; I demanded.  I knew my mother wouldn&amp;#39;t screw with me like this... but I didn&amp;#39;t want any of this to be true.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes. I&amp;#39;m so sorry, honey.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why hasn&amp;#39;t anyone done something? Told the police? Banned Miss Dottie from town? Why have people let this happen for so long?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We &lt;em&gt;tried&lt;/em&gt;, Caroline. We&amp;#39;ve had her arrested, but she always breaks out of prison. We&amp;#39;ve run her out of town, but she always comes back! We can&amp;#39;t get rid of her. We don&amp;#39;t even know who she really is.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To say I was horrified would be the understatement of the century.  &amp;quot;Miss Dottie took my legs,&amp;quot; I whispered.  &amp;quot;She took your liver. She took Amy&amp;#39;s eye, Eric&amp;#39;s fingers... oh, God.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My mother simply nodded, at a loss for words.&lt;/p&gt;\n\n&lt;p&gt;After that, I made a point of avoiding Miss Dottie.  I never went near the town square as long as she was in town.  I still didn&amp;#39;t truly believe what my mother had told me; it was simply too crazy.  But I knew that crazy old bitch was dangerous, and that if I valued my own safety, I should stay away from her.&lt;/p&gt;\n\n&lt;p&gt;Eventually, I graduated from high school.  With the money I&amp;#39;d saved up from summer jobs, I was able to help my parents pay for my tuition at York University in Toronto.  While living and attending school in the city, I met a journalism student named David and fell madly in love, eventually moving in together during our junior year.  Shortly after graduation, David proposed to me, and we tied the knot six months later.  We lived in the city, but would often visit the town where I&amp;#39;d grown up; not even Miss Dottie could tarnish my happy memories of the place.&lt;/p&gt;\n\n&lt;p&gt;Fast-forward to October of 2015.  David and I have a nice house, successful careers (him writing articles for the &lt;em&gt;Toronto Star&lt;/em&gt;, me working for a local accounting firm), and two children: an adorable six-year-old named Abigail and a one-year-old boy named Josiah.  At twenty-nine, I had accomplished a lot in life, and rarely thought of Miss Dottie or the truth about my missing legs.  Until one weekend, when we went to visit my parents.&lt;/p&gt;\n\n&lt;p&gt;I knew Miss Dottie would be in town, but I wasn&amp;#39;t too worried; the kids had been there before, and the crazy bitch in the red car hadn&amp;#39;t bothered them.  But, of course, there&amp;#39;s a first time for everything.&lt;/p&gt;\n\n&lt;p&gt;It happened on our first evening at my parents&amp;#39; house.  My mother was cooking dinner, and I&amp;#39;d taken a fussy Josiah out on the front porch so we could sit in the old rocking chair.  As I bounced my baby in my lap, I caught a glimpse of curly red hair in my peripheral.&lt;/p&gt;\n\n&lt;p&gt;Shit.  Miss Dottie.  What was she doing here?  She had &lt;em&gt;never&lt;/em&gt; come to the house before.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello, Caroline,&amp;quot; she smiled.  &amp;quot;Good to see you again!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi, Miss Dottie,&amp;quot; I said coolly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh my! Is that your new baby?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Without permission, Miss Dottie scooped up Josiah and cradled him against her amble bosom.  I jumped up, ready to snatch my child back.  Josiah gurgled happily, and Miss Dottie smiled a &lt;em&gt;very&lt;/em&gt; unnerving smile.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;s a beautiful baby,&amp;quot; she cooed.  &amp;quot;And he&amp;#39;s lucky to have such a loving mother. Do you think he appreciates it?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;s a &lt;em&gt;baby.&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Does your sweet little Abigail love her little brother?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;She adores him! Aside from the occasional bout of jealousy, of course.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Miss Dottie pursed her lips.  &amp;quot;I may have to teach her a lesson. Evening, Caroline.&amp;quot;  She handed Josiah back to me and walked away.&lt;/p&gt;\n\n&lt;p&gt;My hips were throbbing, but the pain was drowned out by the cold dread filling my body.  &lt;em&gt;I may have to teach her a lesson.&lt;/em&gt;  What the fuck was Miss Dottie going to do?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re &lt;em&gt;not&lt;/em&gt; putting your filthy fucking hands on my daughter, you bitch,&amp;quot; I hissed before going back inside.&lt;/p&gt;\n\n&lt;p&gt;Later that night, I snuck into the guest room where my children were sleeping and waited.  David and my parents were fast asleep, but I was on high alert, my maternal instincts going haywire.  I sat on the end of Abby&amp;#39;s bed, my fists clenched, pain hammering away in my hips.&lt;/p&gt;\n\n&lt;p&gt;At midnight, I heard soft footsteps coming up the stairs.  I lay down beside my daughter, pretending to be asleep, but kept my eye on the door.&lt;/p&gt;\n\n&lt;p&gt;With a faint &lt;em&gt;creak&lt;/em&gt;, it fell open, and Miss Dottie walked in.  She bent over Josiah&amp;#39;s crib and sprayed my baby with a misty purple substance from a plain aerosol can.  I wanted to scream, but bit my tongue.  Miss Dottie sprayed Abby with the mist, and then me, but I held my breath.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Come now, little one,&amp;quot; Miss Dottie whispered.  She lifted my daughter out of bed and padded back down the hall.  I counted to one hundred before crawling downstairs, climbing into my wheelchair, and leaving the house through the front door.&lt;/p&gt;\n\n&lt;p&gt;Miss Dottie was out of sight, but I knew exactly where to find her.&lt;/p&gt;\n\n&lt;p&gt;I reached the town square just in time to catch Miss Dottie slipping into her trailer, cradling my little girl.  I squared my shoulders, clenched my jaw, and began to bang on the door.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Miss Dottie!&amp;quot; I barked.  &amp;quot;You better open up right now or I swear I&amp;#39;ll-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Goodness, what&amp;#39;s with all the commotion?&amp;quot;  She stuck her head out, still grinning.  &amp;quot;Caroline! What brings you around so late?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Don&amp;#39;t play dumb with me, you old cow! I know you&amp;#39;ve taken my daughter!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can assure you that Abigail is perfectly safe. Why don&amp;#39;t you come in and see for yourself?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Give her back!&amp;quot; I snarled, but Miss Dottie simply reached down, lifted my wheelchair off the cobblestone ground, and pulled me inside.&lt;/p&gt;\n\n&lt;p&gt;The trailer&amp;#39;s interior smelled like a hospital room, all disinfectant and rubbing alcohol.  The front room was dominated by a large steel operating table, which Abigail was currently strapped to, stripped naked and fast asleep.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Abby!&amp;quot; I screamed, but Miss Dottie held me back.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Now, now, Caroline. You don&amp;#39;t need to worry. I am simply going to perform a quick operation on your daughter. It won&amp;#39;t hurt a bit, and she&amp;#39;ll be right as rain in a few days. If it makes you feel better, you are welcome to watch.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I should have fought her; I should have done more.  But horror had cemented me in place, and I was helpless.&lt;/p&gt;\n\n&lt;p&gt;Miss Dottie inked a line across Abigail&amp;#39;s belly and made a long incision with a shiny scalpel.  She then spread the skin with a pair of forceps and began slicing through the muscle.  The sight and smell of my daughter&amp;#39;s blood made me wretch.  &amp;quot;What the fuck are you doing?&amp;quot; I hissed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Removing part of her liver, much like I did with your mother.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&lt;em&gt;Why&lt;/em&gt;?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She sighed, mopping at the blood with a clean white towel.  &amp;quot;Children lack proper gratitude for their many blessings. All they seem to care about is what they &lt;em&gt;don&amp;#39;t&lt;/em&gt; have. This town is no exception. I grew up here myself, Carrie, so believe me when I say I know.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have made it my life&amp;#39;s mission to teach children how to be grateful. That is why I steal the pieces of their bodies that they take for granted. I turn them into beautiful things that other children can possess and treasure.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What do you mean-&lt;em&gt;no.&lt;/em&gt;&amp;quot;  I shook my head.  &amp;quot;Don&amp;#39;t tell me what I&amp;#39;m thinking is true.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It is,&amp;quot; Miss Dottie said simply.  &amp;quot;My carvings are from human bone, my purses and belts from human flesh. My pearls were once human teeth, and I dye my scarves with blood.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You crazy, fucked-up bitch,&amp;quot; I snarled.  &amp;quot;So &lt;em&gt;you&lt;/em&gt; cut off my legs.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes. I did. It was important you understood how lucky you were to have survived meningitis.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was &lt;em&gt;two&lt;/em&gt;!&amp;quot; I screamed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re never too young to learn. Now, let me finish surgery on your daughter. Maybe I can turn her liver into a teething toy for little Josiah.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She looked right at me, the biggest shit-eating grin on her face, and I lost it.  I leapt out of my chair and slammed into Miss Dottie, knocking her to the floor.  After a short but vicious struggle, I wrenched the scalpel from her hand and held it to her veiny neck.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If you &lt;em&gt;ever&lt;/em&gt; touch my daughter again-&amp;quot; I began, but Miss Dottie slapped my face, knocking me off of her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You shut your mouth, Caroline! I am simply doing my job! You would be wise not to interfere!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I had never seen Miss Dottie angry before, and it only made her all the more terrifying.  But with the scalpel still in my hand, a tiny bit of my courage remained intact.&lt;/p&gt;\n\n&lt;p&gt;I plunged the sharp object deep into Miss Dottie&amp;#39;s calf.  She shrieked in pain and kicked at me, but missed and fell over, landing face-down on the floor.  I climbed onto her back, knotted my fingers through her curly red hair, and began slamming her face against the floor, again and again, until she was still.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That was for my legs,&amp;quot; I hissed.  &amp;quot;And for my mother&amp;#39;s liver. And for all the innocent children you&amp;#39;ve mutilated for the sake of teaching gratitude.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;With the old lady bleeding and unconscious on the floor of her improvised torture table, I crawled to the phone and called the police.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Miss Dottie and Abigail were both taken to the hospital.  My daughter needed stitches in her stomach, but had suffered no significant damage.  Miss Dottie had a broken nose and severe bruising to her face, as well as a dislocated jaw.  I myself was shaken up, but physically unharmed.&lt;/p&gt;\n\n&lt;p&gt;When the cops raided Miss Dottie&amp;#39;s trailer, they found a freezer full of severed limbs, eyeballs floating in formaldehyde, piles of bones, and skin dried and tanned so to resemble leather.  It seemed Miss Dottie had been stockpiling her &amp;quot;supplies&amp;quot; for decades.  It appeared she traveled all over the province, selling her macabre figurines and jewelry, and would come by our town every autumn to &amp;quot;harvest&amp;quot; what she needed.&lt;/p&gt;\n\n&lt;p&gt;Miss Dottie was facing serious jail time, but before her case could go to trial, she vanished.  A massive search turned up nothing.  She has yet to return to my old town, but for all I know, she&amp;#39;s found a new community to torment.&lt;/p&gt;\n\n&lt;p&gt;So here&amp;#39;s my warning: keep an eye out for Miss Dottie.  Never let her anywhere near your children.  And if you notice that an awful lot of people in your town or city are missing body parts, don&amp;#39;t ignore it.&lt;/p&gt;\n\n&lt;p&gt;Most of Miss Dottie&amp;#39;s odds and ends were taken by the police, and those that weren&amp;#39;t were either destroyed or given away.  I got rid of everything I bought from that demon, except for one thing:&lt;/p&gt;\n\n&lt;p&gt;A tiny white ivory elephant, which I believe was carved from my own femur bone.&lt;/p&gt;\n\n&lt;p&gt;I know, it&amp;#39;s fucked-up.  But to me, the elephant is kind of a good luck charm, and I carry it wherever I go.  It comforts me whenever my hips start to ache.  When the nightmares come.  When I feel like I&amp;#39;m being watched.&lt;/p&gt;\n\n&lt;p&gt;It gives me hope that, if Miss Dottie ever returns, she can&amp;#39;t take anything else away from me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\nI was two years old when I lost my legs.  They were amputated at the hip, leaving me with no stumps for prosthetics; therefore, I am confined to a wheelchair.  Not that I'm complaining; it's all I've ever really known, and I'm used to it.  In fact, the only reason I'm bringing up my disability is because it plays an important role in the story I'm about to tell.\n\nThe story of Miss Dottie's Autumn Harvest.\n\n-----------------------------------------------------------------------------\n\nAside from the obvious, my childhood was pretty normal.  I grew up believing I'd lost my legs to a nasty bout of meningitis, and got around just fine in my wheelchair.  Sure, I had to deal with the ignorance, pity, and occasional cruelty of others, but I wouldn't describe my life as anything but happy.\n\nMy family lives in a small Ontario town that I will not name.  It's about a two-hour drive from the capital city of Toronto, with a population of about twelve-thousand.  My father was a physical therapist at the local medical centre, and my mother was a graphic designer.  I have a brother, Henry, who's four years my senior.  As kids, we often bickered, but shared a close bond nonetheless.  I had several good friends and was average in most school subjects, but quite gifted at math.  In other woods, a typical childhood.\n\nExcept for one thing: Miss Dottie.\n\nShe came to town every autumn, driving an old red car with a dented white trailer hitched to the back.  She always showed up at the end of September, when the air became frosty and the tree leaves turned beautiful shades of red, orange, and yellow.  She would park her trailer in the town square and set up a folding plastic table with her \"handmade odds and ends.\"\n\nTo my naive, innocent eyes, Miss Dottie's \"odds and ends\" were amazing: animals and figurines carved from smooth white ivory; belts, gloves, and purses made of leather; pearl jewelry; silk scarves in brilliant shades of red; and so much more.  All were beautifully handcrafted and were always a hit with the townspeople.\n\nMiss Dottie herself, however, was rather... *eccentric*, to say the least.  She was an older woman in her late fifties/early sixties, with curly auburn hair and shining dark eyes.  She always wore simple old-fashioned frocks and never seemed to age.  She always left town on the first of November, and nobody knew where she went or where she even came from in the first place.\n\nNot scary so far?  Well, please bear with me here.  Whenever I saw Miss Dottie, the scars where my legs had been cut off began to sting and throb, as if still fresh and raw.  Even from a distance, the pain would set in, and I could never explain it.  It was as if my body knew something my mind did not, and Miss Dottie was inexplicably connected to it.\n\nAs I grew up, I began to notice something truly alarming: an awful lot of the town's children-including some of my friends-were missing parts: fingers, toes, eyes, and ears.  Others had surgical scars on their stomachs and chests.  The mutilations extended to many of the adults, who had grown up in the town as well.  Every year, more and more children were mysteriously disfigured, and it always seemed to happen in autumn, when Miss Dottie was in town.\n\nI wasn't the only one who noticed something was up; my own parents, as well as those of my friends, always seemed on edge whenever Miss Dottie was in town.  They would insist everything was okay, but their fear was palpable, and their relief at her departure even more so.  I began to suspect Miss Dottie had something to do with the yearly mutilations, but the idea sounded so absurd I simply couldn't bring myself to speak it out loud.\n\nOne October morning, when I was thirteen years old, I went down to the grocery store to pick up a few groceries for my mother.  As I manoeuvred my wheelchair through the sliding glass doors, I nearly bumped into Miss Dottie.\n\n\"Oh!\" she exclaimed.  \"I'm sorry, Caroline.\"\n\n\"Hi, Miss Dottie,\" I said, moulding my face into what I hoped was a genuine-looking smile.  \"How are you?\"\n\n\"I'm well, my dear. Sales are great, as usual. Would you like some help with your shopping?\"\n\n\"No thanks,\" I said, a little sharper than I meant to.  Call me rude, but I hate it when people automatically assume I need help just because I have no legs.\n\n\"I'll be off then,\" said Miss Dottie, who either hadn't heard my tone or just didn't care.  \"My, look at how muscular your arms are! Turning those wheels must be quite the workout! I hope you're grateful you still have your upper limbs.\"\n\nAs she strode away, toting her single grocery bag on her hip, the pain in my hips came back with an intensity that left me doubled over and gasping.  Tears filled my eyes and my head began to spin.  I passed out and slid out of my chair, hitting the linoleum floor with a *splat.*\n\nAn ambulance was called, and despite my protests, they hauled me into the back of the vehicle and drove me to the hospital.  I told them over and over again that I was okay, but the doctors didn't listen and insisted on performing test after pointless test.  By the time they finally sent me home with my mother, I was in a terrible mood.\n\n\"Tell me,\" I demanded as soon as we walked (or, in my case, rolled) through the front door.\n\nMy mother raised an eyebrow, clearly confused.  \"Tell you what?\"\n\n\"Miss Dottie!\" I snapped.  \"My hips began to hurt after she told me I should be grateful I still have arms!\"\n\n\"Carrie, I'm sure-\"\n\n\"No! Don't lie to me, Mum! I know something is going on! Why are so many people in this town deformed? Why do kids always lose parts when that crazy old lady is around? Why do my hips kill me every time I see her?\"\n\nMum sighed and wheeled me into the living room.  She sat down across from me on the couch and told me, \"I think you're ready to know.\"\n\n\"To know *what*?\"\n\nShe leaned forward, taking my hands in hers.  \"Carrie, your father and I have always told you that you lost your legs to meningitis. Well, that's not true. You *did* get sick as a toddler, but it didn't take your legs.\"\n\n\"So what did?\"\n\nMum had gone pale, her eyes shiny with tears.  \"Shortly after you were released from the hospital, I woke up one morning and found you with no legs. They had been surgically removed, stitched up, and bandaged. You weren't in any pain, but you *were* groggy and confused. Your father and I also felt a little 'out of it', as if on medication. It was terrifying.\"\n\nI covered my mouth, holding back the bile climbing up my throat.  \"So someone *came* into my *room* while I was sleeping and amputated my legs?\"\n\n\"Yes. But worse, you weren't the only one. At *least* four other children were mutilated that autumn. It was a tradition that had been going on for decades, since *I* was your age.\"\n\nMy mother lifted her sweater and motioned at the faint scar on her stomach.  \"I was five years old when half my liver was mysteriously removed. Miss Dottie had only arrived in town the day before. Back then, she looked exactly the same as she does now; she doesn't age!\"\n\n\"Mum, are you *serious*?\" I demanded.  I knew my mother wouldn't screw with me like this... but I didn't want any of this to be true.\n\n\"Yes. I'm so sorry, honey.\"\n\n\"Why hasn't anyone done something? Told the police? Banned Miss Dottie from town? Why have people let this happen for so long?\"\n\n\"We *tried*, Caroline. We've had her arrested, but she always breaks out of prison. We've run her out of town, but she always comes back! We can't get rid of her. We don't even know who she really is.\"\n\nTo say I was horrified would be the understatement of the century.  \"Miss Dottie took my legs,\" I whispered.  \"She took your liver. She took Amy's eye, Eric's fingers... oh, God.\"\n\nMy mother simply nodded, at a loss for words.\n\nAfter that, I made a point of avoiding Miss Dottie.  I never went near the town square as long as she was in town.  I still didn't truly believe what my mother had told me; it was simply too crazy.  But I knew that crazy old bitch was dangerous, and that if I valued my own safety, I should stay away from her.\n\nEventually, I graduated from high school.  With the money I'd saved up from summer jobs, I was able to help my parents pay for my tuition at York University in Toronto.  While living and attending school in the city, I met a journalism student named David and fell madly in love, eventually moving in together during our junior year.  Shortly after graduation, David proposed to me, and we tied the knot six months later.  We lived in the city, but would often visit the town where I'd grown up; not even Miss Dottie could tarnish my happy memories of the place.\n\nFast-forward to October of 2015.  David and I have a nice house, successful careers (him writing articles for the *Toronto Star*, me working for a local accounting firm), and two children: an adorable six-year-old named Abigail and a one-year-old boy named Josiah.  At twenty-nine, I had accomplished a lot in life, and rarely thought of Miss Dottie or the truth about my missing legs.  Until one weekend, when we went to visit my parents.\n\nI knew Miss Dottie would be in town, but I wasn't too worried; the kids had been there before, and the crazy bitch in the red car hadn't bothered them.  But, of course, there's a first time for everything.\n\nIt happened on our first evening at my parents' house.  My mother was cooking dinner, and I'd taken a fussy Josiah out on the front porch so we could sit in the old rocking chair.  As I bounced my baby in my lap, I caught a glimpse of curly red hair in my peripheral.\n\nShit.  Miss Dottie.  What was she doing here?  She had *never* come to the house before.\n\n\"Hello, Caroline,\" she smiled.  \"Good to see you again!\"\n\n\"Hi, Miss Dottie,\" I said coolly.\n\n\"Oh my! Is that your new baby?\"\n\n\"Yes.\"\n\nWithout permission, Miss Dottie scooped up Josiah and cradled him against her amble bosom.  I jumped up, ready to snatch my child back.  Josiah gurgled happily, and Miss Dottie smiled a *very* unnerving smile.\n\n\"He's a beautiful baby,\" she cooed.  \"And he's lucky to have such a loving mother. Do you think he appreciates it?\"\n\n\"He's a *baby.*\"\n\n\"Does your sweet little Abigail love her little brother?\"\n\n\"She adores him! Aside from the occasional bout of jealousy, of course.\"\n\nMiss Dottie pursed her lips.  \"I may have to teach her a lesson. Evening, Caroline.\"  She handed Josiah back to me and walked away.\n\nMy hips were throbbing, but the pain was drowned out by the cold dread filling my body.  *I may have to teach her a lesson.*  What the fuck was Miss Dottie going to do?\n\n\"You're *not* putting your filthy fucking hands on my daughter, you bitch,\" I hissed before going back inside.\n\nLater that night, I snuck into the guest room where my children were sleeping and waited.  David and my parents were fast asleep, but I was on high alert, my maternal instincts going haywire.  I sat on the end of Abby's bed, my fists clenched, pain hammering away in my hips.\n\nAt midnight, I heard soft footsteps coming up the stairs.  I lay down beside my daughter, pretending to be asleep, but kept my eye on the door.\n\nWith a faint *creak*, it fell open, and Miss Dottie walked in.  She bent over Josiah's crib and sprayed my baby with a misty purple substance from a plain aerosol can.  I wanted to scream, but bit my tongue.  Miss Dottie sprayed Abby with the mist, and then me, but I held my breath.\n\n\"Come now, little one,\" Miss Dottie whispered.  She lifted my daughter out of bed and padded back down the hall.  I counted to one hundred before crawling downstairs, climbing into my wheelchair, and leaving the house through the front door.\n\nMiss Dottie was out of sight, but I knew exactly where to find her.\n\nI reached the town square just in time to catch Miss Dottie slipping into her trailer, cradling my little girl.  I squared my shoulders, clenched my jaw, and began to bang on the door.\n\n\"Miss Dottie!\" I barked.  \"You better open up right now or I swear I'll-\"\n\n\"Goodness, what's with all the commotion?\"  She stuck her head out, still grinning.  \"Caroline! What brings you around so late?\"\n\n\"Don't play dumb with me, you old cow! I know you've taken my daughter!\"\n\n\"I can assure you that Abigail is perfectly safe. Why don't you come in and see for yourself?\"\n\n\"Give her back!\" I snarled, but Miss Dottie simply reached down, lifted my wheelchair off the cobblestone ground, and pulled me inside.\n\nThe trailer's interior smelled like a hospital room, all disinfectant and rubbing alcohol.  The front room was dominated by a large steel operating table, which Abigail was currently strapped to, stripped naked and fast asleep.\n\n\"Abby!\" I screamed, but Miss Dottie held me back.\n\n\"Now, now, Caroline. You don't need to worry. I am simply going to perform a quick operation on your daughter. It won't hurt a bit, and she'll be right as rain in a few days. If it makes you feel better, you are welcome to watch.\"\n\nI should have fought her; I should have done more.  But horror had cemented me in place, and I was helpless.\n\nMiss Dottie inked a line across Abigail's belly and made a long incision with a shiny scalpel.  She then spread the skin with a pair of forceps and began slicing through the muscle.  The sight and smell of my daughter's blood made me wretch.  \"What the fuck are you doing?\" I hissed.\n\n\"Removing part of her liver, much like I did with your mother.\"\n\n\"*Why*?\"\n\nShe sighed, mopping at the blood with a clean white towel.  \"Children lack proper gratitude for their many blessings. All they seem to care about is what they *don't* have. This town is no exception. I grew up here myself, Carrie, so believe me when I say I know.\n\n\"I have made it my life's mission to teach children how to be grateful. That is why I steal the pieces of their bodies that they take for granted. I turn them into beautiful things that other children can possess and treasure.\"\n\n\"What do you mean-*no.*\"  I shook my head.  \"Don't tell me what I'm thinking is true.\"\n\n\"It is,\" Miss Dottie said simply.  \"My carvings are from human bone, my purses and belts from human flesh. My pearls were once human teeth, and I dye my scarves with blood.\"\n\n\"You crazy, fucked-up bitch,\" I snarled.  \"So *you* cut off my legs.\"\n\n\"Yes. I did. It was important you understood how lucky you were to have survived meningitis.\"\n\n\"I was *two*!\" I screamed.\n\n\"You're never too young to learn. Now, let me finish surgery on your daughter. Maybe I can turn her liver into a teething toy for little Josiah.\"\n\nShe looked right at me, the biggest shit-eating grin on her face, and I lost it.  I leapt out of my chair and slammed into Miss Dottie, knocking her to the floor.  After a short but vicious struggle, I wrenched the scalpel from her hand and held it to her veiny neck.\n\n\"If you *ever* touch my daughter again-\" I began, but Miss Dottie slapped my face, knocking me off of her.\n\n\"You shut your mouth, Caroline! I am simply doing my job! You would be wise not to interfere!\"\n\nI had never seen Miss Dottie angry before, and it only made her all the more terrifying.  But with the scalpel still in my hand, a tiny bit of my courage remained intact.\n\nI plunged the sharp object deep into Miss Dottie's calf.  She shrieked in pain and kicked at me, but missed and fell over, landing face-down on the floor.  I climbed onto her back, knotted my fingers through her curly red hair, and began slamming her face against the floor, again and again, until she was still.\n\n\"That was for my legs,\" I hissed.  \"And for my mother's liver. And for all the innocent children you've mutilated for the sake of teaching gratitude.\"\n\nWith the old lady bleeding and unconscious on the floor of her improvised torture table, I crawled to the phone and called the police.\n\n-----------------------------------------------------------------------------\n\nMiss Dottie and Abigail were both taken to the hospital.  My daughter needed stitches in her stomach, but had suffered no significant damage.  Miss Dottie had a broken nose and severe bruising to her face, as well as a dislocated jaw.  I myself was shaken up, but physically unharmed.\n\nWhen the cops raided Miss Dottie's trailer, they found a freezer full of severed limbs, eyeballs floating in formaldehyde, piles of bones, and skin dried and tanned so to resemble leather.  It seemed Miss Dottie had been stockpiling her \"supplies\" for decades.  It appeared she traveled all over the province, selling her macabre figurines and jewelry, and would come by our town every autumn to \"harvest\" what she needed.\n\nMiss Dottie was facing serious jail time, but before her case could go to trial, she vanished.  A massive search turned up nothing.  She has yet to return to my old town, but for all I know, she's found a new community to torment.\n\nSo here's my warning: keep an eye out for Miss Dottie.  Never let her anywhere near your children.  And if you notice that an awful lot of people in your town or city are missing body parts, don't ignore it.\n\nMost of Miss Dottie's odds and ends were taken by the police, and those that weren't were either destroyed or given away.  I got rid of everything I bought from that demon, except for one thing:\n\nA tiny white ivory elephant, which I believe was carved from my own femur bone.\n\nI know, it's fucked-up.  But to me, the elephant is kind of a good luck charm, and I carry it wherever I go.  It comforts me whenever my hips start to ache.  When the nightmares come.  When I feel like I'm being watched.\n\nIt gives me hope that, if Miss Dottie ever returns, she can't take anything else away from me.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Graphic Violence", "id": "64nqze", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 136, "report_reasons": null, "author": "CynicHappy", "saved": false, "mod_reports": [], "name": "t3_64nqze", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": true, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": "flair-trigger", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64nqze/miss_dotties_autumn_harvest/", "num_reports": null, "locked": false, "stickied": false, "created": 1491901782.0, "url": "https://www.reddit.com/r/nosleep/comments/64nqze/miss_dotties_autumn_harvest/", "author_flair_text": null, "quarantine": false, "title": "Miss Dottie's Autumn Harvest", "created_utc": 1491872982.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 136}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": "", "user_reports": [], "id": "dg3ur15", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "SleeplessWitch", "parent_id": "t3_64nqze", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Should have sliced that bitch's throat with that scalpel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Should have sliced that bitch&amp;#39;s throat with that scalpel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3ur15", "score_hidden": false, "stickied": false, "created": 1491913640.0, "created_utc": 1491884840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": "", "user_reports": [], "id": "dg3zuqb", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t3_64nqze", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I hate it when people that have no children of their own start telling parents how to raise their kids.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate it when people that have no children of their own start telling parents how to raise their kids.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3zuqb", "score_hidden": false, "stickied": false, "created": 1491924631.0, "created_utc": 1491895831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": "", "user_reports": [], "id": "dg3mon8", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Hayong", "parent_id": "t3_64nqze", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "it's always nice to have some sort of item to identify as a good luck charm. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s always nice to have some sort of item to identify as a good luck charm. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3mon8", "score_hidden": false, "stickied": false, "created": 1491902878.0, "created_utc": 1491874078.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": "", "user_reports": [], "id": "dg3zfzk", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "howlybird", "parent_id": "t3_64nqze", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This story gave me the chills. Good job, OP. I wonder what kind of creature she really was", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This story gave me the chills. Good job, OP. I wonder what kind of creature she really was&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3zfzk", "score_hidden": false, "stickied": false, "created": 1491923505.0, "created_utc": 1491894705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": "", "user_reports": [], "id": "dg4mw0k", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CynicHappy", "parent_id": "t1_dg4d2ij", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's certainly a possibility.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s certainly a possibility.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4mw0k", "score_hidden": false, "stickied": false, "created": 1491962166.0, "created_utc": 1491933366.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4d2ij", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CathrynMcCoy", "parent_id": "t1_dg4cjb5", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Do you think she actually used part of the body parts she stole from the kids to make some kind of elixir of youth?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think she actually used part of the body parts she stole from the kids to make some kind of elixir of youth?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4d2ij", "score_hidden": false, "stickied": false, "created": 1491951360.0, "created_utc": 1491922560.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cjb5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "CynicHappy", "parent_id": "t1_dg41bar", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I've checked the records. She was born in 1929, which would make her eighty-eight years old, if she's still alive. But she doesn't age; I don't think she's even human. She has no descendants, as far as I can tell.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve checked the records. She was born in 1929, which would make her eighty-eight years old, if she&amp;#39;s still alive. But she doesn&amp;#39;t age; I don&amp;#39;t think she&amp;#39;s even human. She has no descendants, as far as I can tell.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4cjb5", "score_hidden": false, "stickied": false, "created": 1491950752.0, "created_utc": 1491921952.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": "", "user_reports": [], "id": "dg534d5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theotherghostgirl", "parent_id": "t1_dg5320p", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I think there are lots of similar critters that like eating livers so that's also a possibility. \nKeep some garlic around, it'll keep her off your scent at least", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think there are lots of similar critters that like eating livers so that&amp;#39;s also a possibility. \nKeep some garlic around, it&amp;#39;ll keep her off your scent at least&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg534d5", "score_hidden": false, "stickied": false, "created": 1491980867.0, "created_utc": 1491952067.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5320p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CynicHappy", "parent_id": "t1_dg52ixm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "As far as I know, she never actually *drank* blood. Still, that's possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As far as I know, she never actually &lt;em&gt;drank&lt;/em&gt; blood. Still, that&amp;#39;s possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5320p", "score_hidden": false, "stickied": false, "created": 1491980779.0, "created_utc": 1491951979.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52ixm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "theotherghostgirl", "parent_id": "t1_dg41bar", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "99% sure she's a vampire", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;99% sure she&amp;#39;s a vampire&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg52ixm", "score_hidden": false, "stickied": false, "created": 1491980076.0, "created_utc": 1491951276.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg41bar", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "CathrynMcCoy", "parent_id": "t3_64nqze", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Is there any explanation of why she didn't age?\nSince she is born in your town, can you find out when she was born?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there any explanation of why she didn&amp;#39;t age?\nSince she is born in your town, can you find out when she was born?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg41bar", "score_hidden": false, "stickied": false, "created": 1491928968.0, "created_utc": 1491900168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64nqze", "likes": null, "replies": "", "user_reports": [], "id": "dg5nvu2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mariarobot", "parent_id": "t3_64nqze", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"keep an eye out for Miss Dottie\"\n\nUm, no, thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;keep an eye out for Miss Dottie&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Um, no, thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5nvu2", "score_hidden": false, "stickied": false, "created": 1492017223.0, "created_utc": 1491988423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]