[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of you probably know about the Chilean mining accident of 2010. It was also called the &amp;quot;Los 33&amp;quot; because of the 33 miners trapped underground. It&amp;#39;s amazing that all 33 survived the entire 69 days it took until they were rescued.&lt;/p&gt;\n\n&lt;p&gt;There was a whole media circus about it with an estimated billion people watching the rescue on TV or the internet. There was so much news that one fact was completely drowned out - and to me, it&amp;#39;s the most important of them all.&lt;/p&gt;\n\n&lt;p&gt;I became interested in the topic because of a school paper I was writing. I mentioned the project to my grandfather (which was a terrible mistake because he is ZEALOUS about school). He was trying to get my mother to enroll me in an international baccalaureate college prep school at FIRST GRADE. Education is my future - he wishes he had those opportunities when he was a kid - I&amp;#39;m an ungrateful brat for taking my fortune for blessing - you know the drill.&lt;/p&gt;\n\n&lt;p&gt;Anyway, he wouldn&amp;#39;t let me use wikipedia or any easy source for the essay. Instead, he called up his old friend who actually worked on the rescue crew in Chile. So what should have been an hour long paper turned into an hour phone interview, three hours of driving, and a whole BOOK about rescue operations. Who since the internet was invented ever needed to read a book about anything?&lt;/p&gt;\n\n&lt;p&gt;Meeting the rescue worker guy was pretty interesting though. He had tan leather skin like you&amp;#39;d expect to find on a car seat instead of a person. His accent was a little thick, and sometimes he couldn&amp;#39;t find the right word so he had to switch to Spanish. I know next to zero Spanish, but my grandfather would make me write down everything he said verbatim so I could translate it at home. Granddad literally said &amp;quot;If you try to take the easy road in life, life is going to take the easy road with you. Right up your ass&amp;quot;. I don&amp;#39;t know what that means, but asking him to clarify didn&amp;#39;t seem necessary. &lt;/p&gt;\n\n&lt;p&gt;About half-way through the interview with the rescue guy, My grandfather got up to go to the bathroom. I was asking questions about how many people were down there, and he kept saying &amp;quot;treinta-y-dos&amp;quot;, or 32. The movie is even called &amp;quot;The 33&amp;quot; - everything online says &amp;quot;The 33&amp;quot;, but he was adamant. Then he gave me this weird look - like he was shell-shocked or something. The kind of blank look you expect to see holocaust survivors wearing. He leaned in real close and started rattling off some stuff in English and some in Spanish, and I did my best to keep up.&lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t until the car ride home when I was able to translate what he said. I checked it half a dozen times - I even ran the transcript by my Grandfather (who is fluent, but still made me do my own translating first). Here is what we put together:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;All the media - the news - the story spinners - they all say 33 miners were trapped. And why wouldn&amp;#39;t they? 33 people came out of that mine. The miners were trapped 700 meters in the ground - there was no way in or out. But the miners who come out - right when I first pull them out - they all say the same thing.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;There were only 32 miners trapped. They count and they count - every day - every few hours so everybody taken care of - and then one day they count again and there is 33.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;They were a band of brothers - you can&amp;#39;t go through an ordeal like that and not become family - and they stuck by each other. They never said one of them didn&amp;#39;t belong.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;But I heard stories. They say one miner didn&amp;#39;t sleep like the others. He just sat against the wall and hummed some tune nobody recognized.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;They say one miner didn&amp;#39;t eat like the others, but they didn&amp;#39;t complain because they had to save their provisions.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;They say one miner - they know who but they no telling - one miner didn&amp;#39;t talk about his family or friends or wanting to get out.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;All this one miner talked about was how comforting the darkness felt. How they - the trapped miners - were the lucky ones.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;That the earth only swallowed them to keep them safe.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;While all the rest would drown in a sea of fire of their own kindling.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t about the paper anymore. Next week I&amp;#39;m going to drive back to see my grandfather&amp;#39;s friend. I&amp;#39;m going to try and track down the unexplained miner and see what happened to him. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Finding one of the miners was lot harder than I expected. Don&amp;#39;t get me wrong, I didn&amp;#39;t think it would be easy. I figured that most of them would still be living in Chile, and that&amp;#39;s still a hell-of-a road trip from Texas. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t think it would be this hard to just find a phone number or ANYTHING though. After the media storm died down in 2010, it seems like nothing changed for the miners. Most of them were laid off because of that mine&amp;#39;s closure, and those that DID find a new mining company suffered through the same intolerable working conditions.  &lt;/p&gt;\n\n&lt;p&gt;Even the Hollywood movie didn&amp;#39;t help them because their story rights were considered public domain after the massive publicity. All those men got was a pathetic 7,000$ compensation for their time spent in Hell. The more I searched, the grimmer the story became. &lt;/p&gt;\n\n&lt;p&gt;Over the last seven years, they have been dying one by one. A few from other mine accidents, others from health complications undoubtedly exasperated by their ordeal, but more than anything: suicides. I get it - they&amp;#39;ve had a hard life - but it was the &lt;em&gt;manner&lt;/em&gt; they killed themselves that was the most unsettling. &lt;/p&gt;\n\n&lt;p&gt;Self-immolation. There were a few bullets, one poison, two jumpers - but mostly I found account after account of miners dousing themselves in gasoline and burning themselves alive. It was difficult not to connect the incidents with those haunting words from the 33rd miner:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;And all the rest would drown in a sea of fire of their own kindling.&lt;/em&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;It was my grandfather&amp;#39;s friend (Vicente) who found a lead. Two of the miners who were invited to the film premiere in Los Angeles had decided to stay in America. Vicente found a recent article which followed up with the pair about the incident, although both had declined an interview. &lt;/p&gt;\n\n&lt;p&gt;It was still about an 18 hour road trip, but after I shared my research with Vicente, he volunteered to make the drive with me. I convinced my grandfather that I wanted to use this research for my future graduation thesis, and he convinced my mother to let me go. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What are you going to ask them?&amp;quot; Vicente asked on the drive. One of the conditions for the trip was that I help him practice his English, and he talked non-stop the whole way.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m going to ask them to help me find the 33rd miner. The one who wasn&amp;#39;t human.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;El Diablo,&amp;quot; Vicente said. &amp;quot;And if he&amp;#39;s one of the two you meet? What do you say to him then?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I guess I&amp;#39;ll tell him to go to Hell.&amp;quot; I meant it as a joke, but neither of us laughed. &amp;quot;Or find out why he&amp;#39;s here.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And if you don&amp;#39;t like what he says? You will stop him?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t have an answer then, but I had plenty of time to think about it on the drive to LA.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;We found one of the miner&amp;#39;s address&amp;#39;s by contacting the newspaper which tried to interview him. Vicente told the reporter that he and the miner were old friends - an account made credible by his first person details of the rescue operation. &lt;/p&gt;\n\n&lt;p&gt;Vicente told the reporter that he could persuade the miner into accepting the interview if we only knew where he lived - and voila. I guess private information is less important than a shot at a successful article. &lt;/p&gt;\n\n&lt;p&gt;Vicente and I were soon walking up the dilapidated staircase of the apartment - although even calling this dump an apartment seemed insulting to all the other residences which share a name.&lt;/p&gt;\n\n&lt;p&gt;The walls were covered with grime thick enough to sink a finger into. Trash, dirty diapers, and decaying leftovers littered the hallways, and on every floor we heard either couples fighting, women screaming at their kids, or loud drunken sex. I&amp;#39;m glad Vicente was with me when I knocked on the door. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Come in.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Vicente and I exchanged a quizzical expression. If I was living in this kind of neighborhood, I wouldn&amp;#39;t invite strangers in. Vicente shrugged and opened the door. &lt;/p&gt;\n\n&lt;p&gt;It was almost surreal walking inside. Fresh white paint on the walls, spotlessly shined kitchen counter, a sterile chemical smell like a hospital - it was like stepping through the door into a different world. &lt;/p&gt;\n\n&lt;p&gt;A middle aged man blinked his black, sunken eyes at us. His dark skin and hair looked a lot like Vicente - he could easily have been Chilean. &lt;/p&gt;\n\n&lt;p&gt;He was sitting on a sofa which faced a blank white wall. There weren&amp;#39;t any books, or TV, or anything. I can&amp;#39;t imagine what he was doing before we came in. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Have a seat.&amp;quot; The man patted the cushion beside him. &lt;/p&gt;\n\n&lt;p&gt;There weren&amp;#39;t any chairs, and sitting next to him on the sofa seemed uncomfortably familiar. I shifted my weight from leg to leg and looked to Vicente for help. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sorry to just show up,&amp;quot; Vicente said, obviously uncomfortable as well. &amp;quot;I hope we didn&amp;#39;t interrupt nothing.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The man looked back at his blank white wall. He shrugged. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Are you a survivor from the mine?&amp;quot; I blurted out. Vicente put a hand out to caution me, but I kept going. &amp;quot;I was writing a school paper on - well I wanted to know about - who was the 33rd miner? The one who didn&amp;#39;t belong.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Didn&amp;#39;t belong?&amp;quot; he asked, still addressing the white wall. &amp;quot;He was the only one who &lt;em&gt;did&lt;/em&gt; belong down there.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Can you tell me about him?&amp;quot; He pulled a notebook out of his pocket and began writing something down. I looked at Vicente, and he smiled encouragingly. All those hours in the car and this was all I could think about. I was finally going to get some answers.&lt;/p&gt;\n\n&lt;p&gt;The man offered me the notebook, and I moved close to take it from him. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Agustin: 3006 W Burbank Blvd. Los Angeles.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ask him yourself,&amp;quot; the miner said. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Will you go with us?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;The miner shook his head, still not looking at me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If there&amp;#39;s something bad going to happen, you have to tell us,&amp;quot; Vicente added. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s too late,&amp;quot; the miner replied. A shudder passed over his body as though he were shivering from a cold wind blowing from the inside out. &amp;quot;He&amp;#39;s the last one left, and it has already begun.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Why was he looking still looking at the wall? I started to move around in front of the sofa to force him to look at me when -   &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Look out!&amp;quot; A hand landed on the back of my shirt and yanked me hard. I spun to the ground, still clutching the notebook. I tried to push Vicente off, but his old hands were like iron. It wasn&amp;#39;t until he had dragged me almost out the door when I noticed the man on the sofa was holding a handgun. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;BLAM&lt;/em&gt;. Vicente let go of my shirt and stared with me. The miner had opened his mouth and put a bullet through his own brain. The once perfect white wall behind him looked like an open wound. Vicente grabbed me by the shirt again and dragged me from the room. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I&amp;#39;m outside of the 33rd miner&amp;#39;s house, but this time I&amp;#39;m alone.&lt;/p&gt;\n\n&lt;p&gt;After that grizzly spectacle, Vicente refused to let me keep searching. He was ready to drive straight through the night, all the way back to Texas right then and there. &lt;/p&gt;\n\n&lt;p&gt;He didn&amp;#39;t want to call the police. The reporter knew we were going, but he didn&amp;#39;t know who we were. Vicente figured that if we just left the state now, we&amp;#39;d never get tangled up in this any more than we already were. &lt;/p&gt;\n\n&lt;p&gt;I saw it differently though. If the last miner really was the only one of the 33 still alive, then Vicente and I might be the only two people who knew something was going on. We had a responsibility to find out more. &lt;/p&gt;\n\n&lt;p&gt;It was all I could do just to convince Vicente to get a motel for the night before driving back. I used the extra time to beg and plead with him, but it was impossible to get through. &amp;quot;Let him burn himself alive for all I care. We never should have come here.&amp;quot; I might as well have been begging the sun not to set in the evening. &lt;/p&gt;\n\n&lt;p&gt;I waited until Vicente fell asleep before slipping down to the street to order an UBER. A dark sedan swept me down the unfamiliar streets, but I was so wrapped up in my own thoughts that I didn&amp;#39;t even speak a word to the driver. I wish I had though - I wish I&amp;#39;d asked him to wait and make sure I was okay, but he&amp;#39;s gone now. It&amp;#39;s going to just be me and the Devil. &lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t a house or an apartment building though. I was standing outside a crematorium. What if the miner simply worked here now? By the time they were opened again, Vicente would be awake and we&amp;#39;d be driving back to Texas. I circled round the building, looking for some clues or staff directories or anything. Maybe this was an unhealthy obsession for me. Maybe I should just let it go and stay out of trouble like Vicente. &lt;/p&gt;\n\n&lt;p&gt;But trouble is there whether you&amp;#39;re looking for it or not, and it&amp;#39;s best to know what&amp;#39;s coming before it hits you. There was a light on in the back of the building. It took about ten minutes pacing outside in the darkness before my heart slowed to a familiar rhythm and I was ready to approach. &lt;/p&gt;\n\n&lt;p&gt;I knocked on the door. No answer. I peered through the lit window - looked like an office room. I knocked on the glass. No answer. My heart was starting to race again. I was stupid for even being here. Someone had just forgotten to turn out the light when they went home. &lt;/p&gt;\n\n&lt;p&gt;I went back to the door and tried the handle. It was unlocked. The grating sound of the door swinging open seemed so loud in the still night that people must have heard it a block away. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello? Anyone here?&amp;quot; I called out, immediately regretting it. I don&amp;#39;t know which was worse, taking the Devil by surprise or letting him know I was coming. I still switched on every light I could find, just in case something jumped out at me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Agustin?&amp;quot; I shouted. No answer. I found another door with light seeping under the crack and opened it.&lt;/p&gt;\n\n&lt;p&gt;Agustin was inside. I could tell because of the name-tag on his overalls. He was on his hands and knees, the charred remains of his head placed firmly inside one of the cremation ovens. I don&amp;#39;t know whether he died the moment his head went inside, but I&amp;#39;d imagine he had to hold it there for awhile. What could he possibly have seen or known that was worse than this?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I called an UBER to take me back to the motel. I guess that was it. All 33 were dead. I hope whatever evil spirit crawled up from the earth with those men had spent its wrath doing whatever it did to them and was sleeping peacefully now. &lt;/p&gt;\n\n&lt;p&gt;The same dark sedan stopped and I got it. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi there,&amp;quot; I said. &amp;quot;Thanks for getting me again. &lt;/p&gt;\n\n&lt;p&gt;The driver - or the miner, I guess they were the same - turned around and smiled. It was hard not to smile with the bottom half of your jaw hanging loose. I could clearly see the pathway where the bullet entered his mouth and tore up through his brain. It was mesmerizing to watch that mass of loose flesh contort to form the shapes necessary for speech.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I see you&amp;#39;ve found the man you&amp;#39;re looking for,&amp;quot; what&amp;#39;s left of his face replied. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A man wouldn&amp;#39;t be alive right now. What are you?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The loose flesh pulled tighter and a trickle of blood dribbled out onto the driver&amp;#39;s console. He didn&amp;#39;t kill the other miners. They killed themselves - as far as I could tell. As long as I kept my wits about me, I could make it through this. I looked down at my lap so I could pretend I was just having an ordinary conversation. Not as easy as it sounds with the blood dripping down the console around my feet. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I will answer one question for your persistence. Don&amp;#39;t waste it on such trivial semantics.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I took a deep breath. It smelled like food which has just begun to spoil. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How can I stop the sea of fire you mentioned when you climbed out of that mine?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Only fools play with matches.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I had to look up at that. Even if it meant staring into that grotesque face - there&amp;#39;s no way my single question was going to be wasted with that shitty answer.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What is that supposed to mean? Why are you even here? Are you trying to warn us not to blow ourselves up, because we know that without whatever the fuck game you&amp;#39;re playing.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The miner slumped forward into his seat. The blood on the back of his head was congealed - he had died quite awhile ago. I wanted to scream - to break the window - to punch HIM in his disgusting bloody face, but I was next to a dead man for the third time this night. More than anything, I wanted to get home. I just got out of the car and started walking the whole way back toward the motel.  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The notebook! If that miner was the real Devil - and that&amp;#39;s the only explanation that makes sense to me - then he had given me his notebook. I stopped walking and used the light from my phone to desperately flip through the pages looking for some other clue. There on the first page were more words, written in a fluid hand.    &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;em&gt;While they sat down in the dark, waiting for tomorrow&amp;#39;s spark, telling tales of broken hearts, I joined them in their cell.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Don&amp;#39;t be afraid, I sang to each, don&amp;#39;t hate the world beyond your reach, I hear your prayers as you beseech, me save you with my spell.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Only fools play with matches, or bury treasure with no latches, or sign a deal when the catch is, the soul you have to sell.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;But the fool has born you, raised you, sold you. The fool has torn you, dazed you, told you. He won&amp;#39;t mourn you, praise you, hold you, when finally you yell.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Only fools play with matches, and suffer all those needless scratches, you will find your soul detaches, free at last in Hell.&lt;/em&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;How much must one man suffer before Hell becomes an escape? I hope I &lt;a href=\"http://www.facebook.com/sirtobiaswade\"&gt;never find out&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A lot of you probably know about the Chilean mining accident of 2010. It was also called the \"Los 33\" because of the 33 miners trapped underground. It's amazing that all 33 survived the entire 69 days it took until they were rescued.\n\nThere was a whole media circus about it with an estimated billion people watching the rescue on TV or the internet. There was so much news that one fact was completely drowned out - and to me, it's the most important of them all.\n\nI became interested in the topic because of a school paper I was writing. I mentioned the project to my grandfather (which was a terrible mistake because he is ZEALOUS about school). He was trying to get my mother to enroll me in an international baccalaureate college prep school at FIRST GRADE. Education is my future - he wishes he had those opportunities when he was a kid - I'm an ungrateful brat for taking my fortune for blessing - you know the drill.\n\nAnyway, he wouldn't let me use wikipedia or any easy source for the essay. Instead, he called up his old friend who actually worked on the rescue crew in Chile. So what should have been an hour long paper turned into an hour phone interview, three hours of driving, and a whole BOOK about rescue operations. Who since the internet was invented ever needed to read a book about anything?\n\nMeeting the rescue worker guy was pretty interesting though. He had tan leather skin like you'd expect to find on a car seat instead of a person. His accent was a little thick, and sometimes he couldn't find the right word so he had to switch to Spanish. I know next to zero Spanish, but my grandfather would make me write down everything he said verbatim so I could translate it at home. Granddad literally said \"If you try to take the easy road in life, life is going to take the easy road with you. Right up your ass\". I don't know what that means, but asking him to clarify didn't seem necessary. \n\nAbout half-way through the interview with the rescue guy, My grandfather got up to go to the bathroom. I was asking questions about how many people were down there, and he kept saying \"treinta-y-dos\", or 32. The movie is even called \"The 33\" - everything online says \"The 33\", but he was adamant. Then he gave me this weird look - like he was shell-shocked or something. The kind of blank look you expect to see holocaust survivors wearing. He leaned in real close and started rattling off some stuff in English and some in Spanish, and I did my best to keep up.\n\nIt wasn't until the car ride home when I was able to translate what he said. I checked it half a dozen times - I even ran the transcript by my Grandfather (who is fluent, but still made me do my own translating first). Here is what we put together:\n\n*\"All the media - the news - the story spinners - they all say 33 miners were trapped. And why wouldn't they? 33 people came out of that mine. The miners were trapped 700 meters in the ground - there was no way in or out. But the miners who come out - right when I first pull them out - they all say the same thing.*\n\n*There were only 32 miners trapped. They count and they count - every day - every few hours so everybody taken care of - and then one day they count again and there is 33.*\n\n*They were a band of brothers - you can't go through an ordeal like that and not become family - and they stuck by each other. They never said one of them didn't belong.*\n\n*But I heard stories. They say one miner didn't sleep like the others. He just sat against the wall and hummed some tune nobody recognized.*\n\n*They say one miner didn't eat like the others, but they didn't complain because they had to save their provisions.*\n\n*They say one miner - they know who but they no telling - one miner didn't talk about his family or friends or wanting to get out.*\n\n*All this one miner talked about was how comforting the darkness felt. How they - the trapped miners - were the lucky ones.*\n\n*That the earth only swallowed them to keep them safe.*\n\n*While all the rest would drown in a sea of fire of their own kindling.\"*\n\nThis isn't about the paper anymore. Next week I'm going to drive back to see my grandfather's friend. I'm going to try and track down the unexplained miner and see what happened to him. \n\n---\n\nFinding one of the miners was lot harder than I expected. Don't get me wrong, I didn't think it would be easy. I figured that most of them would still be living in Chile, and that's still a hell-of-a road trip from Texas. \n\nI didn't think it would be this hard to just find a phone number or ANYTHING though. After the media storm died down in 2010, it seems like nothing changed for the miners. Most of them were laid off because of that mine's closure, and those that DID find a new mining company suffered through the same intolerable working conditions.  \n\nEven the Hollywood movie didn't help them because their story rights were considered public domain after the massive publicity. All those men got was a pathetic 7,000$ compensation for their time spent in Hell. The more I searched, the grimmer the story became. \n\nOver the last seven years, they have been dying one by one. A few from other mine accidents, others from health complications undoubtedly exasperated by their ordeal, but more than anything: suicides. I get it - they've had a hard life - but it was the *manner* they killed themselves that was the most unsettling. \n\nSelf-immolation. There were a few bullets, one poison, two jumpers - but mostly I found account after account of miners dousing themselves in gasoline and burning themselves alive. It was difficult not to connect the incidents with those haunting words from the 33rd miner:\n\n*And all the rest would drown in a sea of fire of their own kindling.*\n\n---\n\nIt was my grandfather's friend (Vicente) who found a lead. Two of the miners who were invited to the film premiere in Los Angeles had decided to stay in America. Vicente found a recent article which followed up with the pair about the incident, although both had declined an interview. \n\nIt was still about an 18 hour road trip, but after I shared my research with Vicente, he volunteered to make the drive with me. I convinced my grandfather that I wanted to use this research for my future graduation thesis, and he convinced my mother to let me go. \n\n\"What are you going to ask them?\" Vicente asked on the drive. One of the conditions for the trip was that I help him practice his English, and he talked non-stop the whole way.\n\n\"I'm going to ask them to help me find the 33rd miner. The one who wasn't human.\" \n\n\"El Diablo,\" Vicente said. \"And if he's one of the two you meet? What do you say to him then?\" \n\n\"I guess I'll tell him to go to Hell.\" I meant it as a joke, but neither of us laughed. \"Or find out why he's here.\"\n\n\"And if you don't like what he says? You will stop him?\" \n\nI didn't have an answer then, but I had plenty of time to think about it on the drive to LA.\n\n---\n\nWe found one of the miner's address's by contacting the newspaper which tried to interview him. Vicente told the reporter that he and the miner were old friends - an account made credible by his first person details of the rescue operation. \n\nVicente told the reporter that he could persuade the miner into accepting the interview if we only knew where he lived - and voila. I guess private information is less important than a shot at a successful article. \n\nVicente and I were soon walking up the dilapidated staircase of the apartment - although even calling this dump an apartment seemed insulting to all the other residences which share a name.\n\nThe walls were covered with grime thick enough to sink a finger into. Trash, dirty diapers, and decaying leftovers littered the hallways, and on every floor we heard either couples fighting, women screaming at their kids, or loud drunken sex. I'm glad Vicente was with me when I knocked on the door. \n\n\"Come in.\" \n\nVicente and I exchanged a quizzical expression. If I was living in this kind of neighborhood, I wouldn't invite strangers in. Vicente shrugged and opened the door. \n\nIt was almost surreal walking inside. Fresh white paint on the walls, spotlessly shined kitchen counter, a sterile chemical smell like a hospital - it was like stepping through the door into a different world. \n \nA middle aged man blinked his black, sunken eyes at us. His dark skin and hair looked a lot like Vicente - he could easily have been Chilean. \n\nHe was sitting on a sofa which faced a blank white wall. There weren't any books, or TV, or anything. I can't imagine what he was doing before we came in. \n\n\"Have a seat.\" The man patted the cushion beside him. \n\nThere weren't any chairs, and sitting next to him on the sofa seemed uncomfortably familiar. I shifted my weight from leg to leg and looked to Vicente for help. \n\n\"Sorry to just show up,\" Vicente said, obviously uncomfortable as well. \"I hope we didn't interrupt nothing.\" \n\nThe man looked back at his blank white wall. He shrugged. \n\n\"Are you a survivor from the mine?\" I blurted out. Vicente put a hand out to caution me, but I kept going. \"I was writing a school paper on - well I wanted to know about - who was the 33rd miner? The one who didn't belong.\" \n\n\"Didn't belong?\" he asked, still addressing the white wall. \"He was the only one who *did* belong down there.\" \n\n\"Can you tell me about him?\" He pulled a notebook out of his pocket and began writing something down. I looked at Vicente, and he smiled encouragingly. All those hours in the car and this was all I could think about. I was finally going to get some answers.\n\nThe man offered me the notebook, and I moved close to take it from him. \n\n*Agustin: 3006 W Burbank Blvd. Los Angeles.*\n\n\"Ask him yourself,\" the miner said. \n\n\"Will you go with us?\" I asked. \n\nThe miner shook his head, still not looking at me. \n\n\"If there's something bad going to happen, you have to tell us,\" Vicente added. \n \n\"It's too late,\" the miner replied. A shudder passed over his body as though he were shivering from a cold wind blowing from the inside out. \"He's the last one left, and it has already begun.\" \n\nWhy was he looking still looking at the wall? I started to move around in front of the sofa to force him to look at me when -   \n\n\"Look out!\" A hand landed on the back of my shirt and yanked me hard. I spun to the ground, still clutching the notebook. I tried to push Vicente off, but his old hands were like iron. It wasn't until he had dragged me almost out the door when I noticed the man on the sofa was holding a handgun. \n\n*BLAM*. Vicente let go of my shirt and stared with me. The miner had opened his mouth and put a bullet through his own brain. The once perfect white wall behind him looked like an open wound. Vicente grabbed me by the shirt again and dragged me from the room. \n\n---\n\nI'm outside of the 33rd miner's house, but this time I'm alone.\n \nAfter that grizzly spectacle, Vicente refused to let me keep searching. He was ready to drive straight through the night, all the way back to Texas right then and there. \n\nHe didn't want to call the police. The reporter knew we were going, but he didn't know who we were. Vicente figured that if we just left the state now, we'd never get tangled up in this any more than we already were. \n\nI saw it differently though. If the last miner really was the only one of the 33 still alive, then Vicente and I might be the only two people who knew something was going on. We had a responsibility to find out more. \n\nIt was all I could do just to convince Vicente to get a motel for the night before driving back. I used the extra time to beg and plead with him, but it was impossible to get through. \"Let him burn himself alive for all I care. We never should have come here.\" I might as well have been begging the sun not to set in the evening. \n\nI waited until Vicente fell asleep before slipping down to the street to order an UBER. A dark sedan swept me down the unfamiliar streets, but I was so wrapped up in my own thoughts that I didn't even speak a word to the driver. I wish I had though - I wish I'd asked him to wait and make sure I was okay, but he's gone now. It's going to just be me and the Devil. \n\nThis isn't a house or an apartment building though. I was standing outside a crematorium. What if the miner simply worked here now? By the time they were opened again, Vicente would be awake and we'd be driving back to Texas. I circled round the building, looking for some clues or staff directories or anything. Maybe this was an unhealthy obsession for me. Maybe I should just let it go and stay out of trouble like Vicente. \n\nBut trouble is there whether you're looking for it or not, and it's best to know what's coming before it hits you. There was a light on in the back of the building. It took about ten minutes pacing outside in the darkness before my heart slowed to a familiar rhythm and I was ready to approach. \n\nI knocked on the door. No answer. I peered through the lit window - looked like an office room. I knocked on the glass. No answer. My heart was starting to race again. I was stupid for even being here. Someone had just forgotten to turn out the light when they went home. \n\nI went back to the door and tried the handle. It was unlocked. The grating sound of the door swinging open seemed so loud in the still night that people must have heard it a block away. \n\n\"Hello? Anyone here?\" I called out, immediately regretting it. I don't know which was worse, taking the Devil by surprise or letting him know I was coming. I still switched on every light I could find, just in case something jumped out at me. \n\n\"Agustin?\" I shouted. No answer. I found another door with light seeping under the crack and opened it.\n\nAgustin was inside. I could tell because of the name-tag on his overalls. He was on his hands and knees, the charred remains of his head placed firmly inside one of the cremation ovens. I don't know whether he died the moment his head went inside, but I'd imagine he had to hold it there for awhile. What could he possibly have seen or known that was worse than this?\n\n---\n\nI called an UBER to take me back to the motel. I guess that was it. All 33 were dead. I hope whatever evil spirit crawled up from the earth with those men had spent its wrath doing whatever it did to them and was sleeping peacefully now. \n\nThe same dark sedan stopped and I got it. \n\n\"Hi there,\" I said. \"Thanks for getting me again. \n\nThe driver - or the miner, I guess they were the same - turned around and smiled. It was hard not to smile with the bottom half of your jaw hanging loose. I could clearly see the pathway where the bullet entered his mouth and tore up through his brain. It was mesmerizing to watch that mass of loose flesh contort to form the shapes necessary for speech.  \n\n\"I see you've found the man you're looking for,\" what's left of his face replied. \n\n\"A man wouldn't be alive right now. What are you?\" \n\nThe loose flesh pulled tighter and a trickle of blood dribbled out onto the driver's console. He didn't kill the other miners. They killed themselves - as far as I could tell. As long as I kept my wits about me, I could make it through this. I looked down at my lap so I could pretend I was just having an ordinary conversation. Not as easy as it sounds with the blood dripping down the console around my feet. \n\n\"I will answer one question for your persistence. Don't waste it on such trivial semantics.\" \n\nI took a deep breath. It smelled like food which has just begun to spoil. \n\n\"How can I stop the sea of fire you mentioned when you climbed out of that mine?\" \n\n\"Only fools play with matches.\" \n\nI had to look up at that. Even if it meant staring into that grotesque face - there's no way my single question was going to be wasted with that shitty answer.\n\n\"What is that supposed to mean? Why are you even here? Are you trying to warn us not to blow ourselves up, because we know that without whatever the fuck game you're playing.\" \n\nThe miner slumped forward into his seat. The blood on the back of his head was congealed - he had died quite awhile ago. I wanted to scream - to break the window - to punch HIM in his disgusting bloody face, but I was next to a dead man for the third time this night. More than anything, I wanted to get home. I just got out of the car and started walking the whole way back toward the motel.  \n\n---\n\nThe notebook! If that miner was the real Devil - and that's the only explanation that makes sense to me - then he had given me his notebook. I stopped walking and used the light from my phone to desperately flip through the pages looking for some other clue. There on the first page were more words, written in a fluid hand.    \n\n---\n\n*While they sat down in the dark, waiting for tomorrow's spark, telling tales of broken hearts, I joined them in their cell.*\n\n*Don't be afraid, I sang to each, don't hate the world beyond your reach, I hear your prayers as you beseech, me save you with my spell.*\n\n*Only fools play with matches, or bury treasure with no latches, or sign a deal when the catch is, the soul you have to sell.* \n\n*But the fool has born you, raised you, sold you. The fool has torn you, dazed you, told you. He won't mourn you, praise you, hold you, when finally you yell.*\n \n*Only fools play with matches, and suffer all those needless scratches, you will find your soul detaches, free at last in Hell.*\n\n---\n\nHow much must one man suffer before Hell becomes an escape? I hope I [never find out](http://www.facebook.com/sirtobiaswade)\n\n\n\n \n\n ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64olfm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 353, "report_reasons": null, "author": "TobiasWade", "saved": false, "mod_reports": [], "name": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64olfm/the_32/", "num_reports": null, "locked": false, "stickied": false, "created": 1491911913.0, "url": "https://www.reddit.com/r/nosleep/comments/64olfm/the_32/", "author_flair_text": null, "quarantine": false, "title": "The 32", "created_utc": 1491883113.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 353}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg5ve1f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OnyxOctopus", "parent_id": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Updated and reposted with moderator approval. Please keep this in mind before reporting as a repost. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Updated and reposted with moderator approval. Please keep this in mind before reporting as a repost. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5ve1f", "score_hidden": true, "stickied": true, "created": 1492033376.0, "created_utc": 1492004576.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg3y34s", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "TobiasWade", "parent_id": "t1_dg3w35v", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "And we're all flammable", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And we&amp;#39;re all flammable&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3y34s", "score_hidden": false, "stickied": false, "created": 1491920130.0, "created_utc": 1491891330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3w35v", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "iliveanotherlife", "parent_id": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"Only fools play with matches\" is pretty clear to me. And the Devil is the most famous match.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Only fools play with matches&amp;quot; is pretty clear to me. And the Devil is the most famous match.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3w35v", "score_hidden": false, "stickied": false, "created": 1491915988.0, "created_utc": 1491887188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg4054w", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Brock_Music", "parent_id": "t1_dg3zpdi", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh alright, thanks ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh alright, thanks &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4054w", "score_hidden": false, "stickied": false, "created": 1491925447.0, "created_utc": 1491896647.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg5mnn8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TattleTayles", "parent_id": "t1_dg3zpdi", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Sick reference bro.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sick reference bro.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5mnn8", "score_hidden": false, "stickied": false, "created": 1492013353.0, "created_utc": 1491984553.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3zpdi", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Aardwarkthe2nd", "parent_id": "t1_dg3z4hk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yeag, only the first two parts were uploaded and deleted later. Dis is the full story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeag, only the first two parts were uploaded and deleted later. Dis is the full story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3zpdi", "score_hidden": false, "stickied": false, "created": 1491924220.0, "created_utc": 1491895420.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg4nnqq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thisbrokenlife_", "parent_id": "t1_dg3z4hk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Me too", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Me too&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4nnqq", "score_hidden": false, "stickied": false, "created": 1491963016.0, "created_utc": 1491934216.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3z4hk", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "Brock_Music", "parent_id": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I think I've read this exact story before", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I&amp;#39;ve read this exact story before&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3z4hk", "score_hidden": false, "stickied": false, "created": 1491922665.0, "created_utc": 1491893865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg4ytls", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cherman321", "parent_id": "t1_dg43vrk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Had to login just for this comment, ugh.  It. Is. Terrible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Had to login just for this comment, ugh.  It. Is. Terrible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4ytls", "score_hidden": false, "stickied": false, "created": 1491975406.0, "created_utc": 1491946606.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43vrk", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Suitedspy", "parent_id": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The real horror story here is the international baccalaureate", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The real horror story here is the international baccalaureate&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg43vrk", "score_hidden": false, "stickied": false, "created": 1491936766.0, "created_utc": 1491907966.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg4dmpn", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "calebwhite23", "parent_id": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "They made a deal with the devil to escape the mind, at the cost of their own souls. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They made a deal with the devil to escape the mind, at the cost of their own souls. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4dmpn", "score_hidden": false, "stickied": false, "created": 1491952003.0, "created_utc": 1491923203.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg45p4q", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "musicissweeter", "parent_id": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Tsk tsk...trying so hard to find the devil,even if he writes beautiful poetry, is foolish OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tsk tsk...trying so hard to find the devil,even if he writes beautiful poetry, is foolish OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg45p4q", "score_hidden": false, "stickied": false, "created": 1491940912.0, "created_utc": 1491912112.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64olfm", "likes": null, "replies": "", "user_reports": [], "id": "dg41dne", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Spikehunter3", "parent_id": "t1_dg3y2in", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Uh, no thanks. I'm good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh, no thanks. I&amp;#39;m good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg41dne", "score_hidden": false, "stickied": false, "created": 1491929174.0, "created_utc": 1491900374.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3y2in", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TobiasWade", "parent_id": "t1_dg3uqod", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You volunteering to help out next time? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You volunteering to help out next time? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3y2in", "score_hidden": false, "stickied": false, "created": 1491920092.0, "created_utc": 1491891292.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3uqod", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Spikehunter3", "parent_id": "t3_64olfm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Gtfo this OP. Trying to find the Devil himself is not good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gtfo this OP. Trying to find the Devil himself is not good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3uqod", "score_hidden": false, "stickied": false, "created": 1491913624.0, "created_utc": 1491884824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}]