[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s nice to see my original post did so well, even though I didn&amp;#39;t share why I had posted it. The story I told took place over 2 years ago, and I had only posted it because i had planned an expedition back to the lonely underwater hilltop. And now that expedition is over, and I&amp;#39;ll share with you what I found. It&amp;#39;s frightening.&lt;/p&gt;\n\n&lt;p&gt;Part 1: &lt;a href=\"https://www.reddit.com/r/nosleep/comments/638ix1/i_found_something_big_underwater/\"&gt;https://www.reddit.com/r/nosleep/comments/638ix1/i_found_something_big_underwater/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll get right into it. I&amp;#39;m not stupid enough to go on a solo dive, so I recruited Amy, we had worked together since the incident, and we were still friends, so she was a natural pick. I left Dave out this time. He nearly died last time, no reason to bring him back here. &lt;/p&gt;\n\n&lt;p&gt;Anyway, we used the same coordinates, made sure we picked a day with nice weather, and set out. And shortly after we did, I was in the water descending again. And once again I saw the round summit of the underwater hill slowly come into view. This time without any shipwreck on it. It was just as eerie, as I came down from above it was the only platform of light, a black abyss all around it. But I wasn&amp;#39;t convinced of that, maybe it was an underwater mountain range? And I was just at the very peak, unable to see anything past the plateau. That&amp;#39;s what I was hoping at least.&lt;/p&gt;\n\n&lt;p&gt;With that thought, maybe the ship we had explored years ago was just another 20 feet down. There was no way to tell with all the dust it had kicked up when it went flying, and how quickly Dave and I got the hell out of there. It definitely warranted another search. Though, the ship rolling still troubled me. The ship was hanging off the flat platform, but that was forward portion of the ship, not the port side, the way it had flipped away. I had thought of all of the explanations, ranging from logical to lunacy. A subtle earthquake we somehow missed, a ridiculous current that somehow swung around me and belted the ship, stuff like that. But the way Dave had described it, the &amp;quot;explosion&amp;quot; coming from behind him, towards the way the ship ended up flipping. Didn&amp;#39;t make any sense. To my knowledge, things fly AWAY from the epicenter of an explosion, not towards, up, over and then down a hill. Which left the only logical answer, of something dragging it down. &lt;/p&gt;\n\n&lt;p&gt;I tried to clear my head of all of these thoughts as I explored the small platform. It was probably about 50 feet in diameter and almost perfectly round, save for the the edges being a little, well, edgy. There was nothing to find though, I couldn&amp;#39;t even discern which way the ship must have rolled with no landmarks. I floated around the edge for a bit, looking down into the immediate blackness that surrounded me. It&amp;#39;s kind of like leaning over a high place when you&amp;#39;re not in water. The same feeling, except you don&amp;#39;t know how far down you&amp;#39;re looking, or what might be looking back.&lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t about to spend all this time planning, and all this money to come back with nothing but a story about me being too afraid to explore more, so that&amp;#39;s what I did. I slowly made way down into the darkness, I of course had lights on my goggles, but these could only do so much. I always kept a hand on the mountain side as I descended, and I gradually started to notice unnatural textures as I traced it. Hand cut grooves. I explored more, and it seemed like it was some dilapidated ancient structure, not just a random hillside. My heart began to pound, knowing I&amp;#39;d stumbled on something big. I continued on, deeper, I don&amp;#39;t know maybe another 30 feet, before I came to another landing, this one I don&amp;#39;t know how big, I didn&amp;#39;t get to explore it much. &lt;/p&gt;\n\n&lt;p&gt;I stayed close to the rock wall I had followed down, as far as I was concerned, it was as integral as my air supply to my survival. I now followed it along, going from right to left, and I found an opening of the hillside. It was big, maybe 15 feet tall and about half as wide. And it was dark in there, and I convinced myself to maybe save that one for later. So I continued past it, and soon came to find my most terrifying discovery of all.&lt;/p&gt;\n\n&lt;p&gt;I found an ornate etching of a human carved into the wall. It wasn&amp;#39;t Aztec, it wasn&amp;#39;t Egyptian, but it had the same kind of detail. It&amp;#39;s hard to explain. I looked up, and next to it was another, much larger, detailed carving of what could only be a blue whale. The shape was distinct enough for me to say it with little doubt, and the scale between this drawing and the one of the human must have been pretty close to bang on. And next to the blue whale was a line going vertically. I traced it back up the hillside, before it curved back in towards the other drawings, and then back in, and back out. I couldn&amp;#39;t quite make out what this drawing was going to be. I finally got the guts to back off of the rock wall a few feet, to spread my light further.&lt;/p&gt;\n\n&lt;p&gt;What greeted me was a carving of an animal, or something. It had the torso of a man, the &amp;quot;legs&amp;quot;, I guess, of a fish, and the head of something in between. My heart started racing as I realized the scale. It dwarfed the blue whale, it had to be ten times as big if the scale were to be believed. I floated there in awe for a few moments.&lt;/p&gt;\n\n&lt;p&gt;Suddenly a peculiar feeling came over me. It was like I was sitting in a massage chair, but all over my body. I turned around to the darkness of the ocean, to see my first marine life of either of the two dives. They were scattering. Small sharks, squids, many different species of fish, all in a mad dash in any direction they could find. My head darted around, trying to figure out what was going on, and what this feeling was. I turned back to the cliffside and figured out what it was, small pebbles slowly drifted off of the rock, and some simply jittered in place. The water was literally vibrating around me. I slowly started my ascent upwards, and with more light, came more visibility, now no sea life was anywhere in the vicinity. I was up past the original summit now, about 25 feet below the surface, when something caught my attention. A cloud of bubbles came rushing up from the darkness a good ways in front of me. A cloud is an understatment, more like a maelstrom of bubbles. It was an incredible amount. I just prayed as the reached the surface before I did, Amy wasn&amp;#39;t unlucky enough to park the boat where the bubbles hit the surface, as they would have easily been enough to sink the modest boat.&lt;/p&gt;\n\n&lt;p&gt;It could have been anything that caused that, but in my head it was the giant monster releasing an ancient yawn as it woke up. I surfaced and made my way to the boat, I refused to tell Amy about anything, I insisted I found nothing. I could have found Atlantis for all I know. I could be a rich and famous man. And maybe I would be, if I wasn&amp;#39;t convinced that thing was there.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's nice to see my original post did so well, even though I didn't share why I had posted it. The story I told took place over 2 years ago, and I had only posted it because i had planned an expedition back to the lonely underwater hilltop. And now that expedition is over, and I'll share with you what I found. It's frightening.\n\nPart 1: https://www.reddit.com/r/nosleep/comments/638ix1/i_found_something_big_underwater/\n\nI'll get right into it. I'm not stupid enough to go on a solo dive, so I recruited Amy, we had worked together since the incident, and we were still friends, so she was a natural pick. I left Dave out this time. He nearly died last time, no reason to bring him back here. \n\nAnyway, we used the same coordinates, made sure we picked a day with nice weather, and set out. And shortly after we did, I was in the water descending again. And once again I saw the round summit of the underwater hill slowly come into view. This time without any shipwreck on it. It was just as eerie, as I came down from above it was the only platform of light, a black abyss all around it. But I wasn't convinced of that, maybe it was an underwater mountain range? And I was just at the very peak, unable to see anything past the plateau. That's what I was hoping at least.\n\nWith that thought, maybe the ship we had explored years ago was just another 20 feet down. There was no way to tell with all the dust it had kicked up when it went flying, and how quickly Dave and I got the hell out of there. It definitely warranted another search. Though, the ship rolling still troubled me. The ship was hanging off the flat platform, but that was forward portion of the ship, not the port side, the way it had flipped away. I had thought of all of the explanations, ranging from logical to lunacy. A subtle earthquake we somehow missed, a ridiculous current that somehow swung around me and belted the ship, stuff like that. But the way Dave had described it, the \"explosion\" coming from behind him, towards the way the ship ended up flipping. Didn't make any sense. To my knowledge, things fly AWAY from the epicenter of an explosion, not towards, up, over and then down a hill. Which left the only logical answer, of something dragging it down. \n\nI tried to clear my head of all of these thoughts as I explored the small platform. It was probably about 50 feet in diameter and almost perfectly round, save for the the edges being a little, well, edgy. There was nothing to find though, I couldn't even discern which way the ship must have rolled with no landmarks. I floated around the edge for a bit, looking down into the immediate blackness that surrounded me. It's kind of like leaning over a high place when you're not in water. The same feeling, except you don't know how far down you're looking, or what might be looking back.\n\nI wasn't about to spend all this time planning, and all this money to come back with nothing but a story about me being too afraid to explore more, so that's what I did. I slowly made way down into the darkness, I of course had lights on my goggles, but these could only do so much. I always kept a hand on the mountain side as I descended, and I gradually started to notice unnatural textures as I traced it. Hand cut grooves. I explored more, and it seemed like it was some dilapidated ancient structure, not just a random hillside. My heart began to pound, knowing I'd stumbled on something big. I continued on, deeper, I don't know maybe another 30 feet, before I came to another landing, this one I don't know how big, I didn't get to explore it much. \n\nI stayed close to the rock wall I had followed down, as far as I was concerned, it was as integral as my air supply to my survival. I now followed it along, going from right to left, and I found an opening of the hillside. It was big, maybe 15 feet tall and about half as wide. And it was dark in there, and I convinced myself to maybe save that one for later. So I continued past it, and soon came to find my most terrifying discovery of all.\n\nI found an ornate etching of a human carved into the wall. It wasn't Aztec, it wasn't Egyptian, but it had the same kind of detail. It's hard to explain. I looked up, and next to it was another, much larger, detailed carving of what could only be a blue whale. The shape was distinct enough for me to say it with little doubt, and the scale between this drawing and the one of the human must have been pretty close to bang on. And next to the blue whale was a line going vertically. I traced it back up the hillside, before it curved back in towards the other drawings, and then back in, and back out. I couldn't quite make out what this drawing was going to be. I finally got the guts to back off of the rock wall a few feet, to spread my light further.\n\nWhat greeted me was a carving of an animal, or something. It had the torso of a man, the \"legs\", I guess, of a fish, and the head of something in between. My heart started racing as I realized the scale. It dwarfed the blue whale, it had to be ten times as big if the scale were to be believed. I floated there in awe for a few moments.\n\nSuddenly a peculiar feeling came over me. It was like I was sitting in a massage chair, but all over my body. I turned around to the darkness of the ocean, to see my first marine life of either of the two dives. They were scattering. Small sharks, squids, many different species of fish, all in a mad dash in any direction they could find. My head darted around, trying to figure out what was going on, and what this feeling was. I turned back to the cliffside and figured out what it was, small pebbles slowly drifted off of the rock, and some simply jittered in place. The water was literally vibrating around me. I slowly started my ascent upwards, and with more light, came more visibility, now no sea life was anywhere in the vicinity. I was up past the original summit now, about 25 feet below the surface, when something caught my attention. A cloud of bubbles came rushing up from the darkness a good ways in front of me. A cloud is an understatment, more like a maelstrom of bubbles. It was an incredible amount. I just prayed as the reached the surface before I did, Amy wasn't unlucky enough to park the boat where the bubbles hit the surface, as they would have easily been enough to sink the modest boat.\n\nIt could have been anything that caused that, but in my head it was the giant monster releasing an ancient yawn as it woke up. I surfaced and made my way to the boat, I refused to tell Amy about anything, I insisted I found nothing. I could have found Atlantis for all I know. I could be a rich and famous man. And maybe I would be, if I wasn't convinced that thing was there.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "64ow4s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 252, "report_reasons": null, "author": "InukShaken", "saved": false, "mod_reports": [], "name": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1491887844.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64ow4s/i_found_something_big_underwater_part_2/", "num_reports": null, "locked": false, "stickied": false, "created": 1491916073.0, "url": "https://www.reddit.com/r/nosleep/comments/64ow4s/i_found_something_big_underwater_part_2/", "author_flair_text": null, "quarantine": false, "title": "I found something big underwater (Part 2)", "created_utc": 1491887273.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 252}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg3w84o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64ow4s%2Fi_found_something_big_underwater_part_2%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?to=RemindMeBot&amp;amp;subject=Reminder&amp;amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64ow4s%2Fi_found_something_big_underwater_part_2%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3w84o", "score_hidden": true, "stickied": true, "created": 1491916232.0, "created_utc": 1491887432.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg42z1u", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "MaxwellFinium", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You're gonna need a bigger boat. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re gonna need a bigger boat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg42z1u", "score_hidden": false, "stickied": false, "created": 1491934192.0, "created_utc": 1491905392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg4lah4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "HarassivePanda", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I sincerely hope there is a part 3!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sincerely hope there is a part 3!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4lah4", "score_hidden": false, "stickied": false, "created": 1491960426.0, "created_utc": 1491931626.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg3zklc", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "howlybird", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "More please!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More please!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg3zklc", "score_hidden": false, "stickied": false, "created": 1491923857.0, "created_utc": 1491895057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg4f87r", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "little_turd1234", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I think the bubbles were just the monster farting..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the bubbles were just the monster farting..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4f87r", "score_hidden": false, "stickied": false, "created": 1491953786.0, "created_utc": 1491924986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg4dgcz", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "blazing420kilk", "parent_id": "t1_dg44fci", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yea the monster just farted", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea the monster just farted&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4dgcz", "score_hidden": false, "stickied": false, "created": 1491951794.0, "created_utc": 1491922994.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44fci", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "stringtheory42", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Those bubbles were probably methane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those bubbles were probably methane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg44fci", "score_hidden": false, "stickied": false, "created": 1491938136.0, "created_utc": 1491909336.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg593hm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FlyingPizzaOfDoom", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ocean nosleeps are the best nosleeps. 3rd update?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ocean nosleeps are the best nosleeps. 3rd update?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg593hm", "score_hidden": false, "stickied": false, "created": 1491988812.0, "created_utc": 1491960012.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg55zbs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Notafraidofnotin", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Please stay a humble and smart man and take those coordinates with you to the grave. I pray that beast does not ever wake in my life time! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please stay a humble and smart man and take those coordinates with you to the grave. I pray that beast does not ever wake in my life time! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg55zbs", "score_hidden": false, "stickied": false, "created": 1491984728.0, "created_utc": 1491955928.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg5cxz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "amcm67", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Uh oh. I think he woke the Kracken! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh oh. I think he woke the Kracken! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5cxz4", "score_hidden": false, "stickied": false, "created": 1491993972.0, "created_utc": 1491965172.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg5e1rs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xJoeKingz", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There's always a bigger fish", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s always a bigger fish&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5e1rs", "score_hidden": false, "stickied": false, "created": 1491995543.0, "created_utc": 1491966743.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ow4s", "likes": null, "replies": "", "user_reports": [], "id": "dg5m2za", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JOATWorks", "parent_id": "t3_64ow4s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "As a bathophobic individual, this story gives me intense chills.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a bathophobic individual, this story gives me intense chills.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5m2za", "score_hidden": false, "stickied": false, "created": 1492011669.0, "created_utc": 1491982869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]