[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As with many of the people that post here, I come because very few of my friends believe my story. And similarly to many of the posts here, it does contain suggestions of the paranormal. However, where it differs, is that no matter how hard I try to think of a plausible explanation for how this happened, nothing tangible can explain the paralysing peril I felt that night. &lt;/p&gt;\n\n&lt;p&gt;I will begin, perhaps obviously, at the start. &lt;/p&gt;\n\n&lt;p&gt;I am currently spending a year of my life teaching in Japan. I was able to enjoy some of Japans wild landscapes during the later &lt;a href=\"http://imgur.com/BMA65tI\"&gt;summer months&lt;/a&gt; of my arrival. Yet with the long winter we experience here, when spring came around I was itching to see as much of it as possible. Thus, the plan to &lt;a href=\"http://imgur.com/OS7Ypon\"&gt;hitchhike&lt;/a&gt; from my home just south of Kanazawa to Miyajima (a famously spiritual island just off the coast of Hiroshima) and back again began to unfold.&lt;/p&gt;\n\n&lt;p&gt;I must add before I go any further that, although I remain open to the concept of spirituality, I have never before had reason to believe in demons or ghosts. Japan is the land of the spirit and the soul, and &lt;a href=\"https://s-media-cache-ak0.pinimg.com/236x/c6/1d/61/c61d6146d49312e8b23e694a4f75a11c.jpg\"&gt;offerings&lt;/a&gt; to those that have departed this world can be found in every single place you look. However, these too I just believed to be rituals buried deep within their ancient culture.&lt;/p&gt;\n\n&lt;p&gt;Aside from the few days me and some friends spent exploring &lt;a href=\"https://www.jnto.go.jp/eng/wp-content/uploads/2016/06/Miyajima-Area.jpg\"&gt;Miyajima&lt;/a&gt;, I spent my time alone. My only conversations were with the abundance of locals I met who were politely inquisitive as to what I had in my hiking bag and the racoons that I would less politely tell to fuck off when they woke me up in the middle of the night. Some of these nights were filled with the sounds of the city, an exchange made in my favour as I was then greeted by the dawning sun rising to highlight whatever &lt;a href=\"http://imgur.com/keocZZh\"&gt;historical monument Id pitched my tent in front of&lt;/a&gt;. However, most of my nights were spent &lt;a href=\"http://imgur.com/PdCJ0T6\"&gt;far away from the sounds of men and children&lt;/a&gt;. The blissful sounds of nature led me into my dreams.&lt;/p&gt;\n\n&lt;p&gt;It is on one of these nights that my story takes place.&lt;/p&gt;\n\n&lt;p&gt;It was nearing the end of my journey, and as such I had ticked most of the places off my list of things to do. So I asked my mum to choose my next destination and I woke up to very clear instructions on how to get to a secluded waterfall called &lt;a href=\"http://www.japan-guide.com/e/e4019.html\"&gt;Minoh Falls&lt;/a&gt;. I know it is customary on this page to not reveal the location where these stories take place, and I hope my story is not removed due to my mentioning of it. But I tell this as a warning. Do not camp here.&lt;/p&gt;\n\n&lt;p&gt;I checked the weather forecast for the area, showers it said. “Some people feel the rain. Others just get wet”. A quote by the great Bob Marley that I repeated to myself as rain lightly patted the windows. By this point in my journey I had given up trying to hitchhike. I was able to see much more by taking the inexpensive local train, and so it was on one of these many local trains I was sat, ready to &lt;em&gt;just get wet&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;It was a good 50 minute walk away from the small town of Minoh through a beautiful forest and the gorge created by the waterfall. On sunnier days I am told it is an extremely popular place for tourists and locals alike. However on this particular day I was greeted by few people. As with most of my walks along this journey, I took the less trodden path and wound my way up the side of this gorge further into thickness of the trees. The rain was quieter here, more muffled. The grey sky barely made it through the canopy but there was plenty of residual light.&lt;/p&gt;\n\n&lt;p&gt;I passed a small shrine on my left and smiled at the small cup of coffee placed on its mantle. My first reaction to seeing cups of coffee and bottles of water on shrines is always that of surprise. If you’ve ever been to Japan, you will notice a very immaculate landscape, void of any litter or bins. The phenomenon of placing cheap vending machine coffee on shrines I was told stems from the thought that the spirits are tired, and Japan being the highly caffeinated province it is, happily aids their weary guests. I inspected the shrine more closely. It didn’t appear to be made out of stone, nor was there any head remaining. I shrugged it off as a product of time and made my way further down the path.&lt;/p&gt;\n\n&lt;p&gt;The trees opened up slightly and the dappled light reflected at me from the damp trunks. The world was sodden and I really hoped that this waterfall had some sort of shelter for me to sleep under. Only 10 minutes past the previous shrine did I find another; an almost identical headless figure sat bow legged with its hands by its sides. Less forest growth covered this one, less time had taken its toll, but it remained firmly headless. I decided to leave an offering of my own, something I had never done before but felt inclined to after my week of passing many a shrine without offering something in recognition. I had two plastic bottles, one empty and the other more than half full. I couldn’t afford to leave all of my water so I emptied some into the now filling bottle and left it by the shrine with its lid off. As I walked away, I toyed with the idea that this bottle would fill up every time it rained and the spirit would be happy; I had done a good dead today. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://imgur.com/IZlbGhK\"&gt;I arrived at the waterfall&lt;/a&gt; just after lunch, and as id hoped, there was a large sheltered area which I scouted and deduced would be the best spot to pitch my tent for the night. The rain had turned the waterfall from what I would imagine is usually more of an attractive stream into a tremendous torrent of falling water. The 15 meter high fall then ran its way back down a fairly magical looking gorge and around a corner. I spent the afternoon reading, drinking whiskey and trying not to get my camera wet. I didn’t want to pitch my tent until evening lest the park rangers see me and tell me to pack up. &lt;/p&gt;\n\n&lt;p&gt;Yet, as late as I waited, the evening patrol inevitably came past as I was finishing the construction of &lt;a href=\"http://imgur.com/Zb8Cp22\"&gt;my anti-spider dome&lt;/a&gt;. “Tento dameh”, accompanied with the bi-lingual gesture of making an X with ones arms, translates to something like “kind sir, this is a nature reserve and you can’t pitch your tent here so please pack it up and move”. I nodded politely and feigned the start of my deconstruction. I regretted many times over the course of this night that I did not listen to the kind old man; that I did not head his warning, that I probably misunderstood what he was trying to tell me and that I did not ask him why I was not allowed to camp there. My only recompense for pursuing my cause of adventure is that I now have this story to tell.&lt;/p&gt;\n\n&lt;p&gt;When they left, I began to search the area for somewhere out of the way that I could stay safely hidden from the mean park rangers that wanted me to destroy my home. I wish I could say I found somewhere with an even more beautiful view of the falls, but what I instead decided upon was a very large disabled bathroom. I measured the inside of the room with my paces and to my bemused delight it was in fact more than enough space for the tent to fit. To my friend that lent me his tent and has yet to hear this story, and perhaps may read it here for the first time, the bathroom was suspiciously clean.&lt;/p&gt;\n\n&lt;p&gt;I moved my tent into the room under the shade of twilight and began to hang my dripping clothes over the variety of handles one finds inside disabled toilets. Confident with my decision, and with the remaining light waning, I locked the door and got into my sleeping bag. It was a heavy hook style latch attached to a heavy metal sliding door, perfectly bear proof. After a minute, I had successfully deceived the motion sensor in the room and the light went off. I absorbed the darkness and let my ears take control of my mind.&lt;/p&gt;\n\n&lt;p&gt;Something those of you who have camped alone before will know, is that the noise of the world around you becomes tantalisingly sharp once you zip yourself up into your cocoon. The slightest snuffle of a hedgehog must be a bear and the wind that momentarily shakes your tent must be a person trying to get in. However, my agile minded brain had taken me safely inside a bathroom and behind a locked door so I felt unrecognisably secure. &lt;/p&gt;\n\n&lt;p&gt;Shortly after I zipped myself up, the sounds of the patrol bike began to haunt me. It was hard to tell over the sounds of the waterfall exactly where the car was, so I sat up and braced myself  for the inevitable &lt;em&gt;knock knock knock&lt;/em&gt; on the door which would require me to pack up my tent in the rain and walk back through the forest at night. For nearly an hour I heard the sounds vehicles moving around. I sat clutching my knees. Ears pricked. Preparing myself for what I deemed the only possible course of action. When I was finally greeted with the solitary sound of falling water, I released my knees and my breath simultaneously. My heart beat began to subside and I braved turning on my head torch so that I could continue my book. I downed the remainder of my whiskey and for a while I let myself escape from the room I was in.&lt;/p&gt;\n\n&lt;p&gt;At around 11PM I closed my book and surrendered my eyes to the darkness.&lt;/p&gt;\n\n&lt;p&gt;I allowed my body to find a comfortable place and closed my eyes.&lt;/p&gt;\n\n&lt;p&gt;The undisputable sounds of children laughing danced past me. &lt;/p&gt;\n\n&lt;p&gt;Silence followed.&lt;/p&gt;\n\n&lt;p&gt;My body froze. My skin grew cold. &lt;/p&gt;\n\n&lt;p&gt;The only way I can describe the fear I felt would be to compare it to the paralysing fear that comes from nightmares. But I was awake. &lt;/p&gt;\n\n&lt;p&gt;When I mustered the courage to quietly unzip my sleeping bag I reached for my phone and messaged my girlfriend and my mum, asking for them to tell me I am awake. I must have sounded crazy but I needed to be sure.&lt;/p&gt;\n\n&lt;p&gt;I locked my phone and continued to press my ears to the slightest sound. Unsure as to whether my ears were now creating what I expected to hear, the laughing was fainter a further away. I no longer trusted my ears.&lt;/p&gt;\n\n&lt;p&gt;I was trapped. If I moved outside of my tent, the motion sensor would trigger and id be discoverable by whatever it was I had just heard. &lt;/p&gt;\n\n&lt;p&gt;So in my tent I stayed.&lt;/p&gt;\n\n&lt;p&gt;My hands grasped my phone, waiting for some external source to reassure me that I was not in fact dreaming. My rational brain had dissipated at this point. I knew my dream mother would also be able to tell me that I was awake but I needed something.&lt;/p&gt;\n\n&lt;p&gt;I heard the lock of bathroom click and swing.&lt;/p&gt;\n\n&lt;p&gt;I locked my phone and silenced my breath.&lt;/p&gt;\n\n&lt;p&gt;My mind raced with causes and reasons and what my crazy mind kept coming back to was this forest spirits had led a bear to my home. Unlocking the door was their final task.&lt;/p&gt;\n\n&lt;p&gt;I couldn’t check even if I wanted to. I needed the darkness to hide.&lt;/p&gt;\n\n&lt;p&gt;I heard the click and swing of the lock again.&lt;/p&gt;\n\n&lt;p&gt;I don’t know how much time passed before I dared unlock my phone again. But the message I needed was there. Both my girlfriend and mother confirmed my fears. I was awake. I quickly explained what was happening to them both, the last update they had previously was that I was hiding in a toilet. They had both found it very funny. Neither of them were laughing now.&lt;/p&gt;\n\n&lt;p&gt;The logical woman my mother is tried to convince me that it was probably some kids getting drunk and their favourite spot away from their parents. Oh how much I wanted to believe that was true. The distance from the town and the quantity of rain refused my brain to accept that truth. However, it is what I began to focus on.&lt;/p&gt;\n\n&lt;p&gt;Then I remembered the lock, and the impending bear attack. I found my pocket knife and placed it near my head. &lt;/p&gt;\n\n&lt;p&gt;Did the spirit unlock it and lock it again to tease me?&lt;/p&gt;\n\n&lt;p&gt;I waited for another eternity, my mother urged me to focus on my breathing.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Knock knock knock&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;The dreaded sound from earlier in the night, which I had very gratefully acknowledged would not come, hammered down so much more fear than I had ever anticipated.&lt;/p&gt;\n\n&lt;p&gt;The peril I experienced not half an hour before was back tenfold. \nI couldn’t speak.\nI couldn’t move.&lt;/p&gt;\n\n&lt;p&gt;Silence.&lt;/p&gt;\n\n&lt;p&gt;Nothing followed the knocking. The door didn’t move. &lt;/p&gt;\n\n&lt;p&gt;I tuned in on the sounds of the waterfall and focused on my breathing as per my mothers’ request.&lt;/p&gt;\n\n&lt;p&gt;My minds illusion of finding recognisable patterns within the randomness of the noises around me was now overwhelming. The laughing was still indefinable. I begged that it didn’t come closer.&lt;/p&gt;\n\n&lt;p&gt;A single loud knock brought a tear to my eye. &lt;/p&gt;\n\n&lt;p&gt;Many a horror film I had seen and into the forest I expected to be taken.&lt;/p&gt;\n\n&lt;p&gt;I shielded myself through closed eyes and clutched my only tangible connection to the outside world to my chest. My body tensed. Bracing myself for whatever was about to come next.&lt;/p&gt;\n\n&lt;p&gt;And like this my night was spent.&lt;/p&gt;\n\n&lt;p&gt;I packed my tent up with the morning sun and was greeted with a gloriously &lt;a href=\"http://imgur.com/ShjZkqH\"&gt;grey, but dry, day&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;I told several people about my story, the Japanese among them were quick to believe and the foreigners among them were logically sceptical.&lt;/p&gt;\n\n&lt;p&gt;I didn’t know how to explain it very well.&lt;/p&gt;\n\n&lt;p&gt;In the safety of my real home, hindsight shrouded my previous thoughts and I began to think of possibly more logical causes for my experience. I have toyed with the idea of monkeys, real children, dreams and illusions, yet nothing can explain everything I experienced. &lt;/p&gt;\n\n&lt;p&gt;The overwhelmingly physical feeling of fear is something I will never forget. &lt;/p&gt;\n\n&lt;p&gt;When I returned to work the next week I was showing a colleague some of my photos, although importantly I had decided not to tell them the story.&lt;/p&gt;\n\n&lt;p&gt;When I got to the photo of my tent by Minoh Falls, he stopped me and said &lt;a href=\"http://shinrei-spot.info/?p=1389\"&gt;“Oh, Minoh. English difficult. Many, many ghosts.”&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I couldn’t tell him my story but my skin crawled with the reminder that for the first time in my life, I was in the presence of something I cannot explain.&lt;/p&gt;\n\n&lt;p&gt;The following morning, I parted my curtains and saw an empty plastic bottle sitting lidless on the sill. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As with many of the people that post here, I come because very few of my friends believe my story. And similarly to many of the posts here, it does contain suggestions of the paranormal. However, where it differs, is that no matter how hard I try to think of a plausible explanation for how this happened, nothing tangible can explain the paralysing peril I felt that night. \n\nI will begin, perhaps obviously, at the start. \n\nI am currently spending a year of my life teaching in Japan. I was able to enjoy some of Japans wild landscapes during the later [summer months](http://imgur.com/BMA65tI) of my arrival. Yet with the long winter we experience here, when spring came around I was itching to see as much of it as possible. Thus, the plan to [hitchhike](http://imgur.com/OS7Ypon) from my home just south of Kanazawa to Miyajima (a famously spiritual island just off the coast of Hiroshima) and back again began to unfold.\n\nI must add before I go any further that, although I remain open to the concept of spirituality, I have never before had reason to believe in demons or ghosts. Japan is the land of the spirit and the soul, and [offerings](https://s-media-cache-ak0.pinimg.com/236x/c6/1d/61/c61d6146d49312e8b23e694a4f75a11c.jpg) to those that have departed this world can be found in every single place you look. However, these too I just believed to be rituals buried deep within their ancient culture.\n\nAside from the few days me and some friends spent exploring [Miyajima](https://www.jnto.go.jp/eng/wp-content/uploads/2016/06/Miyajima-Area.jpg), I spent my time alone. My only conversations were with the abundance of locals I met who were politely inquisitive as to what I had in my hiking bag and the racoons that I would less politely tell to fuck off when they woke me up in the middle of the night. Some of these nights were filled with the sounds of the city, an exchange made in my favour as I was then greeted by the dawning sun rising to highlight whatever [historical monument Id pitched my tent in front of](http://imgur.com/keocZZh). However, most of my nights were spent [far away from the sounds of men and children](http://imgur.com/PdCJ0T6). The blissful sounds of nature led me into my dreams.\n\nIt is on one of these nights that my story takes place.\n\nIt was nearing the end of my journey, and as such I had ticked most of the places off my list of things to do. So I asked my mum to choose my next destination and I woke up to very clear instructions on how to get to a secluded waterfall called [Minoh Falls](http://www.japan-guide.com/e/e4019.html). I know it is customary on this page to not reveal the location where these stories take place, and I hope my story is not removed due to my mentioning of it. But I tell this as a warning. Do not camp here.\n\nI checked the weather forecast for the area, showers it said. “Some people feel the rain. Others just get wet”. A quote by the great Bob Marley that I repeated to myself as rain lightly patted the windows. By this point in my journey I had given up trying to hitchhike. I was able to see much more by taking the inexpensive local train, and so it was on one of these many local trains I was sat, ready to *just get wet*.\n\nIt was a good 50 minute walk away from the small town of Minoh through a beautiful forest and the gorge created by the waterfall. On sunnier days I am told it is an extremely popular place for tourists and locals alike. However on this particular day I was greeted by few people. As with most of my walks along this journey, I took the less trodden path and wound my way up the side of this gorge further into thickness of the trees. The rain was quieter here, more muffled. The grey sky barely made it through the canopy but there was plenty of residual light.\n \nI passed a small shrine on my left and smiled at the small cup of coffee placed on its mantle. My first reaction to seeing cups of coffee and bottles of water on shrines is always that of surprise. If you’ve ever been to Japan, you will notice a very immaculate landscape, void of any litter or bins. The phenomenon of placing cheap vending machine coffee on shrines I was told stems from the thought that the spirits are tired, and Japan being the highly caffeinated province it is, happily aids their weary guests. I inspected the shrine more closely. It didn’t appear to be made out of stone, nor was there any head remaining. I shrugged it off as a product of time and made my way further down the path.\n\nThe trees opened up slightly and the dappled light reflected at me from the damp trunks. The world was sodden and I really hoped that this waterfall had some sort of shelter for me to sleep under. Only 10 minutes past the previous shrine did I find another; an almost identical headless figure sat bow legged with its hands by its sides. Less forest growth covered this one, less time had taken its toll, but it remained firmly headless. I decided to leave an offering of my own, something I had never done before but felt inclined to after my week of passing many a shrine without offering something in recognition. I had two plastic bottles, one empty and the other more than half full. I couldn’t afford to leave all of my water so I emptied some into the now filling bottle and left it by the shrine with its lid off. As I walked away, I toyed with the idea that this bottle would fill up every time it rained and the spirit would be happy; I had done a good dead today. \n\n[I arrived at the waterfall](http://imgur.com/IZlbGhK) just after lunch, and as id hoped, there was a large sheltered area which I scouted and deduced would be the best spot to pitch my tent for the night. The rain had turned the waterfall from what I would imagine is usually more of an attractive stream into a tremendous torrent of falling water. The 15 meter high fall then ran its way back down a fairly magical looking gorge and around a corner. I spent the afternoon reading, drinking whiskey and trying not to get my camera wet. I didn’t want to pitch my tent until evening lest the park rangers see me and tell me to pack up. \n\nYet, as late as I waited, the evening patrol inevitably came past as I was finishing the construction of [my anti-spider dome](http://imgur.com/Zb8Cp22). “Tento dameh”, accompanied with the bi-lingual gesture of making an X with ones arms, translates to something like “kind sir, this is a nature reserve and you can’t pitch your tent here so please pack it up and move”. I nodded politely and feigned the start of my deconstruction. I regretted many times over the course of this night that I did not listen to the kind old man; that I did not head his warning, that I probably misunderstood what he was trying to tell me and that I did not ask him why I was not allowed to camp there. My only recompense for pursuing my cause of adventure is that I now have this story to tell.\n\nWhen they left, I began to search the area for somewhere out of the way that I could stay safely hidden from the mean park rangers that wanted me to destroy my home. I wish I could say I found somewhere with an even more beautiful view of the falls, but what I instead decided upon was a very large disabled bathroom. I measured the inside of the room with my paces and to my bemused delight it was in fact more than enough space for the tent to fit. To my friend that lent me his tent and has yet to hear this story, and perhaps may read it here for the first time, the bathroom was suspiciously clean.\n\nI moved my tent into the room under the shade of twilight and began to hang my dripping clothes over the variety of handles one finds inside disabled toilets. Confident with my decision, and with the remaining light waning, I locked the door and got into my sleeping bag. It was a heavy hook style latch attached to a heavy metal sliding door, perfectly bear proof. After a minute, I had successfully deceived the motion sensor in the room and the light went off. I absorbed the darkness and let my ears take control of my mind.\n\nSomething those of you who have camped alone before will know, is that the noise of the world around you becomes tantalisingly sharp once you zip yourself up into your cocoon. The slightest snuffle of a hedgehog must be a bear and the wind that momentarily shakes your tent must be a person trying to get in. However, my agile minded brain had taken me safely inside a bathroom and behind a locked door so I felt unrecognisably secure. \n\nShortly after I zipped myself up, the sounds of the patrol bike began to haunt me. It was hard to tell over the sounds of the waterfall exactly where the car was, so I sat up and braced myself  for the inevitable *knock knock knock* on the door which would require me to pack up my tent in the rain and walk back through the forest at night. For nearly an hour I heard the sounds vehicles moving around. I sat clutching my knees. Ears pricked. Preparing myself for what I deemed the only possible course of action. When I was finally greeted with the solitary sound of falling water, I released my knees and my breath simultaneously. My heart beat began to subside and I braved turning on my head torch so that I could continue my book. I downed the remainder of my whiskey and for a while I let myself escape from the room I was in.\n\nAt around 11PM I closed my book and surrendered my eyes to the darkness.\n\nI allowed my body to find a comfortable place and closed my eyes.\n\nThe undisputable sounds of children laughing danced past me. \n\nSilence followed.\n\nMy body froze. My skin grew cold. \n\nThe only way I can describe the fear I felt would be to compare it to the paralysing fear that comes from nightmares. But I was awake. \n\nWhen I mustered the courage to quietly unzip my sleeping bag I reached for my phone and messaged my girlfriend and my mum, asking for them to tell me I am awake. I must have sounded crazy but I needed to be sure.\n\nI locked my phone and continued to press my ears to the slightest sound. Unsure as to whether my ears were now creating what I expected to hear, the laughing was fainter a further away. I no longer trusted my ears.\n\nI was trapped. If I moved outside of my tent, the motion sensor would trigger and id be discoverable by whatever it was I had just heard. \n\nSo in my tent I stayed.\n\nMy hands grasped my phone, waiting for some external source to reassure me that I was not in fact dreaming. My rational brain had dissipated at this point. I knew my dream mother would also be able to tell me that I was awake but I needed something.\n\nI heard the lock of bathroom click and swing.\n\nI locked my phone and silenced my breath.\n\nMy mind raced with causes and reasons and what my crazy mind kept coming back to was this forest spirits had led a bear to my home. Unlocking the door was their final task.\n\nI couldn’t check even if I wanted to. I needed the darkness to hide.\n\nI heard the click and swing of the lock again.\n\nI don’t know how much time passed before I dared unlock my phone again. But the message I needed was there. Both my girlfriend and mother confirmed my fears. I was awake. I quickly explained what was happening to them both, the last update they had previously was that I was hiding in a toilet. They had both found it very funny. Neither of them were laughing now.\n\nThe logical woman my mother is tried to convince me that it was probably some kids getting drunk and their favourite spot away from their parents. Oh how much I wanted to believe that was true. The distance from the town and the quantity of rain refused my brain to accept that truth. However, it is what I began to focus on.\n\nThen I remembered the lock, and the impending bear attack. I found my pocket knife and placed it near my head. \n\nDid the spirit unlock it and lock it again to tease me?\n\nI waited for another eternity, my mother urged me to focus on my breathing.\n\n*Knock knock knock*. \n\nThe dreaded sound from earlier in the night, which I had very gratefully acknowledged would not come, hammered down so much more fear than I had ever anticipated.\n\nThe peril I experienced not half an hour before was back tenfold. \nI couldn’t speak.\nI couldn’t move.\n\nSilence.\n\nNothing followed the knocking. The door didn’t move. \n\nI tuned in on the sounds of the waterfall and focused on my breathing as per my mothers’ request.\n\nMy minds illusion of finding recognisable patterns within the randomness of the noises around me was now overwhelming. The laughing was still indefinable. I begged that it didn’t come closer.\n\nA single loud knock brought a tear to my eye. \n\nMany a horror film I had seen and into the forest I expected to be taken.\n\nI shielded myself through closed eyes and clutched my only tangible connection to the outside world to my chest. My body tensed. Bracing myself for whatever was about to come next.\n\nAnd like this my night was spent.\n\nI packed my tent up with the morning sun and was greeted with a gloriously [grey, but dry, day](http://imgur.com/ShjZkqH). \n\nI told several people about my story, the Japanese among them were quick to believe and the foreigners among them were logically sceptical.\n\nI didn’t know how to explain it very well.\n \nIn the safety of my real home, hindsight shrouded my previous thoughts and I began to think of possibly more logical causes for my experience. I have toyed with the idea of monkeys, real children, dreams and illusions, yet nothing can explain everything I experienced. \n\nThe overwhelmingly physical feeling of fear is something I will never forget. \n\nWhen I returned to work the next week I was showing a colleague some of my photos, although importantly I had decided not to tell them the story.\n\nWhen I got to the photo of my tent by Minoh Falls, he stopped me and said [“Oh, Minoh. English difficult. Many, many ghosts.”](http://shinrei-spot.info/?p=1389)\n\nI couldn’t tell him my story but my skin crawled with the reminder that for the first time in my life, I was in the presence of something I cannot explain.\n\nThe following morning, I parted my curtains and saw an empty plastic bottle sitting lidless on the sill. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64pkj7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 159, "report_reasons": null, "author": "spacemonkeymomo", "saved": false, "mod_reports": [], "name": "t3_64pkj7", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1491914475.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64pkj7/never_go_camping_alone/", "num_reports": null, "locked": false, "stickied": false, "created": 1491927396.0, "url": "https://www.reddit.com/r/nosleep/comments/64pkj7/never_go_camping_alone/", "author_flair_text": null, "quarantine": false, "title": "Never go camping alone.", "created_utc": 1491898596.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 159}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": "", "user_reports": [], "id": "dg4qc8j", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "kraftiesimmer", "parent_id": "t3_64pkj7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There are many haunted places in Japan, especially when it comes to wooded areas. I'm glad the spirits you encountered that night were friendlier than most. I have a feeling that if you hadn't offered that water bottle things might have gone differently.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are many haunted places in Japan, especially when it comes to wooded areas. I&amp;#39;m glad the spirits you encountered that night were friendlier than most. I have a feeling that if you hadn&amp;#39;t offered that water bottle things might have gone differently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4qc8j", "score_hidden": false, "stickied": false, "created": 1491965916.0, "created_utc": 1491937116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": "", "user_reports": [], "id": "dg5g8z4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "spacemonkeymomo", "parent_id": "t1_dg4bw9b", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Thank you! I've never written anything before, I had so much raw experience to draw from though with this that it came really naturally. I actually woke up that morning in the toilet trying to think of the best name for my nosleep tale.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I&amp;#39;ve never written anything before, I had so much raw experience to draw from though with this that it came really naturally. I actually woke up that morning in the toilet trying to think of the best name for my nosleep tale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5g8z4", "score_hidden": false, "stickied": false, "created": 1491998975.0, "created_utc": 1491970175.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": "", "user_reports": [], "id": "dg4m3b7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4bw9b", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4m3b7", "score_hidden": false, "stickied": false, "created": 1491961293.0, "created_utc": 1491932493.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4bw9b", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Dumbledazz", "parent_id": "t3_64pkj7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Your style of writing is honestly really captivating ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your style of writing is honestly really captivating &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4bw9b", "score_hidden": false, "stickied": false, "created": 1491950002.0, "created_utc": 1491921202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": "", "user_reports": [], "id": "dg5gapi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "spacemonkeymomo", "parent_id": "t1_dg56pfw", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Thank you. A small part of me hopes I experience something haunting again. I really enjoyed drawing on this experience and trying to replicate my fears and thoughts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. A small part of me hopes I experience something haunting again. I really enjoyed drawing on this experience and trying to replicate my fears and thoughts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5gapi", "score_hidden": false, "stickied": false, "created": 1491999056.0, "created_utc": 1491970256.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56pfw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Smagmorks", "parent_id": "t3_64pkj7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Holy shit this was really well written ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit this was really well written &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg56pfw", "score_hidden": false, "stickied": false, "created": 1491985692.0, "created_utc": 1491956892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": "", "user_reports": [], "id": "dg5g2rf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "spacemonkeymomo", "parent_id": "t1_dg57cca", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yes I regretted not taking a picture of the bathroom tent. If I'm honest, I'd been taking pretty pictures all week and I didn't like the image of my tent in the bathroom. At the time I didn't know I'd have this tale. If you look at the first picture of the waterfall, the building in the far left is where the toilets were located. I can safely say I won't be returning to take the image!\n\nEdit - I just double checked the picture I chose and it doesn't include the toilet building. A part of me also wished I snapped a picture of the shrines, but maybe if I didn't I wouldn't have made it out to tell this tale.", "edited": 1491970100.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I regretted not taking a picture of the bathroom tent. If I&amp;#39;m honest, I&amp;#39;d been taking pretty pictures all week and I didn&amp;#39;t like the image of my tent in the bathroom. At the time I didn&amp;#39;t know I&amp;#39;d have this tale. If you look at the first picture of the waterfall, the building in the far left is where the toilets were located. I can safely say I won&amp;#39;t be returning to take the image!&lt;/p&gt;\n\n&lt;p&gt;Edit - I just double checked the picture I chose and it doesn&amp;#39;t include the toilet building. A part of me also wished I snapped a picture of the shrines, but maybe if I didn&amp;#39;t I wouldn&amp;#39;t have made it out to tell this tale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5g2rf", "score_hidden": false, "stickied": false, "created": 1491998685.0, "created_utc": 1491969885.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg57cca", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Devgru81", "parent_id": "t3_64pkj7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "First off,\nYou should've gotten a picture of the bathroom that you stayed in.\n\nSecondly,\nWhen you are out in the woods camping in a tent, and stuff starts happening, you beg to be in the safety of a structure such as what you stayed in. \n\nExcellent story though! I also lived in Japan at one point in my life. Someday, I will go back and visit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off,\nYou should&amp;#39;ve gotten a picture of the bathroom that you stayed in.&lt;/p&gt;\n\n&lt;p&gt;Secondly,\nWhen you are out in the woods camping in a tent, and stuff starts happening, you beg to be in the safety of a structure such as what you stayed in. &lt;/p&gt;\n\n&lt;p&gt;Excellent story though! I also lived in Japan at one point in my life. Someday, I will go back and visit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg57cca", "score_hidden": false, "stickied": false, "created": 1491986535.0, "created_utc": 1491957735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": "", "user_reports": [], "id": "dg5ms0p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SlimCognitwo", "parent_id": "t3_64pkj7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The hyperlinked pictures make this story stand out, and add a level of depth that's new and interesting. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The hyperlinked pictures make this story stand out, and add a level of depth that&amp;#39;s new and interesting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5ms0p", "score_hidden": false, "stickied": false, "created": 1492013732.0, "created_utc": 1491984932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pkj7", "likes": null, "replies": "", "user_reports": [], "id": "dgdmfme", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "youremomsgomjabbar", "parent_id": "t3_64pkj7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That was totally your cue to fill up the bottle, and judging by your night, with more water next time.\n\nFantastic story, thank you for sharing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was totally your cue to fill up the bottle, and judging by your night, with more water next time.&lt;/p&gt;\n\n&lt;p&gt;Fantastic story, thank you for sharing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdmfme", "score_hidden": false, "stickied": false, "created": 1492471744.0, "created_utc": 1492442944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]