[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;On August 7th, 1994 Oakville, Washington experienced a very unusual thunderstorm. It struck up at 3AM, when most of the residents were fast asleep. Those who were awake, however, were witness to the strangest rain they had ever seen; clear, gelatinous blobs the size of rice grains, some larger, falling from the sky. &lt;/p&gt;\n\n&lt;p&gt;At first, the residents were intrigued, touching the blobs, trying to figure out what they were. But this fascination soon grew to fear as people began falling sick and animals died. The blobs were collected and sent off for study, showing indications that they may have once been alive, and they were swarming with bacteria. &lt;/p&gt;\n\n&lt;p&gt;There were, of course, dozens of theories about what the blobs were, where they came from, and the residents—especially those who were there, who saw the blobs with their own eyes—speculated long, long into the night, crowded ten heads deep into the local brewpubs. Some said the blobs were just a natural phenomenon, something we just didn’t understand yet. Others said it had to be human waste, accidentally ejected from a plane flying over Oakville. A few said the UFOs were to blame, that they were seeding the land, testing us. And the rest said that it was the Navy, bombing the ocean nearby, upsetting a battalion of jellyfish, sending their innards way, way up into the sky and more than fifty miles inland. &lt;/p&gt;\n\n&lt;p&gt;Now, there are good points and bad for each theory, and they have each been tossed back and forth by the confused residents for all these years in an attempt to make some sense of this mystery. Yet, there are still no answers and many, many questions remain. And this would be all and well, a spooky, interesting story you can read before you sleep. Something to question, to wonder about, nothing more. &lt;/p&gt;\n\n&lt;p&gt;Except there is more. &lt;/p&gt;\n\n&lt;p&gt;And I’m starting to freak out. &lt;/p&gt;\n\n&lt;p&gt;My dog, Lucy, and I were just out about four hours ago on the outskirts Oakville in a heavily forested area doing some night time hunting and hiking. I know it’s not the smartest activity to do in the middle of a cloudy night, but it’s done, so there’s no point in crying over it. I made sure to park my car at the closest trailhead, noticing that there was one other vehicle in the lot: a black Ducati Scrambler. I sat admiring it for a good moment, trying to decide what it was doing there, before Lucy gave a short bark, indicating she was growing impatient. &lt;/p&gt;\n\n&lt;p&gt;The night started off fine, but as we went deeper into the woods, Lucy began acting strange; sniffing the air with her tail down, orbiting closer to me than usual, like she was scared of something. I thought it odd since she was always excited to be out, but when I spoke to her reassuringly, she wagged her tail and licked my hand. So we kept on. &lt;/p&gt;\n\n&lt;p&gt;After about an hour of tromping through the darkness, the dampness, Lucy stopped dead in her tracks and whined, but she wasn’t looking around us, no, she was looking straight up. Her head was cocked to one side like she heard something I couldn’t. Confused, I stopped behind her and looked up. The treetops almost entirely obscured the overcast sky and I didn’t see or hear anything. I shook my head and kept walking, calling out for her to follow. She whined again, not moving. I called her a second time, whistling softly. And that’s when I heard it. &lt;/p&gt;\n\n&lt;p&gt;A low rumbling. Like the mechanical growl of an overheating furnace; what I mean is that it sounded sinister, but it also didn’t sound like it was coming from any living creature. It sounded almost…alien. A wind picked up around us and I felt the first sticky drops of rain. I wiped my face, smearing something across it. It felt like I had rubbed liquid PVA glue across it. Confused I looked up, but the sky was dark, unyielding. &lt;/p&gt;\n\n&lt;p&gt;Suddenly we were caught in a downpour, it was heavy, coming down in sheets, even through the thick cover of the trees. I pulled my hood up and called to Lucy yet again with more urgency. She finally turned towards me, alert, focused, and together we began to run. &lt;/p&gt;\n\n&lt;p&gt;My feet were sticking to the ground as I weaved in and out of the trees, and behind me I could hear Lucy running to keep up, whimpering ever so slightly. I heard the rumbling noise again, louder this time, and looked up. I could make out a faint, faint outline of something; it was blocking out what little light there was behind it, it looked like the pointed end of a very large triangle. There was a sudden crashing noise and I about jumped out of my skin before turning around and seeing that it was Lucy. &lt;/p&gt;\n\n&lt;p&gt;She had fallen, tripped maybe, over a low-lying shrub. In the dim light of my headlamp, I could see that she wouldn’t be getting up again, at least not any time soon. A thick, pink colored foam was coming out of her mouth and her pupils were fully dilated. I ran over to her and knelt beside her. That’s when I noticed them, truly noticed them—the forest, Lucy, me, everything was covered in small, sticky goo-like blobs. I suppressed my fear, trying to not think of the stories I had heard from the locals of Oakville and concentrated on Lucy. She was still breathing, her pulse steady, but she was making a strange clicking noise. I muffled a sob and picked her up, heaving her halfway onto my shoulder, struggling to keep her balanced. Lucy isn’t a big dog by any means, but I was already carrying my pack and rifle. &lt;/p&gt;\n\n&lt;p&gt;I finally got her up, sliding and sticking to the blobs on the ground beneath me, when a light illuminated the area we were standing it and we were overcome by a loud, loud roaring noise. I closed my eyes and yelled, certain both Lucy and I were about to die. Instead, the sound slowly became recognizable to me: an engine, and it was revving. I opened my eyes. &lt;/p&gt;\n\n&lt;p&gt;The Ducati Scrambler. On it was a man wearing a muddy black suit and a helmeted gasmask. &lt;/p&gt;\n\n&lt;p&gt;“Get on!”&lt;/p&gt;\n\n&lt;p&gt;I didn’t need telling twice. I threw my pack down, handed my rifle to the man who slung it across his back, and zipped Lucy up into my jacket, sliding onto the seat behind him. He revved the engine again and, as he shifted into first, I looked up, seeing many multicolored lights above us, as if that creepy black triangle knew we were there and were trying to see us better. Around us the blobs flew up, looking like strange and sinister jewels in the headlights of the motorcycle. &lt;/p&gt;\n\n&lt;p&gt;Soon, the rain—the falling blobs—died down, until it stopped completely, and above us the sky was filled with wispy clouds; whatever was up there before was gone. The man pulled into the trailhead and killed the engine. I slid off, rushing Lucy to the back seat of my car, trying not to cry. She was completely comatose, her tongue hanging from her mouth. Behind me I heard rustle, the sounds of zippers and Velcro.&lt;/p&gt;\n\n&lt;p&gt;“I can help,” it was the man, he still hadn’t removed his mask. He was holding a syringe filled with a minty green colored liquid. &lt;/p&gt;\n\n&lt;p&gt;“Wha—” &lt;/p&gt;\n\n&lt;p&gt;“She’ll die. Let me help.”&lt;/p&gt;\n\n&lt;p&gt;“I—but…” I hesitated, looking down at her, seeing all those gooey blobs stuck into her fur. “Okay.”&lt;/p&gt;\n\n&lt;p&gt;The man stepped past me, quickly found a blood vessel in her arm, and injected the light green liquid into her. A few tense moments passed. Then—Lucy’s eyes fluttered and she smacked her mouth, before she opened her eyes and wagged her tail, slowly at first, then vigorously. I yelled her name and bent down, giving her a huge hug. I heard the man speak again behind me. &lt;/p&gt;\n\n&lt;p&gt;“Now you.”&lt;/p&gt;\n\n&lt;p&gt;I let Lucy go and turned towards him, “What?”&lt;/p&gt;\n\n&lt;p&gt;“You’re compromised. This will help.” He held up a second syringe, filled with a much darker green substance. He noticed that I noticed and simply said, “Diluted it for the dog.”&lt;/p&gt;\n\n&lt;p&gt;Finally, my senses came crashing back to me and I took a step back. “Who are you, what’s going on, what &lt;em&gt;was&lt;/em&gt; that? And &lt;em&gt;this&lt;/em&gt;?” I flicked one of the blobs off my jacket and onto the ground. Next to me I heard Lucy grooming herself. &lt;/p&gt;\n\n&lt;p&gt;“Don’t let her eat it,” the man said and I stopped her, she licked my hand then hopped out of the car, walking around us, sniffing the shoes of the strange man. He sighed, pulling off his gasmask helmet revealing a tired face and slightly matted wood colored hair. He shrugged off my rifle, handed it to me, then continued. “Look, I’m an, um, investigative agent—”&lt;/p&gt;\n\n&lt;p&gt;“Like the FBI?”&lt;/p&gt;\n\n&lt;p&gt;The man was silent for a beat, then said, “You could say that, yeah. I’m sure you’re familiar with the local, ah, lore of the area?”&lt;/p&gt;\n\n&lt;p&gt;“You mean the Oakville blobs?” The man nodded. “Yeah, I am, what about them? Is that what this was?”&lt;/p&gt;\n\n&lt;p&gt;“Star rot,” the man said, and I looked at him confused, but he kept speaking, “star shot, star jelly, astral jelly, moon poo…” He bent down and scratched Lucy on the head. &lt;/p&gt;\n\n&lt;p&gt;“Moon poo? Um what’s going on?”&lt;/p&gt;\n\n&lt;p&gt;“All different names used to describe a strange gummy substance that falls from the sky. If legends are to be believed, it’s been falling from the sky for a very long time.”&lt;/p&gt;\n\n&lt;p&gt;“And…”&lt;/p&gt;\n\n&lt;p&gt;“And,” the man repeated, holding up the syringe again, “this will help you.”&lt;/p&gt;\n\n&lt;p&gt;“Look, I have no idea who you are, why you’re out here, how the &lt;em&gt;hell&lt;/em&gt; you saved Lucy, but I’m not feeling sick at all. Thanks and everything for helping us, but I think we should be on our way.”&lt;/p&gt;\n\n&lt;p&gt;The man looked at me, searching my face, then pulled the needle from the syringe and placed both in a plastic container he then put in his breast pocket. “Suit yourself…” He tugged his helmet back on, gave Lucy another pat, and turned to me, “If you do start feeling sick though, if you notice any changes at all, call me.” He handed me a black business card, hopped back on his bike, revved one, kicked into first, and flew back down the path towards the woods we just exited. &lt;/p&gt;\n\n&lt;p&gt;An hour later, Lucy and I were back home, bathed and fed. And I felt absolutely fine, robust even, for a good while. But now, not so much, now I’m starting to experience some weird shit; my breath is coming up in wheezes, my eyesight has gotten strangely clearer and I’m seeing…&lt;em&gt;things&lt;/em&gt;, weird things, like tiny little greyish faces peering at me from around corners and doorways and furniture, just out of sight enough that I’m starting to question my sanity. And there’s this smell, faint, lingering, of roast apples. Maybe it’s just stress…&lt;/p&gt;\n\n&lt;p&gt;Here’s the thing, though, the card, it’s blank, or I thought it was. It’s totally and completely matte black, and, even after turning it over dozens of times I couldn’t find anything on it. It was only after I set it on the edge of my laptop while I was researching my symptoms that I noticed something strange happening, a thin looping script revealed itself, slowly spelling out a single number—I think the heat brought it out. But there’s no area code on it, and when I called it I got a busy signal. &lt;/p&gt;\n\n&lt;p&gt;It’s late and I’m tired, so I think I might just go to bed, deal with this all tomorrow, set up appointments for both me and Lucy to get checked out, maybe talk to the cops. She seems okay, though, so hopefully I will be too. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Update&lt;/strong&gt;: Woke up hours ago still feeling pretty shitty and weird, but still took Lucy to the vet then my ass to the doctor, which is a big deal since I don’t have health insurance. Driving was…difficult due to the strange hallucinations, so I took the backroads just in case. The vet said Lucy was totally healthy, maybe even healthier than her last check-up. Then he turned to me, concern on his face, and asked if &lt;em&gt;I&lt;/em&gt; was okay. I nodded and lurched my way out, dropping Lucy back home on my way to the doctor’s office. &lt;/p&gt;\n\n&lt;p&gt;While waiting for him to call me in, I saw the muted headline of the news on the waiting room TV. A few rangers had found two dozen or so dead deer northeast of Oakville. Looked like they were covered with a strange slime. I shuddered and looked away. &lt;/p&gt;\n\n&lt;p&gt;The doctor could find nothing wrong with me; I was slightly afraid of that. He said all my counts were normal, my blood pressure was fine, that I had no fever. But he could see—and I told him—that I didn’t &lt;em&gt;look&lt;/em&gt; or &lt;em&gt;feel&lt;/em&gt; well. He simply shrugged and told me it was probably stress, then asked if I wanted any pills for that, anxiety, or depression. I shook my head and made the long, meandering way back to my house. &lt;/p&gt;\n\n&lt;p&gt;As soon as I walked in the door I knew something was off. Lucy didn’t greet me like usual, and my apartment was generally &lt;em&gt;cleaner&lt;/em&gt;. I called out for Lucy but she didn’t come. Confused, I walked forward when I saw it. A small, metal box on my kitchen table, with a single sheet of folded black paper on top. Slowly I walked towards it and reached forward, unfolding the note. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Saw you called. Sorry I missed you. Glad you changed your mind.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I opened the clasp on the metal box and saw the syringe filled with the dark green substance and a single black card illustrating how to find a vein in your own arm. I didn’t know whether to smile or run. Then again, he did clean up a bit. &lt;/p&gt;\n\n&lt;p&gt;I heard a pattering sound behind me. It was Lucy, she had finally come to me. Her eyes were big and she was wagging her tail furiously. And in her mouth, she was holding the biggest bone I have ever seen. &lt;/p&gt;\n\n&lt;p&gt;Good guy, that gasmask man. Still, I wonder who he is, what the &lt;em&gt;hell&lt;/em&gt; that stuff was, and if it’ll fall again over a larger area…&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/645xel/emergency_sirens_have_been_sounding_in_dallas_for/\"&gt;+&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "On August 7th, 1994 Oakville, Washington experienced a very unusual thunderstorm. It struck up at 3AM, when most of the residents were fast asleep. Those who were awake, however, were witness to the strangest rain they had ever seen; clear, gelatinous blobs the size of rice grains, some larger, falling from the sky. \n\n\n\nAt first, the residents were intrigued, touching the blobs, trying to figure out what they were. But this fascination soon grew to fear as people began falling sick and animals died. The blobs were collected and sent off for study, showing indications that they may have once been alive, and they were swarming with bacteria. \n\n\n\nThere were, of course, dozens of theories about what the blobs were, where they came from, and the residents—especially those who were there, who saw the blobs with their own eyes—speculated long, long into the night, crowded ten heads deep into the local brewpubs. Some said the blobs were just a natural phenomenon, something we just didn’t understand yet. Others said it had to be human waste, accidentally ejected from a plane flying over Oakville. A few said the UFOs were to blame, that they were seeding the land, testing us. And the rest said that it was the Navy, bombing the ocean nearby, upsetting a battalion of jellyfish, sending their innards way, way up into the sky and more than fifty miles inland. \n\n\n\nNow, there are good points and bad for each theory, and they have each been tossed back and forth by the confused residents for all these years in an attempt to make some sense of this mystery. Yet, there are still no answers and many, many questions remain. And this would be all and well, a spooky, interesting story you can read before you sleep. Something to question, to wonder about, nothing more. \n\n\n\nExcept there is more. \n\n\n\nAnd I’m starting to freak out. \n\n\n\nMy dog, Lucy, and I were just out about four hours ago on the outskirts Oakville in a heavily forested area doing some night time hunting and hiking. I know it’s not the smartest activity to do in the middle of a cloudy night, but it’s done, so there’s no point in crying over it. I made sure to park my car at the closest trailhead, noticing that there was one other vehicle in the lot: a black Ducati Scrambler. I sat admiring it for a good moment, trying to decide what it was doing there, before Lucy gave a short bark, indicating she was growing impatient. \n\n\n\nThe night started off fine, but as we went deeper into the woods, Lucy began acting strange; sniffing the air with her tail down, orbiting closer to me than usual, like she was scared of something. I thought it odd since she was always excited to be out, but when I spoke to her reassuringly, she wagged her tail and licked my hand. So we kept on. \n\n\n\nAfter about an hour of tromping through the darkness, the dampness, Lucy stopped dead in her tracks and whined, but she wasn’t looking around us, no, she was looking straight up. Her head was cocked to one side like she heard something I couldn’t. Confused, I stopped behind her and looked up. The treetops almost entirely obscured the overcast sky and I didn’t see or hear anything. I shook my head and kept walking, calling out for her to follow. She whined again, not moving. I called her a second time, whistling softly. And that’s when I heard it. \n\n\n\nA low rumbling. Like the mechanical growl of an overheating furnace; what I mean is that it sounded sinister, but it also didn’t sound like it was coming from any living creature. It sounded almost…alien. A wind picked up around us and I felt the first sticky drops of rain. I wiped my face, smearing something across it. It felt like I had rubbed liquid PVA glue across it. Confused I looked up, but the sky was dark, unyielding. \n\n\n\nSuddenly we were caught in a downpour, it was heavy, coming down in sheets, even through the thick cover of the trees. I pulled my hood up and called to Lucy yet again with more urgency. She finally turned towards me, alert, focused, and together we began to run. \n\n\n\nMy feet were sticking to the ground as I weaved in and out of the trees, and behind me I could hear Lucy running to keep up, whimpering ever so slightly. I heard the rumbling noise again, louder this time, and looked up. I could make out a faint, faint outline of something; it was blocking out what little light there was behind it, it looked like the pointed end of a very large triangle. There was a sudden crashing noise and I about jumped out of my skin before turning around and seeing that it was Lucy. \n\n\n\nShe had fallen, tripped maybe, over a low-lying shrub. In the dim light of my headlamp, I could see that she wouldn’t be getting up again, at least not any time soon. A thick, pink colored foam was coming out of her mouth and her pupils were fully dilated. I ran over to her and knelt beside her. That’s when I noticed them, truly noticed them—the forest, Lucy, me, everything was covered in small, sticky goo-like blobs. I suppressed my fear, trying to not think of the stories I had heard from the locals of Oakville and concentrated on Lucy. She was still breathing, her pulse steady, but she was making a strange clicking noise. I muffled a sob and picked her up, heaving her halfway onto my shoulder, struggling to keep her balanced. Lucy isn’t a big dog by any means, but I was already carrying my pack and rifle. \n\n\n\nI finally got her up, sliding and sticking to the blobs on the ground beneath me, when a light illuminated the area we were standing it and we were overcome by a loud, loud roaring noise. I closed my eyes and yelled, certain both Lucy and I were about to die. Instead, the sound slowly became recognizable to me: an engine, and it was revving. I opened my eyes. \n\n\n\nThe Ducati Scrambler. On it was a man wearing a muddy black suit and a helmeted gasmask. \n\n\n\n“Get on!”\n\n\n\nI didn’t need telling twice. I threw my pack down, handed my rifle to the man who slung it across his back, and zipped Lucy up into my jacket, sliding onto the seat behind him. He revved the engine again and, as he shifted into first, I looked up, seeing many multicolored lights above us, as if that creepy black triangle knew we were there and were trying to see us better. Around us the blobs flew up, looking like strange and sinister jewels in the headlights of the motorcycle. \n\n\n\nSoon, the rain—the falling blobs—died down, until it stopped completely, and above us the sky was filled with wispy clouds; whatever was up there before was gone. The man pulled into the trailhead and killed the engine. I slid off, rushing Lucy to the back seat of my car, trying not to cry. She was completely comatose, her tongue hanging from her mouth. Behind me I heard rustle, the sounds of zippers and Velcro.\n\n\n\n“I can help,” it was the man, he still hadn’t removed his mask. He was holding a syringe filled with a minty green colored liquid. \n\n\n\n“Wha—” \n\n\n\n“She’ll die. Let me help.”\n\n\n\n“I—but…” I hesitated, looking down at her, seeing all those gooey blobs stuck into her fur. “Okay.”\n\n\n\nThe man stepped past me, quickly found a blood vessel in her arm, and injected the light green liquid into her. A few tense moments passed. Then—Lucy’s eyes fluttered and she smacked her mouth, before she opened her eyes and wagged her tail, slowly at first, then vigorously. I yelled her name and bent down, giving her a huge hug. I heard the man speak again behind me. \n\n\n\n“Now you.”\n\n\n\nI let Lucy go and turned towards him, “What?”\n\n\n\n“You’re compromised. This will help.” He held up a second syringe, filled with a much darker green substance. He noticed that I noticed and simply said, “Diluted it for the dog.”\n\n\n\nFinally, my senses came crashing back to me and I took a step back. “Who are you, what’s going on, what *was* that? And *this*?” I flicked one of the blobs off my jacket and onto the ground. Next to me I heard Lucy grooming herself. \n\n\n\n“Don’t let her eat it,” the man said and I stopped her, she licked my hand then hopped out of the car, walking around us, sniffing the shoes of the strange man. He sighed, pulling off his gasmask helmet revealing a tired face and slightly matted wood colored hair. He shrugged off my rifle, handed it to me, then continued. “Look, I’m an, um, investigative agent—”\n\n\n\n“Like the FBI?”\n\n\n\nThe man was silent for a beat, then said, “You could say that, yeah. I’m sure you’re familiar with the local, ah, lore of the area?”\n\n\n\n“You mean the Oakville blobs?” The man nodded. “Yeah, I am, what about them? Is that what this was?”\n\n\n\n“Star rot,” the man said, and I looked at him confused, but he kept speaking, “star shot, star jelly, astral jelly, moon poo…” He bent down and scratched Lucy on the head. \n\n\n\n“Moon poo? Um what’s going on?”\n\n\n\n“All different names used to describe a strange gummy substance that falls from the sky. If legends are to be believed, it’s been falling from the sky for a very long time.”\n\n\n\n“And…”\n\n\n\n“And,” the man repeated, holding up the syringe again, “this will help you.”\n\n\n\n“Look, I have no idea who you are, why you’re out here, how the *hell* you saved Lucy, but I’m not feeling sick at all. Thanks and everything for helping us, but I think we should be on our way.”\n\n\n\nThe man looked at me, searching my face, then pulled the needle from the syringe and placed both in a plastic container he then put in his breast pocket. “Suit yourself…” He tugged his helmet back on, gave Lucy another pat, and turned to me, “If you do start feeling sick though, if you notice any changes at all, call me.” He handed me a black business card, hopped back on his bike, revved one, kicked into first, and flew back down the path towards the woods we just exited. \n\n\n\nAn hour later, Lucy and I were back home, bathed and fed. And I felt absolutely fine, robust even, for a good while. But now, not so much, now I’m starting to experience some weird shit; my breath is coming up in wheezes, my eyesight has gotten strangely clearer and I’m seeing…*things*, weird things, like tiny little greyish faces peering at me from around corners and doorways and furniture, just out of sight enough that I’m starting to question my sanity. And there’s this smell, faint, lingering, of roast apples. Maybe it’s just stress…\n\n\n\nHere’s the thing, though, the card, it’s blank, or I thought it was. It’s totally and completely matte black, and, even after turning it over dozens of times I couldn’t find anything on it. It was only after I set it on the edge of my laptop while I was researching my symptoms that I noticed something strange happening, a thin looping script revealed itself, slowly spelling out a single number—I think the heat brought it out. But there’s no area code on it, and when I called it I got a busy signal. \n\n\n\nIt’s late and I’m tired, so I think I might just go to bed, deal with this all tomorrow, set up appointments for both me and Lucy to get checked out, maybe talk to the cops. She seems okay, though, so hopefully I will be too. \n\n\n\n**Update**: Woke up hours ago still feeling pretty shitty and weird, but still took Lucy to the vet then my ass to the doctor, which is a big deal since I don’t have health insurance. Driving was…difficult due to the strange hallucinations, so I took the backroads just in case. The vet said Lucy was totally healthy, maybe even healthier than her last check-up. Then he turned to me, concern on his face, and asked if *I* was okay. I nodded and lurched my way out, dropping Lucy back home on my way to the doctor’s office. \n\n\n\nWhile waiting for him to call me in, I saw the muted headline of the news on the waiting room TV. A few rangers had found two dozen or so dead deer northeast of Oakville. Looked like they were covered with a strange slime. I shuddered and looked away. \n\n\n\nThe doctor could find nothing wrong with me; I was slightly afraid of that. He said all my counts were normal, my blood pressure was fine, that I had no fever. But he could see—and I told him—that I didn’t *look* or *feel* well. He simply shrugged and told me it was probably stress, then asked if I wanted any pills for that, anxiety, or depression. I shook my head and made the long, meandering way back to my house. \n\n\n\nAs soon as I walked in the door I knew something was off. Lucy didn’t greet me like usual, and my apartment was generally *cleaner*. I called out for Lucy but she didn’t come. Confused, I walked forward when I saw it. A small, metal box on my kitchen table, with a single sheet of folded black paper on top. Slowly I walked towards it and reached forward, unfolding the note. \n\n\n\n*Saw you called. Sorry I missed you. Glad you changed your mind.*\n\n\n\nI opened the clasp on the metal box and saw the syringe filled with the dark green substance and a single black card illustrating how to find a vein in your own arm. I didn’t know whether to smile or run. Then again, he did clean up a bit. \n\n\n\nI heard a pattering sound behind me. It was Lucy, she had finally come to me. Her eyes were big and she was wagging her tail furiously. And in her mouth, she was holding the biggest bone I have ever seen. \n\n\n\nGood guy, that gasmask man. Still, I wonder who he is, what the *hell* that stuff was, and if it’ll fall again over a larger area…\n\n\n*****\n[+](https://www.reddit.com/r/nosleep/comments/645xel/emergency_sirens_have_been_sounding_in_dallas_for/)\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64pml2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 329, "report_reasons": null, "author": "darthvarda", "saved": false, "mod_reports": [], "name": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1491936919.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64pml2/the_oakville_blobs/", "num_reports": null, "locked": false, "stickied": false, "created": 1491928506.0, "url": "https://www.reddit.com/r/nosleep/comments/64pml2/the_oakville_blobs/", "author_flair_text": null, "quarantine": false, "title": "The Oakville Blobs", "created_utc": 1491899706.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 329}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg4bmpj", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "FamilialDichotomy", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Glad this happened in Washington and not Canada like I was originally thinking. You keep your star poo over there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad this happened in Washington and not Canada like I was originally thinking. You keep your star poo over there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4bmpj", "score_hidden": false, "stickied": false, "created": 1491949676.0, "created_utc": 1491920876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg4mp4o", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "proffesordaddy", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Your dog got sick due to stuff falling from the sky and a guy fixes it, and you refuse a shot. Right well, I hope you didn't die in your sleep or something. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your dog got sick due to stuff falling from the sky and a guy fixes it, and you refuse a shot. Right well, I hope you didn&amp;#39;t die in your sleep or something. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4mp4o", "score_hidden": false, "stickied": false, "created": 1491961955.0, "created_utc": 1491933155.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg4lfhs", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "RonaldTheGiraffe", "parent_id": "t1_dg4atz1", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Until the moon starts shitting on you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Until the moon starts shitting on you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4lfhs", "score_hidden": false, "stickied": false, "created": 1491960576.0, "created_utc": 1491931776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dgcdf49", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IOnlyCabbage", "parent_id": "t1_dg4atz1", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lmao I live in Oakville Ontario too and I was definitely taken aback by the title ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lmao I live in Oakville Ontario too and I was definitely taken aback by the title &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcdf49", "score_hidden": false, "stickied": false, "created": 1492395967.0, "created_utc": 1492367167.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4atz1", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "ctmu", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I live in Oakville Ontario and its actually the safest place in Canada", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live in Oakville Ontario and its actually the safest place in Canada&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4atz1", "score_hidden": false, "stickied": false, "created": 1491948696.0, "created_utc": 1491919896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg4q8cx", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "darthvarda", "parent_id": "t1_dg4ciai", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Done!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Done!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4q8cx", "score_hidden": false, "stickied": false, "created": 1491965804.0, "created_utc": 1491937004.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ciai", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Decembermouse", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Update when you know more!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Update when you know more!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4ciai", "score_hidden": false, "stickied": false, "created": 1491950718.0, "created_utc": 1491921918.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg5mtax", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CarTunez", "parent_id": "t1_dg5hz7r", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "i want to believe...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i want to believe...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5mtax", "score_hidden": false, "stickied": false, "created": 1492013846.0, "created_utc": 1491985046.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hz7r", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "threewolvesdeep", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Is it weird that I kind of hope something super spooky happens to me so I can meet Spooky?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it weird that I kind of hope something super spooky happens to me so I can meet Spooky?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5hz7r", "score_hidden": false, "stickied": false, "created": 1492002064.0, "created_utc": 1491973264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg66uei", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "darkdesertedhighway", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It's the dude in the suit again! He sure gets around. Take the shot, man. You'll be right as rain again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s the dude in the suit again! He sure gets around. Take the shot, man. You&amp;#39;ll be right as rain again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg66uei", "score_hidden": false, "stickied": false, "created": 1492046163.0, "created_utc": 1492017363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg5fpl0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MJGOO", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Fellow washingtonian. :D ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fellow washingtonian. :D &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5fpl0", "score_hidden": false, "stickied": false, "created": 1491998093.0, "created_utc": 1491969293.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg50mmq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Discord_and_Dine", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oakville, WA is about an hour drive from my apartment...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oakville, WA is about an hour drive from my apartment...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg50mmq", "score_hidden": false, "stickied": false, "created": 1491977643.0, "created_utc": 1491948843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dgdizcf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "geminidragonheart", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "How many vehicles does cooper have? I love reading a story without really examining it only to have \"spooky\" show up. I always picture coop from twin peaks but looooong after the show ended so he knows about all the weird stuff now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How many vehicles does cooper have? I love reading a story without really examining it only to have &amp;quot;spooky&amp;quot; show up. I always picture coop from twin peaks but looooong after the show ended so he knows about all the weird stuff now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdizcf", "score_hidden": false, "stickied": false, "created": 1492467353.0, "created_utc": 1492438553.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64pml2", "likes": null, "replies": "", "user_reports": [], "id": "dg4vct9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gameshurtmymind", "parent_id": "t3_64pml2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Look up Trevor James Constables' \"critters\" - that's what the blobs were. The Ducats scrambler's a close second to the Triumph, but still second....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look up Trevor James Constables&amp;#39; &amp;quot;critters&amp;quot; - that&amp;#39;s what the blobs were. The Ducats scrambler&amp;#39;s a close second to the Triumph, but still second....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4vct9", "score_hidden": false, "stickied": false, "created": 1491971365.0, "created_utc": 1491942565.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]