[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes he gives in the most odd ways. A tooth here, some scissors there, maybe a razor blade under your pillow, or even shards of glass in your porridge. He doesn&amp;#39;t mean to hurt you though, he just wants to give you gifts that he thinks you&amp;#39;d appreciate. He listens to your deepest, darkest thoughts, and he really wants to make them come true. Gifts that he thinks you want, after all, you did wish to die, didn&amp;#39;t you. &lt;/p&gt;\n\n&lt;p&gt;When you missed the train last week, wasn&amp;#39;t the thought that ran through your head, “Fuck me, I want to jump onto the live wires?” It wasn&amp;#39;t a mistake that the man rushing through the crowd towards another platform bumped into you, sending you stumbling towards the tracks. It was the Giver trying to give you what you wanted. He was quite offended when you pulled back and shouted what a cunt the man was. He just wanted to help. &lt;/p&gt;\n\n&lt;p&gt;The Giver has been with me since I can remember. Since I was a little kid, sitting at my cot, staring at the man in the corner, a strange smile on his face. \n“We&amp;#39;ll be best friend forever,” he whispered, a tone so low I almost couldn&amp;#39;t hear it, “and I&amp;#39;ll give you everything that it is you want.” &lt;/p&gt;\n\n&lt;p&gt;The Giver whispers these things to me sometimes. He sits on the shelf by my bed, telling me how he loves to give. He tells me of all the things that he&amp;#39;s ever given to people. He tells me about the people who have accepted his gifts. He tells me what they did with them. He tells me of the people that didn&amp;#39;t accept his gifts, and exactly what it is that he wants to do to them. Yesterday he gave me a necklace made of teeth. &lt;/p&gt;\n\n&lt;p&gt;“For you,” he whispered in his deep raspy voice, “remember you said you wished you had your baby teeth again? I know just how much you hate your yellow ones. Too coffee stained, right? Why don&amp;#39;t you go cut those ones right out of your gums with the razor I gave you last week, and stick these ones right in there?” &lt;/p&gt;\n\n&lt;p&gt;When I didn&amp;#39;t, he got quite angry. You see, the thing with The Giver, is that he can&amp;#39;t touch you, he can&amp;#39;t hurt you, but he can make other people use your gifts for you, and he can encourage you to use them yourself. It&amp;#39;s just the way The Giver works. Remember, he doesn&amp;#39;t want to hurt you, he just wants to give you what you want. &lt;/p&gt;\n\n&lt;p&gt;“Do you know how long it took me to get those? Do you know just how much persuasion that god damned father needed,” He hissed, his face turning venomous, yet he made no move to touch me, “You know how much I hate the sound of screaming. And do you know just how much these little ones screamed. Oh they screamed and they cried. But they stopped eventually, yes they did. Do you want to see how I got them? I can show you, I am The Giver after all, and if that is what you want to see, than I can give it to you.” &lt;/p&gt;\n\n&lt;p&gt;I begged and begged him not to show me, I begged him not to tell me. But as hard as I fought it, there was a mild curiosity. A curiosity that the primal beast in him smelt. He took pity on me, so he didn&amp;#39;t show me, but he let me hear the screams. He let me understand the effort he went through. &lt;/p&gt;\n\n&lt;p&gt;I still didn&amp;#39;t take them though, because from the sounds of it, it would hurt a lot. &lt;/p&gt;\n\n&lt;p&gt;Oh yes, he had been with me all my life. He&amp;#39;d sat with my during my darkest moments, when I wished for it all to be over. He left me the gift of Cyanide. It itself was in a vial, small, marked with a C, but somehow, I knew exactly what is was. Of course I threw it out, but for the few weeks afterwards, it would appear everywhere, until my mother found it and sent me away to a health facility, when she recognised the smell. She worked with chemicals for years, so she recognised it instantly. &lt;/p&gt;\n\n&lt;p&gt;The Giver left me a pair of tweezers next. I was sitting in my room in the facility, and he told me to lift my pillow. They were razor sharp, and every time I picked them up, they cut my fingers. &lt;/p&gt;\n\n&lt;p&gt;“When they come in,” he wheezed, a grin on his voice, “right in the eye.” he made the motion with his hands. “Show them not to mess with you. Take that anger out. It won&amp;#39;t be too hard. I know you want to. I know how you think of escaping. I know what you think of doing to your Mum. I mean, she just sent you away. She didn&amp;#39;t even ask why you had it. Come on, I know you can do it. Just one stab, and everything will be fine. Just do it.” &lt;/p&gt;\n\n&lt;p&gt;He moved closer, and I could almost see to the bottom of his eyes, but there always seemed to be another hidden layer, one that I just couldn&amp;#39;t get past. The sheen of madness floating at the top like an oil spill always made it hard.&lt;/p&gt;\n\n&lt;p&gt;“If you do, maybe I&amp;#39;ll be quiet for a bit. I mean, I&amp;#39;d be satisfied. Wouldn&amp;#39;t you? I bet you would be. I bet you would.” &lt;/p&gt;\n\n&lt;p&gt;I never ended up doing it, but I managed to fall over a cup that was left sitting in the middle of the floor, and the tweezers finally got to see their fair share of bloodshed. Unfortunately The Giver had left the tweezers sitting propped up inside the cup, and they decided to house themselves deep within my leg.&lt;/p&gt;\n\n&lt;p&gt;I got put in a padded cell after that, and a slap on the wrist for hurting myself and brining it banned items. The Giver smirked and stayed quiet for a while after that. I&amp;#39;m plenty sure that he was playing the moment over and over in his head. Sometimes he made me imagine blood seeping out of the old scar, just because he knew that it made me feel alive, a difference from those white padded walls.&lt;/p&gt;\n\n&lt;p&gt;After living in the mental unit for over ten years, I was finally released into the wild, the great society, the community. People avoided me like the plague, but I didn&amp;#39;t mind. I had The Giver, and he promised to be my best friend always, and I didn&amp;#39;t mind that, no matter the trouble that he caused. &lt;/p&gt;\n\n&lt;p&gt;Yesterday when I got home from work, there was a cup sitting on the counter. The Giver was sitting at the table, smiling, beckoning me to take a sip. &lt;/p&gt;\n\n&lt;p&gt;“This will help those teeth,” he hummed, “it will take those stains right off.” &lt;/p&gt;\n\n&lt;p&gt;I fidgeted, licked my teeth with my tongue, and smelt what was in the glass. Just as I thought, it was bleach. Of course I poured it down the drain, sighed, and sat down with The Giver.&lt;/p&gt;\n\n&lt;p&gt;His face turned thunderous, and he cried out in rage.&lt;/p&gt;\n\n&lt;p&gt;“Do you know what it took for me to get that! Do you know just how good for you that was supposed to be! It would have washed away those sins! It would have taken away the pain from inside your head!” His tone softened. “Just one sip, please. I promise it wont hurt. You know me, I just want to give you what you want. If you take a sip, I promise I wont mention it any more. Please, for me? Remember, we&amp;#39;re going to be best friends till the end.” &lt;/p&gt;\n\n&lt;p&gt;I sighed, and shook my head. I dared not say a word, for I knew he could use it against me. After all, that was how he chose his gifts. I made sure to think the right things carefully. I always wondered what would happen if I said that I wished he would disappear, but I knew that it wouldn&amp;#39;t work. You had to wish for something to happen to you. &lt;/p&gt;\n\n&lt;p&gt;“Giver?” I asked, after much deliberation. “What if I wish for something to happen to someone else?” &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t want anything to happen to other people, but soon enough, I was going to buckle. I would give in. I would use the gifts he brought me, and god I know, I know just how horrible that would end. &lt;/p&gt;\n\n&lt;p&gt;“Well...” He drawled, a smirk creeping up his dark face, shrouded in shadows that came seemingly from any angle, whenever he wanted. “I would stop gifting you of course. If that was what you wanted. But! You get to chose the gifts.” &lt;/p&gt;\n\n&lt;p&gt;“And you will stop giving me gifts?”&lt;/p&gt;\n\n&lt;p&gt;“If that is really what you want.”&lt;/p&gt;\n\n&lt;p&gt;From that day forwards I became the giver. I was better at it. I knew humanity, inside and out, whereas The Giver was much less acquainted, as he hadn&amp;#39;t been human for oh so long. But I was still human. I knew the darkest thoughts, the way they cross your mind. I&amp;#39;m better at tempting. So whenever you&amp;#39;re feeling down, and suddenly, there&amp;#39;s something sharp near you, don&amp;#39;t dismiss it as a coincidence. Because you never know when The Giver is going to visit you. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sometimes he gives in the most odd ways. A tooth here, some scissors there, maybe a razor blade under your pillow, or even shards of glass in your porridge. He doesn't mean to hurt you though, he just wants to give you gifts that he thinks you'd appreciate. He listens to your deepest, darkest thoughts, and he really wants to make them come true. Gifts that he thinks you want, after all, you did wish to die, didn't you. \n\nWhen you missed the train last week, wasn't the thought that ran through your head, “Fuck me, I want to jump onto the live wires?” It wasn't a mistake that the man rushing through the crowd towards another platform bumped into you, sending you stumbling towards the tracks. It was the Giver trying to give you what you wanted. He was quite offended when you pulled back and shouted what a cunt the man was. He just wanted to help. \n\nThe Giver has been with me since I can remember. Since I was a little kid, sitting at my cot, staring at the man in the corner, a strange smile on his face. \n“We'll be best friend forever,” he whispered, a tone so low I almost couldn't hear it, “and I'll give you everything that it is you want.” \n\nThe Giver whispers these things to me sometimes. He sits on the shelf by my bed, telling me how he loves to give. He tells me of all the things that he's ever given to people. He tells me about the people who have accepted his gifts. He tells me what they did with them. He tells me of the people that didn't accept his gifts, and exactly what it is that he wants to do to them. Yesterday he gave me a necklace made of teeth. \n\n“For you,” he whispered in his deep raspy voice, “remember you said you wished you had your baby teeth again? I know just how much you hate your yellow ones. Too coffee stained, right? Why don't you go cut those ones right out of your gums with the razor I gave you last week, and stick these ones right in there?” \n\nWhen I didn't, he got quite angry. You see, the thing with The Giver, is that he can't touch you, he can't hurt you, but he can make other people use your gifts for you, and he can encourage you to use them yourself. It's just the way The Giver works. Remember, he doesn't want to hurt you, he just wants to give you what you want. \n\n“Do you know how long it took me to get those? Do you know just how much persuasion that god damned father needed,” He hissed, his face turning venomous, yet he made no move to touch me, “You know how much I hate the sound of screaming. And do you know just how much these little ones screamed. Oh they screamed and they cried. But they stopped eventually, yes they did. Do you want to see how I got them? I can show you, I am The Giver after all, and if that is what you want to see, than I can give it to you.” \n\nI begged and begged him not to show me, I begged him not to tell me. But as hard as I fought it, there was a mild curiosity. A curiosity that the primal beast in him smelt. He took pity on me, so he didn't show me, but he let me hear the screams. He let me understand the effort he went through. \n\nI still didn't take them though, because from the sounds of it, it would hurt a lot. \n\nOh yes, he had been with me all my life. He'd sat with my during my darkest moments, when I wished for it all to be over. He left me the gift of Cyanide. It itself was in a vial, small, marked with a C, but somehow, I knew exactly what is was. Of course I threw it out, but for the few weeks afterwards, it would appear everywhere, until my mother found it and sent me away to a health facility, when she recognised the smell. She worked with chemicals for years, so she recognised it instantly. \n\nThe Giver left me a pair of tweezers next. I was sitting in my room in the facility, and he told me to lift my pillow. They were razor sharp, and every time I picked them up, they cut my fingers. \n\n“When they come in,” he wheezed, a grin on his voice, “right in the eye.” he made the motion with his hands. “Show them not to mess with you. Take that anger out. It won't be too hard. I know you want to. I know how you think of escaping. I know what you think of doing to your Mum. I mean, she just sent you away. She didn't even ask why you had it. Come on, I know you can do it. Just one stab, and everything will be fine. Just do it.” \n\nHe moved closer, and I could almost see to the bottom of his eyes, but there always seemed to be another hidden layer, one that I just couldn't get past. The sheen of madness floating at the top like an oil spill always made it hard.\n\n“If you do, maybe I'll be quiet for a bit. I mean, I'd be satisfied. Wouldn't you? I bet you would be. I bet you would.” \n\nI never ended up doing it, but I managed to fall over a cup that was left sitting in the middle of the floor, and the tweezers finally got to see their fair share of bloodshed. Unfortunately The Giver had left the tweezers sitting propped up inside the cup, and they decided to house themselves deep within my leg.\n\nI got put in a padded cell after that, and a slap on the wrist for hurting myself and brining it banned items. The Giver smirked and stayed quiet for a while after that. I'm plenty sure that he was playing the moment over and over in his head. Sometimes he made me imagine blood seeping out of the old scar, just because he knew that it made me feel alive, a difference from those white padded walls.\n\nAfter living in the mental unit for over ten years, I was finally released into the wild, the great society, the community. People avoided me like the plague, but I didn't mind. I had The Giver, and he promised to be my best friend always, and I didn't mind that, no matter the trouble that he caused. \n \nYesterday when I got home from work, there was a cup sitting on the counter. The Giver was sitting at the table, smiling, beckoning me to take a sip. \n\n“This will help those teeth,” he hummed, “it will take those stains right off.” \n\nI fidgeted, licked my teeth with my tongue, and smelt what was in the glass. Just as I thought, it was bleach. Of course I poured it down the drain, sighed, and sat down with The Giver.\n\nHis face turned thunderous, and he cried out in rage.\n\n“Do you know what it took for me to get that! Do you know just how good for you that was supposed to be! It would have washed away those sins! It would have taken away the pain from inside your head!” His tone softened. “Just one sip, please. I promise it wont hurt. You know me, I just want to give you what you want. If you take a sip, I promise I wont mention it any more. Please, for me? Remember, we're going to be best friends till the end.” \n\nI sighed, and shook my head. I dared not say a word, for I knew he could use it against me. After all, that was how he chose his gifts. I made sure to think the right things carefully. I always wondered what would happen if I said that I wished he would disappear, but I knew that it wouldn't work. You had to wish for something to happen to you. \n\n“Giver?” I asked, after much deliberation. “What if I wish for something to happen to someone else?” \n\nI didn't want anything to happen to other people, but soon enough, I was going to buckle. I would give in. I would use the gifts he brought me, and god I know, I know just how horrible that would end. \n\n“Well...” He drawled, a smirk creeping up his dark face, shrouded in shadows that came seemingly from any angle, whenever he wanted. “I would stop gifting you of course. If that was what you wanted. But! You get to chose the gifts.” \n\n“And you will stop giving me gifts?”\n\n“If that is really what you want.”\n\nFrom that day forwards I became the giver. I was better at it. I knew humanity, inside and out, whereas The Giver was much less acquainted, as he hadn't been human for oh so long. But I was still human. I knew the darkest thoughts, the way they cross your mind. I'm better at tempting. So whenever you're feeling down, and suddenly, there's something sharp near you, don't dismiss it as a coincidence. Because you never know when The Giver is going to visit you. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qr0o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 653, "report_reasons": null, "author": "SmallTownCreeps", "saved": false, "mod_reports": [], "name": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64qr0o/the_giver/", "num_reports": null, "locked": false, "stickied": false, "created": 1491945487.0, "url": "https://www.reddit.com/r/nosleep/comments/64qr0o/the_giver/", "author_flair_text": null, "quarantine": false, "title": "The Giver", "created_utc": 1491916687.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 27, "visited": false, "subreddit_type": "public", "ups": 653}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg5h2cv", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "joaquin55", "parent_id": "t1_dg4hjve", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yeah,its like if 2meirl4meirl became an evil creature that gives you ways to suicide", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah,its like if 2meirl4meirl became an evil creature that gives you ways to suicide&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5h2cv", "score_hidden": false, "stickied": false, "created": 1492000390.0, "created_utc": 1491971590.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg6e4se", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "bronwynnekulvi", "parent_id": "t1_dg5y6y7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The hell is wrong with you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The hell is wrong with you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6e4se", "score_hidden": false, "stickied": false, "created": 1492053598.0, "created_utc": 1492024798.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg6w5ei", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Brody022", "parent_id": "t1_dg5y6y7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "10/10 meme", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;10/10 meme&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6w5ei", "score_hidden": false, "stickied": false, "created": 1492074466.0, "created_utc": 1492045666.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y6y7", "gilded": 0, "archived": false, "score": -26, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4hjve", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5y6y7", "score_hidden": false, "stickied": false, "created": 1492036852.0, "created_utc": 1492008052.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -26}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hjve", "gilded": 0, "archived": false, "score": 170, "report_reasons": null, "author": "Benivav", "parent_id": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Well... That did not help my depression. Like at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well... That did not help my depression. Like at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4hjve", "score_hidden": false, "stickied": false, "created": 1491956340.0, "created_utc": 1491927540.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 170}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg5qx2q", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lukeskywalkerscousin", "parent_id": "t1_dg5lz2b", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I fucked up, but it's got 6 upvotes so I'll keep it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fucked up, but it&amp;#39;s got 6 upvotes so I&amp;#39;ll keep it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5qx2q", "score_hidden": false, "stickied": false, "created": 1492025811.0, "created_utc": 1491997011.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5lz2b", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "typhoidgrievous", "parent_id": "t1_dg5geg8", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You know that colours are things you **can see** right, unlike smelling music", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know that colours are things you &lt;strong&gt;can see&lt;/strong&gt; right, unlike smelling music&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5lz2b", "score_hidden": false, "stickied": false, "created": 1492011364.0, "created_utc": 1491982564.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5geg8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lukeskywalkerscousin", "parent_id": "t1_dg5e9ku", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh, I didn't realize it was a reference", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I didn&amp;#39;t realize it was a reference&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5geg8", "score_hidden": false, "stickied": false, "created": 1491999231.0, "created_utc": 1491970431.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e9ku", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "paulthefonz", "parent_id": "t1_dg58sd5", "subreddit_name_prefixed": "r/nosleep", "controversiality": 1, "body": "Woooooooshhhhh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woooooooshhhhh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5e9ku", "score_hidden": false, "stickied": false, "created": 1491995860.0, "created_utc": 1491967060.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58sd5", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "lukeskywalkerscousin", "parent_id": "t1_dg4sjxw", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The same time he starts smelling music", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same time he starts smelling music&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg58sd5", "score_hidden": false, "stickied": false, "created": 1491988417.0, "created_utc": 1491959617.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4sjxw", "gilded": 0, "archived": false, "score": 83, "report_reasons": null, "author": "paulthefonz", "parent_id": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "When does he start to see colour? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When does he start to see colour? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4sjxw", "score_hidden": false, "stickied": false, "created": 1491968284.0, "created_utc": 1491939484.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 83}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg5cqbn", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "BurntBean", "parent_id": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "well i was expecting some lois lowry.\n\non a more serious note, made me think how we've all taken the words \"i want to die\" for granted", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well i was expecting some lois lowry.&lt;/p&gt;\n\n&lt;p&gt;on a more serious note, made me think how we&amp;#39;ve all taken the words &amp;quot;i want to die&amp;quot; for granted&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5cqbn", "score_hidden": false, "stickied": false, "created": 1491993675.0, "created_utc": 1491964875.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg4huy3", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "Creeping_dread", "parent_id": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You have a way with words. I'm sorry for what's happened to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have a way with words. I&amp;#39;m sorry for what&amp;#39;s happened to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4huy3", "score_hidden": false, "stickied": false, "created": 1491956672.0, "created_utc": 1491927872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg6g4f2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I wouldn't want to say \"fuck me\" in front of the giver", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t want to say &amp;quot;fuck me&amp;quot; in front of the giver&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6g4f2", "score_hidden": false, "stickied": false, "created": 1492055634.0, "created_utc": 1492026834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg5qapy", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Nebelherrin", "parent_id": "t1_dg5l7zs", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Probably not. But he could probably give you a gun and a ski mask and the address of a bank or the route of a transport.\nYou know, if you really wanted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably not. But he could probably give you a gun and a ski mask and the address of a bank or the route of a transport.\nYou know, if you really wanted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5qapy", "score_hidden": false, "stickied": false, "created": 1492024357.0, "created_utc": 1491995557.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5l7zs", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "xALmoN", "parent_id": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Could he somehow magically make 2million dollars appear under my pillow? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could he somehow magically make 2million dollars appear under my pillow? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5l7zs", "score_hidden": false, "stickied": false, "created": 1492009301.0, "created_utc": 1491980501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg4k96m", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "Desopilar", "parent_id": "t1_dg4jhu9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The Giver didn't touch the children. He coerced the children's father to do it to them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Giver didn&amp;#39;t touch the children. He coerced the children&amp;#39;s father to do it to them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4k96m", "score_hidden": false, "stickied": false, "created": 1491959289.0, "created_utc": 1491930489.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg4uyav", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "yiannos13", "parent_id": "t1_dg4jhu9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "He tempts people to do it. He didn't do it himself.\n(Oh and by the way, check the rules, they might help you.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He tempts people to do it. He didn&amp;#39;t do it himself.\n(Oh and by the way, check the rules, they might help you.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4uyav", "score_hidden": false, "stickied": false, "created": 1491970916.0, "created_utc": 1491942116.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64qr0o", "likes": null, "replies": "", "user_reports": [], "id": "dg4zaal", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Yummywax", "parent_id": "t1_dg4jhu9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Take 5 seconds to re-read and think before you make a fool out of yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take 5 seconds to re-read and think before you make a fool out of yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4zaal", "score_hidden": false, "stickied": false, "created": 1491975965.0, "created_utc": 1491947165.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jhu9", "gilded": 0, "archived": false, "score": -48, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64qr0o", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4jhu9", "score_hidden": false, "stickied": false, "created": 1491958459.0, "created_utc": 1491929659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -48}}], "after": null, "before": null}}]