[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Screeeeeee.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The sound woke me up from another fitful, restless nightmare. I was dreaming about her again, so it wasn’t a surprise what I woke with a start, covered in sweat with tears stinging my eyes. The clock by my bed blinked midnight, the result of a brown out weeks ago. I never bothered setting it anymore, what was the point? I’d get out of bed when I felt like it. I rarely did.&lt;/p&gt;\n\n&lt;p&gt;The sound continued for another minute while I lie there, looking up at the ceiling, praying for it to end. For her to rest.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Screeeeee.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;What had I done?&lt;/p&gt;\n\n&lt;p&gt;The sounds went on, and I gave up hope that she would stop before sunrise.&lt;/p&gt;\n\n&lt;p&gt;I threw off the heavy covers, the house was cold - I rarely bothered with heat anymore now that it was just me - and headed outside barefoot, still dressed in three-day-worn pajamas. The air that hit me was only slightly cooler than the house, but it was enough to raise goosebumps on my arms. Either that or the look of the triple-locked shed standing next to the house still raised the hairs on the back of my neck. From inside, the screeching of nails on metal almost drowned out the hiss and sizzle of the flesh inside.&lt;/p&gt;\n\n&lt;p&gt;It wasn’t supposed to be like this. &lt;/p&gt;\n\n&lt;p&gt;I have loved. I have burned with love. Burned with the fire of a thousand suns. I have looked into the eyes of a woman and seen my future laid out before me. Our home, our children, the life we’d have and the years of joy ahead of us. &lt;/p&gt;\n\n&lt;p&gt;I met her in the way most people meet these days, on the internet. It was a small thing. A chat room where we shared our love of movies and, after long nights filling each other’s screens with secrets and promises, shared the love we developed for each other. &lt;/p&gt;\n\n&lt;p&gt;Three months after I met Rebecca, I moved two thousand miles away from my friends and job to be with her. Three months after that, we found a place together at the foot of a beautiful snowcapped peak. It was a small place, but it was ours. A haven where we could love and grow and laugh. Together our love could have burned the world. Now it just might.&lt;/p&gt;\n\n&lt;p&gt;And Rebecca? She was beautiful too. Hair dyed whatever color caught her eye that month, her body covered in tattoos and old scars. She was my punk rock princess, a dream given form. The first time we met she picked me up at the extended stay motel I’d picked out as a launching base for my new life and we drove around in her little metro for hours. I couldn’t speak, I knew the words but my mouth wouldn’t obey. We drove and later that night, our first night together, we made love. I never looked back.&lt;/p&gt;\n\n&lt;p&gt;We had it all. Right up until they said the words that would change everything forever.&lt;/p&gt;\n\n&lt;p&gt;“I’m sorry,” the man in the white lab coat said as I held the hand of the bravest girl I’d ever known, “But I’m afraid the tumor is malignant.”&lt;/p&gt;\n\n&lt;p&gt;Our world shattered. I held her that night as she cried in my arms and every night after that as she endured round after round of chemotherapy and radiation treatment. She lost weight, her beautiful hair which I loved and she was always unsatisfied with fell out in ugly, uneven chunks. Through it all, she was still my beautiful princess, the love of my life. The girl I’d do anything for.&lt;/p&gt;\n\n&lt;p&gt;After a year of unsuccessful treatments, including a stint in a promising but ultimately fruitless drug trial, the fight became too much for her.&lt;/p&gt;\n\n&lt;p&gt;“Michael, enough.” She said.&lt;/p&gt;\n\n&lt;p&gt;Tears streamed down my face as I looked at her. “Don’t say that,” I repeated.&lt;/p&gt;\n\n&lt;p&gt;“Look at me.” There was steel in her voice, that bravery that I’d always admired turned against me in a flash. “I’m dying. The doctors say another six months if I’m lucky. There’s nothing else they can do, and I don’t want to die in some hospital waiting for a cure that will never come.”&lt;/p&gt;\n\n&lt;p&gt;“We can try something else,” I pressed. “There are alternative treatments. There’s a drug out of China that…”&lt;/p&gt;\n\n&lt;p&gt;“No. I love you, I love this house. Our house. If I’m going to die I want to die here, living the life we built together.”&lt;/p&gt;\n\n&lt;p&gt;I didn’t say anything. Didn’t know what to say. I wanted the years we’d planned, the trips and the family we were going to build. I nodded. But in my heart, I couldn’t accept the end.&lt;/p&gt;\n\n&lt;p&gt;Over the next few months, she withered away. Rebecca became a shell of the vibrant young woman I had fallen in love with. When she became too weak to get out of bed we turned the guest room into a makeshift emergency care room. A nurse came in three times a week to see that she was as comfortable as possible. Eventually, Rebecca was too weak to eat or speak for more than a few minutes at a time. I treasured those minutes, holding the bone-thin hand of the woman I loved more than life itself.&lt;/p&gt;\n\n&lt;p&gt;In the endless hours between, I searched for anything to keep her alive.&lt;/p&gt;\n\n&lt;p&gt;I followed dead end after dead end, ordered herbal teas and the powdered bones of endangered species off of less-than-reliable websites. I knew it might kill her, but I was desperate and, in my mind, she was dying anyway. I slipped the treatments into her food, gave them to her when she was too weak to move. Nothing worked, she just kept getting worse. &lt;/p&gt;\n\n&lt;p&gt;That was when I got the package.&lt;/p&gt;\n\n&lt;p&gt;Honestly, I don’t remember ordering it. There was a constant stream of packages coming to the house at that point, boxes filled with powders and oils. The box was wrapped in plain brown paper with a cheaply printed shipping label slapped on top. There was no return address.&lt;/p&gt;\n\n&lt;p&gt;I took the package inside and sat it next to a discarded envelope that had, supposedly, held the finger bone of a saint renown for its healing properties. As hopeless as I was at that point, every new treatment brought a thrill. A spark of hope that I couldn’t let go off. &lt;/p&gt;\n\n&lt;p&gt;Inside the box was a small plastic vial filled with a viscous red liquid. A small handwritten note simply read: &lt;strong&gt;Inject into arm&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Staring at the red liquid, blood I was sure, I considered briefly giving up. Who knew what or where it had come from, what diseases it might carry? At that point, Rebecca was all but gone. I’d watched her become a shell, an empty husk without the energy to lift her head from the pillow. It didn’t matter what harm the blood caused now, if I didn’t find a cure in the next two weeks there’d be nothing left to save. &lt;/p&gt;\n\n&lt;p&gt;Syringes are easy to come by when you have a loved one dying of cancer, and I filled one of the thick plastic tubes with the contents of the vial. It slipped into the syringe in an oozing, crawling fashion that made me shiver. &lt;/p&gt;\n\n&lt;p&gt;I could have stepped back, even then. I could have let Rebecca have what she wanted most, to die in peace with me by her side, holding her hand as she slipped into darkness one last time. Instead, I held her hand as I slipped the needle into her veins, praying to anyone who would listen that this time I’d found the answer, that I wouldn’t lose her yet.&lt;/p&gt;\n\n&lt;p&gt;Rebecca shuttered and sighed as the blood flowed into her, the atrophied muscles in her arm contracting as I pulled the empty syringe away. &lt;/p&gt;\n\n&lt;p&gt;After that, I could only wait. I slept fitfully that night, questioning what I’d done and wondering how I’d go on without her. It was the heavy thud of something falling to the floor inside the kitchen that finally pulled me out of bed and away from the nightmares that seemed to haunt my ever night.&lt;/p&gt;\n\n&lt;p&gt;I walked into the kitchen slowly. When I saw Rebecca’s flannel nightgown, the gown I’d put on her the day before after getting her out of the bath, the haze in my tired brain burned away in an instant. She was thin and frail, barely five feet tall and dropped to ninety pounds, but she was standing on her own two feet with a jar of peanuts in her hand hungrily shoving them into her mouth. On the floor was a bag of flour that had exploded on impact, knocked loose from its precarious perch as she’d rifled for food. &lt;/p&gt;\n\n&lt;p&gt;“Becca?” I whispered. &lt;/p&gt;\n\n&lt;p&gt;She turned to look at me, startled. “Sorry, I’ll clean it up.” She said sheepishly, the smile on her face drawing her gaunt cheeks tight. Smiling for the first time in months, her once soft features took on the look of a grinning skull. I didn’t care. I ran to her and wrapped my arms around her waist, pulling her against me. She hugged back, her arms strong. “It’s okay,” Rebecca said, “I feel good Michael. I feel better than I have in a long time.”&lt;/p&gt;\n\n&lt;p&gt;“Sit down,” I told her, “I’ll make us something to eat.”&lt;/p&gt;\n\n&lt;p&gt;Rebecca was ravenous, and she ate everything I put in front of her with a kind of hungry fervor that, at the time, I assumed was from long weeks of eating through a tube. When she was done her too-thin stomach was bloated and her breath came out in wheezing gasps.&lt;/p&gt;\n\n&lt;p&gt;“Get to bed,” I said, “You still need to rest.”&lt;/p&gt;\n\n&lt;p&gt;She looked up at me with hungry eyes but nodded, exhaustion overtaking her at the mere mention of bed. I helped her back, her body barely weighing anything as she leaned on my shoulder.&lt;/p&gt;\n\n&lt;p&gt;Over the next few days color returned to her cheeks and the hair, which had never grown back despite chemo being months behind her, had started to grow back a bristly blonde. A natural color I’d never seen on her before. She was still hungry, eating everything she could get a hold of, but however much she ate she never seemed full.&lt;/p&gt;\n\n&lt;p&gt;There were other changes. Her nails seemed to have grown thick and long, I assumed during her illness though I’d never noticed them before, and her always-bright green eyes almost glowed at the barest hint of light reflecting off of them. She was, in many ways, a new woman. &lt;/p&gt;\n\n&lt;p&gt;And our sex life was more exciting than it had been even at the start. It’s hard not to look back and see the signs there. Instead of weak and tired she was as ravenous in bed as in the kitchen, her body was strong and her legs clamped around me like a vice as she rode me for what felt like hours without so much as a break. I was in heaven. &lt;/p&gt;\n\n&lt;p&gt;Then, one morning, I found the bag. A little red and black backpack covered in blood waiting on our doorstep. I hid it before she woke up that morning and, for a time, she seemed almost back to normal. Not the sickly girl I’d taken care of or the ravenous miracle patient who ate everything she saw. Just Rebecca. Just my princess fully restored. If not for the too-short blonde hair on her head you might have never known she was sick.&lt;/p&gt;\n\n&lt;p&gt;The news reported day and night on the missing boy. Little Timothy Cutler. They said he vanished from his room, his red and black backup had disappeared with him. Search parties failed but the hunt went on. I tried to keep Rebecca away from the news, every time she saw it her heart would break. I wanted to confront her about it, to ask about the backpack, but I was afraid of her answer. I kept it to myself, enjoying my time with her while I had it.&lt;/p&gt;\n\n&lt;p&gt;It would take almost two weeks before she started to change again. This time the changes were more noticeable. When we had sex she bit me; that in itself wasn’t unusual, but the blood that dripped from her lips when she finished was more than new. I bit down on my own lip and swallowed the pain, trying to ignore the way her pointed teeth gleamed in the light.&lt;/p&gt;\n\n&lt;p&gt;She was hungry again.&lt;/p&gt;\n\n&lt;p&gt;It didn’t take a genius to make the connection. And I knew who held the blame for her change, her hunger, and the disappearance of Timmy Cutler. I didn’t know what to do, but I couldn’t risk her killing another child. &lt;/p&gt;\n\n&lt;p&gt;Slowly, Rebecca started to lose herself. I could see her rational mind slipping away, smell the animal on her skin. I could see the way she looked at me, like I might make a better snack than a lover. I was losing her, losing the beautiful girl I knew. But I had an idea about what would bring her back.&lt;/p&gt;\n\n&lt;p&gt;That was when I built the shed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "*Screeeeeee.*\n\nThe sound woke me up from another fitful, restless nightmare. I was dreaming about her again, so it wasn’t a surprise what I woke with a start, covered in sweat with tears stinging my eyes. The clock by my bed blinked midnight, the result of a brown out weeks ago. I never bothered setting it anymore, what was the point? I’d get out of bed when I felt like it. I rarely did.\n\nThe sound continued for another minute while I lie there, looking up at the ceiling, praying for it to end. For her to rest.\n\n*Screeeeee.*\n\nWhat had I done?\n\nThe sounds went on, and I gave up hope that she would stop before sunrise.\n\nI threw off the heavy covers, the house was cold - I rarely bothered with heat anymore now that it was just me - and headed outside barefoot, still dressed in three-day-worn pajamas. The air that hit me was only slightly cooler than the house, but it was enough to raise goosebumps on my arms. Either that or the look of the triple-locked shed standing next to the house still raised the hairs on the back of my neck. From inside, the screeching of nails on metal almost drowned out the hiss and sizzle of the flesh inside.\n\nIt wasn’t supposed to be like this. \n\nI have loved. I have burned with love. Burned with the fire of a thousand suns. I have looked into the eyes of a woman and seen my future laid out before me. Our home, our children, the life we’d have and the years of joy ahead of us. \n\nI met her in the way most people meet these days, on the internet. It was a small thing. A chat room where we shared our love of movies and, after long nights filling each other’s screens with secrets and promises, shared the love we developed for each other. \n\nThree months after I met Rebecca, I moved two thousand miles away from my friends and job to be with her. Three months after that, we found a place together at the foot of a beautiful snowcapped peak. It was a small place, but it was ours. A haven where we could love and grow and laugh. Together our love could have burned the world. Now it just might.\n\nAnd Rebecca? She was beautiful too. Hair dyed whatever color caught her eye that month, her body covered in tattoos and old scars. She was my punk rock princess, a dream given form. The first time we met she picked me up at the extended stay motel I’d picked out as a launching base for my new life and we drove around in her little metro for hours. I couldn’t speak, I knew the words but my mouth wouldn’t obey. We drove and later that night, our first night together, we made love. I never looked back.\n\nWe had it all. Right up until they said the words that would change everything forever.\n\n“I’m sorry,” the man in the white lab coat said as I held the hand of the bravest girl I’d ever known, “But I’m afraid the tumor is malignant.”\n\nOur world shattered. I held her that night as she cried in my arms and every night after that as she endured round after round of chemotherapy and radiation treatment. She lost weight, her beautiful hair which I loved and she was always unsatisfied with fell out in ugly, uneven chunks. Through it all, she was still my beautiful princess, the love of my life. The girl I’d do anything for.\n\nAfter a year of unsuccessful treatments, including a stint in a promising but ultimately fruitless drug trial, the fight became too much for her.\n\n“Michael, enough.” She said.\n\nTears streamed down my face as I looked at her. “Don’t say that,” I repeated.\n\n“Look at me.” There was steel in her voice, that bravery that I’d always admired turned against me in a flash. “I’m dying. The doctors say another six months if I’m lucky. There’s nothing else they can do, and I don’t want to die in some hospital waiting for a cure that will never come.”\n\n“We can try something else,” I pressed. “There are alternative treatments. There’s a drug out of China that…”\n\n“No. I love you, I love this house. Our house. If I’m going to die I want to die here, living the life we built together.”\n\nI didn’t say anything. Didn’t know what to say. I wanted the years we’d planned, the trips and the family we were going to build. I nodded. But in my heart, I couldn’t accept the end.\n\nOver the next few months, she withered away. Rebecca became a shell of the vibrant young woman I had fallen in love with. When she became too weak to get out of bed we turned the guest room into a makeshift emergency care room. A nurse came in three times a week to see that she was as comfortable as possible. Eventually, Rebecca was too weak to eat or speak for more than a few minutes at a time. I treasured those minutes, holding the bone-thin hand of the woman I loved more than life itself.\n\nIn the endless hours between, I searched for anything to keep her alive.\n\nI followed dead end after dead end, ordered herbal teas and the powdered bones of endangered species off of less-than-reliable websites. I knew it might kill her, but I was desperate and, in my mind, she was dying anyway. I slipped the treatments into her food, gave them to her when she was too weak to move. Nothing worked, she just kept getting worse. \n\nThat was when I got the package.\n\n Honestly, I don’t remember ordering it. There was a constant stream of packages coming to the house at that point, boxes filled with powders and oils. The box was wrapped in plain brown paper with a cheaply printed shipping label slapped on top. There was no return address.\n\nI took the package inside and sat it next to a discarded envelope that had, supposedly, held the finger bone of a saint renown for its healing properties. As hopeless as I was at that point, every new treatment brought a thrill. A spark of hope that I couldn’t let go off. \n\nInside the box was a small plastic vial filled with a viscous red liquid. A small handwritten note simply read: **Inject into arm**.\n\nStaring at the red liquid, blood I was sure, I considered briefly giving up. Who knew what or where it had come from, what diseases it might carry? At that point, Rebecca was all but gone. I’d watched her become a shell, an empty husk without the energy to lift her head from the pillow. It didn’t matter what harm the blood caused now, if I didn’t find a cure in the next two weeks there’d be nothing left to save. \n\nSyringes are easy to come by when you have a loved one dying of cancer, and I filled one of the thick plastic tubes with the contents of the vial. It slipped into the syringe in an oozing, crawling fashion that made me shiver. \n\nI could have stepped back, even then. I could have let Rebecca have what she wanted most, to die in peace with me by her side, holding her hand as she slipped into darkness one last time. Instead, I held her hand as I slipped the needle into her veins, praying to anyone who would listen that this time I’d found the answer, that I wouldn’t lose her yet.\n\nRebecca shuttered and sighed as the blood flowed into her, the atrophied muscles in her arm contracting as I pulled the empty syringe away. \n\nAfter that, I could only wait. I slept fitfully that night, questioning what I’d done and wondering how I’d go on without her. It was the heavy thud of something falling to the floor inside the kitchen that finally pulled me out of bed and away from the nightmares that seemed to haunt my ever night.\n\nI walked into the kitchen slowly. When I saw Rebecca’s flannel nightgown, the gown I’d put on her the day before after getting her out of the bath, the haze in my tired brain burned away in an instant. She was thin and frail, barely five feet tall and dropped to ninety pounds, but she was standing on her own two feet with a jar of peanuts in her hand hungrily shoving them into her mouth. On the floor was a bag of flour that had exploded on impact, knocked loose from its precarious perch as she’d rifled for food. \n\n“Becca?” I whispered. \n\nShe turned to look at me, startled. “Sorry, I’ll clean it up.” She said sheepishly, the smile on her face drawing her gaunt cheeks tight. Smiling for the first time in months, her once soft features took on the look of a grinning skull. I didn’t care. I ran to her and wrapped my arms around her waist, pulling her against me. She hugged back, her arms strong. “It’s okay,” Rebecca said, “I feel good Michael. I feel better than I have in a long time.”\n\n“Sit down,” I told her, “I’ll make us something to eat.”\n\nRebecca was ravenous, and she ate everything I put in front of her with a kind of hungry fervor that, at the time, I assumed was from long weeks of eating through a tube. When she was done her too-thin stomach was bloated and her breath came out in wheezing gasps.\n\n“Get to bed,” I said, “You still need to rest.”\n\nShe looked up at me with hungry eyes but nodded, exhaustion overtaking her at the mere mention of bed. I helped her back, her body barely weighing anything as she leaned on my shoulder.\n\nOver the next few days color returned to her cheeks and the hair, which had never grown back despite chemo being months behind her, had started to grow back a bristly blonde. A natural color I’d never seen on her before. She was still hungry, eating everything she could get a hold of, but however much she ate she never seemed full.\n\nThere were other changes. Her nails seemed to have grown thick and long, I assumed during her illness though I’d never noticed them before, and her always-bright green eyes almost glowed at the barest hint of light reflecting off of them. She was, in many ways, a new woman. \n\nAnd our sex life was more exciting than it had been even at the start. It’s hard not to look back and see the signs there. Instead of weak and tired she was as ravenous in bed as in the kitchen, her body was strong and her legs clamped around me like a vice as she rode me for what felt like hours without so much as a break. I was in heaven. \n\nThen, one morning, I found the bag. A little red and black backpack covered in blood waiting on our doorstep. I hid it before she woke up that morning and, for a time, she seemed almost back to normal. Not the sickly girl I’d taken care of or the ravenous miracle patient who ate everything she saw. Just Rebecca. Just my princess fully restored. If not for the too-short blonde hair on her head you might have never known she was sick.\n\nThe news reported day and night on the missing boy. Little Timothy Cutler. They said he vanished from his room, his red and black backup had disappeared with him. Search parties failed but the hunt went on. I tried to keep Rebecca away from the news, every time she saw it her heart would break. I wanted to confront her about it, to ask about the backpack, but I was afraid of her answer. I kept it to myself, enjoying my time with her while I had it.\n\nIt would take almost two weeks before she started to change again. This time the changes were more noticeable. When we had sex she bit me; that in itself wasn’t unusual, but the blood that dripped from her lips when she finished was more than new. I bit down on my own lip and swallowed the pain, trying to ignore the way her pointed teeth gleamed in the light.\n\nShe was hungry again.\n\nIt didn’t take a genius to make the connection. And I knew who held the blame for her change, her hunger, and the disappearance of Timmy Cutler. I didn’t know what to do, but I couldn’t risk her killing another child. \n\nSlowly, Rebecca started to lose herself. I could see her rational mind slipping away, smell the animal on her skin. I could see the way she looked at me, like I might make a better snack than a lover. I was losing her, losing the beautiful girl I knew. But I had an idea about what would bring her back.\n\nThat was when I built the shed.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "64ralp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 185, "report_reasons": null, "author": "ThingsUndone", "saved": false, "mod_reports": [], "name": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64ralp/hunger_changes_her_part_1/", "num_reports": null, "locked": false, "stickied": false, "created": 1491951134.0, "url": "https://www.reddit.com/r/nosleep/comments/64ralp/hunger_changes_her_part_1/", "author_flair_text": null, "quarantine": false, "title": "Hunger Changes Her [Part 1]", "created_utc": 1491922334.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 185}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg4cxkg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64ralp%2Fhunger_changes_her_part_1%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;subject=Reminder&amp;to=RemindMeBot) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64ralp%2Fhunger_changes_her_part_1%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;subject=Reminder&amp;amp;to=RemindMeBot\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4cxkg", "score_hidden": true, "stickied": true, "created": 1491951206.0, "created_utc": 1491922406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg5h18g", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SkyLeRedditer", "parent_id": "t1_dg4n501", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This is the perfect comment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the perfect comment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5h18g", "score_hidden": false, "stickied": false, "created": 1492000335.0, "created_utc": 1491971535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4n501", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "CabbageDraconis", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Have a Snickers. You're not you when you're hungry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have a Snickers. You&amp;#39;re not you when you&amp;#39;re hungry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4n501", "score_hidden": false, "stickied": false, "created": 1491962443.0, "created_utc": 1491933643.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg4usi8", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "kismetjeska", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I love this. I also really love that you started a series with actual HORROR rather than 'creepy thing might be happening, I'll update if there's any interest'. Excited to read more!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this. I also really love that you started a series with actual HORROR rather than &amp;#39;creepy thing might be happening, I&amp;#39;ll update if there&amp;#39;s any interest&amp;#39;. Excited to read more!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4usi8", "score_hidden": false, "stickied": false, "created": 1491970734.0, "created_utc": 1491941934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg4l65a", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "notacompletemonster", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "hunger changes everyone.  there's nothing to worry about.  everything is just fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hunger changes everyone.  there&amp;#39;s nothing to worry about.  everything is just fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4l65a", "score_hidden": false, "stickied": false, "created": 1491960293.0, "created_utc": 1491931493.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg59hvi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bakedpotato777", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Dont let your lover starve though, bring her a deer or something ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dont let your lover starve though, bring her a deer or something &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg59hvi", "score_hidden": false, "stickied": false, "created": 1491989317.0, "created_utc": 1491960517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg4zeyh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TangledLion", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I can understand why you made that choice, unfortunately the results of it unfortunately the results of it have consequences that you are going to need to live with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can understand why you made that choice, unfortunately the results of it unfortunately the results of it have consequences that you are going to need to live with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4zeyh", "score_hidden": false, "stickied": false, "created": 1491976122.0, "created_utc": 1491947322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg4fsrd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ThatRandomSurvivor", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lock the doors OP", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lock the doors OP&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4fsrd", "score_hidden": false, "stickied": false, "created": 1491954419.0, "created_utc": 1491925619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ralp", "likes": null, "replies": "", "user_reports": [], "id": "dg4ru1t", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Continuum_Gaming", "parent_id": "t3_64ralp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Damn. Who did that blood come from? I would break out the bibble and holy water, if I were you OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn. Who did that blood come from? I would break out the bibble and holy water, if I were you OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4ru1t", "score_hidden": false, "stickied": false, "created": 1491967505.0, "created_utc": 1491938705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]