[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t like I was super mechanically inclined or anything; I had a blueprint and some materials. Turns out, it doesn&amp;#39;t take much to manipulate the time stream. Hell, this thing I built might be magic - I really have no clue. It&amp;#39;s actually a glove, so get rid of any Jules Verne type mental images you might have of a giant time machine with dials, bulbs, and flashing lights. That &amp;quot;futuristic&amp;quot; shit isn&amp;#39;t even close to reality. No, this thing is a glove, with a diamond array, some wires, a liquid I can&amp;#39;t/don&amp;#39;t care to identify, and a mesh system that somehow collects excess heat energy from me and uses it to...do something. End result, though, is time travel.&lt;/p&gt;\n\n&lt;p&gt;I know you&amp;#39;re thinking I&amp;#39;m a homeless crazy person at a library computer typing this nonsense story up, and you&amp;#39;re half right - I am now crazy, or at least I feel like I am, and I have left all my comforts behind, so in a sense, I am homeless, though I do have a home to return to. That is, if it mattered; we&amp;#39;ll all be dead in a few weeks and the best part is that I&amp;#39;m the only one who can stop it, but I think I just made it worse.&lt;/p&gt;\n\n&lt;p&gt;A month ago, a crate arrived on my doorstep. It had no labels, it was a Sunday, so it didn&amp;#39;t come in the mail, and there were no identifying markings, other than some numbers that I recognized. Inside were all the various pieces of the time device I described above, some instructions printed on a single piece of thin metal, and a book.&lt;/p&gt;\n\n&lt;p&gt;Ah Jesus, the book. Sticking to convention, the book was printed on paper, scarred with burns and tears, and it appeared to be very old, though all the dates it referenced were in the future. It started describing Donald Trump&amp;#39;s election in 2016, and the cycle of war and environmental devastation that came from his policies. The writer was someone from the future who created a time travel device, but it was only capable of sending a person 5 years into the past, though it could send non-living items anywhere in the past or future it wanted. The dates on this book were 2030, 2031, and it ended in 2033, with no entries whatsoever in 2032. The handwriting was different from 2031 to 2033 as well. &lt;/p&gt;\n\n&lt;p&gt;It starts in 2020, when Trump is elected for a second term. Rolled-back environmental policy causes massive permafrost melting in Siberia. This allowed significant amounts of trapped greenhouse gases to release into the atmosphere, causing significant global warming. In addition, the melted permafrost caused massive implosions of land, creating huge crates, killing a small amount of people but dotting the landscape with half-mile holes. People living in Siberia soon started coming down with strange diseases, likely locked in ice for centuries, and nearly all animal and plantlife died out in that area. The rest of the world didn&amp;#39;t fare much better as the diseases spread outward, hastened by the quickly heating environment. Wars intensified, famine struck 1st world counties and 3rd world countries died out entirely from lack of food and water. America, China, and Brazil were the last countries standing as the world slid into oblivion, with most people converging on the biggest city-centers. Essentially the world was dicked, save for the richest elites in the biggest countries.&lt;/p&gt;\n\n&lt;p&gt;At this point, I was smiling, reading this as some kind of fun sci-fi novel, and I put the book down to examine all the other stuff. I looked at the blueprints and realized quickly that I could put this &amp;quot;time spanner&amp;quot; (they named it, not me) together with crap I had lying around the house, so I did.&lt;/p&gt;\n\n&lt;p&gt;Then, I tried it out.&lt;/p&gt;\n\n&lt;p&gt;Jesus. Christ. I was not prepared.&lt;/p&gt;\n\n&lt;p&gt;I slid the glove on and &amp;quot;thought&amp;quot; about where/when I wanted to go. These were the literal instructions, and though I scoffed, it worked. I thought about 3 days in the past when I bought a Mega Lottery ticket. With a clap and a whoosh like a door being opened with a heavy wind pressing against it, and a slight smell of ozone, I was standing exactly where I was right before I bought the ticket. It was like I zapped into my body at that place in time. I looked around, frozen in place like a deer in headlights, and then remembered why I was there. I bought a ticket with the winning numbers (that I knew from the future of course) and zapped myself, ticket included, to the next drawing, which was the next day.&lt;/p&gt;\n\n&lt;p&gt;I should have prefaced this with the fact that I am a millionaire now. I didn&amp;#39;t and that&amp;#39;s not fair to you, since it DOESN&amp;#39;T MATTER AT ALL and we&amp;#39;re all going to die anyway. So yeah, the time travel worked, and there didn&amp;#39;t seem to be any ramifications that you normally hear about time travel. I went back in time, did shit, and it affected the future exactly like you think it might. If there was a butterfly effect, I didn&amp;#39;t see it, at least not from the stupid things I was doing.&lt;/p&gt;\n\n&lt;p&gt;So with this development, I felt like taking the book more seriously. It went on, describing camps, prisons, murder, rapes - all on a countrywide scale. It was like the Purge, only all the time. The presidents of the 3 megacountries went to war with each other, using massive robots, nuclear weapons, &amp;quot;biosavages&amp;quot; whatever the hell those are, etc, etc. All of this while ancient bacteria ravaged the populace. It painted a scenario far more grim than any I could imagine, and I swore I&amp;#39;d stop Trump from being elected. I went back in time and did some grassroots campaigning, investigating his scandals, and got the information out there. It took some trial and error, but after going back over two dozen times, I finally found the perfect combination of scandals and campaigning that he will be impeached in 2018, and the resulting fallout will cause Hillary Clinton to be installed as president as massive, MASSIVE voter fraud comes to light. My efforts actually create huge reform in the voting/electoral system. I was pretty damn proud of myself.&lt;/p&gt;\n\n&lt;p&gt;Proud of myself and the timeline I&amp;#39;d painstakingly built, actually, until I went home from the bars the other night and nearly fell facefirst into my front door. I&amp;#39;d tripped over a small box, not unlike the one that I&amp;#39;d found before. In it was simply a book, only this one...Christ. This one was printed on leather, and it only took maybe five pages in when I noticed the leather had tattoos and I realized it was HUMAN leather. It detailed the rise to power of Hillary Clinton. That her first day, she authorized nuclear strikes against every major city that was in some kind of opposition to America. That she rounded up all political dissenters and jailed or executed them, including literally every single person who voted for a republican candidate. That in the ruination of cities around her, she commissioned a massive steel pyramid created, and ascended it as godqueen of the world. Civilization outside of Washington devolved into chaos, cannibalism, murder, human sacrifice, and anti-science cult worship. &lt;/p&gt;\n\n&lt;p&gt;I stopped reading a quarter of the way through and strapped on my time spanner, looping back and forth and back and forth until I managed to get Bernie Sanders elected in 2018 after Trump was impeached. Triumphant, I returned to 2017, safe in the knowledge that the world would now be on the right track.&lt;/p&gt;\n\n&lt;p&gt;That was, until last night, when I once again found a box at my front door. I opened it up apprehensively, only to find a single photograph. It was of a ruined Washington D.C. skyline, engulfed in flames with the ocean in the background, with an unimaginably massive creature rising from the water. It took up most of the horizon, and I noticed tiny, winged creatures that were clearly not birds in the foreground, holding onto people in various states of being devoured. &lt;/p&gt;\n\n&lt;p&gt;At the bottom of the picture was scrawled &amp;quot;stop fucking helping&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It wasn't like I was super mechanically inclined or anything; I had a blueprint and some materials. Turns out, it doesn't take much to manipulate the time stream. Hell, this thing I built might be magic - I really have no clue. It's actually a glove, so get rid of any Jules Verne type mental images you might have of a giant time machine with dials, bulbs, and flashing lights. That \"futuristic\" shit isn't even close to reality. No, this thing is a glove, with a diamond array, some wires, a liquid I can't/don't care to identify, and a mesh system that somehow collects excess heat energy from me and uses it to...do something. End result, though, is time travel.\n\nI know you're thinking I'm a homeless crazy person at a library computer typing this nonsense story up, and you're half right - I am now crazy, or at least I feel like I am, and I have left all my comforts behind, so in a sense, I am homeless, though I do have a home to return to. That is, if it mattered; we'll all be dead in a few weeks and the best part is that I'm the only one who can stop it, but I think I just made it worse.\n\nA month ago, a crate arrived on my doorstep. It had no labels, it was a Sunday, so it didn't come in the mail, and there were no identifying markings, other than some numbers that I recognized. Inside were all the various pieces of the time device I described above, some instructions printed on a single piece of thin metal, and a book.\n\nAh Jesus, the book. Sticking to convention, the book was printed on paper, scarred with burns and tears, and it appeared to be very old, though all the dates it referenced were in the future. It started describing Donald Trump's election in 2016, and the cycle of war and environmental devastation that came from his policies. The writer was someone from the future who created a time travel device, but it was only capable of sending a person 5 years into the past, though it could send non-living items anywhere in the past or future it wanted. The dates on this book were 2030, 2031, and it ended in 2033, with no entries whatsoever in 2032. The handwriting was different from 2031 to 2033 as well. \n\nIt starts in 2020, when Trump is elected for a second term. Rolled-back environmental policy causes massive permafrost melting in Siberia. This allowed significant amounts of trapped greenhouse gases to release into the atmosphere, causing significant global warming. In addition, the melted permafrost caused massive implosions of land, creating huge crates, killing a small amount of people but dotting the landscape with half-mile holes. People living in Siberia soon started coming down with strange diseases, likely locked in ice for centuries, and nearly all animal and plantlife died out in that area. The rest of the world didn't fare much better as the diseases spread outward, hastened by the quickly heating environment. Wars intensified, famine struck 1st world counties and 3rd world countries died out entirely from lack of food and water. America, China, and Brazil were the last countries standing as the world slid into oblivion, with most people converging on the biggest city-centers. Essentially the world was dicked, save for the richest elites in the biggest countries.\n\nAt this point, I was smiling, reading this as some kind of fun sci-fi novel, and I put the book down to examine all the other stuff. I looked at the blueprints and realized quickly that I could put this \"time spanner\" (they named it, not me) together with crap I had lying around the house, so I did.\n\nThen, I tried it out.\n\nJesus. Christ. I was not prepared.\n\nI slid the glove on and \"thought\" about where/when I wanted to go. These were the literal instructions, and though I scoffed, it worked. I thought about 3 days in the past when I bought a Mega Lottery ticket. With a clap and a whoosh like a door being opened with a heavy wind pressing against it, and a slight smell of ozone, I was standing exactly where I was right before I bought the ticket. It was like I zapped into my body at that place in time. I looked around, frozen in place like a deer in headlights, and then remembered why I was there. I bought a ticket with the winning numbers (that I knew from the future of course) and zapped myself, ticket included, to the next drawing, which was the next day.\n\nI should have prefaced this with the fact that I am a millionaire now. I didn't and that's not fair to you, since it DOESN'T MATTER AT ALL and we're all going to die anyway. So yeah, the time travel worked, and there didn't seem to be any ramifications that you normally hear about time travel. I went back in time, did shit, and it affected the future exactly like you think it might. If there was a butterfly effect, I didn't see it, at least not from the stupid things I was doing.\n\nSo with this development, I felt like taking the book more seriously. It went on, describing camps, prisons, murder, rapes - all on a countrywide scale. It was like the Purge, only all the time. The presidents of the 3 megacountries went to war with each other, using massive robots, nuclear weapons, \"biosavages\" whatever the hell those are, etc, etc. All of this while ancient bacteria ravaged the populace. It painted a scenario far more grim than any I could imagine, and I swore I'd stop Trump from being elected. I went back in time and did some grassroots campaigning, investigating his scandals, and got the information out there. It took some trial and error, but after going back over two dozen times, I finally found the perfect combination of scandals and campaigning that he will be impeached in 2018, and the resulting fallout will cause Hillary Clinton to be installed as president as massive, MASSIVE voter fraud comes to light. My efforts actually create huge reform in the voting/electoral system. I was pretty damn proud of myself.\n\nProud of myself and the timeline I'd painstakingly built, actually, until I went home from the bars the other night and nearly fell facefirst into my front door. I'd tripped over a small box, not unlike the one that I'd found before. In it was simply a book, only this one...Christ. This one was printed on leather, and it only took maybe five pages in when I noticed the leather had tattoos and I realized it was HUMAN leather. It detailed the rise to power of Hillary Clinton. That her first day, she authorized nuclear strikes against every major city that was in some kind of opposition to America. That she rounded up all political dissenters and jailed or executed them, including literally every single person who voted for a republican candidate. That in the ruination of cities around her, she commissioned a massive steel pyramid created, and ascended it as godqueen of the world. Civilization outside of Washington devolved into chaos, cannibalism, murder, human sacrifice, and anti-science cult worship. \n\nI stopped reading a quarter of the way through and strapped on my time spanner, looping back and forth and back and forth until I managed to get Bernie Sanders elected in 2018 after Trump was impeached. Triumphant, I returned to 2017, safe in the knowledge that the world would now be on the right track.\n\nThat was, until last night, when I once again found a box at my front door. I opened it up apprehensively, only to find a single photograph. It was of a ruined Washington D.C. skyline, engulfed in flames with the ocean in the background, with an unimaginably massive creature rising from the water. It took up most of the horizon, and I noticed tiny, winged creatures that were clearly not birds in the foreground, holding onto people in various states of being devoured. \n\nAt the bottom of the picture was scrawled \"stop fucking helping\".", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rjy0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 150, "report_reasons": null, "author": "Monechetti", "saved": false, "mod_reports": [], "name": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64rjy0/i_built_a_time_machine/", "num_reports": null, "locked": false, "stickied": false, "created": 1491953625.0, "url": "https://www.reddit.com/r/nosleep/comments/64rjy0/i_built_a_time_machine/", "author_flair_text": null, "quarantine": false, "title": "I built a time machine!", "created_utc": 1491924825.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 31, "visited": false, "subreddit_type": "public", "ups": 150}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg4jkc8", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ThatRandomSurvivor", "parent_id": "t1_dg4hcsj", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ho-hum, I suppose that IS an epic way to die. Consumed by a giant extraterrestrial being.\n\n\n\nBasically, Trump.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ho-hum, I suppose that IS an epic way to die. Consumed by a giant extraterrestrial being.&lt;/p&gt;\n\n&lt;p&gt;Basically, Trump.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4jkc8", "score_hidden": false, "stickied": false, "created": 1491958533.0, "created_utc": 1491929733.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg4n7d3", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Monechetti", "parent_id": "t1_dg4m6xt", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Doesn't take much apparently.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t take much apparently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4n7d3", "score_hidden": false, "stickied": false, "created": 1491962515.0, "created_utc": 1491933715.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4m6xt", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "lightsoaring", "parent_id": "t1_dg4hcsj", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "So Bernie ascended to god simply from having the small power of being president. Huh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So Bernie ascended to god simply from having the small power of being president. Huh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4m6xt", "score_hidden": false, "stickied": false, "created": 1491961403.0, "created_utc": 1491932603.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg8ck6o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tryst-Chaser", "parent_id": "t1_dg4hcsj", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Go through every permutation and report the results.  Kanye 2020 especially!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go through every permutation and report the results.  Kanye 2020 especially!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8ck6o", "score_hidden": false, "stickied": false, "created": 1492151909.0, "created_utc": 1492123109.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hcsj", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Monechetti", "parent_id": "t1_dg4gm5n", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Depends on your perspective, I guess. If I'm going to die, I'd rather be elder god food :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depends on your perspective, I guess. If I&amp;#39;m going to die, I&amp;#39;d rather be elder god food :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4hcsj", "score_hidden": false, "stickied": false, "created": 1491956128.0, "created_utc": 1491927328.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg6luh8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThatRandomSurvivor", "parent_id": "t1_dg5wa20", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Well, his views make about as much sense as R'lyeh to a mortal being.\n\n#HINT : THEY DON'T", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, his views make about as much sense as R&amp;#39;lyeh to a mortal being.&lt;/p&gt;\n\n&lt;h1&gt;HINT : THEY DON&amp;#39;T&lt;/h1&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6luh8", "score_hidden": false, "stickied": false, "created": 1492061830.0, "created_utc": 1492033030.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wa20", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MonkeyDJinbeTheClown", "parent_id": "t1_dg4gm5n", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Are you implying Cthulhu Sanders is not destined to be your true Eldritch Mega-God?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you implying Cthulhu Sanders is not destined to be your true Eldritch Mega-God?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5wa20", "score_hidden": false, "stickied": false, "created": 1492034542.0, "created_utc": 1492005742.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gm5n", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "ThatRandomSurvivor", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lol this just goes to show that the world ends with any president you choose. Somehow, though, Trump's timeline was better than the rest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol this just goes to show that the world ends with any president you choose. Somehow, though, Trump&amp;#39;s timeline was better than the rest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4gm5n", "score_hidden": false, "stickied": false, "created": 1491955315.0, "created_utc": 1491926515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg53d4a", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "RZRHED", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Now THAT is how you tell a great story, ladies and gentlemen! Fire, death, TRUMP! What more could you ask for in a horror story?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now THAT is how you tell a great story, ladies and gentlemen! Fire, death, TRUMP! What more could you ask for in a horror story?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg53d4a", "score_hidden": false, "stickied": false, "created": 1491981201.0, "created_utc": 1491952401.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg4zw0m", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Monechetti", "parent_id": "t1_dg4jgvd", "subreddit_name_prefixed": "r/nosleep", "controversiality": 1, "body": "I'm pretty sure I should stop at this point and just...ride it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure I should stop at this point and just...ride it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4zw0m", "score_hidden": false, "stickied": false, "created": 1491976708.0, "created_utc": 1491947908.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jgvd", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Ymzuki", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Aren't there infinite timelines? Even so , why not sent the blueprint and all the stuff for the time machine to even younger self, perhaps you need to change something in 2000s or even earlier, since a person can't travel more than 5 years in the past but items /non living things can.", "edited": 1491929905.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aren&amp;#39;t there infinite timelines? Even so , why not sent the blueprint and all the stuff for the time machine to even younger self, perhaps you need to change something in 2000s or even earlier, since a person can&amp;#39;t travel more than 5 years in the past but items /non living things can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4jgvd", "score_hidden": false, "stickied": false, "created": 1491958430.0, "created_utc": 1491929630.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg5o414", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pjguy2000", "parent_id": "t1_dg5mc8s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I AM T̲O̲T̲A̲L̲L̲Y̲ ̲L̲E̲G̲I̲T, S̶T̶U̶P̶I̶D̶ ̶H̶U̶M̶A̶N̶ BROTHER", "edited": 1491989330.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I AM T̲O̲T̲A̲L̲L̲Y̲ ̲L̲E̲G̲I̲T, S̶T̶U̶P̶I̶D̶ ̶H̶U̶M̶A̶N̶ BROTHER&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5o414", "score_hidden": false, "stickied": false, "created": 1492017945.0, "created_utc": 1491989145.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mc8s", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SlimCognitwo", "parent_id": "t1_dg5f5rx", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This human being sounds totally legit, bro.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This human being sounds totally legit, bro.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5mc8s", "score_hidden": false, "stickied": false, "created": 1492012418.0, "created_utc": 1491983618.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg7npxg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Monechetti", "parent_id": "t1_dg5f5rx", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Hi fellow human! I believe that sounds like a right nice plan you have there! Lemme upload the blueprints. Do you have a totally human living place I can send the device I'd built?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi fellow human! I believe that sounds like a right nice plan you have there! Lemme upload the blueprints. Do you have a totally human living place I can send the device I&amp;#39;d built?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7npxg", "score_hidden": false, "stickied": false, "created": 1492124259.0, "created_utc": 1492095459.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f5rx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pjguy2000", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "FELLOW HUMAN, WOULD YOU BE WILLING TO SHARE INFORMATION ABOUT THIS DEVICE OVER AT r/totallynotrobots ?\n\nUS HUMANS COULD SAFELY DISPOSE OF THE DEVICE FOR THE GOOD OF OUR SPECIES", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FELLOW HUMAN, WOULD YOU BE WILLING TO SHARE INFORMATION ABOUT THIS DEVICE OVER AT &lt;a href=\"/r/totallynotrobots\"&gt;r/totallynotrobots&lt;/a&gt; ?&lt;/p&gt;\n\n&lt;p&gt;US HUMANS COULD SAFELY DISPOSE OF THE DEVICE FOR THE GOOD OF OUR SPECIES&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5f5rx", "score_hidden": false, "stickied": false, "created": 1491997219.0, "created_utc": 1491968419.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg5oxw0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "YellowZippyPouch", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lmaoooo this should be in jokes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lmaoooo this should be in jokes&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5oxw0", "score_hidden": false, "stickied": false, "created": 1492020529.0, "created_utc": 1491991729.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg65seq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DaedricGod101", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Political Circlejerk: The Story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Political Circlejerk: The Story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg65seq", "score_hidden": false, "stickied": false, "created": 1492045088.0, "created_utc": 1492016288.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg5ujiu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rqns982", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "r/jokes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/jokes\"&gt;r/jokes&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5ujiu", "score_hidden": false, "stickied": false, "created": 1492032195.0, "created_utc": 1492003395.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg65cz9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RashFever", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That was hilarious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was hilarious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg65cz9", "score_hidden": false, "stickied": false, "created": 1492044641.0, "created_utc": 1492015841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg5fc33", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "The_Lonely_Rogue_117", "parent_id": "t1_dg4vl8l", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That is the stupidest reason for not becoming President I've EVER heard. It's also a pretty good one.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is the stupidest reason for not becoming President I&amp;#39;ve EVER heard. It&amp;#39;s also a pretty good one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5fc33", "score_hidden": false, "stickied": false, "created": 1491997495.0, "created_utc": 1491968695.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vl8l", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Monechetti", "parent_id": "t1_dg4ve8f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Nah, I'm not cut out for president - I don't know how to play golf whatsoever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, I&amp;#39;m not cut out for president - I don&amp;#39;t know how to play golf whatsoever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4vl8l", "score_hidden": false, "stickied": false, "created": 1491971637.0, "created_utc": 1491942837.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ve8f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "yiannos13", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "What about you becoming the president? That way, you could be the complete overlord of this timeline and ascend humanity into peace and happiness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about you becoming the president? That way, you could be the complete overlord of this timeline and ascend humanity into peace and happiness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4ve8f", "score_hidden": false, "stickied": false, "created": 1491971411.0, "created_utc": 1491942611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg4y2e0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Helix_Raziel", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "WOW that ending!!! So your best scenario is to become one of the richest people and save yourself...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;WOW that ending!!! So your best scenario is to become one of the richest people and save yourself...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4y2e0", "score_hidden": false, "stickied": false, "created": 1491974499.0, "created_utc": 1491945699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64rjy0", "likes": null, "replies": "", "user_reports": [], "id": "dg4geux", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "benderose", "parent_id": "t3_64rjy0", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "What the fuck. But i could use this. I could save my older brother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What the fuck. But i could use this. I could save my older brother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4geux", "score_hidden": false, "stickied": false, "created": 1491955087.0, "created_utc": 1491926287.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]