[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64ahar/the_white_room/\"&gt;Part 1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64jsub/the_white_room_part_2/?st=J1C8BVDM&amp;amp;sh=f13d4b68\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Unfortunately it would not be quite so long until my third death. Around six months after my second death, life was moving on for me. My former girlfriend and recent wife had given birth to little Kaia, a seven pound, six ounce ball of perfection. To say she was a good distraction from Death would be an understatement. &lt;/p&gt;\n\n&lt;p&gt;A brief bit of information on my situation. When I have been brought back from the edge of death, or beyond the edge it would seem, I have not simply been given a fresh, healthy body. I have been given the one I seemingly wished for. The one I awoke with before my death. &lt;/p&gt;\n\n&lt;p&gt;After a visit to the doctor for what seemed like a random seizure, I had to go through a variety of pet scans, head CTs, and the annoying process of an MRI. After over a week of testing, I was given the news that I had an aggressive tumor. A rare form of astrocytoma (Are any tumors common? I mean come on, it&amp;#39;s always a rare tumor). It had progressed to the point of being inoperable. Not that it had a high operable rate to begin with. So, they gave me around four months to live, with chemo. Which I would have normally rejected, and lived out my days in a drunken haze. But I was a father now, and those choices weren&amp;#39;t just my own anymore. So I took the treatments. I tell you, I would take a car accident and a tree falling on me any day over cancer treatment. &lt;/p&gt;\n\n&lt;p&gt;I wish I could say I fought the long fight, and lived far longer than the doctors said I would. But I slowly lost control of my motor functions. Vomiting became a normal part of my schedule. Headaches, seizures, the works. I wish I could say I had a day of clarity in the end, but that would be lying. I died a slow, excruciating death for almost three months. &lt;/p&gt;\n\n&lt;p&gt;And then it was over. I awoke in The White Room in my chair, sitting across from Death himself. Well, herself this time. &lt;/p&gt;\n\n&lt;p&gt;Death had taken the form of a young woman, maybe around twenty. She had a long scar down her face, loose blonde hair, and wore a strange looking tunic. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was wondering when I would wake up here. You sure dragged this one out.&amp;quot; I said, enjoying my ability to breath and talk freely. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was only there in the last moments, I&amp;#39;m afraid. What happens in your life is out of my hands, Kennon.&amp;quot; Death said, her voice calm. &lt;/p&gt;\n\n&lt;p&gt;I thought on that, trying to keep my mind objective. I was actually happy to be out of my misery, and to relieve my family of the burden. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have thought about our conversations here. My wording is the only thing I can think of that has gotten me out of here, into my revival. So, anything I ask for is what I get?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That would be a way of looking at it, I suppose.&amp;quot; Death stated with a nod. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So if I ask to be revived, without the cancer, I would continue to live? I could see my baby girl grow up?&amp;quot; I asked, making sure not to make a request. &lt;/p&gt;\n\n&lt;p&gt;Death simply nodded. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And what if I asked to simply move on? To pursue whatever afterlife there is?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Your choices are your own. Free will does not stop being relative in your afterlife. I am simply here to show you the door.&amp;quot; Death stated. &lt;/p&gt;\n\n&lt;p&gt;I nodded, thinking of another question. I had thought of many throughout my life, but only now did they seem to escape me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why are you a different person every time I come here?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They are different parts of me, as they are of you. To explain would be useless, I&amp;#39;m afraid. Just know that I am not bound to one form, let alone one physical form. I simply am.&amp;quot; She stated. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What came before you?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I cannot say. Before me was the absence of life. When I took the first living being, I had only be in existence as a thought. I, or another power, simply willed myself into existence. There is no scientific explanation, if that is what you are searching for.&amp;quot; She stated. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And what about God? I would like to know his play in all this.&amp;quot; I asked, nearly excited for an answer. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;God, as you know him, does not exist. A creator of the universe does, however. He, if he can be addressed as such, does not take a form such as I. I am here for life. His existence cannot be simplified with one reason, or any for that matter. He simply is, and isn&amp;#39;t.&amp;quot; Death said with a light shrug. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And what about...&amp;quot; I began, but was cut off when Death raised her hand. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Kennon. It is time.&amp;quot; She said. &lt;/p&gt;\n\n&lt;p&gt;I nodded. My relationship with Death was growing into an odd one for sure. The more I asked, the more I understood that I didn&amp;#39;t understand. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You already know my choice I guess. A scholar might wish for greater things, but I just want to live again, with my wife and child. Just...give me my life back. And take away any of my illnesses. Just, make me healthy.&amp;quot; I said. &lt;/p&gt;\n\n&lt;p&gt;The words I spoke seemed a bit vain in hindsight. I could of asked for a world without war, or disease. Possibly. I still don&amp;#39;t know the full capabilities of Death&amp;#39;s powers, and I&amp;#39;m not sure I want to. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Very well.&amp;quot; She said with a nod. &lt;/p&gt;\n\n&lt;p&gt;And then, once again, she was gone as if she had never been there to begin with. &lt;/p&gt;\n\n&lt;p&gt;I walked up to the door, twisting the handle quickly before stopping. I paused to think on my choice for a moment, and looked behind me. The room remained empty, but I was sure Death was watching. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Thank you...&amp;quot; I said, and took my step back into life. &lt;/p&gt;\n\n&lt;p&gt;I awoke with a start once again, life spreading throughout my body. Once I regained my composure, I made my way out of bed and into the hall. The door to my daughters room creaked open as I pushed it, and I watched my wife cradle our daughter. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How&amp;#39;re the two most amazing women in my life doing?&amp;quot; I said,  my worries going to the back of my mind. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Just...perfect.&amp;quot; My wife said, whispering little coos to our child. &lt;/p&gt;\n\n&lt;p&gt;I sat across from them and just watched. It was a perfect scene, one I would remember forever. Moments of clarity are rare in our lifetime, and I would suggest you all sit down and smell the roses, at least once. &lt;/p&gt;\n\n&lt;p&gt;The third time I met Death, it was one of the worst deaths I had to endure. Not because of the pain, or loss of my bodily functions, but because I had to leave behind the one thing I couldn&amp;#39;t. Many of you have said I keep coming back because I couldn&amp;#39;t let go of my worldly attachments. You may are right in a sense. But I have died a total of eight times. I ask that you save your judgements until you hear about the eighth. &lt;/p&gt;\n\n&lt;p&gt;I have experienced a lot in my lifetimes, more than I care to share honestly. I can’t promise an ending full of answers and clarity, reality isn’t as giving as we would like to think. I can promise a resolution though, and I hope you stick with me until then. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/652ofo/the_white_room_part_4/\"&gt;Part 4&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Part 1] (https://www.reddit.com/r/nosleep/comments/64ahar/the_white_room/)\n\n[Part 2] (https://www.reddit.com/r/nosleep/comments/64jsub/the_white_room_part_2/?st=J1C8BVDM&amp;sh=f13d4b68)\n\nUnfortunately it would not be quite so long until my third death. Around six months after my second death, life was moving on for me. My former girlfriend and recent wife had given birth to little Kaia, a seven pound, six ounce ball of perfection. To say she was a good distraction from Death would be an understatement. \n\nA brief bit of information on my situation. When I have been brought back from the edge of death, or beyond the edge it would seem, I have not simply been given a fresh, healthy body. I have been given the one I seemingly wished for. The one I awoke with before my death. \n\nAfter a visit to the doctor for what seemed like a random seizure, I had to go through a variety of pet scans, head CTs, and the annoying process of an MRI. After over a week of testing, I was given the news that I had an aggressive tumor. A rare form of astrocytoma (Are any tumors common? I mean come on, it's always a rare tumor). It had progressed to the point of being inoperable. Not that it had a high operable rate to begin with. So, they gave me around four months to live, with chemo. Which I would have normally rejected, and lived out my days in a drunken haze. But I was a father now, and those choices weren't just my own anymore. So I took the treatments. I tell you, I would take a car accident and a tree falling on me any day over cancer treatment. \n\nI wish I could say I fought the long fight, and lived far longer than the doctors said I would. But I slowly lost control of my motor functions. Vomiting became a normal part of my schedule. Headaches, seizures, the works. I wish I could say I had a day of clarity in the end, but that would be lying. I died a slow, excruciating death for almost three months. \n\nAnd then it was over. I awoke in The White Room in my chair, sitting across from Death himself. Well, herself this time. \n\nDeath had taken the form of a young woman, maybe around twenty. She had a long scar down her face, loose blonde hair, and wore a strange looking tunic. \n\n\"I was wondering when I would wake up here. You sure dragged this one out.\" I said, enjoying my ability to breath and talk freely. \n\n\"I was only there in the last moments, I'm afraid. What happens in your life is out of my hands, Kennon.\" Death said, her voice calm. \n\nI thought on that, trying to keep my mind objective. I was actually happy to be out of my misery, and to relieve my family of the burden. \n\n\"I have thought about our conversations here. My wording is the only thing I can think of that has gotten me out of here, into my revival. So, anything I ask for is what I get?\" I asked. \n\n\"That would be a way of looking at it, I suppose.\" Death stated with a nod. \n\n\"So if I ask to be revived, without the cancer, I would continue to live? I could see my baby girl grow up?\" I asked, making sure not to make a request. \n\nDeath simply nodded. \n\n\"And what if I asked to simply move on? To pursue whatever afterlife there is?\" I asked. \n\n\"Your choices are your own. Free will does not stop being relative in your afterlife. I am simply here to show you the door.\" Death stated. \n\nI nodded, thinking of another question. I had thought of many throughout my life, but only now did they seem to escape me. \n\n\"Why are you a different person every time I come here?\" I asked. \n\n\"They are different parts of me, as they are of you. To explain would be useless, I'm afraid. Just know that I am not bound to one form, let alone one physical form. I simply am.\" She stated. \n\n\"What came before you?\" I asked. \n\n\"I cannot say. Before me was the absence of life. When I took the first living being, I had only be in existence as a thought. I, or another power, simply willed myself into existence. There is no scientific explanation, if that is what you are searching for.\" She stated. \n\n\"And what about God? I would like to know his play in all this.\" I asked, nearly excited for an answer. \n\n\"God, as you know him, does not exist. A creator of the universe does, however. He, if he can be addressed as such, does not take a form such as I. I am here for life. His existence cannot be simplified with one reason, or any for that matter. He simply is, and isn't.\" Death said with a light shrug. \n\n\"And what about...\" I began, but was cut off when Death raised her hand. \n\n\"Kennon. It is time.\" She said. \n\nI nodded. My relationship with Death was growing into an odd one for sure. The more I asked, the more I understood that I didn't understand. \n\n\"You already know my choice I guess. A scholar might wish for greater things, but I just want to live again, with my wife and child. Just...give me my life back. And take away any of my illnesses. Just, make me healthy.\" I said. \n\nThe words I spoke seemed a bit vain in hindsight. I could of asked for a world without war, or disease. Possibly. I still don't know the full capabilities of Death's powers, and I'm not sure I want to. \n\n\"Very well.\" She said with a nod. \n\nAnd then, once again, she was gone as if she had never been there to begin with. \n\nI walked up to the door, twisting the handle quickly before stopping. I paused to think on my choice for a moment, and looked behind me. The room remained empty, but I was sure Death was watching. \n\n\"Thank you...\" I said, and took my step back into life. \n\nI awoke with a start once again, life spreading throughout my body. Once I regained my composure, I made my way out of bed and into the hall. The door to my daughters room creaked open as I pushed it, and I watched my wife cradle our daughter. \n\n\"How're the two most amazing women in my life doing?\" I said,  my worries going to the back of my mind. \n\n\"Just...perfect.\" My wife said, whispering little coos to our child. \n\nI sat across from them and just watched. It was a perfect scene, one I would remember forever. Moments of clarity are rare in our lifetime, and I would suggest you all sit down and smell the roses, at least once. \n\nThe third time I met Death, it was one of the worst deaths I had to endure. Not because of the pain, or loss of my bodily functions, but because I had to leave behind the one thing I couldn't. Many of you have said I keep coming back because I couldn't let go of my worldly attachments. You may are right in a sense. But I have died a total of eight times. I ask that you save your judgements until you hear about the eighth. \n\nI have experienced a lot in my lifetimes, more than I care to share honestly. I can’t promise an ending full of answers and clarity, reality isn’t as giving as we would like to think. I can promise a resolution though, and I hope you stick with me until then. \n\n\n[Part 4] (https://www.reddit.com/r/nosleep/comments/652ofo/the_white_room_part_4/)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "64sx6f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 213, "report_reasons": null, "author": "Kennon02", "saved": false, "mod_reports": [], "name": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492049165.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64sx6f/the_white_room_part_3/", "num_reports": null, "locked": false, "stickied": false, "created": 1491966089.0, "url": "https://www.reddit.com/r/nosleep/comments/64sx6f/the_white_room_part_3/", "author_flair_text": null, "quarantine": false, "title": "The White Room [Part 3]", "created_utc": 1491937289.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 213}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": "", "user_reports": [], "id": "dg4qlsg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64sx6f%2Fthe_white_room_part_3%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;subject=Reminder&amp;to=RemindMeBot) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64sx6f%2Fthe_white_room_part_3%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;subject=Reminder&amp;amp;to=RemindMeBot\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4qlsg", "score_hidden": true, "stickied": true, "created": 1491966200.0, "created_utc": 1491937400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": "", "user_reports": [], "id": "dg52dq2", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg52ac4", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Well, I haven't died a ninth yet. Maybe that'll be my last. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I haven&amp;#39;t died a ninth yet. Maybe that&amp;#39;ll be my last. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg52dq2", "score_hidden": false, "stickied": false, "created": 1491979886.0, "created_utc": 1491951086.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52ac4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Gorey58", "parent_id": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Great story. Question - if cats have nine lives, why did you only get eight?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story. Question - if cats have nine lives, why did you only get eight?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg52ac4", "score_hidden": false, "stickied": false, "created": 1491979766.0, "created_utc": 1491950966.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": "", "user_reports": [], "id": "dg4sl2n", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Bats_mistress", "parent_id": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "More, more, MORE!!! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More, more, MORE!!! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4sl2n", "score_hidden": false, "stickied": false, "created": 1491968318.0, "created_utc": 1491939518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": "", "user_reports": [], "id": "dg4sn70", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Slimjem51", "parent_id": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Nice looking forward to ur next installment", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice looking forward to ur next installment&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4sn70", "score_hidden": false, "stickied": false, "created": 1491968382.0, "created_utc": 1491939582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": "", "user_reports": [], "id": "dg6pboh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg6khle", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I asked that very question myself. And I'll try to answer it as the story progresses. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I asked that very question myself. And I&amp;#39;ll try to answer it as the story progresses. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6pboh", "score_hidden": false, "stickied": false, "created": 1492066100.0, "created_utc": 1492037300.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6khle", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pcperson122", "parent_id": "t1_dg66gwt", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Your deaths are interesting, but it makes you wonder,  why are you imortal, but others are not. Something mutiverse or what?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your deaths are interesting, but it makes you wonder,  why are you imortal, but others are not. Something mutiverse or what?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6khle", "score_hidden": false, "stickied": false, "created": 1492060245.0, "created_utc": 1492031445.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66gwt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg65v68", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Soon enough. Glad to see someone is enthusiastic about my deaths. :) Will most likely update tonight or tomorrow morning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Soon enough. Glad to see someone is enthusiastic about my deaths. :) Will most likely update tonight or tomorrow morning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg66gwt", "score_hidden": false, "stickied": false, "created": 1492045781.0, "created_utc": 1492016981.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65v68", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Bats_mistress", "parent_id": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Almost time for part 4, yes? Please? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Almost time for part 4, yes? Please? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg65v68", "score_hidden": false, "stickied": false, "created": 1492045166.0, "created_utc": 1492016366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": "", "user_reports": [], "id": "dg5q8t6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I have been one who has suggested you could release yourself of your worldly attachments so you can move on to a better place but it was never a judgment it was a hope. I sincerely wish that there is resolution for you. Perhaps I was wrong and in order to find a suitable resolution you need to endure your eight lifetimes to learn something death feels is necessary for your existence in the next bardo. I do look forward to hearing more from you and seeing you attain the peace you deserve. Good luck.", "edited": 1492012293.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been one who has suggested you could release yourself of your worldly attachments so you can move on to a better place but it was never a judgment it was a hope. I sincerely wish that there is resolution for you. Perhaps I was wrong and in order to find a suitable resolution you need to endure your eight lifetimes to learn something death feels is necessary for your existence in the next bardo. I do look forward to hearing more from you and seeing you attain the peace you deserve. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5q8t6", "score_hidden": false, "stickied": false, "created": 1492024224.0, "created_utc": 1491995424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64sx6f", "likes": null, "replies": "", "user_reports": [], "id": "dg70q3q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kakes_411", "parent_id": "t1_dg6pggb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I wish you could tell me, too! I can't wait to hear the rest of the story. I'm hooked!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish you could tell me, too! I can&amp;#39;t wait to hear the rest of the story. I&amp;#39;m hooked!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg70q3q", "score_hidden": false, "stickied": false, "created": 1492080162.0, "created_utc": 1492051362.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pggb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg6b0mo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "A good question. Sorry for not getting bing specifics. I awoke the day of my first seizure, where we went to the doctor. I can't obviously had cancer at that time. I'm assuming Death simply removed it? I wish I could tell you exactly what he did. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A good question. Sorry for not getting bing specifics. I awoke the day of my first seizure, where we went to the doctor. I can&amp;#39;t obviously had cancer at that time. I&amp;#39;m assuming Death simply removed it? I wish I could tell you exactly what he did. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6pggb", "score_hidden": false, "stickied": false, "created": 1492066265.0, "created_utc": 1492037465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6b0mo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kakes_411", "parent_id": "t3_64sx6f", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Wait, so when did you wake up this time? Before you were diagnosed? Or did you wake up the same day you died, but in some sort of alternate reality where you didn't have the tumor?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait, so when did you wake up this time? Before you were diagnosed? Or did you wake up the same day you died, but in some sort of alternate reality where you didn&amp;#39;t have the tumor?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6b0mo", "score_hidden": false, "stickied": false, "created": 1492050386.0, "created_utc": 1492021586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]