[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What follows is the transcript from an interview with staff nurse Sam Jones regarding what has become known as the Gregory Wing Incident.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou were in the Gregory Wing when the first alarm was set off, is that correct?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYes.  That’s right.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nDo you recall who set the alarms off?&lt;/p&gt;\n\n&lt;p&gt;Jones: \nIt was one of the other nurses, just before the whole wing was locked down.  No, I don’t know who.  It was …a little all over the place, really.  You know.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nTell me what happened, Sam.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWell… We had a patient brought in from A&amp;amp;E, rushed down to our ward for Dr Klein to see her.  I mean, the man’s a prodigy in disease control, and that’s what we thought we were looking at.  So it needed to be him, it had to be there.  Only, Jesus, it wasn’t a disease.&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;I can do without you giving me that look.&lt;/p&gt;\n\n&lt;p&gt;-six seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;She was just …disappearing.  Fading away, piece by piece.  It started on her shoulder, that’s what I saw at least.  We were briefed pretty quickly, as is usually the way with these things - she’d been brought in with a lesion on her shoulder of unknown origin that was spreading fast, but it didn’t seem to be causing her any pain or discomfort.  She wasn’t in pain.  It was just blind panic.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nTell me about this lesion.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI … it all happened so quickly.  It was like a blister, but rapidly repeating itself, bubbling up and bursting in a rolling boil, only every time it burst the skin just …drifted.  It broke apart into smaller pieces, floating into the air around us all.  Dr Klein did what he could to try to stabilise her, but within minutes you could see her shoulder joint through the wound, and as the bone started to fizz and dissipate too, her arm grew limp and eventually dropped to the floor.  It…&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;It made me think of, like… a snake, shedding its skin, only not wanting to, and without anything there underneath to replace it.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWhere were you during this?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nOh, I was way at the back of the room, there’s no way I was getting any closer to that.  I’d never seen anything like it before - none of us had - but I’d only been working there for six months.  I didn’t want to get in the way of anyone, everyone else was far better prepared.  It just… nothing worked.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI see.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou think I could have done more?  Hell, I’m lucky to still be here.  It’s standing pissing myself at the back of that room that saved my life, I’m sure of it.  You didn’t see her… the way this thing was just eating away at everything she was.  She could see her own ribs.  I think it was around that time that her panic must have given way to despair and she begged Dr Klein to kill her.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nShe…&lt;/p&gt;\n\n&lt;p&gt;Jones:\nDr Klein would never do that, though, but I’m sure he probably considered it.  Only one of the other nurses leapt back and started screaming herself when she saw that blisters were forming on his face, the skin around his nose and cheeks giving way to the bone beneath.&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Yeah.  So you can understand my panic.  The ranking physician had just started showing symptoms of an unknown disease he’d only just started investigating.  And the patient, her neck had started to go, she was fading fast… there wasn’t any blood, whatever was taking the skin was taking everything with it, and her arm on the floor had disappeared down to the elbow already.  I was just… well, I was out of there as quick as I could be.  I heard the first alarm while I was sprinting back to reception, at which point I panicked thinking that whatever it was, I might be carrying it myself.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou don’t seem to be.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nThanks.  But just to be on the safe side I kept my distance from reception, yelling that there was something contagious and dangerous on the loose, and I think the receptionist must have called through to management because before I got back to theatre I heard the tannoy announcement that the ward was being locked down to prevent cross contamination.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWe have a recording of that communication, I believe.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWell, good.  Anything that can back me up, I know how mad I must sound talking about this.&lt;/p&gt;\n\n&lt;p&gt;-four seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;And that look really isn’t helping.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI’m just being objective.&lt;/p&gt;\n\n&lt;p&gt;Jones:\n I could think of a few more words for it.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nPlease, Mr Jones.  What happened after the ward had been announced closed?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nSo it’s Mr Jones now?  What happened to Sam?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWould you prefer if I called you Sam?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI don’t care if you call me a sack of potatoes, lady, just have some consistency.  Christ.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWhat happened after the ward closed down, Sam?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nPandemonium.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nCould you be more specific?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nIt was mental.  Carnage.  Come on, I’ve told you all of this before.&lt;/p&gt;\n\n&lt;p&gt;Interviewer: \nI need you to say it for the tape, Sam.&lt;/p&gt;\n\n&lt;p&gt;-eleven seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI got back to theatre.  It was… a mess.  There was nothing left on the patient’s bed but her clothes.  Dr Klein was, he was…  It was just his leg left, and I swear it was still twitching beneath that white coat.  And the nurses.  Dear god, the nurses.  Of the five who were in there with us, only two could still scream, and one was making this… this horrendous noise, her windpipe was open and half of her chest had gone, so she was gulping from the air in the room rather than her lungs, and even then she could only just manage this… raw, anguished wheeze, fading as she just… &lt;/p&gt;\n\n&lt;p&gt;-six seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou saw this with your own eyes?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou think I’d make this up?  Christ’s sake, what sort of psychopath do you take me for?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI’m just trying to make sure.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI’ve told you once already.  That was enough for me.  You’re the one who wants me to drag it all up again.  I’m not doing this for me.  You think I’m enjoying this?&lt;/p&gt;\n\n&lt;p&gt;-four seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYour psychologist’s report indicates acute post-traumatic stress disorder -continued-&lt;/p&gt;\n\n&lt;p&gt;Jones:\n-talking over-  Of course it fucking does.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\n-continued- and I don’t want to be poking away at anything tender just as much as you don’t want to have it poked at.  But you have to understand, the sincerity of your account warrants an investigation.  Honestly, I don’t want to make you drag all of this up, but it’s for your benefit.  Please, stay with me on this.&lt;/p&gt;\n\n&lt;p&gt;-six seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Okay?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nOkay.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nOkay.  Sam.  What happened after you found this… pandemonium?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou know.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI know.  But for the tape, Sam.  Please.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI hid in a stationery cupboard.&lt;/p&gt;\n\n&lt;p&gt;-four seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWhy?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWhy?  What kind of question is that?  It had a big heavy door, and an airborne pathogen of unknown origin had just been released into a ward that had been locked down.  Yeah, maybe I was a fucking coward, I know that.  I just didn’t want to die, alright?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nSelf preservation is a natural instinct.  You have nothing to be ashamed of.&lt;/p&gt;\n\n&lt;p&gt;-six seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;When did you come out of the cupboard?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nAbout ten minutes after the screaming stopped.&lt;/p&gt;\n\n&lt;p&gt;Interviewer: \nHow long in total were you in there for?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nCould have been half an hour.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nAnd what did you see when you came out?&lt;/p&gt;\n\n&lt;p&gt;-two seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Please, Sam, I know this is hard for you.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI saw another nurse.  I don’t know his name, I’m afraid.  God, I was behind him in the canteen queue this morning.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWhat happened to him?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI don’t know for sure.  I saw him at a junction in the corridors in the distance, sprinting past, practically a blur of a lab coat.  I was only peering out of the cupboard, scared out of my wits.  I almost shouted to him.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nSam.  What did you see?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nHe was being chased by… something.  It was just this…&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Mass.  Like, just a shapeless, billowing cloud of …I don’t even know.  My best guess is that, Jesus.  This sounds insane, I know.  I think…&lt;/p&gt;\n\n&lt;p&gt;-six seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;I think it was a collection of all of the bits of people that had evaporated.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWhy do you think that?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWhat the hell else could it have been?  And don’t fucking look at me like I’m spewing bullshit.  Trauma or not, I know what I saw.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nBut you don’t know that’s what it was.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI know what I saw.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nHow can you be sure?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nBecause I saw it again.&lt;/p&gt;\n\n&lt;p&gt;-two seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou didn’t mention this before.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nBecause I didn’t want to seem crazier than I already seem.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nNobody is saying you’re crazy.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYour eyes are.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nSam, stay with me, please.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nNearly three hours, I was in that cupboard.  Half an hour, then I saw that …thing, and what did I do?  I went straight back into that damn cupboard.  Two hours later and I finally grew the balls, or lost the will to live, and moved.  Everyone was gone.  Everyone.  Staff, patients, everyone.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nThe initial report stated-&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI know what it stated.  I’m telling you now, officially, on the record, that the record is wrong.&lt;/p&gt;\n\n&lt;p&gt;-four seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nGo on.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI saw it, that mass, moving as one collective.  I… I don’t know if it was being controlled, or moving on its own, but it was floating after that nurse with purpose.  It wanted him.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWhy do you think that was?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nOh, I found out.  I stumbled across it while I was trying to find a way out.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYes, the report states that two of the three emergency exits, which had been sealed from the outside as per standard quarantine procedures, had been tampered with.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nTwo of them?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYes.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nThat must have been someone else.  I only had chance to try the one.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI see.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou’re doing it again.  And don’t go calling it ‘being objective’.  You’re doubting me.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI only want to get to the bottom of what happened.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou won’t.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou seem so sure, Sam.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nOnly because you’re not believing a word I’m saying.  How do you expect me to tell you about the weird-ass sci-fi type nonsense if I can’t even say how many doors I tried without you shooting me down?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nIt’s for the tape, Sam.  I don’t have to believe you, I’m not here to judge you.  This is your chance to put across your side of the story.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nAt least get rid of the condescending tone.  Have you actually had any training for this role?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nThis is about you, Sam, not me.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nThought not.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nSam.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nThat’ll be Mr Jones.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nLet’s get back to this thing you found then, Sam.  The …mass, as you put it.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou don’t want to hear any more.&lt;/p&gt;\n\n&lt;p&gt;Interviewer: \nThe tape certainly does, at least.&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI stumbled across it in one of the operating theatres.  Big, spacious area, it had moved all of the equipment to the sides of the room.  I was peeking through a vent in the door, I heard a commotion.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWhat did you hear?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nLike… footsteps, and the clanking of metal on metal.  Sort of like the elderly struggling to stand in a room full of… well, full of surgical equipment.&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Dr Klein was in there, a handful of nurses too, and another doctor I never learned the name of.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou said that-&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI know what I said, and I know what I saw, and I can do without the fucking doubt.  Would you shut up?&lt;/p&gt;\n\n&lt;p&gt;-two seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Thank you.  Yes, I saw him there.  I saw him, whole and complete, intact and alive, naked as the day he was born.  And I saw him teaching himself to walk.&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Him, the other doctor, the nurses… they were stumbling around all over the room, falling over in the fog and helping one another back up.  Everyone naked, everyone struggling.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nThe fog?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYes.  The thing I saw in the corridors, that mass of airborne human tissue, it was in there with them.  It covered the floor, making like, a thick, dense fog up to around knee height, but was subsiding steadily as more of the staff and patients came back.&lt;/p&gt;\n\n&lt;p&gt;-three seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;They were standing up one at a time, just straight up out of this …this mist of flesh on the floor.  Like they were being reborn, trying to stand on legs they’ve not yet used.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nDid you run again?&lt;/p&gt;\n\n&lt;p&gt;-six seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;For the purpose of the recording, the interviewee has declined a response, staring into the mid distance.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nOf course I did.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nThe cupboard?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYes.&lt;/p&gt;\n\n&lt;p&gt;-two seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nOur witnesses do confirm you spent a lot of time in a cupboard.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou don’t understand what I’m saying.  They aren’t witnesses.  I don’t know what they are now, but they aren’t the people you take them for.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nWe have dozens of witness statements, Sam, all with the same story.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nThat’s my point.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nThey match up with one another perfectly.  They unanimously describe what transpired as a training exercise.  Yours is the only account that doesn’t fit with that description of events.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nExactly.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYour psychiatrist told us about your last episode, Sam.&lt;/p&gt;\n\n&lt;p&gt;-four seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;He called it a “psychotic break from reality”, and explained all about the incident proceeding it.&lt;/p&gt;\n\n&lt;p&gt;-four seconds of silence-&lt;/p&gt;\n\n&lt;p&gt;You have still been taking your medication, haven’t you, Sam?&lt;/p&gt;\n\n&lt;p&gt;Jones:\nI’ve been off it for a year and a half and you should know that.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI see.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou’re doing it again.  Look, I want to speak to someone else.&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nThere is no one else, Sam.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou don’t understand.  I just want-&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou don’t understand.  There is no one else.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWhat are you trying to say?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI’m giving you the hard truth that this will be the last time your story is heard.  You have my sympathies, but I’m afraid the evidence is overwhelmingly not in your favour.  I’m sorry, Sam, but it’s likely that you’ll be taken somewhere where your condition can be analysed and treated properly and professionally.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nHow are you doing that?  Your face…&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nI don’t enjoy being the bearer of bad news, Sam, but honestly, you can’t push this any further.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWhat the hell are you?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nYou’d be laughed out of court.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nDr Klein?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nNobody would seriously entertain the concept you’re describing.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nYou…&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nNot least from a witness with an established diagnosis of paranoid schizophrenia.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWhat are you?  What do you want?&lt;/p&gt;\n\n&lt;p&gt;Interviewer:\nThe interview is terminated on the grounds that the interviewee has begun expressing symptoms of his pre-disclosed psychological condition.&lt;/p&gt;\n\n&lt;p&gt;Jones:\nWhat do you-&lt;/p&gt;\n\n&lt;p&gt;—END OF TAPE—&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What follows is the transcript from an interview with staff nurse Sam Jones regarding what has become known as the Gregory Wing Incident.\n\n\nInterviewer:\nYou were in the Gregory Wing when the first alarm was set off, is that correct?\n\nJones:\nYes.  That’s right.\n\nInterviewer:\nDo you recall who set the alarms off?\n\nJones: \nIt was one of the other nurses, just before the whole wing was locked down.  No, I don’t know who.  It was …a little all over the place, really.  You know.\n\nInterviewer:\nTell me what happened, Sam.\n\nJones:\nWell… We had a patient brought in from A&amp;E, rushed down to our ward for Dr Klein to see her.  I mean, the man’s a prodigy in disease control, and that’s what we thought we were looking at.  So it needed to be him, it had to be there.  Only, Jesus, it wasn’t a disease.\n\n-three seconds of silence-\n\nI can do without you giving me that look.\n\n-six seconds of silence-\n\nShe was just …disappearing.  Fading away, piece by piece.  It started on her shoulder, that’s what I saw at least.  We were briefed pretty quickly, as is usually the way with these things - she’d been brought in with a lesion on her shoulder of unknown origin that was spreading fast, but it didn’t seem to be causing her any pain or discomfort.  She wasn’t in pain.  It was just blind panic.\n\nInterviewer:\nTell me about this lesion.\n\nJones:\nI … it all happened so quickly.  It was like a blister, but rapidly repeating itself, bubbling up and bursting in a rolling boil, only every time it burst the skin just …drifted.  It broke apart into smaller pieces, floating into the air around us all.  Dr Klein did what he could to try to stabilise her, but within minutes you could see her shoulder joint through the wound, and as the bone started to fizz and dissipate too, her arm grew limp and eventually dropped to the floor.  It…\n\n-three seconds of silence-\n\nIt made me think of, like… a snake, shedding its skin, only not wanting to, and without anything there underneath to replace it.\n\nInterviewer:\nWhere were you during this?\n\nJones:\nOh, I was way at the back of the room, there’s no way I was getting any closer to that.  I’d never seen anything like it before - none of us had - but I’d only been working there for six months.  I didn’t want to get in the way of anyone, everyone else was far better prepared.  It just… nothing worked.\n\nInterviewer:\nI see.\n\nJones:\nYou think I could have done more?  Hell, I’m lucky to still be here.  It’s standing pissing myself at the back of that room that saved my life, I’m sure of it.  You didn’t see her… the way this thing was just eating away at everything she was.  She could see her own ribs.  I think it was around that time that her panic must have given way to despair and she begged Dr Klein to kill her.\n\nInterviewer:\nShe…\n\nJones:\nDr Klein would never do that, though, but I’m sure he probably considered it.  Only one of the other nurses leapt back and started screaming herself when she saw that blisters were forming on his face, the skin around his nose and cheeks giving way to the bone beneath.\n\n-three seconds of silence-\n\nYeah.  So you can understand my panic.  The ranking physician had just started showing symptoms of an unknown disease he’d only just started investigating.  And the patient, her neck had started to go, she was fading fast… there wasn’t any blood, whatever was taking the skin was taking everything with it, and her arm on the floor had disappeared down to the elbow already.  I was just… well, I was out of there as quick as I could be.  I heard the first alarm while I was sprinting back to reception, at which point I panicked thinking that whatever it was, I might be carrying it myself.\n\nInterviewer:\nYou don’t seem to be.\n\nJones:\nThanks.  But just to be on the safe side I kept my distance from reception, yelling that there was something contagious and dangerous on the loose, and I think the receptionist must have called through to management because before I got back to theatre I heard the tannoy announcement that the ward was being locked down to prevent cross contamination.\n\nInterviewer:\nWe have a recording of that communication, I believe.\n\nJones:\nWell, good.  Anything that can back me up, I know how mad I must sound talking about this.\n\n-four seconds of silence-\n\nAnd that look really isn’t helping.\n\nInterviewer:\nI’m just being objective.\n\nJones:\n I could think of a few more words for it.\n\nInterviewer:\nPlease, Mr Jones.  What happened after the ward had been announced closed?\n\nJones:\nSo it’s Mr Jones now?  What happened to Sam?\n\nInterviewer:\nWould you prefer if I called you Sam?\n\nJones:\nI don’t care if you call me a sack of potatoes, lady, just have some consistency.  Christ.\n\nInterviewer:\nWhat happened after the ward closed down, Sam?\n\nJones:\nPandemonium.\n\nInterviewer:\nCould you be more specific?\n\nJones:\nIt was mental.  Carnage.  Come on, I’ve told you all of this before.\n\nInterviewer: \nI need you to say it for the tape, Sam.\n\n-eleven seconds of silence-\n\nJones:\nI got back to theatre.  It was… a mess.  There was nothing left on the patient’s bed but her clothes.  Dr Klein was, he was…  It was just his leg left, and I swear it was still twitching beneath that white coat.  And the nurses.  Dear god, the nurses.  Of the five who were in there with us, only two could still scream, and one was making this… this horrendous noise, her windpipe was open and half of her chest had gone, so she was gulping from the air in the room rather than her lungs, and even then she could only just manage this… raw, anguished wheeze, fading as she just… \n\n-six seconds of silence-\n\nInterviewer:\nYou saw this with your own eyes?\n\nJones:\nYou think I’d make this up?  Christ’s sake, what sort of psychopath do you take me for?\n\nInterviewer:\nI’m just trying to make sure.\n\nJones:\nI’ve told you once already.  That was enough for me.  You’re the one who wants me to drag it all up again.  I’m not doing this for me.  You think I’m enjoying this?\n\n-four seconds of silence-\n\nInterviewer:\nYour psychologist’s report indicates acute post-traumatic stress disorder -continued-\n\nJones:\n-talking over-  Of course it fucking does.\n\nInterviewer:\n-continued- and I don’t want to be poking away at anything tender just as much as you don’t want to have it poked at.  But you have to understand, the sincerity of your account warrants an investigation.  Honestly, I don’t want to make you drag all of this up, but it’s for your benefit.  Please, stay with me on this.\n\n-six seconds of silence-\n\nOkay?\n\nJones:\nOkay.\n\nInterviewer:\nOkay.  Sam.  What happened after you found this… pandemonium?\n\nJones:\nYou know.\n\nInterviewer:\nI know.  But for the tape, Sam.  Please.\n\nJones:\nI hid in a stationery cupboard.\n\n-four seconds of silence-\n\nInterviewer:\nWhy?\n\nJones:\nWhy?  What kind of question is that?  It had a big heavy door, and an airborne pathogen of unknown origin had just been released into a ward that had been locked down.  Yeah, maybe I was a fucking coward, I know that.  I just didn’t want to die, alright?\n\nInterviewer:\nSelf preservation is a natural instinct.  You have nothing to be ashamed of.\n\n-six seconds of silence-\n\nWhen did you come out of the cupboard?\n\nJones:\nAbout ten minutes after the screaming stopped.\n\nInterviewer: \nHow long in total were you in there for?\n\nJones:\nCould have been half an hour.\n\nInterviewer:\nAnd what did you see when you came out?\n\n-two seconds of silence-\n\nPlease, Sam, I know this is hard for you.\n\nJones:\nI saw another nurse.  I don’t know his name, I’m afraid.  God, I was behind him in the canteen queue this morning.\n\nInterviewer:\nWhat happened to him?\n\nJones:\nI don’t know for sure.  I saw him at a junction in the corridors in the distance, sprinting past, practically a blur of a lab coat.  I was only peering out of the cupboard, scared out of my wits.  I almost shouted to him.\n\nInterviewer:\nSam.  What did you see?\n\nJones:\nHe was being chased by… something.  It was just this…\n\n-three seconds of silence-\n\nMass.  Like, just a shapeless, billowing cloud of …I don’t even know.  My best guess is that, Jesus.  This sounds insane, I know.  I think…\n\n-six seconds of silence-\n\nI think it was a collection of all of the bits of people that had evaporated.\n\nInterviewer:\nWhy do you think that?\n\nJones:\nWhat the hell else could it have been?  And don’t fucking look at me like I’m spewing bullshit.  Trauma or not, I know what I saw.\n\nInterviewer:\nBut you don’t know that’s what it was.\n\nJones:\nI know what I saw.\n\nInterviewer:\nHow can you be sure?\n\nJones:\nBecause I saw it again.\n\n-two seconds of silence-\n\nInterviewer:\nYou didn’t mention this before.\n\nJones:\nBecause I didn’t want to seem crazier than I already seem.\n\nInterviewer:\nNobody is saying you’re crazy.\n\nJones:\nYour eyes are.\n\nInterviewer:\nSam, stay with me, please.\n\nJones:\nNearly three hours, I was in that cupboard.  Half an hour, then I saw that …thing, and what did I do?  I went straight back into that damn cupboard.  Two hours later and I finally grew the balls, or lost the will to live, and moved.  Everyone was gone.  Everyone.  Staff, patients, everyone.\n\nInterviewer:\nThe initial report stated-\n\nJones:\nI know what it stated.  I’m telling you now, officially, on the record, that the record is wrong.\n\n-four seconds of silence-\n\nInterviewer:\nGo on.\n\nJones:\nI saw it, that mass, moving as one collective.  I… I don’t know if it was being controlled, or moving on its own, but it was floating after that nurse with purpose.  It wanted him.\n\nInterviewer:\nWhy do you think that was?\n\nJones:\nOh, I found out.  I stumbled across it while I was trying to find a way out.\n\nInterviewer:\nYes, the report states that two of the three emergency exits, which had been sealed from the outside as per standard quarantine procedures, had been tampered with.\n\nJones:\nTwo of them?\n\nInterviewer:\nYes.\n\nJones:\nThat must have been someone else.  I only had chance to try the one.\n\nInterviewer:\nI see.\n\nJones:\nYou’re doing it again.  And don’t go calling it ‘being objective’.  You’re doubting me.\n\nInterviewer:\nI only want to get to the bottom of what happened.\n\nJones:\nYou won’t.\n\nInterviewer:\nYou seem so sure, Sam.\n\nJones:\nOnly because you’re not believing a word I’m saying.  How do you expect me to tell you about the weird-ass sci-fi type nonsense if I can’t even say how many doors I tried without you shooting me down?\n\nInterviewer:\nIt’s for the tape, Sam.  I don’t have to believe you, I’m not here to judge you.  This is your chance to put across your side of the story.\n\nJones:\nAt least get rid of the condescending tone.  Have you actually had any training for this role?\n\nInterviewer:\nThis is about you, Sam, not me.\n\nJones:\nThought not.\n\nInterviewer:\nSam.\n\nJones:\nThat’ll be Mr Jones.\n\nInterviewer:\nLet’s get back to this thing you found then, Sam.  The …mass, as you put it.\n\nJones:\nYou don’t want to hear any more.\n\nInterviewer: \nThe tape certainly does, at least.\n\n-three seconds of silence-\n\nJones:\nI stumbled across it in one of the operating theatres.  Big, spacious area, it had moved all of the equipment to the sides of the room.  I was peeking through a vent in the door, I heard a commotion.\n\nInterviewer:\nWhat did you hear?\n\nJones:\nLike… footsteps, and the clanking of metal on metal.  Sort of like the elderly struggling to stand in a room full of… well, full of surgical equipment.\n\n-three seconds of silence-\n\nDr Klein was in there, a handful of nurses too, and another doctor I never learned the name of.\n\nInterviewer:\nYou said that-\n\nJones:\nI know what I said, and I know what I saw, and I can do without the fucking doubt.  Would you shut up?\n\n-two seconds of silence-\n\nThank you.  Yes, I saw him there.  I saw him, whole and complete, intact and alive, naked as the day he was born.  And I saw him teaching himself to walk.\n\n-three seconds of silence-\n\nHim, the other doctor, the nurses… they were stumbling around all over the room, falling over in the fog and helping one another back up.  Everyone naked, everyone struggling.\n\nInterviewer:\nThe fog?\n\nJones:\nYes.  The thing I saw in the corridors, that mass of airborne human tissue, it was in there with them.  It covered the floor, making like, a thick, dense fog up to around knee height, but was subsiding steadily as more of the staff and patients came back.\n\n-three seconds of silence-\n\nThey were standing up one at a time, just straight up out of this …this mist of flesh on the floor.  Like they were being reborn, trying to stand on legs they’ve not yet used.\n\nInterviewer:\nDid you run again?\n\n-six seconds of silence-\n\nFor the purpose of the recording, the interviewee has declined a response, staring into the mid distance.\n\nJones:\nOf course I did.\n\nInterviewer:\nThe cupboard?\n\nJones:\nYes.\n\n-two seconds of silence-\n\nInterviewer:\nOur witnesses do confirm you spent a lot of time in a cupboard.\n\nJones:\nYou don’t understand what I’m saying.  They aren’t witnesses.  I don’t know what they are now, but they aren’t the people you take them for.\n\nInterviewer:\nWe have dozens of witness statements, Sam, all with the same story.\n\nJones:\nThat’s my point.\n\nInterviewer:\nThey match up with one another perfectly.  They unanimously describe what transpired as a training exercise.  Yours is the only account that doesn’t fit with that description of events.\n\nJones:\nExactly.\n\nInterviewer:\nYour psychiatrist told us about your last episode, Sam.\n\n-four seconds of silence-\n\nHe called it a “psychotic break from reality”, and explained all about the incident proceeding it.\n\n-four seconds of silence-\n\nYou have still been taking your medication, haven’t you, Sam?\n\nJones:\nI’ve been off it for a year and a half and you should know that.\n\nInterviewer:\nI see.\n\nJones:\nYou’re doing it again.  Look, I want to speak to someone else.\n\nInterviewer:\nThere is no one else, Sam.\n\nJones:\nYou don’t understand.  I just want-\n\nInterviewer:\nYou don’t understand.  There is no one else.\n\nJones:\nWhat are you trying to say?\n\nInterviewer:\nI’m giving you the hard truth that this will be the last time your story is heard.  You have my sympathies, but I’m afraid the evidence is overwhelmingly not in your favour.  I’m sorry, Sam, but it’s likely that you’ll be taken somewhere where your condition can be analysed and treated properly and professionally.\n\nJones:\nHow are you doing that?  Your face…\n\nInterviewer:\nI don’t enjoy being the bearer of bad news, Sam, but honestly, you can’t push this any further.\n\nJones:\nWhat the hell are you?\n\nInterviewer:\nYou’d be laughed out of court.\n\nJones:\nDr Klein?\n\nInterviewer:\nNobody would seriously entertain the concept you’re describing.\n\nJones:\nYou…\n\nInterviewer:\nNot least from a witness with an established diagnosis of paranoid schizophrenia.\n\nJones:\nWhat are you?  What do you want?\n\nInterviewer:\nThe interview is terminated on the grounds that the interviewee has begun expressing symptoms of his pre-disclosed psychological condition.\n\nJones:\nWhat do you-\n\n—END OF TAPE—", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Strong Language", "id": "64th09", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 213, "report_reasons": null, "author": "phoenix_flies", "saved": false, "mod_reports": [], "name": "t3_64th09", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1491942722.0, "link_flair_css_class": "flair-trigger", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64th09/eyewitness_account_of_the_gregory_wing_incident/", "num_reports": null, "locked": false, "stickied": false, "created": 1491971161.0, "url": "https://www.reddit.com/r/nosleep/comments/64th09/eyewitness_account_of_the_gregory_wing_incident/", "author_flair_text": null, "quarantine": false, "title": "Eyewitness Account of the Gregory Wing Incident", "created_utc": 1491942361.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 213}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": "", "user_reports": [], "id": "dgb7jur", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SouthernEMS", "parent_id": "t1_dg82x6d", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "1000 ways to die in the west", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1000 ways to die in the west&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb7jur", "score_hidden": false, "stickied": false, "created": 1492320862.0, "created_utc": 1492292062.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82x6d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "spookymulder935", "parent_id": "t1_dg816zm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "500 days of summer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;500 days of summer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg82x6d", "score_hidden": false, "stickied": false, "created": 1492140530.0, "created_utc": 1492111730.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg816zm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "01001100_0101000", "parent_id": "t1_dg7pro8", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "21 Pilots", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;21 Pilots&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg816zm", "score_hidden": false, "stickied": false, "created": 1492138649.0, "created_utc": 1492109849.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pro8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LivingDeadGuuurl", "parent_id": "t1_dg5qneo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "30 seconds to mars", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;30 seconds to mars&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7pro8", "score_hidden": false, "stickied": false, "created": 1492126489.0, "created_utc": 1492097689.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qneo", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "cadetstrange", "parent_id": "t1_dg4wd8x", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "20 seconds of summer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;20 seconds of summer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5qneo", "score_hidden": false, "stickied": false, "created": 1492025201.0, "created_utc": 1491996401.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wd8x", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "eatingvegetarian", "parent_id": "t3_64th09", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "-19 seconds of silence-", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;-19 seconds of silence-&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg4wd8x", "score_hidden": false, "stickied": false, "created": 1491972498.0, "created_utc": 1491943698.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": "", "user_reports": [], "id": "dg51dya", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Oppiken", "parent_id": "t3_64th09", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Trust no one, OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust no one, OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg51dya", "score_hidden": false, "stickied": false, "created": 1491978606.0, "created_utc": 1491949806.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64th09", "likes": null, "replies": "", "user_reports": [], "id": "dg6ekud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ehartsay", "parent_id": "t1_dg5albi", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "He could be crazy and created the incident himself, \nOr it did happen and they are just recording the interview with the soon to be 'put away' witness for themselves.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He could be crazy and created the incident himself, \nOr it did happen and they are just recording the interview with the soon to be &amp;#39;put away&amp;#39; witness for themselves.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6ekud", "score_hidden": false, "stickied": false, "created": 1492054062.0, "created_utc": 1492025262.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5albi", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_64th09", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "If nothing happened then they wouldn't call it an incident and an incident wouldn't be important enough to turn into a conspiracy if it didn't happen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If nothing happened then they wouldn&amp;#39;t call it an incident and an incident wouldn&amp;#39;t be important enough to turn into a conspiracy if it didn&amp;#39;t happen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5albi", "score_hidden": false, "stickied": false, "created": 1491990761.0, "created_utc": 1491961961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}]