[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A couple of weeks ago my 18 year old daughter went off with her friends during Spring Break. Nothing unique, they went to the beach and hung out. I talked to her and texted her every day, and she posted updates on social media for her friends and family to see.&lt;/p&gt;\n\n&lt;p&gt;Speaking of family, I&amp;#39;ll note that Sara is an only child and I am a single father. Her mother died 5 years ago. I had taken Sara and some of her friends to see a movie and when we came home my wife was dead. The autopsy didn&amp;#39;t yield much in the way of answers. It was chalked up to natural causes, but she was 31 years old and very healthy. Either way, she&amp;#39;s gone, and that has obviously been tough on both me and my daughter.&lt;/p&gt;\n\n&lt;p&gt;Anyway, the final day of Sara&amp;#39;s trip she never responded to any of my texts or answered my phone calls. Complete silence on social media as well. I was obviously worried, but she returned home on time and everything seemed fine. She said she was just too caught up with her friends to get back to me, and while my parental instincts tell me that isn&amp;#39;t the whole truth, I do trust Sara so I didn&amp;#39;t press.&lt;/p&gt;\n\n&lt;p&gt;However, slowly, things seemed off. I first noticed it one night while I was sleeping. I had a particularly long day at work and I was totally exhausted. I came home late, around midnight. I went to check on Sara and she wasn&amp;#39;t in her room. I knocked on the door to all of the bathrooms, but got no response. However, the one nearest my room was locked so I figured she was using the restroom and just had earphones in. I texted her that I loved her and wished her good night and I was quickly in my bed and asleep.&lt;/p&gt;\n\n&lt;p&gt;But despite how worn out I was, something woke me up at around 1:15am. It sounded like my door creaking open, and when I looked up, my vision still blurry from the sleep, it was wide open. Alarmed I quickly jumped into a seated position, but the wider view revealed Sara, standing in the corner of the room seemingly frightened by my sudden burst. I looked back and forth between her and the door before questioning her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sara, what&amp;#39;s wrong?&amp;quot; I asked, but she didn&amp;#39;t reply. She just cowered in the corner for a moment, but slowly she seemed to be reassuring herself that she was fine. &amp;quot;Are you okay?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She took a couple of small steps towards my bed, and for some reason this made me uncomfortable. She was being silent and slowly approaching me, I know it&amp;#39;s not exactly something straight out of a horror film, but the whole situation had me feeling uneasy. I stood up and started towards her, but she backed up against the wall again and shouted, &amp;quot;No!&amp;quot;. I took a step back and raised my hands out in front of my chest.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s okay, sweetheart. What&amp;#39;s got you so jumpy?&amp;quot; I didn&amp;#39;t make any attempt to get closer to her, and I was hoping she would finally reply to me, but instead she ran out of my room and to her room. I was confused and didn&amp;#39;t chase after her, but after giving her a few minutes I went to her bedroom door and knocked. &amp;quot;Sara, everything is fine. It&amp;#39;s just Dad. Can I come in?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I heard her bed creaking a lot, and I mean a LOT. I knew she was awake, and honestly I was getting worried. I really needed to know what was going on. She never spoke up, but she did text me. &amp;quot;I&amp;#39;m fine. Need to rest.&amp;quot; With that, I reluctantly gave up and went back to sleep.&lt;/p&gt;\n\n&lt;p&gt;The next morning I was eating breakfast when she came down the stairs. She seemed to be her usual, happy self. I didn&amp;#39;t even have to bring up the events from hours earlier, she did. &amp;quot;I&amp;#39;m sorry about last night, daddy. I had a really trippy nightmare, and I think I was still out of it when I came to your room. I didn&amp;#39;t mean to scare you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I understand. I was just worried.&amp;quot; I finished my bacon and took the plate to the sink. When I finished rinsing off the plate, I turned around and Sara was standing a few feet away, a drawer open and a steak knife in her hand. She was just staring at it. &amp;quot;What&amp;#39;s wrong? Is it dirty?&amp;quot; I asked her, but she just smiled and shook her head. She put it back and closed the drawer.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s nothing, I&amp;#39;m just not as hungry as I thought I was. I&amp;#39;m gonna go back upstairs and call some friends. Love you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I responded that I loved her as well, but she was already heading back upstairs. After that, things were mostly normal. That is until this morning. I didn&amp;#39;t work today, but I had some errands I needed to run. I was taking a shower when I thought I heard the door to the bathroom open. I remained still and called out Sara&amp;#39;s name, but there was no reply. I figured it was just in my imagination so I went back to what I was doing. Now, I can&amp;#39;t see through the shower door, so I had no way of knowing she had actually entered the room. My back was now turned to the shower door when I felt a rush of cool air hit me. I jumped and turned around and there she was. Now, as absolutely weird as it was for her to open the shower door on her father, I can say that I don&amp;#39;t think she ever looked anywhere private. Instead, she maintained eye contact with me. My heart was racing. I don&amp;#39;t know how long we were standing there just looking at each other&amp;#39;s eyes, but it felt like at least a minute. Finally I came to my senses and reached beside her for the towel, but she grabbed my wrist and twisted, and it hurt like hell. I jerked away, grabbed the towel, covered myself, and then shook the pain out of my wrist. &amp;quot;Don&amp;#39;t.&amp;quot; I remember her saying as I looked at my wrist. By the time I looked back at her she was walking out of the bathroom, but I noticed the steak knife from before was sticking out of her pocket. I finished up in the bathroom and quickly found Sara getting ready to leave.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sara, what the hell was that? You can&amp;#39;t just barge in on anyone, especially me, while they&amp;#39;re in the shower!&amp;quot; I shouted, I thought something was off, but I was still angry.&lt;/p&gt;\n\n&lt;p&gt;She took a deep breath as she slipped into her shoes. &amp;quot;I&amp;#39;m sorry. It&amp;#39;s complicated.&amp;quot; She reached for the door handle, but I called out for her to wait. &amp;quot;No, I have to go somewhere.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Where?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can&amp;#39;t tell you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I exhaled and rubbed my hand through my mediocre beard. &amp;quot;You&amp;#39;ve seemed a little... off, ever since your trip. Is everything okay? Did something happen?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She teared up. &amp;quot;I can&amp;#39;t tell you. He&amp;#39;ll know.&amp;quot; With that, she quickly left the house. I stood there feeling a lot of different emotions, but mostly I was worried about who this man was my daughter was talking about. So I did something wrong to get answers. I invaded her privacy.&lt;/p&gt;\n\n&lt;p&gt;I went to her room and started searching for anything that could give me answers. Maybe drugs? I really don&amp;#39;t know what I was trying to find, but what I found was something I didn&amp;#39;t expect.&lt;/p&gt;\n\n&lt;p&gt;It was a binder. On the cover there was some weird symbol, I don&amp;#39;t know what it means, I haven&amp;#39;t been able to find anything relating to it on the internet. But inside? Pages and photos. On the pages Sara had been writing, and there were spots where the pages had gotten some liquid drops on them. I&amp;#39;m assuming those were tears. I couldn&amp;#39;t read anything she wrote, though. It had all been marked out completely with a pen, but she had a solid 15-20 pages of something that she had written. &lt;/p&gt;\n\n&lt;p&gt;The photographs were worrisome. Any picture of her where she wasn&amp;#39;t smiling had a smile drawn on. And any picture of a male? Me, her cousins, uncles, old boyfriends, etc. It didn&amp;#39;t matter her. Those pictures had clearly been stabbed repeatedly, and there were red marks on the pictures. But it didn&amp;#39;t look like red inked. It looked like dried blood. As I left her room, I stopped. I thought I heard something. Very faintly, it sounded like a man laughing.&lt;/p&gt;\n\n&lt;p&gt;She still hasn&amp;#39;t come home, but she did text me that she&amp;#39;d be home by curfew. I&amp;#39;m thinking about bringing this up to her. Should I?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/6521u2/my_daughter_has_changed_since_her_vacation_part_2/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A couple of weeks ago my 18 year old daughter went off with her friends during Spring Break. Nothing unique, they went to the beach and hung out. I talked to her and texted her every day, and she posted updates on social media for her friends and family to see.\n\nSpeaking of family, I'll note that Sara is an only child and I am a single father. Her mother died 5 years ago. I had taken Sara and some of her friends to see a movie and when we came home my wife was dead. The autopsy didn't yield much in the way of answers. It was chalked up to natural causes, but she was 31 years old and very healthy. Either way, she's gone, and that has obviously been tough on both me and my daughter.\n\nAnyway, the final day of Sara's trip she never responded to any of my texts or answered my phone calls. Complete silence on social media as well. I was obviously worried, but she returned home on time and everything seemed fine. She said she was just too caught up with her friends to get back to me, and while my parental instincts tell me that isn't the whole truth, I do trust Sara so I didn't press.\n\nHowever, slowly, things seemed off. I first noticed it one night while I was sleeping. I had a particularly long day at work and I was totally exhausted. I came home late, around midnight. I went to check on Sara and she wasn't in her room. I knocked on the door to all of the bathrooms, but got no response. However, the one nearest my room was locked so I figured she was using the restroom and just had earphones in. I texted her that I loved her and wished her good night and I was quickly in my bed and asleep.\n\nBut despite how worn out I was, something woke me up at around 1:15am. It sounded like my door creaking open, and when I looked up, my vision still blurry from the sleep, it was wide open. Alarmed I quickly jumped into a seated position, but the wider view revealed Sara, standing in the corner of the room seemingly frightened by my sudden burst. I looked back and forth between her and the door before questioning her.\n\n\"Sara, what's wrong?\" I asked, but she didn't reply. She just cowered in the corner for a moment, but slowly she seemed to be reassuring herself that she was fine. \"Are you okay?\"\n\nShe took a couple of small steps towards my bed, and for some reason this made me uncomfortable. She was being silent and slowly approaching me, I know it's not exactly something straight out of a horror film, but the whole situation had me feeling uneasy. I stood up and started towards her, but she backed up against the wall again and shouted, \"No!\". I took a step back and raised my hands out in front of my chest.\n\n\"It's okay, sweetheart. What's got you so jumpy?\" I didn't make any attempt to get closer to her, and I was hoping she would finally reply to me, but instead she ran out of my room and to her room. I was confused and didn't chase after her, but after giving her a few minutes I went to her bedroom door and knocked. \"Sara, everything is fine. It's just Dad. Can I come in?\"\n\nI heard her bed creaking a lot, and I mean a LOT. I knew she was awake, and honestly I was getting worried. I really needed to know what was going on. She never spoke up, but she did text me. \"I'm fine. Need to rest.\" With that, I reluctantly gave up and went back to sleep.\n\nThe next morning I was eating breakfast when she came down the stairs. She seemed to be her usual, happy self. I didn't even have to bring up the events from hours earlier, she did. \"I'm sorry about last night, daddy. I had a really trippy nightmare, and I think I was still out of it when I came to your room. I didn't mean to scare you.\"\n\n\"I understand. I was just worried.\" I finished my bacon and took the plate to the sink. When I finished rinsing off the plate, I turned around and Sara was standing a few feet away, a drawer open and a steak knife in her hand. She was just staring at it. \"What's wrong? Is it dirty?\" I asked her, but she just smiled and shook her head. She put it back and closed the drawer.\n\n\"It's nothing, I'm just not as hungry as I thought I was. I'm gonna go back upstairs and call some friends. Love you.\"\n\nI responded that I loved her as well, but she was already heading back upstairs. After that, things were mostly normal. That is until this morning. I didn't work today, but I had some errands I needed to run. I was taking a shower when I thought I heard the door to the bathroom open. I remained still and called out Sara's name, but there was no reply. I figured it was just in my imagination so I went back to what I was doing. Now, I can't see through the shower door, so I had no way of knowing she had actually entered the room. My back was now turned to the shower door when I felt a rush of cool air hit me. I jumped and turned around and there she was. Now, as absolutely weird as it was for her to open the shower door on her father, I can say that I don't think she ever looked anywhere private. Instead, she maintained eye contact with me. My heart was racing. I don't know how long we were standing there just looking at each other's eyes, but it felt like at least a minute. Finally I came to my senses and reached beside her for the towel, but she grabbed my wrist and twisted, and it hurt like hell. I jerked away, grabbed the towel, covered myself, and then shook the pain out of my wrist. \"Don't.\" I remember her saying as I looked at my wrist. By the time I looked back at her she was walking out of the bathroom, but I noticed the steak knife from before was sticking out of her pocket. I finished up in the bathroom and quickly found Sara getting ready to leave.\n\n\"Sara, what the hell was that? You can't just barge in on anyone, especially me, while they're in the shower!\" I shouted, I thought something was off, but I was still angry.\n\nShe took a deep breath as she slipped into her shoes. \"I'm sorry. It's complicated.\" She reached for the door handle, but I called out for her to wait. \"No, I have to go somewhere.\"\n\n\"Where?\"\n\n\"I can't tell you.\"\n\nI exhaled and rubbed my hand through my mediocre beard. \"You've seemed a little... off, ever since your trip. Is everything okay? Did something happen?\"\n\nShe teared up. \"I can't tell you. He'll know.\" With that, she quickly left the house. I stood there feeling a lot of different emotions, but mostly I was worried about who this man was my daughter was talking about. So I did something wrong to get answers. I invaded her privacy.\n\nI went to her room and started searching for anything that could give me answers. Maybe drugs? I really don't know what I was trying to find, but what I found was something I didn't expect.\n\nIt was a binder. On the cover there was some weird symbol, I don't know what it means, I haven't been able to find anything relating to it on the internet. But inside? Pages and photos. On the pages Sara had been writing, and there were spots where the pages had gotten some liquid drops on them. I'm assuming those were tears. I couldn't read anything she wrote, though. It had all been marked out completely with a pen, but she had a solid 15-20 pages of something that she had written. \n\nThe photographs were worrisome. Any picture of her where she wasn't smiling had a smile drawn on. And any picture of a male? Me, her cousins, uncles, old boyfriends, etc. It didn't matter her. Those pictures had clearly been stabbed repeatedly, and there were red marks on the pictures. But it didn't look like red inked. It looked like dried blood. As I left her room, I stopped. I thought I heard something. Very faintly, it sounded like a man laughing.\n\nShe still hasn't come home, but she did text me that she'd be home by curfew. I'm thinking about bringing this up to her. Should I?\n\n[Part 2](https://www.reddit.com/r/nosleep/comments/6521u2/my_daughter_has_changed_since_her_vacation_part_2/)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "64ujhv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 197, "report_reasons": null, "author": "ThisIsFriday", "saved": false, "mod_reports": [], "name": "t3_64ujhv", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492131404.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64ujhv/my_daughter_has_changed_since_her_vacation_part_1/", "num_reports": null, "locked": false, "stickied": false, "created": 1491981921.0, "url": "https://www.reddit.com/r/nosleep/comments/64ujhv/my_daughter_has_changed_since_her_vacation_part_1/", "author_flair_text": null, "quarantine": false, "title": "My Daughter Has Changed Since Her Vacation (Part 1)", "created_utc": 1491953121.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 197}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": "", "user_reports": [], "id": "dg53z48", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_64ujhv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64ujhv%2Fmy_daughter_has_changed_since_her_vacation_part_1%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;subject=Reminder&amp;to=RemindMeBot) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F64ujhv%2Fmy_daughter_has_changed_since_her_vacation_part_1%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;subject=Reminder&amp;amp;to=RemindMeBot\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg53z48", "score_hidden": true, "stickied": true, "created": 1491982034.0, "created_utc": 1491953234.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": "", "user_reports": [], "id": "dg62ehw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "IAmGoalie", "parent_id": "t1_dg5n9jg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You took the words out my mouth... fuck to the yes bring it up! (maybe buy a Kevlar vest for when you do... just an idea).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You took the words out my mouth... fuck to the yes bring it up! (maybe buy a Kevlar vest for when you do... just an idea).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg62ehw", "score_hidden": false, "stickied": false, "created": 1492041523.0, "created_utc": 1492012723.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5n9jg", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SomeoneNewIsTheWord", "parent_id": "t3_64ujhv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Fuck yes, you should bring it up to her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck yes, you should bring it up to her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5n9jg", "score_hidden": false, "stickied": false, "created": 1492015243.0, "created_utc": 1491986443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": "", "user_reports": [], "id": "dg5a4xr", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "creepypgirl79", "parent_id": "t3_64ujhv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "ah yes!! there is something completely fucked up with your daughter...and it needs to be figured out before she kills you or someone else. did she join a cult? a sadistic cult? I wonder when she was gone with her friends they introduced her to this. good luck and keep us updated. make sure you keep YOUR guard up. Lock your bedroom door..bathroom door. no more giving her access so easily to you...and make sure you have some type of protection. I know you dont want to think anything possible like this could be going on with your daughter...but dont rule it out and keep yourself safe. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ah yes!! there is something completely fucked up with your daughter...and it needs to be figured out before she kills you or someone else. did she join a cult? a sadistic cult? I wonder when she was gone with her friends they introduced her to this. good luck and keep us updated. make sure you keep YOUR guard up. Lock your bedroom door..bathroom door. no more giving her access so easily to you...and make sure you have some type of protection. I know you dont want to think anything possible like this could be going on with your daughter...but dont rule it out and keep yourself safe. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5a4xr", "score_hidden": false, "stickied": false, "created": 1491990148.0, "created_utc": 1491961348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": "", "user_reports": [], "id": "dg6pcqf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ThisIsFriday", "parent_id": "t1_dg6g8yt", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Been working on this. Not sure when I can update you all, perhaps tonight, but things have happened.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Been working on this. Not sure when I can update you all, perhaps tonight, but things have happened.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6pcqf", "score_hidden": false, "stickied": false, "created": 1492066136.0, "created_utc": 1492037336.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6g8yt", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "howlybird", "parent_id": "t3_64ujhv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Can you get in touch with her friends or their parents to see if anything strange happened on the trip?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you get in touch with her friends or their parents to see if anything strange happened on the trip?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6g8yt", "score_hidden": false, "stickied": false, "created": 1492055763.0, "created_utc": 1492026963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": "", "user_reports": [], "id": "dg5kfyg", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_64ujhv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The early and unexpected death of her mother that she may have repressed at the time may now be playing out. In her attempt to deal with these unexpected emotions she may be overwhelmed with Sara could be blaming you for her loss and acting out a revenge scenario. Although you are probably a good father the confusing alchemy of puberty, grief, and misplaced anger have taken a heavy toll on your daughter. Something may have happened during her spring break vacation that tipped her over the edge. Please get Sara to a psychiatrist for counseling and possible medication to help her through this difficult time in her life. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The early and unexpected death of her mother that she may have repressed at the time may now be playing out. In her attempt to deal with these unexpected emotions she may be overwhelmed with Sara could be blaming you for her loss and acting out a revenge scenario. Although you are probably a good father the confusing alchemy of puberty, grief, and misplaced anger have taken a heavy toll on your daughter. Something may have happened during her spring break vacation that tipped her over the edge. Please get Sara to a psychiatrist for counseling and possible medication to help her through this difficult time in her life. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5kfyg", "score_hidden": false, "stickied": false, "created": 1492007306.0, "created_utc": 1491978506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64ujhv", "likes": null, "replies": "", "user_reports": [], "id": "dg62amc", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "foolsgoldfound", "parent_id": "t3_64ujhv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Somebody is  asking a creative writing class......", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Somebody is  asking a creative writing class......&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg62amc", "score_hidden": false, "stickied": false, "created": 1492041409.0, "created_utc": 1492012609.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]