[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am an old man waiting to die. I&amp;#39;ve lost all desire, all drive, all interest in, well, anything at all. Heh, I don&amp;#39;t seem to do anything but sit here literally waiting to die every single day. The world took pity on me, probably because I&amp;#39;m so old, and stuck me in this place, which is barely better than living on the street.  At least I get food every now and then.&lt;/p&gt;\n\n&lt;p&gt;Let me tell you my story.&lt;/p&gt;\n\n&lt;p&gt;I have a guardian angel. I know most folks believe they do, but I&amp;#39;ve seen mine. I&amp;#39;ve interacted with it on many an occasion. In fact, she is part of my very first memory.&lt;/p&gt;\n\n&lt;p&gt;When I was four, I lived with my family in a small house in the country next to a lake. My father had built a pier so he could easily dock his fishing boat. It was a small lake, but damn was it fun. There&amp;#39;s nothing quite like having a large body of water to play in when you&amp;#39;re a kid.&lt;/p&gt;\n\n&lt;p&gt;Naturally, I was so young that I don&amp;#39;t remember much of that time, but there is one thing I remember distinctly: my mother warning me against wandering too close to the lake alone. But, I just couldn&amp;#39;t help myself. I loved the water and I loved to play in it even though I hadn&amp;#39;t quite mastered swimming. The water itself was a gorgeous crystal-clear blue and you could almost see the bottom, not like this bullshit we have for lakes in this area. You can probably guess what happened next. I fell in when I was alone.&lt;/p&gt;\n\n&lt;p&gt;Nowadays it seems absurd to think a child could get that close to a lake without supervision, but this was the country and a very long time ago. Children were never watched closely in those days, it just wasn&amp;#39;t necessary.&lt;/p&gt;\n\n&lt;p&gt;I drowned that day. I know I drowned. I very much recall running out of breath as I flung around my arms and legs trying to reach the surface before everything faded to black.&lt;/p&gt;\n\n&lt;p&gt;I woke lying on the shore with a strange woman looking down at me. This woman was very tall and wore a bright-white suit. In fact, I almost couldn&amp;#39;t tell where one part of the suit ended and another part began, but I remember studying the tie and tracing its outline with my eyes. She was enchantingly beautiful. In fact, she is still the most beautiful thing I&amp;#39;ve ever seen in my entire life. Her face held a blank expression, a lack-of-emotion that I would get to know all too well, and as soon as I was coherent enough to pay attention, she told me, &amp;quot;Do try to be more careful next time.&amp;quot; I blinked and she was gone.&lt;/p&gt;\n\n&lt;p&gt;Three years later, our house burned down for reasons I don&amp;#39;t recall, if the reason was ever actually found in the first place. My mother, two brothers, and our three dogs did not survive. My father had taken me on our first hunting trip and, upon our return, we discovered the remains of our house with their charred bodies inside. I&amp;#39;d never felt such loss or horror. I can still see the way their bodies twisted together, huddled in the center of the common room as they were, a twisted mass of charred flesh. Even the dogs were in that pile.&lt;/p&gt;\n\n&lt;p&gt;I still grieve for them despite the years.  Those seven years were the happiest of my life.  Father and I moved to the city after that. I don&amp;#39;t think he could stand seeing any sort of nature, anymore, much preferring the paved streets and never-ending concrete of the city. He never stepped into the country again. We found a run-down old hotel apparently just awaiting destruction, and just kind of moved in.&lt;/p&gt;\n\n&lt;p&gt;It was a month after our move to the city the first time my father hit me, and I don&amp;#39;t mean a spanking. He punched me straight in the face and sent me flying backward. We had no money, he had no job, he couldn&amp;#39;t get a job, and what&amp;#39;s worse, he wanted me to look for a job, as well. But even in those days, who would hire a seven-year-old? I had asked around every single day. He broke my nose that day despite my efforts.&lt;/p&gt;\n\n&lt;p&gt;The second time he hit me was the very next day. He got drunk, though I still don&amp;#39;t know how he paid for the booze, and this time he was not content with just one punch. That was the second time I met my guardian angel. In my scramble to get away from my drunken, violent father, she appeared just outside the door I was heading toward and beckoned me to follow. I got up and ran.&lt;/p&gt;\n\n&lt;p&gt;She glided along, floating in front of me, always out of reach, leading me to where I did not know. The path I was led became etched in my mind (it still is, in fact), and it ended in a wide alleyway. She gestured toward some kind of small makeshift building in one corner and I moved in the direction she pointed. I turned around and she was gone.&lt;/p&gt;\n\n&lt;p&gt;Four children emerged from the little building. They were all my age and they would become the best friends of my entire lifetime. Indeed, one of them even became my wife, but I haven&amp;#39;t come to that part of the story, yet.&lt;/p&gt;\n\n&lt;p&gt;The beatings continued, but my sense of family and loyalty would not allow me to abandon him. I even found myself trying to help him in whatever way I could. I managed to find a factory job, and gave him literally all the small amount of money I made, which was barely enough to afford our rent.  He didn&amp;#39;t feed me or love me.  He didn&amp;#39;t offer me anything but beatings and disdain.&lt;/p&gt;\n\n&lt;p&gt;It was through his drunken and violent rants that I discovered that he blamed me for the house fire. If he hadn&amp;#39;t taken me on that hunt, the house surely would not have burned down.&lt;/p&gt;\n\n&lt;p&gt;Factory work was hard.  Actually, that&amp;#39;s an understatement.  I worked 12 hours a day, every day, in a harsh environment, and was severely punished for the slightest transgression. If I was late, I was made to work naked for the entire day. If I didn&amp;#39;t meet quota, I was weighted for an hour or more, which meant carrying a huge weight around my neck that I sure as hell couldn&amp;#39;t hold up properly and then made to walk up and down an aisle for everyone to see. Beatings were common and they happened in front of everyone. Furthermore, injuries and even death were also common, often occurring weekly.&lt;/p&gt;\n\n&lt;p&gt;My friends took care of me, though.  They made sure I ate.  They begged me to stay in Camelot (our name for the little building we shared.) They were there for me no matter what. I miss them all terribly. Harry, Boulder, Chicken-leg, and Susan, my dearest Susan.  Boulder and Chicken-leg were hit by an automobile when I was 15.  I can hardly recall their real names.&lt;/p&gt;\n\n&lt;p&gt;As I had grown older, and what with the hard factory-work and all, I had also grown stronger. Strong enough to contend with my father. It was shortly after Boulder and Chicken-leg died that the incident happened. In fact, it was because of their deaths and my grief that I would not put up with my father any longer. He came at me that night in his drunken stupor looking to hurt me yet again, but I was having none of it, and I punched him square in the nose just like he had done to me eight years earlier. Only he fell down and did not get back up.&lt;/p&gt;\n\n&lt;p&gt;The guilt of killing my father still haunts me and it is only made worse by what I did next. I ran away. That was the third time I met my guardian angel. After the incident, I fled and found myself in the commercial district, crying my eyes out. She appeared next to an army recruitment center and gestured for me to come to her. I enlisted that day. I had to lie about my age, but what with the War seeming inevitable, they didn&amp;#39;t question my lie.&lt;/p&gt;\n\n&lt;p&gt;The Great War began and I found myself in actual combat. I was not alone, however. Harry had joined after hearing that I did, and by some miracle, we were in the same company.&lt;/p&gt;\n\n&lt;p&gt;I will not recount the horrors I experienced in the War. Just know that it was far worse than anything I had yet experienced, and clearly that is saying something considering everything I&amp;#39;ve just told you.&lt;/p&gt;\n\n&lt;p&gt;Harry did not survive the war. He died in my arms, in fact. I do not wish to relive that event and will not say any more about it.&lt;/p&gt;\n\n&lt;p&gt;This is getting longer than I thought it would. I will give a shortened version of the remainder.&lt;/p&gt;\n\n&lt;p&gt;The fourth time I met my guardian angel was just after I had returned from the War. My state-of-mind was not well (they call it PTSD, now), and I did nothing but drink. One evening in which I wasn&amp;#39;t completely shit-faced out my mind, my guardian angel appeared and, in the same manner as before, led me to a small restaurant just outside the city. It was where Susan worked.&lt;/p&gt;\n\n&lt;p&gt;We married six months later. I was wholeheartedly devoted to her, and damn it, I still am. She gave me four children, Harry, Steven, Elizabeth, and Catherine.&lt;/p&gt;\n\n&lt;p&gt;When Harry was seven and Steven was four, Harry accidentally drowned Steven as they played in the bath. Four years later, he intentionally killed Elizabeth by punching her repeatedly during an argument. He was put in a mental facility where he died in an accident with a malfunctioning ECT machine.  Catherine died of cancer two years after that. Susan&amp;#39;s grief was too much to bear and she committed suicide by blowing her own brains all over the wall with my .45.&lt;/p&gt;\n\n&lt;p&gt;I attempted the same, but just before I pulled the trigger, my guardian angel appeared and that was the second time she had ever spoken to me. &amp;quot;You have more to do in this life before it ends,&amp;quot; she said to me. So I didn&amp;#39;t pull the trigger that day.&lt;/p&gt;\n\n&lt;p&gt;I attempted something of a normal life for a while, but there was nothing for me, so I tried to jump off the Golden Gate bridge.  I even made a special trip just to do it. Again, my guardian angel appeared to me and told me, &amp;quot;It is not time to die, yet.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Ten more times I made an attempt to end my own life over the following years. She always appeared to tell me the same thing, &amp;quot;It is not time to die, yet.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Eventually I didn&amp;#39;t care what she had to say, anymore. I rarely had a job, rarely had a home, spent most of the time living on the street, was constantly sick with some chronic cough or some other ailment to which I would find no cure, and did horrible, horrible things to survive when I couldn&amp;#39;t stand the hunger any longer, even at one point going so far as to whoring myself to men in a filthy public bathroom stall just for money to eat.  I stole regularly, lied to everyone I came across, and became everything I hated in the world.&lt;/p&gt;\n\n&lt;p&gt;The only possession remaining to me was the .45 my dear Susan had used to end her life. I had saved it just for this occasion. I didn&amp;#39;t care what that damned beautiful bitch had to say anymore, and pulled the trigger with her standing right in front of me. Click. Nothing.&lt;/p&gt;\n\n&lt;p&gt;She smiled at me for the first time in my life, and it was not a welcoming smile, it was wholly evil. &amp;quot;Tortured souls have the sweetest taste of all souls and the more ripe, the sweeter the taste, but the taste is ruined if they don&amp;#39;t die naturally.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://jasonclement.me/stories/\"&gt;+&lt;/a&gt;&lt;a href=\"https://www.facebook.com/jason.clement.wtf\"&gt;+&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am an old man waiting to die. I've lost all desire, all drive, all interest in, well, anything at all. Heh, I don't seem to do anything but sit here literally waiting to die every single day. The world took pity on me, probably because I'm so old, and stuck me in this place, which is barely better than living on the street.  At least I get food every now and then.\n\nLet me tell you my story.\n\nI have a guardian angel. I know most folks believe they do, but I've seen mine. I've interacted with it on many an occasion. In fact, she is part of my very first memory.\n\nWhen I was four, I lived with my family in a small house in the country next to a lake. My father had built a pier so he could easily dock his fishing boat. It was a small lake, but damn was it fun. There's nothing quite like having a large body of water to play in when you're a kid.\n\nNaturally, I was so young that I don't remember much of that time, but there is one thing I remember distinctly: my mother warning me against wandering too close to the lake alone. But, I just couldn't help myself. I loved the water and I loved to play in it even though I hadn't quite mastered swimming. The water itself was a gorgeous crystal-clear blue and you could almost see the bottom, not like this bullshit we have for lakes in this area. You can probably guess what happened next. I fell in when I was alone.\n\nNowadays it seems absurd to think a child could get that close to a lake without supervision, but this was the country and a very long time ago. Children were never watched closely in those days, it just wasn't necessary.\n\nI drowned that day. I know I drowned. I very much recall running out of breath as I flung around my arms and legs trying to reach the surface before everything faded to black.\n\nI woke lying on the shore with a strange woman looking down at me. This woman was very tall and wore a bright-white suit. In fact, I almost couldn't tell where one part of the suit ended and another part began, but I remember studying the tie and tracing its outline with my eyes. She was enchantingly beautiful. In fact, she is still the most beautiful thing I've ever seen in my entire life. Her face held a blank expression, a lack-of-emotion that I would get to know all too well, and as soon as I was coherent enough to pay attention, she told me, \"Do try to be more careful next time.\" I blinked and she was gone.\n\nThree years later, our house burned down for reasons I don't recall, if the reason was ever actually found in the first place. My mother, two brothers, and our three dogs did not survive. My father had taken me on our first hunting trip and, upon our return, we discovered the remains of our house with their charred bodies inside. I'd never felt such loss or horror. I can still see the way their bodies twisted together, huddled in the center of the common room as they were, a twisted mass of charred flesh. Even the dogs were in that pile.\n\nI still grieve for them despite the years.  Those seven years were the happiest of my life.  Father and I moved to the city after that. I don't think he could stand seeing any sort of nature, anymore, much preferring the paved streets and never-ending concrete of the city. He never stepped into the country again. We found a run-down old hotel apparently just awaiting destruction, and just kind of moved in.\n\nIt was a month after our move to the city the first time my father hit me, and I don't mean a spanking. He punched me straight in the face and sent me flying backward. We had no money, he had no job, he couldn't get a job, and what's worse, he wanted me to look for a job, as well. But even in those days, who would hire a seven-year-old? I had asked around every single day. He broke my nose that day despite my efforts.\n\nThe second time he hit me was the very next day. He got drunk, though I still don't know how he paid for the booze, and this time he was not content with just one punch. That was the second time I met my guardian angel. In my scramble to get away from my drunken, violent father, she appeared just outside the door I was heading toward and beckoned me to follow. I got up and ran.\n\nShe glided along, floating in front of me, always out of reach, leading me to where I did not know. The path I was led became etched in my mind (it still is, in fact), and it ended in a wide alleyway. She gestured toward some kind of small makeshift building in one corner and I moved in the direction she pointed. I turned around and she was gone.\n\nFour children emerged from the little building. They were all my age and they would become the best friends of my entire lifetime. Indeed, one of them even became my wife, but I haven't come to that part of the story, yet.\n\nThe beatings continued, but my sense of family and loyalty would not allow me to abandon him. I even found myself trying to help him in whatever way I could. I managed to find a factory job, and gave him literally all the small amount of money I made, which was barely enough to afford our rent.  He didn't feed me or love me.  He didn't offer me anything but beatings and disdain.\n\nIt was through his drunken and violent rants that I discovered that he blamed me for the house fire. If he hadn't taken me on that hunt, the house surely would not have burned down.\n\nFactory work was hard.  Actually, that's an understatement.  I worked 12 hours a day, every day, in a harsh environment, and was severely punished for the slightest transgression. If I was late, I was made to work naked for the entire day. If I didn't meet quota, I was weighted for an hour or more, which meant carrying a huge weight around my neck that I sure as hell couldn't hold up properly and then made to walk up and down an aisle for everyone to see. Beatings were common and they happened in front of everyone. Furthermore, injuries and even death were also common, often occurring weekly.\n\nMy friends took care of me, though.  They made sure I ate.  They begged me to stay in Camelot (our name for the little building we shared.) They were there for me no matter what. I miss them all terribly. Harry, Boulder, Chicken-leg, and Susan, my dearest Susan.  Boulder and Chicken-leg were hit by an automobile when I was 15.  I can hardly recall their real names.\n\nAs I had grown older, and what with the hard factory-work and all, I had also grown stronger. Strong enough to contend with my father. It was shortly after Boulder and Chicken-leg died that the incident happened. In fact, it was because of their deaths and my grief that I would not put up with my father any longer. He came at me that night in his drunken stupor looking to hurt me yet again, but I was having none of it, and I punched him square in the nose just like he had done to me eight years earlier. Only he fell down and did not get back up.\n\nThe guilt of killing my father still haunts me and it is only made worse by what I did next. I ran away. That was the third time I met my guardian angel. After the incident, I fled and found myself in the commercial district, crying my eyes out. She appeared next to an army recruitment center and gestured for me to come to her. I enlisted that day. I had to lie about my age, but what with the War seeming inevitable, they didn't question my lie.\n\nThe Great War began and I found myself in actual combat. I was not alone, however. Harry had joined after hearing that I did, and by some miracle, we were in the same company.\n\nI will not recount the horrors I experienced in the War. Just know that it was far worse than anything I had yet experienced, and clearly that is saying something considering everything I've just told you.\n\nHarry did not survive the war. He died in my arms, in fact. I do not wish to relive that event and will not say any more about it.\n\nThis is getting longer than I thought it would. I will give a shortened version of the remainder.\n\nThe fourth time I met my guardian angel was just after I had returned from the War. My state-of-mind was not well (they call it PTSD, now), and I did nothing but drink. One evening in which I wasn't completely shit-faced out my mind, my guardian angel appeared and, in the same manner as before, led me to a small restaurant just outside the city. It was where Susan worked.\n\nWe married six months later. I was wholeheartedly devoted to her, and damn it, I still am. She gave me four children, Harry, Steven, Elizabeth, and Catherine.\n\nWhen Harry was seven and Steven was four, Harry accidentally drowned Steven as they played in the bath. Four years later, he intentionally killed Elizabeth by punching her repeatedly during an argument. He was put in a mental facility where he died in an accident with a malfunctioning ECT machine.  Catherine died of cancer two years after that. Susan's grief was too much to bear and she committed suicide by blowing her own brains all over the wall with my .45.\n\nI attempted the same, but just before I pulled the trigger, my guardian angel appeared and that was the second time she had ever spoken to me. \"You have more to do in this life before it ends,\" she said to me. So I didn't pull the trigger that day.\n\nI attempted something of a normal life for a while, but there was nothing for me, so I tried to jump off the Golden Gate bridge.  I even made a special trip just to do it. Again, my guardian angel appeared to me and told me, \"It is not time to die, yet.\"\n\nTen more times I made an attempt to end my own life over the following years. She always appeared to tell me the same thing, \"It is not time to die, yet.\"\n\nEventually I didn't care what she had to say, anymore. I rarely had a job, rarely had a home, spent most of the time living on the street, was constantly sick with some chronic cough or some other ailment to which I would find no cure, and did horrible, horrible things to survive when I couldn't stand the hunger any longer, even at one point going so far as to whoring myself to men in a filthy public bathroom stall just for money to eat.  I stole regularly, lied to everyone I came across, and became everything I hated in the world.\n\nThe only possession remaining to me was the .45 my dear Susan had used to end her life. I had saved it just for this occasion. I didn't care what that damned beautiful bitch had to say anymore, and pulled the trigger with her standing right in front of me. Click. Nothing.\n\nShe smiled at me for the first time in my life, and it was not a welcoming smile, it was wholly evil. \"Tortured souls have the sweetest taste of all souls and the more ripe, the sweeter the taste, but the taste is ruined if they don't die naturally.\"\n\n[+](http://jasonclement.me/stories/)[+](https://www.facebook.com/jason.clement.wtf)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vddb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 228, "report_reasons": null, "author": "Contentiously", "saved": false, "mod_reports": [], "name": "t3_64vddb", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": true, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492015116.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/64vddb/i_have_a_guardian_angel/", "num_reports": null, "locked": false, "stickied": false, "created": 1491991428.0, "url": "https://www.reddit.com/r/nosleep/comments/64vddb/i_have_a_guardian_angel/", "author_flair_text": null, "quarantine": false, "title": "I Have a Guardian Angel", "created_utc": 1491962628.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 228}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg5hz2s", "gilded": 0, "archived": false, "score": 51, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_64vddb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Just because she is guarding you does not mean she is an angel OP. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just because she is guarding you does not mean she is an angel OP. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5hz2s", "score_hidden": false, "stickied": false, "created": 1492002057.0, "created_utc": 1491973257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 51}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg5o8r8", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "J_Valeska", "parent_id": "t3_64vddb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "If demons were once angels, as some people believe, it stands to reason that they'd look like angels.  Despite her beautiful appearance, I'm fairly confident that your \"guardian angel\" is a demon.  She sure acts like one.\n\n  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If demons were once angels, as some people believe, it stands to reason that they&amp;#39;d look like angels.  Despite her beautiful appearance, I&amp;#39;m fairly confident that your &amp;quot;guardian angel&amp;quot; is a demon.  She sure acts like one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5o8r8", "score_hidden": false, "stickied": false, "created": 1492018353.0, "created_utc": 1491989553.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg5i0cs", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "ScarXLXX", "parent_id": "t3_64vddb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That plot twist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That plot twist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5i0cs", "score_hidden": false, "stickied": false, "created": 1492002125.0, "created_utc": 1491973325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg625bp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64vddb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I knew something was up the way people close to you were dying off like flies", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I knew something was up the way people close to you were dying off like flies&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg625bp", "score_hidden": false, "stickied": false, "created": 1492041251.0, "created_utc": 1492012451.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg5x5xc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "superblobby", "parent_id": "t3_64vddb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Screw that demon angel, gosh what an arse", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Screw that demon angel, gosh what an arse&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5x5xc", "score_hidden": false, "stickied": false, "created": 1492035640.0, "created_utc": 1492006840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg661ll", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hongvanngh", "parent_id": "t1_dg5r429", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Well, I guess she like dry age food.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I guess she like dry age food.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg661ll", "score_hidden": false, "stickied": false, "created": 1492045349.0, "created_utc": 1492016549.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg61lr9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lastfirstborn1", "parent_id": "t1_dg5r429", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "If the \"angel\" is feeding off his suffering he might be stuck here two life times. Figuring out how old he is made it even creepier to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the &amp;quot;angel&amp;quot; is feeding off his suffering he might be stuck here two life times. Figuring out how old he is made it even creepier to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg61lr9", "score_hidden": false, "stickied": false, "created": 1492040656.0, "created_utc": 1492011856.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_64vddb", "likes": null, "replies": "", "user_reports": [], "id": "dg656b8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ErmaKeef", "parent_id": "t1_dg5r429", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Of course he's 118, his guardian angle is keeping him alive as long as she can", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course he&amp;#39;s 118, his guardian angle is keeping him alive as long as she can&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg656b8", "score_hidden": false, "stickied": false, "created": 1492044449.0, "created_utc": 1492015649.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5r429", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64vddb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg5r429", "score_hidden": false, "stickied": false, "created": 1492026235.0, "created_utc": 1491997435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]