[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I sleep long periods of time because of my heavy medication. This afternoon I woke up feeling groggy and disoriented. I had gone to bed around 10 PM last night and now... (I looked at my phone) it was 2 PM. I got up and showered, then I got dressed up and headed out the door so I could take out the trash and go to the grocery store while I&amp;#39;m at it. I took the elevator (I live on the 4th floor) and when it arrived to the ground floor things got confusing.&lt;/p&gt;\n\n&lt;p&gt;At first I noticed that many of my neighbors had gathered there and they were standing in the hallway looking even more confused than I did. Our apartment house is usually very quiet and I almost never see my neighbors in the hallways (especially not so many of them at the same time), so it was weird. I smiled politely as I passed through them and headed towards the front door. That&amp;#39;s when I noticed that the door wouldn&amp;#39;t budge. It&amp;#39;s a glass door so you can normally see outside, but now it was all covered up. The more I looked at it, I realized it had been barricaded from the outside with some kind of iron plates so it was impossible to get out. I stared at the doors in confusion.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Can I help you with something dear?&amp;quot; Mrs. Suarez (the middle aged woman who lives right next to me) had walked up to me. She seemed nice, I had talked to her few times. One time she even gave me a small Christmas present even though we don&amp;#39;t actually know each other. &amp;quot;T-the d-doors a-aren&amp;#39;t o-opening&amp;quot;, I stuttered as I felt how the anxiety started to build up in my chest. I have depression, panic disorder and an anxiety disorder, so I get nervous really easily and this unexpected situation had already made me feel claustrophobic as hell.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Maybe we should call someone&amp;quot;, said some young guy who had been lounging under the stairs with his girlfriend. I decided to call 911; I couldn&amp;#39;t believe this was really happening, and my hands were shaking so much I was barely able to hold the phone. The neighbors were shooting weird glances at each other and some of their eyes were glued into me while I was trying to make the phone call. It made me feel even more nervous.&lt;/p&gt;\n\n&lt;p&gt;The dialing tone kept playing for a while, then there was a faint static noise.&lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;H-hello?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Woman with a monotone voice spoke: &amp;quot;ALL OUR DISPATCHERS ARE TAKEN AT THE MOMENT DUE TO AN EMERGENGY SITUATION. IF YOU LIVE IN [my address] PLEASE STAY INSIDE YOUR APARTMENTS AND DON&amp;#39;T FLOOD THE EMERGENGY LINE. WE ARE GOING TO GIVE YOU MORE INFO LATER.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It was an automated voice message and I knew something was seriously wrong. Were we under some kind of an attack? Had the terrorists finally found our peaceful town? Or was there some kind of natural disaster going on?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What did they say?&amp;quot; A young woman who was holding her small dog in her arms asked me. The dog was probably a Shih Tzu and it seemed to be perfectly oblivious to the situation we were in.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It said that we should stay inside our apartments and they are going tell us more later.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Most of the people started to return to their apartments and a nervous chatter filled up the hallway. Going to my apartment wasn&amp;#39;t actually a bad idea: I hadn&amp;#39;t seen the sky because the doors were barricaded so no daylight got in. I didn&amp;#39;t know what was happening outside or what kind of weather it was. Maybe I could find out more if I went on my balcony to take a look outside.&lt;/p&gt;\n\n&lt;p&gt;I returned to my apartment and locked the door behind me. I took my lighter and a cigarette and opened the heavy curtains so I could access the balcony door. I stepped outside and looked at the sky: it was grey like it had been for the past few days, so nothing strange there. I took a sedative and lit up my cigarette to calm myself down. While I was puffing a cloud of smoke I looked down:&lt;/p&gt;\n\n&lt;p&gt;My balcony is facing a busy street so there&amp;#39;s usually lots of traffic going on. However, now there were no cars passing by. When I looked further away I noticed that someone had put up high fences so that no one could access or exit our street. There were few police cars here and there, and someone that looked like a construction worker was climbing a ladder towards the 2nd floor balcony. There were also two police officers standing in front of our apartment building, so I yelled at them asking what&amp;#39;s going on.&lt;/p&gt;\n\n&lt;p&gt;At first they looked like they weren&amp;#39;t going to answer, but then the other officer (who was a blonde tall man probably in his late 40&amp;#39;s) looked up and said to me: &amp;quot;Just step inside ma&amp;#39;am, everything is going to be just fine.&amp;quot; He tried to sound reassuring but I couldn&amp;#39;t trust him. My mind was full of questions.&lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;I want to know what&amp;#39;s happening here! I know this isn&amp;#39;t normal, the whole street is blocked and everything-&amp;quot; I was speaking really fast now.&lt;/p&gt;\n\n&lt;p&gt;The other officer was now looking at me too, but he simply told me to step inside. Apparently being on my balcony was now forbidden too. But I needed the air, so I stepped back from the railing so I was out of view. I sat on the balcony floor and finished my cigarette while I was listening to what was happening outside. I heard some drilling and hammering two floors below, and I realized they were sealing up the balconies as well! If I hadn&amp;#39;t taken the sedative before I would have felt a lot worse, but now I was only mildly anxious considering the circumstances.&lt;/p&gt;\n\n&lt;p&gt;As I said, the sedative started to take it&amp;#39;s toll on me, so I went to bed hoping that all this would be over by the time I wake up. Maybe it was all just a nightmare?&lt;/p&gt;\n\n&lt;p&gt;When I woke up the room around me was pitch black. For a moment I didn&amp;#39;t remember the situation I was in, but then it all came flooding back. I reached for my phone (which I always keep next to my pillow) and the time was 8 PM. I turned the lights on in my apartment and opened the curtains. What I saw made me almost choke: a huge, ugly wooden panel was now covering my balcony and I couldn&amp;#39;t see the night sky at all. I felt like I was running out of air in my small apartment.&lt;/p&gt;\n\n&lt;p&gt;Then I heard some commotion from the hallway, something was happening on my floor. I looked into the peep-hole and saw few of my neighbors in the hallway. They were standing in a circle and whatever they were looking at was causing them to snap at each other.&lt;/p&gt;\n\n&lt;p&gt;The young dog-owner woman screamed in panic: &amp;quot;She needs medical help! We have to find a way to get out!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(Someone was coughing like they were suffocating.)&lt;/p&gt;\n\n&lt;p&gt;A man probably in his late 30&amp;#39;s yelled back at her: &amp;quot;If this is something contagious we should all just stay the hell away from her. I don&amp;#39;t want my kids getting infected too!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now I was able to see what they were seeing: it was the nice middle-aged woman who was living right next to me. She was on her knees on the floor and her skin was covered in blisters. Her eyes were bleeding too.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Look, lets get her in her apartment so she doesn&amp;#39;t scare the others. And if it&amp;#39;s something that can infect us all, it&amp;#39;s better we avoid her for now. Can you walk, Mrs. Suarez?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Mrs. Suarez opened her mouth, but instead of words she vomited a big pile of something black in front of her. The floor underneath the black liquid started to sizzle causing the other neighbors to jump back.&lt;/p&gt;\n\n&lt;p&gt;A teenage girl screamed: &amp;quot;Shit, there&amp;#39;s no point in helping her now, she&amp;#39;s dead anyway!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;All the neighbors were about to leave when something awful happened, something that you can&amp;#39;t believe unless you see it in your own eyes.&lt;/p&gt;\n\n&lt;p&gt;Mrs. Suarez, who used to be really sweet, started to crawl on all fours towards the crowd. People tried to back away and they also told her not to come any closer. She didn&amp;#39;t listen though: that black gooey slime was still dripping from the corners of her mouth and her eyes (including the whites) had turned grey and they had no pupils. She kept her dead eyes fixed on the crowd while she growled like a rabid animal.&lt;/p&gt;\n\n&lt;p&gt;Her movements were inhumanely fast too: next thing I knew she jumped on top of the man who had been worried about his own kids.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Get off of me you crazy bitch!&amp;quot; the man shouted but Mrs. Suarez sank her teeth deep into his neck. Everyone was screaming and the man tried to shake her off, but she wouldn&amp;#39;t let go. Instead she shook her head violently so she could tear off his flesh even more effectively.&lt;/p&gt;\n\n&lt;p&gt;Screams of agony and terror echoed in the hallway.&lt;/p&gt;\n\n&lt;p&gt;Finally one of the neighbors was able to tear her away from him, but it was already late: the man who had been bitten had a huge gash on his neck and he was gurgling and choking on his own blood.&lt;/p&gt;\n\n&lt;p&gt;I was too shocked to even make a sound. I stood there paralyzed looking at the horrible scene. The hallway that usually looked grey and clinical was now covered in blood and black.&lt;/p&gt;\n\n&lt;p&gt;Mrs. Suarez was still struggling while one of the neighbors was holding her, and she spat that dark slime all over the place. The struggle was already taking it&amp;#39;s toll on the young Afro-American man who was trying to keep her from hurting the others. (He was sweating like crazy.) Then there was a sickening &amp;quot;crunch&amp;quot;, and Mrs. Suarez&amp;#39;s body went limb and she fell to the floor. The young man had snapped her neck. She was dead.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I-I wasn&amp;#39;t even holding her that hard! You saw it, right?! It was an accident!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It wasn&amp;#39;t your fault, she was already dying and you protected us&amp;quot;, the dog-owner said. (I was glad her dog was somewhere else.)&lt;/p&gt;\n\n&lt;p&gt;The neighbors agreed to drag Mrs. Suarez and the man she had killed into her apartment, so their bodies wouldn&amp;#39;t cause more panic. I could hear their nervous whispering while they were dragging the bodies:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Are we going to die too? You saw what happened to her!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I think we&amp;#39;re safe as long as we don&amp;#39;t get into contact with her blood or that... whatever that black slime is.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Should we tell other neighbors what happened?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(They started cleaning up the floor.)&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Better not. They are already scared as it is and something like this could make us all turn against each other.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;When they finished cleaning up the floor they all went back into their own apartments and now it&amp;#39;s dead silent in the hallway. It feels so surreal to thInk that there are two dead bodies in the apartment next to Me, right behind my living room wall.&lt;/p&gt;\n\n&lt;p&gt;The thought itself Made me nauseous and I actually had to throw up. Now it&amp;#39;s 09:34 PM and I&amp;#39;m still sitting on my bathroom floor, still shaking. I took Another sedative though so I shoulD be &amp;quot;okay&amp;quot; soon.&lt;/p&gt;\n\n&lt;p&gt;I have tried to call my friends and family but they&amp;#39;re not answering. I hear the dial tone but whomever I call there&amp;#39;s no answer. The internet is super slow too, but reddit seems to load pretty fast. I&amp;#39;m not sure if I&amp;#39;m able to post this but if it works, please help me. I don&amp;#39;t know what to do or how to get out.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;UPDATE:&lt;/strong&gt; Thank you for all the tips and encouragement. I didn&amp;#39;t have the items for making that bomb but I have my biggest and sharpest kitchen knife with me. (And I also found something much better, which you&amp;#39;ll find out as you read further.) &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t get to internet because the pages aren&amp;#39;t working. For now reddit is the only place where I can go. And unfortunately I don&amp;#39;t have a tv either, so I can&amp;#39;t watch news. (I watch all my favorite series on my computer, but now I can&amp;#39;t do that either and it sucks. Not that I could focus on them anyway...) &lt;/p&gt;\n\n&lt;p&gt;I pushed my couch against the door and then I placed some chairs and other stuff on the couch, so the whole door was covered behind my furniture. After that I let myself soak in a hot bath until my skin was all wrinkled, and when I got out of the bath I checked myself for blisters or any other skin ailments. I have a terrible fear of death and all my life I&amp;#39;ve been scared of diseases, so you can probably imagine how this situation didn&amp;#39;t particularly make me jump for joy... &lt;/p&gt;\n\n&lt;p&gt;I looked into the mirror and I noticed my eyes were blank too, almost like Mrs. Suarez&amp;#39;s. They were brown though and they still had pupils, but it was a thousand yard stare. I had had it for some time now, even before these things started happening.  My dark hair was up in a messy bun and my eye bags made me look older than I really was. (Btw I&amp;#39;m a 27 yrs old female if anyone cares to know.) I sighed as I left the bathroom. &lt;/p&gt;\n\n&lt;p&gt;There were no noticeable signs of illness yet, but my throat felt a bit sore and I needed to cough a little. I&amp;#39;m a chain smoker these days, so I hoped it was just the cigarettes doing their job, not the horrible virus that had just killed my neighbor. The way her neck snapped all of a sudden made me realize that this virus destroys people&amp;#39;s bodies so rapidly that the bones become weak like ice fields during the spring. I know that guy didn&amp;#39;t kill Mrs. Suarez - she was already half-dead when she started attacking them. That&amp;#39;s what makes it even more terrifying, it looked like something from a horror movie. &lt;/p&gt;\n\n&lt;p&gt;I still had some beers left in bridge, so I took them and my cigarettes and went to my balcony. Even though it was now sealed shut I still enjoyed the crisp air that was blowing through these wooden boards. I sat on the floor and started listening to some music I had saved on my phone. Those cold beers and good songs lifted up my spirits a little, but they also made remember the times when I still had fun parties on my balcony. My boyfriend had left me a month ago and after that there was just me and my beers. I didn&amp;#39;t meet my friends or family anymore, because I was too sad to do or say anything, but right now I missed everyone. I wanted to know how my mom was doing and if my sister and her kids were okay. I hoped that whatever was happening here hadn&amp;#39;t spread further. &lt;/p&gt;\n\n&lt;p&gt;I was half-way through listening to &lt;em&gt;A National Acrobat&lt;/em&gt; by Black Sabbath, when my doorbell rang and it got me so startled that I almost dropped my beer. Who could it be? Had someone finally come to rescue us? My heart was pounding as I tiptoed towards the door while clutching the knife in my hand. Now there was knocking too and it sounded urgent, almost demanding. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Open the door!&amp;quot; It was a female voice.&lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;Uh... Who is it?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s your neighbor, Jessica from the 3rd floor. My husband Jack is missing!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now I remembered who she was. She had three kids and she lived with her husband, I would sometimes see them on the parking lot when they were about to go somewhere together. I stopped in my tracks when I realized who Jack was: he was the same man who&amp;#39;s throat was ripped to pieces right before my eyes.&lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;About that... I&amp;#39;m afraid he&amp;#39;s gone. I&amp;#39;m so sorry. One of our neighbors attacked him and-&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Jessica: &amp;quot;What? No, there has to be a mistake. Come outside, you have to help me find him!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;Listen lady, I prefer to stay inside and you too should stay with your kids.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;(There was a long silence.)&lt;/p&gt;\n\n&lt;p&gt;I moved some stuff away from the couch so I could climb on it and look into the peep-hole. Jessica was standing in the hallway, with her messy mahogany curls dangling on her face. I guess she wasn&amp;#39;t interested in her hair in a time like this. Who could blame her? She had just lost her husband and the rest of the family was in danger too. \nApparently she was thinking the same thing, because her shoulders started to twitch as if she was crying. &lt;/p&gt;\n\n&lt;p&gt;Jessica: &amp;quot;They&amp;#39;re sick too. Oh we are all sick...&amp;quot; She collapsed on the floor and wailed so helplessly that I almost wanted to open the door, but something told me I not to.&lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;I&amp;#39;m terribly sorry but I really can&amp;#39;t do anything for you. Please, go back to your kids, they need you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Jessica: &amp;quot;They&amp;#39;re dead... I saw them... Oh god, please help me!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I took a break from observing the hallway and leaned my back on the door. I let out a long sigh as I was going through the situation in my head. I had this nagging feeling that I really shouldn&amp;#39;t open the door but at the same time I felt really bad for her and her kids. &lt;/p&gt;\n\n&lt;p&gt;But if the kids were dead, the whole family must have been infected already. Including Jessica, even if she didn&amp;#39;t know it yet. &lt;/p&gt;\n\n&lt;p&gt;I hadn&amp;#39;t heard anything from behind the door in a while, so I looked into the peep-hole to see if she was gone. She was still there alright, and what I saw made me realize that the ominous feeling I had, was there for a reason: she started to breathe heavily and when she stood up, her shoulders dislocated &lt;em&gt;themselves&lt;/em&gt; and her backbones snapped in an inhumane way. &lt;/p&gt;\n\n&lt;p&gt;She tilted her head and her long hair fell to the side now revealing her face. It had turned grey and the skin looked like it was falling off.  Her ears, eyes and nose were bleeding but she was smiling like a maniac. When she took a step towards my door her movements looked unnatural and awkward, like she didn&amp;#39;t remember how to walk anymore. &lt;/p&gt;\n\n&lt;p&gt;I let out a scream when she leaped against my door. I knew she couldn&amp;#39;t see me, but one of her grey eyes was now pressed right against the peep-hole. I stumbled backwards and almost fell from the couch. The door was shaking as she jumped against it again and again. I held the knife in my hand hoping that I wouldn&amp;#39;t have to use it and that the door would be strong enough to keep her outside. &lt;/p&gt;\n\n&lt;p&gt;The mail slot started to jiggle and I assumed Jessica tried to reach for me from there. The couch was blocking the mail slot, so luckily she couldn&amp;#39;t get her hand through it. Then it stopped and I started to hear some rustling noise, like she was walking or dragging her feet across the hallway. I looked into the peep-hole again and saw her walking towards the stairs. It was as if she knew what I was doing: just when I thought she had given up, she turned her head and stared at my door. She was standing still, swaying a little. Just staring. &lt;/p&gt;\n\n&lt;p&gt;I could hear my heart in my ears now. &lt;/p&gt;\n\n&lt;p&gt;She ran towards my door and threw herself against it. The door shook so violently that it almost knocked me back. Then she started to vomit and I swear, she aimed that black shit right at my door &lt;em&gt;on purpose.&lt;/em&gt; I heard the sizzling noise again, and I was worried that the door would melt away at any moment. &lt;/p&gt;\n\n&lt;p&gt;I jumped off from the couch and started piling chairs and everything I could find against the door. Then I locked myself in the bathroom, squeezing the knife in my hand so tightly that my knuckles turned white. Jessica - or whatever was left of her - kept pounding on the front door while shrieking like a banshee. My ears were ringing and I was already bracing myself for the moment when the door breaks and she gets inside my apartment. I knew I would probably get torn to pieces before I even get a chance to fight. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what was going through my mind when a loud explosion interrupted my thoughts. It came from the hallway, but thanks to some miracle my door was still intact. I hearD someone walking outside my door, then there was a voice: &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Is there sOmeone iNside? It&amp;#39;s safe now. My name&amp;#39;s Liam and I&amp;#39;m from the 5Th floor.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I left the bathroom, still shaking. Sure enough there was a guY, probably same age as me, standing next tO Jessica&amp;#39;s corpse. There was a hUge puddle of blood and her brain had Splattered all over the walls. This guy had vibrant green eyEs and short sandy blonde hair. I also noticed he had a handgun tucked in betwEen the holster and his pants. &lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;How do I know you&amp;#39;re not infected?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Liam: (rolls up his sleeves, then lifts his shirt and spins around.) &amp;quot;Look, no blisters. Can you open the door?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For some reason I trusted him, so I removed all the furniture and quickly let him in. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s now 06:41 AM and we have been preparing ourselves for getting out of here alive. Liam seems to know a lot about this stuff and I feel like he&amp;#39;s my only hope right now. We are taking turns sleeping so we can get some rest and stay vigilant at the same time. Liam just woke up, so it&amp;#39;s my turn to get some shuteye now. I will update again when I can!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/65gnkk/lockdown_part_2/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sometimes I sleep long periods of time because of my heavy medication. This afternoon I woke up feeling groggy and disoriented. I had gone to bed around 10 PM last night and now... (I looked at my phone) it was 2 PM. I got up and showered, then I got dressed up and headed out the door so I could take out the trash and go to the grocery store while I'm at it. I took the elevator (I live on the 4th floor) and when it arrived to the ground floor things got confusing.\n\nAt first I noticed that many of my neighbors had gathered there and they were standing in the hallway looking even more confused than I did. Our apartment house is usually very quiet and I almost never see my neighbors in the hallways (especially not so many of them at the same time), so it was weird. I smiled politely as I passed through them and headed towards the front door. That's when I noticed that the door wouldn't budge. It's a glass door so you can normally see outside, but now it was all covered up. The more I looked at it, I realized it had been barricaded from the outside with some kind of iron plates so it was impossible to get out. I stared at the doors in confusion.\n\n\"Can I help you with something dear?\" Mrs. Suarez (the middle aged woman who lives right next to me) had walked up to me. She seemed nice, I had talked to her few times. One time she even gave me a small Christmas present even though we don't actually know each other. \"T-the d-doors a-aren't o-opening\", I stuttered as I felt how the anxiety started to build up in my chest. I have depression, panic disorder and an anxiety disorder, so I get nervous really easily and this unexpected situation had already made me feel claustrophobic as hell.\n\n\"Maybe we should call someone\", said some young guy who had been lounging under the stairs with his girlfriend. I decided to call 911; I couldn't believe this was really happening, and my hands were shaking so much I was barely able to hold the phone. The neighbors were shooting weird glances at each other and some of their eyes were glued into me while I was trying to make the phone call. It made me feel even more nervous.\n\nThe dialing tone kept playing for a while, then there was a faint static noise.\n\nMe: \"H-hello?\"\n\nWoman with a monotone voice spoke: \"ALL OUR DISPATCHERS ARE TAKEN AT THE MOMENT DUE TO AN EMERGENGY SITUATION. IF YOU LIVE IN [my address] PLEASE STAY INSIDE YOUR APARTMENTS AND DON'T FLOOD THE EMERGENGY LINE. WE ARE GOING TO GIVE YOU MORE INFO LATER.\"\n\nIt was an automated voice message and I knew something was seriously wrong. Were we under some kind of an attack? Had the terrorists finally found our peaceful town? Or was there some kind of natural disaster going on?\n\n\"What did they say?\" A young woman who was holding her small dog in her arms asked me. The dog was probably a Shih Tzu and it seemed to be perfectly oblivious to the situation we were in.\n\n\"It said that we should stay inside our apartments and they are going tell us more later.\"\n\nMost of the people started to return to their apartments and a nervous chatter filled up the hallway. Going to my apartment wasn't actually a bad idea: I hadn't seen the sky because the doors were barricaded so no daylight got in. I didn't know what was happening outside or what kind of weather it was. Maybe I could find out more if I went on my balcony to take a look outside.\n\nI returned to my apartment and locked the door behind me. I took my lighter and a cigarette and opened the heavy curtains so I could access the balcony door. I stepped outside and looked at the sky: it was grey like it had been for the past few days, so nothing strange there. I took a sedative and lit up my cigarette to calm myself down. While I was puffing a cloud of smoke I looked down:\n\nMy balcony is facing a busy street so there's usually lots of traffic going on. However, now there were no cars passing by. When I looked further away I noticed that someone had put up high fences so that no one could access or exit our street. There were few police cars here and there, and someone that looked like a construction worker was climbing a ladder towards the 2nd floor balcony. There were also two police officers standing in front of our apartment building, so I yelled at them asking what's going on.\n\nAt first they looked like they weren't going to answer, but then the other officer (who was a blonde tall man probably in his late 40's) looked up and said to me: \"Just step inside ma'am, everything is going to be just fine.\" He tried to sound reassuring but I couldn't trust him. My mind was full of questions.\n\nMe: \"I want to know what's happening here! I know this isn't normal, the whole street is blocked and everything-\" I was speaking really fast now.\n\nThe other officer was now looking at me too, but he simply told me to step inside. Apparently being on my balcony was now forbidden too. But I needed the air, so I stepped back from the railing so I was out of view. I sat on the balcony floor and finished my cigarette while I was listening to what was happening outside. I heard some drilling and hammering two floors below, and I realized they were sealing up the balconies as well! If I hadn't taken the sedative before I would have felt a lot worse, but now I was only mildly anxious considering the circumstances.\n\nAs I said, the sedative started to take it's toll on me, so I went to bed hoping that all this would be over by the time I wake up. Maybe it was all just a nightmare?\n\nWhen I woke up the room around me was pitch black. For a moment I didn't remember the situation I was in, but then it all came flooding back. I reached for my phone (which I always keep next to my pillow) and the time was 8 PM. I turned the lights on in my apartment and opened the curtains. What I saw made me almost choke: a huge, ugly wooden panel was now covering my balcony and I couldn't see the night sky at all. I felt like I was running out of air in my small apartment.\n\nThen I heard some commotion from the hallway, something was happening on my floor. I looked into the peep-hole and saw few of my neighbors in the hallway. They were standing in a circle and whatever they were looking at was causing them to snap at each other.\n\nThe young dog-owner woman screamed in panic: \"She needs medical help! We have to find a way to get out!\"\n\n(Someone was coughing like they were suffocating.)\n\nA man probably in his late 30's yelled back at her: \"If this is something contagious we should all just stay the hell away from her. I don't want my kids getting infected too!\"\n\nNow I was able to see what they were seeing: it was the nice middle-aged woman who was living right next to me. She was on her knees on the floor and her skin was covered in blisters. Her eyes were bleeding too.\n\n\"Look, lets get her in her apartment so she doesn't scare the others. And if it's something that can infect us all, it's better we avoid her for now. Can you walk, Mrs. Suarez?\"\n\nMrs. Suarez opened her mouth, but instead of words she vomited a big pile of something black in front of her. The floor underneath the black liquid started to sizzle causing the other neighbors to jump back.\n\nA teenage girl screamed: \"Shit, there's no point in helping her now, she's dead anyway!\"\n\nAll the neighbors were about to leave when something awful happened, something that you can't believe unless you see it in your own eyes.\n\nMrs. Suarez, who used to be really sweet, started to crawl on all fours towards the crowd. People tried to back away and they also told her not to come any closer. She didn't listen though: that black gooey slime was still dripping from the corners of her mouth and her eyes (including the whites) had turned grey and they had no pupils. She kept her dead eyes fixed on the crowd while she growled like a rabid animal.\n\nHer movements were inhumanely fast too: next thing I knew she jumped on top of the man who had been worried about his own kids.\n\n\"Get off of me you crazy bitch!\" the man shouted but Mrs. Suarez sank her teeth deep into his neck. Everyone was screaming and the man tried to shake her off, but she wouldn't let go. Instead she shook her head violently so she could tear off his flesh even more effectively.\n\nScreams of agony and terror echoed in the hallway.\n\nFinally one of the neighbors was able to tear her away from him, but it was already late: the man who had been bitten had a huge gash on his neck and he was gurgling and choking on his own blood.\n\nI was too shocked to even make a sound. I stood there paralyzed looking at the horrible scene. The hallway that usually looked grey and clinical was now covered in blood and black.\n\nMrs. Suarez was still struggling while one of the neighbors was holding her, and she spat that dark slime all over the place. The struggle was already taking it's toll on the young Afro-American man who was trying to keep her from hurting the others. (He was sweating like crazy.) Then there was a sickening \"crunch\", and Mrs. Suarez's body went limb and she fell to the floor. The young man had snapped her neck. She was dead.\n\n\"I-I wasn't even holding her that hard! You saw it, right?! It was an accident!\"\n\n\"It wasn't your fault, she was already dying and you protected us\", the dog-owner said. (I was glad her dog was somewhere else.)\n\nThe neighbors agreed to drag Mrs. Suarez and the man she had killed into her apartment, so their bodies wouldn't cause more panic. I could hear their nervous whispering while they were dragging the bodies:\n\n\"Are we going to die too? You saw what happened to her!\"\n\n\"I think we're safe as long as we don't get into contact with her blood or that... whatever that black slime is.\"\n\n\"Should we tell other neighbors what happened?\"\n\n(They started cleaning up the floor.)\n\n\"Better not. They are already scared as it is and something like this could make us all turn against each other.\"\n\nWhen they finished cleaning up the floor they all went back into their own apartments and now it's dead silent in the hallway. It feels so surreal to thInk that there are two dead bodies in the apartment next to Me, right behind my living room wall.\n\nThe thought itself Made me nauseous and I actually had to throw up. Now it's 09:34 PM and I'm still sitting on my bathroom floor, still shaking. I took Another sedative though so I shoulD be \"okay\" soon.\n\nI have tried to call my friends and family but they're not answering. I hear the dial tone but whomever I call there's no answer. The internet is super slow too, but reddit seems to load pretty fast. I'm not sure if I'm able to post this but if it works, please help me. I don't know what to do or how to get out.\n\n\n-----------------------------------------------------------------------------------------------\n\n\n**UPDATE:** Thank you for all the tips and encouragement. I didn't have the items for making that bomb but I have my biggest and sharpest kitchen knife with me. (And I also found something much better, which you'll find out as you read further.) \n\n\nI can't get to internet because the pages aren't working. For now reddit is the only place where I can go. And unfortunately I don't have a tv either, so I can't watch news. (I watch all my favorite series on my computer, but now I can't do that either and it sucks. Not that I could focus on them anyway...) \n\n\nI pushed my couch against the door and then I placed some chairs and other stuff on the couch, so the whole door was covered behind my furniture. After that I let myself soak in a hot bath until my skin was all wrinkled, and when I got out of the bath I checked myself for blisters or any other skin ailments. I have a terrible fear of death and all my life I've been scared of diseases, so you can probably imagine how this situation didn't particularly make me jump for joy... \n\n\nI looked into the mirror and I noticed my eyes were blank too, almost like Mrs. Suarez's. They were brown though and they still had pupils, but it was a thousand yard stare. I had had it for some time now, even before these things started happening.  My dark hair was up in a messy bun and my eye bags made me look older than I really was. (Btw I'm a 27 yrs old female if anyone cares to know.) I sighed as I left the bathroom. \n\n\nThere were no noticeable signs of illness yet, but my throat felt a bit sore and I needed to cough a little. I'm a chain smoker these days, so I hoped it was just the cigarettes doing their job, not the horrible virus that had just killed my neighbor. The way her neck snapped all of a sudden made me realize that this virus destroys people's bodies so rapidly that the bones become weak like ice fields during the spring. I know that guy didn't kill Mrs. Suarez - she was already half-dead when she started attacking them. That's what makes it even more terrifying, it looked like something from a horror movie. \n\n\nI still had some beers left in bridge, so I took them and my cigarettes and went to my balcony. Even though it was now sealed shut I still enjoyed the crisp air that was blowing through these wooden boards. I sat on the floor and started listening to some music I had saved on my phone. Those cold beers and good songs lifted up my spirits a little, but they also made remember the times when I still had fun parties on my balcony. My boyfriend had left me a month ago and after that there was just me and my beers. I didn't meet my friends or family anymore, because I was too sad to do or say anything, but right now I missed everyone. I wanted to know how my mom was doing and if my sister and her kids were okay. I hoped that whatever was happening here hadn't spread further. \n\n\nI was half-way through listening to *A National Acrobat* by Black Sabbath, when my doorbell rang and it got me so startled that I almost dropped my beer. Who could it be? Had someone finally come to rescue us? My heart was pounding as I tiptoed towards the door while clutching the knife in my hand. Now there was knocking too and it sounded urgent, almost demanding. \n\n\n\"Open the door!\" It was a female voice.\n\nMe: \"Uh... Who is it?\" \n\n\"It's your neighbor, Jessica from the 3rd floor. My husband Jack is missing!\"\n\n\nNow I remembered who she was. She had three kids and she lived with her husband, I would sometimes see them on the parking lot when they were about to go somewhere together. I stopped in my tracks when I realized who Jack was: he was the same man who's throat was ripped to pieces right before my eyes.\n\n\nMe: \"About that... I'm afraid he's gone. I'm so sorry. One of our neighbors attacked him and-\" \n\nJessica: \"What? No, there has to be a mistake. Come outside, you have to help me find him!\"\n\nMe: \"Listen lady, I prefer to stay inside and you too should stay with your kids.\" \n\n(There was a long silence.)\n\n\nI moved some stuff away from the couch so I could climb on it and look into the peep-hole. Jessica was standing in the hallway, with her messy mahogany curls dangling on her face. I guess she wasn't interested in her hair in a time like this. Who could blame her? She had just lost her husband and the rest of the family was in danger too. \nApparently she was thinking the same thing, because her shoulders started to twitch as if she was crying. \n\n\nJessica: \"They're sick too. Oh we are all sick...\" She collapsed on the floor and wailed so helplessly that I almost wanted to open the door, but something told me I not to.\n\nMe: \"I'm terribly sorry but I really can't do anything for you. Please, go back to your kids, they need you.\"\n\nJessica: \"They're dead... I saw them... Oh god, please help me!\"\n\n\nI took a break from observing the hallway and leaned my back on the door. I let out a long sigh as I was going through the situation in my head. I had this nagging feeling that I really shouldn't open the door but at the same time I felt really bad for her and her kids. \n\n\nBut if the kids were dead, the whole family must have been infected already. Including Jessica, even if she didn't know it yet. \n\n\nI hadn't heard anything from behind the door in a while, so I looked into the peep-hole to see if she was gone. She was still there alright, and what I saw made me realize that the ominous feeling I had, was there for a reason: she started to breathe heavily and when she stood up, her shoulders dislocated *themselves* and her backbones snapped in an inhumane way. \n\n\nShe tilted her head and her long hair fell to the side now revealing her face. It had turned grey and the skin looked like it was falling off.  Her ears, eyes and nose were bleeding but she was smiling like a maniac. When she took a step towards my door her movements looked unnatural and awkward, like she didn't remember how to walk anymore. \n\n\nI let out a scream when she leaped against my door. I knew she couldn't see me, but one of her grey eyes was now pressed right against the peep-hole. I stumbled backwards and almost fell from the couch. The door was shaking as she jumped against it again and again. I held the knife in my hand hoping that I wouldn't have to use it and that the door would be strong enough to keep her outside. \n\n\nThe mail slot started to jiggle and I assumed Jessica tried to reach for me from there. The couch was blocking the mail slot, so luckily she couldn't get her hand through it. Then it stopped and I started to hear some rustling noise, like she was walking or dragging her feet across the hallway. I looked into the peep-hole again and saw her walking towards the stairs. It was as if she knew what I was doing: just when I thought she had given up, she turned her head and stared at my door. She was standing still, swaying a little. Just staring. \n\nI could hear my heart in my ears now. \n\n\nShe ran towards my door and threw herself against it. The door shook so violently that it almost knocked me back. Then she started to vomit and I swear, she aimed that black shit right at my door *on purpose.* I heard the sizzling noise again, and I was worried that the door would melt away at any moment. \n\n\nI jumped off from the couch and started piling chairs and everything I could find against the door. Then I locked myself in the bathroom, squeezing the knife in my hand so tightly that my knuckles turned white. Jessica - or whatever was left of her - kept pounding on the front door while shrieking like a banshee. My ears were ringing and I was already bracing myself for the moment when the door breaks and she gets inside my apartment. I knew I would probably get torn to pieces before I even get a chance to fight. \n\n\nThat's what was going through my mind when a loud explosion interrupted my thoughts. It came from the hallway, but thanks to some miracle my door was still intact. I hearD someone walking outside my door, then there was a voice: \n\n\n\"Is there sOmeone iNside? It's safe now. My name's Liam and I'm from the 5Th floor.\"\n\n \nI left the bathroom, still shaking. Sure enough there was a guY, probably same age as me, standing next tO Jessica's corpse. There was a hUge puddle of blood and her brain had Splattered all over the walls. This guy had vibrant green eyEs and short sandy blonde hair. I also noticed he had a handgun tucked in betwEen the holster and his pants. \n\n\nMe: \"How do I know you're not infected?\"\n\nLiam: (rolls up his sleeves, then lifts his shirt and spins around.) \"Look, no blisters. Can you open the door?\"\n\nFor some reason I trusted him, so I removed all the furniture and quickly let him in. \n\n\nIt's now 06:41 AM and we have been preparing ourselves for getting out of here alive. Liam seems to know a lot about this stuff and I feel like he's my only hope right now. We are taking turns sleeping so we can get some rest and stay vigilant at the same time. Liam just woke up, so it's my turn to get some shuteye now. I will update again when I can!\n\n[Part 2](https://www.reddit.com/r/nosleep/comments/65gnkk/lockdown_part_2/)\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6513by", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 438, "report_reasons": null, "author": "lucifers_pet", "saved": false, "mod_reports": [], "name": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492221894.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/6513by/lockdown/", "num_reports": null, "locked": false, "stickied": false, "created": 1492060746.0, "url": "https://www.reddit.com/r/nosleep/comments/6513by/lockdown/", "author_flair_text": null, "quarantine": false, "title": "Lock-down", "created_utc": 1492031946.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 44, "visited": false, "subreddit_type": "public", "ups": 438}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg7p2mw", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Axamili", "parent_id": "t1_dg7jg15", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Same, curious what is next", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same, curious what is next&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7p2mw", "score_hidden": false, "stickied": false, "created": 1492125746.0, "created_utc": 1492096946.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jg15", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ChasteFunAccount", "parent_id": "t1_dg77nww", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I caught that too. :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I caught that too. :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7jg15", "score_hidden": false, "stickied": false, "created": 1492119040.0, "created_utc": 1492090240.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dgcrk2r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "slumberwonder", "parent_id": "t1_dg77nww", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yes. Not sure if OP should stop her meds to keep her wits about her; or increase them to manage potential psychosis. OP, who is prescribing your meds? Have you been hospitalized?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Not sure if OP should stop her meds to keep her wits about her; or increase them to manage potential psychosis. OP, who is prescribing your meds? Have you been hospitalized?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcrk2r", "score_hidden": false, "stickied": false, "created": 1492414737.0, "created_utc": 1492385937.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77nww", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "morganethielen", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\" I'M MAD, DON'T YOU SEE?\"\nDoes this mean it's all in your head?!? Not sure if zombies or insanity would be worse. Either way, good luck OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot; I&amp;#39;M MAD, DON&amp;#39;T YOU SEE?&amp;quot;\nDoes this mean it&amp;#39;s all in your head?!? Not sure if zombies or insanity would be worse. Either way, good luck OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg77nww", "score_hidden": false, "stickied": false, "created": 1492091083.0, "created_utc": 1492062283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg914ie", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RoseDaCake", "parent_id": "t1_dg6xeft", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lmao same. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lmao same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg914ie", "score_hidden": false, "stickied": false, "created": 1492198747.0, "created_utc": 1492169947.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xeft", "gilded": 0, "archived": false, "score": 59, "report_reasons": null, "author": "amorfati37", "parent_id": "t1_dg6wzyq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I wanna be with you when the zombie apocalypse happens", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wanna be with you when the zombie apocalypse happens&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6xeft", "score_hidden": false, "stickied": false, "created": 1492076011.0, "created_utc": 1492047211.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 59}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg9qh5v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Matt463789", "parent_id": "t1_dg7bojh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Combine the knife and a broom shaft to make a spear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Combine the knife and a broom shaft to make a spear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9qh5v", "score_hidden": false, "stickied": false, "created": 1492231960.0, "created_utc": 1492203160.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bojh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t1_dg7a2dl", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Hopefully applying the exposed end of the electrical cord to the doorknob when they attempt a breech will kill one of them but after that the breakers will shut down the electricity. I do not feel OP will fare well against them with a knife by itself but spraying lye in their face may blind them. If OP is then able to stab them properly then they may die. Without knowing OP's threshold for getting close in to effect a kill or the capabilities of the zombie creatures it's difficult to know exactly how to advise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hopefully applying the exposed end of the electrical cord to the doorknob when they attempt a breech will kill one of them but after that the breakers will shut down the electricity. I do not feel OP will fare well against them with a knife by itself but spraying lye in their face may blind them. If OP is then able to stab them properly then they may die. Without knowing OP&amp;#39;s threshold for getting close in to effect a kill or the capabilities of the zombie creatures it&amp;#39;s difficult to know exactly how to advise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7bojh", "score_hidden": false, "stickied": false, "created": 1492101728.0, "created_utc": 1492072928.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7a2dl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "choijason", "parent_id": "t1_dg73ur7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The problem is it seems that these 'zombies' also have a short-range projectile of their own. On top of that, these aren't your normal zombies, they're shown to be inhumanly fast and strong. I doubt that a 20 second+ reaction weapon and a knife will be enough. Hm...I would rather stick with Liam with the firearm, and guard his back with a two-handed weapon, preferably a bat. Golf clubs aren't recommended because they tend to break easily after a few hits. Basically what you need to do is act as a guard to Liam's back with a weapon capable of at least stunning the adversary with long reach ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is it seems that these &amp;#39;zombies&amp;#39; also have a short-range projectile of their own. On top of that, these aren&amp;#39;t your normal zombies, they&amp;#39;re shown to be inhumanly fast and strong. I doubt that a 20 second+ reaction weapon and a knife will be enough. Hm...I would rather stick with Liam with the firearm, and guard his back with a two-handed weapon, preferably a bat. Golf clubs aren&amp;#39;t recommended because they tend to break easily after a few hits. Basically what you need to do is act as a guard to Liam&amp;#39;s back with a weapon capable of at least stunning the adversary with long reach &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7a2dl", "score_hidden": false, "stickied": false, "created": 1492097014.0, "created_utc": 1492068214.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73ur7", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t1_dg72q12", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I think you make good points and a knife would certainly inflict lethal injuries, however, with the type of attacker OP describes I believe disabling it initially with the lye Cannon first and then going close in with a knife and jabbing instead of slashing would be better. It's always been my assumption that the average person is not mentally outfitted for the dirty work of close in knife fighting. Working in an ER I can tell you the overwhelming majority of knife fights I see end up with slashing lacerations that are far less than lethal and not the multiple straight in stab wounds needed to kill. A knife can be one of the most lethal weapons there is but only in the right hands.", "edited": 1492063918.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you make good points and a knife would certainly inflict lethal injuries, however, with the type of attacker OP describes I believe disabling it initially with the lye Cannon first and then going close in with a knife and jabbing instead of slashing would be better. It&amp;#39;s always been my assumption that the average person is not mentally outfitted for the dirty work of close in knife fighting. Working in an ER I can tell you the overwhelming majority of knife fights I see end up with slashing lacerations that are far less than lethal and not the multiple straight in stab wounds needed to kill. A knife can be one of the most lethal weapons there is but only in the right hands.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg73ur7", "score_hidden": false, "stickied": false, "created": 1492084521.0, "created_utc": 1492055721.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72q12", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Crazyleviman", "parent_id": "t1_dg6wzyq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That sounds nice, except that reaction takes 20+ seconds to happen.  Plus, it is unlikely to stop a charging attacker.  Better to leave it sealed and use it as a distraction. I'd take a potato peeler over your \"toilet bowl cleaner mace\" . You have the right idea for sure. Time to jock up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds nice, except that reaction takes 20+ seconds to happen.  Plus, it is unlikely to stop a charging attacker.  Better to leave it sealed and use it as a distraction. I&amp;#39;d take a potato peeler over your &amp;quot;toilet bowl cleaner mace&amp;quot; . You have the right idea for sure. Time to jock up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg72q12", "score_hidden": false, "stickied": false, "created": 1492082861.0, "created_utc": 1492054061.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg795ny", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t1_dg6y7yv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You could do it either way really, as someone mentioned earlier it takes about 30 seconds for the reaction to go turbo. I was just taught this way. Also it is important to note that the off gas is highly flammable hydrogen that if needed can be collected in a balloon and used as a flash bang grenade by taping a small firecracker to it and a weight. The firecracker is lit and the hydrogen filled balloon that has a weight attached to it like a lead sinker is thrown into the area to explode. You can have a lot of fun with these but small amounts of hydrogen gas that explode makes a big flash but don't really carry enough blasting power to cause serious injuries. They can be used to safely surprise the shit outta somebody though.", "edited": 1492082053.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could do it either way really, as someone mentioned earlier it takes about 30 seconds for the reaction to go turbo. I was just taught this way. Also it is important to note that the off gas is highly flammable hydrogen that if needed can be collected in a balloon and used as a flash bang grenade by taping a small firecracker to it and a weight. The firecracker is lit and the hydrogen filled balloon that has a weight attached to it like a lead sinker is thrown into the area to explode. You can have a lot of fun with these but small amounts of hydrogen gas that explode makes a big flash but don&amp;#39;t really carry enough blasting power to cause serious injuries. They can be used to safely surprise the shit outta somebody though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg795ny", "score_hidden": false, "stickied": false, "created": 1492094593.0, "created_utc": 1492065793.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6y7yv", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "akaFreya", "parent_id": "t1_dg6wzyq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Wouldn't it be more efficient to put the aluminum balls in the bottle first, then have the drain cleaner separate? Idk about you but I'm probably pretty uncoordinated when it comes to fitting a bunch of balls into a bottle under pressure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn&amp;#39;t it be more efficient to put the aluminum balls in the bottle first, then have the drain cleaner separate? Idk about you but I&amp;#39;m probably pretty uncoordinated when it comes to fitting a bunch of balls into a bottle under pressure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6y7yv", "score_hidden": false, "stickied": false, "created": 1492077022.0, "created_utc": 1492048222.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg89fip", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ewanftw", "parent_id": "t1_dg6wzyq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Well if i get in somthing Like this i would choose you as an helper", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well if i get in somthing Like this i would choose you as an helper&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg89fip", "score_hidden": false, "stickied": false, "created": 1492147892.0, "created_utc": 1492119092.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wzyq", "gilded": 0, "archived": false, "score": 92, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Barricade your door after locking it with the heaviest piece of furniture you can. Let no one in under any circumstances. Fill your bathtub with water in case they shut it off. Rip the electrical cord from an appliance and make sure you can plug it in and have the end reach the doorknob so you can disable anyone attempting a forced entry. To make a weapon take three 1 liter bottles of soda and empty them. Collect sodium hydroxide (lye) which you probably have as a drain cleaner and aluminum foil. To make three weapons divide the drain cleaner into three equal parts in each 1 liter bottle and roll as many pieces of aluminum foil into little balls that will fit through the opening of the bottles and place an equal amount in front of each bottle. Now make a small hole in the middle of the cap. When faced with an intruder quickly pour the aluminum balls into the bottle and screw the top on tightly while pointing it at your oppressor. A violent reaction will occur with the aluminum and the sodium hydroxide that will force out a highly caustic solution through the hole in the cap about 30 feet that will cause blindness and a painful burning sensation to to the skin. NEVER GIVE UP!! Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Barricade your door after locking it with the heaviest piece of furniture you can. Let no one in under any circumstances. Fill your bathtub with water in case they shut it off. Rip the electrical cord from an appliance and make sure you can plug it in and have the end reach the doorknob so you can disable anyone attempting a forced entry. To make a weapon take three 1 liter bottles of soda and empty them. Collect sodium hydroxide (lye) which you probably have as a drain cleaner and aluminum foil. To make three weapons divide the drain cleaner into three equal parts in each 1 liter bottle and roll as many pieces of aluminum foil into little balls that will fit through the opening of the bottles and place an equal amount in front of each bottle. Now make a small hole in the middle of the cap. When faced with an intruder quickly pour the aluminum balls into the bottle and screw the top on tightly while pointing it at your oppressor. A violent reaction will occur with the aluminum and the sodium hydroxide that will force out a highly caustic solution through the hole in the cap about 30 feet that will cause blindness and a painful burning sensation to to the skin. NEVER GIVE UP!! Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6wzyq", "score_hidden": false, "stickied": false, "created": 1492075519.0, "created_utc": 1492046719.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 92}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg838mq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "choijason", "parent_id": "t1_dg7llj4", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Best poem for deathly scenarios", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best poem for deathly scenarios&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg838mq", "score_hidden": false, "stickied": false, "created": 1492140878.0, "created_utc": 1492112078.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7llj4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Strike_of_the_Night", "parent_id": "t1_dg7ary9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Amen to that poem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amen to that poem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7llj4", "score_hidden": false, "stickied": false, "created": 1492121804.0, "created_utc": 1492093004.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ary9", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "choijason", "parent_id": "t1_dg7aj5x", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ah shit I forgot to mention about the long weapons. Going for the head might be a bit hard, since they're described to be fast (which is why OP needs to get off the meds). Try just swinging at their torso, if they're hit hard enough they might just dissolve, judging from the OP's description of they're rapid decay. \n\nAlso, if Liam gets bitten/hit with the acid , KILL HIM. Immediately is preferred, but if he acts like nothing is wrong, hit him with your blunt object when his back his turned, take his firearm and kill him. Trust me, being bitten by an infected individual has never gone right for anyone. Better safe than sorry. \n\nAlso, chances are that if you make it out of the apartment, you're going to be gunned down by the police/military. It doesn't matter if you stride toward them buck-naked and yell \"I'M NOT INFECTED\". They're going to tell you to get back in, and if you don't comply they'll shoot your ass. I guess the best thing to do would be to either go through the sewers (which may end really badly) or barricading yourself in your room and hoping for the best. \n\nSince reddit seems to be open, why not go look around in the other subreddits? Go look for /r/worldnews or something similar. \n\nGood luck OP, my final advice to you is to get rid of all personal taboos and restrictions. To survive Hell, you need to become a monster. Don't hesitate to take from others, kill humans on the verge of 'turning', looting, killing the zombies, killing people who oppose you in anyway. This is no time to be sentimental. No, this doesn't mean to go on a murderous rampage and become the chief bandit of your apartment. It simply means that when the situation demands an action, commit toward the action. If the situation recquires you to kill 3 children who are all about to turn, do it. If a feeble old man refuses to share his enourmous supply of weapons and food with you, kill hiim and take it. If your partner seems shady, or is about to go zombie, kill him. Loot dead bodies. Nothing is wrong or taboo to do in this situation. Pray for all the dead souls later, when you're alive and safe and far away. Now is not the time. \n\n\nDo not go gentle into that good night,\nOld age should burn and rave at close of day;\nRage, rage against the dying of the light.\n\nThough wise men at their end know dark is right,\nBecause their words had forked no lightning they\nDo not go gentle into that good night.\n\nGood men, the last wave by, crying how bright\nTheir frail deeds might have danced in a green bay,\nRage, rage against the dying of the light.\n\nWild men who caught and sang the sun in flight,\nAnd learn, too late, they grieved it on its way,\nDo not go gentle into that good night.\n\nGrave men, near death, who see with blinding sight\nBlind eyes could blaze like meteors and be gay,\nRage, rage against the dying of the light.\n\nAnd you, my father, there on the sad height,\nCurse, bless, me now with your fierce tears, I pray.\nDo not go gentle into that good night.\nRage, rage against the dying of the light.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah shit I forgot to mention about the long weapons. Going for the head might be a bit hard, since they&amp;#39;re described to be fast (which is why OP needs to get off the meds). Try just swinging at their torso, if they&amp;#39;re hit hard enough they might just dissolve, judging from the OP&amp;#39;s description of they&amp;#39;re rapid decay. &lt;/p&gt;\n\n&lt;p&gt;Also, if Liam gets bitten/hit with the acid , KILL HIM. Immediately is preferred, but if he acts like nothing is wrong, hit him with your blunt object when his back his turned, take his firearm and kill him. Trust me, being bitten by an infected individual has never gone right for anyone. Better safe than sorry. &lt;/p&gt;\n\n&lt;p&gt;Also, chances are that if you make it out of the apartment, you&amp;#39;re going to be gunned down by the police/military. It doesn&amp;#39;t matter if you stride toward them buck-naked and yell &amp;quot;I&amp;#39;M NOT INFECTED&amp;quot;. They&amp;#39;re going to tell you to get back in, and if you don&amp;#39;t comply they&amp;#39;ll shoot your ass. I guess the best thing to do would be to either go through the sewers (which may end really badly) or barricading yourself in your room and hoping for the best. &lt;/p&gt;\n\n&lt;p&gt;Since reddit seems to be open, why not go look around in the other subreddits? Go look for &lt;a href=\"/r/worldnews\"&gt;/r/worldnews&lt;/a&gt; or something similar. &lt;/p&gt;\n\n&lt;p&gt;Good luck OP, my final advice to you is to get rid of all personal taboos and restrictions. To survive Hell, you need to become a monster. Don&amp;#39;t hesitate to take from others, kill humans on the verge of &amp;#39;turning&amp;#39;, looting, killing the zombies, killing people who oppose you in anyway. This is no time to be sentimental. No, this doesn&amp;#39;t mean to go on a murderous rampage and become the chief bandit of your apartment. It simply means that when the situation demands an action, commit toward the action. If the situation recquires you to kill 3 children who are all about to turn, do it. If a feeble old man refuses to share his enourmous supply of weapons and food with you, kill hiim and take it. If your partner seems shady, or is about to go zombie, kill him. Loot dead bodies. Nothing is wrong or taboo to do in this situation. Pray for all the dead souls later, when you&amp;#39;re alive and safe and far away. Now is not the time. &lt;/p&gt;\n\n&lt;p&gt;Do not go gentle into that good night,\nOld age should burn and rave at close of day;\nRage, rage against the dying of the light.&lt;/p&gt;\n\n&lt;p&gt;Though wise men at their end know dark is right,\nBecause their words had forked no lightning they\nDo not go gentle into that good night.&lt;/p&gt;\n\n&lt;p&gt;Good men, the last wave by, crying how bright\nTheir frail deeds might have danced in a green bay,\nRage, rage against the dying of the light.&lt;/p&gt;\n\n&lt;p&gt;Wild men who caught and sang the sun in flight,\nAnd learn, too late, they grieved it on its way,\nDo not go gentle into that good night.&lt;/p&gt;\n\n&lt;p&gt;Grave men, near death, who see with blinding sight\nBlind eyes could blaze like meteors and be gay,\nRage, rage against the dying of the light.&lt;/p&gt;\n\n&lt;p&gt;And you, my father, there on the sad height,\nCurse, bless, me now with your fierce tears, I pray.\nDo not go gentle into that good night.\nRage, rage against the dying of the light.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7ary9", "score_hidden": false, "stickied": false, "created": 1492099026.0, "created_utc": 1492070226.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg9d5r1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "InvincibleSummer1066", "parent_id": "t1_dg7aj5x", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "For the meds, it depends. Taking too much is bad. Withdrawal can also be bad. OP doesn't need to be shaking from benzo withdrawal, nor does she need her head to be flying every which way at once (withdrawal from a wide variety of meds can make it impossible to think straight). Especially with suddenly stopping drinking, it's inadvisable for OP to quit the anxiety meds cold turkey. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For the meds, it depends. Taking too much is bad. Withdrawal can also be bad. OP doesn&amp;#39;t need to be shaking from benzo withdrawal, nor does she need her head to be flying every which way at once (withdrawal from a wide variety of meds can make it impossible to think straight). Especially with suddenly stopping drinking, it&amp;#39;s inadvisable for OP to quit the anxiety meds cold turkey. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9d5r1", "score_hidden": false, "stickied": false, "created": 1492216220.0, "created_utc": 1492187420.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7aj5x", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "choijason", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "So it seems that you have a 'zombie outbreak' situation. Since 2BrkOnThru covered the defensive portion of surviving the outbreak, I'll try and advise you on going on the offensive, seeing as you guys seem to be trying to leave (btw my conventional warfare ideas are nowhere near 2Brk's, s/he's your best bet for making weapons out of household items. \n\nFirst and foremost, you need to stop taking medications. Trust me. there's no time to get drugged up in a situation like this. Every fiber of your body needs to be alert. You need to be able to hear every single growl, every slight movement, every vomit. I also recommend getting rid of the alcohol, again no time to get drunk. I have no idea if these zombies have any sense of smell, so I guess I would keep the cigarettes around if they don't. Bear in mind it's better to not smoke at all as it would help with running and stamina and all that, but since you're aready into chain smoking, I guess this isn't any time to quit. Use the cigarrettes as a substitute for the meds, a way to relax, and a way to gain more trust with Liam if he's into that sort of thing (so he won't shoot your ass and betray you). \n\nAs for supplies, I would prepare for around half a week's worth of food and drinks. Ways of signaling the police/military are useless (since they're already involved), so if you have any flares or something like that (I mean, why would you, but just in case?), use them as distractions. Remember to ration water, as liquids may get contaminated. Say some zombie throws up in the water supply, for example. Now all the water in the entire apartment is fucked, so try and avoid tap water if possible.\n\n\nIf you have long hair, cut it off right now. This will prevent you from being dragged by your hair to your doom horror movie style. Seriously, the less the grasp the better. \n\n\nTry and double layer your clothes, the acid/posion they spit out seem to be both contagious and corrosive. If you have a winter jacket, put it on. If you have anything that can cover your neck, put it on. Bring along a pillowcase or two with eyeholes poked in so that you can use them to protect your face if the situation requires it. Socks and atheltic shoes are a must. Long pants and shirts. \n\n\nFor weapons, since Liam already has a firearm, he's going to be the main source of protection. Ask him if he has another firearm (chances are he doesn't). If he doesn't, try and find a blunt weapon with long reach. One handed weapons like knives AREN'T going to help. For one, you need to be way within their reach to effectively use it, which leaves the possibility of getting a face-full of zombie acid. For another, most kitchen knives aren't sharp/powerful enough to actually do lasting damage on human bodies. It isn't sharp enough to penetrate the brain. I guess it could get to the heart, but from what I've seen about zombies and these guys, getting to the heart isnt going to be too easy. Long, blunt, easily wieldable objects are your best bet. Also, DONT GO AFTER ANY ZOMBIES. When/if leaving through the building, stick to and watch Liam's back, and act as his rearguard. Call out when you see a zombie approaching, and try and incapitate it. \n\n\nAs far as the zombies go, the OP is in a lot of luck. This particular breed of zombies seem to be the 'powerful but weak' kind of zombies. They're fast, and can shoot corrosives. They also seem to retain intelligence, which may be a big problem for OP. However, they seem to be really brittle (if a guy can accidentally break the zombies neck), so the blunt weapons should be good enough to incapitate/kill the zombies. On top of this, these zombies seem to be vulnerable to human wounds (like neck breaking, or heart rupture, or gutted in the stomach, etc.) (Which makes me think that these aren't truly the undead, but just heavily infected humans). This means Liam shouldn't have to worry about your standard headshot-only kills for zombies. Make sure to notify him of this, and to test it out before taking it for granted (shoot a zombie in the stomach and see what happens).\n\n\nBTW OP is probably better off barricading in the apartment for a few more days, if not weeks. The zombies seem to be self-decaying, so waiting it out should be a much better alternative. \n\nFinally, OP don't hesitate to kill the zombies. They may have once been your best friends, or people who cared about you deeply, but they aren't anymore. Fuck them all up and give them peace.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So it seems that you have a &amp;#39;zombie outbreak&amp;#39; situation. Since 2BrkOnThru covered the defensive portion of surviving the outbreak, I&amp;#39;ll try and advise you on going on the offensive, seeing as you guys seem to be trying to leave (btw my conventional warfare ideas are nowhere near 2Brk&amp;#39;s, s/he&amp;#39;s your best bet for making weapons out of household items. &lt;/p&gt;\n\n&lt;p&gt;First and foremost, you need to stop taking medications. Trust me. there&amp;#39;s no time to get drugged up in a situation like this. Every fiber of your body needs to be alert. You need to be able to hear every single growl, every slight movement, every vomit. I also recommend getting rid of the alcohol, again no time to get drunk. I have no idea if these zombies have any sense of smell, so I guess I would keep the cigarettes around if they don&amp;#39;t. Bear in mind it&amp;#39;s better to not smoke at all as it would help with running and stamina and all that, but since you&amp;#39;re aready into chain smoking, I guess this isn&amp;#39;t any time to quit. Use the cigarrettes as a substitute for the meds, a way to relax, and a way to gain more trust with Liam if he&amp;#39;s into that sort of thing (so he won&amp;#39;t shoot your ass and betray you). &lt;/p&gt;\n\n&lt;p&gt;As for supplies, I would prepare for around half a week&amp;#39;s worth of food and drinks. Ways of signaling the police/military are useless (since they&amp;#39;re already involved), so if you have any flares or something like that (I mean, why would you, but just in case?), use them as distractions. Remember to ration water, as liquids may get contaminated. Say some zombie throws up in the water supply, for example. Now all the water in the entire apartment is fucked, so try and avoid tap water if possible.&lt;/p&gt;\n\n&lt;p&gt;If you have long hair, cut it off right now. This will prevent you from being dragged by your hair to your doom horror movie style. Seriously, the less the grasp the better. &lt;/p&gt;\n\n&lt;p&gt;Try and double layer your clothes, the acid/posion they spit out seem to be both contagious and corrosive. If you have a winter jacket, put it on. If you have anything that can cover your neck, put it on. Bring along a pillowcase or two with eyeholes poked in so that you can use them to protect your face if the situation requires it. Socks and atheltic shoes are a must. Long pants and shirts. &lt;/p&gt;\n\n&lt;p&gt;For weapons, since Liam already has a firearm, he&amp;#39;s going to be the main source of protection. Ask him if he has another firearm (chances are he doesn&amp;#39;t). If he doesn&amp;#39;t, try and find a blunt weapon with long reach. One handed weapons like knives AREN&amp;#39;T going to help. For one, you need to be way within their reach to effectively use it, which leaves the possibility of getting a face-full of zombie acid. For another, most kitchen knives aren&amp;#39;t sharp/powerful enough to actually do lasting damage on human bodies. It isn&amp;#39;t sharp enough to penetrate the brain. I guess it could get to the heart, but from what I&amp;#39;ve seen about zombies and these guys, getting to the heart isnt going to be too easy. Long, blunt, easily wieldable objects are your best bet. Also, DONT GO AFTER ANY ZOMBIES. When/if leaving through the building, stick to and watch Liam&amp;#39;s back, and act as his rearguard. Call out when you see a zombie approaching, and try and incapitate it. &lt;/p&gt;\n\n&lt;p&gt;As far as the zombies go, the OP is in a lot of luck. This particular breed of zombies seem to be the &amp;#39;powerful but weak&amp;#39; kind of zombies. They&amp;#39;re fast, and can shoot corrosives. They also seem to retain intelligence, which may be a big problem for OP. However, they seem to be really brittle (if a guy can accidentally break the zombies neck), so the blunt weapons should be good enough to incapitate/kill the zombies. On top of this, these zombies seem to be vulnerable to human wounds (like neck breaking, or heart rupture, or gutted in the stomach, etc.) (Which makes me think that these aren&amp;#39;t truly the undead, but just heavily infected humans). This means Liam shouldn&amp;#39;t have to worry about your standard headshot-only kills for zombies. Make sure to notify him of this, and to test it out before taking it for granted (shoot a zombie in the stomach and see what happens).&lt;/p&gt;\n\n&lt;p&gt;BTW OP is probably better off barricading in the apartment for a few more days, if not weeks. The zombies seem to be self-decaying, so waiting it out should be a much better alternative. &lt;/p&gt;\n\n&lt;p&gt;Finally, OP don&amp;#39;t hesitate to kill the zombies. They may have once been your best friends, or people who cared about you deeply, but they aren&amp;#39;t anymore. Fuck them all up and give them peace.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7aj5x", "score_hidden": false, "stickied": false, "created": 1492098322.0, "created_utc": 1492069522.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg78re5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t1_dg6q3pu", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "My thoughts exactly. The building is definitively being quarantined. I'm sorry to tell you, OP, but you're on your own.  :-(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My thoughts exactly. The building is definitively being quarantined. I&amp;#39;m sorry to tell you, OP, but you&amp;#39;re on your own.  :-(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg78re5", "score_hidden": false, "stickied": false, "created": 1492093590.0, "created_utc": 1492064790.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6q3pu", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "christinacheree", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yikes, sounds like quarantine. I'd stay in your apartment and don't come out. Maybe see if you have anything to loosen those wooden boards on your balcony. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yikes, sounds like quarantine. I&amp;#39;d stay in your apartment and don&amp;#39;t come out. Maybe see if you have anything to loosen those wooden boards on your balcony. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6q3pu", "score_hidden": false, "stickied": false, "created": 1492067072.0, "created_utc": 1492038272.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg6t19e", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "KidOnTheBus505", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Try to stay in your apartment dont open the door to anyone exept the CDC ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try to stay in your apartment dont open the door to anyone exept the CDC &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6t19e", "score_hidden": false, "stickied": false, "created": 1492070705.0, "created_utc": 1492041905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg7c552", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ThreeLZ", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "&gt;Afro-American", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Afro-American&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7c552", "score_hidden": false, "stickied": false, "created": 1492103146.0, "created_utc": 1492074346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg6x50w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FBIvan2", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Is there anything on the news?   I hope you have enough food and water to hold out till this is over!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there anything on the news?   I hope you have enough food and water to hold out till this is over!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6x50w", "score_hidden": false, "stickied": false, "created": 1492075692.0, "created_utc": 1492046892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg79wmh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "rebelliasm", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yikes. Caps at the end says, Don't you see --- and if I'm being honest, I'd rather not see what's going on in person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yikes. Caps at the end says, Don&amp;#39;t you see --- and if I&amp;#39;m being honest, I&amp;#39;d rather not see what&amp;#39;s going on in person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg79wmh", "score_hidden": false, "stickied": false, "created": 1492096574.0, "created_utc": 1492067774.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg7wk4v", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ThatRandomSurvivor", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "ď̢̐͗ͯͥ̀ͥ̎҉̵̗̥̣̱͝ͅ ̡̮̦̥͔̝̦͉̪̩ͧ̂͂̾͑ͩͯ͒̐͐̑̏ͯ̈́́͞o̡̐ͫͯ͗͐͆̇̽̽̆ͨͮ͒̉ͯ͡͝҉̴̣̹̱͓̻̳̰ ̴̧̭̹̼̥̤̻͉͍̰̗̳̽͛ͦ̽͒̿ͭ́͐͜ ̠̙̲̩̟ͬ̒̏̔͆̈́̾ͩ͂ͨ͂̒̚̚͘͝ͅn̶̖̫̥̝͈̻̬͙͙̟̻͇͖̘̹̹̦ͥ̓̈̒ͅtͣ͂̒͑͗͂̓̇͊̎ͣ͗̐́͢҉̼̝̞͉͖͚͇̟͇͓ͅ ̸̶͓̝̬̰͉̠̜̣̗̫ͭ͆͌̓̽̓̾̽͊́̅ͯ̑ͦ͂͡ ̴͊̐͒͆̓ͨ͒ͩ̊̒ͩ͒̃͂ͩ̑̑̾͏̸̛̯̯̹̱͢ͅỵ͓̲̘̬̭̽̓̇͛͋̉́̌̐̍ͦ̓͊̆̀͢ ̵̶̨̝̮̣̮̝̖̹̞͚̬̭̜ͨ̓̉͆̎̾̐ͯͭ͐͐̈̚͟͡oͫ͌͋ͯ̎ͬ͌̊͡҉̹̖̥̼̪̜͓͙̺̳̪͇̩̤͓ú̷̵̧̜̱͍̣̳̯͙͉̮̞̟̭̦̟̘̘̼̮̫ͥ̐͊ ̵͇͙̱͙̟͂̈̃̑ͬ̄͡͡͠͞s̨͇̯͙͉̮̔ͦͮͦ͆͌̓̓́ ̸̤̫̬̮͙̖͚̘̙̖̺̣̫̫ͣ̿̌̊ͩ͊ͧ͞ ̵̴͙̦̤̖̘̗̫͐̈̍͊̆͑͑̅̐ͣ͋̽͂͢͠ͅȩ̴͎̥̥͙͉̥̮̩̼̭͕̱̱͙̮̹̞ͬ̓̒̐͒ͭ͑̚͡ͅ ̷̆̾́ͨ͛ͤ̔ͮ̇́҉̞̲̼͕̝̖̻͚͟eͣͧͭ̑̏̃͒̀̎ͧͣ̿ͨ̏̾̑́̎̚͏͞҉̡̼͉͔̗̱̙̭͍̦͡ ̷̶̪̮̩̩̭̫̤̞͇͒ͣͭ͌͘͞?͆̓̿̓ͮͮ͏̧̦͔͙̗̬̞́́͠", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ď̢̐͗ͯͥ̀ͥ̎҉̵̗̥̣̱͝ͅ ̡̮̦̥͔̝̦͉̪̩ͧ̂͂̾͑ͩͯ͒̐͐̑̏ͯ̈́́͞o̡̐ͫͯ͗͐͆̇̽̽̆ͨͮ͒̉ͯ͡͝҉̴̣̹̱͓̻̳̰ ̴̧̭̹̼̥̤̻͉͍̰̗̳̽͛ͦ̽͒̿ͭ́͐͜ ̠̙̲̩̟ͬ̒̏̔͆̈́̾ͩ͂ͨ͂̒̚̚͘͝ͅn̶̖̫̥̝͈̻̬͙͙̟̻͇͖̘̹̹̦ͥ̓̈̒ͅtͣ͂̒͑͗͂̓̇͊̎ͣ͗̐́͢҉̼̝̞͉͖͚͇̟͇͓ͅ ̸̶͓̝̬̰͉̠̜̣̗̫ͭ͆͌̓̽̓̾̽͊́̅ͯ̑ͦ͂͡ ̴͊̐͒͆̓ͨ͒ͩ̊̒ͩ͒̃͂ͩ̑̑̾͏̸̛̯̯̹̱͢ͅỵ͓̲̘̬̭̽̓̇͛͋̉́̌̐̍ͦ̓͊̆̀͢ ̵̶̨̝̮̣̮̝̖̹̞͚̬̭̜ͨ̓̉͆̎̾̐ͯͭ͐͐̈̚͟͡oͫ͌͋ͯ̎ͬ͌̊͡҉̹̖̥̼̪̜͓͙̺̳̪͇̩̤͓ú̷̵̧̜̱͍̣̳̯͙͉̮̞̟̭̦̟̘̘̼̮̫ͥ̐͊ ̵͇͙̱͙̟͂̈̃̑ͬ̄͡͡͠͞s̨͇̯͙͉̮̔ͦͮͦ͆͌̓̓́ ̸̤̫̬̮͙̖͚̘̙̖̺̣̫̫ͣ̿̌̊ͩ͊ͧ͞ ̵̴͙̦̤̖̘̗̫͐̈̍͊̆͑͑̅̐ͣ͋̽͂͢͠ͅȩ̴͎̥̥͙͉̥̮̩̼̭͕̱̱͙̮̹̞ͬ̓̒̐͒ͭ͑̚͡ͅ ̷̆̾́ͨ͛ͤ̔ͮ̇́҉̞̲̼͕̝̖̻͚͟eͣͧͭ̑̏̃͒̀̎ͧͣ̿ͨ̏̾̑́̎̚͏͞҉̡̼͉͔̗̱̙̭͍̦͡ ̷̶̪̮̩̩̭̫̤̞͇͒ͣͭ͌͘͞?͆̓̿̓ͮͮ͏̧̦͔͙̗̬̞́́͠&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7wk4v", "score_hidden": false, "stickied": false, "created": 1492133714.0, "created_utc": 1492104914.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg7723o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SadouMaou", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "NO DON'T LET LIAM IN.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;NO DON&amp;#39;T LET LIAM IN.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7723o", "score_hidden": false, "stickied": false, "created": 1492089815.0, "created_utc": 1492061015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg7z4xj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bronwynnekulvi", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I hope to hell you don't run out of your meds before you get out of there... I'd rather die of some crazy ass virus than go into full blown benzo withdrawal :| ...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope to hell you don&amp;#39;t run out of your meds before you get out of there... I&amp;#39;d rather die of some crazy ass virus than go into full blown benzo withdrawal :| ...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7z4xj", "score_hidden": false, "stickied": false, "created": 1492136454.0, "created_utc": 1492107654.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg722x8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "amberkerrpdx", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Since there are obviously contagious elements at play, wear clothing that covers your skin, isn't absorbent and that you can still move easily in. If you have a bird flu mask, a bandana, a roll of duct tape...anything for you to attempt to fashion a hazmat suit for yourself! Block as much air as possible from getting in under the front door. \nTake inventory of your emergency supplies:water, food, batteries, flashlights, first aid kit, etc. \nAny tools? If your situation gets desperate, anything to cut through that plywood on your balcony to escape! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since there are obviously contagious elements at play, wear clothing that covers your skin, isn&amp;#39;t absorbent and that you can still move easily in. If you have a bird flu mask, a bandana, a roll of duct tape...anything for you to attempt to fashion a hazmat suit for yourself! Block as much air as possible from getting in under the front door. \nTake inventory of your emergency supplies:water, food, batteries, flashlights, first aid kit, etc. \nAny tools? If your situation gets desperate, anything to cut through that plywood on your balcony to escape! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg722x8", "score_hidden": false, "stickied": false, "created": 1492081961.0, "created_utc": 1492053161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg6wy25", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Sloth7Sins", "parent_id": "t1_dg6wksl", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh, and I would suggest you get anything in your apartment that you can use as a weapon and keep it on you at all times. Put anything and everything in front if the door, to make sure nothing is getting in too. Also, I know apartments near me have basically paper thin walls, so I would try to re-inforce the wall that is shared by the dead people in the room next to you, they probably won't be dead for long. Stay safe OP and hold out as long as you can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, and I would suggest you get anything in your apartment that you can use as a weapon and keep it on you at all times. Put anything and everything in front if the door, to make sure nothing is getting in too. Also, I know apartments near me have basically paper thin walls, so I would try to re-inforce the wall that is shared by the dead people in the room next to you, they probably won&amp;#39;t be dead for long. Stay safe OP and hold out as long as you can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6wy25", "score_hidden": false, "stickied": false, "created": 1492075450.0, "created_utc": 1492046650.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg6wnnj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sloth7Sins", "parent_id": "t1_dg6wksl", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's what I thought at first but the \"pm\" threw me off. I'm only halfway through the story but it sounds like you're in some pretty deep shit. Hope you make it out okay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I thought at first but the &amp;quot;pm&amp;quot; threw me off. I&amp;#39;m only halfway through the story but it sounds like you&amp;#39;re in some pretty deep shit. Hope you make it out okay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6wnnj", "score_hidden": false, "stickied": false, "created": 1492075087.0, "created_utc": 1492046287.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wksl", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "lucifers_pet", "parent_id": "t1_dg6w7dh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm sorry, here where I live we use 24 numbers to tell the hours but I will fix it now", "edited": 1492046463.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, here where I live we use 24 numbers to tell the hours but I will fix it now&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6wksl", "score_hidden": false, "stickied": false, "created": 1492074988.0, "created_utc": 1492046188.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg70jql", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "bronwynnekulvi", "parent_id": "t1_dg6w7dh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "14 pm is 1400 on the 24hr clock. It is equivalent to 2pm on the 12hr clock. An easy trick for the 24hr clock is to subtract 2 from the second digit for any time after 1200 or 12pm; for example: 1300, 3-2=1 so we know that 1300 is equivalent to 1pm,; 1400, 4-2=2, so 2pm, 2200, 2-2=0, so 10pm, etc... and midnight is 0000. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;14 pm is 1400 on the 24hr clock. It is equivalent to 2pm on the 12hr clock. An easy trick for the 24hr clock is to subtract 2 from the second digit for any time after 1200 or 12pm; for example: 1300, 3-2=1 so we know that 1300 is equivalent to 1pm,; 1400, 4-2=2, so 2pm, 2200, 2-2=0, so 10pm, etc... and midnight is 0000. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg70jql", "score_hidden": false, "stickied": false, "created": 1492079934.0, "created_utc": 1492051134.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w7dh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sloth7Sins", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "14 pm? I is cunfuzzled.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;14 pm? I is cunfuzzled.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6w7dh", "score_hidden": false, "stickied": false, "created": 1492074535.0, "created_utc": 1492045735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6513by", "likes": null, "replies": "", "user_reports": [], "id": "dg712qs", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_6513by", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg712qs", "score_hidden": false, "stickied": false, "created": 1492080622.0, "created_utc": 1492051822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]