[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64ujhv/my_daughter_has_changed_since_her_vacation_part_1/\"&gt;Part 1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In case you missed part 1, I suggest reading it first to catch up with what has happened so far.&lt;/p&gt;\n\n&lt;p&gt;Last night Sara came home and seemed her normal self. I was watching a movie in the living room and she came right over and joined me. It was nice to just sit there with my daughter and feel like a family, but I had an uneasy feeling inside of me. Considering what had been happening and what I discovered in her room, I knew I couldn&amp;#39;t let the normalcy persist. I had to ask her questions and hope she would give me answers.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sara... I saw the binder.&amp;quot; I paused the movie as I waited patiently for her to respond.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You were in my room?&amp;quot; she asked, her voice was very quiet.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes. I know it was an inva-&amp;quot; before I could finish she cut me off.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Did he see you?!&amp;quot; she asked in a loud whisper. &amp;quot;Please tell me he didn&amp;#39;t see you, daddy!&amp;quot; Her eyes were already tearing up, Sara truly feared whoever this man was.&lt;/p&gt;\n\n&lt;p&gt;I put my hands on her shoulders. &amp;quot;There was no one in your room... I thought I heard a man laughing, but that wouldn&amp;#39;t have made any sense. What, no, who are you talking about? You have to tell me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She began sobbing, my hands still resting on her shoulders which were heaving up and down as she cried her eyes out. I was upset, angry, but most of all dumbfounded. Nothing was adding up. Why had Sara been behaving oddly? What was with that binder? Who was the man she kept talking about? Was he even a man? Her tears continued to pour out as I began to shush her and went in for a hug. That&amp;#39;s when she grabbed me by the throat and pushed me down. With her above me, I was pinned against the couch as she tried her hardest to choke the life out of me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why? Why did you go in there?!&amp;quot; Sara screamed and continued to squeeze as hard as she could. &amp;quot;He&amp;#39;s going to be angry!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I was in a lot of pain, and she was doing a good job of choking me, but I knew I had to get out of this. I didn&amp;#39;t want to her hurt, but I grabbed her by her arms and tried to pull her arms away from me. She resisted, and I ended up ripping a chunk of each sleeve off of her shirt. I mustered enough strength to break her grip and I rolled out from under her. She stood up by the couch and watched me as I stood up. That&amp;#39;s when I saw them.&lt;/p&gt;\n\n&lt;p&gt;Her scars.&lt;/p&gt;\n\n&lt;p&gt;Her arms had a lot of scars. She had been cutting herself and wearing long sleeves to hide it. Considering how crazy everything was and remembering the weird symbol I found on the cover of her binder, plus taking into account the dried blood on the pictures, I pieced together a theory.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Did you join some kind of cult, Sara? The symbol on your binder, it looked almost demonic. You&amp;#39;ve been cutting yourself, you&amp;#39;re talking about some angry &amp;#39;man&amp;#39;. This is all bat shit crazy! What happened while you were gone?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She didn&amp;#39;t respond. Instead she ran up to her room. I gave chase, but she beat me there and locked the door behind her. I banged on it as loud as I could. &amp;quot;Sara! Sara open the damn door right now!&amp;quot; I continue to pound on the door, I even gave some thought to kicking it in, but I decided against it.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Go away! He&amp;#39;s upset! I have to be punished!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t know what sort of demonic entity or devil my daughter thought she was communing with, but regardless these delusions were making her a danger to others and herself.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Don&amp;#39;t hurt yourself, sweetheart, please listen to me. We can talk. We can get you help.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;From the other side of the door came a response, but it wasn&amp;#39;t the one I wanted. And it didn&amp;#39;t come from my little girl.&lt;/p&gt;\n\n&lt;p&gt;I heard laughter. The same laughter I had heard when I searched her room, but this time it was loud. It sounded like it was coming from everywhere around me, not just Sara&amp;#39;s room. I&amp;#39;m pretty sure the house even started to shake. I held my ears, and that&amp;#39;s the last thing I remember before waking up in my bed this morning.&lt;/p&gt;\n\n&lt;p&gt;I shot out of my room as fast as I could and bolted for Sara&amp;#39;s room. The door was open. She wasn&amp;#39;t inside. I ran downstairs and found a note on the dining room table.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Went to mall with friends, be back later! xoxo&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Again, Sara did something normal despite all of the craziness going on around her. Still, I had to know what happened last night. I took out my phone to call her, but I saw that I had a text from a number I didn&amp;#39;t recognize. I opened it to find a picture. It was a picture of Sara on the beach during Spring Break. The picture was taken from a fair distance, but Sara was posing for a different picture being taken by one of her friends, Katie. I called the number that sent me the text, but it went straight to voicemail. I replied to the text asking who this was, but I&amp;#39;ve still yet to get anything back.&lt;/p&gt;\n\n&lt;p&gt;After I had some time to think things over, I decided that continuously confronting Sara about this whole ordeal may not be the best idea. Instead, I figured Katie could potentially provide some answers. I got ready and drove to Katie&amp;#39;s house, expecting to meet her parents at the door. Instead, Katie answered.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh. Mr. Wallace, what are you doing here? Is Sara okay?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I shook my head. &amp;quot;I don&amp;#39;t think so. That&amp;#39;s actually what I came over for. I had a feeling you&amp;#39;d be with her at the mall right now and was hoping I could at least talk to your parents, but talking to you will be even better.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She opened the door wider and motioned for me to come in. &amp;quot;My parents are at work, but I was actually just making me a grilled cheese sandwich. Do you want one?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, I&amp;#39;m not hungry. But thank you, Katie.&amp;quot; I entered and sat down on the couch in the living room. Moments later Katie sat across from me on another couch, her sandwich in hand and a glass of water to wash it down with.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, what&amp;#39;s going on with Sara?&amp;quot; Katie took a bite of her sandwich. &lt;/p&gt;\n\n&lt;p&gt;I explained everything to Katie, who continued eating throughout the story until she had finished her meal. She was finishing her water as I concluded my tale. &amp;quot;And then seeing you in the picture made me think that maybe you saw something happen, or maybe someone she was with, that could help explain her weird behavior.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Katie looked around the room while she was thinking. I could tell she was more than a little nervous.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Anything, Katie. Anything at all that could help me get to the bottom of this and help Sara before she does damage to herself that can&amp;#39;t be repaired.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Katie took in a deep breath and slowly exhaled. &amp;quot;The last day we were there, that morning we all woke up before her. Weird, considering how she always gets up bright and early. I don&amp;#39;t remember much from the night before, we were pretty hammered...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I shake my head, something Katie paused for. &amp;quot;I mean you had to know.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I figured, yeah. Go on.&amp;quot; I aggressively rubbed my brow while Katie continued.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, I went to get her up after a while and she was just laying down flat on top of the covers. Her hair was a mess, like she had been tossing and turning all night prior to this. She was definitely asleep, but she was whispering.&amp;quot; Katie trailed off, losing a bit of her composure. &amp;quot;It was the strangest thing. I shivered listening to her whisper like that.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What was she saying?&amp;quot; I pressed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t know if I heard everything she said. But she kept repeating a few different things. She said &amp;#39;mom&amp;#39; a lot. There was something about &amp;#39;not making him angry again&amp;#39;. And the only other thing I really remember... was about you.&amp;quot; Katie looked down at the floor.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What about me? What did she say?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;She said you were going to die soon. That &amp;#39;he&amp;#39; was going to kill you.&amp;quot; Katie rubbed her hands nervously. &amp;quot;I&amp;#39;m sorry, I know it was weird and I probably should have said something sooner, but I just thought she was having a bad dream.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I was shaken, I won&amp;#39;t lie. Still, I had to make sure Katie knew she didn&amp;#39;t do anything wrong. &amp;quot;Don&amp;#39;t blame yourself, you couldn&amp;#39;t have known. Thank you for your help, Katie.&amp;quot; I hugged her and was on my way.&lt;/p&gt;\n\n&lt;p&gt;My next stop was the police station. I had undoubtedly heard a masculine laugh the night before, and while I feel like Sara has gotten involved with some evil cult, I refuse to believe that what I heard was a demon, or even the devil himself. There must have been a man in my house, hiding somewhere in my daughter&amp;#39;s room. This infuriated me, but I was in no state to run home and try to find him, if he was even still there. I had a lot of questions. Who was he? Why was he going to kill me? What was the connection between Sara&amp;#39;s whispers that morning? Why was she whispering about her mother?&lt;/p&gt;\n\n&lt;p&gt;I couldn&amp;#39;t answer these questions, and I knew Sara would be no help. So I met with one of my oldest friends, he&amp;#39;s a detective here in town. Detective Wade. He and I go way back to Junior High School. I know it&amp;#39;s outside of his job description, but I didn&amp;#39;t want him to conduct a standard investigation. I didn&amp;#39;t want to get caught up in the red tape. I wanted him to help me solve this thing and take out this man before he could hurt me or my daughter. Luckily, Wade had the kind of rebellious personality that would allow him to go for something like this.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hell yeah I&amp;#39;ll help you catch this son of a bitch. You and Sara are family, and I&amp;#39;m not going to let anyone get away with hurting my family.&amp;quot; Wade said as we met over coffee. &amp;quot;If we did this by the books I&amp;#39;m guessing we&amp;#39;d find the guy, sure, especially if he&amp;#39;s in your home. But we&amp;#39;d have to book him and take him straight to jail. This way he has to pay for messing with Sara before he gets locked up. And if we play our cards right, maybe we can gather evidence that he&amp;#39;s doing more than just trespassing on your property. I don&amp;#39;t figure Sara would give this guy up if she&amp;#39;s so afraid of him, but if we can get proof of him doing something malicious we&amp;#39;ll put him in a cell for much longer.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What did you have in mind?&amp;quot; I had to question Wade. As much as I wanted this bastard to feel some of the pain he&amp;#39;s made my daughter feel, I know Wade can go overboard. The last thing we need is Wade killing him. Still, I had to know how he planned to gather more damning evidence. We didn&amp;#39;t even know for sure that some mystery man was hiding away in my house, and if he was we didn&amp;#39;t know if he was always there. When does he come and go? Is he ever active while I&amp;#39;m asleep? Is he drinking my beer?!&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ll stake the place out at night, from a distance. I&amp;#39;ll get a view of Sara&amp;#39;s window and see what I can spot going on in there at night time. I&amp;#39;ll make sure to record anything. And if I see this guy I&amp;#39;ll let you know, I&amp;#39;ll be giving you live updates via text if anything happens.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t going to dispute him. Wade gets results, one way or another. He knows what he&amp;#39;s doing, even if sometimes it seems like he doesn&amp;#39;t. I agreed to his plan and came home. Sara isn&amp;#39;t back yet, but she did text me pictures of some shoes she wanted. I responded as if everything was perfectly fine, but I know it&amp;#39;s not. And she knows it isn&amp;#39;t. But I suppose things have been that way around here for a while. I had to put on a brave face for Sara and pretend I was okay after her mother died. Obviously I wasn&amp;#39;t, and I&amp;#39;m sure Sara realizes that, but I had to be strong for her. And now, after Katie&amp;#39;s story, it just makes me wonder if Sara and I should have talked about it more. Maybe something broke inside of her that day that pushed her to this man and whatever cult she must have joined. That&amp;#39;s my current theory, anyway.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll update you guys when I can. Hopefully Wade&amp;#39;s stake out goes well tonight, and hopefully Sara doesn&amp;#39;t have to feel any more pain, inflicted by herself or anyone else.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/659k62/my_daughter_has_changed_since_her_vacation_part_3/\"&gt;Part 3&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Part 1](https://www.reddit.com/r/nosleep/comments/64ujhv/my_daughter_has_changed_since_her_vacation_part_1/)\n\nIn case you missed part 1, I suggest reading it first to catch up with what has happened so far.\n\nLast night Sara came home and seemed her normal self. I was watching a movie in the living room and she came right over and joined me. It was nice to just sit there with my daughter and feel like a family, but I had an uneasy feeling inside of me. Considering what had been happening and what I discovered in her room, I knew I couldn't let the normalcy persist. I had to ask her questions and hope she would give me answers.\n\n\"Sara... I saw the binder.\" I paused the movie as I waited patiently for her to respond.\n\n\"You were in my room?\" she asked, her voice was very quiet.\n\n\"Yes. I know it was an inva-\" before I could finish she cut me off.\n\n\"Did he see you?!\" she asked in a loud whisper. \"Please tell me he didn't see you, daddy!\" Her eyes were already tearing up, Sara truly feared whoever this man was.\n\nI put my hands on her shoulders. \"There was no one in your room... I thought I heard a man laughing, but that wouldn't have made any sense. What, no, who are you talking about? You have to tell me.\"\n\nShe began sobbing, my hands still resting on her shoulders which were heaving up and down as she cried her eyes out. I was upset, angry, but most of all dumbfounded. Nothing was adding up. Why had Sara been behaving oddly? What was with that binder? Who was the man she kept talking about? Was he even a man? Her tears continued to pour out as I began to shush her and went in for a hug. That's when she grabbed me by the throat and pushed me down. With her above me, I was pinned against the couch as she tried her hardest to choke the life out of me.\n\n\"Why? Why did you go in there?!\" Sara screamed and continued to squeeze as hard as she could. \"He's going to be angry!\"\n\nI was in a lot of pain, and she was doing a good job of choking me, but I knew I had to get out of this. I didn't want to her hurt, but I grabbed her by her arms and tried to pull her arms away from me. She resisted, and I ended up ripping a chunk of each sleeve off of her shirt. I mustered enough strength to break her grip and I rolled out from under her. She stood up by the couch and watched me as I stood up. That's when I saw them.\n\nHer scars.\n\nHer arms had a lot of scars. She had been cutting herself and wearing long sleeves to hide it. Considering how crazy everything was and remembering the weird symbol I found on the cover of her binder, plus taking into account the dried blood on the pictures, I pieced together a theory.\n\n\"Did you join some kind of cult, Sara? The symbol on your binder, it looked almost demonic. You've been cutting yourself, you're talking about some angry 'man'. This is all bat shit crazy! What happened while you were gone?\"\n\nShe didn't respond. Instead she ran up to her room. I gave chase, but she beat me there and locked the door behind her. I banged on it as loud as I could. \"Sara! Sara open the damn door right now!\" I continue to pound on the door, I even gave some thought to kicking it in, but I decided against it.\n\n\"Go away! He's upset! I have to be punished!\"\n\nI didn't know what sort of demonic entity or devil my daughter thought she was communing with, but regardless these delusions were making her a danger to others and herself.\n\n\"Don't hurt yourself, sweetheart, please listen to me. We can talk. We can get you help.\"\n\nFrom the other side of the door came a response, but it wasn't the one I wanted. And it didn't come from my little girl.\n\nI heard laughter. The same laughter I had heard when I searched her room, but this time it was loud. It sounded like it was coming from everywhere around me, not just Sara's room. I'm pretty sure the house even started to shake. I held my ears, and that's the last thing I remember before waking up in my bed this morning.\n\nI shot out of my room as fast as I could and bolted for Sara's room. The door was open. She wasn't inside. I ran downstairs and found a note on the dining room table.\n\n\"Went to mall with friends, be back later! xoxo\"\n\nAgain, Sara did something normal despite all of the craziness going on around her. Still, I had to know what happened last night. I took out my phone to call her, but I saw that I had a text from a number I didn't recognize. I opened it to find a picture. It was a picture of Sara on the beach during Spring Break. The picture was taken from a fair distance, but Sara was posing for a different picture being taken by one of her friends, Katie. I called the number that sent me the text, but it went straight to voicemail. I replied to the text asking who this was, but I've still yet to get anything back.\n\nAfter I had some time to think things over, I decided that continuously confronting Sara about this whole ordeal may not be the best idea. Instead, I figured Katie could potentially provide some answers. I got ready and drove to Katie's house, expecting to meet her parents at the door. Instead, Katie answered.\n\n\"Oh. Mr. Wallace, what are you doing here? Is Sara okay?\"\n\nI shook my head. \"I don't think so. That's actually what I came over for. I had a feeling you'd be with her at the mall right now and was hoping I could at least talk to your parents, but talking to you will be even better.\"\n\nShe opened the door wider and motioned for me to come in. \"My parents are at work, but I was actually just making me a grilled cheese sandwich. Do you want one?\"\n\n\"No, I'm not hungry. But thank you, Katie.\" I entered and sat down on the couch in the living room. Moments later Katie sat across from me on another couch, her sandwich in hand and a glass of water to wash it down with.\n\n\"So, what's going on with Sara?\" Katie took a bite of her sandwich. \n\nI explained everything to Katie, who continued eating throughout the story until she had finished her meal. She was finishing her water as I concluded my tale. \"And then seeing you in the picture made me think that maybe you saw something happen, or maybe someone she was with, that could help explain her weird behavior.\"\n\nKatie looked around the room while she was thinking. I could tell she was more than a little nervous.\n\n\"Anything, Katie. Anything at all that could help me get to the bottom of this and help Sara before she does damage to herself that can't be repaired.\"\n\nKatie took in a deep breath and slowly exhaled. \"The last day we were there, that morning we all woke up before her. Weird, considering how she always gets up bright and early. I don't remember much from the night before, we were pretty hammered...\"\n\nI shake my head, something Katie paused for. \"I mean you had to know.\"\n\n\"I figured, yeah. Go on.\" I aggressively rubbed my brow while Katie continued.\n\n\"So, I went to get her up after a while and she was just laying down flat on top of the covers. Her hair was a mess, like she had been tossing and turning all night prior to this. She was definitely asleep, but she was whispering.\" Katie trailed off, losing a bit of her composure. \"It was the strangest thing. I shivered listening to her whisper like that.\"\n\n\"What was she saying?\" I pressed.\n\n\"I don't know if I heard everything she said. But she kept repeating a few different things. She said 'mom' a lot. There was something about 'not making him angry again'. And the only other thing I really remember... was about you.\" Katie looked down at the floor.\n\n\"What about me? What did she say?\"\n\n\"She said you were going to die soon. That 'he' was going to kill you.\" Katie rubbed her hands nervously. \"I'm sorry, I know it was weird and I probably should have said something sooner, but I just thought she was having a bad dream.\"\n\nI was shaken, I won't lie. Still, I had to make sure Katie knew she didn't do anything wrong. \"Don't blame yourself, you couldn't have known. Thank you for your help, Katie.\" I hugged her and was on my way.\n\nMy next stop was the police station. I had undoubtedly heard a masculine laugh the night before, and while I feel like Sara has gotten involved with some evil cult, I refuse to believe that what I heard was a demon, or even the devil himself. There must have been a man in my house, hiding somewhere in my daughter's room. This infuriated me, but I was in no state to run home and try to find him, if he was even still there. I had a lot of questions. Who was he? Why was he going to kill me? What was the connection between Sara's whispers that morning? Why was she whispering about her mother?\n\nI couldn't answer these questions, and I knew Sara would be no help. So I met with one of my oldest friends, he's a detective here in town. Detective Wade. He and I go way back to Junior High School. I know it's outside of his job description, but I didn't want him to conduct a standard investigation. I didn't want to get caught up in the red tape. I wanted him to help me solve this thing and take out this man before he could hurt me or my daughter. Luckily, Wade had the kind of rebellious personality that would allow him to go for something like this.\n\n\"Hell yeah I'll help you catch this son of a bitch. You and Sara are family, and I'm not going to let anyone get away with hurting my family.\" Wade said as we met over coffee. \"If we did this by the books I'm guessing we'd find the guy, sure, especially if he's in your home. But we'd have to book him and take him straight to jail. This way he has to pay for messing with Sara before he gets locked up. And if we play our cards right, maybe we can gather evidence that he's doing more than just trespassing on your property. I don't figure Sara would give this guy up if she's so afraid of him, but if we can get proof of him doing something malicious we'll put him in a cell for much longer.\"\n\n\"What did you have in mind?\" I had to question Wade. As much as I wanted this bastard to feel some of the pain he's made my daughter feel, I know Wade can go overboard. The last thing we need is Wade killing him. Still, I had to know how he planned to gather more damning evidence. We didn't even know for sure that some mystery man was hiding away in my house, and if he was we didn't know if he was always there. When does he come and go? Is he ever active while I'm asleep? Is he drinking my beer?!\n\n\"I'll stake the place out at night, from a distance. I'll get a view of Sara's window and see what I can spot going on in there at night time. I'll make sure to record anything. And if I see this guy I'll let you know, I'll be giving you live updates via text if anything happens.\"\n\nI wasn't going to dispute him. Wade gets results, one way or another. He knows what he's doing, even if sometimes it seems like he doesn't. I agreed to his plan and came home. Sara isn't back yet, but she did text me pictures of some shoes she wanted. I responded as if everything was perfectly fine, but I know it's not. And she knows it isn't. But I suppose things have been that way around here for a while. I had to put on a brave face for Sara and pretend I was okay after her mother died. Obviously I wasn't, and I'm sure Sara realizes that, but I had to be strong for her. And now, after Katie's story, it just makes me wonder if Sara and I should have talked about it more. Maybe something broke inside of her that day that pushed her to this man and whatever cult she must have joined. That's my current theory, anyway.\n\nI'll update you guys when I can. Hopefully Wade's stake out goes well tonight, and hopefully Sara doesn't have to feel any more pain, inflicted by herself or anyone else.\n\n[Part 3](https://www.reddit.com/r/nosleep/comments/659k62/my_daughter_has_changed_since_her_vacation_part_3/)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "6521u2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 115, "report_reasons": null, "author": "ThisIsFriday", "saved": false, "mod_reports": [], "name": "t3_6521u2", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492131445.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/6521u2/my_daughter_has_changed_since_her_vacation_part_2/", "num_reports": null, "locked": false, "stickied": false, "created": 1492070727.0, "url": "https://www.reddit.com/r/nosleep/comments/6521u2/my_daughter_has_changed_since_her_vacation_part_2/", "author_flair_text": null, "quarantine": false, "title": "My Daughter Has Changed Since Her Vacation (Part 2) - The Whispers", "created_utc": 1492041927.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 115}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": "", "user_reports": [], "id": "dg6t47w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_6521u2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F6521u2%2Fmy_daughter_has_changed_since_her_vacation_part_2%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;to=RemindMeBot&amp;subject=Reminder) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F6521u2%2Fmy_daughter_has_changed_since_her_vacation_part_2%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;to=RemindMeBot&amp;amp;subject=Reminder\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6t47w", "score_hidden": true, "stickied": true, "created": 1492070807.0, "created_utc": 1492042007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": "", "user_reports": [], "id": "dg73cgz", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Kemfox", "parent_id": "t3_6521u2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"Is he drinking my beer?!\" \nI'd be concerned about my beer, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Is he drinking my beer?!&amp;quot; \nI&amp;#39;d be concerned about my beer, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg73cgz", "score_hidden": false, "stickied": false, "created": 1492083767.0, "created_utc": 1492054967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": "", "user_reports": [], "id": "dg7hh8g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "IAmGoalie", "parent_id": "t1_dg7ary3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "If the 'man' saw him in the room before and he heard laughing, chances are he will see OP put up the cameras and be able to remove them without issue/being spotted. however set up cameras in the rest of the house, and maybe you could set up a camera looking into her room from the outside? might be a safer bet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the &amp;#39;man&amp;#39; saw him in the room before and he heard laughing, chances are he will see OP put up the cameras and be able to remove them without issue/being spotted. however set up cameras in the rest of the house, and maybe you could set up a camera looking into her room from the outside? might be a safer bet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7hh8g", "score_hidden": false, "stickied": false, "created": 1492116140.0, "created_utc": 1492087340.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ary3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Callilunasa", "parent_id": "t1_dg78k2k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Seconded! You need to know what's going on in her room. I'm pretty certain your friend Wade could get his hands on some pretty sophisticated, and more importantly, small cameras.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seconded! You need to know what&amp;#39;s going on in her room. I&amp;#39;m pretty certain your friend Wade could get his hands on some pretty sophisticated, and more importantly, small cameras.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7ary3", "score_hidden": false, "stickied": false, "created": 1492099026.0, "created_utc": 1492070226.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78k2k", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "beansnap", "parent_id": "t3_6521u2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Security cameras​ everywhere!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Security cameras​ everywhere!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg78k2k", "score_hidden": false, "stickied": false, "created": 1492093100.0, "created_utc": 1492064300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": "", "user_reports": [], "id": "dg7bw0k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t3_6521u2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Something definitely broke inside me when my mother died, even though I was prepared for it. It seems like the sudden death of your wife stirred something up in your daughter, maybe even making her an easy target for darkness. I hope you and your police friend are able to get to the bottom of this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something definitely broke inside me when my mother died, even though I was prepared for it. It seems like the sudden death of your wife stirred something up in your daughter, maybe even making her an easy target for darkness. I hope you and your police friend are able to get to the bottom of this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7bw0k", "score_hidden": false, "stickied": false, "created": 1492102354.0, "created_utc": 1492073554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6521u2", "likes": null, "replies": "", "user_reports": [], "id": "dg6z77b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6yz22", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6z77b", "score_hidden": false, "stickied": false, "created": 1492078253.0, "created_utc": 1492049453.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yz22", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6w88k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6yz22", "score_hidden": false, "stickied": false, "created": 1492077975.0, "created_utc": 1492049175.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w88k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "creepypgirl79", "parent_id": "t3_6521u2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "this cant be a real dude...this sounds more demonic than anything. but I know most sceptics need.to rule out all possibilities before considering this as an option. It sounds like she s performing blood rituals maybe to bring her mom back and in place give you up as sacrifice...idk....all i can tell is your in a lot of danger and i hope you get the help you guys need.  good luck op....your gonna need it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this cant be a real dude...this sounds more demonic than anything. but I know most sceptics need.to rule out all possibilities before considering this as an option. It sounds like she s performing blood rituals maybe to bring her mom back and in place give you up as sacrifice...idk....all i can tell is your in a lot of danger and i hope you get the help you guys need.  good luck op....your gonna need it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6w88k", "score_hidden": false, "stickied": false, "created": 1492074565.0, "created_utc": 1492045765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]