[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64ahar/the_white_room/\"&gt;Part 1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64jsub/the_white_room_part_2/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64sx6f/the_white_room_part_3/\"&gt;Part 3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It would be quite a while until my next death. Over fifty years in fact. I was eighty-seven when I died for the fourth time, and this time I was ready. My wife had passed a few months earlier, my children had been raised, and their children were almost ready for college. I had left my affairs in order, and even amassed a decent wealth to leave behind for my family. There wasn&amp;#39;t a single worry on my shoulders when I fell asleep for the last time. &lt;/p&gt;\n\n&lt;p&gt;I awoke in The White Room, and greeted Death with a smile for the first time. He took the form of a small child this time, maybe around six or seven. He bowed his head with a knowing smile and greeted me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Welcome back, Kennon.&amp;quot; He said in a light tone, his voice holding more authority than any child&amp;#39;s should. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello, Death. It has been some time, hasn&amp;#39;t it?&amp;quot; I stated with a smile. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Indeed it has! Tell me, was your life everything you wanted it to be?&amp;quot; He asked, seeming genuinely interested. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And more, Death. And more. Thank you for the second chances, by the way. I know I was a bit malicious in my previous arrivals. I was young, and unprepared to look you in the eye.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The years had given me a form of false wisdom that I clung to in my later years. Death nodded at my words with a smile. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, have you decided what you want?&amp;quot; He asked. &lt;/p&gt;\n\n&lt;p&gt;I raised a brow, curious as to what he meant. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well...aren&amp;#39;t I ready to move on?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Of course you are. What would you like to move on to, I mean.&amp;quot; He asked&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I...I&amp;#39;m afraid I don&amp;#39;t understand. I have a choice in my afterlife?&amp;quot; I asked, my voice delivering my state of confusion. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Of course. You have already made a couple choices, so why is this time any different?&amp;quot; He asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes, but my choices before were to go back to living. This is about my afterlife...&amp;quot; I stated. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t see the difference. You died before, and chose to move onto something else. Yes, it was similar to your old life, almost identical, but you did choose an afterlife.&amp;quot; He said calmly. &lt;/p&gt;\n\n&lt;p&gt;I paused for a moment. The revelation slowly coming to me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, my life has been my afterlife?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And the one before that as well. This will be your third afterlife by my count.&amp;quot; Death stated. &lt;/p&gt;\n\n&lt;p&gt;His words cut deep, and I had a sense of dread as I realized that my entire previous life had been a fabrication of some otherworldly being.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So none of it was real? It was all just...just...&amp;quot; I started. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Just for you? Well, yes, in a sense. It was no different of a reality than the first one. I don&amp;#39;t see why you would be upset. You got what you asked for.&amp;quot; He stated. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But it wasn&amp;#39;t real. It was just in my head, or in your head, or God&amp;#39;s or whatever! It was just some product of you otherworldly....things.&amp;quot; I stated, my confusion creating a sense of anger. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why would that mean it wasn&amp;#39;t real? Does that mean your first life wasn&amp;#39;t real because it&amp;#39;s creator fabricated it all? Everything you have ever been apart of is a creation of someone else. You will need to accept that should you wish to move on.&amp;quot; He stated. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Move on to where?&amp;quot; I asked as I heard the first mention of a true afterlife. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Anywhere. Wherever you want.&amp;quot; He said. &lt;/p&gt;\n\n&lt;p&gt;I sighed. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why can&amp;#39;t there just be a default place to go...&amp;quot; I asked absently. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well, there are sometimes. The Christians created their own afterlife in a sense. Their &amp;quot;Heaven&amp;quot; is this cloudy place with winged people floating everywhere. You could try that out if you prefer.&amp;quot; Death said with a shrug. &lt;/p&gt;\n\n&lt;p&gt;I shook my head in disbelief. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So every religion is right?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Nope. And yes. If you are looking for a right or wrong place, we are going to sit here for a while. Here, let me give you an example...&amp;quot; He started. &lt;/p&gt;\n\n&lt;p&gt;I sat back, preparing for his words. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I once had the pleasure of escorting a rather young man to the place he knew as Hell. Now, he had just as much choice as you have to go anywhere he wanted. But he created a mental image of this Hell, and he went there. Why? Because he thought he deserved to. He was a christian, and a bad one at that. He broke his bible&amp;#39;s commandments left and right, knowingly. Now, why do you think he chose Hell as an afterlife?&amp;quot; Death asked. &lt;/p&gt;\n\n&lt;p&gt;I shrugged, not getting the point of the story. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Because it was the only option he knew in his head.&amp;quot; Death stated. &amp;quot;You don&amp;#39;t follow a religion, and your first request of an afterlife was another shot at life. Which was granted. So, this is no different. Simply make your request, and we can move on.&amp;quot; Death stated. &lt;/p&gt;\n\n&lt;p&gt;I sat back, thinking for a few moments. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What did Cae choose?&amp;quot; I asked, memories of my wife flooding back. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;She chose to explore.&amp;quot; Death stated simply. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Explore? Explore what?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Everything. A dangerous request, as some things are best left unexplored. But it was her request, and it was delivered.&amp;quot; He said. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Is she safe?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;With all the knowledge in existence at her fingertips? I would say far from it.&amp;quot; Death said. &lt;/p&gt;\n\n&lt;p&gt;I frowned at the idea of Cae getting into trouble, but nodded. She was always adventurous, and that afterlife would suit her. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Could I follow her? Take the path she went down?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Not yet.&amp;quot; He said firmly. &lt;/p&gt;\n\n&lt;p&gt;I meant to push the point, but found myself lacking the words. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay. Can I ask something? Why do you exist? Why does life have to end?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;He smiled at me, his childish grin almost amusing to me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t know. It is not in my nature to wonder, only to take something from one place, and move it to another. Imagine a box filled with rocks. The box is endlessly refilled with more rocks until it overflows. The rocks that fall out must be moved somewhere else. I am the person that moves them somewhere else. At least until there is more room in the box again.&amp;quot; Death stated. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So Earth is the box?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;Death simply smiled, and shook his head. &lt;/p&gt;\n\n&lt;p&gt;I pondered what that meant for a moment, but thought it better not to ask. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I just want to move on. I don&amp;#39;t know what to. I hadn&amp;#39;t planned for this choice. Just...can I start over? A fresh start?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t know or think about the consequences of my questions, or consider it would be taken as a request. But it was. &lt;/p&gt;\n\n&lt;p&gt;Death nodded, and then once again, he was gone. &lt;/p&gt;\n\n&lt;p&gt;I walked to the door, and turned the handle. I opened the door, and that was the end of my first life. &lt;/p&gt;\n\n&lt;p&gt;I was born again on June 17th, 1994. I was a green eyed, blond haired baby born to Scott and Elizabeth Taylor. They named me Edward, after Scott&amp;#39;s Father, and raised me in a small, modest home in the outskirts of Seattle, Washington. &lt;/p&gt;\n\n&lt;p&gt;The person I was before had never died, because he had never existed. Not in the same space I was in, anyway. My memories of my old life were gone. I was a completely new person, with the infinite world before me. I would live a completely normal life, until my next death. Obviously I gained my memories back at one point, and I will of course share that with you. &lt;/p&gt;\n\n&lt;p&gt;But that will have to wait until next time. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/65bnju/the_white_room_part_5/\"&gt;Part 5&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Part 1] (https://www.reddit.com/r/nosleep/comments/64ahar/the_white_room/)\n\n[Part 2] (https://www.reddit.com/r/nosleep/comments/64jsub/the_white_room_part_2/)\n\n[Part 3] (https://www.reddit.com/r/nosleep/comments/64sx6f/the_white_room_part_3/)\n\n\n  It would be quite a while until my next death. Over fifty years in fact. I was eighty-seven when I died for the fourth time, and this time I was ready. My wife had passed a few months earlier, my children had been raised, and their children were almost ready for college. I had left my affairs in order, and even amassed a decent wealth to leave behind for my family. There wasn't a single worry on my shoulders when I fell asleep for the last time. \n\n  I awoke in The White Room, and greeted Death with a smile for the first time. He took the form of a small child this time, maybe around six or seven. He bowed his head with a knowing smile and greeted me. \n\n\"Welcome back, Kennon.\" He said in a light tone, his voice holding more authority than any child's should. \n\n\"Hello, Death. It has been some time, hasn't it?\" I stated with a smile. \n\n\"Indeed it has! Tell me, was your life everything you wanted it to be?\" He asked, seeming genuinely interested. \n\n\"And more, Death. And more. Thank you for the second chances, by the way. I know I was a bit malicious in my previous arrivals. I was young, and unprepared to look you in the eye.\" \n\n  The years had given me a form of false wisdom that I clung to in my later years. Death nodded at my words with a smile. \n\n\"So, have you decided what you want?\" He asked. \n\n  I raised a brow, curious as to what he meant. \n\n\"Well...aren't I ready to move on?\" \n\n\"Of course you are. What would you like to move on to, I mean.\" He asked\n\n\"I...I'm afraid I don't understand. I have a choice in my afterlife?\" I asked, my voice delivering my state of confusion. \n\n\"Of course. You have already made a couple choices, so why is this time any different?\" He asked. \n\n\"Yes, but my choices before were to go back to living. This is about my afterlife...\" I stated. \n\n\"I don't see the difference. You died before, and chose to move onto something else. Yes, it was similar to your old life, almost identical, but you did choose an afterlife.\" He said calmly. \n\n  I paused for a moment. The revelation slowly coming to me. \n\n\"So, my life has been my afterlife?\" I asked. \n\n\"And the one before that as well. This will be your third afterlife by my count.\" Death stated. \n\n  His words cut deep, and I had a sense of dread as I realized that my entire previous life had been a fabrication of some otherworldly being.  \n\n\"So none of it was real? It was all just...just...\" I started. \n\n\"Just for you? Well, yes, in a sense. It was no different of a reality than the first one. I don't see why you would be upset. You got what you asked for.\" He stated. \n\n\"But it wasn't real. It was just in my head, or in your head, or God's or whatever! It was just some product of you otherworldly....things.\" I stated, my confusion creating a sense of anger. \n\n\"Why would that mean it wasn't real? Does that mean your first life wasn't real because it's creator fabricated it all? Everything you have ever been apart of is a creation of someone else. You will need to accept that should you wish to move on.\" He stated. \n\n\"Move on to where?\" I asked as I heard the first mention of a true afterlife. \n\n\"Anywhere. Wherever you want.\" He said. \n\n  I sighed. \n\n\"Why can't there just be a default place to go...\" I asked absently. \n\n\"Well, there are sometimes. The Christians created their own afterlife in a sense. Their \"Heaven\" is this cloudy place with winged people floating everywhere. You could try that out if you prefer.\" Death said with a shrug. \n\n  I shook my head in disbelief. \n\n\"So every religion is right?\" I asked. \n\n\"Nope. And yes. If you are looking for a right or wrong place, we are going to sit here for a while. Here, let me give you an example...\" He started. \n\n  I sat back, preparing for his words. \n\n\"I once had the pleasure of escorting a rather young man to the place he knew as Hell. Now, he had just as much choice as you have to go anywhere he wanted. But he created a mental image of this Hell, and he went there. Why? Because he thought he deserved to. He was a christian, and a bad one at that. He broke his bible's commandments left and right, knowingly. Now, why do you think he chose Hell as an afterlife?\" Death asked. \n\n  I shrugged, not getting the point of the story. \n\n\"Because it was the only option he knew in his head.\" Death stated. \"You don't follow a religion, and your first request of an afterlife was another shot at life. Which was granted. So, this is no different. Simply make your request, and we can move on.\" Death stated. \n\n  I sat back, thinking for a few moments. \n\n\"What did Cae choose?\" I asked, memories of my wife flooding back. \n\n\"She chose to explore.\" Death stated simply. \n\n\"Explore? Explore what?\" I asked. \n\n\"Everything. A dangerous request, as some things are best left unexplored. But it was her request, and it was delivered.\" He said. \n\n\"Is she safe?\" I asked. \n\n\"With all the knowledge in existence at her fingertips? I would say far from it.\" Death said. \n\n  I frowned at the idea of Cae getting into trouble, but nodded. She was always adventurous, and that afterlife would suit her. \n\n\"Could I follow her? Take the path she went down?\" I asked. \n\n\"Not yet.\" He said firmly. \n\n  I meant to push the point, but found myself lacking the words. \n\n\"Okay. Can I ask something? Why do you exist? Why does life have to end?\" I asked. \n\nHe smiled at me, his childish grin almost amusing to me. \n\n\"I don't know. It is not in my nature to wonder, only to take something from one place, and move it to another. Imagine a box filled with rocks. The box is endlessly refilled with more rocks until it overflows. The rocks that fall out must be moved somewhere else. I am the person that moves them somewhere else. At least until there is more room in the box again.\" Death stated. \n\n\"So Earth is the box?\" I asked. \n\n  Death simply smiled, and shook his head. \n\n  I pondered what that meant for a moment, but thought it better not to ask. \n\n\"I just want to move on. I don't know what to. I hadn't planned for this choice. Just...can I start over? A fresh start?\" I asked. \n\n  I didn't know or think about the consequences of my questions, or consider it would be taken as a request. But it was. \n\n  Death nodded, and then once again, he was gone. \n\n  I walked to the door, and turned the handle. I opened the door, and that was the end of my first life. \n\n  I was born again on June 17th, 1994. I was a green eyed, blond haired baby born to Scott and Elizabeth Taylor. They named me Edward, after Scott's Father, and raised me in a small, modest home in the outskirts of Seattle, Washington. \n\n  The person I was before had never died, because he had never existed. Not in the same space I was in, anyway. My memories of my old life were gone. I was a completely new person, with the infinite world before me. I would live a completely normal life, until my next death. Obviously I gained my memories back at one point, and I will of course share that with you. \n\n  But that will have to wait until next time. \n\n[Part 5] (https://www.reddit.com/r/nosleep/comments/65bnju/the_white_room_part_5/)\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "652ofo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 200, "report_reasons": null, "author": "Kennon02", "saved": false, "mod_reports": [], "name": "t3_652ofo", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492163454.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/652ofo/the_white_room_part_4/", "num_reports": null, "locked": false, "stickied": false, "created": 1492077919.0, "url": "https://www.reddit.com/r/nosleep/comments/652ofo/the_white_room_part_4/", "author_flair_text": null, "quarantine": false, "title": "The White Room [Part 4]", "created_utc": 1492049119.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 200}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": "", "user_reports": [], "id": "dg6yzol", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_652ofo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F652ofo%2Fthe_white_room_part_4%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;to=RemindMeBot&amp;subject=Reminder) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F652ofo%2Fthe_white_room_part_4%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;to=RemindMeBot&amp;amp;subject=Reminder\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg6yzol", "score_hidden": true, "stickied": true, "created": 1492077997.0, "created_utc": 1492049197.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": "", "user_reports": [], "id": "dg797kf", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t3_652ofo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I love this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg797kf", "score_hidden": false, "stickied": false, "created": 1492094727.0, "created_utc": 1492065927.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": "", "user_reports": [], "id": "dg788tc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg76p9i", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I like your wording on that. Hell is what we make it. I can't say I have ever thought about damning myself to a self created hell, but It sure does make the mind wonder. I wonder what kind of Hell my mind would think up, or if the hell we imagine already exists, and is simply waiting for those who think they deserve to go there. I hope to never find out about these infinite hells, thats for sure. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like your wording on that. Hell is what we make it. I can&amp;#39;t say I have ever thought about damning myself to a self created hell, but It sure does make the mind wonder. I wonder what kind of Hell my mind would think up, or if the hell we imagine already exists, and is simply waiting for those who think they deserve to go there. I hope to never find out about these infinite hells, thats for sure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg788tc", "score_hidden": false, "stickied": false, "created": 1492092377.0, "created_utc": 1492063577.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76p9i", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SadouMaou", "parent_id": "t1_dg7517j", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Remember, hell is just what we make it. The person who decided to go to hell created hell, a different hell to the other people who created their own hells.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember, hell is just what we make it. The person who decided to go to hell created hell, a different hell to the other people who created their own hells.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg76p9i", "score_hidden": false, "stickied": false, "created": 1492089132.0, "created_utc": 1492060332.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7517j", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "iliveanotherlife", "parent_id": "t3_652ofo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Maybe you ARE in hell. This sounds like a frustrating situation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you ARE in hell. This sounds like a frustrating situation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7517j", "score_hidden": false, "stickied": false, "created": 1492086319.0, "created_utc": 1492057519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": "", "user_reports": [], "id": "dg86b8z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bats_mistress", "parent_id": "t1_dg83y0k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "(Blush) just don't stop writing or I may become your Annie Wilkes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Blush) just don&amp;#39;t stop writing or I may become your Annie Wilkes&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg86b8z", "score_hidden": false, "stickied": false, "created": 1492144245.0, "created_utc": 1492115445.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83y0k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg83md7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You may have just become my favorite reader with your utilization of words. I commend you, reader. ", "edited": 1492113106.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may have just become my favorite reader with your utilization of words. I commend you, reader. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg83y0k", "score_hidden": false, "stickied": false, "created": 1492141638.0, "created_utc": 1492112838.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": "", "user_reports": [], "id": "dg8mdo1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thisbrokenlife_", "parent_id": "t1_dg83md7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh god that sounds like me every time I finish a book, or a good game. Don't know what to do with my life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh god that sounds like me every time I finish a book, or a good game. Don&amp;#39;t know what to do with my life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8mdo1", "score_hidden": false, "stickied": false, "created": 1492165291.0, "created_utc": 1492136491.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83md7", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Bats_mistress", "parent_id": "t1_dg81zmp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There will be a brief period of depression, as there always is when I finish a treasured book.... I'll wander aimlessly for days, unable to cope with the loss.... the world will seem colorless and dull for a while as I ponder my existence. I'll try and fail to find something else to fill the void. I'll be overly critical every time I start to read something and it doesn't measure up, then I'll stop reading anything altogether because I've become convinced that I can never love again. \n\nMonths later, like a beacon of light and hope, I'll find another literary treasure to immerse myself in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There will be a brief period of depression, as there always is when I finish a treasured book.... I&amp;#39;ll wander aimlessly for days, unable to cope with the loss.... the world will seem colorless and dull for a while as I ponder my existence. I&amp;#39;ll try and fail to find something else to fill the void. I&amp;#39;ll be overly critical every time I start to read something and it doesn&amp;#39;t measure up, then I&amp;#39;ll stop reading anything altogether because I&amp;#39;ve become convinced that I can never love again. &lt;/p&gt;\n\n&lt;p&gt;Months later, like a beacon of light and hope, I&amp;#39;ll find another literary treasure to immerse myself in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg83md7", "score_hidden": false, "stickied": false, "created": 1492141293.0, "created_utc": 1492112493.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81zmp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg7pi5m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I am glad to see you so interested in my story. Though I do wonder what you will do when it ends. No one lives forever, my friend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am glad to see you so interested in my story. Though I do wonder what you will do when it ends. No one lives forever, my friend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg81zmp", "score_hidden": false, "stickied": false, "created": 1492139523.0, "created_utc": 1492110723.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pi5m", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Bats_mistress", "parent_id": "t3_652ofo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "And again, I ask for another serving. Quickly, please? It's just so delicious...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And again, I ask for another serving. Quickly, please? It&amp;#39;s just so delicious...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7pi5m", "score_hidden": false, "stickied": false, "created": 1492126206.0, "created_utc": 1492097406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652ofo", "likes": null, "replies": "", "user_reports": [], "id": "dg8mc5j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thisbrokenlife_", "parent_id": "t3_652ofo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I love this. I'm so excited for more! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this. I&amp;#39;m so excited for more! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8mc5j", "score_hidden": false, "stickied": false, "created": 1492165232.0, "created_utc": 1492136432.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]