[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everyone knows the show &amp;quot;Catfish&amp;quot; right?  You know, the one where people get deceived online and then when they meet the person they were interested in in real life, that person is like an ogre?&lt;/p&gt;\n\n&lt;p&gt;Watch an episode or two if you don&amp;#39;t know what I am talking about.  Anyway, so like usually it goes that some poor schlub sees a girl online and, well, let&amp;#39;s just say she&amp;#39;s like a strong 9 and he&amp;#39;s like a 4 on a good day.  You see the dilemma right?&lt;/p&gt;\n\n&lt;p&gt;And then this guy will meet the girl and she&amp;#39;s like a -2 and has like three kids.  Then they all talk about their feelings and usually leave things for the better.&lt;/p&gt;\n\n&lt;p&gt;Why am I talking about this? Well, a few weeks ago, some friends of mine (a group of a couple young guys and a girl) were trying to think of a good project for their film class.  They thought about making a horror movie (I was going to play a part in it, apparently), but they decided that would be too obvious.&lt;/p&gt;\n\n&lt;p&gt;So, instead they thought, &amp;quot;Why don&amp;#39;t we make some kind of documentary?&amp;quot; It took them a while to think of it, but one night they were watching TV and the show &amp;quot;Catfish&amp;quot; came on.  They suddenly realized, &amp;quot;We could do this!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Their angle was that they wouldn&amp;#39;t alert the catfish ahead of time that they were coming to meet.  They would just ambush them, you know, when they least expected it.  As one of the guys, Luke, put it,&amp;quot;It&amp;#39;s like a combination of &amp;quot;Catfish&amp;quot; and &amp;quot;Cheaters.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I thought it seemed interesting, but I realized that there could be some danger in what they were attempting.  I mean, they would be dealing with people that, by definition, were liars.  They could also be criminals, rapists, or God-knows-what.&lt;/p&gt;\n\n&lt;p&gt;But they insisted they would be fine.  &amp;quot;We&amp;#39;re in a group, and we have cameras,&amp;quot; Violet, the girl, said.&lt;/p&gt;\n\n&lt;p&gt;I warned them that a camera would be of little use to them when Bubba-With-an-Axe came swinging out of his trailer door.  But they were so confident in their abilities that I gave up protesting.&lt;/p&gt;\n\n&lt;p&gt;Initially, they asked if I could help them by reaching out to possible victims and asking if they wanted to join the show.  I agreed, posted a Tweet with information on how to contact us, and then set up an email account for the crew.&lt;/p&gt;\n\n&lt;p&gt;It didn&amp;#39;t take all that long, surprisingly enough, to find people who wanted to be a part of the show.  Maybe they thought it was even the real thing.&lt;/p&gt;\n\n&lt;p&gt;In any case, I scanned through the list of possible stories and found one that stood out.  It was a young lady who had been talking to a guy for about three years.  She said that he had made the first move when she was in her senior year of high school.&lt;/p&gt;\n\n&lt;p&gt;She thought he was cute and messaged him back.  Eventually they started talking more, you know the usual story.  But what made this one so interesting was that it turned out that the guy let it slip that he might be married.&lt;/p&gt;\n\n&lt;p&gt;Obviously, the girl was devastated.  She called him and told him to come clean, and he did.  He admitted he was married, but he claimed that he had &amp;quot;cut it off&amp;quot; with his wife.  &lt;/p&gt;\n\n&lt;p&gt;The girl was pleased, at first, but she started to get nervous about meeting him.  He had lied about being married, and she knew it wasn&amp;#39;t so easy to get a divorce.&lt;/p&gt;\n\n&lt;p&gt;So she took up our offer and asked to join the show.  I was intrigued and immediately wrote her back and told her that the crew wanted to meet her.&lt;/p&gt;\n\n&lt;p&gt;Needless to say, they weren&amp;#39;t too happy that I had planned a meeting without even telling them first.  But when they read her story, they all got excited.&lt;/p&gt;\n\n&lt;p&gt;The next day, we met with the girl at a Starbucks and asked her to tell her story in person.  They got the obligatory footage of her tale and then asked for the perp&amp;#39;s details.&lt;/p&gt;\n\n&lt;p&gt;She provided them and informed the crew that he actually lived pretty close near by.&lt;/p&gt;\n\n&lt;p&gt;After about two hours, they finished up and decided to plot when he might be home.  The girl told them that he worked a normal nine to five job, so he should be there in the evenings.&lt;/p&gt;\n\n&lt;p&gt;With that, they decided to have her call the guy and make sure he was there.&lt;/p&gt;\n\n&lt;p&gt;He answered, I suppose, because she talked to him for about a half hour before finally hanging up.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;ll be there tonight,&amp;quot; she explained.&lt;/p&gt;\n\n&lt;p&gt;The crew was almost jumping with excitement, but I was not about to be a part of the confrontation.  When I told them I was heading back to my place for the night, they all looked at me like I was the biggest killjoy they had ever seen.&lt;/p&gt;\n\n&lt;p&gt;I wished them good luck and parted ways.  I am just not a confrontational person, and all this screamed like a bad idea to me.&lt;/p&gt;\n\n&lt;p&gt;Anyway, so I went home and fell asleep watching reruns of some stupid Ben Stiller flick.&lt;/p&gt;\n\n&lt;p&gt;I slept for a couple hours, I guess, when my phone started going off.  Drowsily, I checked it out and found that I was getting a call from my buddy, Mike, one of the guys on the crew.&lt;/p&gt;\n\n&lt;p&gt;I answered it, half-asleep, and said, &amp;quot;You better not be in jail because I don&amp;#39;t have money for your ba-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;When, suddenly, I was cutoff with a scream.  I can&amp;#39;t accurately describe the sound that followed.  It&amp;#39;s like, well, it&amp;#39;s like the sound of raw, bloody hamburger being stuffed down a garbage disposal.&lt;/p&gt;\n\n&lt;p&gt;A wet noise, but with substance.&lt;/p&gt;\n\n&lt;p&gt;I thought it was a joke at first.  &amp;quot;Mikey, this isn&amp;#39;t funny.  C&amp;#39;mon, I have work in the morning.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;No answer.  I checked my phone to see if I had been disconnected.  I hadn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when I heard the footsteps.  I strained to hear any little noise. Then, I heard the sound of fingers on the speaker.&lt;/p&gt;\n\n&lt;p&gt;They sounded... sticky.  I waited, too freaked out to speak. &lt;/p&gt;\n\n&lt;p&gt;And then there was the sound of breathing.  Soft, unlabored, warm.  I felt sick.&lt;/p&gt;\n\n&lt;p&gt;BAM!!&lt;/p&gt;\n\n&lt;p&gt;I clutched my ear in desperation.  Through the ringing in my right ear, I tried to make sense of what I just heard.&lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t right, whatever had happened, and I knew that I had to do something.  If this was a joke, God help them, but even if it wasn&amp;#39;t...&lt;/p&gt;\n\n&lt;p&gt;I called the police and immediately told them what I knew.  Luckily my memory was pretty good, so I had remembered the guy&amp;#39;s address.&lt;/p&gt;\n\n&lt;p&gt;I thought about going over there myself, but I am not the most well-built guy.  I&amp;#39;m a tech nerd, basically.  I don&amp;#39;t know the first thing about defending myself.&lt;/p&gt;\n\n&lt;p&gt;So, instead of going over there and just getting myself killed, I reached out for help.&lt;/p&gt;\n\n&lt;p&gt;The police told me that another call had been made from that address a few moments ago.  A girl.&lt;/p&gt;\n\n&lt;p&gt;My God, I thought.  Violet.  It had to have been Violet.&lt;/p&gt;\n\n&lt;p&gt;I begged them to tell me what they knew, but they refused.  They said they would send an officer to my place to question me and that officers were already on the scene at the guy&amp;#39;s house.&lt;/p&gt;\n\n&lt;p&gt;I felt relief for a moment, but panic set in quickly as I asked, &amp;quot;Is anyone... hurt?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A pause.  Then the dispatcher said, &amp;quot;Yes.  I&amp;#39;m afraid so.  I&amp;#39;m sorry.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I think I stopped breathing for a minute.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how long I sat there, in a daze, just thinking about the implications of that curt &amp;quot;Yes.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;But I was broken from my reverie when I heard a knock at the door.&lt;/p&gt;\n\n&lt;p&gt;My legs felt weak, but I pushed myself to move.&lt;/p&gt;\n\n&lt;p&gt;I approached my front door, and a second from reaching it, realized that I was still holding my cell.&lt;/p&gt;\n\n&lt;p&gt;I looked at it, noticed the call was still taking place, and put the receiver to my ear.&lt;/p&gt;\n\n&lt;p&gt;My left hand un-bolted my lock, my right pressed the phone to my face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello?  Sir, are you there?&amp;quot;  the operator asked.&lt;/p&gt;\n\n&lt;p&gt;I turned the handle.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah,&amp;quot; I said, finally calm enough to speak.  &amp;quot;Yeah, I&amp;#39;m here.  The officer is here now, so I&amp;#39;m gonna hang up now, okay?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I opened the door.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sir? What?  I&amp;#39;m sorry, no, no you can&amp;#39;t hang up, the officer&amp;#39;s not there yet.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I frowned.  What?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No,&amp;quot; I said, the door swinging open. &amp;quot;No, that can&amp;#39;t be right.  He&amp;#39;s right here.  He&amp;#39;s-- &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He was right in front of me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Everyone knows the show \"Catfish\" right?  You know, the one where people get deceived online and then when they meet the person they were interested in in real life, that person is like an ogre?\n\nWatch an episode or two if you don't know what I am talking about.  Anyway, so like usually it goes that some poor schlub sees a girl online and, well, let's just say she's like a strong 9 and he's like a 4 on a good day.  You see the dilemma right?\n\nAnd then this guy will meet the girl and she's like a -2 and has like three kids.  Then they all talk about their feelings and usually leave things for the better.\n\nWhy am I talking about this? Well, a few weeks ago, some friends of mine (a group of a couple young guys and a girl) were trying to think of a good project for their film class.  They thought about making a horror movie (I was going to play a part in it, apparently), but they decided that would be too obvious.\n\nSo, instead they thought, \"Why don't we make some kind of documentary?\" It took them a while to think of it, but one night they were watching TV and the show \"Catfish\" came on.  They suddenly realized, \"We could do this!\"\n\nTheir angle was that they wouldn't alert the catfish ahead of time that they were coming to meet.  They would just ambush them, you know, when they least expected it.  As one of the guys, Luke, put it,\"It's like a combination of \"Catfish\" and \"Cheaters.\"\n\nI thought it seemed interesting, but I realized that there could be some danger in what they were attempting.  I mean, they would be dealing with people that, by definition, were liars.  They could also be criminals, rapists, or God-knows-what.\n\nBut they insisted they would be fine.  \"We're in a group, and we have cameras,\" Violet, the girl, said.\n\nI warned them that a camera would be of little use to them when Bubba-With-an-Axe came swinging out of his trailer door.  But they were so confident in their abilities that I gave up protesting.\n\nInitially, they asked if I could help them by reaching out to possible victims and asking if they wanted to join the show.  I agreed, posted a Tweet with information on how to contact us, and then set up an email account for the crew.\n\nIt didn't take all that long, surprisingly enough, to find people who wanted to be a part of the show.  Maybe they thought it was even the real thing.\n\nIn any case, I scanned through the list of possible stories and found one that stood out.  It was a young lady who had been talking to a guy for about three years.  She said that he had made the first move when she was in her senior year of high school.\n\nShe thought he was cute and messaged him back.  Eventually they started talking more, you know the usual story.  But what made this one so interesting was that it turned out that the guy let it slip that he might be married.\n\nObviously, the girl was devastated.  She called him and told him to come clean, and he did.  He admitted he was married, but he claimed that he had \"cut it off\" with his wife.  \n\nThe girl was pleased, at first, but she started to get nervous about meeting him.  He had lied about being married, and she knew it wasn't so easy to get a divorce.\n\nSo she took up our offer and asked to join the show.  I was intrigued and immediately wrote her back and told her that the crew wanted to meet her.\n\nNeedless to say, they weren't too happy that I had planned a meeting without even telling them first.  But when they read her story, they all got excited.\n\nThe next day, we met with the girl at a Starbucks and asked her to tell her story in person.  They got the obligatory footage of her tale and then asked for the perp's details.\n\nShe provided them and informed the crew that he actually lived pretty close near by.\n\nAfter about two hours, they finished up and decided to plot when he might be home.  The girl told them that he worked a normal nine to five job, so he should be there in the evenings.\n\nWith that, they decided to have her call the guy and make sure he was there.\n\nHe answered, I suppose, because she talked to him for about a half hour before finally hanging up.\n\n\"He'll be there tonight,\" she explained.\n\nThe crew was almost jumping with excitement, but I was not about to be a part of the confrontation.  When I told them I was heading back to my place for the night, they all looked at me like I was the biggest killjoy they had ever seen.\n\nI wished them good luck and parted ways.  I am just not a confrontational person, and all this screamed like a bad idea to me.\n\nAnyway, so I went home and fell asleep watching reruns of some stupid Ben Stiller flick.\n\nI slept for a couple hours, I guess, when my phone started going off.  Drowsily, I checked it out and found that I was getting a call from my buddy, Mike, one of the guys on the crew.\n\nI answered it, half-asleep, and said, \"You better not be in jail because I don't have money for your ba-\"\n\nWhen, suddenly, I was cutoff with a scream.  I can't accurately describe the sound that followed.  It's like, well, it's like the sound of raw, bloody hamburger being stuffed down a garbage disposal.\n\nA wet noise, but with substance.\n\nI thought it was a joke at first.  \"Mikey, this isn't funny.  C'mon, I have work in the morning.\"\n\nNo answer.  I checked my phone to see if I had been disconnected.  I hadn't.\n\nThat's when I heard the footsteps.  I strained to hear any little noise. Then, I heard the sound of fingers on the speaker.\n\nThey sounded... sticky.  I waited, too freaked out to speak. \n\nAnd then there was the sound of breathing.  Soft, unlabored, warm.  I felt sick.\n\nBAM!!\n\nI clutched my ear in desperation.  Through the ringing in my right ear, I tried to make sense of what I just heard.\n\nIt wasn't right, whatever had happened, and I knew that I had to do something.  If this was a joke, God help them, but even if it wasn't...\n\nI called the police and immediately told them what I knew.  Luckily my memory was pretty good, so I had remembered the guy's address.\n\nI thought about going over there myself, but I am not the most well-built guy.  I'm a tech nerd, basically.  I don't know the first thing about defending myself.\n\nSo, instead of going over there and just getting myself killed, I reached out for help.\n\nThe police told me that another call had been made from that address a few moments ago.  A girl.\n\nMy God, I thought.  Violet.  It had to have been Violet.\n\nI begged them to tell me what they knew, but they refused.  They said they would send an officer to my place to question me and that officers were already on the scene at the guy's house.\n\nI felt relief for a moment, but panic set in quickly as I asked, \"Is anyone... hurt?\"\n\nA pause.  Then the dispatcher said, \"Yes.  I'm afraid so.  I'm sorry.\"\n\nI think I stopped breathing for a minute.\n\nI don't know how long I sat there, in a daze, just thinking about the implications of that curt \"Yes.\"\n\nBut I was broken from my reverie when I heard a knock at the door.\n\nMy legs felt weak, but I pushed myself to move.\n\nI approached my front door, and a second from reaching it, realized that I was still holding my cell.\n\nI looked at it, noticed the call was still taking place, and put the receiver to my ear.\n\nMy left hand un-bolted my lock, my right pressed the phone to my face.\n\n\"Hello?  Sir, are you there?\"  the operator asked.\n\nI turned the handle.\n\n\"Yeah,\" I said, finally calm enough to speak.  \"Yeah, I'm here.  The officer is here now, so I'm gonna hang up now, okay?\"\n\nI opened the door.\n\n\"Sir? What?  I'm sorry, no, no you can't hang up, the officer's not there yet.\"\n\nI frowned.  What?\n\n\"No,\" I said, the door swinging open. \"No, that can't be right.  He's right here.  He's-- \"\n\nHe was right in front of me.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652us5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 158, "report_reasons": null, "author": "GlassColoredRoses", "saved": false, "mod_reports": [], "name": "t3_652us5", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492053852.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/652us5/catfishing/", "num_reports": null, "locked": false, "stickied": false, "created": 1492079988.0, "url": "https://www.reddit.com/r/nosleep/comments/652us5/catfishing/", "author_flair_text": null, "quarantine": false, "title": "Catfishing", "created_utc": 1492051188.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 158}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": "", "user_reports": [], "id": "dg7515r", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "ranter101", "parent_id": "t3_652us5", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "RIP OP", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;RIP OP&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7515r", "score_hidden": false, "stickied": false, "created": 1492086317.0, "created_utc": 1492057517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": "", "user_reports": [], "id": "dg7ujj0", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t1_dg7lb3y", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That could be the real reason for some cases, it's surely the first reason that is mentioned after seeing the -2 for the first time.\n\nI think I'm just too old to be watching MTV, lol.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That could be the real reason for some cases, it&amp;#39;s surely the first reason that is mentioned after seeing the -2 for the first time.&lt;/p&gt;\n\n&lt;p&gt;I think I&amp;#39;m just too old to be watching MTV, lol.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7ujj0", "score_hidden": false, "stickied": false, "created": 1492131567.0, "created_utc": 1492102767.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7lb3y", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Nyltiak23", "parent_id": "t1_dg7d8q7", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I feel like a big part of it is the lie though, like you lied to me for X amount of time", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like a big part of it is the lie though, like you lied to me for X amount of time&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7lb3y", "score_hidden": false, "stickied": false, "created": 1492121450.0, "created_utc": 1492092650.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d8q7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t1_dg74222", "subreddit_name_prefixed": "r/nosleep", "controversiality": 1, "body": "I do watch the show from time to time, but if anything it screams what shitty people we really are and looks ARE all we care about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do watch the show from time to time, but if anything it screams what shitty people we really are and looks ARE all we care about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7d8q7", "score_hidden": false, "stickied": false, "created": 1492106510.0, "created_utc": 1492077710.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": "", "user_reports": [], "id": "dg9cokh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9aqvd", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "lol true but its hard to explain 3 kids when you say you have none also hard to explain why the person looks nothing like the photo just a bad situation all around ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol true but its hard to explain 3 kids when you say you have none also hard to explain why the person looks nothing like the photo just a bad situation all around &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9cokh", "score_hidden": false, "stickied": false, "created": 1492215690.0, "created_utc": 1492186890.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9aqvd", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "benderose", "parent_id": "t1_dg74222", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "But having 3 kids isn't even that bad, and if they're old enough you can make them do all the shopping, cleaning up and washing the dishes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But having 3 kids isn&amp;#39;t even that bad, and if they&amp;#39;re old enough you can make them do all the shopping, cleaning up and washing the dishes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9aqvd", "score_hidden": false, "stickied": false, "created": 1492213520.0, "created_utc": 1492184720.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74222", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_652us5", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "loved the catfish summary \"you meet and she's a -2 and has like 3 kids\" perfectly described also could of added she's like 374 years old lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;loved the catfish summary &amp;quot;you meet and she&amp;#39;s a -2 and has like 3 kids&amp;quot; perfectly described also could of added she&amp;#39;s like 374 years old lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg74222", "score_hidden": false, "stickied": false, "created": 1492084827.0, "created_utc": 1492056027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": "", "user_reports": [], "id": "dg7km15", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SparklesKittehCat", "parent_id": "t1_dg74rxs", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Op was expecting a cop to come to his home to question him about the incident. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Op was expecting a cop to come to his home to question him about the incident. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7km15", "score_hidden": false, "stickied": false, "created": 1492120567.0, "created_utc": 1492091767.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": "", "user_reports": [], "id": "dg8sfvs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "howtochoose", "parent_id": "t1_dg7aa4i", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm sorry for The downvotes.\n\nI'm also a lil confused...how did that crazy guy know where op lived...maybe the girl was in on it and they're a psychokiller couple...wasnt she disappointed /surprised/or even questioning when she met up with them and it wasn't grey haired dude camera dude and hyper dude combo? Hmm...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry for The downvotes.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also a lil confused...how did that crazy guy know where op lived...maybe the girl was in on it and they&amp;#39;re a psychokiller couple...wasnt she disappointed /surprised/or even questioning when she met up with them and it wasn&amp;#39;t grey haired dude camera dude and hyper dude combo? Hmm...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8sfvs", "score_hidden": false, "stickied": false, "created": 1492174989.0, "created_utc": 1492146189.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7aa4i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WhereWoof", "parent_id": "t1_dg74rxs", "subreddit_name_prefixed": "r/nosleep", "controversiality": 1, "body": "Maybe the married man happened to be a cop?\n\nEdit: I too don't quite understand, explanations are welcome ", "edited": 1492133270.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe the married man happened to be a cop?&lt;/p&gt;\n\n&lt;p&gt;Edit: I too don&amp;#39;t quite understand, explanations are welcome &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7aa4i", "score_hidden": false, "stickied": false, "created": 1492097621.0, "created_utc": 1492068821.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74rxs", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "irishfilmmaker", "parent_id": "t3_652us5", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm a bit confused by the ending.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bit confused by the ending.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg74rxs", "score_hidden": false, "stickied": false, "created": 1492085915.0, "created_utc": 1492057115.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_652us5", "likes": null, "replies": "", "user_reports": [], "id": "dg7tlhu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Novaalia", "parent_id": "t3_652us5", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "OP Ruuuuunnn!!! and then update when its safe!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP Ruuuuunnn!!! and then update when its safe!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7tlhu", "score_hidden": false, "stickied": false, "created": 1492130568.0, "created_utc": 1492101768.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]