[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64omjt/i_found_an_old_vhs_tape_in_my_grandfathers/\"&gt;Part 1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64w16p/i_found_an_old_vhs_tape_in_my_grandfathers/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;WARNING: CONTAINS SOME GRAPHIC VIOLENCE. (It wouldn&amp;#39;t let me tag as a series AND graphic violence.)&lt;/p&gt;\n\n&lt;p&gt;When I woke up, it took me a few seconds to remember where I was. Once the fog in my brain faded away, I realized my arms and legs were chained to the bottom bunk of a plain, metal bunk bed. My brown hair had been shaved away and I was wearing a long, black gown. &amp;quot;Let me go!&amp;quot; I yelled, desperately trying to escape my restraints. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s no use.&amp;quot; A painfully familiar voice said from across the room. It was Vida. I turned my head and saw that she was perched on a wooden chair, reading some book. She looked up at me. &amp;quot;Listen, I&amp;#39;m sorry I couldn&amp;#39;t tell you the truth about me-no, &lt;em&gt;us&lt;/em&gt;-sooner. I couldn&amp;#39;t risk letting you get away.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Vida...we grew up together. How long have you been a part of Living Flame?&amp;quot; I asked, exasperated. &lt;/p&gt;\n\n&lt;p&gt;She took a deep breath. &amp;quot;My whole life. In order to keep up with appearances, we created a fake family for you. The prophecy states that the firstborn twin must always be within five miles of the younger twin in order for the sacrifice to work. The catch is that the firstborn twin must never learn of his or her&amp;#39;s true relation to the younger twin before the eve of the sacrifice. So...yeah. That&amp;#39;s why I stopped hanging out with you in middle school.&amp;quot; She frowned and stood up. &amp;quot;I couldn&amp;#39;t bear to be near someone so unclean. I thank The Flame everyday  for making sure I wasn&amp;#39;t born first.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I was more confused than ever. &amp;quot;What do you crazy people believe will happen if you don&amp;#39;t sacrifice me?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The world will be eternally devoured by a great darkness if we are openly disobedient to The Flame.&amp;quot; She walked towards me and placed her hand around my wrist. &amp;quot;Please, try to understand. Your death is for the good of humanity.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Let go of me.&amp;quot; I seethed. She jumped backwards. I wasn&amp;#39;t the type to get angry. &amp;quot;You and your entire cult is insane.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Vida shook her head. &amp;quot;Lord Oliver, he&amp;#39;s awake!&amp;quot; She called. &lt;/p&gt;\n\n&lt;p&gt;Seconds later, Oliver stepped into the room. He was even creepier up close. His thick, black hair was slicked back, making his bulging brown eyes even more prominent than they already were. &amp;quot;Hello, Peter, how&amp;#39;s life?&amp;quot; He asked like he was an old friend of mine. When I didn&amp;#39;t reply, he grabbed a set of keys from his pocket. &amp;quot;Well there isn&amp;#39;t time to waste. You must be purified as quickly as possible.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For an older man, Oliver was incredibly strong. He tied me up, undid my chains, and tossed me over his shoulder like I was a sack of potatoes. As he carried me down the stairs, I managed to bite into his shoulder. &amp;quot;Brat.&amp;quot; He said, loosening his grip for a split second. &amp;quot;No bother, you&amp;#39;ll be gone soon anyway.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He carried me into a tiny kitchen and opened a refrigerator. What happened next was something I&amp;#39;d only ever seen done in movies. He opened one of the drawers and pressed a button hidden inside. Instantly, the refrigerator&amp;#39;s bottom opened up, revealing a winding staircase. &amp;quot;How big is this place?&amp;quot; I asked in disbelief. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Since there are so many of us, we built a bunker in the basement in case the so called &lt;em&gt;government&lt;/em&gt; discovers us. We&amp;#39;ve been using it regularly ever since.&amp;quot; Oliver explained as he carried me down another flight of stairs. &amp;quot;Everyone sleeps on the upper floor, but there&amp;#39;s a large communal bathroom and meeting room down here.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The meeting room was full of Living Flame members. They were gathered in a circle around an empty table with a chair beside it. I spotted who I had long believed to be my parents. It was surreal seeing them in  the signature red Living Flame cloaks. They didn&amp;#39;t look the least bit guilty. &amp;quot;How could you?&amp;quot; I cried, staring straight at them. &amp;quot;I thought you loved me!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We do love you.&amp;quot; My not-mother said calmly. &amp;quot;That&amp;#39;s why this needs to happen.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I was placed in the chair. After Oliver made sure I was trapped in place, he cleared his breath. &amp;quot;Living Flame, as you know, the firstborn twin must be purified before we can sacrifice him. I wish we had more time to explain things to him, but if he isn&amp;#39;t sacrificed by midnight, the sacrifice won&amp;#39;t work. It has to be today, the first day of the third month of his eighteenth year.&amp;quot; Oliver pulled a long knife from his pocket and glared down at me. &amp;quot;Let us begin.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He grabbed my right hand and placed it on the table. &amp;quot;Vida, present the flame.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Vida stepped out of the circle and placed a tiny candle on the table. I was too far away to blow it out. Oliver bowed to the flame. &amp;quot;This flame is eternal. This flame protects us. We owe our lives to this flame. We owe our gratitude to this flame. We must obey this flame.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This flame is eternal,&amp;quot; The crowd chanted in unison. &amp;quot;This flame protects us. We owe our lives to this flame. We owe our gratitude to this flame. We must obey this flame.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;He gripped my pinky finger. &amp;quot;The pinky finger represents the fact that the unclean aren&amp;#39;t thankful for the small blessings the flame so graciously bestows upon them every day.&amp;quot; He held up the knife. &amp;quot;Let this be a reminder to be grateful for the flame!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;In one swift movement, he sliced off my pinky finger. I wailed in pain as my pinky was swiftly placed in a paper bag. &amp;quot;It hurts!&amp;quot; I wailed, watching in horror as my own blood dripped all over the table. &amp;quot;Let me go! Let me go!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Oliver ignored me. &amp;quot;The ring finger represents weakness. It reminds us all that when we feel like we simply can&amp;#39;t move on, the flame is always there to comfort us.&amp;quot; He held the knife up once again. It was splattered in blood. &amp;quot;Let this be a reminder to think of the flame in times of pain!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My ring finger was cut off and placed into the paper bag. At that point, the shock had quieted my screams. &lt;em&gt;I&amp;#39;m going to die&lt;/em&gt;. I thought, refusing to look down at my hand. &lt;em&gt;I&amp;#39;m going to die and there&amp;#39;s nothing I can do about it&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Next, the middle finger.&amp;quot; Oliver said. &amp;quot;Oftentimes, the unclean use their middle fingers as a rude gesture. We must remember that our words affect others and that everything that leaves our mouths should be pleasing to the flame.&amp;quot; he gripped the knife and brought it down. &amp;quot;Let this be a reminder to control our speech!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I could feel my consciousness slipping away, but Oliver kept slapping me so I wouldn&amp;#39;t fall asleep. &amp;quot;You must witness this.&amp;quot; He whispered. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The index finger is often used to point. Sometimes, the unclean point at others to pass off the blame that belongs to them. We must take responsibility for our actions.&amp;quot; The pain was indescribable as he removed my pointer finger. &amp;quot;Let this be a reminder to think before we act!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The thumb is what many consider to be the most important finger of all. It represents pride and thinking that we are somehow above the other people around us.&amp;quot; My thumb was gone in less than a second. &amp;quot;Let this be a reminder to always display humility!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Oliver wiped off the knife with a rag. &amp;quot;Lastly, and most importantly, the palm. Without the palm, the fingers wouldn&amp;#39;t be any good at all. The palm represents the soul. Everyone&amp;#39;s soul is different, but they exist for the same purpose: To serve the flame.&amp;quot; He cut off what remained of my right hand at the wrist. &amp;quot;Never forget the flame!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Never forget the flame!&amp;quot; The crowd yelled victoriously. &lt;/p&gt;\n\n&lt;p&gt;The next thing I remember is waking up in a bunk bed. But this time, I wasn&amp;#39;t chained up. My black robe had been changed to a red one. I glanced at the thick bandages on my right wrist. The memory of having my hand slowly sliced to pieces caused me to vomit all over myself. &amp;quot;Water-&amp;quot; I cried weakly. &amp;quot;Please, I need water.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Vida arrived seconds later with a small glass full of crisp, clean water. It felt weird to use my left hand to hold the glass to my lips, but in that moment, the only thing i cared about was getting the water down my throat. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I told Lord Oliver that there was no need to chain you up because you&amp;#39;re too weak to run.&amp;quot; Vida said, taking the empty glass from me. &lt;/p&gt;\n\n&lt;p&gt;I rolled my eyes. &amp;quot;You&amp;#39;re such a saint.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Anyway, I&amp;#39;ll be back up in a few minutes to take you to your sacrificing ceremony.&amp;quot; She said, not taking her eyes off the bandages around my wrist. &amp;quot;I wish we weren&amp;#39;t twins.&amp;quot; She blurted out. &amp;quot;I wish you didn&amp;#39;t have to die.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I &lt;em&gt;don&amp;#39;t&lt;/em&gt;.&amp;quot; I yelled. &amp;quot;If you would help me get out of here, then I&amp;#39;d live.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It can&amp;#39;t be that way.&amp;quot; Vida whimpered, choking back tears. &amp;quot;I&amp;#39;m sorry, but I must obey the flame.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She left me alone in the room full of bunk beds. Seconds later, I heard tapping on the window. I forced myself to sit up and walk towards the window. I saw a man in a black mask trying to open the window.. He was balanced on a tall, metal ladder. I noticed the metal bars that had once been over the outside of the windows had been cut off. He pointed to the locks and motioned for me to open them. Was this man trying to help me? I opened the window just a bit. &amp;quot;Who are you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A friend.&amp;quot; A gruff voice replied. I recognized that voice...but from where? &amp;quot;I&amp;#39;m here to help you escape.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I opened the window and stepped onto the ladder. Just as I my feet hit the top rung of the ladder, the door to the bedroom flew open. It was Oliver. The blood drained from his face. &amp;quot;Get him! He&amp;#39;s escaping!&amp;quot; He yelled down the stairs. &lt;/p&gt;\n\n&lt;p&gt;The masked man practically dragged me down the ladder and shoved me in the passengers seat of a compact, black car. &amp;quot;Hold on tight.&amp;quot; He said, flooring the gas pedal. I watched distraught Living Flame members try to catch up with us, but it was no use. The car was too fast. The masked man drove the car directly into a forest and made all sorts of twists and turns. &amp;quot;My hand is gone.&amp;quot; I said, the realization of my missing hand sinking in. &amp;quot;It&amp;#39;s gone. It&amp;#39;s gone. It&amp;#39;s gone.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please, try to remain calm.&amp;quot; The gruff man said. &amp;quot;As soon as we&amp;#39;re safe, I&amp;#39;ll take you to a hospital.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Who even are you?&amp;quot; I asked. &lt;/p&gt;\n\n&lt;p&gt;He pulled off his mask. &lt;/p&gt;\n\n&lt;p&gt;It was my grandfather.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What the he-?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ll explain everything later.&amp;quot; My grandfather stated. &amp;quot;For now, let me focus on getting to safety.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He drove for what felt like forever. At long last, he parked in front of a small trailer. There was a boat dock directly behind it, but no boat to be found. &amp;quot;Get inside, now.&amp;quot; He demanded. &amp;quot;Quickly.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The trailer was even smaller on the inside. When you first walked in, there was a room with a t.v. and a couch. There was a bedroom off to one side and a bathroom to the other. I sat on the couch, still shaking. My grandfather locked the door and peered out the window before sitting beside me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ve been living here for three months.&amp;quot; My grandfather said, opening a bag of chips. &amp;quot;Would you like a snack?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re dead.&amp;quot; I said, sure of myself. &amp;quot;I&amp;#39;m dead. Is this heaven? If so, it sucks.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Compared to Living Flame, yeah, this is heaven.&amp;quot; My grandfather said. &amp;quot;I faked my death in order to save you. You see, Living Flame tried to poison me, but I outsmarted them. They think I&amp;#39;m dead. I paid the funeral director a ridiculous amount of money to fill my cremation bag with dirt and give my daughter a death certificate.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But why were you in Living Flame to begin with?&amp;quot; To curious to think about the throbbing pain underneath the bandages. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was born into it.&amp;quot; My grandfather explained. &amp;quot;I only started questioning it after I realized you would be killed in three short months. I realized it was all a lie, so Oliver tried to poison me. As far as I know, there&amp;#39;s only one other person alive that&amp;#39;s left the cult and lived to tell the tale.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Harper Kowalski...&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah. I&amp;#39;ll never forget the day Oliver blinded her and left her for dead in a forest.&amp;quot; He let out a loud sigh. &amp;quot;For the life of me, I don&amp;#39;t know how she survived.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t know how &lt;em&gt;I&lt;/em&gt; survived.&amp;quot; I said, looking down at my wrist. &amp;quot;Why didn&amp;#39;t you get there before they cut off my hand, huh? Wait, even better, why didn&amp;#39;t you get here before Vida lured me into that stupid house?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;My grandfather bit into a chip. &amp;quot;Because I had no idea where the cult had relocated. I had to follow you here. By the time I realized you were being led straight into Living Flame, it was too late. I had to wait until you were alone to free you.&amp;quot; He glanced at my bandages. &amp;quot;I&amp;#39;m truly sorry.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Before I could respond, I noticed smoke coming from beneath the door of the trailer. Fire. &amp;quot;No! I was so careful!&amp;quot; My grandfather yelled as the trailer kept burning. He grabbed the t.v. and broke a window in the back of the trailer. I could hear the sound of the waves below. &amp;quot;You need to jump into the water and swim away!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The door collapsed, revealing none other than Oliver. He stabbed my grandfather in the chest before grinning at me. &amp;quot;Hello, Peter.&amp;quot; He began to laugh. &amp;quot;Is it just me, or is it hot in here?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Go...&amp;quot; My grandfather said, using the last of his strength to fight Oliver. &amp;quot;Jump!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Thanks, grandpa.&amp;quot; I said before climbing into the frame of the window.&lt;/p&gt;\n\n&lt;p&gt;I hit the water with a loud splash. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Part 1] (https://www.reddit.com/r/nosleep/comments/64omjt/i_found_an_old_vhs_tape_in_my_grandfathers/)\n\n[Part 2](https://www.reddit.com/r/nosleep/comments/64w16p/i_found_an_old_vhs_tape_in_my_grandfathers/)\n\nWARNING: CONTAINS SOME GRAPHIC VIOLENCE. (It wouldn't let me tag as a series AND graphic violence.)\n\nWhen I woke up, it took me a few seconds to remember where I was. Once the fog in my brain faded away, I realized my arms and legs were chained to the bottom bunk of a plain, metal bunk bed. My brown hair had been shaved away and I was wearing a long, black gown. \"Let me go!\" I yelled, desperately trying to escape my restraints. \n\n\"It's no use.\" A painfully familiar voice said from across the room. It was Vida. I turned my head and saw that she was perched on a wooden chair, reading some book. She looked up at me. \"Listen, I'm sorry I couldn't tell you the truth about me-no, *us*-sooner. I couldn't risk letting you get away.\"\n\n\"Vida...we grew up together. How long have you been a part of Living Flame?\" I asked, exasperated. \n\nShe took a deep breath. \"My whole life. In order to keep up with appearances, we created a fake family for you. The prophecy states that the firstborn twin must always be within five miles of the younger twin in order for the sacrifice to work. The catch is that the firstborn twin must never learn of his or her's true relation to the younger twin before the eve of the sacrifice. So...yeah. That's why I stopped hanging out with you in middle school.\" She frowned and stood up. \"I couldn't bear to be near someone so unclean. I thank The Flame everyday  for making sure I wasn't born first.\"\n\nI was more confused than ever. \"What do you crazy people believe will happen if you don't sacrifice me?\" \n\n\"The world will be eternally devoured by a great darkness if we are openly disobedient to The Flame.\" She walked towards me and placed her hand around my wrist. \"Please, try to understand. Your death is for the good of humanity.\"\n\n\"Let go of me.\" I seethed. She jumped backwards. I wasn't the type to get angry. \"You and your entire cult is insane.\"\n\nVida shook her head. \"Lord Oliver, he's awake!\" She called. \n\nSeconds later, Oliver stepped into the room. He was even creepier up close. His thick, black hair was slicked back, making his bulging brown eyes even more prominent than they already were. \"Hello, Peter, how's life?\" He asked like he was an old friend of mine. When I didn't reply, he grabbed a set of keys from his pocket. \"Well there isn't time to waste. You must be purified as quickly as possible.\"\n\nFor an older man, Oliver was incredibly strong. He tied me up, undid my chains, and tossed me over his shoulder like I was a sack of potatoes. As he carried me down the stairs, I managed to bite into his shoulder. \"Brat.\" He said, loosening his grip for a split second. \"No bother, you'll be gone soon anyway.\"\n\nHe carried me into a tiny kitchen and opened a refrigerator. What happened next was something I'd only ever seen done in movies. He opened one of the drawers and pressed a button hidden inside. Instantly, the refrigerator's bottom opened up, revealing a winding staircase. \"How big is this place?\" I asked in disbelief. \n\n\"Since there are so many of us, we built a bunker in the basement in case the so called *government* discovers us. We've been using it regularly ever since.\" Oliver explained as he carried me down another flight of stairs. \"Everyone sleeps on the upper floor, but there's a large communal bathroom and meeting room down here.\"\n\nThe meeting room was full of Living Flame members. They were gathered in a circle around an empty table with a chair beside it. I spotted who I had long believed to be my parents. It was surreal seeing them in  the signature red Living Flame cloaks. They didn't look the least bit guilty. \"How could you?\" I cried, staring straight at them. \"I thought you loved me!\"\n\n\"We do love you.\" My not-mother said calmly. \"That's why this needs to happen.\"\n\nI was placed in the chair. After Oliver made sure I was trapped in place, he cleared his breath. \"Living Flame, as you know, the firstborn twin must be purified before we can sacrifice him. I wish we had more time to explain things to him, but if he isn't sacrificed by midnight, the sacrifice won't work. It has to be today, the first day of the third month of his eighteenth year.\" Oliver pulled a long knife from his pocket and glared down at me. \"Let us begin.\"\n\nHe grabbed my right hand and placed it on the table. \"Vida, present the flame.\" \n\nVida stepped out of the circle and placed a tiny candle on the table. I was too far away to blow it out. Oliver bowed to the flame. \"This flame is eternal. This flame protects us. We owe our lives to this flame. We owe our gratitude to this flame. We must obey this flame.\"\n\n\"This flame is eternal,\" The crowd chanted in unison. \"This flame protects us. We owe our lives to this flame. We owe our gratitude to this flame. We must obey this flame.\" \n\nHe gripped my pinky finger. \"The pinky finger represents the fact that the unclean aren't thankful for the small blessings the flame so graciously bestows upon them every day.\" He held up the knife. \"Let this be a reminder to be grateful for the flame!\" \n\nIn one swift movement, he sliced off my pinky finger. I wailed in pain as my pinky was swiftly placed in a paper bag. \"It hurts!\" I wailed, watching in horror as my own blood dripped all over the table. \"Let me go! Let me go!\"\n\nOliver ignored me. \"The ring finger represents weakness. It reminds us all that when we feel like we simply can't move on, the flame is always there to comfort us.\" He held the knife up once again. It was splattered in blood. \"Let this be a reminder to think of the flame in times of pain!\"\n\nMy ring finger was cut off and placed into the paper bag. At that point, the shock had quieted my screams. *I'm going to die*. I thought, refusing to look down at my hand. *I'm going to die and there's nothing I can do about it*. \n\n\"Next, the middle finger.\" Oliver said. \"Oftentimes, the unclean use their middle fingers as a rude gesture. We must remember that our words affect others and that everything that leaves our mouths should be pleasing to the flame.\" he gripped the knife and brought it down. \"Let this be a reminder to control our speech!\"\n\nI could feel my consciousness slipping away, but Oliver kept slapping me so I wouldn't fall asleep. \"You must witness this.\" He whispered. \n\n\"The index finger is often used to point. Sometimes, the unclean point at others to pass off the blame that belongs to them. We must take responsibility for our actions.\" The pain was indescribable as he removed my pointer finger. \"Let this be a reminder to think before we act!\"\n\n\"The thumb is what many consider to be the most important finger of all. It represents pride and thinking that we are somehow above the other people around us.\" My thumb was gone in less than a second. \"Let this be a reminder to always display humility!\"\n\nOliver wiped off the knife with a rag. \"Lastly, and most importantly, the palm. Without the palm, the fingers wouldn't be any good at all. The palm represents the soul. Everyone's soul is different, but they exist for the same purpose: To serve the flame.\" He cut off what remained of my right hand at the wrist. \"Never forget the flame!\"\n\n\"Never forget the flame!\" The crowd yelled victoriously. \n\nThe next thing I remember is waking up in a bunk bed. But this time, I wasn't chained up. My black robe had been changed to a red one. I glanced at the thick bandages on my right wrist. The memory of having my hand slowly sliced to pieces caused me to vomit all over myself. \"Water-\" I cried weakly. \"Please, I need water.\"\n\nVida arrived seconds later with a small glass full of crisp, clean water. It felt weird to use my left hand to hold the glass to my lips, but in that moment, the only thing i cared about was getting the water down my throat. \n\n\"I told Lord Oliver that there was no need to chain you up because you're too weak to run.\" Vida said, taking the empty glass from me. \n\nI rolled my eyes. \"You're such a saint.\"\n\n\"Anyway, I'll be back up in a few minutes to take you to your sacrificing ceremony.\" She said, not taking her eyes off the bandages around my wrist. \"I wish we weren't twins.\" She blurted out. \"I wish you didn't have to die.\"\n\n\"I *don't*.\" I yelled. \"If you would help me get out of here, then I'd live.\"\n\n\"It can't be that way.\" Vida whimpered, choking back tears. \"I'm sorry, but I must obey the flame.\"\n\nShe left me alone in the room full of bunk beds. Seconds later, I heard tapping on the window. I forced myself to sit up and walk towards the window. I saw a man in a black mask trying to open the window.. He was balanced on a tall, metal ladder. I noticed the metal bars that had once been over the outside of the windows had been cut off. He pointed to the locks and motioned for me to open them. Was this man trying to help me? I opened the window just a bit. \"Who are you?\"\n\n\"A friend.\" A gruff voice replied. I recognized that voice...but from where? \"I'm here to help you escape.\"\n\nI opened the window and stepped onto the ladder. Just as I my feet hit the top rung of the ladder, the door to the bedroom flew open. It was Oliver. The blood drained from his face. \"Get him! He's escaping!\" He yelled down the stairs. \n\nThe masked man practically dragged me down the ladder and shoved me in the passengers seat of a compact, black car. \"Hold on tight.\" He said, flooring the gas pedal. I watched distraught Living Flame members try to catch up with us, but it was no use. The car was too fast. The masked man drove the car directly into a forest and made all sorts of twists and turns. \"My hand is gone.\" I said, the realization of my missing hand sinking in. \"It's gone. It's gone. It's gone.\"\n\n\"Please, try to remain calm.\" The gruff man said. \"As soon as we're safe, I'll take you to a hospital.\"\n\n\"Who even are you?\" I asked. \n\nHe pulled off his mask. \n\nIt was my grandfather.\n\n\"What the he-?\"\n\n\"I'll explain everything later.\" My grandfather stated. \"For now, let me focus on getting to safety.\"\n\nHe drove for what felt like forever. At long last, he parked in front of a small trailer. There was a boat dock directly behind it, but no boat to be found. \"Get inside, now.\" He demanded. \"Quickly.\"\n\nThe trailer was even smaller on the inside. When you first walked in, there was a room with a t.v. and a couch. There was a bedroom off to one side and a bathroom to the other. I sat on the couch, still shaking. My grandfather locked the door and peered out the window before sitting beside me.\n\n\"I've been living here for three months.\" My grandfather said, opening a bag of chips. \"Would you like a snack?\"\n\n\"You're dead.\" I said, sure of myself. \"I'm dead. Is this heaven? If so, it sucks.\"\n\n\"Compared to Living Flame, yeah, this is heaven.\" My grandfather said. \"I faked my death in order to save you. You see, Living Flame tried to poison me, but I outsmarted them. They think I'm dead. I paid the funeral director a ridiculous amount of money to fill my cremation bag with dirt and give my daughter a death certificate.\"\n\n\"But why were you in Living Flame to begin with?\" To curious to think about the throbbing pain underneath the bandages. \n\n\"I was born into it.\" My grandfather explained. \"I only started questioning it after I realized you would be killed in three short months. I realized it was all a lie, so Oliver tried to poison me. As far as I know, there's only one other person alive that's left the cult and lived to tell the tale.\"\n\n\"Harper Kowalski...\" \n\n\"Yeah. I'll never forget the day Oliver blinded her and left her for dead in a forest.\" He let out a loud sigh. \"For the life of me, I don't know how she survived.\"\n\n\"I don't know how *I* survived.\" I said, looking down at my wrist. \"Why didn't you get there before they cut off my hand, huh? Wait, even better, why didn't you get here before Vida lured me into that stupid house?\" \n\nMy grandfather bit into a chip. \"Because I had no idea where the cult had relocated. I had to follow you here. By the time I realized you were being led straight into Living Flame, it was too late. I had to wait until you were alone to free you.\" He glanced at my bandages. \"I'm truly sorry.\"\n\nBefore I could respond, I noticed smoke coming from beneath the door of the trailer. Fire. \"No! I was so careful!\" My grandfather yelled as the trailer kept burning. He grabbed the t.v. and broke a window in the back of the trailer. I could hear the sound of the waves below. \"You need to jump into the water and swim away!\"\n\n\"But-\"\n\nThe door collapsed, revealing none other than Oliver. He stabbed my grandfather in the chest before grinning at me. \"Hello, Peter.\" He began to laugh. \"Is it just me, or is it hot in here?\"\n\n\"Go...\" My grandfather said, using the last of his strength to fight Oliver. \"Jump!\"\n\n\"Thanks, grandpa.\" I said before climbing into the frame of the window.\n\nI hit the water with a loud splash. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "653e5k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 221, "report_reasons": null, "author": "a-graceful-tater-tot", "saved": false, "mod_reports": [], "name": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492058755.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/653e5k/i_found_an_old_vhs_tape_in_my_grandfathers/", "num_reports": null, "locked": false, "stickied": false, "created": 1492086842.0, "url": "https://www.reddit.com/r/nosleep/comments/653e5k/i_found_an_old_vhs_tape_in_my_grandfathers/", "author_flair_text": null, "quarantine": false, "title": "I Found an Old VHS Tape in My Grandfather's Basement [Part 3]", "created_utc": 1492058042.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 221}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg75dhk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F653e5k%2Fi_found_an_old_vhs_tape_in_my_grandfathers%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;to=RemindMeBot&amp;subject=Reminder) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F653e5k%2Fi_found_an_old_vhs_tape_in_my_grandfathers%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;to=RemindMeBot&amp;amp;subject=Reminder\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg75dhk", "score_hidden": true, "stickied": true, "created": 1492086877.0, "created_utc": 1492058077.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg7bq7g", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "SadouMaou", "parent_id": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "He had fake parents the first time, why not a fake grandfather? What if Oliver is the grandfather?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He had fake parents the first time, why not a fake grandfather? What if Oliver is the grandfather?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7bq7g", "score_hidden": false, "stickied": false, "created": 1492101865.0, "created_utc": 1492073065.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg96dky", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RCONSPIRACYISCORRUPT", "parent_id": "t1_dg87s5q", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "No.  I would of written the same as you.  With half of all of my hands.  ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No.  I would of written the same as you.  With half of all of my hands.  ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg96dky", "score_hidden": false, "stickied": false, "created": 1492208067.0, "created_utc": 1492179267.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87s5q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DecimateTheDeciever", "parent_id": "t1_dg86wa1", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh crap....I'm a bigot. :(\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh crap....I&amp;#39;m a bigot. :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg87s5q", "score_hidden": false, "stickied": false, "created": 1492145916.0, "created_utc": 1492117116.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg8h0ib", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "mjeanh", "parent_id": "t1_dg86wa1", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I wish I could give you gold!! Lol!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could give you gold!! Lol!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8h0ib", "score_hidden": false, "stickied": false, "created": 1492157894.0, "created_utc": 1492129094.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86wa1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Gabiamir42", "parent_id": "t1_dg8475h", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "*triggered* are you assuming that he has 2 hands!? *autistic screeching* ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;triggered&lt;/em&gt; are you assuming that he has 2 hands!? &lt;em&gt;autistic screeching&lt;/em&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg86wa1", "score_hidden": false, "stickied": false, "created": 1492144911.0, "created_utc": 1492116111.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8475h", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DecimateTheDeciever", "parent_id": "t1_dg82vpe", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "uh....the normal amount as you, friend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;uh....the normal amount as you, friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8475h", "score_hidden": false, "stickied": false, "created": 1492141917.0, "created_utc": 1492113117.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82vpe", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "masta1591", "parent_id": "t1_dg7ipdu", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Umm..how many hands do you have?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Umm..how many hands do you have?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg82vpe", "score_hidden": false, "stickied": false, "created": 1492140487.0, "created_utc": 1492111687.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ipdu", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "DecimateTheDeciever", "parent_id": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This is incredibly thrilling. Glad you can swim with one hand, I can barely swim with all of mine. That's probably why they call me the Iron Duck...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is incredibly thrilling. Glad you can swim with one hand, I can barely swim with all of mine. That&amp;#39;s probably why they call me the Iron Duck...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7ipdu", "score_hidden": false, "stickied": false, "created": 1492118004.0, "created_utc": 1492089204.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg7vcfb", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Itsthematterhorn", "parent_id": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I KNOW ALL OF THESE PLACES I'm never going back to Salisbury again. Nope no way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I KNOW ALL OF THESE PLACES I&amp;#39;m never going back to Salisbury again. Nope no way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7vcfb", "score_hidden": false, "stickied": false, "created": 1492132419.0, "created_utc": 1492103619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg8bmbg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "benderose", "parent_id": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Sorry about your gramps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry about your gramps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8bmbg", "score_hidden": false, "stickied": false, "created": 1492150665.0, "created_utc": 1492121865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg8kdb9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mmhmmyeahright", "parent_id": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yay grandpa!\nSorry about your hand :(\nThat was hard to read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yay grandpa!\nSorry about your hand :(\nThat was hard to read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8kdb9", "score_hidden": false, "stickied": false, "created": 1492162498.0, "created_utc": 1492133698.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_653e5k", "likes": null, "replies": "", "user_reports": [], "id": "dg7upqw", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "draegunfly", "parent_id": "t3_653e5k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 1, "body": "Add the trigger warning. That way you can keep the series flair but still warn people before they click your story.\nGlad you made it out. Sorry about your Granddad ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Add the trigger warning. That way you can keep the series flair but still warn people before they click your story.\nGlad you made it out. Sorry about your Granddad &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7upqw", "score_hidden": false, "stickied": false, "created": 1492131749.0, "created_utc": 1492102949.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]