[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ever heard of Mel&amp;#39;s Hole? The story goes that a man named Mel discovered it in his backyard. He measured it with a rope that could extend for about a mile. It never touched the bottom. After discovering it, the FBI took away his property, and he never saw it again.&lt;/p&gt;\n\n&lt;p&gt;Other stories have surfaced about Mel&amp;#39;s Hole. One even stated that a man threw his dead dog down it, and a week later he saw his dog alive. It never looked at him when he called its name. The funny thing is that none of the accounts depict the REAL part of it. I&amp;#39;ll get to that later though.&lt;/p&gt;\n\n&lt;p&gt;These stories intrigued me greatly as a child. It fueled me to be a mini Christopher Columbus. I was determined to find out how the unknown works. I was determined to discover the undiscovered. It makes sense, curiosity is a part of human nature at a young age. I grew out of it as I got older. I grew skeptical of the unknown,  attempting to debunk it. Skepticism and attempts at scientific explanation of these things is also a part of human nature in young adults. &lt;/p&gt;\n\n&lt;p&gt;I hope it&amp;#39;s obvious that I lived a normal childhood in the city. I was, however, constantly berated by the ceaseless noise. Day and night, the city was alive. No end to the car honks and talking. Because of this, I decided to live in a rural area. To live in a house with a large backyard and only the noise of nature.&lt;/p&gt;\n\n&lt;p&gt;I got my dream home a month ago.&lt;/p&gt;\n\n&lt;p&gt;I read the information about the house while searching online. I rolled my eyes slightly because I assumed that the price would be available only to the 1%. That&amp;#39;s when I saw the price. &lt;/p&gt;\n\n&lt;p&gt;I arrived at my new home. I visited it earlier, but I wasn&amp;#39;t able to inspect it as closely as I was able to now. &lt;/p&gt;\n\n&lt;p&gt;The house has the typical house look. Front porch jutting out of the front with a slanted roof. That&amp;#39;s the first thing you see. To the right of the house, disconnected, is a garage that fits only one car. It&amp;#39;s about 20-30 feet from the house itself.&lt;/p&gt;\n\n&lt;p&gt;When you step in through the front porch, there&amp;#39;s a hallway tat diverges onto four rooms. On your instant right is the stairs leading to the second floor, and the study room.&lt;/p&gt;\n\n&lt;p&gt;Walk a little ways ahead and there&amp;#39;s the kitchen on the left. If you walk in turn right, there&amp;#39;s the living room. You can also walk into the living room through the hallway.&lt;/p&gt;\n\n&lt;p&gt;Back at the hallway, if you get to the end, you&amp;#39;re met with the backdoor. Upstairs there&amp;#39;s a laundry room directly in front of you when you walk up, and there&amp;#39;s a HUGE empty room directly to the left. That was my bedroom. At the end of the hallway, there&amp;#39;s a door leading to another empty room that would function as my storage room.&lt;/p&gt;\n\n&lt;p&gt;It took me about a week to set up, and after that, I explored the back.&lt;/p&gt;\n\n&lt;p&gt;Technically, I didn&amp;#39;t have a backyard. I had something a lot better. An entire forest right behind my house!&lt;/p&gt;\n\n&lt;p&gt;I decided to kick off my living here with a camp out in the forest behind my house. I invited 2 friends to camp out there and basically celebrate me moving out of my family&amp;#39;s house. &lt;/p&gt;\n\n&lt;p&gt;Really, I should have never camped out there.&lt;/p&gt;\n\n&lt;p&gt;My two friends showed up at about 5:00. Their names were Greg and Howard. We messed around a bit, watched some movies, until about 8 or so. Our stuff was ready, so we just grabbed our things and walked out. &lt;/p&gt;\n\n&lt;p&gt;We were trudging through the woods, laughing and joking around with each other. It took another hour for us to find a place and set up. When we finished, we all plopped down around the lamp that acted as the fire, and just talked.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So.. Uhh... Happy moving away from your family month I guess?&amp;quot; Howard asked cheekily.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Thanks. Glad that I moved out before I hit my mid twenties. I don&amp;#39;t wanna be a loser that lives in their parent&amp;#39;s basement and only comes out when fire rains from the sky.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Howard responded with a middle finger and a long drink from his beer.&lt;/p&gt;\n\n&lt;p&gt;Greg jumped in. &amp;quot;Dude, if you don&amp;#39;t stop, the no life will tear out your soul with their paper knife!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Howard jumped to life. &amp;quot;Oh stop, that was just one fucking time! I only got suspended for a week!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Howard, calm down man! We&amp;#39;re just jok-&amp;quot; I was cut off by a sound. A snap. It wasn&amp;#39;t a twig breaking. It was a heavy branch.&lt;/p&gt;\n\n&lt;p&gt;We fell silent. We looked at one another and let the silence ensue. Our suspicions of it being a creature where confirmed when we heard something BIG scurry off at an incredible speed. We paused to process what happened, before jumping up like idiots and grabbing our flashlights. We wanted to see what that was. Curiosity kills the fucking cat.&lt;/p&gt;\n\n&lt;p&gt;We kept running and running, to the point where I couldn&amp;#39;t see the camp site anymore.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Guys, maybe we should st- OH FUCK&amp;quot; I screamed. &lt;/p&gt;\n\n&lt;p&gt;I was looking behind me, not seeing this huge hole which I had just run into. I had stepped directly in, and let go of my flashlight as I fell. Luckily, Greg was quick enough to grab my leg. I swung towards the ground directly under my friends, and smashed my head against it. I heard a crunch and excruciating pain flew through my nose. In a daze, I looked up, which would be down into the hole for Greg and Howard. What I saw makes me go into a sweat when I think about it. When I looked up, my flashlight shined over something as it fell. In the hole, with me, was a pale humanoid creature. It was hunched and clung to the other side of the hole, but I was able to see that it&amp;#39;s a good 8 feet tall. The eyes were staring right into mine. I screamed and flinched.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What is it?!&amp;quot; Screamed Howard.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There&amp;#39;s a... a... uhh....&amp;quot; I uncovered my eyes as I stammered. The flashlight swung around again to the place here it should have been. It couldn&amp;#39;t have disappeared that fast. I didn&amp;#39;t even hear it move. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You wouldn&amp;#39;t believe me.&amp;quot; I squeaked out.&lt;/p&gt;\n\n&lt;p&gt;They hoisted me up and out of the hole, and we started to make our way towards where we thought our camp was.&lt;/p&gt;\n\n&lt;p&gt;As we walked, I heard an ear piercing screech and turned around to see the noise was coming from the hole. Howard and Greg both turned around; they heard it too.&lt;/p&gt;\n\n&lt;p&gt;I started to shake uncontrollably. Was it from the thing I saw? I didn&amp;#39;t want to experience that again.&lt;/p&gt;\n\n&lt;p&gt;A scratching came from the hole, and we all started backing up slowly. The scratches were reaching the top. We backed up faster, almost sprinting backwards. Stumbling over almost everything.&lt;/p&gt;\n\n&lt;p&gt;Then I saw the back of a pal, tall figure rise up from the hole.&lt;/p&gt;\n\n&lt;p&gt;It turned slowly towards us, and I saw a smile form on it&amp;#39;s lipless mouth. It eyed each of us quickly.&lt;/p&gt;\n\n&lt;p&gt;I spun around and bolted in the direction where I assumed my house was. Greg and Howard followed quickly.&lt;/p&gt;\n\n&lt;p&gt;I heard scratching and human screams behind me, but I kept running. I didn&amp;#39;t know if it got my friends, but I kept running. &lt;/p&gt;\n\n&lt;p&gt;I miraculously made it to my house. I locked the door behind me and ran upstairs to my bedroom, where I grabbed my phone and sat in a corner. I didn&amp;#39;t sleep at all, and I never left the confines of my bedroom until it was 10:00 in the morning. &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t seen Howard or Greg, and they haven&amp;#39;t picked up their phones at all. I can only assume the worst. At 10:00 I sprinted to my car, where I drove until I made it to a hospital to get my nose fixed up.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been almost a week since the event. I keep hearing scratching outside on my walls, and I keep seeing a pair of human eyes glowing from the forest.&lt;/p&gt;\n\n&lt;p&gt;This had to have been Mel&amp;#39;s hole. This was not natural. That hole was not natural.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ever heard of Mel's Hole? The story goes that a man named Mel discovered it in his backyard. He measured it with a rope that could extend for about a mile. It never touched the bottom. After discovering it, the FBI took away his property, and he never saw it again.\n\nOther stories have surfaced about Mel's Hole. One even stated that a man threw his dead dog down it, and a week later he saw his dog alive. It never looked at him when he called its name. The funny thing is that none of the accounts depict the REAL part of it. I'll get to that later though.\n\nThese stories intrigued me greatly as a child. It fueled me to be a mini Christopher Columbus. I was determined to find out how the unknown works. I was determined to discover the undiscovered. It makes sense, curiosity is a part of human nature at a young age. I grew out of it as I got older. I grew skeptical of the unknown,  attempting to debunk it. Skepticism and attempts at scientific explanation of these things is also a part of human nature in young adults. \n\nI hope it's obvious that I lived a normal childhood in the city. I was, however, constantly berated by the ceaseless noise. Day and night, the city was alive. No end to the car honks and talking. Because of this, I decided to live in a rural area. To live in a house with a large backyard and only the noise of nature.\n\nI got my dream home a month ago.\n\nI read the information about the house while searching online. I rolled my eyes slightly because I assumed that the price would be available only to the 1%. That's when I saw the price. \n\nI arrived at my new home. I visited it earlier, but I wasn't able to inspect it as closely as I was able to now. \n\nThe house has the typical house look. Front porch jutting out of the front with a slanted roof. That's the first thing you see. To the right of the house, disconnected, is a garage that fits only one car. It's about 20-30 feet from the house itself.\n\nWhen you step in through the front porch, there's a hallway tat diverges onto four rooms. On your instant right is the stairs leading to the second floor, and the study room.\n\nWalk a little ways ahead and there's the kitchen on the left. If you walk in turn right, there's the living room. You can also walk into the living room through the hallway.\n\nBack at the hallway, if you get to the end, you're met with the backdoor. Upstairs there's a laundry room directly in front of you when you walk up, and there's a HUGE empty room directly to the left. That was my bedroom. At the end of the hallway, there's a door leading to another empty room that would function as my storage room.\n\nIt took me about a week to set up, and after that, I explored the back.\n\nTechnically, I didn't have a backyard. I had something a lot better. An entire forest right behind my house!\n\nI decided to kick off my living here with a camp out in the forest behind my house. I invited 2 friends to camp out there and basically celebrate me moving out of my family's house. \n\nReally, I should have never camped out there.\n\nMy two friends showed up at about 5:00. Their names were Greg and Howard. We messed around a bit, watched some movies, until about 8 or so. Our stuff was ready, so we just grabbed our things and walked out. \n\nWe were trudging through the woods, laughing and joking around with each other. It took another hour for us to find a place and set up. When we finished, we all plopped down around the lamp that acted as the fire, and just talked.\n\n\"So.. Uhh... Happy moving away from your family month I guess?\" Howard asked cheekily.\n\n\"Thanks. Glad that I moved out before I hit my mid twenties. I don't wanna be a loser that lives in their parent's basement and only comes out when fire rains from the sky.\" \n\nHoward responded with a middle finger and a long drink from his beer.\n\nGreg jumped in. \"Dude, if you don't stop, the no life will tear out your soul with their paper knife!\"\n\nHoward jumped to life. \"Oh stop, that was just one fucking time! I only got suspended for a week!\"\n\n\"Howard, calm down man! We're just jok-\" I was cut off by a sound. A snap. It wasn't a twig breaking. It was a heavy branch.\n\nWe fell silent. We looked at one another and let the silence ensue. Our suspicions of it being a creature where confirmed when we heard something BIG scurry off at an incredible speed. We paused to process what happened, before jumping up like idiots and grabbing our flashlights. We wanted to see what that was. Curiosity kills the fucking cat.\n\nWe kept running and running, to the point where I couldn't see the camp site anymore.\n\n\"Guys, maybe we should st- OH FUCK\" I screamed. \n\nI was looking behind me, not seeing this huge hole which I had just run into. I had stepped directly in, and let go of my flashlight as I fell. Luckily, Greg was quick enough to grab my leg. I swung towards the ground directly under my friends, and smashed my head against it. I heard a crunch and excruciating pain flew through my nose. In a daze, I looked up, which would be down into the hole for Greg and Howard. What I saw makes me go into a sweat when I think about it. When I looked up, my flashlight shined over something as it fell. In the hole, with me, was a pale humanoid creature. It was hunched and clung to the other side of the hole, but I was able to see that it's a good 8 feet tall. The eyes were staring right into mine. I screamed and flinched.\n\n\"What is it?!\" Screamed Howard.\n\n\"There's a... a... uhh....\" I uncovered my eyes as I stammered. The flashlight swung around again to the place here it should have been. It couldn't have disappeared that fast. I didn't even hear it move. \n\n\"You wouldn't believe me.\" I squeaked out.\n\nThey hoisted me up and out of the hole, and we started to make our way towards where we thought our camp was.\n\nAs we walked, I heard an ear piercing screech and turned around to see the noise was coming from the hole. Howard and Greg both turned around; they heard it too.\n\nI started to shake uncontrollably. Was it from the thing I saw? I didn't want to experience that again.\n\nA scratching came from the hole, and we all started backing up slowly. The scratches were reaching the top. We backed up faster, almost sprinting backwards. Stumbling over almost everything.\n\nThen I saw the back of a pal, tall figure rise up from the hole.\n\nIt turned slowly towards us, and I saw a smile form on it's lipless mouth. It eyed each of us quickly.\n\nI spun around and bolted in the direction where I assumed my house was. Greg and Howard followed quickly.\n\nI heard scratching and human screams behind me, but I kept running. I didn't know if it got my friends, but I kept running. \n\nI miraculously made it to my house. I locked the door behind me and ran upstairs to my bedroom, where I grabbed my phone and sat in a corner. I didn't sleep at all, and I never left the confines of my bedroom until it was 10:00 in the morning. \n\nI haven't seen Howard or Greg, and they haven't picked up their phones at all. I can only assume the worst. At 10:00 I sprinted to my car, where I drove until I made it to a hospital to get my nose fixed up.\n\nIt's been almost a week since the event. I keep hearing scratching outside on my walls, and I keep seeing a pair of human eyes glowing from the forest.\n\nThis had to have been Mel's hole. This was not natural. That hole was not natural.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6545s6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 118, "report_reasons": null, "author": "ToastyAstronaut", "saved": false, "mod_reports": [], "name": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492127377.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/6545s6/theres_a_hole_in_the_forest/", "num_reports": null, "locked": false, "stickied": false, "created": 1492099323.0, "url": "https://www.reddit.com/r/nosleep/comments/6545s6/theres_a_hole_in_the_forest/", "author_flair_text": null, "quarantine": false, "title": "There's a hole in the forest.", "created_utc": 1492070523.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 118}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg7dl71", "gilded": 0, "archived": false, "score": 91, "report_reasons": null, "author": "Brock_Music", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You completely let your bros down, even after they saved you from falling in", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You completely let your bros down, even after they saved you from falling in&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7dl71", "score_hidden": false, "stickied": false, "created": 1492107537.0, "created_utc": 1492078737.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 91}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg7bmgi", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Nik556", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Great story OP!\n\nInvest in a shot gun. If it's flesh maybe you can do some damage?\n\nYou've also made me realise how 1 track my mind is as 'Mel's Hole' certainly wasn't what first came to mind... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story OP!&lt;/p&gt;\n\n&lt;p&gt;Invest in a shot gun. If it&amp;#39;s flesh maybe you can do some damage?&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve also made me realise how 1 track my mind is as &amp;#39;Mel&amp;#39;s Hole&amp;#39; certainly wasn&amp;#39;t what first came to mind... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7bmgi", "score_hidden": false, "stickied": false, "created": 1492101546.0, "created_utc": 1492072746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg8bmjs", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "suicidalpenguin99", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I can't believe you just left them and hid in your closet. That's fucked up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t believe you just left them and hid in your closet. That&amp;#39;s fucked up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8bmjs", "score_hidden": false, "stickied": false, "created": 1492150674.0, "created_utc": 1492121874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg7sjve", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Deshea420", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Bros before holes man!!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bros before holes man!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7sjve", "score_hidden": false, "stickied": false, "created": 1492129445.0, "created_utc": 1492100645.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg7avz4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mrmariomaster", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Scary hole", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Scary hole&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7avz4", "score_hidden": false, "stickied": false, "created": 1492099349.0, "created_utc": 1492070549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg8qzwk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Swimming_Byrd", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "But is there a hole in the bottom of the sea?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But is there a hole in the bottom of the sea?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8qzwk", "score_hidden": false, "stickied": false, "created": 1492172396.0, "created_utc": 1492143596.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg8g6kb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AbandonedPlanet", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Eh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8g6kb", "score_hidden": false, "stickied": false, "created": 1492156748.0, "created_utc": 1492127948.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg8tscq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOfTheFridge", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This was a very chilling story OP. There is just something about tall humanoid figures that get me shaken up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was a very chilling story OP. There is just something about tall humanoid figures that get me shaken up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8tscq", "score_hidden": false, "stickied": false, "created": 1492177669.0, "created_utc": 1492148869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6545s6", "likes": null, "replies": "", "user_reports": [], "id": "dg81k7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Taadaaaaa", "parent_id": "t3_6545s6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I fucking hate that creature.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fucking hate that creature.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg81k7i", "score_hidden": false, "stickied": false, "created": 1492139051.0, "created_utc": 1492110251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]