[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;God damn, where to begin?&lt;/p&gt;\n\n&lt;p&gt;Here are the facts: I have a friend named James. And he’s a true friend, although we’ve yet to meet in person. He lives in Illinois, and I hail from the scenic and relatively toothless state of Virginia. We know each other via Facebook and by mutual interest. We share our work, vent our shared frustrations—help each other out as we can.&lt;/p&gt;\n\n&lt;p&gt;Not long ago, he got in touch with me, emailed me a detailed account of his encounter with something that he claimed took on the shape of another friend of his, some guy by the name of Robert. He said it came from a park called ‘Forest Glen’, and that it hounded him at all hours of the night. Then, about a week later, he followed up the first email with another:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;‘Marcus, I’m sending this to you in sections from a password-protected Email. That way it can’t be edited, it cannot be changed. Only the facts will remain. The police have been no help, as I’ve explained. No one believes me, but I know the truth. There’s something out there.’&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;As he promised, James sent three others, day by day, so that his personal thoughts could not be tampered with. I thought he had lost it, truth be told. And I was worried about him. That being said, coward that I am, I remained silent about it. James had been my friend for a long time. I wasn’t about to tell him that his paranoid delusions had gotten out of control. With every email James sent, however, my opinion of his mental state began to shift. I’m finding it increasingly difficult to dismiss his rantings as mere fabrications from a broken mind.&lt;/p&gt;\n\n&lt;p&gt;To make it more coherent, I’ve consolidated every email James sent to me into one transcript. The following is his complete account of everything that happened to him on the days after his first encounter with that terrible monster. Take heed and fair warning, I expect you won’t like what you find within his words. I certainly didn’t.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Today was bad. It was worse than bad. It was a NIGHTMARE.&lt;/p&gt;\n\n&lt;p&gt;I’d expected him to be there last night, ya know? Like he’d been for the past two weeks. I was ready.&lt;/p&gt;\n\n&lt;p&gt;Every time I called someone, every time I tried to get help, he would disappear. But he would always return. I was scared, Marcus. I was so god damned scared. I knew it couldn’t last though. Day in and day out I was forced to barricade myself in my house, listening to that thing beg for me to let him in.&lt;/p&gt;\n\n&lt;p&gt;“PLEASE!” It would howl.&lt;/p&gt;\n\n&lt;p&gt;“I just want to be friends, I PROMISE!!”&lt;/p&gt;\n\n&lt;p&gt;I hadn’t even been to work in two weeks. In fact, I hadn’t had any human contact in that time. Robert, the real Robert, had called me several times. I’m sure he was worried about me, but I didn’t answer. What could I say, how could I explain what was going on?&lt;/p&gt;\n\n&lt;p&gt;Thanks to the month of vacation time I’d saved, I wasn’t worried about leaving my home. I just called my boss and told him that I had an emergency with family from out of town. He told me to take as much time as I needed.&lt;/p&gt;\n\n&lt;p&gt;Last night, I finally got the courage to face him. I decided I would not be a victim. Instead of hiding inside with a knife clutched to my chest, I waited on my front porch. A stiff drink in my hand, I sat down in a lawn chair on the deck. My other hand was placed above the blade that sat in my lap. I waited and I drank. The scotch went down more smoothly as the hours ticked past, as I’m sure you can imagine. It’s funny, I’m not a straight liquor sort of person, not under regular circumstances… but I’m getting way off topic.&lt;/p&gt;\n\n&lt;p&gt;So, I was waiting, right? Drunk as all hell by the end of it. My street is not a busy street. There’s no outlet at the end, and I’m the very last house on the left, so there’s no reason for cars to come all the way down to my home. That being said, nothing came by to keep my inebriated-self occupied. It wasn’t long before I just simply fell asleep.&lt;/p&gt;\n\n&lt;p&gt;I awoke with a start and stood quickly. Both the knife in my lap and the glass tumbler that was in my hand fell to the wood of the deck. I looked around my front yard and all around the deck, but there was no sign of that Robert imposter. Call me crazy, but I walked all around my house and then went inside to search every room. My head was splitting from a hangover, but I pressed on, searching every corner of the house. He wasn’t there.&lt;/p&gt;\n\n&lt;p&gt;To my surprise, he hadn’t come to terrorize me the night before, but why? I sat in my living room considering that very thing. Was it because I stood my ground? Because I simply got fed up and decided I wouldn’t be afraid anymore?  That was the only conclusion I came to.&lt;/p&gt;\n\n&lt;p&gt;My thoughts were interrupted by the ringing of my phone elsewhere in the house, and I’d realized I left it in the kitchen. When I found it, I already knew whose name would be on the screen.&lt;/p&gt;\n\n&lt;p&gt;Robert. I had to go see Robert. I had to try to explain to him everything that had happened. He was going to think I was crazy, but he and his family wouldn’t be safe unless they knew.&lt;/p&gt;\n\n&lt;p&gt;“Hey man, where have you been!?” He said when I picked up the phone.&lt;/p&gt;\n\n&lt;p&gt;“I thought something had happened, I’ve been call…” &lt;/p&gt;\n\n&lt;p&gt;I cut him off.&lt;/p&gt;\n\n&lt;p&gt;“Robert, listen. Something’s happened and I need to talk in person, can I come over?” &lt;/p&gt;\n\n&lt;p&gt;Robert waited a moment before replying.&lt;/p&gt;\n\n&lt;p&gt;“Err… yeah, but what’s going on man?”&lt;/p&gt;\n\n&lt;p&gt;“I’ll explain when I get there. I’ll be at your house in ten.” &lt;/p&gt;\n\n&lt;p&gt;I quickly hung up without another word. &lt;/p&gt;\n\n&lt;p&gt;Robert’s two girls, who are 7 and 9, were playing out on the front lawn when I pulled up to the house. They both waved at me and ran over to give me a hug when I got out of my car.&lt;/p&gt;\n\n&lt;p&gt;“Uncle James is here, Daddy!” Katie, the youngest of the two called back to the house.&lt;/p&gt;\n\n&lt;p&gt;Robert stepped out of the front door and waved, and I nodded back.&lt;/p&gt;\n\n&lt;p&gt;“All right girls, I have to go talk to your father, you play safe, okay?” &lt;/p&gt;\n\n&lt;p&gt;“We will!” Katie and Alexa said in unison, bounding back to the trampoline they’d been jumping on.&lt;/p&gt;\n\n&lt;p&gt;When I approached the front stoop of the house where Robert stood the first thing he did was embrace me. I didn’t want to let go. It was the first time I’d spoken to another living human being in weeks. It was a good, warm feeling. Christ, I wanted to cry.&lt;/p&gt;\n\n&lt;p&gt;Robert stepped away and looked me over.&lt;/p&gt;\n\n&lt;p&gt;“God damn man, you look like hell.” I couldn’t help but smile at that.&lt;/p&gt;\n\n&lt;p&gt;“Come inside.” &lt;/p&gt;\n\n&lt;p&gt;We made our way into the kitchen, where the smell of fresh coffee hung in the air.&lt;/p&gt;\n\n&lt;p&gt;“Where’s Cheree?” I asked while we walked. Cheree is Robert’s wife.&lt;/p&gt;\n\n&lt;p&gt;“Ah, she left for the store, should be back any moment now.”&lt;/p&gt;\n\n&lt;p&gt;At the table, I sat down, while Robert stayed standing.&lt;/p&gt;\n\n&lt;p&gt;“So, what’s been going on?” he asked. “I’ve been trying to get a hold of you forever.” He crossed his arms.&lt;/p&gt;\n\n&lt;p&gt;I took a deep breath, and I began to explain.&lt;/p&gt;\n\n&lt;p&gt;“Okay, this is going to sound completely nuts. You know how you told me they shut down Forest Glen because of the bodies they found?”&lt;/p&gt;\n\n&lt;p&gt;Robert raised an eyebrow.&lt;/p&gt;\n\n&lt;p&gt;“Yeah?” He said with an air of concern.&lt;/p&gt;\n\n&lt;p&gt;“I know what did it.” I said.&lt;/p&gt;\n\n&lt;p&gt;Robert unfolded his arms and places his hands on the table.&lt;/p&gt;\n\n&lt;p&gt;“What do you mean, &lt;em&gt;what&lt;/em&gt; did it?”&lt;/p&gt;\n\n&lt;p&gt;That’s when I went into my story. I told him everything I’ve told you. How I went out into the woods, following someone who couldn’t be him, someone who was watching us in the forest ever since we were younger. Then I described how I ran and made it home, how the police were no help in keeping that thing away. Finally, I ended with how I’d decided to stand up to the creature, but he was nowhere to be found the night before. &lt;/p&gt;\n\n&lt;p&gt;I expected Robert to stop me during my tale, to call me insane and tell me I needed to get out before I scared the kids, but he didn’t. Instead, he simply nodded as I spoke, listening to every word of my story. His face never changed, his expression never wavered. Never once did he give me an indication that he didn’t believe what I was saying. The same concerned expression he wore at the beginning of the story, he still had by the end. He was a good friend.\n“Holy shit, James, what are you going to do?” he asked.&lt;/p&gt;\n\n&lt;p&gt;I was a bit taken aback by that question. I hadn’t expected that sort of reaction.&lt;/p&gt;\n\n&lt;p&gt;“Well, I don’t know exactly. I just knew I had to come here and warn you before anything happened. These few weeks have been a nightmare. Honestly, it just feels good to be with someone and tell them, you know?”&lt;/p&gt;\n\n&lt;p&gt;Robert nodded solemnly and said, “I bet, I really wouldn’t want to be in your shoes, but I’ll do whatever I can. The girls love you, wouldn’t want anything to happen to their uncle.” &lt;/p&gt;\n\n&lt;p&gt;I smiled. I wasn’t their real uncle, of course. Robert and I had been friends for so long, that’s just what they knew me as. In that moment, I turned to look out into the back yard, where I expected the drive to be empty, but it wasn’t.&lt;/p&gt;\n\n&lt;p&gt;“Nothing will happen to my brother, I promise.” Robert said.&lt;/p&gt;\n\n&lt;p&gt;Shivers like spiders crawled frantically up and down my back as I stared out at Cheree’s car.&lt;/p&gt;\n\n&lt;p&gt;“Well, listen man, come out to the garage with me. We’ll crack a couple of beers and put together a plan.”&lt;/p&gt;\n\n&lt;p&gt;I stood from my seat at the table and turned to look him dead in the eye. For the second time I found myself in that terrifying situation. Only this time I didn’t run in panic and instead, took a moment to examine the beast wearing my friend’s skin. Studying Robert’s expression, the way he held himself, the way he spoke. Holy shit.&lt;/p&gt;\n\n&lt;p&gt;You really couldn’t tell he was a monster. &lt;/p&gt;\n\n&lt;p&gt;Thinking quickly, I said, “No, I think I better head out, it just occurred to me that I might be putting you in danger by being here.” &lt;/p&gt;\n\n&lt;p&gt;His face became hard, and I kept my eyes locked onto his. For the briefest of seconds, I saw a hot flash of anger in those eyes. &lt;em&gt;It Knew I knew&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Then, his expression softened. &lt;/p&gt;\n\n&lt;p&gt;“Well, if you feel the need, don’t hesitate to come back and let me know.” He smiled a devious smile and nodded.&lt;/p&gt;\n\n&lt;p&gt;“No judgment he brother, I promise,” He added.&lt;/p&gt;\n\n&lt;p&gt;I nodded and backed slowly out of the kitchen. Once I was out I strode out the front door and made my way to my car.&lt;/p&gt;\n\n&lt;p&gt;“Uncle James! Are you leaving?!” Alexa said, her bright blonde curls bouncing as she ran to me. I looked down at her and stared at her bright blue eyes. Right then and there I wanted to take her and her sister. Stow them in my car and simply drive away, but I didn’t. Looking up at the front door of the house, I saw Robert standing there, as I knew he would be. His arms were crossed, and his eyes were narrowed, watching me closely.&lt;/p&gt;\n\n&lt;p&gt;Instead, I knelt and embraced her tightly. When Katie ran over I pulled her close as well. Then I leaned back and looked sincerely at both of them.&lt;/p&gt;\n\n&lt;p&gt;“I love you girls very much.” I told them, holding them by the shoulders.&lt;/p&gt;\n\n&lt;p&gt;“I’m coming back to see you very soon, okay?”&lt;/p&gt;\n\n&lt;p&gt;“Okay!” They said.&lt;/p&gt;\n\n&lt;p&gt;They both said goodbye and bounded back to their play.&lt;/p&gt;\n\n&lt;p&gt;I am ashamed to say, I did nothing. Of course, I worried about them. I worried about Cheree too. My heart ached at the thought of what has or might happen to her. Not to mention, I had no idea what happened to Robert. I was so, so scared Marcus. What could I do? What would you have done?&lt;/p&gt;\n\n&lt;p&gt;I slid into my car, and I cried the whole way home as I drove. I feel so alone. What is that thing’s plan? Why is it doing this? &lt;/p&gt;\n\n&lt;p&gt;I’ve resolved to go back there, to that place. I believe that’s where I’ll find my answers. I need to move quickly, I don’t know what will happen to Alexa and Katie if I don’t. Maybe I can find proof, maybe I can find something the police haven’t.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Marcus I’ve been such a fool. Everything has come crashing down on me. I’ve failed Katie, I’ve failed Alexa, I’ve failed Cheree, and I’ve failed Robert. I was such a fucking coward before. I should have done something much sooner. &lt;/p&gt;\n\n&lt;p&gt;I made it out to Forest Glen about a quarter after four. I parked on the side of the road about a mile from the park and hit the hazard lights. That way if anyone drove by I could just say the car had broken down and I’d been looking for help. I’d expected to run into some resistance. Police tape or maybe a patrol or something, hell I didn’t know. All I knew is that I didn’t want to get caught before I’d made it to the trail. The trail I’d told you about before, the one that thing tried to lead me down.&lt;/p&gt;\n\n&lt;p&gt;I jogged from the road to the park entrance. Before I’d left the house, I’d made sure to bring a good-sized pocket knife, and as I jogged I kept touching my back-right jean-pocket where I could feel its shape. It made me feel a little more secure about going into those woods.&lt;/p&gt;\n\n&lt;p&gt;Surprisingly, I saw no police tape when I’d made it to the park entrance. There was no patrolman posted either, at least, none that I could see. From then on, I walked slowly toward the trail. I stayed close to the tree line, ready to duck into the woods if anyone drove by, and if need be I could run out into the road if anything came out of the woods. It felt like I was walking for hours, stopping often to listen for anything that might indicate someone’s approach. I heard nothing at all, and I mean &lt;em&gt;nothing&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;I remember distinctly the sounds of wildlife the last time I had visited the park. Now, as I crept along the road, all was silent. Not even the buzzing of insects could be heard as I went. &lt;/p&gt;\n\n&lt;p&gt;At last, I reached the entrance of the trail that had been the cause of my nightmares for past several days. I pulled the knife from my pocket and flicked it open, holding it low. I walked throughout the trail as slowly as I had when I walked the road. The fear I felt was great, but the urgency I felt was greater, so I pressed on.  At any moment, I was ready to lash out with my weapon, and holding it tightly gave me the strength to keep going.&lt;/p&gt;\n\n&lt;p&gt;Even that far into the wooded area of the park, I heard no sounds. Robert had told me they closed Forest Glen, but I saw no sign of that. Other than the absolute quiet, there was nothing to indicate the park had been closed. No keep out signs, no police tape, nothing. Soon I reached the stream and still I pressed on. As I reached the point of the trail where I’d first realized something was wrong and ran from Robert, I wavered. &lt;/p&gt;\n\n&lt;p&gt;When we were out there, the Robert imposter told me that he had wanted to show me a bridge that I’d remembered from when we were kids. Below, the water was crystal clear, I remembered that, but that wasn’t what frightened me. When we were on the phone, the real Robert told me that people had died from drowning. My suspicion was that they had found the bodies under the very bridge the Robert imposter had wanted to show me so badly. I shivered and, not for the first time on that trail, I tightened the grip on my knife and pressed on.&lt;/p&gt;\n\n&lt;p&gt;Finally, the rotted wood of the bridge was in sight, and I froze. My eyes narrowed, and I strained them hard as I scanned the woods around me, looking for Robert to be waiting behind one of the trees, ready to pounce at any moment. After a couple minutes of waiting and seeing nothing, I took a deep breath and walked toward the sound of running water. &lt;/p&gt;\n\n&lt;p&gt;The smell hit me hard. I reached the high bank of the stream down below, and before I could even look over it, I gagged a vomited as the rotten stench of decaying flesh hit my nostrils. I wiped my face with my sleeve and covered my mouth and nose as I looked over the side, placing one foot on the bridge for balance. The wood was wet, and my foot slipped, and I fell to the grass on my hands and knees. My knife fell over the side, and I watched as it tumbled down and landed on a corpse.&lt;/p&gt;\n\n&lt;p&gt;Robert told me there had been four hikers found dead out there in those woods by drowning.&lt;/p&gt;\n\n&lt;p&gt;It’s so strange how in moments of absolute shock, a person can do irrational things. When I looked down into that water, the shock I felt along with the memory of Robert’s claim, made me laugh, and I laughed loudly. The stream was deep for a stream, but for a person it was shallow, and a body could not easily be carried by its water. Let alone dozens. &lt;/p&gt;\n\n&lt;p&gt;In absolute horror, I looked up and down the stream as my mind tried to process exactly how many there were. I couldn’t even venture a guess, but there were too many to count. In the throng of bloated and decaying corpses, there were many I could make out and recognize.&lt;/p&gt;\n\n&lt;p&gt;There was the guy who owned the laundromat in town, and a woman that I knew was a cashier at the gas station, and there were so many more that I knew. I had been cooped up in the house for days sure, but I hadn’t seen any of these people go missing on the news, and Robert made no mention of any of them. These bodies had been there for weeks judging by the state of their corpses.  It didn’t make sense. Then, I saw the two bodies that made me finally understand. &lt;/p&gt;\n\n&lt;p&gt;They were lying on top of a few other bodies, almost directly next to the corpse that my knife had landed on. Their hands were joined together, as if they had been put on display for me to see. They stared back up and my red and crying face through milky-white eyes. They had not died recently, the pale-white shroud of death had been long set into their cheeks. Even if they had begun to decay, they were sisters. There was no way I could mistake that curly blonde hair.&lt;/p&gt;\n\n&lt;p&gt;I fell to my knees and I screamed down at them in anguish. I cried and bawled and begged for it not to be real. I screamed their names to the sky and I howled for their forgiveness, but I knew forgiveness would not come. I knew this was real. Alexa and Katie were not there when I promised them both I would be back to see them, they looked like them, sure, but it wasn’t them.&lt;/p&gt;\n\n&lt;p&gt;Defeated, I walked all the way out of the park and to my car. I was slow and deliberate. Nothing was coming for me, I knew that too. They wanted me to see it, what they had done. The state of the girl’s bodies, the way they were presented, it sent a clear message. I was truly alone.&lt;/p&gt;\n\n&lt;p&gt;I drove all the way back here, and I’m telling you all this now Marcus, because you have to know. &lt;em&gt;Do not&lt;/em&gt; come to Illinois. Stay away and stay safe. &lt;/p&gt;\n\n&lt;p&gt;When I first began, I told you there was something in Forest Glen, but Marcus, I was dead wrong. There wasn’t just &lt;em&gt;something&lt;/em&gt;. No, not at all.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;That should have been the end of it, the final part of James’s story. And that would have been bad enough. For three days, I’ve been trying to reach him. For three days, I’ve been paralyzed by indecision, crippled by dread and doubt. What would a normal person do? What would a friend do? Call the cops? Get my friend incarcerated while people who won’t understand the background try to dig up the “truth,” whatever that is? Drive out there?&lt;/p&gt;\n\n&lt;p&gt;If it’s true—and the more I think about it, the more that possibility grows in my mind—then how the hell does the whole world not already know about this? And then my rational half reasserts itself, and I think, has my friend lost his god-damned mind? That’s got to be it. By now, someone’s clued in on his issues and he’s already getting help. Seems reasonable, right?&lt;/p&gt;\n\n&lt;p&gt;And then, this. Another email. God help me. I don’t know what to think anymore. And I sure as hell don’t know what to do.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Dear Marcus. Please disregard my previous correspondence. I was simply out of my mind. I hadn’t been taking any of my medication and I concocted a story to gain attention. As I said, I was wrong when I said there was something in that place.&lt;/p&gt;\n\n&lt;p&gt;There’s nothing in Forest Glen, I promise. There’s nothing in Forest Glen, I promise. There’s nothing in Forest Glen, I promise. THERE’S NOTHING IN FOREST GLEN, I PROMISE.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "God damn, where to begin?\n\nHere are the facts: I have a friend named James. And he’s a true friend, although we’ve yet to meet in person. He lives in Illinois, and I hail from the scenic and relatively toothless state of Virginia. We know each other via Facebook and by mutual interest. We share our work, vent our shared frustrations—help each other out as we can.\n\nNot long ago, he got in touch with me, emailed me a detailed account of his encounter with something that he claimed took on the shape of another friend of his, some guy by the name of Robert. He said it came from a park called ‘Forest Glen’, and that it hounded him at all hours of the night. Then, about a week later, he followed up the first email with another:\n\n*‘Marcus, I’m sending this to you in sections from a password-protected Email. That way it can’t be edited, it cannot be changed. Only the facts will remain. The police have been no help, as I’ve explained. No one believes me, but I know the truth. There’s something out there.’*\n\nAs he promised, James sent three others, day by day, so that his personal thoughts could not be tampered with. I thought he had lost it, truth be told. And I was worried about him. That being said, coward that I am, I remained silent about it. James had been my friend for a long time. I wasn’t about to tell him that his paranoid delusions had gotten out of control. With every email James sent, however, my opinion of his mental state began to shift. I’m finding it increasingly difficult to dismiss his rantings as mere fabrications from a broken mind.\n\nTo make it more coherent, I’ve consolidated every email James sent to me into one transcript. The following is his complete account of everything that happened to him on the days after his first encounter with that terrible monster. Take heed and fair warning, I expect you won’t like what you find within his words. I certainly didn’t.\n\n_____________________________________________________________________________________\n\nToday was bad. It was worse than bad. It was a NIGHTMARE.\n\nI’d expected him to be there last night, ya know? Like he’d been for the past two weeks. I was ready.\n\nEvery time I called someone, every time I tried to get help, he would disappear. But he would always return. I was scared, Marcus. I was so god damned scared. I knew it couldn’t last though. Day in and day out I was forced to barricade myself in my house, listening to that thing beg for me to let him in.\n\n“PLEASE!” It would howl.\n\n“I just want to be friends, I PROMISE!!”\n\nI hadn’t even been to work in two weeks. In fact, I hadn’t had any human contact in that time. Robert, the real Robert, had called me several times. I’m sure he was worried about me, but I didn’t answer. What could I say, how could I explain what was going on?\n\nThanks to the month of vacation time I’d saved, I wasn’t worried about leaving my home. I just called my boss and told him that I had an emergency with family from out of town. He told me to take as much time as I needed.\n\nLast night, I finally got the courage to face him. I decided I would not be a victim. Instead of hiding inside with a knife clutched to my chest, I waited on my front porch. A stiff drink in my hand, I sat down in a lawn chair on the deck. My other hand was placed above the blade that sat in my lap. I waited and I drank. The scotch went down more smoothly as the hours ticked past, as I’m sure you can imagine. It’s funny, I’m not a straight liquor sort of person, not under regular circumstances… but I’m getting way off topic.\n\nSo, I was waiting, right? Drunk as all hell by the end of it. My street is not a busy street. There’s no outlet at the end, and I’m the very last house on the left, so there’s no reason for cars to come all the way down to my home. That being said, nothing came by to keep my inebriated-self occupied. It wasn’t long before I just simply fell asleep.\n\nI awoke with a start and stood quickly. Both the knife in my lap and the glass tumbler that was in my hand fell to the wood of the deck. I looked around my front yard and all around the deck, but there was no sign of that Robert imposter. Call me crazy, but I walked all around my house and then went inside to search every room. My head was splitting from a hangover, but I pressed on, searching every corner of the house. He wasn’t there.\n\nTo my surprise, he hadn’t come to terrorize me the night before, but why? I sat in my living room considering that very thing. Was it because I stood my ground? Because I simply got fed up and decided I wouldn’t be afraid anymore?  That was the only conclusion I came to.\n\nMy thoughts were interrupted by the ringing of my phone elsewhere in the house, and I’d realized I left it in the kitchen. When I found it, I already knew whose name would be on the screen.\n\nRobert. I had to go see Robert. I had to try to explain to him everything that had happened. He was going to think I was crazy, but he and his family wouldn’t be safe unless they knew.\n\n“Hey man, where have you been!?” He said when I picked up the phone.\n\n“I thought something had happened, I’ve been call…” \n\nI cut him off.\n\n“Robert, listen. Something’s happened and I need to talk in person, can I come over?” \n\nRobert waited a moment before replying.\n\n“Err… yeah, but what’s going on man?”\n\n“I’ll explain when I get there. I’ll be at your house in ten.” \n\nI quickly hung up without another word. \n\nRobert’s two girls, who are 7 and 9, were playing out on the front lawn when I pulled up to the house. They both waved at me and ran over to give me a hug when I got out of my car.\n\n“Uncle James is here, Daddy!” Katie, the youngest of the two called back to the house.\n\nRobert stepped out of the front door and waved, and I nodded back.\n\n\n“All right girls, I have to go talk to your father, you play safe, okay?” \n\n“We will!” Katie and Alexa said in unison, bounding back to the trampoline they’d been jumping on.\n\nWhen I approached the front stoop of the house where Robert stood the first thing he did was embrace me. I didn’t want to let go. It was the first time I’d spoken to another living human being in weeks. It was a good, warm feeling. Christ, I wanted to cry.\n\nRobert stepped away and looked me over.\n\n“God damn man, you look like hell.” I couldn’t help but smile at that.\n\n“Come inside.” \n\nWe made our way into the kitchen, where the smell of fresh coffee hung in the air.\n\n“Where’s Cheree?” I asked while we walked. Cheree is Robert’s wife.\n\n“Ah, she left for the store, should be back any moment now.”\n\nAt the table, I sat down, while Robert stayed standing.\n\n“So, what’s been going on?” he asked. “I’ve been trying to get a hold of you forever.” He crossed his arms.\n\nI took a deep breath, and I began to explain.\n\n“Okay, this is going to sound completely nuts. You know how you told me they shut down Forest Glen because of the bodies they found?”\n\nRobert raised an eyebrow.\n\n“Yeah?” He said with an air of concern.\n\n“I know what did it.” I said.\n\nRobert unfolded his arms and places his hands on the table.\n\n“What do you mean, *what* did it?”\n\nThat’s when I went into my story. I told him everything I’ve told you. How I went out into the woods, following someone who couldn’t be him, someone who was watching us in the forest ever since we were younger. Then I described how I ran and made it home, how the police were no help in keeping that thing away. Finally, I ended with how I’d decided to stand up to the creature, but he was nowhere to be found the night before. \n\nI expected Robert to stop me during my tale, to call me insane and tell me I needed to get out before I scared the kids, but he didn’t. Instead, he simply nodded as I spoke, listening to every word of my story. His face never changed, his expression never wavered. Never once did he give me an indication that he didn’t believe what I was saying. The same concerned expression he wore at the beginning of the story, he still had by the end. He was a good friend.\n“Holy shit, James, what are you going to do?” he asked.\n\nI was a bit taken aback by that question. I hadn’t expected that sort of reaction.\n\n“Well, I don’t know exactly. I just knew I had to come here and warn you before anything happened. These few weeks have been a nightmare. Honestly, it just feels good to be with someone and tell them, you know?”\n\nRobert nodded solemnly and said, “I bet, I really wouldn’t want to be in your shoes, but I’ll do whatever I can. The girls love you, wouldn’t want anything to happen to their uncle.” \n\nI smiled. I wasn’t their real uncle, of course. Robert and I had been friends for so long, that’s just what they knew me as. In that moment, I turned to look out into the back yard, where I expected the drive to be empty, but it wasn’t.\n\n“Nothing will happen to my brother, I promise.” Robert said.\n\nShivers like spiders crawled frantically up and down my back as I stared out at Cheree’s car.\n\n“Well, listen man, come out to the garage with me. We’ll crack a couple of beers and put together a plan.”\n\nI stood from my seat at the table and turned to look him dead in the eye. For the second time I found myself in that terrifying situation. Only this time I didn’t run in panic and instead, took a moment to examine the beast wearing my friend’s skin. Studying Robert’s expression, the way he held himself, the way he spoke. Holy shit.\n\nYou really couldn’t tell he was a monster. \n\nThinking quickly, I said, “No, I think I better head out, it just occurred to me that I might be putting you in danger by being here.” \n\nHis face became hard, and I kept my eyes locked onto his. For the briefest of seconds, I saw a hot flash of anger in those eyes. *It Knew I knew*.\n\nThen, his expression softened. \n\n“Well, if you feel the need, don’t hesitate to come back and let me know.” He smiled a devious smile and nodded.\n\n“No judgment he brother, I promise,” He added.\n\nI nodded and backed slowly out of the kitchen. Once I was out I strode out the front door and made my way to my car.\n\n“Uncle James! Are you leaving?!” Alexa said, her bright blonde curls bouncing as she ran to me. I looked down at her and stared at her bright blue eyes. Right then and there I wanted to take her and her sister. Stow them in my car and simply drive away, but I didn’t. Looking up at the front door of the house, I saw Robert standing there, as I knew he would be. His arms were crossed, and his eyes were narrowed, watching me closely.\n\nInstead, I knelt and embraced her tightly. When Katie ran over I pulled her close as well. Then I leaned back and looked sincerely at both of them.\n\n“I love you girls very much.” I told them, holding them by the shoulders.\n\n“I’m coming back to see you very soon, okay?”\n\n“Okay!” They said.\n\nThey both said goodbye and bounded back to their play.\n\nI am ashamed to say, I did nothing. Of course, I worried about them. I worried about Cheree too. My heart ached at the thought of what has or might happen to her. Not to mention, I had no idea what happened to Robert. I was so, so scared Marcus. What could I do? What would you have done?\n\nI slid into my car, and I cried the whole way home as I drove. I feel so alone. What is that thing’s plan? Why is it doing this? \n\nI’ve resolved to go back there, to that place. I believe that’s where I’ll find my answers. I need to move quickly, I don’t know what will happen to Alexa and Katie if I don’t. Maybe I can find proof, maybe I can find something the police haven’t.\n\n____________________________________________________________________________________\nMarcus I’ve been such a fool. Everything has come crashing down on me. I’ve failed Katie, I’ve failed Alexa, I’ve failed Cheree, and I’ve failed Robert. I was such a fucking coward before. I should have done something much sooner. \n\nI made it out to Forest Glen about a quarter after four. I parked on the side of the road about a mile from the park and hit the hazard lights. That way if anyone drove by I could just say the car had broken down and I’d been looking for help. I’d expected to run into some resistance. Police tape or maybe a patrol or something, hell I didn’t know. All I knew is that I didn’t want to get caught before I’d made it to the trail. The trail I’d told you about before, the one that thing tried to lead me down.\n\nI jogged from the road to the park entrance. Before I’d left the house, I’d made sure to bring a good-sized pocket knife, and as I jogged I kept touching my back-right jean-pocket where I could feel its shape. It made me feel a little more secure about going into those woods.\n\nSurprisingly, I saw no police tape when I’d made it to the park entrance. There was no patrolman posted either, at least, none that I could see. From then on, I walked slowly toward the trail. I stayed close to the tree line, ready to duck into the woods if anyone drove by, and if need be I could run out into the road if anything came out of the woods. It felt like I was walking for hours, stopping often to listen for anything that might indicate someone’s approach. I heard nothing at all, and I mean *nothing*.\n\nI remember distinctly the sounds of wildlife the last time I had visited the park. Now, as I crept along the road, all was silent. Not even the buzzing of insects could be heard as I went. \n\nAt last, I reached the entrance of the trail that had been the cause of my nightmares for past several days. I pulled the knife from my pocket and flicked it open, holding it low. I walked throughout the trail as slowly as I had when I walked the road. The fear I felt was great, but the urgency I felt was greater, so I pressed on.  At any moment, I was ready to lash out with my weapon, and holding it tightly gave me the strength to keep going.\n\nEven that far into the wooded area of the park, I heard no sounds. Robert had told me they closed Forest Glen, but I saw no sign of that. Other than the absolute quiet, there was nothing to indicate the park had been closed. No keep out signs, no police tape, nothing. Soon I reached the stream and still I pressed on. As I reached the point of the trail where I’d first realized something was wrong and ran from Robert, I wavered. \n\nWhen we were out there, the Robert imposter told me that he had wanted to show me a bridge that I’d remembered from when we were kids. Below, the water was crystal clear, I remembered that, but that wasn’t what frightened me. When we were on the phone, the real Robert told me that people had died from drowning. My suspicion was that they had found the bodies under the very bridge the Robert imposter had wanted to show me so badly. I shivered and, not for the first time on that trail, I tightened the grip on my knife and pressed on.\n\nFinally, the rotted wood of the bridge was in sight, and I froze. My eyes narrowed, and I strained them hard as I scanned the woods around me, looking for Robert to be waiting behind one of the trees, ready to pounce at any moment. After a couple minutes of waiting and seeing nothing, I took a deep breath and walked toward the sound of running water. \n\nThe smell hit me hard. I reached the high bank of the stream down below, and before I could even look over it, I gagged a vomited as the rotten stench of decaying flesh hit my nostrils. I wiped my face with my sleeve and covered my mouth and nose as I looked over the side, placing one foot on the bridge for balance. The wood was wet, and my foot slipped, and I fell to the grass on my hands and knees. My knife fell over the side, and I watched as it tumbled down and landed on a corpse.\n\nRobert told me there had been four hikers found dead out there in those woods by drowning.\n\n It’s so strange how in moments of absolute shock, a person can do irrational things. When I looked down into that water, the shock I felt along with the memory of Robert’s claim, made me laugh, and I laughed loudly. The stream was deep for a stream, but for a person it was shallow, and a body could not easily be carried by its water. Let alone dozens. \n\nIn absolute horror, I looked up and down the stream as my mind tried to process exactly how many there were. I couldn’t even venture a guess, but there were too many to count. In the throng of bloated and decaying corpses, there were many I could make out and recognize.\n\nThere was the guy who owned the laundromat in town, and a woman that I knew was a cashier at the gas station, and there were so many more that I knew. I had been cooped up in the house for days sure, but I hadn’t seen any of these people go missing on the news, and Robert made no mention of any of them. These bodies had been there for weeks judging by the state of their corpses.  It didn’t make sense. Then, I saw the two bodies that made me finally understand. \n\nThey were lying on top of a few other bodies, almost directly next to the corpse that my knife had landed on. Their hands were joined together, as if they had been put on display for me to see. They stared back up and my red and crying face through milky-white eyes. They had not died recently, the pale-white shroud of death had been long set into their cheeks. Even if they had begun to decay, they were sisters. There was no way I could mistake that curly blonde hair.\n\nI fell to my knees and I screamed down at them in anguish. I cried and bawled and begged for it not to be real. I screamed their names to the sky and I howled for their forgiveness, but I knew forgiveness would not come. I knew this was real. Alexa and Katie were not there when I promised them both I would be back to see them, they looked like them, sure, but it wasn’t them.\n\nDefeated, I walked all the way out of the park and to my car. I was slow and deliberate. Nothing was coming for me, I knew that too. They wanted me to see it, what they had done. The state of the girl’s bodies, the way they were presented, it sent a clear message. I was truly alone.\n\n I drove all the way back here, and I’m telling you all this now Marcus, because you have to know. *Do not* come to Illinois. Stay away and stay safe. \n\nWhen I first began, I told you there was something in Forest Glen, but Marcus, I was dead wrong. There wasn’t just *something*. No, not at all.\n\n\n_____________________________________________________________________________________\n\nThat should have been the end of it, the final part of James’s story. And that would have been bad enough. For three days, I’ve been trying to reach him. For three days, I’ve been paralyzed by indecision, crippled by dread and doubt. What would a normal person do? What would a friend do? Call the cops? Get my friend incarcerated while people who won’t understand the background try to dig up the “truth,” whatever that is? Drive out there?\n\n\nIf it’s true—and the more I think about it, the more that possibility grows in my mind—then how the hell does the whole world not already know about this? And then my rational half reasserts itself, and I think, has my friend lost his god-damned mind? That’s got to be it. By now, someone’s clued in on his issues and he’s already getting help. Seems reasonable, right?\n\n\nAnd then, this. Another email. God help me. I don’t know what to think anymore. And I sure as hell don’t know what to do.\n\n_____________________________________________________________________________________\n\nDear Marcus. Please disregard my previous correspondence. I was simply out of my mind. I hadn’t been taking any of my medication and I concocted a story to gain attention. As I said, I was wrong when I said there was something in that place.\n\nThere’s nothing in Forest Glen, I promise. There’s nothing in Forest Glen, I promise. There’s nothing in Forest Glen, I promise. THERE’S NOTHING IN FOREST GLEN, I PROMISE.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6572sm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 101, "report_reasons": null, "author": "MarcusDamanda", "saved": false, "mod_reports": [], "name": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/6572sm/theres_nothing_in_forest_glen_national_park/", "num_reports": null, "locked": false, "stickied": false, "created": 1492134608.0, "url": "https://www.reddit.com/r/nosleep/comments/6572sm/theres_nothing_in_forest_glen_national_park/", "author_flair_text": null, "quarantine": false, "title": "There's Nothing in Forest Glen National Park", "created_utc": 1492105808.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 23, "visited": false, "subreddit_type": "public", "ups": 101}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dg7xjxt", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "MarcusDamanda", "parent_id": "t1_dg7xhpv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "James, where the hell are you? You are NOT being yourself. I'm trying to help you. Jesus, man ...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;James, where the hell are you? You are NOT being yourself. I&amp;#39;m trying to help you. Jesus, man ...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7xjxt", "score_hidden": false, "stickied": false, "created": 1492134770.0, "created_utc": 1492105970.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xhpv", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "JJCheesman", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Marcus. We have told you several times. There is nothing in Forest Glen. These Emails were in error. Please, I beg you, do not spread this any further. You're making us look insane. As I've promised, there's NOTHING in Forest Glen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marcus. We have told you several times. There is nothing in Forest Glen. These Emails were in error. Please, I beg you, do not spread this any further. You&amp;#39;re making us look insane. As I&amp;#39;ve promised, there&amp;#39;s NOTHING in Forest Glen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg7xhpv", "score_hidden": false, "stickied": false, "created": 1492134706.0, "created_utc": 1492105906.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dgbnc59", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Amaryllis-Sage", "parent_id": "t1_dg8vo17", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Reasonable, considering you're in r/nosleep!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reasonable, considering you&amp;#39;re in &lt;a href=\"/r/nosleep\"&gt;r/nosleep&lt;/a&gt;!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbnc59", "score_hidden": false, "stickied": false, "created": 1492343760.0, "created_utc": 1492314960.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vo17", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "NookFin", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I must need sleep because thought \"Cheree\" was \"cheese.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I must need sleep because thought &amp;quot;Cheree&amp;quot; was &amp;quot;cheese.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8vo17", "score_hidden": false, "stickied": false, "created": 1492182172.0, "created_utc": 1492153372.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dg8qx39", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "OrangeChickenAnd7Up", "parent_id": "t1_dg8qfta", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh ok, sounds cool. But are you sure there's not a thing there? I mean it definitely looked like a thing. And I've seen plenty of things in my time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh ok, sounds cool. But are you sure there&amp;#39;s not a thing there? I mean it definitely looked like a thing. And I&amp;#39;ve seen plenty of things in my time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8qx39", "score_hidden": false, "stickied": false, "created": 1492172264.0, "created_utc": 1492143464.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8qfta", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "JJCheesman", "parent_id": "t1_dg8q6ux", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You didn't see anything there. I believe the rest of us will stand United and re-accommodate you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You didn&amp;#39;t see anything there. I believe the rest of us will stand United and re-accommodate you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8qfta", "score_hidden": false, "stickied": false, "created": 1492171475.0, "created_utc": 1492142675.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8q6ux", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "OrangeChickenAnd7Up", "parent_id": "t1_dg8nkb3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Hey guys, I was just in Glen's Forest and I think I saw something there. What do you guys think?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys, I was just in Glen&amp;#39;s Forest and I think I saw something there. What do you guys think?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8q6ux", "score_hidden": false, "stickied": false, "created": 1492171082.0, "created_utc": 1492142282.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dg9zjw4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarcusDamanda", "parent_id": "t1_dg9s9ul", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm here, man. Where the fuck are you? This place is huge--give us a starting point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m here, man. Where the fuck are you? This place is huge--give us a starting point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9zjw4", "score_hidden": false, "stickied": false, "created": 1492243859.0, "created_utc": 1492215059.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9s9ul", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JJCheesman", "parent_id": "t1_dg8zj87", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "On second thought Marcus. Please, bring help. Bring as much help as you can. It will all work out for the best. I promise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On second thought Marcus. Please, bring help. Bring as much help as you can. It will all work out for the best. I promise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9s9ul", "score_hidden": false, "stickied": false, "created": 1492234221.0, "created_utc": 1492205421.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zj87", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarcusDamanda", "parent_id": "t1_dg8nkb3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This isn't James. Who, or WHAT the hell are you? James, if you're there, if you can somehow read this, I'm coming for you. I'm bringing help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t James. Who, or WHAT the hell are you? James, if you&amp;#39;re there, if you can somehow read this, I&amp;#39;m coming for you. I&amp;#39;m bringing help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8zj87", "score_hidden": false, "stickied": false, "created": 1492194182.0, "created_utc": 1492165382.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nkb3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JJCheesman", "parent_id": "t1_dg8jw9q", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There is absolutely nothing there. We promise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is absolutely nothing there. We promise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8nkb3", "score_hidden": false, "stickied": false, "created": 1492167008.0, "created_utc": 1492138208.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8jw9q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thatoneguy596", "parent_id": "t1_dg8h8ib", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There is jothing in forest glen. I promise", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is jothing in forest glen. I promise&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8jw9q", "score_hidden": false, "stickied": false, "created": 1492161850.0, "created_utc": 1492133050.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8h8ib", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Wantsmetokissagayguy", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Pssst there's something in glens forest", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pssst there&amp;#39;s something in glens forest&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8h8ib", "score_hidden": false, "stickied": false, "created": 1492158202.0, "created_utc": 1492129402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dg858i8", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lance4548", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There is nothing in glen forest. I promise. These emails we're a desperate cry of attention from someone clearly in need of help. There's nothing in glen forest. I promise. Nothing bad is happening. I promise. This is none of your concern. I promise. Do not go to glen forest. I promise. There is nothing in glen forest. I promise. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is nothing in glen forest. I promise. These emails we&amp;#39;re a desperate cry of attention from someone clearly in need of help. There&amp;#39;s nothing in glen forest. I promise. Nothing bad is happening. I promise. This is none of your concern. I promise. Do not go to glen forest. I promise. There is nothing in glen forest. I promise. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg858i8", "score_hidden": false, "stickied": false, "created": 1492143060.0, "created_utc": 1492114260.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dg9a59g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RCONSPIRACYISCORRUPT", "parent_id": "t1_dg951h5", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Can you guys meet me there.  There's a cool bridge I want to show you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you guys meet me there.  There&amp;#39;s a cool bridge I want to show you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9a59g", "score_hidden": false, "stickied": false, "created": 1492212822.0, "created_utc": 1492184022.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg951h5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "brezze95", "parent_id": "t1_dg8t6wz", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Me too!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Me too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg951h5", "score_hidden": false, "stickied": false, "created": 1492206154.0, "created_utc": 1492177354.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8t6wz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "internetqueef", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Cool I live by and frequent Forest Glen all the time!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool I live by and frequent Forest Glen all the time!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8t6wz", "score_hidden": false, "stickied": false, "created": 1492176457.0, "created_utc": 1492147657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dgbnhag", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Amaryllis-Sage", "parent_id": "t1_dgb1gj6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I assumed skinwalkers as well, but skinwalkers aren't as... intelligent, as that. Well, it's not necessarily a matter of being smart or not, it's more of becoming accustomed to their new form. A skinwalker that takes the image of a recent victim would be a lot more robotic, not to mention lacking fine motor skills. Apart from the screams of their victims, that is. Soooo I think it's probably not skinwalkers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I assumed skinwalkers as well, but skinwalkers aren&amp;#39;t as... intelligent, as that. Well, it&amp;#39;s not necessarily a matter of being smart or not, it&amp;#39;s more of becoming accustomed to their new form. A skinwalker that takes the image of a recent victim would be a lot more robotic, not to mention lacking fine motor skills. Apart from the screams of their victims, that is. Soooo I think it&amp;#39;s probably not skinwalkers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbnhag", "score_hidden": false, "stickied": false, "created": 1492343995.0, "created_utc": 1492315195.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1gj6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jaygreenbean", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "So are we talking Skinwalkers here, or something more insidious\n\n?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So are we talking Skinwalkers here, or something more insidious&lt;/p&gt;\n\n&lt;p&gt;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb1gj6", "score_hidden": false, "stickied": false, "created": 1492312542.0, "created_utc": 1492283742.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dgboaeo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jaygreenbean", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Any ideas?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any ideas?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgboaeo", "score_hidden": false, "stickied": false, "created": 1492345363.0, "created_utc": 1492316563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_6572sm", "likes": null, "replies": "", "user_reports": [], "id": "dgd10vr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Metatron682", "parent_id": "t3_6572sm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Fleshgait infestation warning", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fleshgait infestation warning&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd10vr", "score_hidden": false, "stickied": false, "created": 1492427612.0, "created_utc": 1492398812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]