[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im writing this as my phone is about to die and my wifi is spotty.  I was headed to work but something happened.  I think I&amp;#39;m stuck in the subway train, I don&amp;#39;t know what will happen but just in case I&amp;#39;m uploading this.  Maybe it will help someone,  or if I make it through today, someone could help me.&lt;/p&gt;\n\n&lt;p&gt;Today started like any other ordinary day before it.  I was headed to work, on autopilot mode,  you know when you just do the same routine without thinking?  Yea that&amp;#39;s how I started my morning, wake up, check phone, shower, get dressed, brush teeth, make coffee, check phone, grab granola bar.  Sling back pack over shoulders, pat pockets, wallet check, keys yes, phone yep. Head out, lock door, walk to subway station looking down at my phone.&lt;/p&gt;\n\n&lt;p&gt;I could pretty much navigate the 5 blocks without so much as glancing up from my phone.  The audible crossing alerts let me know when it was safe to cross.  Yea I should look up just to make sure no one ran a red light, but it would be their fault if they hit me.  I could use a nice settlement payout, heck a few broken bones for a good amount of money didn&amp;#39;t seem so bad. As I looked down at my phone I could see the crowd of legs and feet pass by avoiding me.  A dog came close to sniffing me but was yanked out of my way by its owner.  I barely noticed since I was reading about todays top news stories on FB.  More war stuff in the Middle East, political stuff, what? another celebrity died? What a shame, they&amp;#39;ve been dropping like flys it seems.&lt;/p&gt;\n\n&lt;p&gt;Coming to the station I walked down the flight of stairs, through the turnstiles and continuing on to the platform I always took to take me to work.  Checking the time on my phone showed I was 5 minutes early so I leaned against a pillar while browsing a popular forum app.  I saw the same stuff I read about earlier, along with other entertaining threads.  Cute dog pic, gruesome animal vs animal kill, DIY project that I could do but never will, memes, &amp;quot;ooh thats neat.&amp;quot; I thought as a thread caught my eye.  Scrolling through comments I chuckled to myself, these dad jokes always get me.&lt;/p&gt;\n\n&lt;p&gt;The train pulls up and I walk with the other people to board it, still glued to my phone.  I find a seat that isn&amp;#39;t next to other people, I like space if it&amp;#39;s available. I&amp;#39;d rather not feel embarrassed by someone seeing what I look at on my phone.  With the lurch of the train we are off, headed to the next destination. I noticed I need to connect to the trains wifi and do so to continue my browsing.  &amp;quot;10% battery?&amp;quot;  &amp;quot;But I know I charged it last night, oh well I have a charger at work I can use.&amp;quot;  &amp;quot;10% should be plenty if I don&amp;#39;t look at videos.&amp;quot; I told myself.\nI glance around me for the first time and see about a dozen people sitting evenly spread out in my car. Must be alot of call-ins today since its usually a bit more crowded.&lt;/p&gt;\n\n&lt;p&gt;I bring my eyes back to the warm comforting glow of my phone&amp;#39;s screen.  I check to see if any of my comments were voted up.  For some reason I always hope to see alot of points even though they are useless.  I&amp;#39;m interupted by a flicker of the lights in the room which made me instinctively look up.  &amp;quot;That&amp;#39;s odd it looked like a few less people were seated in the subway car.&amp;quot;  I made a mental note of 9 people just to assure myself I wasn&amp;#39;t seeing things.  &amp;quot;Strange&amp;quot; I thought to myself and went back to being glued to my phone.  Glancing at the time showed barely any time had passed since departure,  &amp;quot;I must be bored if time is dragging already&amp;quot; I pondered. I pulled up FB briefly before went back to the forum app.  I busied myself searching for more entertaining content.  &amp;quot;The things people ask lol&amp;quot; I thought as I scrolled down the list of popular threads.  The cabin lights flicked off and after a seemingly 5 second delay turned back on.  &amp;quot;Wtf&amp;quot; I grumbled internally, shit now the wifi went out.  &lt;/p&gt;\n\n&lt;p&gt;I looked up as if to see the source of the issue but only saw people sitting looking down at their own phones.  &amp;quot;6-7..8...8 people, didn&amp;#39;t I count 9 before?&amp;quot; I mused.  &amp;quot;Maybe they went to another car&amp;quot; I told myself before returning my gaze to the phones screen.  I reconnected to the wifi and not even 5 minutes later the brownout happened again. Again looking up from my phone, I counted the passengers.  &amp;quot;4 people?&amp;quot; &amp;quot;Maybe they went to another car because they got tired of the shitty wifi and lighting issues.&amp;quot;  I guessed.  &amp;quot;Watevs&amp;quot;, I couldn&amp;#39;t be bothered to find another seat in another train car.  My stop should be coming up shortly anyways.&lt;/p&gt;\n\n&lt;p&gt;By the fourth time the lights and wifi went out, I was getting pretty annoyed.   &amp;quot;This is ridiculous.  I pay good money to  use the subway everyday.  Although this is better than being beat and dragged off a plane&amp;quot; I think as I shrug my shoulders.  This time when I looked up though, I didn&amp;#39;t see anyone.  &amp;quot;What the...&amp;quot;  I stood up &amp;quot;oh nevermind there is a bum sleeping down at the end of the car&amp;quot;  I said to myself.  But still, where the heck is everyone going?  I decided to walk to the closest door and check.  The windows were dark and the door wouldn&amp;#39;t budge.  &amp;quot;Hmmf&amp;quot; I exhaled and walked to the other door.  I noticed It also had dark windows as I attempted to open it,  which didn&amp;#39;t budge either.  &amp;quot;What the hell?&amp;quot; I said outloud.  I must have woken the bum because he sat up and mumbled &amp;quot;where else did you think you were&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;Edit: &lt;a href=\"https://www.reddit.com/r/nosleep/comments/65kamh/look_up_from_your_phones_please_part_2/\"&gt;part 2&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Im writing this as my phone is about to die and my wifi is spotty.  I was headed to work but something happened.  I think I'm stuck in the subway train, I don't know what will happen but just in case I'm uploading this.  Maybe it will help someone,  or if I make it through today, someone could help me.\n\nToday started like any other ordinary day before it.  I was headed to work, on autopilot mode,  you know when you just do the same routine without thinking?  Yea that's how I started my morning, wake up, check phone, shower, get dressed, brush teeth, make coffee, check phone, grab granola bar.  Sling back pack over shoulders, pat pockets, wallet check, keys yes, phone yep. Head out, lock door, walk to subway station looking down at my phone.\n\nI could pretty much navigate the 5 blocks without so much as glancing up from my phone.  The audible crossing alerts let me know when it was safe to cross.  Yea I should look up just to make sure no one ran a red light, but it would be their fault if they hit me.  I could use a nice settlement payout, heck a few broken bones for a good amount of money didn't seem so bad. As I looked down at my phone I could see the crowd of legs and feet pass by avoiding me.  A dog came close to sniffing me but was yanked out of my way by its owner.  I barely noticed since I was reading about todays top news stories on FB.  More war stuff in the Middle East, political stuff, what? another celebrity died? What a shame, they've been dropping like flys it seems.\n\nComing to the station I walked down the flight of stairs, through the turnstiles and continuing on to the platform I always took to take me to work.  Checking the time on my phone showed I was 5 minutes early so I leaned against a pillar while browsing a popular forum app.  I saw the same stuff I read about earlier, along with other entertaining threads.  Cute dog pic, gruesome animal vs animal kill, DIY project that I could do but never will, memes, \"ooh thats neat.\" I thought as a thread caught my eye.  Scrolling through comments I chuckled to myself, these dad jokes always get me.\n\nThe train pulls up and I walk with the other people to board it, still glued to my phone.  I find a seat that isn't next to other people, I like space if it's available. I'd rather not feel embarrassed by someone seeing what I look at on my phone.  With the lurch of the train we are off, headed to the next destination. I noticed I need to connect to the trains wifi and do so to continue my browsing.  \"10% battery?\"  \"But I know I charged it last night, oh well I have a charger at work I can use.\"  \"10% should be plenty if I don't look at videos.\" I told myself.\nI glance around me for the first time and see about a dozen people sitting evenly spread out in my car. Must be alot of call-ins today since its usually a bit more crowded.\n\nI bring my eyes back to the warm comforting glow of my phone's screen.  I check to see if any of my comments were voted up.  For some reason I always hope to see alot of points even though they are useless.  I'm interupted by a flicker of the lights in the room which made me instinctively look up.  \"That's odd it looked like a few less people were seated in the subway car.\"  I made a mental note of 9 people just to assure myself I wasn't seeing things.  \"Strange\" I thought to myself and went back to being glued to my phone.  Glancing at the time showed barely any time had passed since departure,  \"I must be bored if time is dragging already\" I pondered. I pulled up FB briefly before went back to the forum app.  I busied myself searching for more entertaining content.  \"The things people ask lol\" I thought as I scrolled down the list of popular threads.  The cabin lights flicked off and after a seemingly 5 second delay turned back on.  \"Wtf\" I grumbled internally, shit now the wifi went out.  \n\nI looked up as if to see the source of the issue but only saw people sitting looking down at their own phones.  \"6-7..8...8 people, didn't I count 9 before?\" I mused.  \"Maybe they went to another car\" I told myself before returning my gaze to the phones screen.  I reconnected to the wifi and not even 5 minutes later the brownout happened again. Again looking up from my phone, I counted the passengers.  \"4 people?\" \"Maybe they went to another car because they got tired of the shitty wifi and lighting issues.\"  I guessed.  \"Watevs\", I couldn't be bothered to find another seat in another train car.  My stop should be coming up shortly anyways.\n\nBy the fourth time the lights and wifi went out, I was getting pretty annoyed.   \"This is ridiculous.  I pay good money to  use the subway everyday.  Although this is better than being beat and dragged off a plane\" I think as I shrug my shoulders.  This time when I looked up though, I didn't see anyone.  \"What the...\"  I stood up \"oh nevermind there is a bum sleeping down at the end of the car\"  I said to myself.  But still, where the heck is everyone going?  I decided to walk to the closest door and check.  The windows were dark and the door wouldn't budge.  \"Hmmf\" I exhaled and walked to the other door.  I noticed It also had dark windows as I attempted to open it,  which didn't budge either.  \"What the hell?\" I said outloud.  I must have woken the bum because he sat up and mumbled \"where else did you think you were\"  \n\nEdit: [part 2](https://www.reddit.com/r/nosleep/comments/65kamh/look_up_from_your_phones_please_part_2/)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "658qy9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 292, "report_reasons": null, "author": "Ellensium", "saved": false, "mod_reports": [], "name": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492277702.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/658qy9/look_up_from_your_phone_please/", "num_reports": null, "locked": false, "stickied": false, "created": 1492150928.0, "url": "https://www.reddit.com/r/nosleep/comments/658qy9/look_up_from_your_phone_please/", "author_flair_text": null, "quarantine": false, "title": "Look up from your phone, please.", "created_utc": 1492122128.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 292}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg8erxw", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "PureFlames", "parent_id": "t1_dg8drlc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Im assuming the joke is he is in hell since he said what the hell and the guy said where else did you think u were", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im assuming the joke is he is in hell since he said what the hell and the guy said where else did you think u were&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8erxw", "score_hidden": false, "stickied": false, "created": 1492154861.0, "created_utc": 1492126061.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg9lmpb", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "SmokingSamoria", "parent_id": "t1_dg8drlc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "He probably got hit by oncoming traffic because he didn't look up from his phone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He probably got hit by oncoming traffic because he didn&amp;#39;t look up from his phone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9lmpb", "score_hidden": false, "stickied": false, "created": 1492226124.0, "created_utc": 1492197324.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg8evsq", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "MJGOO", "parent_id": "t1_dg8drlc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "what the... HELL", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what the... HELL&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8evsq", "score_hidden": false, "stickied": false, "created": 1492155005.0, "created_utc": 1492126205.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8drlc", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "toejamalam", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Umm.. where are you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Umm.. where are you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8drlc", "score_hidden": false, "stickied": false, "created": 1492153507.0, "created_utc": 1492124707.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg8jx2o", "gilded": 0, "archived": false, "score": 51, "report_reasons": null, "author": "Calofisteri", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "&gt; \"This is ridiculous. I pay good money to use the subway everyday. Although this is better than **being beat and dragged off a plane.**\"\n\nAnd this is why you also ended up there. Besides being glued to a silly device.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;This is ridiculous. I pay good money to use the subway everyday. Although this is better than &lt;strong&gt;being beat and dragged off a plane.&lt;/strong&gt;&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And this is why you also ended up there. Besides being glued to a silly device.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8jx2o", "score_hidden": false, "stickied": false, "created": 1492161881.0, "created_utc": 1492133081.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 51}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg8x867", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "UnicornsExist7", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Very good read. This can be interpreted in many different ways. I hope to hear more ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good read. This can be interpreted in many different ways. I hope to hear more &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8x867", "score_hidden": false, "stickied": false, "created": 1492186637.0, "created_utc": 1492157837.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg9jkc1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jintess", "parent_id": "t1_dg8pkyc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Have an upvote Wormwood ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have an upvote Wormwood ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9jkc1", "score_hidden": false, "stickied": false, "created": 1492223638.0, "created_utc": 1492194838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pkyc", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "canniboob", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Reminiscent of a modern day Screwtape Letters. This is brilliant. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reminiscent of a modern day Screwtape Letters. This is brilliant. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8pkyc", "score_hidden": false, "stickied": false, "created": 1492170100.0, "created_utc": 1492141300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg90ok2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Hellaintsobad", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Describes my phone use perfectly. I enjoyed this. I will try to look up today, thanks for the warning. \nHope you're okay. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Describes my phone use perfectly. I enjoyed this. I will try to look up today, thanks for the warning. \nHope you&amp;#39;re okay. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg90ok2", "score_hidden": false, "stickied": false, "created": 1492197606.0, "created_utc": 1492168806.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg9xccw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Brewsterion", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Your phone's cursed. Portable portal. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your phone&amp;#39;s cursed. Portable portal. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9xccw", "score_hidden": false, "stickied": false, "created": 1492240930.0, "created_utc": 1492212130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg8ruxs", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Mmhmmyeahright", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm looking forward to the next installment. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m looking forward to the next installment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8ruxs", "score_hidden": false, "stickied": false, "created": 1492173899.0, "created_utc": 1492145099.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_658qy9", "likes": null, "replies": "", "user_reports": [], "id": "dg9rg2j", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "criley22188", "parent_id": "t3_658qy9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I really enjoyed the story!...until the end. Why end on a bad joke? You could have taken this so far!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really enjoyed the story!...until the end. Why end on a bad joke? You could have taken this so far!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9rg2j", "score_hidden": false, "stickied": false, "created": 1492233174.0, "created_utc": 1492204374.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]