[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever owned a clawfoot tub? I did, growing up. It was in the master bath, next to my parents&amp;#39; room. I bathed in it as a kid, before I switched primarily to showering. It was black lacquer on the outside and white porcelain on the inside. The feet themselves were like a bird&amp;#39;s, scaled and wrinkled, clutching a golden orb that rested on the hardwood floor. There was a good couple inches of space underneath, and as our house broke down over the years, I stopped using the tub for fear that it would fall through the floor when I climbed in.&lt;/p&gt;\n\n&lt;p&gt;Years later, my parents sold my childhood home but passed on the tub to me because it was an antique and, frankly, they didn&amp;#39;t feel like lugging it to their new place. I gladly accepted it because I had a fondness for it even though I hadn&amp;#39;t used it in years. The damn thing was so heavy I needed to recruit three friends to help me carry it into my house. We put it in the master bathroom, just like before, so maybe I could start using it again.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t use the tub for a couple of months because I was working and only taking showers before I headed out to the office. But one week, I had Saturday off, so on Friday night, I decided to get in a nice bubble bath.&lt;/p&gt;\n\n&lt;p&gt;I plugged the drain with the rubber cork and twisted the &amp;quot;hot&amp;quot; handle on. I left the water running for a couple of minutes while I grabbed some clothes, a towel, and some lavender-scented bubble soap. I tested the temperature and found it a little cool, so I turned the handle a bit more and sat on the edge of the tub, humming a little tune to myself.&lt;/p&gt;\n\n&lt;p&gt;As the basin started to fill, the room got stuffier and hotter. It was almost turning into a sauna and I thought maybe I should turn on the bathroom fan before the mirror started fogging up. I got up and flipped the switch before turning around and putting my hand in what turned out to be scalding-hot bath water. I shrieked and pulled my arm back to inspect my already reddening skin. My fingers twitched in pain and it felt like all the nerves from my wrist down had been fried. I quickly shut the water off with my good hand and pulled the chain attached to the rubber cork. As the water emptied, I saw steam rise from the metal drain cover.&lt;/p&gt;\n\n&lt;p&gt;I called a plumber the next day to come inspect the water heater and the taps in the bathtub, but he didn&amp;#39;t find anything wrong with them. He left me with his card and more than a little confusion. A few weeks went by before I found myself with another day off and another opportunity for a bath. This time, I left the drain open and ran the tap for ten minutes (my mom would&amp;#39;ve had my head if she&amp;#39;d known I was wasting water). To be safe, I&amp;#39;d found an old thermometer in a box in my garage that I placed under the running water. 70 degrees, 80, 90... about 100 degrees. I swiped a finger under the faucet and found that the temperature was perfect, so I plugged the drain and let the tub slowly fill up. I wasn&amp;#39;t sure if it was safe, but I desperately needed some relaxing alone time after this hellish project I&amp;#39;d been working on, so I was willing to take my chances.&lt;/p&gt;\n\n&lt;p&gt;When the tub was filled up to a few inches from the top, I shut off the faucet and gently placed my finger in the water as a final precaution. It seemed all right, so I swung my leg over the side and eased my body in. It was amazing. I&amp;#39;d brought a book with me, but the heat seeping into my aching joints soothed me so much that I found myself drifting off.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when I felt the &lt;em&gt;thump&lt;/em&gt;. My eyes shot open and I looked around. &lt;em&gt;What was that? Are the pipes acting up again? As long as I leave the water off, I should be fine.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Then another &lt;em&gt;thump&lt;/em&gt;. And another. The tub shook with each one. It felt like someone banging on the pipes underneath me. With each bang, I could feel the shaking move up the pipe, closer to me. My thoughts immediately jumped to some animal, maybe a rat, stuck in the lines and scrabbling to climb up the smooth metal surface. I wasn&amp;#39;t keen on having vermin in my bath with me, but I knew the drain was plugged and felt like I could worry about it when I decided to get out.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, that didn&amp;#39;t make me feel any less disturbed when I felt something else, something less like thumping and more like... humming. Not ordinary humming, like a generator, where it&amp;#39;s constant and stable. This was more like a song.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;mmmmMMMMMMmmMMMmm.&lt;/em&gt;\n&lt;em&gt;mmMMMMmmmmmMMmmm.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The eerie humming continued for a few more bars before stopping abruptly. I realized I&amp;#39;d been holding my breath for almost thirty seconds and my knuckles had turned white from gripping the edges of the tub so tightly. My knees were locked and my feet were planted firmly on the opposite end of the basin, pushing me as far as they could from the now-silent drain.&lt;/p&gt;\n\n&lt;p&gt;I exhaled and relaxed my legs, pulling them up to my chest and resting my chin on my knees. I chalked it up to my imagination playing tricks on me. The banging could&amp;#39;ve been anything and I had just &lt;em&gt;thought&lt;/em&gt; that the humming had been some kind of song. More than likely there was just someone working on the pipes somewhere and the thumping and rattling had traveled all the way over here. All the way from somewhere...&lt;/p&gt;\n\n&lt;p&gt;A bubble escaped from the drain. It was tiny, almost imperceptible. Then a bigger one, and a bigger one. With a &lt;em&gt;pop&lt;/em&gt;, the cork unsealed, but the water didn&amp;#39;t drain. Startled and afraid that whatever was in the pipes was bigger than I thought, I hopped out of the tub and wrapped a towel around my body.&lt;/p&gt;\n\n&lt;p&gt;Now that I was more or less safe, I decided to take a peek down the drain so that when I called up the plumber, I could tell him what was up and maybe he could snake the drain or flush it out or something. I could only see into the drain from a very specific position, so I put my hands on the edge of the tub and leaned over until my face was right above it. It was dark, except for an oval of light. I moved closer, trying to figure out what the light was. Then it blinked.&lt;/p&gt;\n\n&lt;p&gt;I instantly stood and fell back against the wall behind me, scrabbling with my hand for the doorknob. Not taking my eyes off the basin of the tub, I could still see the drain as a scaled, gnarled claw rose from the pipe. I ran.&lt;/p&gt;\n\n&lt;p&gt;I had a plumber rip up all the pipes in my house and place new ones. When he moved the clawfoot tub, he saw something that made me ultimately get rid of it: there was never a pipe connected to the drain. Underneath it was nothing but the blackness that rested in that couple inches of space between the tub and the floor.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Have you ever owned a clawfoot tub? I did, growing up. It was in the master bath, next to my parents' room. I bathed in it as a kid, before I switched primarily to showering. It was black lacquer on the outside and white porcelain on the inside. The feet themselves were like a bird's, scaled and wrinkled, clutching a golden orb that rested on the hardwood floor. There was a good couple inches of space underneath, and as our house broke down over the years, I stopped using the tub for fear that it would fall through the floor when I climbed in.\n\nYears later, my parents sold my childhood home but passed on the tub to me because it was an antique and, frankly, they didn't feel like lugging it to their new place. I gladly accepted it because I had a fondness for it even though I hadn't used it in years. The damn thing was so heavy I needed to recruit three friends to help me carry it into my house. We put it in the master bathroom, just like before, so maybe I could start using it again.\n\nI didn't use the tub for a couple of months because I was working and only taking showers before I headed out to the office. But one week, I had Saturday off, so on Friday night, I decided to get in a nice bubble bath.\n\nI plugged the drain with the rubber cork and twisted the \"hot\" handle on. I left the water running for a couple of minutes while I grabbed some clothes, a towel, and some lavender-scented bubble soap. I tested the temperature and found it a little cool, so I turned the handle a bit more and sat on the edge of the tub, humming a little tune to myself.\n\nAs the basin started to fill, the room got stuffier and hotter. It was almost turning into a sauna and I thought maybe I should turn on the bathroom fan before the mirror started fogging up. I got up and flipped the switch before turning around and putting my hand in what turned out to be scalding-hot bath water. I shrieked and pulled my arm back to inspect my already reddening skin. My fingers twitched in pain and it felt like all the nerves from my wrist down had been fried. I quickly shut the water off with my good hand and pulled the chain attached to the rubber cork. As the water emptied, I saw steam rise from the metal drain cover.\n\nI called a plumber the next day to come inspect the water heater and the taps in the bathtub, but he didn't find anything wrong with them. He left me with his card and more than a little confusion. A few weeks went by before I found myself with another day off and another opportunity for a bath. This time, I left the drain open and ran the tap for ten minutes (my mom would've had my head if she'd known I was wasting water). To be safe, I'd found an old thermometer in a box in my garage that I placed under the running water. 70 degrees, 80, 90... about 100 degrees. I swiped a finger under the faucet and found that the temperature was perfect, so I plugged the drain and let the tub slowly fill up. I wasn't sure if it was safe, but I desperately needed some relaxing alone time after this hellish project I'd been working on, so I was willing to take my chances.\n\nWhen the tub was filled up to a few inches from the top, I shut off the faucet and gently placed my finger in the water as a final precaution. It seemed all right, so I swung my leg over the side and eased my body in. It was amazing. I'd brought a book with me, but the heat seeping into my aching joints soothed me so much that I found myself drifting off.\n\nThat's when I felt the *thump*. My eyes shot open and I looked around. *What was that? Are the pipes acting up again? As long as I leave the water off, I should be fine.*\n\nThen another *thump*. And another. The tub shook with each one. It felt like someone banging on the pipes underneath me. With each bang, I could feel the shaking move up the pipe, closer to me. My thoughts immediately jumped to some animal, maybe a rat, stuck in the lines and scrabbling to climb up the smooth metal surface. I wasn't keen on having vermin in my bath with me, but I knew the drain was plugged and felt like I could worry about it when I decided to get out.\n\nUnfortunately, that didn't make me feel any less disturbed when I felt something else, something less like thumping and more like... humming. Not ordinary humming, like a generator, where it's constant and stable. This was more like a song.\n\n*mmmmMMMMMMmmMMMmm.*\n*mmMMMMmmmmmMMmmm.*\n\nThe eerie humming continued for a few more bars before stopping abruptly. I realized I'd been holding my breath for almost thirty seconds and my knuckles had turned white from gripping the edges of the tub so tightly. My knees were locked and my feet were planted firmly on the opposite end of the basin, pushing me as far as they could from the now-silent drain.\n\nI exhaled and relaxed my legs, pulling them up to my chest and resting my chin on my knees. I chalked it up to my imagination playing tricks on me. The banging could've been anything and I had just *thought* that the humming had been some kind of song. More than likely there was just someone working on the pipes somewhere and the thumping and rattling had traveled all the way over here. All the way from somewhere...\n\nA bubble escaped from the drain. It was tiny, almost imperceptible. Then a bigger one, and a bigger one. With a *pop*, the cork unsealed, but the water didn't drain. Startled and afraid that whatever was in the pipes was bigger than I thought, I hopped out of the tub and wrapped a towel around my body.\n\nNow that I was more or less safe, I decided to take a peek down the drain so that when I called up the plumber, I could tell him what was up and maybe he could snake the drain or flush it out or something. I could only see into the drain from a very specific position, so I put my hands on the edge of the tub and leaned over until my face was right above it. It was dark, except for an oval of light. I moved closer, trying to figure out what the light was. Then it blinked.\n\nI instantly stood and fell back against the wall behind me, scrabbling with my hand for the doorknob. Not taking my eyes off the basin of the tub, I could still see the drain as a scaled, gnarled claw rose from the pipe. I ran.\n\nI had a plumber rip up all the pipes in my house and place new ones. When he moved the clawfoot tub, he saw something that made me ultimately get rid of it: there was never a pipe connected to the drain. Underneath it was nothing but the blackness that rested in that couple inches of space between the tub and the floor.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65algq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 115, "report_reasons": null, "author": "it_saw_me", "saved": false, "mod_reports": [], "name": "t3_65algq", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492153055.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65algq/clawfeet/", "num_reports": null, "locked": false, "stickied": false, "created": 1492173561.0, "url": "https://www.reddit.com/r/nosleep/comments/65algq/clawfeet/", "author_flair_text": null, "quarantine": false, "title": "Clawfeet", "created_utc": 1492144761.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 115}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": "", "user_reports": [], "id": "dg8w6fr", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "made-of-bees", "parent_id": "t3_65algq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh god oh dear god no nope never getting in the bath again I already have several bath-related phobias that's it I'm done nope nope nope", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh god oh dear god no nope never getting in the bath again I already have several bath-related phobias that&amp;#39;s it I&amp;#39;m done nope nope nope&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8w6fr", "score_hidden": false, "stickied": false, "created": 1492183551.0, "created_utc": 1492154751.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": "", "user_reports": [], "id": "dg9lhza", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mockeryofreason", "parent_id": "t1_dg8zvqu", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I can definitely back this up about moving and all that. My sister bought a very old house from an old guy; he decided he liked her and she and her husband were the only ones he'd sell it to. Well, she gave us a lamp, mom kept it in the back room because she reads at night.\n\nOne night it turned on while my parents were trying to sleep. Dad turns the switch to turn it off, all it does is flickers. They have to *unplug it* to turn it off. They ask my brother, an electrician, to work on it. He does, says he found a short, gave it back to us. It does the same exact thing as before. They call my sister the next day informing her the man, who died not long after she bought the house, didn't like his lamp being away from it's home. She took it back and has *never* experienced an issue with it.\n\nGhosts ( and other weird af entities ), man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can definitely back this up about moving and all that. My sister bought a very old house from an old guy; he decided he liked her and she and her husband were the only ones he&amp;#39;d sell it to. Well, she gave us a lamp, mom kept it in the back room because she reads at night.&lt;/p&gt;\n\n&lt;p&gt;One night it turned on while my parents were trying to sleep. Dad turns the switch to turn it off, all it does is flickers. They have to &lt;em&gt;unplug it&lt;/em&gt; to turn it off. They ask my brother, an electrician, to work on it. He does, says he found a short, gave it back to us. It does the same exact thing as before. They call my sister the next day informing her the man, who died not long after she bought the house, didn&amp;#39;t like his lamp being away from it&amp;#39;s home. She took it back and has &lt;em&gt;never&lt;/em&gt; experienced an issue with it.&lt;/p&gt;\n\n&lt;p&gt;Ghosts ( and other weird af entities ), man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9lhza", "score_hidden": false, "stickied": false, "created": 1492225966.0, "created_utc": 1492197166.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zvqu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "it_saw_me", "parent_id": "t1_dg8zaws", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Thanks. It's been a while now and I haven't run into any further issues. The tub came with the house when my parents bought it years ago, so I think you might be right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. It&amp;#39;s been a while now and I haven&amp;#39;t run into any further issues. The tub came with the house when my parents bought it years ago, so I think you might be right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8zvqu", "score_hidden": false, "stickied": false, "created": 1492195265.0, "created_utc": 1492166465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": "", "user_reports": [], "id": "dgbhraj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jaygreenbean", "parent_id": "t1_dgbhntb", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Awesome :o", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome :o&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbhraj", "score_hidden": false, "stickied": false, "created": 1492335410.0, "created_utc": 1492306610.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbhntb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t1_dgazcsp", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Toilet Hanako: a benign spirit kids dare each other to summon. Alaname: meaning \"filth licker\" thrives in dirty bathrooms. Noppera-Bo: scares people in bathrooms. Aka-Manto: meaning \"red cap\" a disembodied voice who asks those on the toilet if they want a red cape. If the person answers yes then the person has their skin ripped off their back. Also-Kami-Apo-Kami: meaning \"red paper blue paper\" offers his victims a choice between the two colors of paper. Neither have good outcomes. Reiko Kashima: a female leg less entity haunting bathrooms who issues her victims a series of questions. A wrong answer will result in the victim having their legs twisted off. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Toilet Hanako: a benign spirit kids dare each other to summon. Alaname: meaning &amp;quot;filth licker&amp;quot; thrives in dirty bathrooms. Noppera-Bo: scares people in bathrooms. Aka-Manto: meaning &amp;quot;red cap&amp;quot; a disembodied voice who asks those on the toilet if they want a red cape. If the person answers yes then the person has their skin ripped off their back. Also-Kami-Apo-Kami: meaning &amp;quot;red paper blue paper&amp;quot; offers his victims a choice between the two colors of paper. Neither have good outcomes. Reiko Kashima: a female leg less entity haunting bathrooms who issues her victims a series of questions. A wrong answer will result in the victim having their legs twisted off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbhntb", "score_hidden": false, "stickied": false, "created": 1492335274.0, "created_utc": 1492306474.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazcsp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jaygreenbean", "parent_id": "t1_dg8zaws", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Care to tell me about some of these asian entities? :3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Care to tell me about some of these asian entities? :3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgazcsp", "score_hidden": false, "stickied": false, "created": 1492309706.0, "created_utc": 1492280906.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zaws", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65algq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It sounds like the tub may have been inhabited by an entity that slumbered through your childhood at your parent's house but was perhaps awoken by the move to your place. Spirits can get rather cantankerous during renovations or moving. After removing it and replacing all your piping your problems should probably be resolved though. I have to say though that Asian belief systems have an entire pantheon of spirits who haunt bathrooms while Westerners really don't. My thoughts have always been that the same entities who haunt Asians in the bathroom haunt Westerners as well but for whatever reason Westerners refuse to classify them. Perhaps we Westerners feel whatever phantom who jumps out of the toilet at us violates too much of our modesty to justify a name. Good luck.", "edited": 1492183246.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like the tub may have been inhabited by an entity that slumbered through your childhood at your parent&amp;#39;s house but was perhaps awoken by the move to your place. Spirits can get rather cantankerous during renovations or moving. After removing it and replacing all your piping your problems should probably be resolved though. I have to say though that Asian belief systems have an entire pantheon of spirits who haunt bathrooms while Westerners really don&amp;#39;t. My thoughts have always been that the same entities who haunt Asians in the bathroom haunt Westerners as well but for whatever reason Westerners refuse to classify them. Perhaps we Westerners feel whatever phantom who jumps out of the toilet at us violates too much of our modesty to justify a name. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8zaws", "score_hidden": false, "stickied": false, "created": 1492193425.0, "created_utc": 1492164625.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65algq", "likes": null, "replies": "", "user_reports": [], "id": "dg8t9rw", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "limalovegood", "parent_id": "t3_65algq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "As if I didn't already feel vulnerable enough while bathing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As if I didn&amp;#39;t already feel vulnerable enough while bathing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8t9rw", "score_hidden": false, "stickied": false, "created": 1492176613.0, "created_utc": 1492147813.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}]