[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64omjt/i_found_an_old_vhs_tape_in_my_grandfathers/\"&gt;Part 1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64w16p/i_found_an_old_vhs_tape_in_my_grandfathers/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/653e5k/i_found_an_old_vhs_tape_in_my_grandfathers/\"&gt;Part 3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It took less than a second for the salty water to seep through my bandages and find it&amp;#39;s way into my freshly wounded wrist. I can safely say it was the worst pain I&amp;#39;ve ever experienced. I was thankful for the swim team my mother forced me to join in sixth grade. It taught me how to keep my head above the water even in the worst circumstances. Swimming with one hand was harder than you&amp;#39;d think, but I was so desperate to get away from Oliver that I must&amp;#39;ve swam faster than Michael Phelps at the Olympics. Since I couldn&amp;#39;t see a thing in the darkness, I had to rely on my hearing. A splash sounded from behind me. Oliver was after me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re grandfather can&amp;#39;t save you now.&amp;quot; He said, effortlessly moving closer and closer towards me. &amp;quot;You were supposed to be burned on a stake, but considering the circumstances, I&amp;#39;m sure the flame won&amp;#39;t mind if you drown instead.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I used every ounce of my energy to keep moving, but it was no use. I felt a pair of hands tighten around my neck. Oliver shoved me against an empty wooden dock. &amp;quot;Adios.&amp;quot; Oliver cackled, shoving me beneath the inky black waves. &lt;/p&gt;\n\n&lt;p&gt;My body went into full panic mode. My heart felt like it was about to explode as I tugged at his arms. He was solid as a rock. It was at that moment that I felt something sharp under my foot. It was a sharp piece of wood that must&amp;#39;ve fallen off the dock. I grabbed it beneath my toes and maneuvered it into my hand. Without a moments hesitation, I pushed it deep into Oliver&amp;#39;s abdomen. It&amp;#39;s a good thing I couldn&amp;#39;t see anything or else I may have passed out at the sight of the blood. &lt;/p&gt;\n\n&lt;p&gt;Oliver fell backwards, completely letting go of me. &amp;quot;You little-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I punched him square in the nose and made my getaway. I climbed onto the dock only to find a massive forest in front of me. I turned around; Oliver was making his way onto the dock. I knew I had no choice but to enter the forest. And I thought the &lt;em&gt;water&lt;/em&gt; was dark. I can&amp;#39;t tell you how many times I must&amp;#39;ve fallen trying to get to some sort of civilization. My legs were cut up and it didn&amp;#39;t help that I was wearing a heavy red robe. Then I spotted it: a light in the distance. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please help me!&amp;quot; I cried, falling to the ground. &amp;quot;Call 911.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I was shocked by the sound of a gunshot. A bullet landed in a tree not ten feet away from me. &amp;quot;It&amp;#39;s not midnight yet.&amp;quot; Vida said, the light moving closer towards me. &amp;quot;Who would&amp;#39;ve thought after all these years I&amp;#39;d have the honor of killing you? I guess the flame is finally recognizing my loyalty.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how I did it, but I managed to stand up and sprint away from Vida. She must&amp;#39;ve tried to shoot me at least a dozen times, but by some miracle, all the bullets missed me. When I could no longer see the light, I let myself lean against a tree and breathe. &lt;em&gt;Don&amp;#39;t pass out.&lt;/em&gt; I told myself. *There&amp;#39;s gotta be a house around here somewhere.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I crawled and crawled until I stumbled upon a quaint neighborhood nestled within the trees. I knocked on the first door I could reach. A middle aged man in a white tank top answered. &amp;quot;Call 911.&amp;quot; I whimpered. &amp;quot;Please.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The cops and an ambulance arrived twenty anxiety-inducing minutes later. Before I could explain anything, I was whisked away in an ambulance. I was alive. &amp;quot;There&amp;#39;s a cult.&amp;quot; I said the the paramedic. &amp;quot;They&amp;#39;re trying to kill me as we speak.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re safe now.&amp;quot; She said in a motherly tone. &amp;quot;That I can promise.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I was half expecting her to reveal herself as a Living Flame member, but thankfully that didn&amp;#39;t happen. When I arrived at the hospital, I was taken into emergency surgery to fix my wrist. Apparently whoever sewed it shut had done a terrible job and it needed to be repaired immediately. &lt;/p&gt;\n\n&lt;p&gt;When I woke up, there was a cop who wanted to talk to me. &amp;quot;But I&amp;#39;ll only let him in if you want me to.&amp;quot; The nurse said. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes, please do.&amp;quot; I said, sipping a plastic cup of water. &lt;/p&gt;\n\n&lt;p&gt;A large man sat in the chair across the recovery room and let out a loud sigh. &amp;quot;Do you know how weird it was to get a call in the middle of the night that 28 people in red robes were weeping in a field? Also, one of them was found dead on someone&amp;#39;s dock.&amp;quot; He looked at my wrist, which was still numb. &amp;quot;Are you a part of this cult?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No. Not in a million years.&amp;quot; I said, hoping he sensed my honesty. &amp;quot;You&amp;#39;re not going to believe this, but they were going to sacrifice me their flame god...I&amp;#39;m still not entirely sure what that means so don&amp;#39;t ask.&amp;quot; The cop raised an eyebrow and wrote something down. &amp;quot;Oh, not to mention the fact they cut off my right hand.&amp;quot; It was weird hearing those words leave my mouth. I had lost my right hand. Forever. How was I supposed to deal with that? &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We&amp;#39;ve received reports about red-cloaked people in the past, but many people believed they were an urban legend.&amp;quot; He said solemnly. &amp;quot;People around here get bored and some of them think it&amp;#39;s cute to prank call 911, so we never looked into the possibility of there being an actual cult.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;In your defense, I wouldn&amp;#39;t have believed any of this two days ago.&amp;quot; I said, feeling a wave of drowsiness flood over me. &amp;quot;I&amp;#39;m sorry, but that&amp;#39;s all I can say for now.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay, kid.&amp;quot; The cop replied, standing up. &amp;quot;Get some rest. You need it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;ONE MONTH LATER&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, Peter, it says here that today is your last day of residential rehabilitation.&amp;quot; My counselor said, staring at a clipboard. &amp;quot;Do you feel ready to get back out there?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If I&amp;#39;m being honest, no, not really.&amp;quot; I said, fidgeting with my new prosthetic hand. I didn&amp;#39;t have nearly enough money for a bionic hand, so I had to settle for a silicon one. It looked real, but it sure didn&amp;#39;t feel like it. &amp;quot;But I don&amp;#39;t want to spend anymore time here.&amp;quot; I said, determined. &amp;quot;These people are beginning to drive me crazy.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can assure you they&amp;#39;re only trying to help you.&amp;quot; He replied. &amp;quot;You&amp;#39;ve lost a lot. I&amp;#39;ve been in this line of work for fifty years, and I&amp;#39;ve never seen a case even remotely similar to yours.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So...can you tell me how they&amp;#39;re doing? The members of Living Flame, I mean.&amp;quot; I asked. They had all been placed in a therapy center a few miles away. The people who raised me. Vida. My biological parents. All of them.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Some of them are starting to have doubts, but it&amp;#39;s hard to tell if they&amp;#39;ll ever give up their beliefs entirely.&amp;quot; He answered. &amp;quot;But if they do, I&amp;#39;m sure they&amp;#39;ll be eager to apologize to you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m just glad the media didn&amp;#39;t catch on to all of this.&amp;quot; I said, trying to lighten the mood. &amp;quot;I bet they would&amp;#39;ve made a movie about it and everything.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He smiled warmly and extended a pen and paper towards me. &amp;quot;Well, as soon as you sign this form, you&amp;#39;ll be free to go.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I picked it up and slowly signed my name. Since I was forced to write with my left hand, my penmanship was atrocious. &amp;quot;Thanks for everything.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I went into my room, picked up my few belongings, and made my way down to the front lobby where Harper was waiting for me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello Miss Kowalski.&amp;quot; I said. &amp;quot;Are you ready to go?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;We had talked a lot that month. Since we were both the only known survivors of Living Flame, we had a sort of bond that I can&amp;#39;t explain. Eventually, she offered to let me stay in her spare bedroom until I got a place of my own. She was a bit bossy, but she was also kind. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Now don&amp;#39;t go thinking you can just stay in your room playing games all day.&amp;quot; She said as we boarded a bus. &amp;quot;I know it&amp;#39;s summer vacation, but you still have to work in the diner. Also, you get to be my new chauffeur. Do you know how much money I&amp;#39;ve spent on Uber?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sure, whatever you need.&amp;quot; I said halfheartedly. &lt;/p&gt;\n\n&lt;p&gt;Harper could sense my nervousness. She placed her hand on my shoulder. &amp;quot;Listen Pete, things aren&amp;#39;t ever going to be the same again. That&amp;#39;s just the way it is.&amp;quot; There was pain in her voice. &amp;quot;But there&amp;#39;s still a lot of good out there. My advice? Take things day by day. Don&amp;#39;t stress yourself out too much. Just live your life.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I stared out the window of the bus. I wanted to move on. I wanted to go to college, get married, and start a family. But in that moment, all that seemed so impossible. I knew I would always carry Living Flame and all the damage it had caused like a weight in my heart, but maybe as the years went on, the weight would lessen. Maybe I&amp;#39;d be able to move on. &lt;/p&gt;\n\n&lt;p&gt;I was going to be okay.&lt;/p&gt;\n\n&lt;p&gt;THE END. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Part 1](https://www.reddit.com/r/nosleep/comments/64omjt/i_found_an_old_vhs_tape_in_my_grandfathers/)\n\n[Part 2](https://www.reddit.com/r/nosleep/comments/64w16p/i_found_an_old_vhs_tape_in_my_grandfathers/)\n\n[Part 3](https://www.reddit.com/r/nosleep/comments/653e5k/i_found_an_old_vhs_tape_in_my_grandfathers/)\n\nIt took less than a second for the salty water to seep through my bandages and find it's way into my freshly wounded wrist. I can safely say it was the worst pain I've ever experienced. I was thankful for the swim team my mother forced me to join in sixth grade. It taught me how to keep my head above the water even in the worst circumstances. Swimming with one hand was harder than you'd think, but I was so desperate to get away from Oliver that I must've swam faster than Michael Phelps at the Olympics. Since I couldn't see a thing in the darkness, I had to rely on my hearing. A splash sounded from behind me. Oliver was after me. \n\n\"You're grandfather can't save you now.\" He said, effortlessly moving closer and closer towards me. \"You were supposed to be burned on a stake, but considering the circumstances, I'm sure the flame won't mind if you drown instead.\"\n\nI used every ounce of my energy to keep moving, but it was no use. I felt a pair of hands tighten around my neck. Oliver shoved me against an empty wooden dock. \"Adios.\" Oliver cackled, shoving me beneath the inky black waves. \n\nMy body went into full panic mode. My heart felt like it was about to explode as I tugged at his arms. He was solid as a rock. It was at that moment that I felt something sharp under my foot. It was a sharp piece of wood that must've fallen off the dock. I grabbed it beneath my toes and maneuvered it into my hand. Without a moments hesitation, I pushed it deep into Oliver's abdomen. It's a good thing I couldn't see anything or else I may have passed out at the sight of the blood. \n\nOliver fell backwards, completely letting go of me. \"You little-\"\n\nI punched him square in the nose and made my getaway. I climbed onto the dock only to find a massive forest in front of me. I turned around; Oliver was making his way onto the dock. I knew I had no choice but to enter the forest. And I thought the *water* was dark. I can't tell you how many times I must've fallen trying to get to some sort of civilization. My legs were cut up and it didn't help that I was wearing a heavy red robe. Then I spotted it: a light in the distance. \n\n\"Please help me!\" I cried, falling to the ground. \"Call 911.\"\n\nI was shocked by the sound of a gunshot. A bullet landed in a tree not ten feet away from me. \"It's not midnight yet.\" Vida said, the light moving closer towards me. \"Who would've thought after all these years I'd have the honor of killing you? I guess the flame is finally recognizing my loyalty.\" \n\nI don't know how I did it, but I managed to stand up and sprint away from Vida. She must've tried to shoot me at least a dozen times, but by some miracle, all the bullets missed me. When I could no longer see the light, I let myself lean against a tree and breathe. *Don't pass out.* I told myself. *There's gotta be a house around here somewhere.\"\n\nI crawled and crawled until I stumbled upon a quaint neighborhood nestled within the trees. I knocked on the first door I could reach. A middle aged man in a white tank top answered. \"Call 911.\" I whimpered. \"Please.\"\n\nThe cops and an ambulance arrived twenty anxiety-inducing minutes later. Before I could explain anything, I was whisked away in an ambulance. I was alive. \"There's a cult.\" I said the the paramedic. \"They're trying to kill me as we speak.\"\n\n\"You're safe now.\" She said in a motherly tone. \"That I can promise.\"\n\nI was half expecting her to reveal herself as a Living Flame member, but thankfully that didn't happen. When I arrived at the hospital, I was taken into emergency surgery to fix my wrist. Apparently whoever sewed it shut had done a terrible job and it needed to be repaired immediately. \n\nWhen I woke up, there was a cop who wanted to talk to me. \"But I'll only let him in if you want me to.\" The nurse said. \n\n\"Yes, please do.\" I said, sipping a plastic cup of water. \n\nA large man sat in the chair across the recovery room and let out a loud sigh. \"Do you know how weird it was to get a call in the middle of the night that 28 people in red robes were weeping in a field? Also, one of them was found dead on someone's dock.\" He looked at my wrist, which was still numb. \"Are you a part of this cult?\" \n\n\"No. Not in a million years.\" I said, hoping he sensed my honesty. \"You're not going to believe this, but they were going to sacrifice me their flame god...I'm still not entirely sure what that means so don't ask.\" The cop raised an eyebrow and wrote something down. \"Oh, not to mention the fact they cut off my right hand.\" It was weird hearing those words leave my mouth. I had lost my right hand. Forever. How was I supposed to deal with that? \n\n\"We've received reports about red-cloaked people in the past, but many people believed they were an urban legend.\" He said solemnly. \"People around here get bored and some of them think it's cute to prank call 911, so we never looked into the possibility of there being an actual cult.\"\n\n\"In your defense, I wouldn't have believed any of this two days ago.\" I said, feeling a wave of drowsiness flood over me. \"I'm sorry, but that's all I can say for now.\"\n\n\"Okay, kid.\" The cop replied, standing up. \"Get some rest. You need it.\"\n\nONE MONTH LATER\n\n\"So, Peter, it says here that today is your last day of residential rehabilitation.\" My counselor said, staring at a clipboard. \"Do you feel ready to get back out there?\"\n\n\"If I'm being honest, no, not really.\" I said, fidgeting with my new prosthetic hand. I didn't have nearly enough money for a bionic hand, so I had to settle for a silicon one. It looked real, but it sure didn't feel like it. \"But I don't want to spend anymore time here.\" I said, determined. \"These people are beginning to drive me crazy.\"\n\n\"I can assure you they're only trying to help you.\" He replied. \"You've lost a lot. I've been in this line of work for fifty years, and I've never seen a case even remotely similar to yours.\"\n\n\"So...can you tell me how they're doing? The members of Living Flame, I mean.\" I asked. They had all been placed in a therapy center a few miles away. The people who raised me. Vida. My biological parents. All of them.\n\n\"Some of them are starting to have doubts, but it's hard to tell if they'll ever give up their beliefs entirely.\" He answered. \"But if they do, I'm sure they'll be eager to apologize to you.\"\n\n\"I'm just glad the media didn't catch on to all of this.\" I said, trying to lighten the mood. \"I bet they would've made a movie about it and everything.\"\n\nHe smiled warmly and extended a pen and paper towards me. \"Well, as soon as you sign this form, you'll be free to go.\"\n\nI picked it up and slowly signed my name. Since I was forced to write with my left hand, my penmanship was atrocious. \"Thanks for everything.\" \n\nI went into my room, picked up my few belongings, and made my way down to the front lobby where Harper was waiting for me.\n\n\"Hello Miss Kowalski.\" I said. \"Are you ready to go?\"\n\nWe had talked a lot that month. Since we were both the only known survivors of Living Flame, we had a sort of bond that I can't explain. Eventually, she offered to let me stay in her spare bedroom until I got a place of my own. She was a bit bossy, but she was also kind. \n\n\"Now don't go thinking you can just stay in your room playing games all day.\" She said as we boarded a bus. \"I know it's summer vacation, but you still have to work in the diner. Also, you get to be my new chauffeur. Do you know how much money I've spent on Uber?\"\n\n\"Sure, whatever you need.\" I said halfheartedly. \n\nHarper could sense my nervousness. She placed her hand on my shoulder. \"Listen Pete, things aren't ever going to be the same again. That's just the way it is.\" There was pain in her voice. \"But there's still a lot of good out there. My advice? Take things day by day. Don't stress yourself out too much. Just live your life.\"\n\nI stared out the window of the bus. I wanted to move on. I wanted to go to college, get married, and start a family. But in that moment, all that seemed so impossible. I knew I would always carry Living Flame and all the damage it had caused like a weight in my heart, but maybe as the years went on, the weight would lessen. Maybe I'd be able to move on. \n\nI was going to be okay.\n\nTHE END. \n\n\n\n\n\n\n\n\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "65amvg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 182, "report_reasons": null, "author": "a-graceful-tater-tot", "saved": false, "mod_reports": [], "name": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492153745.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65amvg/i_found_an_old_vhs_tape_in_my_grandfathers/", "num_reports": null, "locked": false, "stickied": false, "created": 1492174115.0, "url": "https://www.reddit.com/r/nosleep/comments/65amvg/i_found_an_old_vhs_tape_in_my_grandfathers/", "author_flair_text": null, "quarantine": false, "title": "I Found an Old VHS Tape in My Grandfather's Basement [Part 4]", "created_utc": 1492145315.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 182}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg8s1pb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65amvg%2Fi_found_an_old_vhs_tape_in_my_grandfathers%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;subject=Reminder&amp;to=RemindMeBot) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65amvg%2Fi_found_an_old_vhs_tape_in_my_grandfathers%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;subject=Reminder&amp;amp;to=RemindMeBot\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8s1pb", "score_hidden": true, "stickied": true, "created": 1492174244.0, "created_utc": 1492145444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg8z8wm", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Feebslulunbanjo", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "A happy ending on a Nosleep story?  Not often does this happen, but I'm glad it did for you, OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A happy ending on a Nosleep story?  Not often does this happen, but I&amp;#39;m glad it did for you, OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8z8wm", "score_hidden": false, "stickied": false, "created": 1492193243.0, "created_utc": 1492164443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg8t7kf", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "woahitzcoal7", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "what the hell!!! im sorry but there NEEDS to be more!! This was just too good. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what the hell!!! im sorry but there NEEDS to be more!! This was just too good. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8t7kf", "score_hidden": false, "stickied": false, "created": 1492176495.0, "created_utc": 1492147695.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg9ekkm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "creepypgirl79", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "totally just binge read this whole story...and omfg...thank Goodness you made it out alive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;totally just binge read this whole story...and omfg...thank Goodness you made it out alive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9ekkm", "score_hidden": false, "stickied": false, "created": 1492217810.0, "created_utc": 1492189010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg8zbxd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Callilunasa", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Thank goodness you're safe now! I'm very glad Oliver died and I hope your family can have their brainwashing undone. Great story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank goodness you&amp;#39;re safe now! I&amp;#39;m very glad Oliver died and I hope your family can have their brainwashing undone. Great story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8zbxd", "score_hidden": false, "stickied": false, "created": 1492193520.0, "created_utc": 1492164720.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg96qjx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RCONSPIRACYISCORRUPT", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I need a smoke now.  Got a light? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I need a smoke now.  Got a light? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg96qjx", "score_hidden": false, "stickied": false, "created": 1492208550.0, "created_utc": 1492179750.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg93gzi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Gorey58", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Great story, thanks for sharing. All the best of luck to you and ?maybe your family. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story, thanks for sharing. All the best of luck to you and ?maybe your family. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg93gzi", "score_hidden": false, "stickied": false, "created": 1492203623.0, "created_utc": 1492174823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg8t552", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "marcdavis87", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Awesome! Such a great story!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome! Such a great story!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8t552", "score_hidden": false, "stickied": false, "created": 1492176360.0, "created_utc": 1492147560.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg97wgq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Gabiamir42", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This is beautifully written we want MORE from you!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is beautifully written we want MORE from you!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg97wgq", "score_hidden": false, "stickied": false, "created": 1492210072.0, "created_utc": 1492181272.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65amvg", "likes": null, "replies": "", "user_reports": [], "id": "dg9o3i5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Sigma1-", "parent_id": "t3_65amvg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm just glad you got this all sorted out before I head to OC in a few weeks.\n\nIn all seriousness though, a good read. Keep writing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just glad you got this all sorted out before I head to OC in a few weeks.&lt;/p&gt;\n\n&lt;p&gt;In all seriousness though, a good read. Keep writing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9o3i5", "score_hidden": false, "stickied": false, "created": 1492229091.0, "created_utc": 1492200291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]