[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64ahar/the_white_room/\"&gt;Part 1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64jsub/the_white_room_part_2/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/64sx6f/the_white_room_part_3/\"&gt;Part 3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/652ofo/the_white_room_part_4/\"&gt;Part 4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I am sure some of you are confused, or maybe even frustrated with how things have progressed in the story. Imagine being in it, and having to grow up again. Albeit without the memories of my first life. I thought at one point that life was strange. I was surprised that Death was even stranger. &lt;/p&gt;\n\n&lt;p&gt;For the sake of time, I am going to skip forward to my next death. Just know that I lived a simple, ordinary life up until the age of fourteen. My parents loved me, I still held no memories of my former life, and Death had not pulled any strings that I was aware of. A simple, boring life in the outskirts of Seattle. It was nice, until a fatal ride home from school.  &lt;/p&gt;\n\n&lt;p&gt;I am going to start this with a small note. Parents, pay attention to your kids. If they are being bullied at school, you would be surprised what they are capable of. More often than not, there is only one way to handle a bully. Taking them out of the equation, or taking yourself out of the equation. That&amp;#39;s the logic of a child, anyway. Neither choice is rational. But that is what bullying makes you. Irrational. And I was unfortunate enough to be caught in the middle of it. &lt;/p&gt;\n\n&lt;p&gt;Michael was an average boy in my eyes. A bit shorter than the rest of the class, but still, average. But for some reason our school bully, Will, picked on him relentlessly. Making fun of his height, freckles, glasses, unkempt hair, tormenting him about his father who had just passed away, honestly anything that would get a rise out of Michael. Michael always dropped his head, and tried to ignore it. Until the last day of school. &lt;/p&gt;\n\n&lt;p&gt;We were on the bus, on our way to our drop off. We had assigned seats, like some busses do, and Michael and I were assigned next to each other. Will was about four rows behind us. &lt;/p&gt;\n\n&lt;p&gt;About ten minutes from our drop off, Michael asks me to get up. &lt;/p&gt;\n\n&lt;p&gt;“Why? We&amp;#39;re almost there.” I said. &lt;/p&gt;\n\n&lt;p&gt;“Ed, let me up. Trust me.” He said, his usual calm voice cracking. &lt;/p&gt;\n\n&lt;p&gt;I started to slide out, and watched him as he moved. It was then that I noticed something black tucked into the waistline of his pants. I did not have a lot of experience with guns, but I knew enough to know that it looked real enough. &lt;/p&gt;\n\n&lt;p&gt;“What is that?” I asked, putting my arm between him and his exit. &lt;/p&gt;\n\n&lt;p&gt;“Move, Edward. I won’t ask again.” He said, his eyes holding a desperation that even his glasses couldn’t hide. &lt;/p&gt;\n\n&lt;p&gt;I shook my head. I was not a brave kid, but I liked Michael. I wouldn’t call us best friends, but we were close enough to enjoy each others company from time to time. &lt;/p&gt;\n\n&lt;p&gt;He didn’t react well to my arm blocking him, and quickly pull out the gun. He pointed it low at my stomach, and kept his stare on me. &lt;/p&gt;\n\n&lt;p&gt;“Move, now.” He said. &lt;/p&gt;\n\n&lt;p&gt;I won’t pretend that I stood my ground. I moved almost instantly. The gun before was just a possible bad situation. Now it was being held towards me, and my body entered a fight or flight mode. I chose flight. &lt;/p&gt;\n\n&lt;p&gt;I moved out of his way, and he walked passed me. I think I knew what was going to happen next, but I can’t say I was prepared for it. With a deafening pop, a flash of light, and an orchestra of screams, William Slater was dead a moment later. After a few moments passed, there was another loud pop. Michael Sanchez hit the bus floor with a light thud, and I swear to this day he died with a smile on his face. &lt;/p&gt;\n\n&lt;p&gt;What followed after was a bit of a blur, but I know they evacuated us from the bus. We were on a highway, that much I remember. The bus driver tried to keep us all together as he spewed hurried words over his walkie talkie. I remember wanting to get as far away from the bus as possible, and drifting backwards a bit. I don’t remember walking or moving my legs, but I guess I was in a state of shock. &lt;/p&gt;\n\n&lt;p&gt;My legs moved on their own, my mind subconsciously willing myself away from the area. I backed up far enough into the highway that I heard a booming noise from my left, and then I was flying in the air. I remember spinning very quickly, and then everything was black. &lt;/p&gt;\n\n&lt;p&gt;I heard voices, and couldn’t feel much around me. I tried to open my eyes, but they wouldn’t budge. The voices cleared up a bit, and I think I remember something caressing my cheek. I think it was my Mother, though It could&amp;#39;ve been my Father. &lt;/p&gt;\n\n&lt;p&gt;“Oh, Edward...Please wake up baby.” I heard my Mother say through her sobs. &lt;/p&gt;\n\n&lt;p&gt;If my father was there, he remained quiet. I couldn’t blame him. They were losing their son, and I think I was the only one who didn’t know it. &lt;/p&gt;\n\n&lt;p&gt;I won’t nag you with the details, but the car had done a number on me. I was paralyzed, and had multi organ failure. I remember that part specifically because the doctor had to explain it to my Mother, who could not comprehend a reality where I wasn’t going to be okay. &lt;/p&gt;\n\n&lt;p&gt;I managed to open my eyes just before the end. My mom was holding me in her arms, and my dad stood in the corner of the room. He had always been a quiet, reserved man, but in this moment he was crying. If I didn’t know I was dying before, I knew it now. &lt;/p&gt;\n\n&lt;p&gt;I died shortly after that, and awoke in The White Room. It was the same as it always had been, and I remembered everything. Both memories from both realities. I had two sets of memories up until the age of fourteen and it was a bit hard to understand, even in my own mind. &lt;/p&gt;\n\n&lt;p&gt;I looked forward, still in my small body, and saw Death once again. He took the form of an elderly woman this time. &lt;/p&gt;\n\n&lt;p&gt;“I don’t understand.” I said. &lt;/p&gt;\n\n&lt;p&gt;“That is understandable. Death confuses many.”&lt;/p&gt;\n\n&lt;p&gt;“No, I understand that. But why do I remember both lives?” I asked, sorting through two sets of memories in my own head. &lt;/p&gt;\n\n&lt;p&gt;“Because you have lived two lives. And here is where they both have led.” Death stated. &lt;/p&gt;\n\n&lt;p&gt;I nodded, not fully understanding the situation, but too disoriented to push the matter. &lt;/p&gt;\n\n&lt;p&gt;“So I guess I get to choose another afterlife now, yes?” I said, my voice still a light, childish tone. &lt;/p&gt;\n\n&lt;p&gt;Death nodded. &lt;/p&gt;\n\n&lt;p&gt;“I...I don’t know what I want. I have two lives to choose from. Or..well...anything to choose from really. Um...I don’t suppose I’m ready to follow Cae yet?” I asked, memories of my wife coming back. &lt;/p&gt;\n\n&lt;p&gt;Death shook his head. &lt;/p&gt;\n\n&lt;p&gt;“You are not ready, but it is not for me to decide your afterlife.” She explained. &lt;/p&gt;\n\n&lt;p&gt;I nodded, thinking for a moment. &lt;/p&gt;\n\n&lt;p&gt;“I want to go where she went.” I said. &lt;/p&gt;\n\n&lt;p&gt;Death paused for a moment, and nodded. And then she was gone, once again. &lt;/p&gt;\n\n&lt;p&gt;I walked to the door, and twisted the handle slowly. I was going into the unknown afterlife of my late wife, and it scared me. I opened the door, and was immediately greeted by the vast darkness of an ocean depth. At least, I assumed it was an ocean. It could&amp;#39;ve been a realm completely submerged in water for all I knew. &lt;/p&gt;\n\n&lt;p&gt;I tried to swim upwards, but I reached into nothing but blackness. As darkness surrounded me and oxygen left my weakening body, I heard a bellowing call surround me. It was as if a thousand blue whales all called out in horror at once. I have never known a fear such as that, and for the first time I saw a source of light in my soon to be ocean grave. &lt;/p&gt;\n\n&lt;p&gt;At first all I saw was space. Literally, the cosmos was before me. It was a giant sphere that looked like it was filled with galaxies and stars. And then it blinked. The light source from the large eye faded, and my lungs began to ache as I drowned. I felt the swift movement of water around me as the terrible leviathan moved. It was completely dark, but I still felt that it was moving. As I lost consciousness, the last thing I saw was the light shining down from the cosmos filled eye against a large, tentacle faced creature. I wish I would have died before seeing it, but I was not so lucky. &lt;/p&gt;\n\n&lt;p&gt;Before I knew what was what, I was back in the White Room. Death sat before me, his usual smile was no longer there. This time he took the form of a long haired man, wearing a foreign looking garb. &lt;/p&gt;\n\n&lt;p&gt;“What the fuck was that?!” I yelled, gasping for air that I no longer needed. &lt;/p&gt;\n\n&lt;p&gt;“They have not been given a name, as they have not been discovered yet.” Death stated. &lt;/p&gt;\n\n&lt;p&gt;“Discovered? What planet was that thing from?” I asked, my voice still seeping fear. &lt;/p&gt;\n\n&lt;p&gt;“The planet you know as Earth.” Death said calmly. &lt;/p&gt;\n\n&lt;p&gt;I shook my head, my mind running in every direction. &lt;/p&gt;\n\n&lt;p&gt;“You know what, I don’t want to know any more. Just...fuck. Just...put me back. Put me back in my old life, and just let me skip school that day.”  I said. &lt;/p&gt;\n\n&lt;p&gt;Death nodded, his smile returning. And then he was gone. &lt;/p&gt;\n\n&lt;p&gt;I walked quickly to the door, and opened it. I awoke with a start, and once again I laid in my fourteen year old body. I turned off my alarm clock, and laid in my bed until I was sure I missed the bus. I had brought back my memories, which by normal means would defy everything we know about memory capacity. My life would be forever changed because of this. My mind held the memories of one hundred and one years of life, all packed into a fourteen year old mind. \nThis brings us to six deaths, counting the unfortunate run in with the drowning. I know this part of the story seems a bit crazy compared to the rest, but I assure you that is as bizarre as it gets. To an extent. I suppose it depends on your view of bizarre. Monsters in the depths on the ocean, that&amp;#39;s about as freaky as I can imagine. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll update again soon. I promise that my next death isn’t as freaky. Though when is death not freaky? &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/nosleep/comments/65l10w/the_white_room_final/\"&gt;Final Update&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Part 1] (https://www.reddit.com/r/nosleep/comments/64ahar/the_white_room/)\n\n[Part 2] (https://www.reddit.com/r/nosleep/comments/64jsub/the_white_room_part_2/)\n\n[Part 3] (https://www.reddit.com/r/nosleep/comments/64sx6f/the_white_room_part_3/)\n\n[Part 4] (https://www.reddit.com/r/nosleep/comments/652ofo/the_white_room_part_4/)\n\n\nI am sure some of you are confused, or maybe even frustrated with how things have progressed in the story. Imagine being in it, and having to grow up again. Albeit without the memories of my first life. I thought at one point that life was strange. I was surprised that Death was even stranger. \n\nFor the sake of time, I am going to skip forward to my next death. Just know that I lived a simple, ordinary life up until the age of fourteen. My parents loved me, I still held no memories of my former life, and Death had not pulled any strings that I was aware of. A simple, boring life in the outskirts of Seattle. It was nice, until a fatal ride home from school.  \n\nI am going to start this with a small note. Parents, pay attention to your kids. If they are being bullied at school, you would be surprised what they are capable of. More often than not, there is only one way to handle a bully. Taking them out of the equation, or taking yourself out of the equation. That's the logic of a child, anyway. Neither choice is rational. But that is what bullying makes you. Irrational. And I was unfortunate enough to be caught in the middle of it. \n\nMichael was an average boy in my eyes. A bit shorter than the rest of the class, but still, average. But for some reason our school bully, Will, picked on him relentlessly. Making fun of his height, freckles, glasses, unkempt hair, tormenting him about his father who had just passed away, honestly anything that would get a rise out of Michael. Michael always dropped his head, and tried to ignore it. Until the last day of school. \n\nWe were on the bus, on our way to our drop off. We had assigned seats, like some busses do, and Michael and I were assigned next to each other. Will was about four rows behind us. \n\nAbout ten minutes from our drop off, Michael asks me to get up. \n\n“Why? We're almost there.” I said. \n\n“Ed, let me up. Trust me.” He said, his usual calm voice cracking. \n\nI started to slide out, and watched him as he moved. It was then that I noticed something black tucked into the waistline of his pants. I did not have a lot of experience with guns, but I knew enough to know that it looked real enough. \n\n“What is that?” I asked, putting my arm between him and his exit. \n\n“Move, Edward. I won’t ask again.” He said, his eyes holding a desperation that even his glasses couldn’t hide. \n\nI shook my head. I was not a brave kid, but I liked Michael. I wouldn’t call us best friends, but we were close enough to enjoy each others company from time to time. \n\nHe didn’t react well to my arm blocking him, and quickly pull out the gun. He pointed it low at my stomach, and kept his stare on me. \n\n“Move, now.” He said. \n\nI won’t pretend that I stood my ground. I moved almost instantly. The gun before was just a possible bad situation. Now it was being held towards me, and my body entered a fight or flight mode. I chose flight. \n\nI moved out of his way, and he walked passed me. I think I knew what was going to happen next, but I can’t say I was prepared for it. With a deafening pop, a flash of light, and an orchestra of screams, William Slater was dead a moment later. After a few moments passed, there was another loud pop. Michael Sanchez hit the bus floor with a light thud, and I swear to this day he died with a smile on his face. \n\nWhat followed after was a bit of a blur, but I know they evacuated us from the bus. We were on a highway, that much I remember. The bus driver tried to keep us all together as he spewed hurried words over his walkie talkie. I remember wanting to get as far away from the bus as possible, and drifting backwards a bit. I don’t remember walking or moving my legs, but I guess I was in a state of shock. \n\nMy legs moved on their own, my mind subconsciously willing myself away from the area. I backed up far enough into the highway that I heard a booming noise from my left, and then I was flying in the air. I remember spinning very quickly, and then everything was black. \n\nI heard voices, and couldn’t feel much around me. I tried to open my eyes, but they wouldn’t budge. The voices cleared up a bit, and I think I remember something caressing my cheek. I think it was my Mother, though It could've been my Father. \n\n“Oh, Edward...Please wake up baby.” I heard my Mother say through her sobs. \n\nIf my father was there, he remained quiet. I couldn’t blame him. They were losing their son, and I think I was the only one who didn’t know it. \n\nI won’t nag you with the details, but the car had done a number on me. I was paralyzed, and had multi organ failure. I remember that part specifically because the doctor had to explain it to my Mother, who could not comprehend a reality where I wasn’t going to be okay. \n\nI managed to open my eyes just before the end. My mom was holding me in her arms, and my dad stood in the corner of the room. He had always been a quiet, reserved man, but in this moment he was crying. If I didn’t know I was dying before, I knew it now. \n\nI died shortly after that, and awoke in The White Room. It was the same as it always had been, and I remembered everything. Both memories from both realities. I had two sets of memories up until the age of fourteen and it was a bit hard to understand, even in my own mind. \n\nI looked forward, still in my small body, and saw Death once again. He took the form of an elderly woman this time. \n\n“I don’t understand.” I said. \n\n“That is understandable. Death confuses many.”\n\n“No, I understand that. But why do I remember both lives?” I asked, sorting through two sets of memories in my own head. \n\n“Because you have lived two lives. And here is where they both have led.” Death stated. \n\nI nodded, not fully understanding the situation, but too disoriented to push the matter. \n\n“So I guess I get to choose another afterlife now, yes?” I said, my voice still a light, childish tone. \n\nDeath nodded. \n\n“I...I don’t know what I want. I have two lives to choose from. Or..well...anything to choose from really. Um...I don’t suppose I’m ready to follow Cae yet?” I asked, memories of my wife coming back. \n\nDeath shook his head. \n\n“You are not ready, but it is not for me to decide your afterlife.” She explained. \n\nI nodded, thinking for a moment. \n\n“I want to go where she went.” I said. \n\nDeath paused for a moment, and nodded. And then she was gone, once again. \n\nI walked to the door, and twisted the handle slowly. I was going into the unknown afterlife of my late wife, and it scared me. I opened the door, and was immediately greeted by the vast darkness of an ocean depth. At least, I assumed it was an ocean. It could've been a realm completely submerged in water for all I knew. \n\nI tried to swim upwards, but I reached into nothing but blackness. As darkness surrounded me and oxygen left my weakening body, I heard a bellowing call surround me. It was as if a thousand blue whales all called out in horror at once. I have never known a fear such as that, and for the first time I saw a source of light in my soon to be ocean grave. \n\nAt first all I saw was space. Literally, the cosmos was before me. It was a giant sphere that looked like it was filled with galaxies and stars. And then it blinked. The light source from the large eye faded, and my lungs began to ache as I drowned. I felt the swift movement of water around me as the terrible leviathan moved. It was completely dark, but I still felt that it was moving. As I lost consciousness, the last thing I saw was the light shining down from the cosmos filled eye against a large, tentacle faced creature. I wish I would have died before seeing it, but I was not so lucky. \n\nBefore I knew what was what, I was back in the White Room. Death sat before me, his usual smile was no longer there. This time he took the form of a long haired man, wearing a foreign looking garb. \n\n“What the fuck was that?!” I yelled, gasping for air that I no longer needed. \n\n“They have not been given a name, as they have not been discovered yet.” Death stated. \n\n“Discovered? What planet was that thing from?” I asked, my voice still seeping fear. \n\n“The planet you know as Earth.” Death said calmly. \n\nI shook my head, my mind running in every direction. \n\n“You know what, I don’t want to know any more. Just...fuck. Just...put me back. Put me back in my old life, and just let me skip school that day.”  I said. \n\nDeath nodded, his smile returning. And then he was gone. \n\nI walked quickly to the door, and opened it. I awoke with a start, and once again I laid in my fourteen year old body. I turned off my alarm clock, and laid in my bed until I was sure I missed the bus. I had brought back my memories, which by normal means would defy everything we know about memory capacity. My life would be forever changed because of this. My mind held the memories of one hundred and one years of life, all packed into a fourteen year old mind. \nThis brings us to six deaths, counting the unfortunate run in with the drowning. I know this part of the story seems a bit crazy compared to the rest, but I assure you that is as bizarre as it gets. To an extent. I suppose it depends on your view of bizarre. Monsters in the depths on the ocean, that's about as freaky as I can imagine. \n\nI'll update again soon. I promise that my next death isn’t as freaky. Though when is death not freaky? \n\n[Final Update] (https://www.reddit.com/r/nosleep/comments/65l10w/the_white_room_final/)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "65bnju", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 182, "report_reasons": null, "author": "Kennon02", "saved": false, "mod_reports": [], "name": "t3_65bnju", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492302295.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65bnju/the_white_room_part_5/", "num_reports": null, "locked": false, "stickied": false, "created": 1492192215.0, "url": "https://www.reddit.com/r/nosleep/comments/65bnju/the_white_room_part_5/", "author_flair_text": null, "quarantine": false, "title": "The White Room [Part 5]", "created_utc": 1492163415.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 182}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": "", "user_reports": [], "id": "dg8yzij", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_65bnju", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65bnju%2Fthe_white_room_part_5%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;to=RemindMeBot&amp;subject=Reminder) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65bnju%2Fthe_white_room_part_5%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;to=RemindMeBot&amp;amp;subject=Reminder\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg8yzij", "score_hidden": true, "stickied": true, "created": 1492192360.0, "created_utc": 1492163560.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": "", "user_reports": [], "id": "dg9asl6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg9agdh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I can't even begin to comprehend that, and I don't think I want to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t even begin to comprehend that, and I don&amp;#39;t think I want to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9asl6", "score_hidden": false, "stickied": false, "created": 1492213576.0, "created_utc": 1492184776.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9agdh", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "KCMommy", "parent_id": "t1_dg98ae2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Maybe your wife got to BE the big monster sea creature for awhile?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe your wife got to BE the big monster sea creature for awhile?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9agdh", "score_hidden": false, "stickied": false, "created": 1492213183.0, "created_utc": 1492184383.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": "", "user_reports": [], "id": "dgbk4p8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "motherofFAE", "parent_id": "t1_dgbisjf", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "We're all just living our afterlives, indefinitely traversing the precarious lines between what we know as \"life\" and \"death.\" Wonderfully written, OP, thank you for sharing 💚", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re all just living our afterlives, indefinitely traversing the precarious lines between what we know as &amp;quot;life&amp;quot; and &amp;quot;death.&amp;quot; Wonderfully written, OP, thank you for sharing 💚&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbk4p8", "score_hidden": false, "stickied": false, "created": 1492338913.0, "created_utc": 1492310113.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbisjf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dgbiqgw", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You could be right. I could of just been a link in the infinite chain of her ongoing afterlife. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could be right. I could of just been a link in the infinite chain of her ongoing afterlife. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbisjf", "score_hidden": false, "stickied": false, "created": 1492336931.0, "created_utc": 1492308131.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbiqgw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "motherofFAE", "parent_id": "t1_dg98ae2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Who's to say your wife hadn't already gone through an exponential number of lives before the one with you, though? I think she lived enough lives to enable her to cope with what you saw. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who&amp;#39;s to say your wife hadn&amp;#39;t already gone through an exponential number of lives before the one with you, though? I think she lived enough lives to enable her to cope with what you saw. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbiqgw", "score_hidden": false, "stickied": false, "created": 1492336846.0, "created_utc": 1492308046.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98ae2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Kennon02", "parent_id": "t1_dg97n73", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I can't imagine what my wife was prepared for. I never did learn that. Wherever she went, I guess I'm not meant to follow. Death is a bit vague, but I can't help but feel like these loopholes are punishments. Maybe this was my hell? Or maybe my heaven. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t imagine what my wife was prepared for. I never did learn that. Wherever she went, I guess I&amp;#39;m not meant to follow. Death is a bit vague, but I can&amp;#39;t help but feel like these loopholes are punishments. Maybe this was my hell? Or maybe my heaven. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg98ae2", "score_hidden": false, "stickied": false, "created": 1492210566.0, "created_utc": 1492181766.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97n73", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "They-Know-You-Did-It", "parent_id": "t3_65bnju", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "How, exactly, was your wife ready for that? What possible  insights could she have had that you didn't? At this point it seems like death is the king of finding loopholes in your wording, like a Genie. \n\nYou want to be live through that car crash? Sure, you can,  but since you didn't ask about your girlfriend...\n\nYou want to not go to work on the day you were accidentally killed? Sure, but since you didn't mention anything about your  health...\n\nYou want to know what to do after you lived a full life? Sure, just make a decision based off my cryptic answers.  \n\nYou want to go where your wife is? Sure,  but you never said you want to survive where she is. \n\nDeath is a jerk with precision of a lawyer. Please post more. ", "edited": 1492183010.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How, exactly, was your wife ready for that? What possible  insights could she have had that you didn&amp;#39;t? At this point it seems like death is the king of finding loopholes in your wording, like a Genie. &lt;/p&gt;\n\n&lt;p&gt;You want to be live through that car crash? Sure, you can,  but since you didn&amp;#39;t ask about your girlfriend...&lt;/p&gt;\n\n&lt;p&gt;You want to not go to work on the day you were accidentally killed? Sure, but since you didn&amp;#39;t mention anything about your  health...&lt;/p&gt;\n\n&lt;p&gt;You want to know what to do after you lived a full life? Sure, just make a decision based off my cryptic answers.  &lt;/p&gt;\n\n&lt;p&gt;You want to go where your wife is? Sure,  but you never said you want to survive where she is. &lt;/p&gt;\n\n&lt;p&gt;Death is a jerk with precision of a lawyer. Please post more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg97n73", "score_hidden": false, "stickied": false, "created": 1492209744.0, "created_utc": 1492180944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": "", "user_reports": [], "id": "dgaaxx7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "QueenOfKumquat", "parent_id": "t3_65bnju", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm in love with and I'm so fascinated by your death stories, as weird as that may sound. I can't wait for the next update. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in love with and I&amp;#39;m so fascinated by your death stories, as weird as that may sound. I can&amp;#39;t wait for the next update. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaaxx7", "score_hidden": false, "stickied": false, "created": 1492260708.0, "created_utc": 1492231908.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65bnju", "likes": null, "replies": "", "user_reports": [], "id": "dgb94qv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "joaquin55", "parent_id": "t3_65bnju", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I know it sucks to die, but choosing what to do after your death sounds pretty cool.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it sucks to die, but choosing what to do after your death sounds pretty cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb94qv", "score_hidden": false, "stickied": false, "created": 1492323052.0, "created_utc": 1492294252.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]