[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve seen a lot of weird shit over the years. It sorta comes with the territory.&lt;/p&gt;\n\n&lt;p&gt;And I want to make it clear I don’t mean the regular weird shit you see when you work for the mob. I’ve seen people get murdered and shit like that, Hell, one time stumbled on two of our guys that had been hit right before a pickup. There’s a difference, though. Weird’s subjective, and two guys strung up from chains on the ceiling with “Irish Pigs” written on the wall isn’t weird to me – not anymore.&lt;/p&gt;\n\n&lt;p&gt;Before you start to think I’m some sorta hitman or something, I’m just a courier. A well-paid runner, that’s it. I needed a job and my friend just, well, he knew a guy.&lt;/p&gt;\n\n&lt;p&gt;I’m no drug-runner, either, before that pops into your head. The guys I work for are a lot more old-school than that. Think the Godfather movies with less Italians and more Irish. I mean – I work for the mob, yeah, but I’m not a bad guy.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;Conner always had a shit-eating grin. I think his face was stuck that way, if I’m gonna be honest. It probably wouldn’t have been so bad if his breath didn’t always stink and his teeth weren’t stained from the coffee and coffee stouts he always drank. I hated it when I started working under him, but I got used to it after a while. He’s a pretty good guy, if I’m gonna be honest. &lt;/p&gt;\n\n&lt;p&gt;“You okay for a pickup tonight, Jackie boy?” he asked, smiling cheekily as he walked out of the bail-bonds shop he ran. I use the term “ran” as absolutely lightly as I can, too, because apart from occasionally bailing one of us out, all he did was give us assignments and sit on his ass drinking IPAs all day.&lt;/p&gt;\n\n&lt;p&gt;“I don’t like that you’re so happy about this,” I said. Anything that made Conner happy usually made me miserable.&lt;/p&gt;\n\n&lt;p&gt;“No, it’s fine,” he laughed. “You’re getting a vacation, actually.”&lt;/p&gt;\n\n&lt;p&gt;I raised an eyebrow at him. &lt;/p&gt;\n\n&lt;p&gt;“That’s not making me feel better,” I said.&lt;/p&gt;\n\n&lt;p&gt;“Oh, relax, crabass,” he said. “Easiest pickup you’ll get all month.”&lt;/p&gt;\n\n&lt;p&gt;He handed me an envelope.&lt;/p&gt;\n\n&lt;p&gt;“Leave your bike outside with the disc in the saddlebags and the next morning, it’ll be replaced with cash. It’s maaaaAAAAAgic,” he said. He made “wooOOOOOOooooo” sounds and wiggled his fingers at me menacingly.&lt;/p&gt;\n\n&lt;p&gt;I nodded. Blackmail stuff was pretty common for us. Business guy grabbed one of the local whores on vacation or something, went back to her place, badda bing badda boom, she made sure the dirty was in front of the camera and the guy pays us twice, once for the pleasure, once to keep a secret.&lt;/p&gt;\n\n&lt;p&gt;He turned around and walked back into the shop.&lt;/p&gt;\n\n&lt;p&gt;“Have fun!” he called over his shoulder. He walked back in and I was left to look after him, apprehensive about that damn grin.&lt;/p&gt;\n\n&lt;p&gt;When I got home, I changed into some jeans and a maroon t-shirt and entered the address in the envelope into my computer. Now – in East Tennessee, there’s quite a few places most people would consider “in the middle of nowhere” but, take it from me when I say that this place was above and beyond the middle of nowhere. This place was nowhere cubed. I had to pull the map eight times following the little yellow line on the screen before it hit an actual main road. &lt;/p&gt;\n\n&lt;p&gt;Alongside the little slip of paper with the address was a nondescript disc in a yellow case and a folded piece of paper with instructions written in Conner’s cramped, chicken-scratch handwriting:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Check in in Pigeon Forge. It’s under your name.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Leave your bike outside where it can be seen. (I already checked the weather and you’ll be fine – no more rain till next week).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Leave the disc in one of the saddlebags. (Don’t watch it, you know the drill blah blah blah).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;No hookers.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I laughed at the last part. If you ever saw the hookers in Pigeon Forge, you’d understand why. It was like telling me not to stick my dick in a drainpipe. &lt;/p&gt;\n\n&lt;p&gt;I grabbed my old canvas bag and strapped it to the luggage rack on my bike, made sure my 1911 was loaded and headed out.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;Normally when people think of vacation cabins up in the mountains, they think of solitary cabins up in the woods looking over picturesque mountain peaks, like Thoreau’s cabin. In East Tennessee, they’re not usually all that secluded. They’re sort of built in communities so you’re surrounded by other cabins and people. This one, though – wasn’t.&lt;/p&gt;\n\n&lt;p&gt;I checked in a bit later than I would have liked since traffic in Pigeon Forge is always shit near the weekend, so the sun was starting to go down as I turned onto the long road the wound up the mountain. It was a little two lane that was so narrow, I ended up riding the middle line most of the time, and I tried not to look at the edge or think about the fact there wasn’t a guard rail. I’ve rode motorcycles my entire life, but the road was so curvy that I began to wonder if I should have borrowed a car from Conner. I didn’t see a single other driveway the entire way up. &lt;/p&gt;\n\n&lt;p&gt;I did try to enjoy the ride, though. The leaves were just beginning to change and it was just cool enough up in the mountains to feel amazing. My old Vulcan felt good underneath me, and I decided that the next day, I would ride up to Cades Cove and just, ya know, enjoy it. Conner did call it a vacation, so if he got mad, I’d just say I misunderstood him.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;The road just sort of ended in a big circle at the cabin. There wasn’t really a driveway, just a little brick path that led from the road to the door. The cabin itself was a tiny little thing. It didn’t actually sit on the hilltop, but had the characteristic stilts so that one side could sit suspended in the air.&lt;/p&gt;\n\n&lt;p&gt;I pulled the bike to the side of the circle of pavement and put the kickstand down. When I cut the engine off, I took a second to listen to the silence. I couldn’t even hear the cars from the valley below, just the wind rustling the trees and blowing in dark clouds. The air had the sickly sweet smell of fall, and I loved it. I pulled out my phone to text Conner to tell him if it rained, he was paying for the leather on my seat to get treated and felt stupid realizing that of course I wouldn’t have signal where I was. &lt;/p&gt;\n\n&lt;p&gt;I was nearly at the door to the cabin and grumbling about the rain when I actually noticed it. I was so damned startled, I’m sure my heart stopped for a second or two. The door was one of those that had part of the upper half replaced with glass and when I looked up from the brick path, there was a figure standing at the door, staring at me.&lt;/p&gt;\n\n&lt;p&gt;I jerked backward so quickly I couldn’t pull my foot back quick enough to catch myself and I fell right on my ass on the little brick walkway. I was still trying to scramble backward and pull my 1911 out of its holster when my mind finally registered that the figure wasn’t moving.&lt;/p&gt;\n\n&lt;p&gt;I stopped moving for a second and watched it closely – but it never moved, so I got to my feet and crept closer to investigate, my gun gripped so tightly that my knuckles were turning white.&lt;/p&gt;\n\n&lt;p&gt;It was a fucking carved indian statue. Like, the kind carved out of a huge piece of wood with the colorful headdress and the somber face and stereotypical indian vest with beads carved into its clothing and mocassins carved as shoes. It had its hand held over its face like it was looking at something far away or was in bright sunlight. I opened the door and moved the thing out of the way with a bit of difficulty. It must have been carved out of oak or some other kind of heavy wood because the damn thing was heavy as all hell. &lt;/p&gt;\n\n&lt;p&gt;I remembered the time as a teenager when my friends and I had wrapped up the sheets in our hotel room to look like a corpse and how funny we thought it would be. I figured some kids had probably gotten a similar laugh out of this. When my heart finally quit threatening to jump out of my chest, I actually let out a shaky laugh. They got me, after all. I could respect the little shitheads for that. &lt;/p&gt;\n\n&lt;p&gt;The rest of the cabin was pretty standard. The door opened onto a single room, half of which was the kitchen and the other the living room with a futon, some tables with lamps made of antlers and a television sitting on the mantelpiece of a little brick fireplace. The floors were brightly polished wood and the coffee table was carved with a scene of three baby black bears playing in a mountain stream. Directly opposite from the entrance door the wall consisted of large glass panes running from floor to ceiling so one could see the balcony outside. A door directly in the center of the wall, led out onto the balcony, and, on the left wall, a door led to the only bedroom with, you guessed it, a bed with a carved wooden frame and a quilt with little black bears on it and a brightly polished wooden dresser and the same wall consisting of glass panels separating the bedroom from the balcony. Strangely, it didn’t smell like wood. It smelled like dust and lemon Pine-sol. The warm light from the setting autumn sun made the wood seem warm and comfy.&lt;/p&gt;\n\n&lt;p&gt;I threw my bag down on the bed and took my coat off and draped it over the wooden Indian by the door.&lt;/p&gt;\n\n&lt;p&gt;I stepped outside onto the balcony and looked out over the valley. Far away I could just make out the glow of Gatlinburg as dusk continued to settle, but apart from that, I was fairly sure I was alone. No cabins, no traffic, the road didn’t even approach from beneath the cabin, so the long slope down was unbroken trees and foliage. Made sense for someone picking up what was probably a sextape, or for keggers, but I couldn’t see it being used for much else. &lt;/p&gt;\n\n&lt;p&gt;Far down in the valley, I noticed a black bear lumbering up one of the opposite hills. I took my 1911 out and aimed at it. I lined up the shot and then pulled the gun up quickly.&lt;/p&gt;\n\n&lt;p&gt;“Bang,” I said. &lt;/p&gt;\n\n&lt;p&gt;The bear continued climbing  – not giving a flying fuck about me.&lt;/p&gt;\n\n&lt;p&gt;I turned around to walk back inside and was startled by the indian – again. My coat had slipped off and so, once again, it was staring at me. I draped my leather jacket over it again, much more securely this time, and wondered just who in the fuck would buy a life-sized Indian statue, especially for such a small damn place. If it was local, the thing was probably several hundred dollars at least. It just didn’t make sense.&lt;/p&gt;\n\n&lt;p&gt;I turned on the television and put Die-Hard on pay-per-view. I wasn’t footing the bill, so eh. I called and ordered a pizza with the cabin’s phone and waited until the little teenager drove up in his sputtering little Honda to give it to me. I tipped him a twenty for making him drive so far but I still think he thought I was a bit of a douche.&lt;/p&gt;\n\n&lt;p&gt;While I waited, my jacket slipped off the wooden Indian two more times. To be honest, I wasn’t exactly sure how it was slipping off, but nevertheless, it happened, and I finally threw the jacket down beside me on the futon instead. It wasn’t worth dealing with it. I did, however, turn the statue around to face the wall again.&lt;/p&gt;\n\n&lt;p&gt;When it got dark – and it gets dark that far up in the mountains, things began to get worse. I had sat the pizza box on the counter in the kitchen part of the main room, and when I got off the futon to grab a second slice, the statue had somehow turned itself around. It never made a sound, but it was, nevertheless, facing the futon again.&lt;/p&gt;\n\n&lt;p&gt;I realized I didn’t know how long it had been like that and I imagined myself blissfully watching tv for the past few minutes with it just staring at me. Of course, I know that statues can’t stare – but I didn’t like it. &lt;/p&gt;\n\n&lt;p&gt;I moved the statue outside by rocking its weight back and forth and sort of walking it out the front door. I pushed it down the little set of steps just outside the door, and it thudded as it rolled down the small set of steps and came to rest face-down on the little brick path.&lt;/p&gt;\n\n&lt;p&gt;I know you’re probably saying I was silly and I admit I did feel kind of silly. I thought about how I would explain to Conner how I managed to strain my back at a secluded cabin where I literally just had to hang out for the night. The thing is, though, there was something stronger than the feeling of being silly – something I couldn’t really put a finger on, but that kept telling me that moving that wooden statue was a good thing.&lt;/p&gt;\n\n&lt;p&gt;I tried to sit down and get back into the end of Die Hard, but the wind began to pick up even more and I could hear it whistling and moaning outside as it relentlessly tugged at the trees, pulling leaves off one by one. &lt;/p&gt;\n\n&lt;p&gt;“There is nothing wrong with that goddamn statue,” I said through gritted teeth, trying to force myself to watch Bruce Willis. &lt;/p&gt;\n\n&lt;p&gt;The wind grew louder the more I tried to ignore it, though, demanding my attention with everything it had, until I heard a metallic crashing sound.&lt;/p&gt;\n\n&lt;p&gt;I ran to the front door, only to have my heart stutter. The cabin had an LED light above the door that faced the small circle of road where I’d parked, and in that bright white light, I could see my bike toppled sideways on the ground. My motorcycle being tipped over made me a little nauseous, but the wooden indian statue standing beside it made me want to vomit violently.&lt;/p&gt;\n\n&lt;p&gt;It was still in the same position, it’s hand casting a deep shadow over its face, but it was clearly staring at the door – at me. &lt;/p&gt;\n\n&lt;p&gt;I grabbed my pistol from the coffee table and walked outside. I grabbed the statue and pushed it over. I was so scared and angry that it didn’t seem so heavy as I rolled it to the edge of the hill. I remember it smelled like pine as I pushed it, but not like the pine-sol the rest of the cabin smelled like. It smelled like strong gin or a Christmas tree that had just started to turn brown. I pushed it over the edge and let it tumble into the valley below, thudding hollowly against the trees and swishing through the carpet of leaves as it slid and rolled into the darkness. &lt;/p&gt;\n\n&lt;p&gt;I had had enough. I pulled my bike upright, determined to leave that very second – but I realized with a lurch that my headlight had shattered when the bike fell over. My mind jumped to the winding road and tried to imagine riding down it in the dark. The clouds overhead meant there was almost no moonlight and I knew I’d probably careen off the side well before I made it even halfway down.&lt;/p&gt;\n\n&lt;p&gt;I walked back inside, trying to figure out what I was going to do, and found the indian statue on the balcony outside, staring through the glass panes directly at me. I jumped and almost fell again. &lt;/p&gt;\n\n&lt;p&gt;“WHAT DO YOU FUCKING WANT!?” I shouted.&lt;/p&gt;\n\n&lt;p&gt;The statue didn’t move. It never fucking moved. The old yellow bulb on the balcony made the shadows on the indian’s long, sullen face even deeper and darker.  &lt;/p&gt;\n\n&lt;p&gt;There was an axe beside the fireplace and I quickly walked over and grabbed it, intent on hacking the thing to pieces. Unfortunately, I think it realized that, because when I looked up, the statue was gone, and the light had gone out. &lt;/p&gt;\n\n&lt;p&gt;I turned around, and walked toward the front door, knowing the answer without even needing to look. The bright LED spotlight on the front of the house was out too. Beyond the reach of the lights inside the cabin, it was pure black. I was surrounded by almost interminable darkness – and even though I had never minded such a thing before, knowing so made me stomach curl even more.&lt;/p&gt;\n\n&lt;p&gt;I won’t pretend I was brave. I was terrified. Beyond all else, I was terrified. I was sure if the fucking statue didn’t get me, my heart would surely give out. I could feel it threatening to burst out of my chest already and run screaming into the darkness.&lt;/p&gt;\n\n&lt;p&gt;I looked onto the balcony again and, from the lights inside that managed to spill out, I could barely make out the shape of the statue. &lt;/p&gt;\n\n&lt;p&gt;I rummaged through the cabinets until I found a large container of salt. If ever there was a time where I needed pop culture to have a grain of truth, I needed it to be right then. I guess if some ghost hunter or something ever reads this, you can tell me I was an idiot, but it was the only thing I could think of. I finally found one in the cabinet beside the fridge and decided I would sprinkle it along the walls and doors to try and keep the statue out. &lt;/p&gt;\n\n&lt;p&gt;When I turned around, it was already inside, standing just in front of the panes of glass.&lt;/p&gt;\n\n&lt;p&gt;I walked slowly toward the bedroom door, the axe in one hand and the salt in the other. &lt;/p&gt;\n\n&lt;p&gt;“You afraid of this, you fucking bitch!?” I shouted. Strangely, I was hoping it would respond. I don’t know why, but I just wanted it to say – something. Even if it had just been that I was going to die or something in some demonic voice, that would have been better than that silence. &lt;/p&gt;\n\n&lt;p&gt;I backed into the bedroom, not taking my eyes off of it, and shut the door behind me as quickly as I could. I poured a line of salt across the bottom of the door and ran to do the same to the windows facing the balcony. When I turned, the statue was already there, his hand held over his sullen face, making it darker. I poured the salt as quickly as I could. Behind me, I heard the television in the main room shut off – no more Die Hard tonight. When I looked at the space beneath the door, I realized the lights in the main room had all gone out. All I had was the television in the bedroom, which I quickly turned on, and a small little antler lamp on the bedside table that gave off a warm yellow glow.&lt;/p&gt;\n\n&lt;p&gt;I looked back and forth as quickly as I could between the door and the balcony, but the Indian never reappeared outside. I tried to take deep breaths and think of a plan. &lt;/p&gt;\n\n&lt;p&gt;In.&lt;/p&gt;\n\n&lt;p&gt;Out.&lt;/p&gt;\n\n&lt;p&gt;In.&lt;/p&gt;\n\n&lt;p&gt;Out.&lt;/p&gt;\n\n&lt;p&gt;I opened the door to the bedroom slowly. The small amount of yellow light didn’t stretch far into the thick coffee blackness, but it did a little. I stepped as far away from the door as I could and braced my back against the wall. I put the salt on the bed and gripped the axe with both hands. I took a deep breath and closed my eyes. I had an idea.&lt;/p&gt;\n\n&lt;p&gt;1…&lt;/p&gt;\n\n&lt;p&gt;2…&lt;/p&gt;\n\n&lt;p&gt;3…&lt;/p&gt;\n\n&lt;p&gt;4…&lt;/p&gt;\n\n&lt;p&gt;5…&lt;/p&gt;\n\n&lt;p&gt;6…&lt;/p&gt;\n\n&lt;p&gt;7…&lt;/p&gt;\n\n&lt;p&gt;8…&lt;/p&gt;\n\n&lt;p&gt;9…&lt;/p&gt;\n\n&lt;p&gt;10…&lt;/p&gt;\n\n&lt;p&gt;I opened my eyes and braced myself to swing the ax as soon as I opened them, but, instead of being in the room with me, the Indian was just on the other side of the door – on the other side of the salt line, staring at me in front of a sea of black.&lt;/p&gt;\n\n&lt;p&gt;I let out a shaky breath and grabbed the salt off the bed. I still wasn’t sure if the salt had any effect, but I thought that the sign that it hadn’t passed the line I’d made was probably a good sign. &lt;/p&gt;\n\n&lt;p&gt;I sprinkled salt all around the statue’s base. I consciously turned away from the statue to put the salt back on the bed to see if it would move again.&lt;/p&gt;\n\n&lt;p&gt;It didn’t.&lt;/p&gt;\n\n&lt;p&gt;I grabbed the axe in both hands and got as close to the statue as I dared before swinging it over my head and burying it in the statue’s headdress. &lt;/p&gt;\n\n&lt;p&gt;It let out a single ear-piercing shriek that I will never, ever forget. As it shrieked, the lights shuttered back on, one by one, filling the cabin with warm, yellow light, and flooding the pavement outside with a bright blue glow.&lt;/p&gt;\n\n&lt;p&gt;I tried to pull the axe free but, no matter how much I pulled, it wouldn’t budge. I considered putting my foot on the statue to pull it free, but something told me not to, so I let it be.&lt;/p&gt;\n\n&lt;p&gt;The good thing about log cabins – they burn easily, and that one did. It burned high and bright and my breath shook when I set the fire. I called 911 on the cabin phone before I did, said some sparks from the fireplace had jumped out and I couldn’t contain it. They told me to quickly leave and they would send a crew out to me. By the time they got there it was too late to save the cabin – I made sure of it. They helped me get my bike to a motel in Gatlinburg and I left the next day.&lt;/p&gt;\n\n&lt;p&gt;Conner gave me shit for being an idiot, but I let him think that. Way better than telling him the truth. Second generation Irish immigrant, he’s a pretty superstitious guy, but I don’t think even he would’ve believed me. We rescheduled with the guy at a cheap motel at the outskirts of town and he got his sex tape or whatever the fuck it was, although he wasn’t happy about it. Eh, fuck him.&lt;/p&gt;\n\n&lt;p&gt;The reason I’m writing this down now is because I saw an article recently. One of those “Ten amazing things nobody can explain” lists or whatever on some site that probably gave my computer a virus. Number four was a picture of a wooden indian statue beside an older couple, who were both smiling brightly. The text beneath the photo read:&lt;/p&gt;\n\n&lt;p&gt;“California couple Jane and Austen Hollingsworth lost their East Tennessee cabin in a fire six months ago. The fire consumed the entire cabin and would have spread to surrounding forests if not for firefighters’ efforts to contain the blaze. The strange part, though, is that the statue that the couple purchased from a local carver when they first built the cabin somehow survived the raging inferno. It was found mostly unharmed in the remains of the cabin, with only a large indentation in the statue’s headdress and some mild soot marks. While some have speculated the statue merely survived due to a random fluke of the cabin collapsing on top of it, smothering part of the fire before it could do any serious harm to the statue, many have pointed out just how unlikely such an event is. Either way, Mr. and Mrs. Hollingsworth are glad their old friend survived the blaze, as one can see from the picture above.”&lt;/p&gt;\n\n&lt;p&gt;Ya know, fear is a funny thing. The odds of me being murdered by a supernatural statue are slim to none. The very thought of it is actually a bit silly, especially the idea of a statue somehow travelling all the way down from Gatlinburg to get me.&lt;/p&gt;\n\n&lt;p&gt;And yet – as I type this, the thought of looking behind me fills me with absolute unbridled dread.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I’ve seen a lot of weird shit over the years. It sorta comes with the territory.\n\nAnd I want to make it clear I don’t mean the regular weird shit you see when you work for the mob. I’ve seen people get murdered and shit like that, Hell, one time stumbled on two of our guys that had been hit right before a pickup. There’s a difference, though. Weird’s subjective, and two guys strung up from chains on the ceiling with “Irish Pigs” written on the wall isn’t weird to me – not anymore.\n\nBefore you start to think I’m some sorta hitman or something, I’m just a courier. A well-paid runner, that’s it. I needed a job and my friend just, well, he knew a guy.\n\nI’m no drug-runner, either, before that pops into your head. The guys I work for are a lot more old-school than that. Think the Godfather movies with less Italians and more Irish. I mean – I work for the mob, yeah, but I’m not a bad guy.\n\n-\n\nConner always had a shit-eating grin. I think his face was stuck that way, if I’m gonna be honest. It probably wouldn’t have been so bad if his breath didn’t always stink and his teeth weren’t stained from the coffee and coffee stouts he always drank. I hated it when I started working under him, but I got used to it after a while. He’s a pretty good guy, if I’m gonna be honest. \n\n“You okay for a pickup tonight, Jackie boy?” he asked, smiling cheekily as he walked out of the bail-bonds shop he ran. I use the term “ran” as absolutely lightly as I can, too, because apart from occasionally bailing one of us out, all he did was give us assignments and sit on his ass drinking IPAs all day.\n\n“I don’t like that you’re so happy about this,” I said. Anything that made Conner happy usually made me miserable.\n\n“No, it’s fine,” he laughed. “You’re getting a vacation, actually.”\n\nI raised an eyebrow at him. \n\n“That’s not making me feel better,” I said.\n\n“Oh, relax, crabass,” he said. “Easiest pickup you’ll get all month.”\n\nHe handed me an envelope.\n\n“Leave your bike outside with the disc in the saddlebags and the next morning, it’ll be replaced with cash. It’s maaaaAAAAAgic,” he said. He made “wooOOOOOOooooo” sounds and wiggled his fingers at me menacingly.\n\nI nodded. Blackmail stuff was pretty common for us. Business guy grabbed one of the local whores on vacation or something, went back to her place, badda bing badda boom, she made sure the dirty was in front of the camera and the guy pays us twice, once for the pleasure, once to keep a secret.\n\nHe turned around and walked back into the shop.\n\n“Have fun!” he called over his shoulder. He walked back in and I was left to look after him, apprehensive about that damn grin.\n\nWhen I got home, I changed into some jeans and a maroon t-shirt and entered the address in the envelope into my computer. Now – in East Tennessee, there’s quite a few places most people would consider “in the middle of nowhere” but, take it from me when I say that this place was above and beyond the middle of nowhere. This place was nowhere cubed. I had to pull the map eight times following the little yellow line on the screen before it hit an actual main road. \n\nAlongside the little slip of paper with the address was a nondescript disc in a yellow case and a folded piece of paper with instructions written in Conner’s cramped, chicken-scratch handwriting:\n\n\n1.\tCheck in in Pigeon Forge. It’s under your name.\n\n2.\tLeave your bike outside where it can be seen. (I already checked the weather and you’ll be fine – no more rain till next week).\n\n3.\tLeave the disc in one of the saddlebags. (Don’t watch it, you know the drill blah blah blah).\n\n4.\tNo hookers.\n\n\nI laughed at the last part. If you ever saw the hookers in Pigeon Forge, you’d understand why. It was like telling me not to stick my dick in a drainpipe. \n\nI grabbed my old canvas bag and strapped it to the luggage rack on my bike, made sure my 1911 was loaded and headed out.\n \n\n-\n\n\nNormally when people think of vacation cabins up in the mountains, they think of solitary cabins up in the woods looking over picturesque mountain peaks, like Thoreau’s cabin. In East Tennessee, they’re not usually all that secluded. They’re sort of built in communities so you’re surrounded by other cabins and people. This one, though – wasn’t.\n\nI checked in a bit later than I would have liked since traffic in Pigeon Forge is always shit near the weekend, so the sun was starting to go down as I turned onto the long road the wound up the mountain. It was a little two lane that was so narrow, I ended up riding the middle line most of the time, and I tried not to look at the edge or think about the fact there wasn’t a guard rail. I’ve rode motorcycles my entire life, but the road was so curvy that I began to wonder if I should have borrowed a car from Conner. I didn’t see a single other driveway the entire way up. \n\nI did try to enjoy the ride, though. The leaves were just beginning to change and it was just cool enough up in the mountains to feel amazing. My old Vulcan felt good underneath me, and I decided that the next day, I would ride up to Cades Cove and just, ya know, enjoy it. Conner did call it a vacation, so if he got mad, I’d just say I misunderstood him.\n\n\n-\n\n\nThe road just sort of ended in a big circle at the cabin. There wasn’t really a driveway, just a little brick path that led from the road to the door. The cabin itself was a tiny little thing. It didn’t actually sit on the hilltop, but had the characteristic stilts so that one side could sit suspended in the air.\n\nI pulled the bike to the side of the circle of pavement and put the kickstand down. When I cut the engine off, I took a second to listen to the silence. I couldn’t even hear the cars from the valley below, just the wind rustling the trees and blowing in dark clouds. The air had the sickly sweet smell of fall, and I loved it. I pulled out my phone to text Conner to tell him if it rained, he was paying for the leather on my seat to get treated and felt stupid realizing that of course I wouldn’t have signal where I was. \n\nI was nearly at the door to the cabin and grumbling about the rain when I actually noticed it. I was so damned startled, I’m sure my heart stopped for a second or two. The door was one of those that had part of the upper half replaced with glass and when I looked up from the brick path, there was a figure standing at the door, staring at me.\n\nI jerked backward so quickly I couldn’t pull my foot back quick enough to catch myself and I fell right on my ass on the little brick walkway. I was still trying to scramble backward and pull my 1911 out of its holster when my mind finally registered that the figure wasn’t moving.\n\nI stopped moving for a second and watched it closely – but it never moved, so I got to my feet and crept closer to investigate, my gun gripped so tightly that my knuckles were turning white.\n\nIt was a fucking carved indian statue. Like, the kind carved out of a huge piece of wood with the colorful headdress and the somber face and stereotypical indian vest with beads carved into its clothing and mocassins carved as shoes. It had its hand held over its face like it was looking at something far away or was in bright sunlight. I opened the door and moved the thing out of the way with a bit of difficulty. It must have been carved out of oak or some other kind of heavy wood because the damn thing was heavy as all hell. \n\nI remembered the time as a teenager when my friends and I had wrapped up the sheets in our hotel room to look like a corpse and how funny we thought it would be. I figured some kids had probably gotten a similar laugh out of this. When my heart finally quit threatening to jump out of my chest, I actually let out a shaky laugh. They got me, after all. I could respect the little shitheads for that. \n\nThe rest of the cabin was pretty standard. The door opened onto a single room, half of which was the kitchen and the other the living room with a futon, some tables with lamps made of antlers and a television sitting on the mantelpiece of a little brick fireplace. The floors were brightly polished wood and the coffee table was carved with a scene of three baby black bears playing in a mountain stream. Directly opposite from the entrance door the wall consisted of large glass panes running from floor to ceiling so one could see the balcony outside. A door directly in the center of the wall, led out onto the balcony, and, on the left wall, a door led to the only bedroom with, you guessed it, a bed with a carved wooden frame and a quilt with little black bears on it and a brightly polished wooden dresser and the same wall consisting of glass panels separating the bedroom from the balcony. Strangely, it didn’t smell like wood. It smelled like dust and lemon Pine-sol. The warm light from the setting autumn sun made the wood seem warm and comfy.\n\nI threw my bag down on the bed and took my coat off and draped it over the wooden Indian by the door.\n\nI stepped outside onto the balcony and looked out over the valley. Far away I could just make out the glow of Gatlinburg as dusk continued to settle, but apart from that, I was fairly sure I was alone. No cabins, no traffic, the road didn’t even approach from beneath the cabin, so the long slope down was unbroken trees and foliage. Made sense for someone picking up what was probably a sextape, or for keggers, but I couldn’t see it being used for much else. \n\nFar down in the valley, I noticed a black bear lumbering up one of the opposite hills. I took my 1911 out and aimed at it. I lined up the shot and then pulled the gun up quickly.\n\n“Bang,” I said. \n\nThe bear continued climbing  – not giving a flying fuck about me.\n\nI turned around to walk back inside and was startled by the indian – again. My coat had slipped off and so, once again, it was staring at me. I draped my leather jacket over it again, much more securely this time, and wondered just who in the fuck would buy a life-sized Indian statue, especially for such a small damn place. If it was local, the thing was probably several hundred dollars at least. It just didn’t make sense.\n\nI turned on the television and put Die-Hard on pay-per-view. I wasn’t footing the bill, so eh. I called and ordered a pizza with the cabin’s phone and waited until the little teenager drove up in his sputtering little Honda to give it to me. I tipped him a twenty for making him drive so far but I still think he thought I was a bit of a douche.\n\nWhile I waited, my jacket slipped off the wooden Indian two more times. To be honest, I wasn’t exactly sure how it was slipping off, but nevertheless, it happened, and I finally threw the jacket down beside me on the futon instead. It wasn’t worth dealing with it. I did, however, turn the statue around to face the wall again.\n\nWhen it got dark – and it gets dark that far up in the mountains, things began to get worse. I had sat the pizza box on the counter in the kitchen part of the main room, and when I got off the futon to grab a second slice, the statue had somehow turned itself around. It never made a sound, but it was, nevertheless, facing the futon again.\n\nI realized I didn’t know how long it had been like that and I imagined myself blissfully watching tv for the past few minutes with it just staring at me. Of course, I know that statues can’t stare – but I didn’t like it. \n\nI moved the statue outside by rocking its weight back and forth and sort of walking it out the front door. I pushed it down the little set of steps just outside the door, and it thudded as it rolled down the small set of steps and came to rest face-down on the little brick path.\n \nI know you’re probably saying I was silly and I admit I did feel kind of silly. I thought about how I would explain to Conner how I managed to strain my back at a secluded cabin where I literally just had to hang out for the night. The thing is, though, there was something stronger than the feeling of being silly – something I couldn’t really put a finger on, but that kept telling me that moving that wooden statue was a good thing.\n\nI tried to sit down and get back into the end of Die Hard, but the wind began to pick up even more and I could hear it whistling and moaning outside as it relentlessly tugged at the trees, pulling leaves off one by one. \n\n“There is nothing wrong with that goddamn statue,” I said through gritted teeth, trying to force myself to watch Bruce Willis. \n\nThe wind grew louder the more I tried to ignore it, though, demanding my attention with everything it had, until I heard a metallic crashing sound.\n\nI ran to the front door, only to have my heart stutter. The cabin had an LED light above the door that faced the small circle of road where I’d parked, and in that bright white light, I could see my bike toppled sideways on the ground. My motorcycle being tipped over made me a little nauseous, but the wooden indian statue standing beside it made me want to vomit violently.\n\nIt was still in the same position, it’s hand casting a deep shadow over its face, but it was clearly staring at the door – at me. \n\nI grabbed my pistol from the coffee table and walked outside. I grabbed the statue and pushed it over. I was so scared and angry that it didn’t seem so heavy as I rolled it to the edge of the hill. I remember it smelled like pine as I pushed it, but not like the pine-sol the rest of the cabin smelled like. It smelled like strong gin or a Christmas tree that had just started to turn brown. I pushed it over the edge and let it tumble into the valley below, thudding hollowly against the trees and swishing through the carpet of leaves as it slid and rolled into the darkness. \n\nI had had enough. I pulled my bike upright, determined to leave that very second – but I realized with a lurch that my headlight had shattered when the bike fell over. My mind jumped to the winding road and tried to imagine riding down it in the dark. The clouds overhead meant there was almost no moonlight and I knew I’d probably careen off the side well before I made it even halfway down.\n\nI walked back inside, trying to figure out what I was going to do, and found the indian statue on the balcony outside, staring through the glass panes directly at me. I jumped and almost fell again. \n\n“WHAT DO YOU FUCKING WANT!?” I shouted.\n\nThe statue didn’t move. It never fucking moved. The old yellow bulb on the balcony made the shadows on the indian’s long, sullen face even deeper and darker.  \n\nThere was an axe beside the fireplace and I quickly walked over and grabbed it, intent on hacking the thing to pieces. Unfortunately, I think it realized that, because when I looked up, the statue was gone, and the light had gone out. \n\nI turned around, and walked toward the front door, knowing the answer without even needing to look. The bright LED spotlight on the front of the house was out too. Beyond the reach of the lights inside the cabin, it was pure black. I was surrounded by almost interminable darkness – and even though I had never minded such a thing before, knowing so made me stomach curl even more.\n\nI won’t pretend I was brave. I was terrified. Beyond all else, I was terrified. I was sure if the fucking statue didn’t get me, my heart would surely give out. I could feel it threatening to burst out of my chest already and run screaming into the darkness.\n\nI looked onto the balcony again and, from the lights inside that managed to spill out, I could barely make out the shape of the statue. \n\nI rummaged through the cabinets until I found a large container of salt. If ever there was a time where I needed pop culture to have a grain of truth, I needed it to be right then. I guess if some ghost hunter or something ever reads this, you can tell me I was an idiot, but it was the only thing I could think of. I finally found one in the cabinet beside the fridge and decided I would sprinkle it along the walls and doors to try and keep the statue out. \n\nWhen I turned around, it was already inside, standing just in front of the panes of glass.\n\nI walked slowly toward the bedroom door, the axe in one hand and the salt in the other. \n\n“You afraid of this, you fucking bitch!?” I shouted. Strangely, I was hoping it would respond. I don’t know why, but I just wanted it to say – something. Even if it had just been that I was going to die or something in some demonic voice, that would have been better than that silence. \n\nI backed into the bedroom, not taking my eyes off of it, and shut the door behind me as quickly as I could. I poured a line of salt across the bottom of the door and ran to do the same to the windows facing the balcony. When I turned, the statue was already there, his hand held over his sullen face, making it darker. I poured the salt as quickly as I could. Behind me, I heard the television in the main room shut off – no more Die Hard tonight. When I looked at the space beneath the door, I realized the lights in the main room had all gone out. All I had was the television in the bedroom, which I quickly turned on, and a small little antler lamp on the bedside table that gave off a warm yellow glow.\n\nI looked back and forth as quickly as I could between the door and the balcony, but the Indian never reappeared outside. I tried to take deep breaths and think of a plan. \n\nIn.\n\nOut.\n\nIn.\n\nOut.\n\nI opened the door to the bedroom slowly. The small amount of yellow light didn’t stretch far into the thick coffee blackness, but it did a little. I stepped as far away from the door as I could and braced my back against the wall. I put the salt on the bed and gripped the axe with both hands. I took a deep breath and closed my eyes. I had an idea.\n\n1…\n\n2…\n\n3…\n\n4…\n\n5…\n\n6…\n\n7…\n\n8…\n\n9…\n\n10…\n\nI opened my eyes and braced myself to swing the ax as soon as I opened them, but, instead of being in the room with me, the Indian was just on the other side of the door – on the other side of the salt line, staring at me in front of a sea of black.\n\nI let out a shaky breath and grabbed the salt off the bed. I still wasn’t sure if the salt had any effect, but I thought that the sign that it hadn’t passed the line I’d made was probably a good sign. \n\nI sprinkled salt all around the statue’s base. I consciously turned away from the statue to put the salt back on the bed to see if it would move again.\n\nIt didn’t.\n\nI grabbed the axe in both hands and got as close to the statue as I dared before swinging it over my head and burying it in the statue’s headdress. \n\nIt let out a single ear-piercing shriek that I will never, ever forget. As it shrieked, the lights shuttered back on, one by one, filling the cabin with warm, yellow light, and flooding the pavement outside with a bright blue glow.\n\nI tried to pull the axe free but, no matter how much I pulled, it wouldn’t budge. I considered putting my foot on the statue to pull it free, but something told me not to, so I let it be.\n\nThe good thing about log cabins – they burn easily, and that one did. It burned high and bright and my breath shook when I set the fire. I called 911 on the cabin phone before I did, said some sparks from the fireplace had jumped out and I couldn’t contain it. They told me to quickly leave and they would send a crew out to me. By the time they got there it was too late to save the cabin – I made sure of it. They helped me get my bike to a motel in Gatlinburg and I left the next day.\n\nConner gave me shit for being an idiot, but I let him think that. Way better than telling him the truth. Second generation Irish immigrant, he’s a pretty superstitious guy, but I don’t think even he would’ve believed me. We rescheduled with the guy at a cheap motel at the outskirts of town and he got his sex tape or whatever the fuck it was, although he wasn’t happy about it. Eh, fuck him.\n\nThe reason I’m writing this down now is because I saw an article recently. One of those “Ten amazing things nobody can explain” lists or whatever on some site that probably gave my computer a virus. Number four was a picture of a wooden indian statue beside an older couple, who were both smiling brightly. The text beneath the photo read:\n\n\n“California couple Jane and Austen Hollingsworth lost their East Tennessee cabin in a fire six months ago. The fire consumed the entire cabin and would have spread to surrounding forests if not for firefighters’ efforts to contain the blaze. The strange part, though, is that the statue that the couple purchased from a local carver when they first built the cabin somehow survived the raging inferno. It was found mostly unharmed in the remains of the cabin, with only a large indentation in the statue’s headdress and some mild soot marks. While some have speculated the statue merely survived due to a random fluke of the cabin collapsing on top of it, smothering part of the fire before it could do any serious harm to the statue, many have pointed out just how unlikely such an event is. Either way, Mr. and Mrs. Hollingsworth are glad their old friend survived the blaze, as one can see from the picture above.”\n\n\nYa know, fear is a funny thing. The odds of me being murdered by a supernatural statue are slim to none. The very thought of it is actually a bit silly, especially the idea of a statue somehow travelling all the way down from Gatlinburg to get me.\n\n\nAnd yet – as I type this, the thought of looking behind me fills me with absolute unbridled dread.\n \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65dhu3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 152, "report_reasons": null, "author": "BigbyWolf343", "saved": false, "mod_reports": [], "name": "t3_65dhu3", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65dhu3/that_old_cabin_up_in_the_hills/", "num_reports": null, "locked": false, "stickied": false, "created": 1492215768.0, "url": "https://www.reddit.com/r/nosleep/comments/65dhu3/that_old_cabin_up_in_the_hills/", "author_flair_text": null, "quarantine": false, "title": "That old cabin up in the hills", "created_utc": 1492186968.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 152}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": "", "user_reports": [], "id": "dga3dvg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Danielgordon343", "parent_id": "t1_dga0c16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Middle Tennessee here too! 😀", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Middle Tennessee here too! 😀&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga3dvg", "score_hidden": false, "stickied": false, "created": 1492249049.0, "created_utc": 1492220249.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dga0c16", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Brescious", "parent_id": "t3_65dhu3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Love this, as someone who lived in central Tennessee and has travelled to the gatlinburg/ pigeon forge area pretty often, you hit the nail on the head on the descriptiveness of this story! Well done!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Love this, as someone who lived in central Tennessee and has travelled to the gatlinburg/ pigeon forge area pretty often, you hit the nail on the head on the descriptiveness of this story! Well done!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga0c16", "score_hidden": false, "stickied": false, "created": 1492244892.0, "created_utc": 1492216092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": "", "user_reports": [], "id": "dg9udef", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sleepy_tech", "parent_id": "t3_65dhu3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Great story. Terrifying to even picture it being stared by that thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story. Terrifying to even picture it being stared by that thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9udef", "score_hidden": false, "stickied": false, "created": 1492236952.0, "created_utc": 1492208152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": "", "user_reports": [], "id": "dgbzdcf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wishiwashome", "parent_id": "t1_dga3fgg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yes indeed! Not sure what you could have done... I mean the coat on his head, but damn, I am sure through all those years someone did that... And he seemed to predict what you were going to do before. Thing I am concerned about, it seemed as he wouldn't pass the salt line? Tells me he IS some negative energy in there... Good luck OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes indeed! Not sure what you could have done... I mean the coat on his head, but damn, I am sure through all those years someone did that... And he seemed to predict what you were going to do before. Thing I am concerned about, it seemed as he wouldn&amp;#39;t pass the salt line? Tells me he IS some negative energy in there... Good luck OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbzdcf", "score_hidden": false, "stickied": false, "created": 1492374934.0, "created_utc": 1492346134.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3fgg", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "BigbyWolf343", "parent_id": "t1_dga0tif", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I honestly don't know. Looking back I wonder if it actually wanted to kill me or not, but it wasn't happy with me. The more I think about it, the more I think I just did something to piss it off, because if it was doing that to EVERYONE, then I feel like I'd have heard something about it doing stuff to other people, ya know? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I honestly don&amp;#39;t know. Looking back I wonder if it actually wanted to kill me or not, but it wasn&amp;#39;t happy with me. The more I think about it, the more I think I just did something to piss it off, because if it was doing that to EVERYONE, then I feel like I&amp;#39;d have heard something about it doing stuff to other people, ya know? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga3fgg", "score_hidden": false, "stickied": false, "created": 1492249108.0, "created_utc": 1492220308.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dga0tif", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Wishiwashome", "parent_id": "t3_65dhu3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Damn! Cannot imagine. If you ever have anything else to share about your experiences, please do... Maybe keep some salt and a small hatchet handy in the meantime. Do you have any idea why the statue wanted to kill you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn! Cannot imagine. If you ever have anything else to share about your experiences, please do... Maybe keep some salt and a small hatchet handy in the meantime. Do you have any idea why the statue wanted to kill you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga0tif", "score_hidden": false, "stickied": false, "created": 1492245539.0, "created_utc": 1492216739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": "", "user_reports": [], "id": "dgda228", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dealwithitxo", "parent_id": "t1_dgbzawj", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Thankyou!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thankyou!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgda228", "score_hidden": false, "stickied": false, "created": 1492446304.0, "created_utc": 1492417504.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzawj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Wishiwashome", "parent_id": "t1_dgah5fg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Read rules please", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read rules please&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbzawj", "score_hidden": false, "stickied": false, "created": 1492374772.0, "created_utc": 1492345972.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgah5fg", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "dealwithitxo", "parent_id": "t3_65dhu3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Link to the article?? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Link to the article?? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgah5fg", "score_hidden": false, "stickied": false, "created": 1492275813.0, "created_utc": 1492247013.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65dhu3", "likes": null, "replies": "", "user_reports": [], "id": "dgbm3x4", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65dhu3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbm3x4", "score_hidden": false, "stickied": false, "created": 1492341850.0, "created_utc": 1492313050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]