[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a beautiful family. I really do. Every time I look at this picture hanging in the hallway, that&amp;#39;s all I think. Wow, what a good looking family. It&amp;#39;s not a professional family portrait or anything close to that. It&amp;#39;s just a picture that my wife, Breanne, took with the selfie camera on her phone. They&amp;#39;re in the car, on a Saturday afternoon, in between errands they were running while I was at work.\nThe kids are in the back seats, making silly faces. The twins, Ryleigh and Jimmy are pushing together on either side of their younger brother, Manny. Ryleigh must have been jumping in her seat because her long, curly hair looks like it&amp;#39;s floating. Manny is using his fingers to make circle-shaped glasses over his eyes, and Jimmy is making that awful silly-face that his mother just can&amp;#39;t stand. And Breanne, in the driver&amp;#39;s seat, holding the phone, is wearing her sunglasses and smirking, as if to say &amp;quot;...really?&amp;quot; I loved the picture so much, I decided to print it, frame it, and hang it in the hallway so I could see it every day. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve missed them so much. &lt;/p&gt;\n\n&lt;p&gt;And I love them. More than anything or anyone I&amp;#39;ve ever loved before in my life. But as much as I love them, they drive me crazy sometimes. I mean, they really know how to push my buttons. I&amp;#39;m already a light sleeper, as it is. The smallest sounds wake me up in the middle of a deep sleep: creaking floor, dog barking down the street, A/C turning on, or birds chirping outside. It doesn&amp;#39;t take much noise to wake me up. And, boy-oh-boy, does this family make noise. &lt;/p&gt;\n\n&lt;p&gt;Jimmy kicks the wall in his sleep, Ryleigh  sleep walks around the house,  and Manny has no comprehension of opening or closing doors quietly. And their voices only have one volume setting: max. Then there is Breanne, who, although she tries, is just not a very quiet morning person. I&amp;#39;m fact, she&amp;#39;s just as loud as the kids most days. And of course, our little Maltese is a barker. He barks at the smallest sounds throughout the night and refuses to go outside to do his business until I&amp;#39;m finally in a good sleep. &lt;/p&gt;\n\n&lt;p&gt;Now, typically, this wouldn&amp;#39;t be that big of a problem. And I don&amp;#39;t make an issue out of it. I just deal with it and sleep when I can. Unfortunately, though, my job frequently has me working odd hours. From midnight shifts to weekends and the occasional holiday. And let me tell you, getting a good night&amp;#39;s sleep makes a world of difference when you&amp;#39;re working six 12-hour shifts in a row. Likewise, lack of sleep makes a world of difference. &lt;/p&gt;\n\n&lt;p&gt;You can imagine my astonishment after a co-worker turned me onto sleeping with earplugs. As simple as it sounds, I had never thought of it before. At first, the silence was a little unnerving, but it blew my mind how a cheap package of foam pegs could change my life. With the help of those ear plugs, I was getting full nights (or days, depending on my schedule) of sleep. The kids didn&amp;#39;t wake me, my wife didn&amp;#39;t wake me, and my dog didn&amp;#39;t wake me. Apparently, without being able to hear, I am a pretty hard guy to wake up! On Christmas morning, I woke up to the kids jumping on top of me in the bed. Breanne said they had been shaking me and laughing at how they could move my arms around and I didn&amp;#39;t even budge. Thanks to the ear plugs, I didn&amp;#39;t have to worry about my beautiful, noisy family waking me up. &lt;/p&gt;\n\n&lt;p&gt;Now, I wish I could hear their voices just one more time. &lt;/p&gt;\n\n&lt;p&gt;Four weeks. That&amp;#39;s how long it has been since that night. I was on a relatively normal working schedule, so I was sleeping next to Breanne. As per usual, my ear plugs were in and I was getting the peaceful sleep I had coveted for so long. Still, something stirred me to wake in the middle of the night. I was on my left side, facing the window. The room-darkening curtains let next to zero light in. There is a street light outside that is just far enough away to be visible from my pillow. As bright as it was, the curtains made it look like a dimly glowing orb in the sky. The silence was calming. I slowly turned over to face my wife. It was too dark to see, but I could feel the heat coming off her. I put my arm around her, but something felt off. She moved her hand too mine and held it for just a moment. I thought to myself, she must be laying in an awkward position. The thought left my mind and I drifted back off to sleep.&lt;/p&gt;\n\n&lt;p&gt;When I awoke the next morning, I felt wet. It was still too dark for me to see much in the room, but there was an awful stench. I took my earplugs out and was surprised by the silence. The dog wasn’t barking, the children weren’t laughing or running through the house, and Breanne was still sleeping silently. She was laying perfectly still. Too still. I reached over and touched her arm. She was wet and sticky. Startled, I jumped back in the bed and reached over to my lamp and turned it on. I screamed when I saw the sheets soaked black with blood. I, too, was covered in my wife’s blood. I scrambled over to her and turned her body over to face me. Her throat was slit open all the way across and her dead eyes gazed into the air. I shouted and cried, crawled off the bed, and ran to check on the children. Blood trailed from our room all throughout the house. In each of their beds, I found their lifeless bodies. Their throats had been cut just like their mother’s. There was a bloody hand print across each of their faces. After finding Manny, the youngest, I fell to the floor in a fetal position and cried. I wanted to wake up from this nightmare. I didn’t believe it could be real. But it was.&lt;/p&gt;\n\n&lt;p&gt;I picked myself up and left Manny’s room. I noticed a bloody lump on the floor at the end of the hallway. It was our little dog. His head had been twisted completely around and his body had been butterflied open. The feeling in my stomach was so painful, so sickening. I wanted to vomit it out, but I couldn’t. I moved back into my bedroom and picked up my phone and called 911.&lt;/p&gt;\n\n&lt;p&gt;The police were brutal. I was treated like a monster. But I didn’t blame them. For few days, I even thought that maybe I was guilty. During one of the last interrogations, I even asked if I could get the death sentence in a plea deal. I wanted to die and be with my family. But before I could give my confession, the FBI intervened. &lt;/p&gt;\n\n&lt;p&gt;It wasn’t me, they said. They told me that they have been tracking the killer for months. They&amp;#39;d finally gotten some hard evidence, they said. They were close to him. They found a cache of VHS tapes the killer had left behind. He recorded the murders with an old VHS camcorder. It was the same M.O. with all the murders,  they said. He kills the pets and children first because they make the most noise. Then he sets up the camcorder before killing the mother, covering her mouth with one hand and slicing open her throat. The movement and noises wake up the father, but the killer is always anticipating it. &lt;/p&gt;\n\n&lt;p&gt;But something went wrong at my house that night. I was the first survivor. &lt;/p&gt;\n\n&lt;p&gt;They showed me part of the tape. Positioned at the foot of the bed, I saw him on top of my wife, cutting her open. Then he sat still and watched me sleep. I hadn&amp;#39;t heard anything, I hadn&amp;#39;t woken up. &lt;/p&gt;\n\n&lt;p&gt;Then he laid down on top of my wife. I watched my body begin to stir, but he remained motionless. I saw my arm lift up and over on top of him. I remembered holding her hand that night. But it wasn&amp;#39;t hers, it was the killer&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if they&amp;#39;ll catch the killer, and I don&amp;#39;t care anymore. I only want to be with the family in that photo on the wall. As I type these final words, my hands are shaking, and my eyes are bouncing between the photo and my pistol. I&amp;#39;m leaving this place to be with my family. I can hear them laughing and playing. The dog is barking and Breanne is calling for me. I&amp;#39;m going to an eternal sleep. No earplugs necessary. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have a beautiful family. I really do. Every time I look at this picture hanging in the hallway, that's all I think. Wow, what a good looking family. It's not a professional family portrait or anything close to that. It's just a picture that my wife, Breanne, took with the selfie camera on her phone. They're in the car, on a Saturday afternoon, in between errands they were running while I was at work.\nThe kids are in the back seats, making silly faces. The twins, Ryleigh and Jimmy are pushing together on either side of their younger brother, Manny. Ryleigh must have been jumping in her seat because her long, curly hair looks like it's floating. Manny is using his fingers to make circle-shaped glasses over his eyes, and Jimmy is making that awful silly-face that his mother just can't stand. And Breanne, in the driver's seat, holding the phone, is wearing her sunglasses and smirking, as if to say \"...really?\" I loved the picture so much, I decided to print it, frame it, and hang it in the hallway so I could see it every day. \n\nI've missed them so much. \n\nAnd I love them. More than anything or anyone I've ever loved before in my life. But as much as I love them, they drive me crazy sometimes. I mean, they really know how to push my buttons. I'm already a light sleeper, as it is. The smallest sounds wake me up in the middle of a deep sleep: creaking floor, dog barking down the street, A/C turning on, or birds chirping outside. It doesn't take much noise to wake me up. And, boy-oh-boy, does this family make noise. \n\nJimmy kicks the wall in his sleep, Ryleigh  sleep walks around the house,  and Manny has no comprehension of opening or closing doors quietly. And their voices only have one volume setting: max. Then there is Breanne, who, although she tries, is just not a very quiet morning person. I'm fact, she's just as loud as the kids most days. And of course, our little Maltese is a barker. He barks at the smallest sounds throughout the night and refuses to go outside to do his business until I'm finally in a good sleep. \n\nNow, typically, this wouldn't be that big of a problem. And I don't make an issue out of it. I just deal with it and sleep when I can. Unfortunately, though, my job frequently has me working odd hours. From midnight shifts to weekends and the occasional holiday. And let me tell you, getting a good night's sleep makes a world of difference when you're working six 12-hour shifts in a row. Likewise, lack of sleep makes a world of difference. \n\nYou can imagine my astonishment after a co-worker turned me onto sleeping with earplugs. As simple as it sounds, I had never thought of it before. At first, the silence was a little unnerving, but it blew my mind how a cheap package of foam pegs could change my life. With the help of those ear plugs, I was getting full nights (or days, depending on my schedule) of sleep. The kids didn't wake me, my wife didn't wake me, and my dog didn't wake me. Apparently, without being able to hear, I am a pretty hard guy to wake up! On Christmas morning, I woke up to the kids jumping on top of me in the bed. Breanne said they had been shaking me and laughing at how they could move my arms around and I didn't even budge. Thanks to the ear plugs, I didn't have to worry about my beautiful, noisy family waking me up. \n\nNow, I wish I could hear their voices just one more time. \n\nFour weeks. That's how long it has been since that night. I was on a relatively normal working schedule, so I was sleeping next to Breanne. As per usual, my ear plugs were in and I was getting the peaceful sleep I had coveted for so long. Still, something stirred me to wake in the middle of the night. I was on my left side, facing the window. The room-darkening curtains let next to zero light in. There is a street light outside that is just far enough away to be visible from my pillow. As bright as it was, the curtains made it look like a dimly glowing orb in the sky. The silence was calming. I slowly turned over to face my wife. It was too dark to see, but I could feel the heat coming off her. I put my arm around her, but something felt off. She moved her hand too mine and held it for just a moment. I thought to myself, she must be laying in an awkward position. The thought left my mind and I drifted back off to sleep.\n\nWhen I awoke the next morning, I felt wet. It was still too dark for me to see much in the room, but there was an awful stench. I took my earplugs out and was surprised by the silence. The dog wasn’t barking, the children weren’t laughing or running through the house, and Breanne was still sleeping silently. She was laying perfectly still. Too still. I reached over and touched her arm. She was wet and sticky. Startled, I jumped back in the bed and reached over to my lamp and turned it on. I screamed when I saw the sheets soaked black with blood. I, too, was covered in my wife’s blood. I scrambled over to her and turned her body over to face me. Her throat was slit open all the way across and her dead eyes gazed into the air. I shouted and cried, crawled off the bed, and ran to check on the children. Blood trailed from our room all throughout the house. In each of their beds, I found their lifeless bodies. Their throats had been cut just like their mother’s. There was a bloody hand print across each of their faces. After finding Manny, the youngest, I fell to the floor in a fetal position and cried. I wanted to wake up from this nightmare. I didn’t believe it could be real. But it was.\n\nI picked myself up and left Manny’s room. I noticed a bloody lump on the floor at the end of the hallway. It was our little dog. His head had been twisted completely around and his body had been butterflied open. The feeling in my stomach was so painful, so sickening. I wanted to vomit it out, but I couldn’t. I moved back into my bedroom and picked up my phone and called 911.\n\nThe police were brutal. I was treated like a monster. But I didn’t blame them. For few days, I even thought that maybe I was guilty. During one of the last interrogations, I even asked if I could get the death sentence in a plea deal. I wanted to die and be with my family. But before I could give my confession, the FBI intervened. \n\nIt wasn’t me, they said. They told me that they have been tracking the killer for months. They'd finally gotten some hard evidence, they said. They were close to him. They found a cache of VHS tapes the killer had left behind. He recorded the murders with an old VHS camcorder. It was the same M.O. with all the murders,  they said. He kills the pets and children first because they make the most noise. Then he sets up the camcorder before killing the mother, covering her mouth with one hand and slicing open her throat. The movement and noises wake up the father, but the killer is always anticipating it. \n\nBut something went wrong at my house that night. I was the first survivor. \n\nThey showed me part of the tape. Positioned at the foot of the bed, I saw him on top of my wife, cutting her open. Then he sat still and watched me sleep. I hadn't heard anything, I hadn't woken up. \n\nThen he laid down on top of my wife. I watched my body begin to stir, but he remained motionless. I saw my arm lift up and over on top of him. I remembered holding her hand that night. But it wasn't hers, it was the killer's.\n\nI don't know if they'll catch the killer, and I don't care anymore. I only want to be with the family in that photo on the wall. As I type these final words, my hands are shaking, and my eyes are bouncing between the photo and my pistol. I'm leaving this place to be with my family. I can hear them laughing and playing. The dog is barking and Breanne is calling for me. I'm going to an eternal sleep. No earplugs necessary. \n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65euxo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 520, "report_reasons": null, "author": "Johnysway", "saved": false, "mod_reports": [], "name": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65euxo/sleeping_with_earplugs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492229019.0, "url": "https://www.reddit.com/r/nosleep/comments/65euxo/sleeping_with_earplugs/", "author_flair_text": null, "quarantine": false, "title": "Sleeping with earplugs", "created_utc": 1492200219.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 520}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9vjid", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Captainsteve345", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Hope you find your peace OP! They'll get him and avenge you and all the others who's lives he's destroyed!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hope you find your peace OP! They&amp;#39;ll get him and avenge you and all the others who&amp;#39;s lives he&amp;#39;s destroyed!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9vjid", "score_hidden": false, "stickied": false, "created": 1492238517.0, "created_utc": 1492209717.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgac5ff", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CollatrlDamage", "parent_id": "t1_dg9vqrz", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Or preferably, dies on the way in", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or preferably, dies on the way in&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgac5ff", "score_hidden": false, "stickied": false, "created": 1492262996.0, "created_utc": 1492234196.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vqrz", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "benderose", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm very sorry for what happened. It wasn't your fault, i hope that killer rots in jail. You didn't deserve this, and neither did your family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very sorry for what happened. It wasn&amp;#39;t your fault, i hope that killer rots in jail. You didn&amp;#39;t deserve this, and neither did your family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9vqrz", "score_hidden": false, "stickied": false, "created": 1492238791.0, "created_utc": 1492209991.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dga4p9x", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "corporateavenger", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Please don't sir. That's not what your family would want. There's other ways sir... Trust me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please don&amp;#39;t sir. That&amp;#39;s not what your family would want. There&amp;#39;s other ways sir... Trust me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga4p9x", "score_hidden": false, "stickied": false, "created": 1492250879.0, "created_utc": 1492222079.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgabxtk", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SweetSue67", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "My father refused to wear earplugs, for this reason, i tried to convince him, for months, when we moved next to the train tracks. After dicovering the bodies of my aunt, and my cousins, he won't ever let himself sleep deeply enough that someone coming into the house, while he's sleeping, won't wake him up.\n\nAs you can imagine, being a teenager trying to come in quietly, late at night, it was inconvenient, but it did make me feel safe to know that he would always hear if someone were trying to get in the house.\n\nI'm so very sorry, OP. I hope your eternal rest is peaceful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My father refused to wear earplugs, for this reason, i tried to convince him, for months, when we moved next to the train tracks. After dicovering the bodies of my aunt, and my cousins, he won&amp;#39;t ever let himself sleep deeply enough that someone coming into the house, while he&amp;#39;s sleeping, won&amp;#39;t wake him up.&lt;/p&gt;\n\n&lt;p&gt;As you can imagine, being a teenager trying to come in quietly, late at night, it was inconvenient, but it did make me feel safe to know that he would always hear if someone were trying to get in the house.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so very sorry, OP. I hope your eternal rest is peaceful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgabxtk", "score_hidden": false, "stickied": false, "created": 1492262570.0, "created_utc": 1492233770.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgaetof", "gilded": 0, "archived": false, "score": -16, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dga1hmx", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaetof", "score_hidden": false, "stickied": false, "created": 1492269112.0, "created_utc": 1492240312.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -16}}], "after": null, "before": null}}, "user_reports": [], "id": "dga1hmx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Kellymargaret", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This made my stomach hurt! I'm sorry this evil took your beautiful, noisy family. It is a terrifying example of appreciating what you have. I do hope you find peace!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This made my stomach hurt! I&amp;#39;m sorry this evil took your beautiful, noisy family. It is a terrifying example of appreciating what you have. I do hope you find peace!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga1hmx", "score_hidden": false, "stickied": false, "created": 1492246437.0, "created_utc": 1492217637.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dga780s", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RZRHED", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Every father's worse nightmare.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Every father&amp;#39;s worse nightmare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga780s", "score_hidden": false, "stickied": false, "created": 1492254540.0, "created_utc": 1492225740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dga8l6n", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MickeyG42", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "And now I can't wear earplugs at night anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And now I can&amp;#39;t wear earplugs at night anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga8l6n", "score_hidden": false, "stickied": false, "created": 1492256701.0, "created_utc": 1492227901.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgacy69", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "made-of-bees", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm the lightest sleeper ever and my wife snores, but unfortunately due to chronic ear infections as a kid I have malformed ears (on the inside, they look normal as long as you aren't poking around inside) and ear plugs don't stay in, they just fall right out. I've tried all brands, from genetic Walgreens to what musicians use on stage (my dad used to tour before I was born, he showed me what to buy) and they just pop right out. I also have sensory processing disorder and misophonia, so getting to sleep can be a real problem.\n\n...suddenly I don't mind so much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m the lightest sleeper ever and my wife snores, but unfortunately due to chronic ear infections as a kid I have malformed ears (on the inside, they look normal as long as you aren&amp;#39;t poking around inside) and ear plugs don&amp;#39;t stay in, they just fall right out. I&amp;#39;ve tried all brands, from genetic Walgreens to what musicians use on stage (my dad used to tour before I was born, he showed me what to buy) and they just pop right out. I also have sensory processing disorder and misophonia, so getting to sleep can be a real problem.&lt;/p&gt;\n\n&lt;p&gt;...suddenly I don&amp;#39;t mind so much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgacy69", "score_hidden": false, "stickied": false, "created": 1492264703.0, "created_utc": 1492235903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgaugg2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ReddSwabian", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I thought the whole time it was the co-worker who recommended the ear plugs to OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought the whole time it was the co-worker who recommended the ear plugs to OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaugg2", "score_hidden": false, "stickied": false, "created": 1492302999.0, "created_utc": 1492274199.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgauuwj", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "hunkules_mulliguns", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I hope you reach your family and the lives of those you loved are avenged. What a sick, sick man, I truly hope he is found and punished adequately. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you reach your family and the lives of those you loved are avenged. What a sick, sick man, I truly hope he is found and punished adequately. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgauuwj", "score_hidden": false, "stickied": false, "created": 1492303574.0, "created_utc": 1492274774.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgaenvh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "NookFin", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Those must have been some amazing ear plugs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those must have been some amazing ear plugs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaenvh", "score_hidden": false, "stickied": false, "created": 1492268699.0, "created_utc": 1492239899.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dga9i7p", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zahhirsinsuat", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Its Frankkk!!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its Frankkk!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga9i7p", "score_hidden": false, "stickied": false, "created": 1492258211.0, "created_utc": 1492229411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgaer0e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cece75", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm so sorry OP. I will definitely think twice tonight before putting my earplugs in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry OP. I will definitely think twice tonight before putting my earplugs in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaer0e", "score_hidden": false, "stickied": false, "created": 1492268919.0, "created_utc": 1492240119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dga9z8x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "joaquin55", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Hope you and your family come back as ghosts and get your revenge!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hope you and your family come back as ghosts and get your revenge!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga9z8x", "score_hidden": false, "stickied": false, "created": 1492259031.0, "created_utc": 1492230231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dgczbl4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pondboy121", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Please don't kill yourself. I would feel really bad if you did. Even so I have full hope that your family's killer is caught ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please don&amp;#39;t kill yourself. I would feel really bad if you did. Even so I have full hope that your family&amp;#39;s killer is caught &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgczbl4", "score_hidden": false, "stickied": false, "created": 1492425215.0, "created_utc": 1492396415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65euxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9zo7o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "StevenwxyzGames", "parent_id": "t3_65euxo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm always worried about this. I don't wake up for anything, sound or being shaken....this could easily happen to my wife.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m always worried about this. I don&amp;#39;t wake up for anything, sound or being shaken....this could easily happen to my wife.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9zo7o", "score_hidden": false, "stickied": false, "created": 1492244016.0, "created_utc": 1492215216.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]