[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My grandmother said that I should always be careful of everything I say, especially when I am angry, because words have power and once that power is unleashed, it cannot be reeled back. How does the old saying go? &amp;quot;Stick and stones may break my bones, but words will never hurt me&amp;quot;? Total bullshit.&lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t a popular girl in high school. I was a short, skinny, black-haired girl who kept to myself in a school where the gods and goddesses were the dancers, singers, and theater kids. It was a performing arts school and I was there not because I wanted to be in front of spotlight, but behind it. My art was stagecraft and that was everything from creating sets, setting up lights and audio, and assisting with makeup and costumes. In the school totem pole, I&amp;#39;m just right below the orchestra kids, but above the Yearbook, Newspaper, and Photography kids. No one really liked the photography kids too much because they always smelled like vinegar and never stopped creeping around the campus with a camera pressed to their faces.&lt;/p&gt;\n\n&lt;p&gt;What set me apart from the other burnouts and losers in my high school was that I was pretty. Really pretty. I had a heart-shaped face with big green eyes and pink full lips. I also had the delicate, vulnerability thing that guys go crazy for, like I was this helpless, little fluffy bunny who needed a big, strong warrior to protect me. My friend Melissa always says that I am a Japanese animation character come to life. I&amp;#39;m not trying to brag or anything--and really, it&amp;#39;s nothing to brag about--but I used to have high school boys follow me around, bothering me for a date or my phone number. And it wasn&amp;#39;t just my schoolmates. My male teachers gave me looks that made me feel uncomfortable, too. But that was before the &lt;em&gt;Incident&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;After a few occurrences during lunch when a girl would accuse me of stealing her man and try to fight me, I began to avoid the lunch arena. I was really tired of having my brown bag snatched from me and thrown into the trash. I started to hang out in the library at lunch in between the stacks of philosophy and literature. You&amp;#39;re not really allowed to eat in the library, but I was a really good student and often helped out the librarian in my spare time, so she gave me special permission. I also told her I was being bullied and she sympathized with me because her kid Howard, who played the oboe, was also bullied. &lt;/p&gt;\n\n&lt;p&gt;There wasn&amp;#39;t anything I could do to protect myself in between walking to classes, so I was often shoved to the wall, tripped, had my hair pulled, and called all sorts of colorful names synonymous to trollop. &amp;quot;I don&amp;#39;t understand why you won&amp;#39;t just tell your counselor about this,&amp;quot; my friend Kirsten said one day as we were walking to Pre-Calculus. &amp;quot;In a normal high school, you would be one of the most popular girls because you&amp;#39;re a total Heather.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Kirsten was chubby and always wore black. Her hair was naturally blond, but she dyed it black though it had been a while since she had done a touch-up because she had about two inches of grow-out. She also wore horn-rimmed glasses and had a cute button nose. She usually hung out with the goth kids and the kids who listened to metal and industrial. I really liked her. She was surprisingly shy and kind. &amp;quot;Oh, fuck off, I&amp;#39;m Veronica and you know it,&amp;quot; I replied with a smirk. &amp;quot;Am I blond and blue-eyed? Am I in a cheerleader&amp;#39;s uniform?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Kirsten began to tell me about the book she had just finished reading, which was about dragons and different families and factions fighting to control a kingdom. Whenever Kirsten talked about a book she loved, her face lit up and she almost looked pretty. I was so absorbed with what she was saying that I didn&amp;#39;t notice that I was about to walk into a girl who hated my guts. She could have stepped aside to avoid me, but instead, she went full speed ahead and collided into me, bringing up her hands so she could shove me on the chest. I wasn&amp;#39;t paying attention, so I lost my balance and landed on my ass. The impact shot up a bolt of pain from my butt to the back of my head. Everyone who witnessed my fall laughed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Skank,&amp;quot; Alice Hernandez hissed next to my ear, before she continued walking on with her minions who were giggling and high-fiving each other.&lt;/p&gt;\n\n&lt;p&gt;A torrent of rage surged through me like a wildfire. I wanted to fly after her and tackle her to the ground to pull her hair out of her scalp. I wanted to yank her eyeballs out. I wanted to pull her tongue out and strangle her with it. But instead I closed my eyes and took a deep breath, releasing it in a shuddering exhale. The bitch was not worth it.&lt;/p&gt;\n\n&lt;p&gt;Kirsten pulled me up to my feet and briskly brushed my back with the flat of her hand. &amp;quot;God, what&amp;#39;s her problem? You should really tell Mr. Martinez about her. I caught her smoking in the bathroom with her stupid friends yesterday, you know.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Mr. Martinez was the assistant dean of students. I rolled my eyes. Though she didn&amp;#39;t look it, Kirsten was a total square and always aghast when she saw her fellow students do &amp;quot;bad&amp;quot; things. I have met her parents. They were beautiful, clean-cut, upper middle-class TV Land people. Kirsten would insist she was the bad sheep, but her loving mother would just say that Kirsten was an artist and thus, allowed to express herself in eccentric ways.  &amp;quot;Michael Rivers has been texting me and following me around. We&amp;#39;re partnered for a project in Chemistry, so we&amp;#39;ve had to talk outside of class. Naturally, Alice thinks I want her braindead jock boyfriend.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That was a regular day. For the most part I was left alone, since I mostly kept to myself and hung out with the kids who spent their entire high school years flying under the radar. Sure, I got glares and dirty looks. Some girls whispered about me and called me names as I walked by. I got pushed and shoved and tripped. I received nasty text messages and voice mails. At least twice a month, a girl would corner me in the bathroom, shove me against the wall, and screech at me to stay away from her man or she would tear my eyes out. These occurrences became pretty routine. I used become enraged and plot revenge against these girls and fantasize about killing them, but that got to be exhausting, and soon my attitude fell along the lines of, &amp;quot;Come at me. Get in line.&amp;quot; I think the fact that I was so indifferent about it infuriated some of the girls even more. &lt;/p&gt;\n\n&lt;p&gt;There were only a few more months before graduation. I only had to hold on for just a little bit longer. I had gotten accepted to my number one school of choice, Brown, which meant I was going to be moving out of state. I was super excited. I had never lived outside of California before and even though I was a little nervous about leaving the house I lived in with my parents, I was thrilled, too, because I was finally going to get away from the petty, little sandbox that had trapped me for years. I was going to have a new life.&lt;/p&gt;\n\n&lt;p&gt;Just a few more months... all I had to do was to lay low. I should have realized that it was not going to be that easy. There was a boy named Keith Anderson who really, really liked me. He was cute and smart and I kind of liked him back, but I wasn&amp;#39;t really interested in getting involved with anyone since we were about to graduate and I was going to spend the summer on a cross country road trip with my cousins. I also knew that Keith Anderson was dating Aphrodite Wilson until recently and they had been together since the ninth grade. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t get intimidated by anyone in school, but Aphrodite was a different breed of girl. She was beautiful, smart, president of the student body, and rumor had it that she got into Harvard on early admission. Most importantly, she wasn&amp;#39;t an asshole. But I heard her break-up with Keith really changed her. She&amp;#39;d always strutted around campus with an extra bounce in her step, a confident girl with shiny brown hair, blue eyes, and sparkling, white teeth. Most of the boys in school worshipped her from afar. She was the goddess of beauty and love. But after the break-up, Aphrodite really went through a radical physical change. She started coming to school dressed in jeans and a hoodie, with no makeup, even though she was the trendsetter and the fashion diva of the campus. She always used to have a smile and a wave for everyone she passed in the hallways, but now she walked around with a perma-bitch face and a don&amp;#39;t-fuck-with-me attitude. She was even sarcastic and rude to the teachers. &lt;/p&gt;\n\n&lt;p&gt;Before all this, she and I had always been friendly with each other, though we were never exactly friends. But one day, as I was heading to my French class, she plowed into me with her shoulder like she meant to knock me down and kept on walking. There was pure hatred in her eyes as she targeted me. I staggered against my friend Kirsten who just shook her head and sighed. &amp;quot;Does she even know you blew off Keith when he asked you out?&amp;quot; she demanded.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;She probably heard that I blew Keith and asked him out,&amp;quot; I muttered, blinking back the tears that sprung to my eyes. I thought I didn&amp;#39;t care anymore that people in this school hated my guts, but to have the nicest girl in school want to kick my ass was just too much. &amp;quot;Ugh, I don&amp;#39;t feel like going to class anymore. Do you want to ditch?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Kirsten&amp;#39;s eyes widened. &amp;quot;Julie, we have a big vocabulary test in French today.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I closed my eyes and had to laugh. I was grateful to have Kirsten as a friend. &amp;quot;All right. Come on, nerdling.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Kirsten and I lived a block from each other, so we always walked home together. Most of the time, we had sleepovers. Either she would sleep over at my house or I would sleep over at hers. Of course everyone in school think we&amp;#39;re lesbians who are dating and scissoring each other every night. High school gossip is really stupid and contradictory. How could I both be a lesbian and an insatiable man-eating whore? That night&amp;#39;s sleepover was at my house. I had a full-sized bed, but Kirsten always brought a sleeping bag and slept on the floor. Usually we spent the night watching horror movies and eating junk food. Sometimes, we invented personalities and chatted up strangers in chat rooms, both coming up with increasingly ridiculous things to say. When we got bored of that, we scrolled through the Myspace pages of our classmates and schoolmates, making fun of people&amp;#39;s posted thoughts and poems. I didn&amp;#39;t have a Myspace page of my own, but that night, we found one that I supposedly created. It had a bunch of pictures of me and journal entries that I supposedly wrote, talking about going out and having sex with all of these boys from school. I was horrified. Who had made this page? I couldn&amp;#39;t even cry, I was so shocked. I&amp;#39;d stayed quiet and kept my head down throughout my entire high school years, but enough was enough. I emailed the Myspace administrators to take down the page because I had not created it and spent all night crying. &lt;/p&gt;\n\n&lt;p&gt;Thankfully, the next day was a Saturday, so I didn&amp;#39;t have to face anyone from school. Kirsten tried to cheer me up, but there was no use. I was sick of being bullied and not getting any payback. I had never told Kirsten, but I used to have really violent and gory dreams about killing my tormentors, especially on the days when the bullying was pretty bad. If Kirsten knew that I had used Alice Hernandez as target for my archery practice in my dreams, she would probably be really upset. I even had a dream that had me going to school with assault rifles and gunning down all my tormentors one by one, while laughing maniacally. Instead of being horrified about this as soon as I woke up, I found myself fairly happy about it. Those dreams comforted me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Do you still want to go Kate O&amp;#39;Brien&amp;#39;s party tonight?&amp;quot; Kirsten asked, not looking at me. I knew she wanted to go, but out of solidarity, she would&amp;#39;t go if I didn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Kate O&amp;#39;Brien was a really nice girl who was friends with everyone at school, losers and popular kids alike. She just didn&amp;#39;t have a bad word to say about anybody. And she was as beautiful on the outside as she was on the inside. It was a big deal to be invited to one of Kate&amp;#39;s parties because her parents were really rich so they lived in a giant house on the other side of town and they had a large swimming pool. On top of that, her parties were usually catered, so the food was always pretty good. Not that it was very hard to get an invitation to Kate&amp;#39;s parties. Like I said, Kate was friends with everyone and everyone she was friends with was welcome to her house. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t know,&amp;quot; I replied, yanking up some of the grass I was sitting on and flinging it away. We were sitting in my backyard, hanging out and watching over my younger siblings. &lt;/p&gt;\n\n&lt;p&gt;My parents were out running errands, so the little jerks were left to me. My brother Alex received a microscope and a biology set for his birthday, so he and my other little brothers are exploring the yard and looking for gross things to study under the microscope. Alex was eleven, Jack was eight, and Henry was six. After giving birth to me, Mom decided to go to grad school before having Alex, so that&amp;#39;s why he and I are almost seven years apart. I often wondered who would watch over them once I was away at college. Gee, my folks would have to shell out cash for a real babysitter. Or start hauling the little jerks around.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Skylar and the rest of the gang are going to be there,&amp;quot; said Kirsten. She was French-braiding my hair on one side of my head; she had separated the other half in a side ponytail to be worked on after. &amp;quot;You know the happy, shiny kids are scared of them because they think they worship the devil or something.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I rolled my eyes. &amp;quot;That&amp;#39;s so stupid.&amp;quot; But I did like the idea of showing up to Kate&amp;#39;s party with my posse of goth kids that everyone in school thought were devil worshippers. I&amp;#39;d always liked Skylar and her friends. They were smart and funny and the most well-read people I&amp;#39;d ever met. &amp;quot;And the food is always good, I guess. And there&amp;#39;s bound to be booze, since Kate&amp;#39;s parents are out of town.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;What else was I going to do with my Saturday night except mope around and watch TV when the rest of my friends were out partying with the entire school? I wasn&amp;#39;t much of a party person, but I knew if I stayed home, my parents were likely to stick me with the boys, and go out themselves.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I guess I&amp;#39;ll go,&amp;quot; I said with a sigh. &amp;quot;I have nothing better to do tonight.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;And really, I should have stayed home because if I had, maybe Aphrodite Wilson would still be alive and nobody would be calling me a witch or a murderer.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;The party started out pretty tame. When my crew and I got there, there were only about twenty or so kids so far and the vibe was easygoing. Most of the kids were in the pool already, while some were standing around by the buffet tables, filling up their plates with food. Kate approached me as soon as I walked in and pulled me aside. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey, I&amp;#39;m really happy you&amp;#39;re here tonight, Julie,&amp;quot; she said in an almost whisper. &amp;quot;I just want to warn you that Aphrodite is going to be here too and she hasn&amp;#39;t been doing well with the whole Keith thing and she kind of...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hates my ass, I know,&amp;quot; I finished for her, feeling this uneasy lump settle in my stomach. &amp;quot;I&amp;#39;ll stay out of her way. Don&amp;#39;t worry, there won&amp;#39;t be a rumble in your party. Is it okay if we stake out the gazebo as our spot for the evening?&amp;quot; The gazebo was off to the side of the pool and a little hidden by some brush. It was decorated with strings of lights all over and looked really pretty at night.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Absolutely.&amp;quot; Kate looked relieved and gave me a hug. &amp;quot;I&amp;#39;ll casually let everyone know that&amp;#39;s your territory.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Jesus, I thought as I walked back to my friends. You&amp;#39;d think this shit was the West Side Story. Skylar, whose long, black hair was streaked with pink locks slung her arm around my neck, while I sought out Kirsten&amp;#39;s hand with my own. It felt good to have backup. There were eight of us. Five girls who shopped at Hot Topic and three emo boys who looked like they were members of My Chemical Romance. We headed for the gazebo, which I told them was going to be our base for the evening.&lt;/p&gt;\n\n&lt;p&gt;The first half of the evening was pretty fun. My friends and I got food and booze, which we brought back to the gazebo, and we ate and drank while talking about horror movies, our favorite subject. It felt like we had our own little party. Kate stopped by everyone once and a bit and socialized with us. Skylar told me that Kate was probably happy that she managed to corral the pale goth freaks in one corner.  I agreed with her, but didn&amp;#39;t say anything. &lt;/p&gt;\n\n&lt;p&gt;It was the second half evening when everything turned to shit. First of all, it started to rain and Kate was super bummed because she had checked the weather forecast and there was supposed to be no chance of rain tonight. Most people went inside, but the people in the swimming pool stayed and hung out, since the water was nice and heated. My tribe stayed in the gazebo because it was bound to be packed inside Kate&amp;#39;s house and we already had a roof over our heads. &lt;/p&gt;\n\n&lt;p&gt;It was turning out to be a pretty good night and I was glad I had come out because I sometimes forget that I had more friends besides Kirsten and that I was going to miss them when I moved out of state for college.&lt;/p&gt;\n\n&lt;p&gt;All of a sudden, there was a change in the atmosphere. Though it was raining, the wind was warm and seemed to crackle with electricity. I was talking to Skylar about the road trip I was going to be making with my cousins over the summer, when she raised her eyebrows and nudged her head, indicating there was someone behind me. It was Keith Anderson. He looked really cute tonight and when he smiled, dimples popped at both sides of his cheeks.&lt;/p&gt;\n\n&lt;p&gt;Instead of excitement, I had this terrible feeling of dread, like some shit is going to go down. I had to get rid of the guy before anyone saw him hanging out around me and told Aphrodite. I promised Kate there wouldn&amp;#39;t be any drama. &amp;quot;Hey, Keith,&amp;quot; I said warily. &amp;quot;Can you... go somewhere else right now? I don&amp;#39;t want any drama tonight and there will definitely be one if your ex-girlfriend sees you with me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Keith had his hands in the pockets of his jacket and the look on his face was resolute. “That’s her problem, Julie. She and I are over. I want to get to know you. I want to be with you.”&lt;/p&gt;\n\n&lt;p&gt;I had never really had a boyfriend before and this was really nice to hear. I was always really involved with my books and studying. The social aspect of my life just wasn’t that important to me. “Keith, look, I like you, too…” Over his shoulder, I could see a group of girls exiting Kate’s house through the sliding door to return to pool party. One of them was Aphrodite. “This is just not a good idea, okay? I just don’t—“&lt;/p&gt;\n\n&lt;p&gt;“You skanky bitch!” &lt;/p&gt;\n\n&lt;p&gt;The screech directed at me was full of venom and hatred. Aphrodite’s eyes were narrowed with malice, but tears were rolling down her cheeks as she strode toward me with her posse. Keith caught her before she could launch herself at me. I had never faced so much anger, never mind that it was one directed at me. Her fingers were curled into claws and she was kicking and spitting at me. I was almost fascinated by it. Here was a person considered to be a “good girl” by everyone at school completely unhinged and losing her shit over a boy. She was a crazy, hysterical mess that Keith could barely control and Keith was a big guy. He played football and was on the wrestling team. &lt;/p&gt;\n\n&lt;p&gt;I had Skylar and Kirsten holding me back. I was furious. I was having a great time with my friends and this bitch had to ruin it with some petty high school shit that I didn’t even care about. I was sick of it. I wanted to tear her apart and choke her with her own hair. I wanted to punch her nose in and keep punching until her face was an unrecognizable pulp. \nShe just kept screaming at me. “You fucking whore! Everyone knows you’ve slept with every guy at school! You dirty bitch! I’m going to kill you!”&lt;/p&gt;\n\n&lt;p&gt;Me, I was beyond words. My mind was a maelstrom of fury and loathing, pent up from all the years I told myself to suck it up and walk away. I was seeing red. I wanted to grab the nearby beer bottle and break it so I could stab her over and over with it. I wanted to pluck her eyeballs out and smash them under my feet. And the anger felt good. It was a surge of energy that was exhilarating, nothing that I’ve ever felt before. I really wanted to kill the bitch. &lt;/p&gt;\n\n&lt;p&gt;“Come on, Di, she’s not worth it,” one of her friends said, trying to pull her away. &lt;/p&gt;\n\n&lt;p&gt;Kate herself had come out and was standing between us. She was looking at me with disappointment and I was outraged. I didn’t start this shit. She went up to Aphrodite and talked to her in soft tones, consoling her and steering her toward the house. It looked like Kate was going to succeed. Aphrodite was still crying and simpering about what a slutty whore I was, but she was allowing Kate to lead her in. Keith remained where he was standing before the drama started and I stared at him in disbelief.&lt;/p&gt;\n\n&lt;p&gt;“Dude, are you crazy?” I demanded. “This you and me thing ain’t gonna happen. Did you see that shit? I can’t deal with that. I don’t want to deal with it.”&lt;/p&gt;\n\n&lt;p&gt;Keith looked at me sadly for a long moment, then he nodded and walked away. I turned to my friends, dragging my hand through my hair. “Goddamn it, this is why I hate these parties. People always want to fight over the pettiest shit. I need a drink.”&lt;/p&gt;\n\n&lt;p&gt;A girl named Rachel, who had red and black hair, took my hand and said, “I’ll go with you. You might need backup, you know. And I’ve been itching for a good fight for years. If I could take down a Barbie doll tonight, that will make up for the shit I suffered from ninth grade on.”&lt;/p&gt;\n\n&lt;p&gt;I chuckled dryly and we left the gazebo to walk to the other side of the pool where Kate had a giant keg and a couple of coolers filled with different kinds of beer. I had zero warning. I wasn’t even thinking about Keith and Aphrodite anymore. Which was why I was caught off balance when this force came at me from the side and shoved me into the pool. It was the shallower end, so my head hit the floor and almost knocked me out. Since it was a head wound, it bled profusely and the kids that were in the water freaked out and noped the fuck out of there. &lt;/p&gt;\n\n&lt;p&gt;I looked up and saw Aphrodite standing with Kate by the railing and she looked horrified. Her hands were covering her mouth and she was in tears. She was saying, “I’m sorry, I’m sorry, I’m sorry.”&lt;/p&gt;\n\n&lt;p&gt;Someone tossed me a towel which I pressed to my head. “My brother can drive you to the hospital,” said Kate. “We can’t really call the ambulance here, with all the alcohol and stuff.”&lt;/p&gt;\n\n&lt;p&gt;I didn’t really care about that shit, though. I was staring at Aphrodite with disgust. If you’re going to do some damage, own it. You can’t stab someone, realize you did a bad thing, and say, “I’m sorry.” You have to commit to what you did. Kirsten and Skylar came into the pool to help me out. Even Aphrodite held out a hand to pull me out of the water, but I just glared at her. I looked at her as though she was a piece of shit. And then I said, “Drop dead, you stupid bitch.”&lt;/p&gt;\n\n&lt;p&gt;There wasn’t a bolt of lightning or a crack of thunder after I said those words. They were just words.&lt;/p&gt;\n\n&lt;p&gt;It wasn’t until I was out of the pool that I fell to my knees and lost consciousness.&lt;/p&gt;\n\n&lt;p&gt;When I woke up, I was in the hospital and my mom was sitting next to me. She smiled when I opened my eyes. “It’s about time,” she said. “Your friends are here. I’ll get you something to eat from the cafeteria. Do you want some chocolate pudding?”&lt;/p&gt;\n\n&lt;p&gt;My visitors were Kirsten, Skylar, and Rachel, and they all looked paler than usual and pretty terrible, like they haven’t had a good night’s sleep in a couple of days. None of them could look me in the eyes and no one spoke up immediately as they came up to the side of my bed. It was kind of creepy. &lt;/p&gt;\n\n&lt;p&gt;“What?” I demanded, sensing that something was wrong.&lt;/p&gt;\n\n&lt;p&gt;It was Skylar who answered. She looked like she’d been crying. “Aphrodite, Michelle Sanders, April Chang, and Melanie Tanaka are dead.”&lt;/p&gt;\n\n&lt;p&gt;You know that sickly feeling you get when you tilt back too much in your chair and you fall, the seconds just before the crash? &lt;em&gt;The “I’m gonna die” feeling?&lt;/em&gt; I suddenly had that times a hundred. I couldn’t believe what I was hearing. Skylar had to be joking. “What the fuck are you talking about?”&lt;/p&gt;\n\n&lt;p&gt;“On the night of Kate’s party,” said Kirsten. “They were driving home in the rain when the semi in front of them lost control and flipped over, crushing them.”&lt;/p&gt;\n\n&lt;p&gt;My last words to Aphrodite reverberated in my ears. &lt;em&gt;Drop dead, you stupid bitch.&lt;/em&gt; No way. It was just a coincidence. I had nothing to do with their deaths. But it didn’t feel that way. I turned my head to the side opposite my friends and vomited. What the fuck. I say “Drop dead” and four people die? I searched my memories to see if there was any other time in my life that I’d said those words. Shit, I’m sure I said them lots of times in elementary school. I covered my face with my hands, feeling the bandage that covered my temple. &lt;/p&gt;\n\n&lt;p&gt;“It’s not your fault, Julie,” said my best friend Kirsten. “You said those words in the heat of the moment. They had nothing to do with the accident. It was raining, Aphrodite had been drinking, and she couldn’t have avoided that truck even if she were sober.”&lt;/p&gt;\n\n&lt;p&gt;“But four people are dead,” I said numbly. &lt;/p&gt;\n\n&lt;p&gt;“And you had nothing to do with it,” Rachel insisted. “For God’s sake, you probably had a concussion when you said those words. And it’s not like you tampered with their car or anything!”&lt;/p&gt;\n\n&lt;p&gt;But the rest of the school didn’t see it that way. My reputation, which wasn’t all that great to begin with, tanked even lower. For weeks, the landline at my parents’ house rang nonstop and every time we picked up the phone, it would be some asshole shouting “Killer” or “Witch” before slamming the phone down. It got so bad that my parents had to change their number. I sank into deep depression and didn’t want to go to school anymore. Why would I? In the hallways, kids would call me a murderer or say things like, “Burn the witch!” But I told myself that I had to persevere and I wasn’t going to let these losers keep me down. I resolved to put up with it even after my car got vandalized and my tires were shredded into ribbons. &lt;/p&gt;\n\n&lt;p&gt;One time, one of Aphrodite’s friends got in my face and I just…snapped. I grabbed her by the throat and shoved her against the wall. “If I really am a witch who could kill people with just words, why the hell would you mess with me? Are you stupid?” After I let her go, she looked at me like I was the devil incarnate and ran down the hallway. That did nothing to fix my reputation.&lt;/p&gt;\n\n&lt;p&gt;On the day of graduation, Aphrodite Wilson and the others received honorary high school diplomas and their parents walked across the stage to receive them. People cheered and gave them standing ovations, which I thought was kind of weird. What did their children accomplish but die? When it was my turn to receive my diploma, there were boos and jeers and taunts of “killer” and I was ashamed because my family, including my brothers, were in the audience. &lt;/p&gt;\n\n&lt;p&gt;My mother told me later that another parent had asked her why they were calling me a killer. Without missing a beat, my mother replied, “Oh, she’s the salutatorian. She absolutely killed the curve.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My grandmother said that I should always be careful of everything I say, especially when I am angry, because words have power and once that power is unleashed, it cannot be reeled back. How does the old saying go? \"Stick and stones may break my bones, but words will never hurt me\"? Total bullshit.\n\nI wasn't a popular girl in high school. I was a short, skinny, black-haired girl who kept to myself in a school where the gods and goddesses were the dancers, singers, and theater kids. It was a performing arts school and I was there not because I wanted to be in front of spotlight, but behind it. My art was stagecraft and that was everything from creating sets, setting up lights and audio, and assisting with makeup and costumes. In the school totem pole, I'm just right below the orchestra kids, but above the Yearbook, Newspaper, and Photography kids. No one really liked the photography kids too much because they always smelled like vinegar and never stopped creeping around the campus with a camera pressed to their faces.\n\nWhat set me apart from the other burnouts and losers in my high school was that I was pretty. Really pretty. I had a heart-shaped face with big green eyes and pink full lips. I also had the delicate, vulnerability thing that guys go crazy for, like I was this helpless, little fluffy bunny who needed a big, strong warrior to protect me. My friend Melissa always says that I am a Japanese animation character come to life. I'm not trying to brag or anything--and really, it's nothing to brag about--but I used to have high school boys follow me around, bothering me for a date or my phone number. And it wasn't just my schoolmates. My male teachers gave me looks that made me feel uncomfortable, too. But that was before the *Incident*. \n\nAfter a few occurrences during lunch when a girl would accuse me of stealing her man and try to fight me, I began to avoid the lunch arena. I was really tired of having my brown bag snatched from me and thrown into the trash. I started to hang out in the library at lunch in between the stacks of philosophy and literature. You're not really allowed to eat in the library, but I was a really good student and often helped out the librarian in my spare time, so she gave me special permission. I also told her I was being bullied and she sympathized with me because her kid Howard, who played the oboe, was also bullied. \n\nThere wasn't anything I could do to protect myself in between walking to classes, so I was often shoved to the wall, tripped, had my hair pulled, and called all sorts of colorful names synonymous to trollop. \"I don't understand why you won't just tell your counselor about this,\" my friend Kirsten said one day as we were walking to Pre-Calculus. \"In a normal high school, you would be one of the most popular girls because you're a total Heather.\"\n\nKirsten was chubby and always wore black. Her hair was naturally blond, but she dyed it black though it had been a while since she had done a touch-up because she had about two inches of grow-out. She also wore horn-rimmed glasses and had a cute button nose. She usually hung out with the goth kids and the kids who listened to metal and industrial. I really liked her. She was surprisingly shy and kind. \"Oh, fuck off, I'm Veronica and you know it,\" I replied with a smirk. \"Am I blond and blue-eyed? Am I in a cheerleader's uniform?\"\n\nKirsten began to tell me about the book she had just finished reading, which was about dragons and different families and factions fighting to control a kingdom. Whenever Kirsten talked about a book she loved, her face lit up and she almost looked pretty. I was so absorbed with what she was saying that I didn't notice that I was about to walk into a girl who hated my guts. She could have stepped aside to avoid me, but instead, she went full speed ahead and collided into me, bringing up her hands so she could shove me on the chest. I wasn't paying attention, so I lost my balance and landed on my ass. The impact shot up a bolt of pain from my butt to the back of my head. Everyone who witnessed my fall laughed.\n\n\"Skank,\" Alice Hernandez hissed next to my ear, before she continued walking on with her minions who were giggling and high-fiving each other.\n\nA torrent of rage surged through me like a wildfire. I wanted to fly after her and tackle her to the ground to pull her hair out of her scalp. I wanted to yank her eyeballs out. I wanted to pull her tongue out and strangle her with it. But instead I closed my eyes and took a deep breath, releasing it in a shuddering exhale. The bitch was not worth it.\n\nKirsten pulled me up to my feet and briskly brushed my back with the flat of her hand. \"God, what's her problem? You should really tell Mr. Martinez about her. I caught her smoking in the bathroom with her stupid friends yesterday, you know.\"\n\nMr. Martinez was the assistant dean of students. I rolled my eyes. Though she didn't look it, Kirsten was a total square and always aghast when she saw her fellow students do \"bad\" things. I have met her parents. They were beautiful, clean-cut, upper middle-class TV Land people. Kirsten would insist she was the bad sheep, but her loving mother would just say that Kirsten was an artist and thus, allowed to express herself in eccentric ways.  \"Michael Rivers has been texting me and following me around. We're partnered for a project in Chemistry, so we've had to talk outside of class. Naturally, Alice thinks I want her braindead jock boyfriend.\"\n\nThat was a regular day. For the most part I was left alone, since I mostly kept to myself and hung out with the kids who spent their entire high school years flying under the radar. Sure, I got glares and dirty looks. Some girls whispered about me and called me names as I walked by. I got pushed and shoved and tripped. I received nasty text messages and voice mails. At least twice a month, a girl would corner me in the bathroom, shove me against the wall, and screech at me to stay away from her man or she would tear my eyes out. These occurrences became pretty routine. I used become enraged and plot revenge against these girls and fantasize about killing them, but that got to be exhausting, and soon my attitude fell along the lines of, \"Come at me. Get in line.\" I think the fact that I was so indifferent about it infuriated some of the girls even more. \n\nThere were only a few more months before graduation. I only had to hold on for just a little bit longer. I had gotten accepted to my number one school of choice, Brown, which meant I was going to be moving out of state. I was super excited. I had never lived outside of California before and even though I was a little nervous about leaving the house I lived in with my parents, I was thrilled, too, because I was finally going to get away from the petty, little sandbox that had trapped me for years. I was going to have a new life.\n\nJust a few more months... all I had to do was to lay low. I should have realized that it was not going to be that easy. There was a boy named Keith Anderson who really, really liked me. He was cute and smart and I kind of liked him back, but I wasn't really interested in getting involved with anyone since we were about to graduate and I was going to spend the summer on a cross country road trip with my cousins. I also knew that Keith Anderson was dating Aphrodite Wilson until recently and they had been together since the ninth grade. \n\nI didn't get intimidated by anyone in school, but Aphrodite was a different breed of girl. She was beautiful, smart, president of the student body, and rumor had it that she got into Harvard on early admission. Most importantly, she wasn't an asshole. But I heard her break-up with Keith really changed her. She'd always strutted around campus with an extra bounce in her step, a confident girl with shiny brown hair, blue eyes, and sparkling, white teeth. Most of the boys in school worshipped her from afar. She was the goddess of beauty and love. But after the break-up, Aphrodite really went through a radical physical change. She started coming to school dressed in jeans and a hoodie, with no makeup, even though she was the trendsetter and the fashion diva of the campus. She always used to have a smile and a wave for everyone she passed in the hallways, but now she walked around with a perma-bitch face and a don't-fuck-with-me attitude. She was even sarcastic and rude to the teachers. \n\nBefore all this, she and I had always been friendly with each other, though we were never exactly friends. But one day, as I was heading to my French class, she plowed into me with her shoulder like she meant to knock me down and kept on walking. There was pure hatred in her eyes as she targeted me. I staggered against my friend Kirsten who just shook her head and sighed. \"Does she even know you blew off Keith when he asked you out?\" she demanded.\n\n\"She probably heard that I blew Keith and asked him out,\" I muttered, blinking back the tears that sprung to my eyes. I thought I didn't care anymore that people in this school hated my guts, but to have the nicest girl in school want to kick my ass was just too much. \"Ugh, I don't feel like going to class anymore. Do you want to ditch?\"\n\nKirsten's eyes widened. \"Julie, we have a big vocabulary test in French today.\"\n\nI closed my eyes and had to laugh. I was grateful to have Kirsten as a friend. \"All right. Come on, nerdling.\"\n\nKirsten and I lived a block from each other, so we always walked home together. Most of the time, we had sleepovers. Either she would sleep over at my house or I would sleep over at hers. Of course everyone in school think we're lesbians who are dating and scissoring each other every night. High school gossip is really stupid and contradictory. How could I both be a lesbian and an insatiable man-eating whore? That night's sleepover was at my house. I had a full-sized bed, but Kirsten always brought a sleeping bag and slept on the floor. Usually we spent the night watching horror movies and eating junk food. Sometimes, we invented personalities and chatted up strangers in chat rooms, both coming up with increasingly ridiculous things to say. When we got bored of that, we scrolled through the Myspace pages of our classmates and schoolmates, making fun of people's posted thoughts and poems. I didn't have a Myspace page of my own, but that night, we found one that I supposedly created. It had a bunch of pictures of me and journal entries that I supposedly wrote, talking about going out and having sex with all of these boys from school. I was horrified. Who had made this page? I couldn't even cry, I was so shocked. I'd stayed quiet and kept my head down throughout my entire high school years, but enough was enough. I emailed the Myspace administrators to take down the page because I had not created it and spent all night crying. \n\nThankfully, the next day was a Saturday, so I didn't have to face anyone from school. Kirsten tried to cheer me up, but there was no use. I was sick of being bullied and not getting any payback. I had never told Kirsten, but I used to have really violent and gory dreams about killing my tormentors, especially on the days when the bullying was pretty bad. If Kirsten knew that I had used Alice Hernandez as target for my archery practice in my dreams, she would probably be really upset. I even had a dream that had me going to school with assault rifles and gunning down all my tormentors one by one, while laughing maniacally. Instead of being horrified about this as soon as I woke up, I found myself fairly happy about it. Those dreams comforted me. \n\n\"Do you still want to go Kate O'Brien's party tonight?\" Kirsten asked, not looking at me. I knew she wanted to go, but out of solidarity, she would't go if I didn't. \n\nKate O'Brien was a really nice girl who was friends with everyone at school, losers and popular kids alike. She just didn't have a bad word to say about anybody. And she was as beautiful on the outside as she was on the inside. It was a big deal to be invited to one of Kate's parties because her parents were really rich so they lived in a giant house on the other side of town and they had a large swimming pool. On top of that, her parties were usually catered, so the food was always pretty good. Not that it was very hard to get an invitation to Kate's parties. Like I said, Kate was friends with everyone and everyone she was friends with was welcome to her house. \n\n\"I don't know,\" I replied, yanking up some of the grass I was sitting on and flinging it away. We were sitting in my backyard, hanging out and watching over my younger siblings. \n\nMy parents were out running errands, so the little jerks were left to me. My brother Alex received a microscope and a biology set for his birthday, so he and my other little brothers are exploring the yard and looking for gross things to study under the microscope. Alex was eleven, Jack was eight, and Henry was six. After giving birth to me, Mom decided to go to grad school before having Alex, so that's why he and I are almost seven years apart. I often wondered who would watch over them once I was away at college. Gee, my folks would have to shell out cash for a real babysitter. Or start hauling the little jerks around.\n\n\"Skylar and the rest of the gang are going to be there,\" said Kirsten. She was French-braiding my hair on one side of my head; she had separated the other half in a side ponytail to be worked on after. \"You know the happy, shiny kids are scared of them because they think they worship the devil or something.\"\n\nI rolled my eyes. \"That's so stupid.\" But I did like the idea of showing up to Kate's party with my posse of goth kids that everyone in school thought were devil worshippers. I'd always liked Skylar and her friends. They were smart and funny and the most well-read people I'd ever met. \"And the food is always good, I guess. And there's bound to be booze, since Kate's parents are out of town.\"\n\nWhat else was I going to do with my Saturday night except mope around and watch TV when the rest of my friends were out partying with the entire school? I wasn't much of a party person, but I knew if I stayed home, my parents were likely to stick me with the boys, and go out themselves.\n\n\"I guess I'll go,\" I said with a sigh. \"I have nothing better to do tonight.\"\n\n*And really, I should have stayed home because if I had, maybe Aphrodite Wilson would still be alive and nobody would be calling me a witch or a murderer.* \n\nThe party started out pretty tame. When my crew and I got there, there were only about twenty or so kids so far and the vibe was easygoing. Most of the kids were in the pool already, while some were standing around by the buffet tables, filling up their plates with food. Kate approached me as soon as I walked in and pulled me aside. \n\n\"Hey, I'm really happy you're here tonight, Julie,\" she said in an almost whisper. \"I just want to warn you that Aphrodite is going to be here too and she hasn't been doing well with the whole Keith thing and she kind of...\"\n\n\"Hates my ass, I know,\" I finished for her, feeling this uneasy lump settle in my stomach. \"I'll stay out of her way. Don't worry, there won't be a rumble in your party. Is it okay if we stake out the gazebo as our spot for the evening?\" The gazebo was off to the side of the pool and a little hidden by some brush. It was decorated with strings of lights all over and looked really pretty at night.\n\n\"Absolutely.\" Kate looked relieved and gave me a hug. \"I'll casually let everyone know that's your territory.\"\n\nJesus, I thought as I walked back to my friends. You'd think this shit was the West Side Story. Skylar, whose long, black hair was streaked with pink locks slung her arm around my neck, while I sought out Kirsten's hand with my own. It felt good to have backup. There were eight of us. Five girls who shopped at Hot Topic and three emo boys who looked like they were members of My Chemical Romance. We headed for the gazebo, which I told them was going to be our base for the evening.\n\nThe first half of the evening was pretty fun. My friends and I got food and booze, which we brought back to the gazebo, and we ate and drank while talking about horror movies, our favorite subject. It felt like we had our own little party. Kate stopped by everyone once and a bit and socialized with us. Skylar told me that Kate was probably happy that she managed to corral the pale goth freaks in one corner.  I agreed with her, but didn't say anything. \n\nIt was the second half evening when everything turned to shit. First of all, it started to rain and Kate was super bummed because she had checked the weather forecast and there was supposed to be no chance of rain tonight. Most people went inside, but the people in the swimming pool stayed and hung out, since the water was nice and heated. My tribe stayed in the gazebo because it was bound to be packed inside Kate's house and we already had a roof over our heads. \n\nIt was turning out to be a pretty good night and I was glad I had come out because I sometimes forget that I had more friends besides Kirsten and that I was going to miss them when I moved out of state for college.\n\nAll of a sudden, there was a change in the atmosphere. Though it was raining, the wind was warm and seemed to crackle with electricity. I was talking to Skylar about the road trip I was going to be making with my cousins over the summer, when she raised her eyebrows and nudged her head, indicating there was someone behind me. It was Keith Anderson. He looked really cute tonight and when he smiled, dimples popped at both sides of his cheeks.\n\nInstead of excitement, I had this terrible feeling of dread, like some shit is going to go down. I had to get rid of the guy before anyone saw him hanging out around me and told Aphrodite. I promised Kate there wouldn't be any drama. \"Hey, Keith,\" I said warily. \"Can you... go somewhere else right now? I don't want any drama tonight and there will definitely be one if your ex-girlfriend sees you with me.\"\n\nKeith had his hands in the pockets of his jacket and the look on his face was resolute. “That’s her problem, Julie. She and I are over. I want to get to know you. I want to be with you.”\n\nI had never really had a boyfriend before and this was really nice to hear. I was always really involved with my books and studying. The social aspect of my life just wasn’t that important to me. “Keith, look, I like you, too…” Over his shoulder, I could see a group of girls exiting Kate’s house through the sliding door to return to pool party. One of them was Aphrodite. “This is just not a good idea, okay? I just don’t—“\n\n“You skanky bitch!” \n\nThe screech directed at me was full of venom and hatred. Aphrodite’s eyes were narrowed with malice, but tears were rolling down her cheeks as she strode toward me with her posse. Keith caught her before she could launch herself at me. I had never faced so much anger, never mind that it was one directed at me. Her fingers were curled into claws and she was kicking and spitting at me. I was almost fascinated by it. Here was a person considered to be a “good girl” by everyone at school completely unhinged and losing her shit over a boy. She was a crazy, hysterical mess that Keith could barely control and Keith was a big guy. He played football and was on the wrestling team. \n\nI had Skylar and Kirsten holding me back. I was furious. I was having a great time with my friends and this bitch had to ruin it with some petty high school shit that I didn’t even care about. I was sick of it. I wanted to tear her apart and choke her with her own hair. I wanted to punch her nose in and keep punching until her face was an unrecognizable pulp. \nShe just kept screaming at me. “You fucking whore! Everyone knows you’ve slept with every guy at school! You dirty bitch! I’m going to kill you!”\n\nMe, I was beyond words. My mind was a maelstrom of fury and loathing, pent up from all the years I told myself to suck it up and walk away. I was seeing red. I wanted to grab the nearby beer bottle and break it so I could stab her over and over with it. I wanted to pluck her eyeballs out and smash them under my feet. And the anger felt good. It was a surge of energy that was exhilarating, nothing that I’ve ever felt before. I really wanted to kill the bitch. \n\n“Come on, Di, she’s not worth it,” one of her friends said, trying to pull her away. \n\nKate herself had come out and was standing between us. She was looking at me with disappointment and I was outraged. I didn’t start this shit. She went up to Aphrodite and talked to her in soft tones, consoling her and steering her toward the house. It looked like Kate was going to succeed. Aphrodite was still crying and simpering about what a slutty whore I was, but she was allowing Kate to lead her in. Keith remained where he was standing before the drama started and I stared at him in disbelief.\n\n“Dude, are you crazy?” I demanded. “This you and me thing ain’t gonna happen. Did you see that shit? I can’t deal with that. I don’t want to deal with it.”\n\nKeith looked at me sadly for a long moment, then he nodded and walked away. I turned to my friends, dragging my hand through my hair. “Goddamn it, this is why I hate these parties. People always want to fight over the pettiest shit. I need a drink.”\n\nA girl named Rachel, who had red and black hair, took my hand and said, “I’ll go with you. You might need backup, you know. And I’ve been itching for a good fight for years. If I could take down a Barbie doll tonight, that will make up for the shit I suffered from ninth grade on.”\n\nI chuckled dryly and we left the gazebo to walk to the other side of the pool where Kate had a giant keg and a couple of coolers filled with different kinds of beer. I had zero warning. I wasn’t even thinking about Keith and Aphrodite anymore. Which was why I was caught off balance when this force came at me from the side and shoved me into the pool. It was the shallower end, so my head hit the floor and almost knocked me out. Since it was a head wound, it bled profusely and the kids that were in the water freaked out and noped the fuck out of there. \n\nI looked up and saw Aphrodite standing with Kate by the railing and she looked horrified. Her hands were covering her mouth and she was in tears. She was saying, “I’m sorry, I’m sorry, I’m sorry.”\n\nSomeone tossed me a towel which I pressed to my head. “My brother can drive you to the hospital,” said Kate. “We can’t really call the ambulance here, with all the alcohol and stuff.”\n\nI didn’t really care about that shit, though. I was staring at Aphrodite with disgust. If you’re going to do some damage, own it. You can’t stab someone, realize you did a bad thing, and say, “I’m sorry.” You have to commit to what you did. Kirsten and Skylar came into the pool to help me out. Even Aphrodite held out a hand to pull me out of the water, but I just glared at her. I looked at her as though she was a piece of shit. And then I said, “Drop dead, you stupid bitch.”\n\nThere wasn’t a bolt of lightning or a crack of thunder after I said those words. They were just words.\n\nIt wasn’t until I was out of the pool that I fell to my knees and lost consciousness.\n\nWhen I woke up, I was in the hospital and my mom was sitting next to me. She smiled when I opened my eyes. “It’s about time,” she said. “Your friends are here. I’ll get you something to eat from the cafeteria. Do you want some chocolate pudding?”\n\nMy visitors were Kirsten, Skylar, and Rachel, and they all looked paler than usual and pretty terrible, like they haven’t had a good night’s sleep in a couple of days. None of them could look me in the eyes and no one spoke up immediately as they came up to the side of my bed. It was kind of creepy. \n\n“What?” I demanded, sensing that something was wrong.\n\nIt was Skylar who answered. She looked like she’d been crying. “Aphrodite, Michelle Sanders, April Chang, and Melanie Tanaka are dead.”\n\nYou know that sickly feeling you get when you tilt back too much in your chair and you fall, the seconds just before the crash? *The “I’m gonna die” feeling?* I suddenly had that times a hundred. I couldn’t believe what I was hearing. Skylar had to be joking. “What the fuck are you talking about?”\n\n“On the night of Kate’s party,” said Kirsten. “They were driving home in the rain when the semi in front of them lost control and flipped over, crushing them.”\n\nMy last words to Aphrodite reverberated in my ears. *Drop dead, you stupid bitch.* No way. It was just a coincidence. I had nothing to do with their deaths. But it didn’t feel that way. I turned my head to the side opposite my friends and vomited. What the fuck. I say “Drop dead” and four people die? I searched my memories to see if there was any other time in my life that I’d said those words. Shit, I’m sure I said them lots of times in elementary school. I covered my face with my hands, feeling the bandage that covered my temple. \n\n“It’s not your fault, Julie,” said my best friend Kirsten. “You said those words in the heat of the moment. They had nothing to do with the accident. It was raining, Aphrodite had been drinking, and she couldn’t have avoided that truck even if she were sober.”\n\n“But four people are dead,” I said numbly. \n\n“And you had nothing to do with it,” Rachel insisted. “For God’s sake, you probably had a concussion when you said those words. And it’s not like you tampered with their car or anything!”\n\nBut the rest of the school didn’t see it that way. My reputation, which wasn’t all that great to begin with, tanked even lower. For weeks, the landline at my parents’ house rang nonstop and every time we picked up the phone, it would be some asshole shouting “Killer” or “Witch” before slamming the phone down. It got so bad that my parents had to change their number. I sank into deep depression and didn’t want to go to school anymore. Why would I? In the hallways, kids would call me a murderer or say things like, “Burn the witch!” But I told myself that I had to persevere and I wasn’t going to let these losers keep me down. I resolved to put up with it even after my car got vandalized and my tires were shredded into ribbons. \n\nOne time, one of Aphrodite’s friends got in my face and I just…snapped. I grabbed her by the throat and shoved her against the wall. “If I really am a witch who could kill people with just words, why the hell would you mess with me? Are you stupid?” After I let her go, she looked at me like I was the devil incarnate and ran down the hallway. That did nothing to fix my reputation.\n\nOn the day of graduation, Aphrodite Wilson and the others received honorary high school diplomas and their parents walked across the stage to receive them. People cheered and gave them standing ovations, which I thought was kind of weird. What did their children accomplish but die? When it was my turn to receive my diploma, there were boos and jeers and taunts of “killer” and I was ashamed because my family, including my brothers, were in the audience. \n\nMy mother told me later that another parent had asked her why they were calling me a killer. Without missing a beat, my mother replied, “Oh, she’s the salutatorian. She absolutely killed the curve.”\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Graphic Violence", "id": "65exqm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 113, "report_reasons": null, "author": "Screwlost", "saved": false, "mod_reports": [], "name": "t3_65exqm", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": "flair-trigger", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65exqm/words_i_cant_take_back/", "num_reports": null, "locked": false, "stickied": false, "created": 1492229800.0, "url": "https://www.reddit.com/r/nosleep/comments/65exqm/words_i_cant_take_back/", "author_flair_text": null, "quarantine": false, "title": "Words I Can't Take Back", "created_utc": 1492201000.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 113}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": "", "user_reports": [], "id": "dgafc9e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "inicxvii22", "parent_id": "t1_dg9yr9t", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You should write about that also OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should write about that also OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgafc9e", "score_hidden": false, "stickied": false, "created": 1492270460.0, "created_utc": 1492241660.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": "", "user_reports": [], "id": "dgb473o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kiradax", "parent_id": "t1_dg9yr9t", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "If you feel up to writing about those, I'm sure we'd all like to read about it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you feel up to writing about those, I&amp;#39;m sure we&amp;#39;d all like to read about it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb473o", "score_hidden": false, "stickied": false, "created": 1492316249.0, "created_utc": 1492287449.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9yr9t", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Screwlost", "parent_id": "t1_dg9ygpd", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "They got better. There were two more incidents in college that made me suspect there might be something to my \"words,\" but my therapist told me it's all a coincidence. Nevertheless, I've become more careful with what I say these days. Silence is golden, after all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They got better. There were two more incidents in college that made me suspect there might be something to my &amp;quot;words,&amp;quot; but my therapist told me it&amp;#39;s all a coincidence. Nevertheless, I&amp;#39;ve become more careful with what I say these days. Silence is golden, after all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9yr9t", "score_hidden": false, "stickied": false, "created": 1492242792.0, "created_utc": 1492213992.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ygpd", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ThePest179", "parent_id": "t3_65exqm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This reminds me of the time Waylon Jennings said to Buddy Holly, in a joking manner, \"I hope your plane crashes\". To Jennings's horror, the plane actually did crash. \n\nI hope things get better for you after graduation OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This reminds me of the time Waylon Jennings said to Buddy Holly, in a joking manner, &amp;quot;I hope your plane crashes&amp;quot;. To Jennings&amp;#39;s horror, the plane actually did crash. &lt;/p&gt;\n\n&lt;p&gt;I hope things get better for you after graduation OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9ygpd", "score_hidden": false, "stickied": false, "created": 1492242397.0, "created_utc": 1492213597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": "", "user_reports": [], "id": "dgabog3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "joaquin55", "parent_id": "t1_dga757l", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"Sometimes\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Sometimes&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgabog3", "score_hidden": false, "stickied": false, "created": 1492262065.0, "created_utc": 1492233265.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dga757l", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Watsuwifi", "parent_id": "t3_65exqm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Dont worry OP we all dream of killing everyone in our class sometimes I think", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dont worry OP we all dream of killing everyone in our class sometimes I think&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga757l", "score_hidden": false, "stickied": false, "created": 1492254417.0, "created_utc": 1492225617.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": "", "user_reports": [], "id": "dgafqf5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FrancrieMancrie", "parent_id": "t3_65exqm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's such a badass mother you have there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s such a badass mother you have there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgafqf5", "score_hidden": false, "stickied": false, "created": 1492271540.0, "created_utc": 1492242740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65exqm", "likes": null, "replies": "", "user_reports": [], "id": "dgavz78", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NaraSumas", "parent_id": "t3_65exqm", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"Most of the time, we had sleepovers. Either she would sleep over at my house or I would sleep over at hers.\"\n\nThanks for clearing that up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Most of the time, we had sleepovers. Either she would sleep over at my house or I would sleep over at hers.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Thanks for clearing that up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgavz78", "score_hidden": false, "stickied": false, "created": 1492305116.0, "created_utc": 1492276316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]