[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Part 1: &lt;a href=\"https://redd.it/5xsk1h\"&gt;https://redd.it/5xsk1h&lt;/a&gt; \nPart 2: &lt;a href=\"https://redd.it/5z9hjx\"&gt;https://redd.it/5z9hjx&lt;/a&gt;\nPart 3: &lt;a href=\"https://redd.it/60vdz7\"&gt;https://redd.it/60vdz7&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The first thing I noticed was Ledovsky’s face, the only familiar feature in the bizarre scene before me. He was young, blonde, and probably handsome once; but now his face was distorted, like a newspaper-ink image stretched across silly putty. Black tendrils swarmed around the edges of his face, sticking to the skin, tugging at his ears, wrapping around strands of hair and pulling him backwards into the dark mass behind. He tried to speak, his mouth opening and closing like a dying fish, but the invading tendrils squirmed around his lips and snaked down his throat, and all that came out was a sickening gurgle.&lt;/p&gt;\n\n&lt;p&gt;One orange clad arm also protruded from the dark writhing mass, and his gloved hand gripped the radio transmitter. As I watched, a dozen black vines wormed their way around his wrist and hand, creeping like spilled liquid before tightening like sinew, peeling his fingers from the microphone one by one until it floated freely in the microgravity of the space station. The piercing sound cut off abruptly, the hot drill in my brain shut off, and the mission control room was bathed in a terrible silence as we watched Ledovsky’s arm submerge into darkness.&lt;/p&gt;\n\n&lt;p&gt;His shifting eyes were the last thing I saw; bulging brown irises filled with grim determination one moment, unspeakable horror the next, and then suddenly dead and glassy as he finally let go and surrendered to the void. Ledovsky disappeared, absorbed into the squirming darkness behind him. With nothing human left to hold my focus, I had no choice but to turn my attention to the rest of that macabre scene. &lt;/p&gt;\n\n&lt;p&gt;The space Ledovsky had occupied just a moment ago was now filled with a grotesque and faceless monstrosity. It looked like a floating ball of liquid mercury, three feet wide and three feet tall, but blacker than the darkest night. Its surface seemed to constantly squirm and shift, and it shimmered with rainbow iridescence, like an oil slick on a rain puddle. At least eight thick tentacle-like appendages extended from its central mass, each wrapped around computer terminals, door handles, ceiling hooks, and other equipment to keep itself in place in the station’s microgravity. All over its surface smaller tendrils appeared and disappeared, wiggling and curling in on themselves.&lt;/p&gt;\n\n&lt;p&gt;Behind the creature that had once been Ledovsky loomed three exact duplicates, each devoid of any discernible face. The background was a tangled mess of floating tentacles, weaving through one another and twisted around each other like spaghetti noodles; some attached to equipment in the room, others gripping the first creature; as if laying hands upon the shoulders of a troubled friend. &lt;/p&gt;\n\n&lt;p&gt;Suddenly all four creatures moved as one, squirming squid-like around one another, and spreading into a line across the capsule. With a jerk, their attention seemed to snap to the camera in the terminal, though without faces it was hard to tell for sure. The scene froze like that for a horrifying moment and I peeled my eyes from the screen. The Roscosmos mission control room was still and silent, each person petrified in place like a statue, slack jawed, with eyes locked on the main screen.&lt;/p&gt;\n\n&lt;p&gt;I turned my attention back to the video feed, and now the core of each creature was bubbling, boiling, churning like the waters of a maelstrom. The center of each opened into a tiny white hole which quickly grew in size, expanding to cover most of the creatures’ ‘bodies’. Then, stretching and twisting, each of the holes transformed into a shape I recognized all too well.&lt;/p&gt;\n\n&lt;p&gt;A smile.&lt;/p&gt;\n\n&lt;p&gt;No eyes, no ears, no nose, no face; just enormous empty inhuman smiles.&lt;/p&gt;\n\n&lt;p&gt;Then the noise was back, but this time I wasn’t hearing it; I was feeling it. It was inside of me, inside my head, and it was coming from them, from their smiles. It was coming from The Smiling Ones.&lt;/p&gt;\n\n&lt;p&gt;I tried to look away, but I couldn’t; my body felt completely paralyzed. Their smiles were growing. The sound was rising, screeching in my head like the billion swarming wings of a demonic locust plague. The drill in my head switched back on, but now the torque was turned up to the highest setting and was joined by the thrum of a jackhammer breaking concrete. It felt like the two hemispheres of my brain were being torn apart. I could smell burning electrical wires and taste copper in my mouth.&lt;/p&gt;\n\n&lt;p&gt;In my peripheral vision I saw a flurry of movement. The men and women around me, the pride of the Roscosmos State Corporation for Space Activities, were hurting themselves. Some slammed their faces into their desks over and over again until blood poured from broken noses and shattered mouths. Some picked up pens and pencils and violently stabbed themselves deep in the ear canal, then pounded them further in with palms of their hands. Others gouged their eyes or sawed at their wrists with any sharp object they could find.&lt;/p&gt;\n\n&lt;p&gt;Then everything faded away until my entire world was a white hot ball of pain and I lost consciousness.&lt;/p&gt;\n\n&lt;p&gt;My eyes snapped back open, and I stared at the screen. The smiling ones were gone, and in their place were four small grey humanoid aliens with buggy black eyes. In my head I heard four distinct voices speaking together:&lt;/p&gt;\n\n&lt;p&gt;LET US IN.&lt;/p&gt;\n\n&lt;p&gt;My vision went dark and I was gone.&lt;/p&gt;\n\n&lt;p&gt;Then I was back. Now four giant bipedal lizards appeared on screen, oozing dark green slime like sweat, black venom dripped from their jaws. Their reptilian eyes stared into my soul and their voices shrieked in my mind.&lt;/p&gt;\n\n&lt;p&gt;LET US IN.&lt;/p&gt;\n\n&lt;p&gt;The tenebrous veil of unconsciousness folded around me once again.&lt;/p&gt;\n\n&lt;p&gt;Then I was back. Now four angelic beings floated on the screen, translucent, but gleaming like the sun around the edges and draped in flowing gowns of a million impossible hues. Their beautiful voices sang a harmony in my head.&lt;/p&gt;\n\n&lt;p&gt;LET US IN.&lt;/p&gt;\n\n&lt;p&gt;The scrim of shadow fell upon me once more and I was gone.&lt;/p&gt;\n\n&lt;p&gt;Then I was back. Now the the inside of the space station was an alien forest filled with a swirling fog of green and gold. Through the mist emerged four giant mushrooms. Their rubbery skin was a constantly shifting kaleidoscope of psychedelic color explosions. Each swayed and shivered in a primeval dance, following the beat of their own secret music. Four spongy voices sprouted in my brain.&lt;/p&gt;\n\n&lt;p&gt;LET US IN.&lt;/p&gt;\n\n&lt;p&gt;The black curtain fell once more, leaving me in darkness. Eternal darkness. Infinite darkness. Perfect darkness. Timeless. Egoless. Uncaring. This was the void. This was their home. The universe if nothing had ever existed. I’d always been here. I’d always be here.&lt;/p&gt;\n\n&lt;p&gt;Then I was back, but not to Roscosmos mission control. I was on space station Mir. The noise was gone, the molten javelin of pain in my head had disappeared. Four human figures stood before me, three men and one woman, dressed head to toe in the bright orange spacesuits of the early Soviet space program. Through their clear bubble helmets I could see their countenances; young, attractive, proud, full of vigor, smiling warmly. I recognized each face, recalling the pictures of the so called ‘Lost Cosmonauts’ that our recent research had turned up. They were Andrei Mitkov, Sergei Shiborin, Maria Gromova, and the last, of course, was Aleksei Ledovsky. The smiles on their faces remained. Their lips did not move, yet I could hear their voices in my head, kind and composed.&lt;/p&gt;\n\n&lt;p&gt;LET US IN. &lt;em&gt;PLEASE&lt;/em&gt;. LET US IN.&lt;/p&gt;\n\n&lt;p&gt;And if it had been in my power, I think I would have.&lt;/p&gt;\n\n&lt;p&gt;Then I watched as their smiles grew larger and larger, contorting their faces into massive inhuman grimaces. The skin of their lips and cheeks began to rip and tear away, revealing toothy skeletal grins. Their hair fell out, their skin dripped away, worms crawled from their empty eye sockets. The glass of their helmets shattered, their space suits deteriorated and fell away, and the smiles just kept growing. I tried to scream but my body was still paralyzed. I heard the bones in their jaws snap simultaneously and the smiles engulfed their entire face, flipping them inside out. I closed my eyes, and in my mind I again heard their voices, now desperate and horrid, chanting.&lt;/p&gt;\n\n&lt;p&gt;LET US IN. LET US IN. LET US IN.&lt;/p&gt;\n\n&lt;p&gt;Rising into a horrible crescendo.&lt;/p&gt;\n\n&lt;p&gt;When I opened my eyes I was back in Roscosmos mission control. The writhing, tentacled abominations still filled the main screen. My mind was filled with a horrible cacophony as the four voices morphed into four million, screaming in a hundred alien languages but somehow all saying the same thing.&lt;/p&gt;\n\n&lt;p&gt;LET US IN. LET US IN.&lt;/p&gt;\n\n&lt;p&gt;The people around me seemed to be in some kind of hysterical religious ecstasy; some laughing, some weeping, some howling like wolves and tearing their flesh to shreds with their teeth, others seizuring violently in their chairs.&lt;/p&gt;\n\n&lt;p&gt;LET US IN. LET US IN.&lt;/p&gt;\n\n&lt;p&gt;Then I heard another voice, this one not in my head, but coming from a little ways behind me. It was the strong, clear voice of Director Koptev crying out:&lt;/p&gt;\n\n&lt;p&gt;“Cut the feed! Cut the feed! For the love of mother Russia and everything you hold sacred, CUT THE GOD DAMNED FEED!”&lt;/p&gt;\n\n&lt;p&gt;And I tried. My hand reached out for the button on the terminal which would cut all contact with Mir. It inched closer.&lt;/p&gt;\n\n&lt;p&gt;Closer.&lt;/p&gt;\n\n&lt;p&gt;Closer.&lt;/p&gt;\n\n&lt;p&gt;Then it wrapped around a pen laying on the desk, pressed the button extending the tip, and turned it towards me. I watched in horror as my hand brought the pen slowly towards my face, aiming directly for my eyeball. I was powerless to stop it; my hand felt like it was under someone else’s complete control. And it moved closer.&lt;/p&gt;\n\n&lt;p&gt;Closer.&lt;/p&gt;\n\n&lt;p&gt;Closer.&lt;/p&gt;\n\n&lt;p&gt;Until it was almost touching my cornea, filling my entire field of vision.&lt;/p&gt;\n\n&lt;p&gt;Then something hit me hard in the side of the head, stars danced and exploded before my eyes, and I was falling to the floor in slow motion.&lt;/p&gt;\n\n&lt;p&gt;Somewhere far above me Markov was pounding the button on the terminal which cut the video feed. Then he had an office chair in his hand, smashing the computer terminal to pieces.&lt;/p&gt;\n\n&lt;p&gt;The main screen went blank. The piercing screech and wobbling bass disappeared, replaced by the weeping and wailing of the injured and dying, begging for help.&lt;/p&gt;\n\n&lt;p&gt;Markov stood hunched, breathing heavily, still holding the office chair. Koptev was stood next to him, white as a ghost. Ivanov lay dead at his feet in a pool of blood, his throat torn out by his own fingernails.&lt;/p&gt;\n\n&lt;p&gt;Markov grabbed my arm and pulled me to my feet. I blinked my eyes and surveyed the room. I was met by a scene of bloody carnage that looked more like a battlefield than a mission control room. &lt;/p&gt;\n\n&lt;p&gt;“Forgive me for hitting you,” Markov whispered. Then he straightened and turned to Koptev.&lt;/p&gt;\n\n&lt;p&gt;“Now will you believe me, Director? Now will you heed my advice?” he shouted.&lt;/p&gt;\n\n&lt;p&gt;Koptev nodded sadly, his eyes watering.&lt;/p&gt;\n\n&lt;p&gt;“I’m sorry Markov, I should have listened. We shall proceed with your first idea. We deorbit Mir as originally planned, and the world knows nothing. We burn them. We burn them all, and pray it is enough.”&lt;/p&gt;\n\n&lt;p&gt;“...And God help us if it isn’t,” said Markov.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;On March 23, 2001 the world watched in wonder as the space station Mir reentered earth’s atmosphere near Nadi, Fiji and &lt;a href=\"https://www.youtube.com/watch?v=fVQd9Ejkbiw\"&gt;disintegrated over the South Pacific Ocean&lt;/a&gt;. An official statement from Roscosmos announced that Mir &amp;quot;ceased to exist&amp;quot; at 05:59:24 GMT. &lt;/p&gt;\n\n&lt;p&gt;At the time, Mir was the largest spacecraft ever deorbited, and there were concerns that sizeable pieces of debris, particularly from the docking assemblies, gyrodynes and external structure, could survive re-entry. Officials in New Zealand issued warnings to ships and aircraft in the South Pacific, and the Japanese government warned its residents to stay in doors during the forty minute period when debris was most likely to fall. Nothing came of it. Mir is thought to have burned up completely during atmospheric reentry. Though rumors and speculation abound, no significant debris of the wreckage of Mir were ever recovered. &lt;/p&gt;\n\n&lt;p&gt;At Least, not officially.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Part 1: https://redd.it/5xsk1h \nPart 2: https://redd.it/5z9hjx\nPart 3: https://redd.it/60vdz7\n\nThe first thing I noticed was Ledovsky’s face, the only familiar feature in the bizarre scene before me. He was young, blonde, and probably handsome once; but now his face was distorted, like a newspaper-ink image stretched across silly putty. Black tendrils swarmed around the edges of his face, sticking to the skin, tugging at his ears, wrapping around strands of hair and pulling him backwards into the dark mass behind. He tried to speak, his mouth opening and closing like a dying fish, but the invading tendrils squirmed around his lips and snaked down his throat, and all that came out was a sickening gurgle.\n\nOne orange clad arm also protruded from the dark writhing mass, and his gloved hand gripped the radio transmitter. As I watched, a dozen black vines wormed their way around his wrist and hand, creeping like spilled liquid before tightening like sinew, peeling his fingers from the microphone one by one until it floated freely in the microgravity of the space station. The piercing sound cut off abruptly, the hot drill in my brain shut off, and the mission control room was bathed in a terrible silence as we watched Ledovsky’s arm submerge into darkness.\n\nHis shifting eyes were the last thing I saw; bulging brown irises filled with grim determination one moment, unspeakable horror the next, and then suddenly dead and glassy as he finally let go and surrendered to the void. Ledovsky disappeared, absorbed into the squirming darkness behind him. With nothing human left to hold my focus, I had no choice but to turn my attention to the rest of that macabre scene. \n\nThe space Ledovsky had occupied just a moment ago was now filled with a grotesque and faceless monstrosity. It looked like a floating ball of liquid mercury, three feet wide and three feet tall, but blacker than the darkest night. Its surface seemed to constantly squirm and shift, and it shimmered with rainbow iridescence, like an oil slick on a rain puddle. At least eight thick tentacle-like appendages extended from its central mass, each wrapped around computer terminals, door handles, ceiling hooks, and other equipment to keep itself in place in the station’s microgravity. All over its surface smaller tendrils appeared and disappeared, wiggling and curling in on themselves.\n\nBehind the creature that had once been Ledovsky loomed three exact duplicates, each devoid of any discernible face. The background was a tangled mess of floating tentacles, weaving through one another and twisted around each other like spaghetti noodles; some attached to equipment in the room, others gripping the first creature; as if laying hands upon the shoulders of a troubled friend. \n\nSuddenly all four creatures moved as one, squirming squid-like around one another, and spreading into a line across the capsule. With a jerk, their attention seemed to snap to the camera in the terminal, though without faces it was hard to tell for sure. The scene froze like that for a horrifying moment and I peeled my eyes from the screen. The Roscosmos mission control room was still and silent, each person petrified in place like a statue, slack jawed, with eyes locked on the main screen.\n\nI turned my attention back to the video feed, and now the core of each creature was bubbling, boiling, churning like the waters of a maelstrom. The center of each opened into a tiny white hole which quickly grew in size, expanding to cover most of the creatures’ ‘bodies’. Then, stretching and twisting, each of the holes transformed into a shape I recognized all too well.\n\nA smile.\n\nNo eyes, no ears, no nose, no face; just enormous empty inhuman smiles.\n\nThen the noise was back, but this time I wasn’t hearing it; I was feeling it. It was inside of me, inside my head, and it was coming from them, from their smiles. It was coming from The Smiling Ones.\n\nI tried to look away, but I couldn’t; my body felt completely paralyzed. Their smiles were growing. The sound was rising, screeching in my head like the billion swarming wings of a demonic locust plague. The drill in my head switched back on, but now the torque was turned up to the highest setting and was joined by the thrum of a jackhammer breaking concrete. It felt like the two hemispheres of my brain were being torn apart. I could smell burning electrical wires and taste copper in my mouth.\n\nIn my peripheral vision I saw a flurry of movement. The men and women around me, the pride of the Roscosmos State Corporation for Space Activities, were hurting themselves. Some slammed their faces into their desks over and over again until blood poured from broken noses and shattered mouths. Some picked up pens and pencils and violently stabbed themselves deep in the ear canal, then pounded them further in with palms of their hands. Others gouged their eyes or sawed at their wrists with any sharp object they could find.\n\nThen everything faded away until my entire world was a white hot ball of pain and I lost consciousness.\n\nMy eyes snapped back open, and I stared at the screen. The smiling ones were gone, and in their place were four small grey humanoid aliens with buggy black eyes. In my head I heard four distinct voices speaking together:\n\nLET US IN.\n\nMy vision went dark and I was gone.\n\nThen I was back. Now four giant bipedal lizards appeared on screen, oozing dark green slime like sweat, black venom dripped from their jaws. Their reptilian eyes stared into my soul and their voices shrieked in my mind.\n\nLET US IN.\n\nThe tenebrous veil of unconsciousness folded around me once again.\n\nThen I was back. Now four angelic beings floated on the screen, translucent, but gleaming like the sun around the edges and draped in flowing gowns of a million impossible hues. Their beautiful voices sang a harmony in my head.\n\nLET US IN.\n\nThe scrim of shadow fell upon me once more and I was gone.\n\nThen I was back. Now the the inside of the space station was an alien forest filled with a swirling fog of green and gold. Through the mist emerged four giant mushrooms. Their rubbery skin was a constantly shifting kaleidoscope of psychedelic color explosions. Each swayed and shivered in a primeval dance, following the beat of their own secret music. Four spongy voices sprouted in my brain.\n\nLET US IN.\n\nThe black curtain fell once more, leaving me in darkness. Eternal darkness. Infinite darkness. Perfect darkness. Timeless. Egoless. Uncaring. This was the void. This was their home. The universe if nothing had ever existed. I’d always been here. I’d always be here.\n\nThen I was back, but not to Roscosmos mission control. I was on space station Mir. The noise was gone, the molten javelin of pain in my head had disappeared. Four human figures stood before me, three men and one woman, dressed head to toe in the bright orange spacesuits of the early Soviet space program. Through their clear bubble helmets I could see their countenances; young, attractive, proud, full of vigor, smiling warmly. I recognized each face, recalling the pictures of the so called ‘Lost Cosmonauts’ that our recent research had turned up. They were Andrei Mitkov, Sergei Shiborin, Maria Gromova, and the last, of course, was Aleksei Ledovsky. The smiles on their faces remained. Their lips did not move, yet I could hear their voices in my head, kind and composed.\n\nLET US IN. *PLEASE*. LET US IN.\n\nAnd if it had been in my power, I think I would have.\n\nThen I watched as their smiles grew larger and larger, contorting their faces into massive inhuman grimaces. The skin of their lips and cheeks began to rip and tear away, revealing toothy skeletal grins. Their hair fell out, their skin dripped away, worms crawled from their empty eye sockets. The glass of their helmets shattered, their space suits deteriorated and fell away, and the smiles just kept growing. I tried to scream but my body was still paralyzed. I heard the bones in their jaws snap simultaneously and the smiles engulfed their entire face, flipping them inside out. I closed my eyes, and in my mind I again heard their voices, now desperate and horrid, chanting.\n\nLET US IN. LET US IN. LET US IN.\n\nRising into a horrible crescendo.\n\nWhen I opened my eyes I was back in Roscosmos mission control. The writhing, tentacled abominations still filled the main screen. My mind was filled with a horrible cacophony as the four voices morphed into four million, screaming in a hundred alien languages but somehow all saying the same thing.\n\nLET US IN. LET US IN.\n\nThe people around me seemed to be in some kind of hysterical religious ecstasy; some laughing, some weeping, some howling like wolves and tearing their flesh to shreds with their teeth, others seizuring violently in their chairs.\n\nLET US IN. LET US IN.\n\nThen I heard another voice, this one not in my head, but coming from a little ways behind me. It was the strong, clear voice of Director Koptev crying out:\n\n“Cut the feed! Cut the feed! For the love of mother Russia and everything you hold sacred, CUT THE GOD DAMNED FEED!”\n\nAnd I tried. My hand reached out for the button on the terminal which would cut all contact with Mir. It inched closer.\n\nCloser.\n\nCloser.\n\nThen it wrapped around a pen laying on the desk, pressed the button extending the tip, and turned it towards me. I watched in horror as my hand brought the pen slowly towards my face, aiming directly for my eyeball. I was powerless to stop it; my hand felt like it was under someone else’s complete control. And it moved closer.\n\nCloser.\n\nCloser.\n\nUntil it was almost touching my cornea, filling my entire field of vision.\n\nThen something hit me hard in the side of the head, stars danced and exploded before my eyes, and I was falling to the floor in slow motion.\n\nSomewhere far above me Markov was pounding the button on the terminal which cut the video feed. Then he had an office chair in his hand, smashing the computer terminal to pieces.\n\nThe main screen went blank. The piercing screech and wobbling bass disappeared, replaced by the weeping and wailing of the injured and dying, begging for help.\n\nMarkov stood hunched, breathing heavily, still holding the office chair. Koptev was stood next to him, white as a ghost. Ivanov lay dead at his feet in a pool of blood, his throat torn out by his own fingernails.\n\nMarkov grabbed my arm and pulled me to my feet. I blinked my eyes and surveyed the room. I was met by a scene of bloody carnage that looked more like a battlefield than a mission control room. \n\n“Forgive me for hitting you,” Markov whispered. Then he straightened and turned to Koptev.\n\n“Now will you believe me, Director? Now will you heed my advice?” he shouted.\n\nKoptev nodded sadly, his eyes watering.\n\n“I’m sorry Markov, I should have listened. We shall proceed with your first idea. We deorbit Mir as originally planned, and the world knows nothing. We burn them. We burn them all, and pray it is enough.”\n\n“...And God help us if it isn’t,” said Markov.\n\n---\n\nOn March 23, 2001 the world watched in wonder as the space station Mir reentered earth’s atmosphere near Nadi, Fiji and [disintegrated over the South Pacific Ocean](https://www.youtube.com/watch?v=fVQd9Ejkbiw). An official statement from Roscosmos announced that Mir \"ceased to exist\" at 05:59:24 GMT. \n\nAt the time, Mir was the largest spacecraft ever deorbited, and there were concerns that sizeable pieces of debris, particularly from the docking assemblies, gyrodynes and external structure, could survive re-entry. Officials in New Zealand issued warnings to ships and aircraft in the South Pacific, and the Japanese government warned its residents to stay in doors during the forty minute period when debris was most likely to fall. Nothing came of it. Mir is thought to have burned up completely during atmospheric reentry. Though rumors and speculation abound, no significant debris of the wreckage of Mir were ever recovered. \n\nAt Least, not officially.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "65g3k3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 179, "report_reasons": null, "author": "Dariuspilgrim", "saved": false, "mod_reports": [], "name": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65g3k3/the_smiling_ones_on_space_station_mir_part_4/", "num_reports": null, "locked": false, "stickied": false, "created": 1492242688.0, "url": "https://www.reddit.com/r/nosleep/comments/65g3k3/the_smiling_ones_on_space_station_mir_part_4/", "author_flair_text": null, "quarantine": false, "title": "The Smiling Ones on Space Station Mir [Part 4]", "created_utc": 1492213888.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 179}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65g3k3", "likes": null, "replies": "", "user_reports": [], "id": "dg9ztwl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OnyxOctopus", "parent_id": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Reposted with moderator approval. Please keep this in mind before reporting as a repost. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reposted with moderator approval. Please keep this in mind before reporting as a repost. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9ztwl", "score_hidden": true, "stickied": true, "created": 1492244230.0, "created_utc": 1492215430.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65g3k3", "likes": null, "replies": "", "user_reports": [], "id": "dgb2lqt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Chromobeat", "parent_id": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "MORE MORE MORE MORE MORE MORE MORE MORE MORE. BEST STORY I HAVE READ IN A LOOOOOOOOOOONG TIME. OP, MAKE THIS A BOOK,DO SOMETHING, THIS WORK OF ART NEEDS TO BE PROJECTED SOMEWHERE, PROMOTED, EVEN ADVERTIZED. I LOVE YOU OP, BEST CHILLS I HAD IN A LOOOOOONG TIME.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;MORE MORE MORE MORE MORE MORE MORE MORE MORE. BEST STORY I HAVE READ IN A LOOOOOOOOOOONG TIME. OP, MAKE THIS A BOOK,DO SOMETHING, THIS WORK OF ART NEEDS TO BE PROJECTED SOMEWHERE, PROMOTED, EVEN ADVERTIZED. I LOVE YOU OP, BEST CHILLS I HAD IN A LOOOOOONG TIME.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb2lqt", "score_hidden": false, "stickied": false, "created": 1492314068.0, "created_utc": 1492285268.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65g3k3", "likes": null, "replies": "", "user_reports": [], "id": "dga5yfp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ahilgen", "parent_id": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I've always wanted to be an astronaut. Thank you, poor eye sight. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always wanted to be an astronaut. Thank you, poor eye sight. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga5yfp", "score_hidden": false, "stickied": false, "created": 1492252695.0, "created_utc": 1492223895.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65g3k3", "likes": null, "replies": "", "user_reports": [], "id": "dgaa95y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "INFiNiTY1O1", "parent_id": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I know I had read this part, but I wanted it to be the next one. Best one dude!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know I had read this part, but I wanted it to be the next one. Best one dude!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaa95y", "score_hidden": false, "stickied": false, "created": 1492259507.0, "created_utc": 1492230707.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65g3k3", "likes": null, "replies": "", "user_reports": [], "id": "dgaodb9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Seusstastic", "parent_id": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I think I'll eat spaghetti tonight to celebrate the victory over the noodly smiling weirdos.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I&amp;#39;ll eat spaghetti tonight to celebrate the victory over the noodly smiling weirdos.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaodb9", "score_hidden": false, "stickied": false, "created": 1492294059.0, "created_utc": 1492265259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65g3k3", "likes": null, "replies": "", "user_reports": [], "id": "dg9yq4w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65g3k3%2Fthe_smiling_ones_on_space_station_mir_part_4%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;to=RemindMeBot&amp;subject=Reminder) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65g3k3%2Fthe_smiling_ones_on_space_station_mir_part_4%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;to=RemindMeBot&amp;amp;subject=Reminder\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dg9yq4w", "score_hidden": false, "stickied": false, "created": 1492242751.0, "created_utc": 1492213951.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65g3k3", "likes": null, "replies": "", "user_reports": [], "id": "dgbp02v", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "iliveanotherlife", "parent_id": "t3_65g3k3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Repost?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Repost?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbp02v", "score_hidden": false, "stickied": false, "created": 1492346608.0, "created_utc": 1492317808.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]