[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to have kept you waiting. It&amp;#39;s been crazy around here and I didn&amp;#39;t have time nor the energy to write earlier. \nIn case some of you didn&amp;#39;t notice, there&amp;#39;s a small update at the end of &lt;a href=\"https://www.reddit.com/r/nosleep/comments/6513by/lockdown/\"&gt;part1&lt;/a&gt;, so you should check it out before you start reading this one.&lt;/p&gt;\n\n&lt;p&gt;I also want to thank everyone for their helpful advice and kind words. Even if I can&amp;#39;t save myself, I just want to let you know that you&amp;#39;re awesome.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I was standing in a dead-silent hallway alone. All the light bulbs were burned out and I wasn&amp;#39;t even sure which floor I was on.\nI started walking through the dark hallway using my phone to see what was ahead. I noticed there were some strange scribbles on the wall and they seemed to be written with the same black liquid that those infected people were vomiting. One of them said:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;corpses \nfLies and \nmaggots\npaInfull dEath \nawaitS&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I was so focused on the writings I didn&amp;#39;t notice that something had crept closer, and when I finally heard it, it was already too close;\nit was the kind of noise people make when they&amp;#39;re dying or have trouble breathing. That sent a jolt of fear through my body, turning my legs into jelly.&lt;/p&gt;\n\n&lt;p&gt;I turned around as quickly as possible, and my heart froze when I saw it:&lt;/p&gt;\n\n&lt;p&gt;Jessica - with half of her face gone - stood there just inches away from me. &lt;/p&gt;\n\n&lt;p&gt;I was paralyzed with fear and before I could do anything, she charged at me. I fell backwards to the cold concrete floor and she landed on top of me. I tried to push her off, but she kept coming at me. &lt;/p&gt;\n\n&lt;p&gt;I stared into her rotten mouth in horror as the black liquid started to fall on my face. Just before my mouth was filled with her vomit, I desperately cried for help one more time. &lt;/p&gt;\n\n&lt;p&gt;.\n.\n.\n.\n.\n.\n.\n.&lt;/p&gt;\n\n&lt;p&gt;I woke up screaming. &lt;/p&gt;\n\n&lt;p&gt;I looked around and blinked my eyes rapidly until my surroundings became clear. I was in my bedroom, in my own bed. The coffee machine was percolating in the kitchen and based on the clinking noises Liam was searching for the coffee cups. &lt;/p&gt;\n\n&lt;p&gt;Just when I was about to get up, I saw a small drop of blood on my pillow. &lt;/p&gt;\n\n&lt;p&gt;I jumped up out of bed and darted straight to the bathroom where I stared into the mirror, trying to find out where the blood had came from. &lt;/p&gt;\n\n&lt;p&gt;After some panicking and desperate thoughts there was a knock on the door.&lt;/p&gt;\n\n&lt;p&gt;Liam: &amp;quot;Is everything alright?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;Y-yeah, just a second...&amp;quot; (I tried to sound as cheerful as possible while I was still checking myself.) &lt;/p&gt;\n\n&lt;p&gt;There were no traces of blood in my nose. My ears and eyes were clean too. I didn&amp;#39;t know if was sick or not, and it was killing me. \nI popped a few pills to calm myself down before I left the bathroom. &lt;/p&gt;\n\n&lt;p&gt;When I opened the door, Liam was waiting for me with a frown on his face.  &lt;/p&gt;\n\n&lt;p&gt;Liam: &amp;quot;What&amp;#39;s wrong?&amp;quot; (He sounded like he &lt;em&gt;knew&lt;/em&gt; already.)&lt;/p&gt;\n\n&lt;p&gt;I had been silently crying and hyperventilating in the bathroom, so I looked like a mess. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Everything&amp;#39;s fine, it&amp;#39;s just... &lt;em&gt;that&lt;/em&gt; time of the month. That&amp;#39;s all&amp;quot;, I reassured him while I wiped a tear from the corner of my eye and forced a smile on my face.&lt;/p&gt;\n\n&lt;p&gt;Liam squinted as if he was studying me very closely with his eyes. Then he said: &amp;quot;Well, I made us some coffee and there are also some sandwiches. There&amp;#39;s not much food left but at least we can eat now. &amp;quot; &lt;/p&gt;\n\n&lt;p&gt;He put his hands on his hips, now slightly touching the gun he was carrying.&lt;/p&gt;\n\n&lt;p&gt;I figured Liam had a strict no zombies-policy and he would probably put a bullet in my brain right there and then if he knew I was having some weird symptoms, so I made a shit move and didn&amp;#39;t tell him anything. &lt;/p&gt;\n\n&lt;p&gt;After we had eaten Liam said that we should explore the storage cages in our basement, to see if there&amp;#39;s anything we could use. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Keep an eye out for anything suspicious. You watch my back and I shoot anything that tries to approach us&amp;quot;, he said as we left my apartment and closed the door behind us. I nodded and followed him to the elevator. &lt;/p&gt;\n\n&lt;p&gt;The elevator doesn&amp;#39;t go all the way to the basement, so we had to stop on the ground floor and take the stairs to the basement level. The ground floor was eerily silent and it made me nervous. Every creak our shoes made sent me on edge and made me glance over my shoulder as we descended the stairs. &lt;/p&gt;\n\n&lt;p&gt;The basement was dark and a rancid smell hung in the air. Something was probably decaying. Liam flipped the light-switch on but nothing happened, it was still pitch black. Apparently the light bulb was burned out. \nLiam handed me the flashlight so I could light our surroundings while he&amp;#39;s handling the gun. &lt;/p&gt;\n\n&lt;p&gt;Most of the cages were locked but Liam knew how to pick locks, so it wasn&amp;#39;t a problem. (I wonder where he learned that...) One of the cages looked promising, so Liam took his tools from his pocket and I pointed the flashlight at the lock so he could see what he was doing. &lt;/p&gt;\n\n&lt;p&gt;We were almost done when I heard something move in the back corner of the basement. &lt;/p&gt;\n\n&lt;p&gt;I whispered to Liam: &amp;quot;I heard something from the back.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Liam stood up fast and cocked his gun. &amp;quot;I&amp;#39;ll check it out. Stay behind me.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I followed few steps behind as he stealthily sneaked towards the strange noise. Something was rustling in the dark and we were getting closer to it. The smell of decay got worse too.&lt;/p&gt;\n\n&lt;p&gt;I was pointing the flashlight around when I noticed that there was movement in one of the cages. Liam noticed it too and pointed his gun at it. &lt;/p&gt;\n\n&lt;p&gt;When I shone the flashlight at the cage, I almost threw up. There was a woman on the floor leaning her back against the wall. A huge chunk of flesh seemed to be missing from her leg and the gash was oozing yellow putrid. There were deep bite marks all over her body and flies were loudly buzzing around the wounds. &lt;/p&gt;\n\n&lt;p&gt;The woman turned her gaze to us. Her face was gaunt and covered in blood. &lt;/p&gt;\n\n&lt;p&gt;A weak voice escaped from her chapped lips:  &amp;quot;Help... Ricky...&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I realized she was the neighbor who owned that Shih Tzu dog. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I locked...&amp;quot; (She took a sharp breath between the sentences) &amp;quot;Ricky in the cage opposite of me... So I or anyone else wont get to him... When I...&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;We will take Ricky with us, I promise! Liam, help me open the door!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Liam rolled his eyes and sighed. &amp;quot;Look, we don&amp;#39;t have time for this. We don&amp;#39;t need extra baggage with us, especially some do-&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;His rant was interrupted when Ricky padded into our view. The dog was looking at us with his big, sad brown eyes and I reached to pet him through the bars. &amp;quot;You don&amp;#39;t need to take care of him, I will&amp;quot;, I said firmly while Ricky licked my hand. &lt;/p&gt;\n\n&lt;p&gt;Based on his looks Liam was about to scold me again, but he got interrupted when Ricky&amp;#39;s owner started to scream in her cage:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please take Ricky away! The virus... it&amp;#39;s taking over me... Soon I can&amp;#39;t hold myself back.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The woman started vomiting violently, black liquid eating away her chin and burning through the shirt that used to be white. Then she collapsed on the floor and started to crawl towards the cage door. Her bloodshot eyes were bulging out of their sockets and she stared us furiously as she came closer. &lt;/p&gt;\n\n&lt;p&gt;Liam pulled the trigger and a deafening bang followed. \nBlood spattered on the bars and on Liam&amp;#39;s leather jacket. &lt;/p&gt;\n\n&lt;p&gt;He  took a napkin from his pocket and wiped most of the blood from his sleeve. I stood there silent for a while, processing what had just happened. Then I heard Ricky whimpering, the poor thing was probably even more scared than I was. &lt;/p&gt;\n\n&lt;p&gt;Liam noticed my pitying look and finally he said: &amp;quot;Fine, I&amp;#39;ll get the dog. You take the gun and keep an eye out while I&amp;#39;m picking the lock. If these &lt;em&gt;things&lt;/em&gt; are drawn to the noise we might be expecting some company.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;He handed me the gun and started picking the lock while Ricky was panting and jumping against the bars excitedly. The gun felt heavy in my hand. I had never shot anything before. I stared at the doorway anxiously, waiting for something horrible to appear at any moment. &lt;/p&gt;\n\n&lt;p&gt;Soon the door was open and Ricky ran out. I picked him up and held him in my arms after I handed the gun back to Liam. &lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;Thanks. I&amp;#39;m sure Ricky appreciates this too.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Liam replied sarcastically: &amp;quot;Yeah, I&amp;#39;m sure he does.&amp;quot; Then he continued: I&amp;#39;ll check out few more cages for items and then we go, okay?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I followed Liam with Ricky in my arms as he proceeded to explore the cages. Most of them had nothing useful: mostly some old furniture and other random stuff that was covered in dust. &lt;/p&gt;\n\n&lt;p&gt;When we were done I got to realize that Liam was right: we had drawn attention to us.&lt;/p&gt;\n\n&lt;p&gt;The basement door flew open and we heard heavy footsteps in the stairs. What made it even worse: it wasn&amp;#39;t just one person. There was a group of them. &lt;/p&gt;\n\n&lt;p&gt;The footsteps were accompanied by this heavy, dragging noise. Someone or something was crawling down the stairs. Ricky started to bark nervously and Liam stepped ahead of us (so we were covering behind his back). He pointed his gun towards the exit and waited for a clear view. &lt;/p&gt;\n\n&lt;p&gt;First there was just one of them: the teenage girl from day 1 ran towards us while letting out an ear-piercing scream. She was unbelievably fast and she leaped from wall to wall like some kind of an animal. I covered Ricky&amp;#39;s ears leaving mine unprotected as Liam kept firing shots at her. The girl evaded all the bullets and now she was only inches away from Liam&amp;#39;s face.&lt;/p&gt;\n\n&lt;p&gt;I backed away with Ricky as I stared at was happening right before my eyes. I let out a terrified yelp when Liam fired his gun again - this was his last chance to get shot at her. &lt;/p&gt;\n\n&lt;p&gt;Luckily it was all Liam needed: this time the girl collapsed on the ground and a puddle of blood formed beneath her. &lt;/p&gt;\n\n&lt;p&gt;Then the other neighbors came, there were at least 20 of them. I watched as the bullet rain washed over the basement and the infected people fell one after another. I let a relieved sigh when I thought Liam had gotten all of them...\n.\n.\n.\n.\n&lt;em&gt;&amp;quot;Thought&amp;quot;&lt;/em&gt; being the keyword here: it was silent for a while, but there was this dragging noise again. &lt;/p&gt;\n\n&lt;p&gt;Liam: &amp;quot;Shit!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Fearing for the worst I asked him what&amp;#39;s wrong. And my guess was right:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m out of bullets&amp;quot;, Liam said and drew a butterfly knife out of his pocket. &amp;quot;I guess I&amp;#39;ll have to do it the hard way then&amp;quot;, he sighed as he flipped the knife open. &lt;/p&gt;\n\n&lt;p&gt;One of the infected people had been hiding in the stairs for this whole time, and a terrible thought came into my mind: what if it did this on purpose? What if it sent its &amp;quot;friends&amp;quot; first so it could attack us when we&amp;#39;re out of bullets? &lt;/p&gt;\n\n&lt;p&gt;Liam: &amp;quot;Lock yourself in that cage Ricky was in. And don&amp;#39;t come out until I say so, you got it?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Before I could even answer something enormous tumbled down the stairs. &lt;/p&gt;\n\n&lt;p&gt;Now I have to take a moment to describe what I saw. If this was a movie and I was the viewer I would think &amp;quot;lol they overdid it big time&amp;quot;, but unfortunately this wasn&amp;#39;t a movie and I didn&amp;#39;t have popcorn. Instead I had a barking dog in my arms and a butterfly wielding guy on a suicide mission. &lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m not a scientist either but my best guess is the virus had now mutated because this thing -whatever it was- was about 7 feet tall and it consisted of arms and legs and loose skin. \nI think that some of the &amp;quot;zombies&amp;quot; had morphed into one snake-like creature that was now crawling towards us. It had a human head but it was melted into something unrecognizable, and black acid oozed through it&amp;#39;s pores leaving a trail of corroded floor behind it. &lt;/p&gt;\n\n&lt;p&gt;I started to run towards the cage and when I glanced over my shoulder Liam was preparing to fight the creature. I locked the cage and sat Ricky far in the back corner. Then I returned to the door and looked through the bars, fearing for Liam&amp;#39;s life and my own. &lt;/p&gt;\n\n&lt;p&gt;The thing lifted its front body from the ground, like a snake that&amp;#39;s about to attack. It spew the black liquid towards Liam but he dodged the acid shower just in time. Then it swung its &amp;quot;tail&amp;quot; at Liam, sweeping him off his sweet. I screamed for him to get up, get up before it&amp;#39;s too late. &lt;/p&gt;\n\n&lt;p&gt;Liam did a fast backwards roll and now he was back on his feet. The creature continued attacking him by throwing its heavy upper body at him, but Liam stepped aside just in time and let it bump into a wall. Now he was able to attack it from behind.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Go get it!&amp;quot; I screamed involuntary as I clenched my fists so hard that it hurt. &lt;/p&gt;\n\n&lt;p&gt;Liam took his chance and sank the knife on that creature&amp;#39;s back. Black acid sprayed from the wound and Liam quickly jumped back so he wouldn&amp;#39;t get any of the venom on his face. The thing shrieked in pain and it swung its tail in all directions making the cage doors clatter loudly. &lt;/p&gt;\n\n&lt;p&gt;I waited anxiously as Liam leaped towards the thing and aimed his knife in its occiput. The thing continued to struggle but Liam sank the knife even deeper into its skull and yanked it to make even more damage. There was no sign of fear in him, instead he looked determined, pissed off even.&lt;/p&gt;\n\n&lt;p&gt;The creature spewed its venom all over the basement while it thrashed around in agony. I held my breath while I waited for its next move. Liam backed away again, so he wouldn&amp;#39;t get tackled anymore.&lt;/p&gt;\n\n&lt;p&gt;Finally the thing gave up and fell to the floor. Liam wiped sweat off his forehead and kicked its lifeless body to make sure there was no danger anymore. Then he walked back to us and picked up the lock again so me and Ricky could get out of the cage. &lt;/p&gt;\n\n&lt;p&gt;Me: &amp;quot;Wow, that was awesome! Where did you learn to fight like that?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Ricky ran to Liam and jumped against his feet excitedly while wagging his tail.&lt;/p&gt;\n\n&lt;p&gt;Liam: &amp;quot;It&amp;#39;s a long story but now I really need to shower.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;So, now we&amp;#39;re back in my apartment, Ricky, Liam and I. We still don&amp;#39;t know how or when we get out, but I&amp;#39;m glad I&amp;#39;m not alone. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s one thing that&amp;#39;s worrying me though: I still don&amp;#39;t know where that blood came from and I feel a bit dizzy. It might be just stress and tiredness but still, I&amp;#39;m scared. I haven&amp;#39;t told Liam anything yet, but I&amp;#39;m considering it. &lt;/p&gt;\n\n&lt;p&gt;I will later update on this same post again, as this was quite short and I don&amp;#39;t want to flood reddit with countless posts. The next update could be the last one, since my time might be running out and we don&amp;#39;t know how much longer we&amp;#39;ll have electricity. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm sorry to have kept you waiting. It's been crazy around here and I didn't have time nor the energy to write earlier. \nIn case some of you didn't notice, there's a small update at the end of [part1](https://www.reddit.com/r/nosleep/comments/6513by/lockdown/), so you should check it out before you start reading this one.\n\nI also want to thank everyone for their helpful advice and kind words. Even if I can't save myself, I just want to let you know that you're awesome.\n\n--------------------------------------------------------------------------------------------------------------------------------------\n\n\nI was standing in a dead-silent hallway alone. All the light bulbs were burned out and I wasn't even sure which floor I was on.\nI started walking through the dark hallway using my phone to see what was ahead. I noticed there were some strange scribbles on the wall and they seemed to be written with the same black liquid that those infected people were vomiting. One of them said:\n\n\n*corpses \nfLies and \nmaggots\npaInfull dEath \nawaitS*\n\n\nI was so focused on the writings I didn't notice that something had crept closer, and when I finally heard it, it was already too close;\nit was the kind of noise people make when they're dying or have trouble breathing. That sent a jolt of fear through my body, turning my legs into jelly.\n\n\nI turned around as quickly as possible, and my heart froze when I saw it:\n\n\nJessica - with half of her face gone - stood there just inches away from me. \n\n\nI was paralyzed with fear and before I could do anything, she charged at me. I fell backwards to the cold concrete floor and she landed on top of me. I tried to push her off, but she kept coming at me. \n\n\nI stared into her rotten mouth in horror as the black liquid started to fall on my face. Just before my mouth was filled with her vomit, I desperately cried for help one more time. \n\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n\nI woke up screaming. \n\n\nI looked around and blinked my eyes rapidly until my surroundings became clear. I was in my bedroom, in my own bed. The coffee machine was percolating in the kitchen and based on the clinking noises Liam was searching for the coffee cups. \n\n\nJust when I was about to get up, I saw a small drop of blood on my pillow. \n\n\nI jumped up out of bed and darted straight to the bathroom where I stared into the mirror, trying to find out where the blood had came from. \n\nAfter some panicking and desperate thoughts there was a knock on the door.\n\n\nLiam: \"Is everything alright?\"\n\n\nMe: \"Y-yeah, just a second...\" (I tried to sound as cheerful as possible while I was still checking myself.) \n\n\nThere were no traces of blood in my nose. My ears and eyes were clean too. I didn't know if was sick or not, and it was killing me. \nI popped a few pills to calm myself down before I left the bathroom. \n\nWhen I opened the door, Liam was waiting for me with a frown on his face.  \n\n\nLiam: \"What's wrong?\" (He sounded like he *knew* already.)\n\n\nI had been silently crying and hyperventilating in the bathroom, so I looked like a mess. \n\n\n\"Everything's fine, it's just... *that* time of the month. That's all\", I reassured him while I wiped a tear from the corner of my eye and forced a smile on my face.\n\n\nLiam squinted as if he was studying me very closely with his eyes. Then he said: \"Well, I made us some coffee and there are also some sandwiches. There's not much food left but at least we can eat now. \" \n\nHe put his hands on his hips, now slightly touching the gun he was carrying.\n\n\nI figured Liam had a strict no zombies-policy and he would probably put a bullet in my brain right there and then if he knew I was having some weird symptoms, so I made a shit move and didn't tell him anything. \n\n\nAfter we had eaten Liam said that we should explore the storage cages in our basement, to see if there's anything we could use. \n\n\"Keep an eye out for anything suspicious. You watch my back and I shoot anything that tries to approach us\", he said as we left my apartment and closed the door behind us. I nodded and followed him to the elevator. \n\n\nThe elevator doesn't go all the way to the basement, so we had to stop on the ground floor and take the stairs to the basement level. The ground floor was eerily silent and it made me nervous. Every creak our shoes made sent me on edge and made me glance over my shoulder as we descended the stairs. \n\n\nThe basement was dark and a rancid smell hung in the air. Something was probably decaying. Liam flipped the light-switch on but nothing happened, it was still pitch black. Apparently the light bulb was burned out. \nLiam handed me the flashlight so I could light our surroundings while he's handling the gun. \n\n\nMost of the cages were locked but Liam knew how to pick locks, so it wasn't a problem. (I wonder where he learned that...) One of the cages looked promising, so Liam took his tools from his pocket and I pointed the flashlight at the lock so he could see what he was doing. \n\n\nWe were almost done when I heard something move in the back corner of the basement. \n\n\nI whispered to Liam: \"I heard something from the back.\"\n\n\nLiam stood up fast and cocked his gun. \"I'll check it out. Stay behind me.\" \n\n\nI followed few steps behind as he stealthily sneaked towards the strange noise. Something was rustling in the dark and we were getting closer to it. The smell of decay got worse too.\n\n\nI was pointing the flashlight around when I noticed that there was movement in one of the cages. Liam noticed it too and pointed his gun at it. \n\n\nWhen I shone the flashlight at the cage, I almost threw up. There was a woman on the floor leaning her back against the wall. A huge chunk of flesh seemed to be missing from her leg and the gash was oozing yellow putrid. There were deep bite marks all over her body and flies were loudly buzzing around the wounds. \n\n\nThe woman turned her gaze to us. Her face was gaunt and covered in blood. \n\n\nA weak voice escaped from her chapped lips:  \"Help... Ricky...\" \n\n\nI realized she was the neighbor who owned that Shih Tzu dog. \n\n\n\"I locked...\" (She took a sharp breath between the sentences) \"Ricky in the cage opposite of me... So I or anyone else wont get to him... When I...\" \n\n\nMe: \"We will take Ricky with us, I promise! Liam, help me open the door!\" \n\n\nLiam rolled his eyes and sighed. \"Look, we don't have time for this. We don't need extra baggage with us, especially some do-\" \n\n\nHis rant was interrupted when Ricky padded into our view. The dog was looking at us with his big, sad brown eyes and I reached to pet him through the bars. \"You don't need to take care of him, I will\", I said firmly while Ricky licked my hand. \n\n\nBased on his looks Liam was about to scold me again, but he got interrupted when Ricky's owner started to scream in her cage:\n\n\n\"Please take Ricky away! The virus... it's taking over me... Soon I can't hold myself back.\" \n\n\nThe woman started vomiting violently, black liquid eating away her chin and burning through the shirt that used to be white. Then she collapsed on the floor and started to crawl towards the cage door. Her bloodshot eyes were bulging out of their sockets and she stared us furiously as she came closer. \n\n\nLiam pulled the trigger and a deafening bang followed. \nBlood spattered on the bars and on Liam's leather jacket. \n\n\nHe  took a napkin from his pocket and wiped most of the blood from his sleeve. I stood there silent for a while, processing what had just happened. Then I heard Ricky whimpering, the poor thing was probably even more scared than I was. \n\n\nLiam noticed my pitying look and finally he said: \"Fine, I'll get the dog. You take the gun and keep an eye out while I'm picking the lock. If these *things* are drawn to the noise we might be expecting some company.\" \n\n\nHe handed me the gun and started picking the lock while Ricky was panting and jumping against the bars excitedly. The gun felt heavy in my hand. I had never shot anything before. I stared at the doorway anxiously, waiting for something horrible to appear at any moment. \n\n\nSoon the door was open and Ricky ran out. I picked him up and held him in my arms after I handed the gun back to Liam. \n\n\nMe: \"Thanks. I'm sure Ricky appreciates this too.\" \n\n\nLiam replied sarcastically: \"Yeah, I'm sure he does.\" Then he continued: I'll check out few more cages for items and then we go, okay?\"\n\n\nI followed Liam with Ricky in my arms as he proceeded to explore the cages. Most of them had nothing useful: mostly some old furniture and other random stuff that was covered in dust. \n\n\nWhen we were done I got to realize that Liam was right: we had drawn attention to us.\n\n\nThe basement door flew open and we heard heavy footsteps in the stairs. What made it even worse: it wasn't just one person. There was a group of them. \n\n\nThe footsteps were accompanied by this heavy, dragging noise. Someone or something was crawling down the stairs. Ricky started to bark nervously and Liam stepped ahead of us (so we were covering behind his back). He pointed his gun towards the exit and waited for a clear view. \n\n\nFirst there was just one of them: the teenage girl from day 1 ran towards us while letting out an ear-piercing scream. She was unbelievably fast and she leaped from wall to wall like some kind of an animal. I covered Ricky's ears leaving mine unprotected as Liam kept firing shots at her. The girl evaded all the bullets and now she was only inches away from Liam's face.\n\n\nI backed away with Ricky as I stared at was happening right before my eyes. I let out a terrified yelp when Liam fired his gun again - this was his last chance to get shot at her. \n\n\nLuckily it was all Liam needed: this time the girl collapsed on the ground and a puddle of blood formed beneath her. \n\n\nThen the other neighbors came, there were at least 20 of them. I watched as the bullet rain washed over the basement and the infected people fell one after another. I let a relieved sigh when I thought Liam had gotten all of them...\n.\n.\n.\n.\n*\"Thought\"* being the keyword here: it was silent for a while, but there was this dragging noise again. \n\n\nLiam: \"Shit!\"\n\n\nFearing for the worst I asked him what's wrong. And my guess was right:\n\n\n\"I'm out of bullets\", Liam said and drew a butterfly knife out of his pocket. \"I guess I'll have to do it the hard way then\", he sighed as he flipped the knife open. \n\n\nOne of the infected people had been hiding in the stairs for this whole time, and a terrible thought came into my mind: what if it did this on purpose? What if it sent its \"friends\" first so it could attack us when we're out of bullets? \n\n \nLiam: \"Lock yourself in that cage Ricky was in. And don't come out until I say so, you got it?\"\n\n\nBefore I could even answer something enormous tumbled down the stairs. \n\n\nNow I have to take a moment to describe what I saw. If this was a movie and I was the viewer I would think \"lol they overdid it big time\", but unfortunately this wasn't a movie and I didn't have popcorn. Instead I had a barking dog in my arms and a butterfly wielding guy on a suicide mission. \n\nAnd I'm not a scientist either but my best guess is the virus had now mutated because this thing -whatever it was- was about 7 feet tall and it consisted of arms and legs and loose skin. \nI think that some of the \"zombies\" had morphed into one snake-like creature that was now crawling towards us. It had a human head but it was melted into something unrecognizable, and black acid oozed through it's pores leaving a trail of corroded floor behind it. \n\n\nI started to run towards the cage and when I glanced over my shoulder Liam was preparing to fight the creature. I locked the cage and sat Ricky far in the back corner. Then I returned to the door and looked through the bars, fearing for Liam's life and my own. \n\n\nThe thing lifted its front body from the ground, like a snake that's about to attack. It spew the black liquid towards Liam but he dodged the acid shower just in time. Then it swung its \"tail\" at Liam, sweeping him off his sweet. I screamed for him to get up, get up before it's too late. \n\n\nLiam did a fast backwards roll and now he was back on his feet. The creature continued attacking him by throwing its heavy upper body at him, but Liam stepped aside just in time and let it bump into a wall. Now he was able to attack it from behind.\n\n\n\"Go get it!\" I screamed involuntary as I clenched my fists so hard that it hurt. \n\n\nLiam took his chance and sank the knife on that creature's back. Black acid sprayed from the wound and Liam quickly jumped back so he wouldn't get any of the venom on his face. The thing shrieked in pain and it swung its tail in all directions making the cage doors clatter loudly. \n\n\nI waited anxiously as Liam leaped towards the thing and aimed his knife in its occiput. The thing continued to struggle but Liam sank the knife even deeper into its skull and yanked it to make even more damage. There was no sign of fear in him, instead he looked determined, pissed off even.\n\n\nThe creature spewed its venom all over the basement while it thrashed around in agony. I held my breath while I waited for its next move. Liam backed away again, so he wouldn't get tackled anymore.\n\n\nFinally the thing gave up and fell to the floor. Liam wiped sweat off his forehead and kicked its lifeless body to make sure there was no danger anymore. Then he walked back to us and picked up the lock again so me and Ricky could get out of the cage. \n\n\nMe: \"Wow, that was awesome! Where did you learn to fight like that?\"\n\n\nRicky ran to Liam and jumped against his feet excitedly while wagging his tail.\n\n\nLiam: \"It's a long story but now I really need to shower.\" \n\n\n\nSo, now we're back in my apartment, Ricky, Liam and I. We still don't know how or when we get out, but I'm glad I'm not alone. \n\nThere's one thing that's worrying me though: I still don't know where that blood came from and I feel a bit dizzy. It might be just stress and tiredness but still, I'm scared. I haven't told Liam anything yet, but I'm considering it. \n\n\nI will later update on this same post again, as this was quite short and I don't want to flood reddit with countless posts. The next update could be the last one, since my time might be running out and we don't know how much longer we'll have electricity. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "65gnkk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 143, "report_reasons": null, "author": "lucifers_pet", "saved": false, "mod_reports": [], "name": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492228974.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65gnkk/lockdown_part_2/", "num_reports": null, "locked": false, "stickied": false, "created": 1492249822.0, "url": "https://www.reddit.com/r/nosleep/comments/65gnkk/lockdown_part_2/", "author_flair_text": null, "quarantine": false, "title": "Lock-down, part 2", "created_utc": 1492221022.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 143}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dga41vy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65gnkk%2Flockdown_part_2%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;to=RemindMeBot&amp;subject=Reminder) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65gnkk%2Flockdown_part_2%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;to=RemindMeBot&amp;amp;subject=Reminder\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dga41vy", "score_hidden": true, "stickied": true, "created": 1492249950.0, "created_utc": 1492221150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dgabxbb", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "joaquin55", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Fuck man are those zombies on steroids or something", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck man are those zombies on steroids or something&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgabxbb", "score_hidden": false, "stickied": false, "created": 1492262542.0, "created_utc": 1492233742.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dgav092", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "licatinezz", "parent_id": "t1_dgaltyo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "If you look at that piece of the story, there are random capital letters that together spell out \"lies\" not flies. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you look at that piece of the story, there are random capital letters that together spell out &amp;quot;lies&amp;quot; not flies. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgav092", "score_hidden": false, "stickied": false, "created": 1492303782.0, "created_utc": 1492274982.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaltyo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "bronwynnekulvi", "parent_id": "t1_dgak28v", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lol I thought that too, but reread and it says flies ;)\n\nETA: The capital L in 'fLies' could maybe possibly be her subconscious playing tricks on her because she's kinda lying to Liam about being afraid that she's infected..? (I personally believe her anxiety is playing on her though, and is being a hypochondriac lol. I've woken up with mystery blood on my pillow more times than I can count.) I know it's a stretch but it's all I've got lol...", "edited": 1492260706.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol I thought that too, but reread and it says flies ;)&lt;/p&gt;\n\n&lt;p&gt;ETA: The capital L in &amp;#39;fLies&amp;#39; could maybe possibly be her subconscious playing tricks on her because she&amp;#39;s kinda lying to Liam about being afraid that she&amp;#39;s infected..? (I personally believe her anxiety is playing on her though, and is being a hypochondriac lol. I&amp;#39;ve woken up with mystery blood on my pillow more times than I can count.) I know it&amp;#39;s a stretch but it&amp;#39;s all I&amp;#39;ve got lol...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaltyo", "score_hidden": false, "stickied": false, "created": 1492289198.0, "created_utc": 1492260398.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgak28v", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "moondorkbeams", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "\"LIES\" But what is the lie I wonder? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;LIES&amp;quot; But what is the lie I wonder? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgak28v", "score_hidden": false, "stickied": false, "created": 1492284895.0, "created_utc": 1492256095.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dgag1k9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "slumberwonder", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Liam sounds like an energetic  thrill seeker. Careful he doesn't push you to join in more of his adrenaline soaked missions. Get him to work on removing the wood from the balcony to burn off that energy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Liam sounds like an energetic  thrill seeker. Careful he doesn&amp;#39;t push you to join in more of his adrenaline soaked missions. Get him to work on removing the wood from the balcony to burn off that energy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgag1k9", "score_hidden": false, "stickied": false, "created": 1492272408.0, "created_utc": 1492243608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dgcqg4b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "slumberwonder", "parent_id": "t1_dgag3tu", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Worrying that there are bodies on the other side of an apartment wall. Should probably reinforce that wall. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Worrying that there are bodies on the other side of an apartment wall. Should probably reinforce that wall. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcqg4b", "score_hidden": false, "stickied": false, "created": 1492413233.0, "created_utc": 1492384433.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgag3tu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "kungfuryking", "parent_id": "t1_dgafzay", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "They've been in solid contact with it aside from digesting it. Chances are if its airborne or spread by contact theyd already have it.\nAlso theyve already killed off 22ish people, how many more would be left?\n\nBut on that note does sound like they come back so maybe seal off the basement with the other bodies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;ve been in solid contact with it aside from digesting it. Chances are if its airborne or spread by contact theyd already have it.\nAlso theyve already killed off 22ish people, how many more would be left?&lt;/p&gt;\n\n&lt;p&gt;But on that note does sound like they come back so maybe seal off the basement with the other bodies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgag3tu", "score_hidden": false, "stickied": false, "created": 1492272590.0, "created_utc": 1492243790.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafzay", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "slumberwonder", "parent_id": "t1_dgaeciq", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Probably stay inside for now. You don't know how this contagion spreads. It may well burn itself out quickly, since the initial outbreak was so fast.\n\nI don't want to make you feel even more anxious, but if you have a natural immunity you might need to be investigated by government scientists for a while...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably stay inside for now. You don&amp;#39;t know how this contagion spreads. It may well burn itself out quickly, since the initial outbreak was so fast.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to make you feel even more anxious, but if you have a natural immunity you might need to be investigated by government scientists for a while...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgafzay", "score_hidden": false, "stickied": false, "created": 1492272227.0, "created_utc": 1492243427.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaeciq", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "kungfuryking", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Liams a badarse. \nU guys need to raid neighbours houses for food/supplies.\nMake an axe of knives and some spears. Snap the ends off brooms and attach knives to them. \nIf u can slowly start extending your defensive area outside ur house.\nTell liam how u feel.\nLack of sleep, bad diet, low iron,stress etc could all lead to feeling dizzy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Liams a badarse. \nU guys need to raid neighbours houses for food/supplies.\nMake an axe of knives and some spears. Snap the ends off brooms and attach knives to them. \nIf u can slowly start extending your defensive area outside ur house.\nTell liam how u feel.\nLack of sleep, bad diet, low iron,stress etc could all lead to feeling dizzy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgaeciq", "score_hidden": false, "stickied": false, "created": 1492267905.0, "created_utc": 1492239105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dgay2fz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Straffer1", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You need to raid other houses and check for other uninfected survivors. If the apartment complex has a guard room, you may find ammo and other weapons there.\n\n\nYou also need to get to the roof of the building and see how far this has spread. Since your area was cut off and isolated from the rest of the world, I have a feeling that whatever this is started in your area.\n\nI also feel that this is a govt experiment, as they already cut your area off before any symptoms started showing in your neighbours.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to raid other houses and check for other uninfected survivors. If the apartment complex has a guard room, you may find ammo and other weapons there.&lt;/p&gt;\n\n&lt;p&gt;You also need to get to the roof of the building and see how far this has spread. Since your area was cut off and isolated from the rest of the world, I have a feeling that whatever this is started in your area.&lt;/p&gt;\n\n&lt;p&gt;I also feel that this is a govt experiment, as they already cut your area off before any symptoms started showing in your neighbours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgay2fz", "score_hidden": false, "stickied": false, "created": 1492307952.0, "created_utc": 1492279152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dgdf19q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lucifers_pet", "parent_id": "t1_dgadn7r", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I will (probably) update today on this same post! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will (probably) update today on this same post! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdf19q", "score_hidden": false, "stickied": false, "created": 1492460879.0, "created_utc": 1492432079.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadn7r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cihuapilli_89", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "All I've gotten so far is \"Dont you see lies...\" what message are you trying to send us??! Pleaae hurry and update so we know how we can help you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All I&amp;#39;ve gotten so far is &amp;quot;Dont you see lies...&amp;quot; what message are you trying to send us??! Pleaae hurry and update so we know how we can help you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgadn7r", "score_hidden": false, "stickied": false, "created": 1492266232.0, "created_utc": 1492237432.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65gnkk", "likes": null, "replies": "", "user_reports": [], "id": "dgdf2ho", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lucifers_pet", "parent_id": "t1_dgcqqa9", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I will (probably) update today on this same post! I'd like to say there's no need to worry but that'd be a lie. I've been wondering the same thing too, I mean I didn't see Liam around here before all this happened but then again it could be just because I rarely go outside... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will (probably) update today on this same post! I&amp;#39;d like to say there&amp;#39;s no need to worry but that&amp;#39;d be a lie. I&amp;#39;ve been wondering the same thing too, I mean I didn&amp;#39;t see Liam around here before all this happened but then again it could be just because I rarely go outside... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdf2ho", "score_hidden": false, "stickied": false, "created": 1492460947.0, "created_utc": 1492432147.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqqa9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "slumberwonder", "parent_id": "t3_65gnkk", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Any updates? I am very worried about you. I would have expected that the government would at least send you in some supplies and check on you by now. \n\n\nI am suspect that Liam is in on whatever is going on, though perhaps as a rogue agent. I would try and work out if he actually does live in your apartment complex. Why isn't he hunkering down with you in his place? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any updates? I am very worried about you. I would have expected that the government would at least send you in some supplies and check on you by now. &lt;/p&gt;\n\n&lt;p&gt;I am suspect that Liam is in on whatever is going on, though perhaps as a rogue agent. I would try and work out if he actually does live in your apartment complex. Why isn&amp;#39;t he hunkering down with you in his place? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcqqa9", "score_hidden": false, "stickied": false, "created": 1492413618.0, "created_utc": 1492384818.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]