[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, about 8 years ago I worked nights at a hotel. I was there for a few weeks. Just doing my job, y’know. It’s right off the highway, so there are other buildings around. And one right across the street. Like, this three-storey office park. It looked normal enough at first. After a few weeks, I started noticing something really wasn’t right about it.&lt;/p&gt;\n\n&lt;p&gt;When you first start a job--for me, anyway--you&amp;#39;re enthusiastic to excel and stuff. Cause you&amp;#39;re just happy to have a job. But after a few weeks, it’s like I’m no longer on probation and I get drawn into mischief. Like, I enjoyed digging around in the lost and found. I always wanted to find something juicy. Not just old toothpaste. Or get into the manager’s personnel files. Or I’d try to figure out which guests are prostitutes. I was the only employee in the building from 11pm to 7am. &lt;/p&gt;\n\n&lt;p&gt;Another thing I’d do was just look out the huge, plate glass window in the lobby, see what was going on out there. Suspicious individuals and cars or whatever. That’s really when the building across the street started to interest me.&lt;/p&gt;\n\n&lt;p&gt;I don’t even think I knew why it was captivating me at first. I kinda just kept looking, night after night, and it struck me, cause I just casually thought, “I wonder what businesses are there.” And that’s when I realized there didn’t seem to be any businesses there. I don’t mean, like, it’s an abandoned warehouse or the office space is for lease. I mean, the fluorescent lights are always on, there’s plenty of office furniture, I could make out plants, looked like it could be picture frames on the desks and a swivelling fan. So it’s set up like it’s used, but it’s just not. Ever. There are no cars in the parking lot. No people moving around inside. No security guards or janitors. I’ve covered my co-workers for midshift. Nothing ever happens there. &lt;/p&gt;\n\n&lt;p&gt;I know it’s stupid for this to bother me. But it really started to bother me. A lot. I mean, the utilities bills for a three-story office block have to be pretty high. It has to be insane when there’s no business inside to justify that. And it’s maintained, it looks clean. It’s not like it’s getting renovated. No-one’s carting asbestos out. Isn’t that just really weird? It’s just this big, stupid stone mystery sitting right across from me. And I’m not ashamed to say, it gave me bad vibes. Because it just made no sense. &lt;/p&gt;\n\n&lt;p&gt;I didn’t talk to anyone else at the hotel about it for quite a while. Generally, I just did my job and went home. I didn’t have much of a relationship with them. I’ve been this loner for a while. When I’d have things to talk about, I’d want to come home and tell my girl. But she’s been gone for a long time. Ten years now. Makes you think. Ten years feels like just a little bit ago now. One time ten years ago was like, ancient.&lt;/p&gt;\n\n&lt;p&gt;Anyway, one day I chat with the shuttle driver in the morning, just kinda ask him if he ever noticed the building. He says sure, it’s right in front of the hotel. I ask him if he noticed anything odd about it. He was busy logging receipts and ignored me. So I press him, did he ever see anyone going in or out of there. Maybe he was just annoyed because I was bugging him, but he seemed to get defensive and said something like, “Since you’re forcing me to answer, no, I never saw no-one go in.”&lt;/p&gt;\n\n&lt;p&gt;I start telling him how I’ve been watching it and that it’s really weird. He says it’s asbestos or something and I should stop worrying about it. “All mysteries just come down to money, sex, and human stupidity,” he said. I know he had no idea what he was saying, but that was such a sucker punch. I’ve chatted with him just a few times before and he’s the only one there that I’ve told about Shayla. He musta saw the look on my face, because he apologized. I just let it go. I figured I’d keep it to myself from now on, like I should have in the first place.&lt;/p&gt;\n\n&lt;p&gt;So… Shayla was my girlfriend ten years ago. She’s just an incredible person. Creative, always optimistic, liked to be involved in things, like helping the homeless and political protests. Not a jerk like me. I’d rather watch Netflix and keep to myself. And, I figured, since I was lucky enough to have her, I better put a ring on that. On spring break, we’re down in Cancun, being college kids, when I plan to propose. Knee and all, y’know. &lt;/p&gt;\n\n&lt;p&gt;It’s our last night there. We’re tired of partying and head to our cheap room around 2 AM. 3 AM, I wake up to pee. Her side of the bed is empty. I think she must be peeing too. But it was just the water left running in the sink. She’s not in the room. Not out on the balcony. Now I’m really worried. Nothing’s missing but her cheap camera. Like, wads of money left untouched. And her room key’s there on the nightstand. I got the police involved as quickly as possible. But there was just nothing. Like nothing at all to go on. One hour she’s there, the next gone with just the clothes on her back and a $20 camera. Ten years later, still not a trace of her.&lt;/p&gt;\n\n&lt;p&gt;That might be why I get so obsessed with mysteries and trying to find stuff now. So that’s that.&lt;/p&gt;\n\n&lt;p&gt;And here’s another one. There’s this girl I figured was a prostitute. She came to the hotel once before with these two black guys. They paid for the room with a credit card. Then they left her there.  Same thing happened again. She was pale, freckled, weirdly plump lips. They looked sore or something. Whatever. It’s her life. &lt;/p&gt;\n\n&lt;p&gt;That night she comes in the lobby and just starts eating Lays potato chips. She kept wiping her fingers on her jean shorts. She looked very young. Like barely 18. If that. I’m inputting reservations trying to ignore her. But she asks me why I have binoculars out. I had them out watching the building. But I just say to her, “I’ve seen you here before.” She tells me I’m wrong, that it must’ve been her sister. It’s pretty weird for her to just lie like that. I say something like, “You two look a lot alike,” and she agrees.&lt;/p&gt;\n\n&lt;p&gt;I see she keeps looking at me and the binoculars, so I tell her. I say I watch that building because it’s weird how nothing ever happens there. She says nothing happens in school either. Now I know she’s under 18 and I plan to call it in when she goes back up. Just then, I tell her that’s not what I mean. I tell her I mean literally nothing happens. And she tells me that’s bullshit, because she saw someone in there from her room. I feel my heart skip a beat. I ask her where. She just says, “Somewhere” and takes off to the elevator. The two black guys walk through the front doors right into the elevator after that. Almost like she was afraid to be seen in the lobby when they arrived.&lt;/p&gt;\n\n&lt;p&gt;A lot of things could’ve happened to Shayla. And you play that kind of thing out in your mind, y’know, when someone you love disappears. But that may have been the worst, in a way. Thinking she was “trafficked.” I mean, that girl could just be one of those guys’s girlfriend. What do I know? It just made me think that.&lt;/p&gt;\n\n&lt;p&gt;I kept looking at the building after that. I even went up into the staircase to get a better look from the stairs windows. I should’ve been manning the front desk. But I dunno, something about the way she said it—I kept looking. Scanning across the floors. You know when you’ve seen something a hundred times, the slightest difference stands out, even if you can’t really pinpoint it? It felt like that. Like I was overlooking something. And I was. It was like a little fraction of a shadow on a wall. But I knew it wasn’t there before. Whatever was casting the shadow was hidden. So I went all the way up to the roof for a better look.&lt;/p&gt;\n\n&lt;p&gt;For the first time in the month or two since I started watching that building, I saw someone inside. Not a janitor or businessperson like you’d think. Just a girl, dressed shabbily. She was beside a floor plant staring into the office space. It was kinda spooky. Because there was nothing there to stare it. It was office furniture and white walls. She wasn&amp;#39;t moving at all. &lt;/p&gt;\n\n&lt;p&gt;Here’s the weirdest thing. The part the creeps me out now thinking of it. The more I watched this girl, the more I became convinced that girl was Shayla. I knew I was convinced when I suddenly muttered her name outloud. Almost like she heard me, her head turned slightly right after that. It was her. I felt sure. But that made no sense at all. She disappeared ten years ago. A thousand miles away. It’s just… why? Why appear now? Why there? If it really was her, think about how crazy the coincidence would have to be that she was like squatting in this building that I just happened to be staring at. That’s what creeped me out so much. When I tried to answer the question, ‘Why?’ &lt;/p&gt;\n\n&lt;p&gt;I was going through this in my head when the doors to the third floor landing banged open. The sudden noise scared the crap out of me. My nerves were rattled enough. But now I felt instinctively like I was in danger. There was no reason to feel this way, but I was more scared than I’d ever been in my life. I didn’t even know who opened the doors. But I kept very still and listened. I recognized the voices of the two black guys. &lt;/p&gt;\n\n&lt;p&gt;They were talking about me. Asking why I had binoculars and saying like, “He wasn’t birdwatching, that’s for sure.” But they went down to the lobby. I didn’t feel relieved yet. Because they’d see I wasn’t at the desk. Would they come looking for me? &lt;/p&gt;\n\n&lt;p&gt;I looked back at the building to see what the girl was doing. She was gone. It felt like losing her all over again. Made up my mind to go across the road and search the building. I took the fourth floor to the back stairs. Because I was still afraid to go to the lobby.  I slipped around the hotel from the back. I was right, too. They were there waiting for me. One of them was milling around front of the desk. The other lounged casually in one of the lobby chairs. I watched them for a bit, hoping they&amp;#39;d just leave. I didn&amp;#39;t want to be observed. But they weren&amp;#39;t going anywhere. &lt;/p&gt;\n\n&lt;p&gt;So I just did it. Ran across the road to the building. It was weird to actually be there, at the front door. I looked back to the hotel. The guys were looking right at me. They looked either angry or puzzled. I couldn’t tell. I kept expecting someone to stop me. But the front door opened. No alarm. No lock. I walked right in.&lt;/p&gt;\n\n&lt;p&gt;It was quiet inside. The fluorescent lights hummed gently. Warm air pushed through the ventsh. My own heart made the most noise. Or it felt like it. I couldn&amp;#39;t believe squatters hadn&amp;#39;t taken up in this building. Without security or locks, warm air, it should be hobo central.&lt;/p&gt;\n\n&lt;p&gt;I looked back again. The two black guys were still in the lobby. One of them had changed, somehow. His head looked strange. I squinted and saw he had my binoculars. Except I still had my binoculars with me. So he had to have his own binoculars. And he was watching me. That disturbed me far more than it should have. &lt;/p&gt;\n\n&lt;p&gt;I kept going into the building. I came to a door with glass panes. There’s a well-lit stairwell behind. I start climbing to the third floor. Still no alarms. Nothing to stop me. No-one waited at the top of the stairs. I emerged into the third floor office space and found it as dead as the first. In the spot the girl had been standing, there was just the plant now. &lt;/p&gt;\n\n&lt;p&gt;I walked cautiously to the spot beside the plant. I had this intense feeling that I shouldn’t be there. There was a faint outline of footprints at the spot. Not shoeprints. Footprints. I may have been reading that into the patterns in the tile, but I don’t think so. &lt;/p&gt;\n\n&lt;p&gt;I looked up to where the girl had been staring. The walls weren&amp;#39;t bare, actually. There was a framed motivational poster. I never noticed it before. &amp;quot;Get Ahead!&amp;quot; was the slogan. The poster itself was a photograph of a beautiful, east coast beach with some people enjoying it. I was prepared to leave the spot and explore further. But something about the poster bothered me. I kept looking at it. It was your usual, lame motivational photo. I didn&amp;#39;t know why I was so intrigued. &lt;/p&gt;\n\n&lt;p&gt;Then I saw it. The people. They looked like children playing, adults sunbathing. Very innocent. Until I looked closer. The children were laughing and dismembering a human body. A short distance away from this, a woman was buried up to her neck in the sand. &lt;/p&gt;\n\n&lt;p&gt;I turned away from the awful poster. Out the window I saw the black guys still in the lobby. One of them, at any rate. He was close to the window, looking forward. The girl, Shayla, had crossed the road and was entering the hotel. I pounded the glass to get her attention, but she was already inside. I put my binoculars up to watch. She was talking to the one of the guys.&lt;/p&gt;\n\n&lt;p&gt;I hurried back down the stairs, taking two steps at a time, and through the cubicles of the first floor. As I crossed the road, the elevator framed the girl. I was sure, completely sure now it was Shayla. She was between the two black guys. The doors closed before I made it across the street.&lt;/p&gt;\n\n&lt;p&gt;When I got back to the hotel lobby, I went behind the front desk for the master keycard. Then I dashed up the stairwell to the third floor, again taking two steps at a time. I remembered the room I put them in, too, because I planned to call it in, right? &lt;/p&gt;\n\n&lt;p&gt;I hesitated at the door. I&amp;#39;m not a courageous man. I didn’t want to get knifed. But I opened it.&lt;/p&gt;\n\n&lt;p&gt;The room was abandoned. I checked the bathroom. The shower had been used, but was presently unoccupied. Same with the bed. The room didn&amp;#39;t smell of sex. There were no condoms in the trash can. When I saw the room empty, I went back to check the stairwell. I heard the lobby door slam. I shot down those stairs crazy fast. But when I got down, I couldn&amp;#39;t find any sign of the guys. I didn’t hear or see any car squealing off. They were just gone. With both girls. &lt;/p&gt;\n\n&lt;p&gt;I went back to the room. I knew it was the right room. I checked later, to be sure. There was only one thing left behind in that room. I don&amp;#39;t know what it means. My gut tells me I don&amp;#39;t want to know. It was a jar, left under the covers of the unmade bed. The jar was filled with a fine, light sand. &lt;/p&gt;\n\n&lt;p&gt;I worked at that hotel another four years and I never saw those guys again. Never saw the girl. Never saw anything else strange in that building. The credit card turned out to be stolen. Their names likely made up. Even the mysterious building was leased to a call center only a few weeks later and it was a normal business. &lt;/p&gt;\n\n&lt;p&gt;This has been bothering me for a long time now. I just really wanted to get it out there.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, about 8 years ago I worked nights at a hotel. I was there for a few weeks. Just doing my job, y’know. It’s right off the highway, so there are other buildings around. And one right across the street. Like, this three-storey office park. It looked normal enough at first. After a few weeks, I started noticing something really wasn’t right about it.\n\nWhen you first start a job--for me, anyway--you're enthusiastic to excel and stuff. Cause you're just happy to have a job. But after a few weeks, it’s like I’m no longer on probation and I get drawn into mischief. Like, I enjoyed digging around in the lost and found. I always wanted to find something juicy. Not just old toothpaste. Or get into the manager’s personnel files. Or I’d try to figure out which guests are prostitutes. I was the only employee in the building from 11pm to 7am. \n\nAnother thing I’d do was just look out the huge, plate glass window in the lobby, see what was going on out there. Suspicious individuals and cars or whatever. That’s really when the building across the street started to interest me.\n\nI don’t even think I knew why it was captivating me at first. I kinda just kept looking, night after night, and it struck me, cause I just casually thought, “I wonder what businesses are there.” And that’s when I realized there didn’t seem to be any businesses there. I don’t mean, like, it’s an abandoned warehouse or the office space is for lease. I mean, the fluorescent lights are always on, there’s plenty of office furniture, I could make out plants, looked like it could be picture frames on the desks and a swivelling fan. So it’s set up like it’s used, but it’s just not. Ever. There are no cars in the parking lot. No people moving around inside. No security guards or janitors. I’ve covered my co-workers for midshift. Nothing ever happens there. \n\nI know it’s stupid for this to bother me. But it really started to bother me. A lot. I mean, the utilities bills for a three-story office block have to be pretty high. It has to be insane when there’s no business inside to justify that. And it’s maintained, it looks clean. It’s not like it’s getting renovated. No-one’s carting asbestos out. Isn’t that just really weird? It’s just this big, stupid stone mystery sitting right across from me. And I’m not ashamed to say, it gave me bad vibes. Because it just made no sense. \n\nI didn’t talk to anyone else at the hotel about it for quite a while. Generally, I just did my job and went home. I didn’t have much of a relationship with them. I’ve been this loner for a while. When I’d have things to talk about, I’d want to come home and tell my girl. But she’s been gone for a long time. Ten years now. Makes you think. Ten years feels like just a little bit ago now. One time ten years ago was like, ancient.\n\nAnyway, one day I chat with the shuttle driver in the morning, just kinda ask him if he ever noticed the building. He says sure, it’s right in front of the hotel. I ask him if he noticed anything odd about it. He was busy logging receipts and ignored me. So I press him, did he ever see anyone going in or out of there. Maybe he was just annoyed because I was bugging him, but he seemed to get defensive and said something like, “Since you’re forcing me to answer, no, I never saw no-one go in.”\n\nI start telling him how I’ve been watching it and that it’s really weird. He says it’s asbestos or something and I should stop worrying about it. “All mysteries just come down to money, sex, and human stupidity,” he said. I know he had no idea what he was saying, but that was such a sucker punch. I’ve chatted with him just a few times before and he’s the only one there that I’ve told about Shayla. He musta saw the look on my face, because he apologized. I just let it go. I figured I’d keep it to myself from now on, like I should have in the first place.\n\nSo… Shayla was my girlfriend ten years ago. She’s just an incredible person. Creative, always optimistic, liked to be involved in things, like helping the homeless and political protests. Not a jerk like me. I’d rather watch Netflix and keep to myself. And, I figured, since I was lucky enough to have her, I better put a ring on that. On spring break, we’re down in Cancun, being college kids, when I plan to propose. Knee and all, y’know. \n\nIt’s our last night there. We’re tired of partying and head to our cheap room around 2 AM. 3 AM, I wake up to pee. Her side of the bed is empty. I think she must be peeing too. But it was just the water left running in the sink. She’s not in the room. Not out on the balcony. Now I’m really worried. Nothing’s missing but her cheap camera. Like, wads of money left untouched. And her room key’s there on the nightstand. I got the police involved as quickly as possible. But there was just nothing. Like nothing at all to go on. One hour she’s there, the next gone with just the clothes on her back and a $20 camera. Ten years later, still not a trace of her.\n\nThat might be why I get so obsessed with mysteries and trying to find stuff now. So that’s that.\n\nAnd here’s another one. There’s this girl I figured was a prostitute. She came to the hotel once before with these two black guys. They paid for the room with a credit card. Then they left her there.  Same thing happened again. She was pale, freckled, weirdly plump lips. They looked sore or something. Whatever. It’s her life. \n\nThat night she comes in the lobby and just starts eating Lays potato chips. She kept wiping her fingers on her jean shorts. She looked very young. Like barely 18. If that. I’m inputting reservations trying to ignore her. But she asks me why I have binoculars out. I had them out watching the building. But I just say to her, “I’ve seen you here before.” She tells me I’m wrong, that it must’ve been her sister. It’s pretty weird for her to just lie like that. I say something like, “You two look a lot alike,” and she agrees.\n\nI see she keeps looking at me and the binoculars, so I tell her. I say I watch that building because it’s weird how nothing ever happens there. She says nothing happens in school either. Now I know she’s under 18 and I plan to call it in when she goes back up. Just then, I tell her that’s not what I mean. I tell her I mean literally nothing happens. And she tells me that’s bullshit, because she saw someone in there from her room. I feel my heart skip a beat. I ask her where. She just says, “Somewhere” and takes off to the elevator. The two black guys walk through the front doors right into the elevator after that. Almost like she was afraid to be seen in the lobby when they arrived.\n\nA lot of things could’ve happened to Shayla. And you play that kind of thing out in your mind, y’know, when someone you love disappears. But that may have been the worst, in a way. Thinking she was “trafficked.” I mean, that girl could just be one of those guys’s girlfriend. What do I know? It just made me think that.\n\nI kept looking at the building after that. I even went up into the staircase to get a better look from the stairs windows. I should’ve been manning the front desk. But I dunno, something about the way she said it—I kept looking. Scanning across the floors. You know when you’ve seen something a hundred times, the slightest difference stands out, even if you can’t really pinpoint it? It felt like that. Like I was overlooking something. And I was. It was like a little fraction of a shadow on a wall. But I knew it wasn’t there before. Whatever was casting the shadow was hidden. So I went all the way up to the roof for a better look.\n\nFor the first time in the month or two since I started watching that building, I saw someone inside. Not a janitor or businessperson like you’d think. Just a girl, dressed shabbily. She was beside a floor plant staring into the office space. It was kinda spooky. Because there was nothing there to stare it. It was office furniture and white walls. She wasn't moving at all. \n\nHere’s the weirdest thing. The part the creeps me out now thinking of it. The more I watched this girl, the more I became convinced that girl was Shayla. I knew I was convinced when I suddenly muttered her name outloud. Almost like she heard me, her head turned slightly right after that. It was her. I felt sure. But that made no sense at all. She disappeared ten years ago. A thousand miles away. It’s just… why? Why appear now? Why there? If it really was her, think about how crazy the coincidence would have to be that she was like squatting in this building that I just happened to be staring at. That’s what creeped me out so much. When I tried to answer the question, ‘Why?’ \n\nI was going through this in my head when the doors to the third floor landing banged open. The sudden noise scared the crap out of me. My nerves were rattled enough. But now I felt instinctively like I was in danger. There was no reason to feel this way, but I was more scared than I’d ever been in my life. I didn’t even know who opened the doors. But I kept very still and listened. I recognized the voices of the two black guys. \n\nThey were talking about me. Asking why I had binoculars and saying like, “He wasn’t birdwatching, that’s for sure.” But they went down to the lobby. I didn’t feel relieved yet. Because they’d see I wasn’t at the desk. Would they come looking for me? \n\nI looked back at the building to see what the girl was doing. She was gone. It felt like losing her all over again. Made up my mind to go across the road and search the building. I took the fourth floor to the back stairs. Because I was still afraid to go to the lobby.  I slipped around the hotel from the back. I was right, too. They were there waiting for me. One of them was milling around front of the desk. The other lounged casually in one of the lobby chairs. I watched them for a bit, hoping they'd just leave. I didn't want to be observed. But they weren't going anywhere. \n\nSo I just did it. Ran across the road to the building. It was weird to actually be there, at the front door. I looked back to the hotel. The guys were looking right at me. They looked either angry or puzzled. I couldn’t tell. I kept expecting someone to stop me. But the front door opened. No alarm. No lock. I walked right in.\n\nIt was quiet inside. The fluorescent lights hummed gently. Warm air pushed through the ventsh. My own heart made the most noise. Or it felt like it. I couldn't believe squatters hadn't taken up in this building. Without security or locks, warm air, it should be hobo central.\n\nI looked back again. The two black guys were still in the lobby. One of them had changed, somehow. His head looked strange. I squinted and saw he had my binoculars. Except I still had my binoculars with me. So he had to have his own binoculars. And he was watching me. That disturbed me far more than it should have. \n\nI kept going into the building. I came to a door with glass panes. There’s a well-lit stairwell behind. I start climbing to the third floor. Still no alarms. Nothing to stop me. No-one waited at the top of the stairs. I emerged into the third floor office space and found it as dead as the first. In the spot the girl had been standing, there was just the plant now. \n\nI walked cautiously to the spot beside the plant. I had this intense feeling that I shouldn’t be there. There was a faint outline of footprints at the spot. Not shoeprints. Footprints. I may have been reading that into the patterns in the tile, but I don’t think so. \n\nI looked up to where the girl had been staring. The walls weren't bare, actually. There was a framed motivational poster. I never noticed it before. \"Get Ahead!\" was the slogan. The poster itself was a photograph of a beautiful, east coast beach with some people enjoying it. I was prepared to leave the spot and explore further. But something about the poster bothered me. I kept looking at it. It was your usual, lame motivational photo. I didn't know why I was so intrigued. \n\nThen I saw it. The people. They looked like children playing, adults sunbathing. Very innocent. Until I looked closer. The children were laughing and dismembering a human body. A short distance away from this, a woman was buried up to her neck in the sand. \n\nI turned away from the awful poster. Out the window I saw the black guys still in the lobby. One of them, at any rate. He was close to the window, looking forward. The girl, Shayla, had crossed the road and was entering the hotel. I pounded the glass to get her attention, but she was already inside. I put my binoculars up to watch. She was talking to the one of the guys.\n\nI hurried back down the stairs, taking two steps at a time, and through the cubicles of the first floor. As I crossed the road, the elevator framed the girl. I was sure, completely sure now it was Shayla. She was between the two black guys. The doors closed before I made it across the street.\n\nWhen I got back to the hotel lobby, I went behind the front desk for the master keycard. Then I dashed up the stairwell to the third floor, again taking two steps at a time. I remembered the room I put them in, too, because I planned to call it in, right? \n\nI hesitated at the door. I'm not a courageous man. I didn’t want to get knifed. But I opened it.\n\nThe room was abandoned. I checked the bathroom. The shower had been used, but was presently unoccupied. Same with the bed. The room didn't smell of sex. There were no condoms in the trash can. When I saw the room empty, I went back to check the stairwell. I heard the lobby door slam. I shot down those stairs crazy fast. But when I got down, I couldn't find any sign of the guys. I didn’t hear or see any car squealing off. They were just gone. With both girls. \n\nI went back to the room. I knew it was the right room. I checked later, to be sure. There was only one thing left behind in that room. I don't know what it means. My gut tells me I don't want to know. It was a jar, left under the covers of the unmade bed. The jar was filled with a fine, light sand. \n\nI worked at that hotel another four years and I never saw those guys again. Never saw the girl. Never saw anything else strange in that building. The credit card turned out to be stolen. Their names likely made up. Even the mysterious building was leased to a call center only a few weeks later and it was a normal business. \n\nThis has been bothering me for a long time now. I just really wanted to get it out there.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hjt3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 383, "report_reasons": null, "author": "nazisharks", "saved": false, "mod_reports": [], "name": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "trophy", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65hjt3/the_building_across_the_street/", "num_reports": null, "locked": false, "stickied": false, "created": 1492262789.0, "url": "https://www.reddit.com/r/nosleep/comments/65hjt3/the_building_across_the_street/", "author_flair_text": "November 2016", "quarantine": false, "title": "The Building Across the Street", "created_utc": 1492233989.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 383}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgahuuh", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "Joeenid1", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's a beautifully written story. And terribly sad, too...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a beautifully written story. And terribly sad, too...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgahuuh", "score_hidden": false, "stickied": false, "created": 1492278066.0, "created_utc": 1492249266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbltez", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nazisharks", "parent_id": "t1_dgblfse", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Julian Sands was great in Warlock, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Julian Sands was great in Warlock, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbltez", "score_hidden": false, "stickied": false, "created": 1492341398.0, "created_utc": 1492312598.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbngbr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DemonsNMySleep", "parent_id": "t1_dgblfse", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "&gt; I hate sand. It's course, irritating and gets everywhere.\n\nOkay, Anakin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I hate sand. It&amp;#39;s course, irritating and gets everywhere.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Okay, Anakin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbngbr", "score_hidden": false, "stickied": false, "created": 1492343951.0, "created_utc": 1492315151.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgblfse", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "xJoeKingz", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I hate sand. It's course, irritating and gets everywhere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate sand. It&amp;#39;s course, irritating and gets everywhere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgblfse", "score_hidden": false, "stickied": false, "created": 1492340822.0, "created_utc": 1492312022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbb3ek", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "NoobStudios", "parent_id": "t1_dgb9e21", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It's not. i Refuse. You're a Nazi Shark. You can do it. Hail Nosleep. Write more. Get fucking angelica to write more. I WANT MORE", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not. i Refuse. You&amp;#39;re a Nazi Shark. You can do it. Hail Nosleep. Write more. Get fucking angelica to write more. I WANT MORE&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbb3ek", "score_hidden": false, "stickied": false, "created": 1492325913.0, "created_utc": 1492297113.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9e21", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "nazisharks", "parent_id": "t1_dgb7ymi", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's all there is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s all there is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb9e21", "score_hidden": false, "stickied": false, "created": 1492323415.0, "created_utc": 1492294615.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7ymi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Bosombuddies", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That was so interesting, and then an huge cliffhanger. Will there be more to the story? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was so interesting, and then an huge cliffhanger. Will there be more to the story? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb7ymi", "score_hidden": false, "stickied": false, "created": 1492321419.0, "created_utc": 1492292619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbeymq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "sbmt13004", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That had me on the edge of my seat. So many unanswered questions. It seems like some of the people you ran into had some sort of knowledge about that building, like the bus driver. Why not pester him more into telling you what he knows? You were still wondering about shaylas disappearance 10 years later, why lose it after another 4? I say try to get this thung solved", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That had me on the edge of my seat. So many unanswered questions. It seems like some of the people you ran into had some sort of knowledge about that building, like the bus driver. Why not pester him more into telling you what he knows? You were still wondering about shaylas disappearance 10 years later, why lose it after another 4? I say try to get this thung solved&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbeymq", "score_hidden": false, "stickied": false, "created": 1492331416.0, "created_utc": 1492302616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgb7o61", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Fantaffan", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Damn. Nice story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn. Nice story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb7o61", "score_hidden": false, "stickied": false, "created": 1492321019.0, "created_utc": 1492292219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgble20", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nazisharks", "parent_id": "t1_dgbi1to", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's so weird, isn't it? I mean, who pays the overhead on that? What's the purpose of keeping up the facade of activity? It just gets the imagination going. Glad it didn't get any creepier for you, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s so weird, isn&amp;#39;t it? I mean, who pays the overhead on that? What&amp;#39;s the purpose of keeping up the facade of activity? It just gets the imagination going. Glad it didn&amp;#39;t get any creepier for you, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgble20", "score_hidden": false, "stickied": false, "created": 1492340753.0, "created_utc": 1492311953.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbi1to", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kizzzatie", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I love love love your stories!\n\nThe building really reminds me a lot of this office below me in a building I used to work in at my last job. The company was Edgewater Technology- where Michael McDermott shot and killed a bunch of his coworkers back in 2000. \n\nEdgewater stayed open after the incident and in 2008, my job moved into the office space above theirs (they took up the entire floor below us.) The creepy part was that, at least from the front entrance, the entire business was completely empty. All the lights were on, and there were rows and rows of cubicles with computer terminals on, ready and waiting, but no one ever at the desks. For five years, I walked into work every morning and passed by the all glass front to their office and wondered wtf was even going on in there. We'd go out to lunch and leave for the day and same thing, no one was ever there. I never saw a single Edgewater employee outside or around the area either. \n\nIf they are there, I hope they're all ok :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love love love your stories!&lt;/p&gt;\n\n&lt;p&gt;The building really reminds me a lot of this office below me in a building I used to work in at my last job. The company was Edgewater Technology- where Michael McDermott shot and killed a bunch of his coworkers back in 2000. &lt;/p&gt;\n\n&lt;p&gt;Edgewater stayed open after the incident and in 2008, my job moved into the office space above theirs (they took up the entire floor below us.) The creepy part was that, at least from the front entrance, the entire business was completely empty. All the lights were on, and there were rows and rows of cubicles with computer terminals on, ready and waiting, but no one ever at the desks. For five years, I walked into work every morning and passed by the all glass front to their office and wondered wtf was even going on in there. We&amp;#39;d go out to lunch and leave for the day and same thing, no one was ever there. I never saw a single Edgewater employee outside or around the area either. &lt;/p&gt;\n\n&lt;p&gt;If they are there, I hope they&amp;#39;re all ok :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbi1to", "score_hidden": false, "stickied": false, "created": 1492335835.0, "created_utc": 1492307035.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbjda1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kirachelle", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I devour your stories. More please!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I devour your stories. More please!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbjda1", "score_hidden": false, "stickied": false, "created": 1492337775.0, "created_utc": 1492308975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbw7wj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "InvincibleSummer1066", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Wow. This story scared me a lot. Something is just so wrong in the situation, but it's incredibly difficult to explain why this sort of wrongness is worse than more overtly scary things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. This story scared me a lot. Something is just so wrong in the situation, but it&amp;#39;s incredibly difficult to explain why this sort of wrongness is worse than more overtly scary things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbw7wj", "score_hidden": false, "stickied": false, "created": 1492365433.0, "created_utc": 1492336633.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbtysw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Shallowchest", "parent_id": "t1_dgbm9bh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Hello fellow Greensborian! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello fellow Greensborian! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbtysw", "score_hidden": false, "stickied": false, "created": 1492357946.0, "created_utc": 1492329146.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbm9bh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "centeredspiral", "parent_id": "t1_dgbl70a", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There is another one in Greensboro North Carolina. Not a multi-story office building, this is a one story location, but all other details are the same. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is another one in Greensboro North Carolina. Not a multi-story office building, this is a one story location, but all other details are the same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbm9bh", "score_hidden": false, "stickied": false, "created": 1492342082.0, "created_utc": 1492313282.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbl70a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nazisharks", "parent_id": "t1_dgbftx3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This was in Ottawa, Canada. Near the St. Laurent Mall, there's a cluster of 2 and 3 star hotels. And the building's there, across the street from one of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was in Ottawa, Canada. Near the St. Laurent Mall, there&amp;#39;s a cluster of 2 and 3 star hotels. And the building&amp;#39;s there, across the street from one of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbl70a", "score_hidden": false, "stickied": false, "created": 1492340462.0, "created_utc": 1492311662.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbftx3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "centeredspiral", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I dont know what city this is in, but I have seen another one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dont know what city this is in, but I have seen another one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbftx3", "score_hidden": false, "stickied": false, "created": 1492332652.0, "created_utc": 1492303852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgbmbrd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kat62914", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I think the sand and the poster have a connection. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the sand and the poster have a connection. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbmbrd", "score_hidden": false, "stickied": false, "created": 1492342185.0, "created_utc": 1492313385.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65hjt3", "likes": null, "replies": "", "user_reports": [], "id": "dgcgo2n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JediGuyB", "parent_id": "t3_65hjt3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm frustrated at the lack of answers. This would eat me up inside. The guys make it sound like trafficking, but why watch inside the building? Why did they care? Why was the other girl on the building? Maybe it had secret rooms or something? The poster also seems for some sort of murder vacation, but why is it in the building? \n\nAll I can conclude is the building was a front for trafficking and the poster was just done sort of morbid joke a guy put in there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m frustrated at the lack of answers. This would eat me up inside. The guys make it sound like trafficking, but why watch inside the building? Why did they care? Why was the other girl on the building? Maybe it had secret rooms or something? The poster also seems for some sort of murder vacation, but why is it in the building? &lt;/p&gt;\n\n&lt;p&gt;All I can conclude is the building was a front for trafficking and the poster was just done sort of morbid joke a guy put in there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcgo2n", "score_hidden": false, "stickied": false, "created": 1492400288.0, "created_utc": 1492371488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]