[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always looked up to my older sister. I copied everything she did, much to her annoyance. When her friends came over, I followed them around the house until Anabelle went into her room with them, shutting and locking the door. &lt;/p&gt;\n\n&lt;p&gt;Anabelle started getting interested in darker stuff when she hit 15. Being just two years younger than her, I was branded the annoying little sister who wasn&amp;#39;t cool and she became more hostile towards me whenever I tried to spend time with her. &lt;/p&gt;\n\n&lt;p&gt;It really brought me down, I didn&amp;#39;t know how to react. My big sister hated me. She didn&amp;#39;t want me around anymore. I remember when i was 7 and she was 9, we would play house with our Bratz dolls. I just wanted everything to go back to the way it was.&lt;/p&gt;\n\n&lt;p&gt;Soon after her 16th birthday, Anabelle started sneaking out of the house. I knew what she was doing. She was going to a graveyard to meet her boyfriend she met online, who just happened to live in our town. I knew this because she once left her laptop on and running and being the snotty little brat I was at 14 I snooped. &lt;/p&gt;\n\n&lt;p&gt;She snuck back inside, through her window, at about 4AM. Our rooms were right beside each others, and I heard her come in. I heard some clashing and banging but it stopped when I got up to go knock on her door. I went back to sleep. When I woke up at 8pm to get ready for school, the house was oddly silent. I was hungry, so I walked downstairs to get some cereal in my stomach. What I saw next sent a wave of panic through me. &lt;/p&gt;\n\n&lt;p&gt;There were bloody footprints all over the kitchen, coming down from our tile stairs. My favorite cereal, Mini Wheats Cinnamon Flavor, was knocked over, there were random pieces of it scattered along the floor. I bent down to look at the foot prints a little more closely. I realized the bottom of my owl slippers matched the foot prints exactly. There was dried blood on them. Why would someone wear my shoes - not even my shoes, but my dirty sweaty feet slippers to potentially commit a crime? To frame me? I thought about it, then I remembered the clashing and banging in Anabelle&amp;#39;s room. I ran back up the stairs to her room. I opened the door and found my big sister with a steak knife stuck in her heart. Had the boy that she met online followed her home and killed her? I had to check on Mom and Dad. I walked quietly to their room, afraid the killer could still be in the house.&lt;/p&gt;\n\n&lt;p&gt;Mom had her throat slit. Dad was stabbed multiple times, there was a knife in his eye. I threw up in my mouth. I ran to the neighbors and told them that my house had been broken into and my family was dead. &lt;/p&gt;\n\n&lt;p&gt;When the police came, I saw the dead bodies be wheeled into the ambulances. That&amp;#39;s the last thing I remember. The doctors told me I fainted from shock. &lt;/p&gt;\n\n&lt;p&gt;I woke up in a nice yellow room on a tan single bed. I got up but they told me to lay back down, that I needed the rest before the detectives came in to question me. I was restless, so the younger looking one pulled a laptop from under her chair. It was open to this site, so I&amp;#39;m writing here.&lt;/p&gt;\n\n&lt;p&gt;I found out from the detectives that I was the main suspect in the murders. My fingerprints were on all the murder weapons. They were playing good cop bad cop with me, and the bad cop told me I would be in inpatient treatment for a very long time. Good cop told me I was very sick in the head, that they read my posts online apparently saying I was into the occult and I was going to murder my entire family as a sacrifice to Satan. &lt;/p&gt;\n\n&lt;p&gt;I tried to tell them that I didn&amp;#39;t have a laptop, I wasn&amp;#39;t allowed one until I hit 16. I told them Anabelle had a laptop but I wasn&amp;#39;t allowed on it. The good cop gave me a weak smile. &lt;/p&gt;\n\n&lt;p&gt;Later on, the good doctor came in and talked to me. He listened to me and said he believed that I didn&amp;#39;t kill my family. Finally. He asked me if I could recall anything from that night and I just told him about the clattering and banging from Anabelle&amp;#39;s room. He told me I should rest a little more. About 20 minutes later, a nurse, who I nicknamed Blondie, came in and gave me two orange capsules. I&amp;#39;m getting drowsy so I&amp;#39;m going to end this here. I&amp;#39;m just so glad someone knows I didn&amp;#39;t do that to my family.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Patient D, formerly known as Amiee Anabelle Laurson, does not remember murdering her entire family. She has completely blanked it out of her mind. Multiple Personality disorder suspected, as she had no siblings. Alter &amp;quot;Anabelle&amp;quot; most likely stemmed from childhood sexual abuse, presumably by Patient D&amp;#39;s father, as his genitals were mutilated. The boy she met at the graveyard has been attained, he is now Patient J, more on him in a later email. For a girl of only 14, these murders were brutal. Which leads me to my next point, we can use this to our advantage. Our perfect little murdering machine. I think we finally found the one to host our greatest creation yet. Best regards, - Dr. Sam&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Update 1: I just woke up, no one is in the room with me this time. The laptop they gave me is open on the page to edit this. There&amp;#39;s a huge blank space in between me saying that I was going to sleep and what I&amp;#39;m writing right now. Oh, and I woke up to a sharp pain in my neck. It&amp;#39;s actually what woke me up, I was dreaming I was 6 fighting Anabelle for her new Dora toy she got for Christmas. I wanted it so bad, I had begged my parents to get me it for months, and they got it for Her. Another memory I&amp;#39;m thinking of right now is when Mom fell down the stairs and I was right behind her, I heard her ribs crack. She called out for help but I remained on the stairs, frozen. I blacked out once again. I black out a lot, actually. &lt;/p&gt;\n\n&lt;p&gt;They never told me what those pills they gave me were. All I remember is about five minutes after taking them I felt drowsy, pills dont work that fast, do they? My head is starting to spin, I feel dizzy. I feel like something or someone else is trying to control my body. I have to stop typing again. Can anyone tell me if theres text where the blank space is? &lt;/p&gt;\n\n&lt;p&gt;Update 2: The good doctor came back in and asked me to recall what happened, again. I swore at him.I spit at him. I already told him! I didn&amp;#39;t kill my family! How many times do I have to say it! He said he believed me! He didn&amp;#39;t close my door fully when he left to get an orderly, and I heard him talk to someone about &amp;quot;the boy she met up with&amp;quot; they said he&amp;#39;s fighting against his restraints...so does the boy that Anabelle met up with have something to do with my families murder? I&amp;#39;m so confused. In about a minute, the same two people that were sitting on either side of me last time came back in. So now I have to be monitored? Just because I told the doctor something he already knows? Bullshit! &lt;/p&gt;\n\n&lt;p&gt;The same nurse came back in again, this time holding a pink pill in a paper cup. &amp;quot;This will help you calm down, sweetie. Please just take it, if you cause anymore trouble we are going to have to restrain you, you wouldn&amp;#39;t like that, would you?&amp;quot; I glared at her. I took the pill and swallowed it, the taste stayed in my mouth. I gagged. &amp;quot;Good girl.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;If me swearing and spitting in the doctors face was enough to warrant restraints I wonder what that boy did. &lt;/p&gt;\n\n&lt;p&gt;About 15 minutes after i took the pink pill, I started having violent visions where I stabbed someone, but they had no face. And then another person. And one more. They bled, but they had no faces. What does that mean? Why did the pill make me feel this way? &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Patient D was given [REDACTED] 700mg. It didn&amp;#39;t work like we hoped it would, but we still made progress. I&amp;#39;m going to let her rest for the rest of the day. I don&amp;#39;t want to tire our subject out anymore than I already have. She hasn&amp;#39;t noticed that the laptop she was given is bugged. Not very observant. Note that one down. Will need to fix that, all in good time. About Patient J, he&amp;#39;s really not taking to his restraints, but it&amp;#39;s fun to watch him squirm and shout that he&amp;#39;s going to kill us all. When he passes out from exhaustion, he will be given 1500mg of [REDACTED] administered through the jugular vein, it will make him docile. If anyone has any questions regarding our two new subjects, come down to my office. Best regards, - Dr. Sam&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Update #3: There is another huge chunk of blankness between my previous update and this one. I don&amp;#39;t understand. I fell asleep for about 30 more minutes, and I dreamed of a world with faceless people. Like completely human in every way but they had. no. faces. I&amp;#39;ve never had a dream like that in my life.  I can&amp;#39;t access any other site besides this, I&amp;#39;ve tried. I tried to go on the website that I remember Anabelle going on all the time but it comes up with an error message. &lt;/p&gt;\n\n&lt;p&gt;About the unit I&amp;#39;m in, I&amp;#39;m not technically on lock down or anything, but there are orderlies standing outside my door. The nurse came in to give me some shot. She said it would make me remember. Remember what? I have no idea. I know I did not kill my family. I know it. I have never been violent in my life, I have never sleep walked, I have never had any intrusive thoughts. The good doctor hasn&amp;#39;t been back in my room yet. The pain in my neck is back. I don&amp;#39;t really know what caused it. I remember when I was about five or six, I fell off a swing and somehow bashed my head into a metal pole. I remember crying a lot but Mom bought me ice cream and I eventually stopped. I want to see what happens when I try and leave this room. I have no energy though, I&amp;#39;ve gotten up from my bed twice to use the rest room. I remember when i was 7 and Anabelle was 9, we moved into a new house. There were two bedrooms with a bathroom. Mom and Dad got one of course, but Anabelle and I argued and argued until she punched me in the nose and I started crying. Mom ran to see what all the fuss was about, when she saw my bleeding nose, she yelled at Anabelle.  I have nothing else to do but describe my surroundings, repeat myself saying that I didn&amp;#39;t kill my family, and think back on memories. When I was 11, I still had an imaginary friend. His name was Bubbles. Bubbles didn&amp;#39;t like Anabelle or Dad. He never told me to hurt them or anything, he just told me one day we would be together and I would be away from all the negativity. Bubbles...talked to me through the vents. Which now that I&amp;#39;m thinking about it is kind of creeping me out. What if it wasn&amp;#39;t my imagination and there was someone in our air vents talking to me every night? What if I&amp;#39;m here and Bubbles is here too? He sounded like a grown up to 11 year old me. He talked about going to the beach with me whenever I was sad or upset (I love the beach.) He really comforted me during my darkest times. I loved and still love Bubbles. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;EMERGENCY NOTE FROM DOCTOR SAM: I&amp;#39;ve been watching the activity on Patient D&amp;#39;s laptop, she is starting to remember. The shot of [REDACTED] really kicked things up a notch. Never in my life would I think it would of worked so fast. She really is my special little girl. Soon she&amp;#39;ll awaken and remember everything, we can&amp;#39;t let that happen right now, we are not ready to deal with it at this early of a stage, she can be extremely dangerous when she is upset. Lord have mercy. If Patient D shows any signs of distress, she is to be restrained. Do not enter the cell unless it is a direct order from me. If she hurts one of my staff, we&amp;#39;re sending in the half breeds instead. Can always replace a half breed. Can&amp;#39;t replace a valuable and cherished member of our team. It&amp;#39;s hard to find people that understand our work here. Best regards, - Dr. Sam&lt;/em&gt;  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've always looked up to my older sister. I copied everything she did, much to her annoyance. When her friends came over, I followed them around the house until Anabelle went into her room with them, shutting and locking the door. \n\nAnabelle started getting interested in darker stuff when she hit 15. Being just two years younger than her, I was branded the annoying little sister who wasn't cool and she became more hostile towards me whenever I tried to spend time with her. \n\nIt really brought me down, I didn't know how to react. My big sister hated me. She didn't want me around anymore. I remember when i was 7 and she was 9, we would play house with our Bratz dolls. I just wanted everything to go back to the way it was.\n\nSoon after her 16th birthday, Anabelle started sneaking out of the house. I knew what she was doing. She was going to a graveyard to meet her boyfriend she met online, who just happened to live in our town. I knew this because she once left her laptop on and running and being the snotty little brat I was at 14 I snooped. \n\nShe snuck back inside, through her window, at about 4AM. Our rooms were right beside each others, and I heard her come in. I heard some clashing and banging but it stopped when I got up to go knock on her door. I went back to sleep. When I woke up at 8pm to get ready for school, the house was oddly silent. I was hungry, so I walked downstairs to get some cereal in my stomach. What I saw next sent a wave of panic through me. \n\nThere were bloody footprints all over the kitchen, coming down from our tile stairs. My favorite cereal, Mini Wheats Cinnamon Flavor, was knocked over, there were random pieces of it scattered along the floor. I bent down to look at the foot prints a little more closely. I realized the bottom of my owl slippers matched the foot prints exactly. There was dried blood on them. Why would someone wear my shoes - not even my shoes, but my dirty sweaty feet slippers to potentially commit a crime? To frame me? I thought about it, then I remembered the clashing and banging in Anabelle's room. I ran back up the stairs to her room. I opened the door and found my big sister with a steak knife stuck in her heart. Had the boy that she met online followed her home and killed her? I had to check on Mom and Dad. I walked quietly to their room, afraid the killer could still be in the house.\n\nMom had her throat slit. Dad was stabbed multiple times, there was a knife in his eye. I threw up in my mouth. I ran to the neighbors and told them that my house had been broken into and my family was dead. \n\nWhen the police came, I saw the dead bodies be wheeled into the ambulances. That's the last thing I remember. The doctors told me I fainted from shock. \n\nI woke up in a nice yellow room on a tan single bed. I got up but they told me to lay back down, that I needed the rest before the detectives came in to question me. I was restless, so the younger looking one pulled a laptop from under her chair. It was open to this site, so I'm writing here.\n\nI found out from the detectives that I was the main suspect in the murders. My fingerprints were on all the murder weapons. They were playing good cop bad cop with me, and the bad cop told me I would be in inpatient treatment for a very long time. Good cop told me I was very sick in the head, that they read my posts online apparently saying I was into the occult and I was going to murder my entire family as a sacrifice to Satan. \n\nI tried to tell them that I didn't have a laptop, I wasn't allowed one until I hit 16. I told them Anabelle had a laptop but I wasn't allowed on it. The good cop gave me a weak smile. \n\nLater on, the good doctor came in and talked to me. He listened to me and said he believed that I didn't kill my family. Finally. He asked me if I could recall anything from that night and I just told him about the clattering and banging from Anabelle's room. He told me I should rest a little more. About 20 minutes later, a nurse, who I nicknamed Blondie, came in and gave me two orange capsules. I'm getting drowsy so I'm going to end this here. I'm just so glad someone knows I didn't do that to my family.\n\n*Patient D, formerly known as Amiee Anabelle Laurson, does not remember murdering her entire family. She has completely blanked it out of her mind. Multiple Personality disorder suspected, as she had no siblings. Alter \"Anabelle\" most likely stemmed from childhood sexual abuse, presumably by Patient D's father, as his genitals were mutilated. The boy she met at the graveyard has been attained, he is now Patient J, more on him in a later email. For a girl of only 14, these murders were brutal. Which leads me to my next point, we can use this to our advantage. Our perfect little murdering machine. I think we finally found the one to host our greatest creation yet. Best regards, - Dr. Sam*\n\nUpdate 1: I just woke up, no one is in the room with me this time. The laptop they gave me is open on the page to edit this. There's a huge blank space in between me saying that I was going to sleep and what I'm writing right now. Oh, and I woke up to a sharp pain in my neck. It's actually what woke me up, I was dreaming I was 6 fighting Anabelle for her new Dora toy she got for Christmas. I wanted it so bad, I had begged my parents to get me it for months, and they got it for Her. Another memory I'm thinking of right now is when Mom fell down the stairs and I was right behind her, I heard her ribs crack. She called out for help but I remained on the stairs, frozen. I blacked out once again. I black out a lot, actually. \n\nThey never told me what those pills they gave me were. All I remember is about five minutes after taking them I felt drowsy, pills dont work that fast, do they? My head is starting to spin, I feel dizzy. I feel like something or someone else is trying to control my body. I have to stop typing again. Can anyone tell me if theres text where the blank space is? \n\nUpdate 2: The good doctor came back in and asked me to recall what happened, again. I swore at him.I spit at him. I already told him! I didn't kill my family! How many times do I have to say it! He said he believed me! He didn't close my door fully when he left to get an orderly, and I heard him talk to someone about \"the boy she met up with\" they said he's fighting against his restraints...so does the boy that Anabelle met up with have something to do with my families murder? I'm so confused. In about a minute, the same two people that were sitting on either side of me last time came back in. So now I have to be monitored? Just because I told the doctor something he already knows? Bullshit! \n\nThe same nurse came back in again, this time holding a pink pill in a paper cup. \"This will help you calm down, sweetie. Please just take it, if you cause anymore trouble we are going to have to restrain you, you wouldn't like that, would you?\" I glared at her. I took the pill and swallowed it, the taste stayed in my mouth. I gagged. \"Good girl.\" \n\nIf me swearing and spitting in the doctors face was enough to warrant restraints I wonder what that boy did. \n\nAbout 15 minutes after i took the pink pill, I started having violent visions where I stabbed someone, but they had no face. And then another person. And one more. They bled, but they had no faces. What does that mean? Why did the pill make me feel this way? \n\n\n*Patient D was given [REDACTED] 700mg. It didn't work like we hoped it would, but we still made progress. I'm going to let her rest for the rest of the day. I don't want to tire our subject out anymore than I already have. She hasn't noticed that the laptop she was given is bugged. Not very observant. Note that one down. Will need to fix that, all in good time. About Patient J, he's really not taking to his restraints, but it's fun to watch him squirm and shout that he's going to kill us all. When he passes out from exhaustion, he will be given 1500mg of [REDACTED] administered through the jugular vein, it will make him docile. If anyone has any questions regarding our two new subjects, come down to my office. Best regards, - Dr. Sam*\n\nUpdate #3: There is another huge chunk of blankness between my previous update and this one. I don't understand. I fell asleep for about 30 more minutes, and I dreamed of a world with faceless people. Like completely human in every way but they had. no. faces. I've never had a dream like that in my life.  I can't access any other site besides this, I've tried. I tried to go on the website that I remember Anabelle going on all the time but it comes up with an error message. \n\nAbout the unit I'm in, I'm not technically on lock down or anything, but there are orderlies standing outside my door. The nurse came in to give me some shot. She said it would make me remember. Remember what? I have no idea. I know I did not kill my family. I know it. I have never been violent in my life, I have never sleep walked, I have never had any intrusive thoughts. The good doctor hasn't been back in my room yet. The pain in my neck is back. I don't really know what caused it. I remember when I was about five or six, I fell off a swing and somehow bashed my head into a metal pole. I remember crying a lot but Mom bought me ice cream and I eventually stopped. I want to see what happens when I try and leave this room. I have no energy though, I've gotten up from my bed twice to use the rest room. I remember when i was 7 and Anabelle was 9, we moved into a new house. There were two bedrooms with a bathroom. Mom and Dad got one of course, but Anabelle and I argued and argued until she punched me in the nose and I started crying. Mom ran to see what all the fuss was about, when she saw my bleeding nose, she yelled at Anabelle.  I have nothing else to do but describe my surroundings, repeat myself saying that I didn't kill my family, and think back on memories. When I was 11, I still had an imaginary friend. His name was Bubbles. Bubbles didn't like Anabelle or Dad. He never told me to hurt them or anything, he just told me one day we would be together and I would be away from all the negativity. Bubbles...talked to me through the vents. Which now that I'm thinking about it is kind of creeping me out. What if it wasn't my imagination and there was someone in our air vents talking to me every night? What if I'm here and Bubbles is here too? He sounded like a grown up to 11 year old me. He talked about going to the beach with me whenever I was sad or upset (I love the beach.) He really comforted me during my darkest times. I loved and still love Bubbles. \n\n*EMERGENCY NOTE FROM DOCTOR SAM: I've been watching the activity on Patient D's laptop, she is starting to remember. The shot of [REDACTED] really kicked things up a notch. Never in my life would I think it would of worked so fast. She really is my special little girl. Soon she'll awaken and remember everything, we can't let that happen right now, we are not ready to deal with it at this early of a stage, she can be extremely dangerous when she is upset. Lord have mercy. If Patient D shows any signs of distress, she is to be restrained. Do not enter the cell unless it is a direct order from me. If she hurts one of my staff, we're sending in the half breeds instead. Can always replace a half breed. Can't replace a valuable and cherished member of our team. It's hard to find people that understand our work here. Best regards, - Dr. Sam*  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Series", "id": "65jpag", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 259, "report_reasons": null, "author": "trashrat88", "saved": false, "mod_reports": [], "name": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492290608.0, "link_flair_css_class": "flair-series", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65jpag/dr_sams_special_little_girl_part_one/", "num_reports": null, "locked": false, "stickied": false, "created": 1492299749.0, "url": "https://www.reddit.com/r/nosleep/comments/65jpag/dr_sams_special_little_girl_part_one/", "author_flair_text": null, "quarantine": false, "title": "Dr. Sam's special little girl (Part One)", "created_utc": 1492270949.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 259}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": "", "user_reports": [], "id": "dgas6lh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoSleepAutoBot", "parent_id": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65jpag%2Fdr_sams_special_little_girl_part_one%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;to=RemindMeBot) to get a reminder to check back later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like there may be more to this story. Click &lt;a href=\"https://www.reddit.com/message/compose?subject=Reminder&amp;amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F65jpag%2Fdr_sams_special_little_girl_part_one%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&amp;amp;to=RemindMeBot\"&gt;here&lt;/a&gt; to get a reminder to check back later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgas6lh", "score_hidden": true, "stickied": true, "created": 1492299820.0, "created_utc": 1492271020.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": "", "user_reports": [], "id": "dgbddbo", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "trashrat88", "parent_id": "t1_dgbcr9t", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "*Expect more progress reports. With the road my team, my patients and I are going down, there will be many more progress reports. Eventually, I will have to start my own log as our experimental tests get more and more complicated. Best regards, - Dr.Sam*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Expect more progress reports. With the road my team, my patients and I are going down, there will be many more progress reports. Eventually, I will have to start my own log as our experimental tests get more and more complicated. Best regards, - Dr.Sam&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbddbo", "score_hidden": false, "stickied": false, "created": 1492329155.0, "created_utc": 1492300355.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcr9t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "F0zwald", "parent_id": "t1_dgbcga1", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ahh, so he's been embraced as well. I was worried there might be some unresolved feelings getting in the way down the road. I'm not sure I approve, but in the interest of science I look forward to your progress reports.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahh, so he&amp;#39;s been embraced as well. I was worried there might be some unresolved feelings getting in the way down the road. I&amp;#39;m not sure I approve, but in the interest of science I look forward to your progress reports.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbcr9t", "score_hidden": false, "stickied": false, "created": 1492328308.0, "created_utc": 1492299508.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcga1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "trashrat88", "parent_id": "t1_dgbauyz", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "*It's all part of a bigger picture. Patient J had a modification procedure and he is no longer a problem to us. Best regards, - Dr.Sam*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;It&amp;#39;s all part of a bigger picture. Patient J had a modification procedure and he is no longer a problem to us. Best regards, - Dr.Sam&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbcga1", "score_hidden": false, "stickied": false, "created": 1492327879.0, "created_utc": 1492299079.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbauyz", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "F0zwald", "parent_id": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm not sure what's going on here, but anabelle's bf has got to be pretty pissed right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure what&amp;#39;s going on here, but anabelle&amp;#39;s bf has got to be pretty pissed right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbauyz", "score_hidden": false, "stickied": false, "created": 1492325564.0, "created_utc": 1492296764.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": "", "user_reports": [], "id": "dgb9um9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "armoured_titantank", "parent_id": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ho-ly shit", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ho-ly shit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgb9um9", "score_hidden": false, "stickied": false, "created": 1492324076.0, "created_utc": 1492295276.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": "", "user_reports": [], "id": "dgbt7dq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Zenizio", "parent_id": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Just coming to comment because my name is Sam.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just coming to comment because my name is Sam.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbt7dq", "score_hidden": false, "stickied": false, "created": 1492355824.0, "created_utc": 1492327024.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": "", "user_reports": [], "id": "dgbyyyd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sasstronaut7", "parent_id": "t1_dgbwxgw", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Totally got the reference also but I doubt it's any kind of connected. The writing style is very different. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally got the reference also but I doubt it&amp;#39;s any kind of connected. The writing style is very different. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbyyyd", "score_hidden": false, "stickied": false, "created": 1492373959.0, "created_utc": 1492345159.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbwxgw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bononooo", "parent_id": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Okay I know this is definitely a different story but \"all in good time\" still made me stop reading for a while.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay I know this is definitely a different story but &amp;quot;all in good time&amp;quot; still made me stop reading for a while.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbwxgw", "score_hidden": false, "stickied": false, "created": 1492367882.0, "created_utc": 1492339082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": "", "user_reports": [], "id": "dgc37m5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RCONSPIRACYISCORRUPT", "parent_id": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "What a flashback. My friends and I always spoke of why was every bratz doll dressed like a little prostitute slut.  Bad toy for little girls growing up!  Another pizzagate toy mkultra subliminal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a flashback. My friends and I always spoke of why was every bratz doll dressed like a little prostitute slut.  Bad toy for little girls growing up!  Another pizzagate toy mkultra subliminal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc37m5", "score_hidden": false, "stickied": false, "created": 1492382092.0, "created_utc": 1492353292.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65jpag", "likes": null, "replies": "", "user_reports": [], "id": "dgbcxnz", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "trashrat88", "parent_id": "t1_dgbbwe2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "*You can believe whatever you'd like, Patient M. We'll be seeing you when Patient X finally passes. Best regards, - Dr.Sam*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;You can believe whatever you&amp;#39;d like, Patient M. We&amp;#39;ll be seeing you when Patient X finally passes. Best regards, - Dr.Sam&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbcxnz", "score_hidden": false, "stickied": false, "created": 1492328555.0, "created_utc": 1492299755.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbwe2", "gilded": 0, "archived": false, "score": -21, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65jpag", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgbbwe2", "score_hidden": false, "stickied": false, "created": 1492327084.0, "created_utc": 1492298284.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -21}}], "after": null, "before": null}}]