[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife and I have a very successful family business, but I have made a recent discovery that has turned my happiness into regret. I am not sure I can bring myself to explain my secret to our loyal customers, and risk the failure of our company by tarnishing the reputation of our town&amp;#39;s local &amp;quot;sweetheart.&amp;quot;  I am not sure what the future holds for our shop, but I despise opening the doors every morning.  I hope by sharing, I can find some moral peace knowing that the truth is out there, and that in some way I have made an effort to make my findings &amp;quot;public&amp;quot; for all to know.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;There was a little old lady who lived down the street and every day she would bake.  Cookies, pies, cakes, and treats, she would hand make them all.  It was great, because she would share.  Not just for special holiday occasions, but almost once week she would deliver a basket of her homemade baked goods, and they were unbelievably delicious.&lt;/p&gt;\n\n&lt;p&gt;Her name was Glendora Barnhill.  She was quiet and lived alone, but was always very kind when we would see her.  My wife invited Ms. Barnhill over several times for dinner, but she was never able to make it.  She would say she was baking and always had something in the oven that required her attention.  &lt;/p&gt;\n\n&lt;p&gt;But the other night I had a strange encounter with Ms. Barnhill.  It was just past midnight when our toy fox terrier Sprinkles began whimpering and scratching at the door.  Sprinkles did not do this often, but it meant a walk was needed, ASAP.  So I grabbed her leash, my jacket, and we stepped out into the frigid night.  &lt;/p&gt;\n\n&lt;p&gt;We were a couple houses down when we were both startled by a noise across the street.  Sprinkles immediately began barking.  Under the dimly lit street light I could see Ms. Barnhill reaching into the neighbors trash bin.  I watched as she continued to the next house, dragging a large black garbage bag behind her.  &lt;/p&gt;\n\n&lt;p&gt;I was confused, disgusted, but also worried that the old woman might be going senile and needed help.&lt;/p&gt;\n\n&lt;p&gt;I approached her, holding Sprinkles tightly in my arms.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ms. Barnhill, is everything alright?  What are you doing out here in the cold, it&amp;#39;s late...&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;But she continued scouring through the fowl smelling trash, like she could not hear me...&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ms. Barnhill?  Ms. Barnhill...please stop...&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;In a stiff and jarring twist of her neck, the old woman turned and stared at me with an evil frightening glare.  She began yelling at the top of her lungs... &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This is what you think of my pies?!  GARBAGE?!!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Her frail voice echoed through the neighborhood.  Sprinkles began growling, and before I could respond, Ms. Barnhill had turned away and started walking back towards her house.&lt;/p&gt;\n\n&lt;p&gt;I did not know what to say or how to react, so I left her alone, watching her disappear into the shadows.  &lt;/p&gt;\n\n&lt;p&gt;I was a bit sad for her, ill be honest.  The poor woman was searching through garbage looking for disposed traces of her baked goods.  &lt;/p&gt;\n\n&lt;p&gt;I will admit that even my wife and I had tossed out a few of her gifts here and there, we couldn&amp;#39;t eat all the sweets by ourselves...but I had no idea Ms. Barnhill was walking the streets at midnight digging through our trash... &lt;/p&gt;\n\n&lt;p&gt;Everyone in the neighborhood thought very highly of Ms. Barnhill, so out of admiration I chose to keep the incident to myself.  &lt;/p&gt;\n\n&lt;p&gt;I came home the next day from work to find a basket filled with cookies and a fresh baked &lt;em&gt;boysenberry pie&lt;/em&gt; on the front porch.  Attached was a small card with the cursive written word...&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Sorry&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;That was the last homemade dessert my wife and I would ever receive from Ms. Barnhill.  &lt;/p&gt;\n\n&lt;p&gt;The weekly delivered treats that we had graciously received for years suddenly stopped.  Ms. Barnhill was no where to be seen.  &lt;/p&gt;\n\n&lt;p&gt;On my evening walks with Sprinkles I would pass by the old woman&amp;#39;s house, curiously checking for a sign of life, but the lights were always off, the house was always an eerie pitch black.&lt;/p&gt;\n\n&lt;p&gt;Two weeks passed and Ms. Barnhill&amp;#39;s boysenberry pie we had saved away in the back of the refrigerator never got eaten.  The pie had become an afterthought in our busy and health conscious schedules.  I felt bad throwing it out, and I could not help but think back to the night I saw Ms. Barnhill scouring the streets....&lt;/p&gt;\n\n&lt;p&gt;But she was gone.  The old woman had vanished without a trace...that is until one early Saturday morning when I noticed all her belongings scattered in her front yard.&lt;/p&gt;\n\n&lt;p&gt;A younger man dressed in all black was conducting an estate sale.  I glanced through some of the items, old cleaning supplies, furniture, clothes, nothing much of interest until I came across a giant book of Ms. Barnhill&amp;#39;s hand written recipes.  I took the book to the young man and bought it for a couple of dollars.  Before leaving I asked if he knew what happened to Ms. Barnhill.  The man bluntly replied...&amp;quot;She died.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;I apologized for his loss, assuming he was part of the family, and told him we greatly appreciated all of Ms. Barnhill&amp;#39;s generous baked desserts.  But before leaving, curiosity got the best of me...  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Were you related to her?&amp;quot; I asked.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, Ms. Barnhill had no family. I was her caretaker,&amp;quot; the man responded. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How did she pass, if you don&amp;#39;t mind me asking, peacefully...?&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;The man hesitated, biting down on his lower lip.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Unfortunately, she killed herself... When she didn&amp;#39;t answer the door I entered with my spare key and I found her body, lifeless on the kitchen floor beside several empty bottles of her prescription medication.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Geez, that is terrible!&amp;quot;  I said in complete shock.  &amp;quot;Why?  Why now after all these years would she take her life?&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m not sure...she was always happy,&amp;quot; the man said shaking his head.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But the last time I saw her, something had her upset, she kept saying over and over &amp;#39;they hate my pies.&amp;#39;  That was her life, all Ms. Barnhill did was bake from the moment she woke up, until she went to bed.  All I can think is that somebody may have hurt that kind woman&amp;#39;s feelings...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The man looked at me with a guilt piercing stare, like I had done something wrong...or maybe that was how I was interpreting the moment, but either way, I had become very uncomfortable and I quickly said good bye and left.         &lt;/p&gt;\n\n&lt;p&gt;It is a tragic story, but in the end, there is light in the presence of darkness.  I shared Ms. Barnhill&amp;#39;s recipe book with my wife and together we perfected her desserts.  Day after day we were in the kitchen baking something fresh and new.  Friends and family enjoyed our tasty treats so much we decided to open our own business in the heart of our city&amp;#39;s downtown district.   &lt;/p&gt;\n\n&lt;p&gt;When deciding on a name for our company, my wife insisted that our shop be called &lt;em&gt;Barnhill&amp;#39;s Bakery&lt;/em&gt;, to honor the spirit of the friendly old woman who loved to share her delicious treats with her neighbors.   &lt;/p&gt;\n\n&lt;p&gt;Sounds like a happy ending right...?  Living each joyous day by our company motto &lt;em&gt;&amp;quot;Love from the Heart, Kindness from the Kitchen!&amp;quot;&lt;/em&gt;  Keeping the legacy and memory of Ms. Barnhill alive and well... &lt;/p&gt;\n\n&lt;p&gt;WRONG.  &lt;/p&gt;\n\n&lt;p&gt;I have metaphorically just pulled my &amp;quot;happy ending&amp;quot; out from the oven and it is burnt.   &lt;/p&gt;\n\n&lt;p&gt;I must say I am grateful for our business success, but I&amp;#39;m even more grateful to be alive.  You see, had we indulged in that last and tempting baked gift from Ms. Barnhill, I am not sure I would still be here to tell this story.  &lt;/p&gt;\n\n&lt;p&gt;I have not shared with my wife, or anyone else, what I recently found in the back of Ms. Barnhill&amp;#39;s book.  Watching that woman dig through the trash at midnight, her final apologetic dessert left on our porch, and the timing of her suicidal death...it all makes sense to me now.  &lt;/p&gt;\n\n&lt;p&gt;Even the kindest of people can go crazy, and that old witch tried to take us with her...  &lt;/p&gt;\n\n&lt;p&gt;What I found, scribbled on a torn piece of yellow note paper, hidden in the back pocket of Ms. Barnhill&amp;#39;s recipe book were her special ingredients for a &lt;em&gt;&amp;quot;Poison-Berry Pie.&amp;quot;&lt;/em&gt;    &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My wife and I have a very successful family business, but I have made a recent discovery that has turned my happiness into regret. I am not sure I can bring myself to explain my secret to our loyal customers, and risk the failure of our company by tarnishing the reputation of our town's local \"sweetheart.\"  I am not sure what the future holds for our shop, but I despise opening the doors every morning.  I hope by sharing, I can find some moral peace knowing that the truth is out there, and that in some way I have made an effort to make my findings \"public\" for all to know.\n\n*****  \n\nThere was a little old lady who lived down the street and every day she would bake.  Cookies, pies, cakes, and treats, she would hand make them all.  It was great, because she would share.  Not just for special holiday occasions, but almost once week she would deliver a basket of her homemade baked goods, and they were unbelievably delicious.\n\nHer name was Glendora Barnhill.  She was quiet and lived alone, but was always very kind when we would see her.  My wife invited Ms. Barnhill over several times for dinner, but she was never able to make it.  She would say she was baking and always had something in the oven that required her attention.  \n\nBut the other night I had a strange encounter with Ms. Barnhill.  It was just past midnight when our toy fox terrier Sprinkles began whimpering and scratching at the door.  Sprinkles did not do this often, but it meant a walk was needed, ASAP.  So I grabbed her leash, my jacket, and we stepped out into the frigid night.  \n\nWe were a couple houses down when we were both startled by a noise across the street.  Sprinkles immediately began barking.  Under the dimly lit street light I could see Ms. Barnhill reaching into the neighbors trash bin.  I watched as she continued to the next house, dragging a large black garbage bag behind her.  \n\nI was confused, disgusted, but also worried that the old woman might be going senile and needed help.\n\nI approached her, holding Sprinkles tightly in my arms.  \n\n\"Ms. Barnhill, is everything alright?  What are you doing out here in the cold, it's late...\"  \n\nBut she continued scouring through the fowl smelling trash, like she could not hear me...\n\n\"Ms. Barnhill?  Ms. Barnhill...please stop...\"  \n\nIn a stiff and jarring twist of her neck, the old woman turned and stared at me with an evil frightening glare.  She began yelling at the top of her lungs... \n\n\"This is what you think of my pies?!  GARBAGE?!!\"\n\nHer frail voice echoed through the neighborhood.  Sprinkles began growling, and before I could respond, Ms. Barnhill had turned away and started walking back towards her house.\n\nI did not know what to say or how to react, so I left her alone, watching her disappear into the shadows.  \n\nI was a bit sad for her, ill be honest.  The poor woman was searching through garbage looking for disposed traces of her baked goods.  \n\nI will admit that even my wife and I had tossed out a few of her gifts here and there, we couldn't eat all the sweets by ourselves...but I had no idea Ms. Barnhill was walking the streets at midnight digging through our trash... \n\nEveryone in the neighborhood thought very highly of Ms. Barnhill, so out of admiration I chose to keep the incident to myself.  \n\nI came home the next day from work to find a basket filled with cookies and a fresh baked *boysenberry pie* on the front porch.  Attached was a small card with the cursive written word...\n\n*\"Sorry\"*\n\nThat was the last homemade dessert my wife and I would ever receive from Ms. Barnhill.  \n\nThe weekly delivered treats that we had graciously received for years suddenly stopped.  Ms. Barnhill was no where to be seen.  \n\nOn my evening walks with Sprinkles I would pass by the old woman's house, curiously checking for a sign of life, but the lights were always off, the house was always an eerie pitch black.\n\nTwo weeks passed and Ms. Barnhill's boysenberry pie we had saved away in the back of the refrigerator never got eaten.  The pie had become an afterthought in our busy and health conscious schedules.  I felt bad throwing it out, and I could not help but think back to the night I saw Ms. Barnhill scouring the streets....\n\nBut she was gone.  The old woman had vanished without a trace...that is until one early Saturday morning when I noticed all her belongings scattered in her front yard.\n\nA younger man dressed in all black was conducting an estate sale.  I glanced through some of the items, old cleaning supplies, furniture, clothes, nothing much of interest until I came across a giant book of Ms. Barnhill's hand written recipes.  I took the book to the young man and bought it for a couple of dollars.  Before leaving I asked if he knew what happened to Ms. Barnhill.  The man bluntly replied...\"She died.\"  \n\nI apologized for his loss, assuming he was part of the family, and told him we greatly appreciated all of Ms. Barnhill's generous baked desserts.  But before leaving, curiosity got the best of me...  \n\n\"Were you related to her?\" I asked.  \n\n\"No, Ms. Barnhill had no family. I was her caretaker,\" the man responded. \n\n\"How did she pass, if you don't mind me asking, peacefully...?\"  \n\nThe man hesitated, biting down on his lower lip.\n\n\"Unfortunately, she killed herself... When she didn't answer the door I entered with my spare key and I found her body, lifeless on the kitchen floor beside several empty bottles of her prescription medication.\" \n\n\"Geez, that is terrible!\"  I said in complete shock.  \"Why?  Why now after all these years would she take her life?\"  \n\n\"I'm not sure...she was always happy,\" the man said shaking his head.  \n\n\"But the last time I saw her, something had her upset, she kept saying over and over 'they hate my pies.'  That was her life, all Ms. Barnhill did was bake from the moment she woke up, until she went to bed.  All I can think is that somebody may have hurt that kind woman's feelings...\"\n\nThe man looked at me with a guilt piercing stare, like I had done something wrong...or maybe that was how I was interpreting the moment, but either way, I had become very uncomfortable and I quickly said good bye and left.         \n\nIt is a tragic story, but in the end, there is light in the presence of darkness.  I shared Ms. Barnhill's recipe book with my wife and together we perfected her desserts.  Day after day we were in the kitchen baking something fresh and new.  Friends and family enjoyed our tasty treats so much we decided to open our own business in the heart of our city's downtown district.   \n\nWhen deciding on a name for our company, my wife insisted that our shop be called *Barnhill's Bakery*, to honor the spirit of the friendly old woman who loved to share her delicious treats with her neighbors.   \n\nSounds like a happy ending right...?  Living each joyous day by our company motto *\"Love from the Heart, Kindness from the Kitchen!\"*  Keeping the legacy and memory of Ms. Barnhill alive and well... \n\nWRONG.  \n\nI have metaphorically just pulled my \"happy ending\" out from the oven and it is burnt.   \n\nI must say I am grateful for our business success, but I'm even more grateful to be alive.  You see, had we indulged in that last and tempting baked gift from Ms. Barnhill, I am not sure I would still be here to tell this story.  \n\nI have not shared with my wife, or anyone else, what I recently found in the back of Ms. Barnhill's book.  Watching that woman dig through the trash at midnight, her final apologetic dessert left on our porch, and the timing of her suicidal death...it all makes sense to me now.  \n\nEven the kindest of people can go crazy, and that old witch tried to take us with her...  \n\nWhat I found, scribbled on a torn piece of yellow note paper, hidden in the back pocket of Ms. Barnhill's recipe book were her special ingredients for a *\"Poison-Berry Pie.\"*    \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65o263", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 110, "report_reasons": null, "author": "SirScareme", "saved": false, "mod_reports": [], "name": "t3_65o263", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492329388.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65o263/love_from_the_heart_kindness_from_the_kitchen/", "num_reports": null, "locked": false, "stickied": false, "created": 1492357398.0, "url": "https://www.reddit.com/r/nosleep/comments/65o263/love_from_the_heart_kindness_from_the_kitchen/", "author_flair_text": null, "quarantine": false, "title": "\"Love from the Heart, Kindness from the Kitchen!\"", "created_utc": 1492328598.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 110}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65o263", "likes": null, "replies": "", "user_reports": [], "id": "dgby064", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65o263", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The old folks do like to be appreciated. I almost think that Ms Barnhill's poison berries probably made it into more than the one lethal confectionary she made for you prior to her suicide. There's probably no telling how many deadly deserts she distributed over the years. I'm quite certain her \"caretaker\" was also involved on some level as well. Good luck.", "edited": 1492342768.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The old folks do like to be appreciated. I almost think that Ms Barnhill&amp;#39;s poison berries probably made it into more than the one lethal confectionary she made for you prior to her suicide. There&amp;#39;s probably no telling how many deadly deserts she distributed over the years. I&amp;#39;m quite certain her &amp;quot;caretaker&amp;quot; was also involved on some level as well. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgby064", "score_hidden": false, "stickied": false, "created": 1492371320.0, "created_utc": 1492342520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65o263", "likes": null, "replies": "", "user_reports": [], "id": "dgc48ro", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Hellaintsobad", "parent_id": "t3_65o263", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ms. B has paid for her sins. No need to make her last recipe public. Enjoy your success despite the namesake. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ms. B has paid for her sins. No need to make her last recipe public. Enjoy your success despite the namesake. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc48ro", "score_hidden": false, "stickied": false, "created": 1492383668.0, "created_utc": 1492354868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65o263", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65o263", "likes": null, "replies": "", "user_reports": [], "id": "dgcop0r", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Calofisteri", "parent_id": "t1_dgcjxd8", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Neighbors are a part of life. You go apeshit without 'em. Remember this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Neighbors are a part of life. You go apeshit without &amp;#39;em. Remember this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcop0r", "score_hidden": false, "stickied": false, "created": 1492410806.0, "created_utc": 1492382006.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjxd8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Benivav", "parent_id": "t3_65o263", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I feel sad now. I love to cook and bake and I hope I won't go ape shit when I'll be an old fart,  trying to murder My neighbors. Even though I don't like having neighbors \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel sad now. I love to cook and bake and I hope I won&amp;#39;t go ape shit when I&amp;#39;ll be an old fart,  trying to murder My neighbors. Even though I don&amp;#39;t like having neighbors &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcjxd8", "score_hidden": false, "stickied": false, "created": 1492404501.0, "created_utc": 1492375701.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]