[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I keep a shotgun beneath my bed.  &lt;/p&gt;\n\n&lt;p&gt;I know what some of you are already saying. It’s a danger in the home, someone could get hurt. Or maybe that I’d have no possible way to arm myself in time if an intruder was present. That the weapon is more of a liability than a defense. On the average day though, it’s the only thing that helps me sleep at night.&lt;/p&gt;\n\n&lt;p&gt;Your typical opponent to my stance can spout out a million reasons why I don’t need the weapon, but most can’t answer one question the way I do. Has anyone ever broken into your home?&lt;/p&gt;\n\n&lt;p&gt;I had a normal childhood. I lived in a small rural town with virtually no crime. My home was in the country off an unkempt dirt road deep within the woods. My nearest neighbors were one mile away down the road to the north, and a graveyard a mile down the road to the south. In fact, the only way to even see the old place from the road was the dim light hanging above the pole barn on our property due to the steep, long drop off that was our driveway. &lt;/p&gt;\n\n&lt;p&gt;Our home was a modest size and was surrounded by woods from every direction aside from the driveway down the hill. When the bus would drop me off from school I usually beat my parents home by half an  hour. It wasn’t a big deal, I was a responsible child and I never did anything reckless. I’d unlock the door, walk in, and sit at the table to do homework. &lt;/p&gt;\n\n&lt;p&gt;One specific day in the fall though was different than any other. I was roughly 10 and had just made my way inside. I patiently waited for my parents to arrive since it was Friday and a half day. I decided my homework could wait until Sunday. I walked down the stairs to the basement to go play Mario Kart when I heard a loud crash upstairs.&lt;/p&gt;\n\n&lt;p&gt;Glass clearly had been shattered and I froze at the bottom of the stairwell. In my head I tried to think of any reason I could not to be scared. I wanted so badly to believe that a bird had crashed through the front window. Until I heard voices. &lt;/p&gt;\n\n&lt;p&gt;I was struck with fear, but I knew what to do. Thankfully I was already in the basement and made my way through two unfinished rooms. The floors were cracked concrete, exposed ceiling beams rested overhead, and the off white dry wall marked the perimeter of the room. As I made my way past the furnace I knelt in front of the wall.&lt;/p&gt;\n\n&lt;p&gt;One specific piece of dry wall wasn’t actually attached. It had the heads of screws in each of the corners to seem as if it was. I pulled the piece out and made my way into the small space beneath the stairs, carefully pulling the drywall back into place by a small string that was attached.&lt;/p&gt;\n\n&lt;p&gt;I waited for what seemed like ages as I heard the crashing of drawers, shattering of glass, and laughter. I tried my best to stay calm, until I heard the gun shot. I could feel my pulse pounding in my head as my hands shook. I passed out from fear.&lt;/p&gt;\n\n&lt;p&gt;Thankfully they never found me. The house was destroyed and thousands of dollars of my parent’s belongings were stolen. My mother had arrived after the ordeal and found me beneath the stairs. The police arrived shortly thereafter with my Dad. We would move into a small suburb in the coming month. Mom was too freaked out to live there anymore. I couldn’t blame her. &lt;/p&gt;\n\n&lt;p&gt;Life changes after an event like that. It’s hard to think that someone was rummaging through your belongings. Picking and choosing what they’d like, armed with something they would be willing to use to do harm to your family. What I found worse though was that these robbers knew when my parents wouldn’t be home and when to strike. They had to have been watching us from the woods or the street. That was the thought that kept me up at night. I couldn’t handle going to sleep. Wondering if while I was at my most vulnerable someone was outside plotting against me. &lt;/p&gt;\n\n&lt;p&gt;I kept my fears to myself though. I struggled to sleep for months with a recurring nightmare. It is odd though that I can’t seem to recall it exactly. All I know is that it took me quite some time to work past it and gain the courage to trust in the safety of my bed at night. I would never be fully comfortable again though, and I would always assume the worst in people. &lt;/p&gt;\n\n&lt;p&gt;This past year I moved into a new apartment on my own to finish up college. Unfortunately, it isn’t going well. The only thing I can afford is this shitty one bedroom apartment in the worst part of town. The chorus of sirens and flashing lights outside keep me up at night. Every creak and thud from my neighbors entering the complex makes me shudder. When I hear their voices I inch towards the edge of the bed beside the wall where my firearm resides.&lt;/p&gt;\n\n&lt;p&gt;The worst part though is the constant fearful state when I do wake from what little sleep I get. It’s a strange sensation when you wake in a cold sweat with a pounding heart, but you just can’t quite put your finger on what exactly occurred in your dreams. All I know is that just before I do wake, I hear the deafening crack of a gun. &lt;/p&gt;\n\n&lt;p&gt;I wanted to focus on my studies for my senior year, but I decided I couldn’t stand being alone anymore. I had started dating a girl named Alyssa and it did seem to help. I’ve always felt so much more comfortable at night with others around. Not that Alyssa was particularly imposing, but I felt safer knowing she was in the bed beside me most nights. Needless to say, I didn’t really tell her about my troubles. Telling your new girlfriend you can’t sleep because you had a bad dream is probably not the biggest turn on. &lt;/p&gt;\n\n&lt;p&gt;Last week on Saturday we slept in until 10. She said something that really caught me by surprise. She wasn’t able to catch the exact words, but she couldn’t believe how different my voice sounded in my sleep. I grew up having friends over whenever I could to keep me company at night, and never once had any of them ever mentioned that I talked in my sleep. That was when I developed an idea.&lt;/p&gt;\n\n&lt;p&gt;I had always been curious about those recurring dreams that I could never seem to remember. Many of my sleepless nights were spent wondering. Perhaps what I said in my sleep could give me an idea, or just enough of a cue to jot my memory. The next night I decided to sleep with a small voice recorder.&lt;/p&gt;\n\n&lt;p&gt;It wasn’t anything special, just your run of the mill recorder. No bells or whistle, just a record, play, pause, and stop button. I bought it for lectures, but for the first time I was actually excited to use the device. Alyssa went home the next day, so I decided I’d try my experiment right away.&lt;/p&gt;\n\n&lt;p&gt;It was honestly the first time I looked forward to sleep. I tried to clear my mind from the thousands of theories floating around my head. The next morning was less than exciting though. My idea seemed sound, but I had 6 hours of recording to listen to, to see if I even spoke at all. I went about my studies with the recorder playing throughout the day.&lt;/p&gt;\n\n&lt;p&gt;There was a ton of white noise with the occasional rustle of covers, or deep breath. Naturally it wasn’t until the 5th hour when I finally heard anything. I could make out a series of mumbles followed by one clearly spoken phrase, “In my backpack.” The statement was puzzling, but the strangest part was exactly as Alyssa had said the night before. I sounded so much different. My voice was deeper and gruffer, it emanated much better. I figured it was just like any other time you fall asleep and get that hoarse voice in the morning. &lt;/p&gt;\n\n&lt;p&gt;The statement weighed on my mind all day. It perplexed me to the point that I even eye balled my backpack. As expected it held nothing but a binder with microbiology notes. I wrote it off as a random phrase and continued with my life. Just for fun, I’d try again the next night.&lt;/p&gt;\n\n&lt;p&gt;As always I awoke with a gasp covered in sweat with a racing heart. Again, I heard the shot which tore me from my slumber. I periodically listened to the recording throughout the day once more, and to my surprise I spoke again. I still had that deeper tone, but this time I said, “Backpack. Secret pocket.” &lt;/p&gt;\n\n&lt;p&gt;This phrase may seem like jibberish, but something in my brain clicked. I remembered my old backpack from middle school. It was a normal blue, 2 strapped bag with a zipper. I used to sneak candy into class though using what I called a secret pocket. Really it wasn’t a pocket at all, just a tear in the fabric between the zipper and the actual back of the bag. With that in mind, and my curiosity at an all time high, I decided to entertain my thoughts and visit my parents.&lt;/p&gt;\n\n&lt;p&gt;I shot the shit with my mom for an hour when I first arrived. I only lived an hour away so I visited pretty regularly, but she was surprised to see me so early in the week. I told her I was in the neighborhood and wanted to talk to her. It was her least favorite subject, but I tried to question her about the incident. When she said the same old  things about it, I pressed further to focus on the aftermath with me. She seemed hesitant to reply but told me the worst part of the ordeal was how shaken I was. I asked her if she remembered me having bad dreams and she looked at me with hollow eyes.&lt;/p&gt;\n\n&lt;p&gt;“It took you a long time to sleep right again. You used to wail in the night so much.”&lt;/p&gt;\n\n&lt;p&gt;My brow furled as she had never mentioned me speaking before in my sleep, “What did I say exactly?”&lt;/p&gt;\n\n&lt;p&gt;My mother looked down into her coffee cup for a moment before sighing, “You always said the same thing, that it was going to get you.”&lt;/p&gt;\n\n&lt;p&gt;I gulped as I started to gain fragments of memory. For whatever reason, that phrase shook me. I made my way up to my old room with an added sense of dread. I’m ashamed to admit that I sprinted up the stairs and sharply looked behind myself once I reached the 12 step summit. I turned on three lights just to walk up to my room in broad daylight.&lt;/p&gt;\n\n&lt;p&gt;As I entered my childhood dwelling I stepped towards the closet with apprehension. Was I being a bit over top with this situation. After all, people without PTSD have bad dreams, and people mutter things in their sleep all the time. Maybe I would have been better off without the recording, because now the curiosity was too much. &lt;/p&gt;\n\n&lt;p&gt;I tore through old boxes of toys and movies as I delved into my childhood. Old folders were filled with countless assignments and notes. There were certificates and report cards, and even a medal from when I played baseball. As I tossed all my old mementos to the side I finally found what I was looking for.&lt;/p&gt;\n\n&lt;p&gt;The old bag laid on the bottom of the box completely flattened. I pulled it out from the clutter and opened the zipper. An old binder was still inside with notes from algebra class. As I pulled it aside I reached down towards the rip in the fabric. I writhed my hand through the pocket uncovering a small notebook. Many pages were torn and the wire spiral was nearly flattened. As I flipped through I stared in disbelief at the notes I had no memory of writing. Nearly every page was a large black scribble, punctuated with the same phrase. “If I’m not afraid it can’t get me.” As I neared the end of the pages the scribble seemed to diminish in size and the phrase was no longer present. &lt;/p&gt;\n\n&lt;p&gt;I left home that day with more questions than answers. Had I been plagued by some boogey man as a result of traumatic stress? Had I found some way to give myself a pep talk to overcome my fear? Why couldn’t I seem to recall any of this? I laid in bed staring at the ceiling, racking my brain wishing that Alyssa was with me.&lt;/p&gt;\n\n&lt;p&gt;When I finally did fall asleep I only had my recorder to cuddle with. I was torn from sleep by the annoying sound of my alarm clock. I wasn’t in my bed though. I was standing upright before the window, my hand firmly placed upon the latch. I stared in disbelief as I re-locked it and made my way back to my room.&lt;/p&gt;\n\n&lt;p&gt;The recorder played hours of nothingness once more until roughly an hour before I woke. This time I could hear myself in that same harsh voice say, “This time you’re mine.”&lt;/p&gt;\n\n&lt;p&gt;A chill went down my spine while I thought back to the sleep walking incident. A million irrational thoughts bounced around my head as I wondered what I would have done had my alarm not woke me. I called Alyssa, begging her to stay with me. It was time to come clean. Thankfully she was receptive to the idea and understanding. I even got a sympathy lay. &lt;/p&gt;\n\n&lt;p&gt;I didn’t want to weird out Alyssa, but I had to record myself once more. Despite her looks of concern, she gave me the okay and we hit the hay. That morning I awoke to her hand tightlyclutching my arm. “Where are you going?”&lt;/p&gt;\n\n&lt;p&gt;Again, I was startled and trying to orient myself. I had gotten out of bed once more, thankfully she felt the rustling and stopped me. I was noticeably shaken and she did her best to comfort me. Alyssa went to work that morning and I spent the rest of my day listening to the lengthy recording. By the time I realized, 5 hours had already passed.&lt;/p&gt;\n\n&lt;p&gt;The voice spoke once more in that harsh tone, “The window.” I was deeply unsettled by the statement which sounded less like a phrase and more of a command. I listened further with great curiosity, but I really wish I hadn’t.&lt;/p&gt;\n\n&lt;p&gt;Alyssa came back for lunch and found me staring into space at the table. My face was covered in tears. She urged me to tell her what was wrong with a strong embrace. I looked at her as I wiped my eyes and played the recording. My girlfriend stared at me with a look of both confusion and concern. “You just talked in your sleep, it’s okay! Your mouth is dry that’s all!”&lt;/p&gt;\n\n&lt;p&gt;I sharply interjected, “That’s not my voice!”&lt;/p&gt;\n\n&lt;p&gt;Alyssa rolled her eyes, “Then whose is it? How do you know it’s not yours?”&lt;/p&gt;\n\n&lt;p&gt;I continued the recording, she leaned in closely as we heard one soft word, “Yes.”&lt;/p&gt;\n\n&lt;p&gt;I looked at Alyssa with my hands covering my mouth. She stumbled back into the wall. I exclaimed in terror, “I know that’s not my voice, because I just replied to it.”&lt;/p&gt;\n\n&lt;p&gt;Alyssa never did come back after that. I sleep with multiple alarms to tear myself from my hypnotic sleep state. The recordings have grown more aggressive. Not only does the harsh voice speak but I also hear an underlying guttural sound as if some creature is breathing into the recorder. The commands it gives are so frightening that my dream now makes sense. Every morning I would wake to the boom of a gun. &lt;/p&gt;\n\n&lt;p&gt;I no longer keep ammunition for my shotgun. I wake up far too many mornings staring down its barrel. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I keep a shotgun beneath my bed.  \n\nI know what some of you are already saying. It’s a danger in the home, someone could get hurt. Or maybe that I’d have no possible way to arm myself in time if an intruder was present. That the weapon is more of a liability than a defense. On the average day though, it’s the only thing that helps me sleep at night.\n\nYour typical opponent to my stance can spout out a million reasons why I don’t need the weapon, but most can’t answer one question the way I do. Has anyone ever broken into your home?\n\nI had a normal childhood. I lived in a small rural town with virtually no crime. My home was in the country off an unkempt dirt road deep within the woods. My nearest neighbors were one mile away down the road to the north, and a graveyard a mile down the road to the south. In fact, the only way to even see the old place from the road was the dim light hanging above the pole barn on our property due to the steep, long drop off that was our driveway. \n\nOur home was a modest size and was surrounded by woods from every direction aside from the driveway down the hill. When the bus would drop me off from school I usually beat my parents home by half an  hour. It wasn’t a big deal, I was a responsible child and I never did anything reckless. I’d unlock the door, walk in, and sit at the table to do homework. \n\nOne specific day in the fall though was different than any other. I was roughly 10 and had just made my way inside. I patiently waited for my parents to arrive since it was Friday and a half day. I decided my homework could wait until Sunday. I walked down the stairs to the basement to go play Mario Kart when I heard a loud crash upstairs.\n\nGlass clearly had been shattered and I froze at the bottom of the stairwell. In my head I tried to think of any reason I could not to be scared. I wanted so badly to believe that a bird had crashed through the front window. Until I heard voices. \n\nI was struck with fear, but I knew what to do. Thankfully I was already in the basement and made my way through two unfinished rooms. The floors were cracked concrete, exposed ceiling beams rested overhead, and the off white dry wall marked the perimeter of the room. As I made my way past the furnace I knelt in front of the wall.\n\nOne specific piece of dry wall wasn’t actually attached. It had the heads of screws in each of the corners to seem as if it was. I pulled the piece out and made my way into the small space beneath the stairs, carefully pulling the drywall back into place by a small string that was attached.\n\nI waited for what seemed like ages as I heard the crashing of drawers, shattering of glass, and laughter. I tried my best to stay calm, until I heard the gun shot. I could feel my pulse pounding in my head as my hands shook. I passed out from fear.\n\nThankfully they never found me. The house was destroyed and thousands of dollars of my parent’s belongings were stolen. My mother had arrived after the ordeal and found me beneath the stairs. The police arrived shortly thereafter with my Dad. We would move into a small suburb in the coming month. Mom was too freaked out to live there anymore. I couldn’t blame her. \n\nLife changes after an event like that. It’s hard to think that someone was rummaging through your belongings. Picking and choosing what they’d like, armed with something they would be willing to use to do harm to your family. What I found worse though was that these robbers knew when my parents wouldn’t be home and when to strike. They had to have been watching us from the woods or the street. That was the thought that kept me up at night. I couldn’t handle going to sleep. Wondering if while I was at my most vulnerable someone was outside plotting against me. \n\nI kept my fears to myself though. I struggled to sleep for months with a recurring nightmare. It is odd though that I can’t seem to recall it exactly. All I know is that it took me quite some time to work past it and gain the courage to trust in the safety of my bed at night. I would never be fully comfortable again though, and I would always assume the worst in people. \n\nThis past year I moved into a new apartment on my own to finish up college. Unfortunately, it isn’t going well. The only thing I can afford is this shitty one bedroom apartment in the worst part of town. The chorus of sirens and flashing lights outside keep me up at night. Every creak and thud from my neighbors entering the complex makes me shudder. When I hear their voices I inch towards the edge of the bed beside the wall where my firearm resides.\n\nThe worst part though is the constant fearful state when I do wake from what little sleep I get. It’s a strange sensation when you wake in a cold sweat with a pounding heart, but you just can’t quite put your finger on what exactly occurred in your dreams. All I know is that just before I do wake, I hear the deafening crack of a gun. \n\nI wanted to focus on my studies for my senior year, but I decided I couldn’t stand being alone anymore. I had started dating a girl named Alyssa and it did seem to help. I’ve always felt so much more comfortable at night with others around. Not that Alyssa was particularly imposing, but I felt safer knowing she was in the bed beside me most nights. Needless to say, I didn’t really tell her about my troubles. Telling your new girlfriend you can’t sleep because you had a bad dream is probably not the biggest turn on. \n\nLast week on Saturday we slept in until 10. She said something that really caught me by surprise. She wasn’t able to catch the exact words, but she couldn’t believe how different my voice sounded in my sleep. I grew up having friends over whenever I could to keep me company at night, and never once had any of them ever mentioned that I talked in my sleep. That was when I developed an idea.\n\nI had always been curious about those recurring dreams that I could never seem to remember. Many of my sleepless nights were spent wondering. Perhaps what I said in my sleep could give me an idea, or just enough of a cue to jot my memory. The next night I decided to sleep with a small voice recorder.\n\nIt wasn’t anything special, just your run of the mill recorder. No bells or whistle, just a record, play, pause, and stop button. I bought it for lectures, but for the first time I was actually excited to use the device. Alyssa went home the next day, so I decided I’d try my experiment right away.\n\nIt was honestly the first time I looked forward to sleep. I tried to clear my mind from the thousands of theories floating around my head. The next morning was less than exciting though. My idea seemed sound, but I had 6 hours of recording to listen to, to see if I even spoke at all. I went about my studies with the recorder playing throughout the day.\n\nThere was a ton of white noise with the occasional rustle of covers, or deep breath. Naturally it wasn’t until the 5th hour when I finally heard anything. I could make out a series of mumbles followed by one clearly spoken phrase, “In my backpack.” The statement was puzzling, but the strangest part was exactly as Alyssa had said the night before. I sounded so much different. My voice was deeper and gruffer, it emanated much better. I figured it was just like any other time you fall asleep and get that hoarse voice in the morning. \n\nThe statement weighed on my mind all day. It perplexed me to the point that I even eye balled my backpack. As expected it held nothing but a binder with microbiology notes. I wrote it off as a random phrase and continued with my life. Just for fun, I’d try again the next night.\n\nAs always I awoke with a gasp covered in sweat with a racing heart. Again, I heard the shot which tore me from my slumber. I periodically listened to the recording throughout the day once more, and to my surprise I spoke again. I still had that deeper tone, but this time I said, “Backpack. Secret pocket.” \n\nThis phrase may seem like jibberish, but something in my brain clicked. I remembered my old backpack from middle school. It was a normal blue, 2 strapped bag with a zipper. I used to sneak candy into class though using what I called a secret pocket. Really it wasn’t a pocket at all, just a tear in the fabric between the zipper and the actual back of the bag. With that in mind, and my curiosity at an all time high, I decided to entertain my thoughts and visit my parents.\n\nI shot the shit with my mom for an hour when I first arrived. I only lived an hour away so I visited pretty regularly, but she was surprised to see me so early in the week. I told her I was in the neighborhood and wanted to talk to her. It was her least favorite subject, but I tried to question her about the incident. When she said the same old  things about it, I pressed further to focus on the aftermath with me. She seemed hesitant to reply but told me the worst part of the ordeal was how shaken I was. I asked her if she remembered me having bad dreams and she looked at me with hollow eyes.\n\n“It took you a long time to sleep right again. You used to wail in the night so much.”\n\nMy brow furled as she had never mentioned me speaking before in my sleep, “What did I say exactly?”\n\nMy mother looked down into her coffee cup for a moment before sighing, “You always said the same thing, that it was going to get you.”\n\nI gulped as I started to gain fragments of memory. For whatever reason, that phrase shook me. I made my way up to my old room with an added sense of dread. I’m ashamed to admit that I sprinted up the stairs and sharply looked behind myself once I reached the 12 step summit. I turned on three lights just to walk up to my room in broad daylight.\n\nAs I entered my childhood dwelling I stepped towards the closet with apprehension. Was I being a bit over top with this situation. After all, people without PTSD have bad dreams, and people mutter things in their sleep all the time. Maybe I would have been better off without the recording, because now the curiosity was too much. \n\nI tore through old boxes of toys and movies as I delved into my childhood. Old folders were filled with countless assignments and notes. There were certificates and report cards, and even a medal from when I played baseball. As I tossed all my old mementos to the side I finally found what I was looking for.\n\nThe old bag laid on the bottom of the box completely flattened. I pulled it out from the clutter and opened the zipper. An old binder was still inside with notes from algebra class. As I pulled it aside I reached down towards the rip in the fabric. I writhed my hand through the pocket uncovering a small notebook. Many pages were torn and the wire spiral was nearly flattened. As I flipped through I stared in disbelief at the notes I had no memory of writing. Nearly every page was a large black scribble, punctuated with the same phrase. “If I’m not afraid it can’t get me.” As I neared the end of the pages the scribble seemed to diminish in size and the phrase was no longer present. \n\nI left home that day with more questions than answers. Had I been plagued by some boogey man as a result of traumatic stress? Had I found some way to give myself a pep talk to overcome my fear? Why couldn’t I seem to recall any of this? I laid in bed staring at the ceiling, racking my brain wishing that Alyssa was with me.\n\nWhen I finally did fall asleep I only had my recorder to cuddle with. I was torn from sleep by the annoying sound of my alarm clock. I wasn’t in my bed though. I was standing upright before the window, my hand firmly placed upon the latch. I stared in disbelief as I re-locked it and made my way back to my room.\n\n The recorder played hours of nothingness once more until roughly an hour before I woke. This time I could hear myself in that same harsh voice say, “This time you’re mine.”\n\nA chill went down my spine while I thought back to the sleep walking incident. A million irrational thoughts bounced around my head as I wondered what I would have done had my alarm not woke me. I called Alyssa, begging her to stay with me. It was time to come clean. Thankfully she was receptive to the idea and understanding. I even got a sympathy lay. \n\nI didn’t want to weird out Alyssa, but I had to record myself once more. Despite her looks of concern, she gave me the okay and we hit the hay. That morning I awoke to her hand tightlyclutching my arm. “Where are you going?”\n\nAgain, I was startled and trying to orient myself. I had gotten out of bed once more, thankfully she felt the rustling and stopped me. I was noticeably shaken and she did her best to comfort me. Alyssa went to work that morning and I spent the rest of my day listening to the lengthy recording. By the time I realized, 5 hours had already passed.\n\nThe voice spoke once more in that harsh tone, “The window.” I was deeply unsettled by the statement which sounded less like a phrase and more of a command. I listened further with great curiosity, but I really wish I hadn’t.\n\nAlyssa came back for lunch and found me staring into space at the table. My face was covered in tears. She urged me to tell her what was wrong with a strong embrace. I looked at her as I wiped my eyes and played the recording. My girlfriend stared at me with a look of both confusion and concern. “You just talked in your sleep, it’s okay! Your mouth is dry that’s all!”\n\nI sharply interjected, “That’s not my voice!”\n\nAlyssa rolled her eyes, “Then whose is it? How do you know it’s not yours?”\n\nI continued the recording, she leaned in closely as we heard one soft word, “Yes.”\n\nI looked at Alyssa with my hands covering my mouth. She stumbled back into the wall. I exclaimed in terror, “I know that’s not my voice, because I just replied to it.”\n\nAlyssa never did come back after that. I sleep with multiple alarms to tear myself from my hypnotic sleep state. The recordings have grown more aggressive. Not only does the harsh voice speak but I also hear an underlying guttural sound as if some creature is breathing into the recorder. The commands it gives are so frightening that my dream now makes sense. Every morning I would wake to the boom of a gun. \n\nI no longer keep ammunition for my shotgun. I wake up far too many mornings staring down its barrel. \n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65oc0z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 292, "report_reasons": null, "author": "SleepinMongoose", "saved": false, "mod_reports": [], "name": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492434129.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65oc0z/ive_been_recording_myself_while_i_sleep/", "num_reports": null, "locked": false, "stickied": false, "created": 1492363597.0, "url": "https://www.reddit.com/r/nosleep/comments/65oc0z/ive_been_recording_myself_while_i_sleep/", "author_flair_text": null, "quarantine": false, "title": "I've Been Recording Myself While I Sleep", "created_utc": 1492334797.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 292}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgc0kae", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "During the break in while you hid as a child a shot was fired. Burglars don't normally fire their firearms for fun during a robbery. Perhaps there is more to the story that your parents withheld from you and you have been repressing since. You could be the host personality for another who developed to deal with what happened and is responsible for the writing you found in your backpack that you can't remember and is the voice in your sleep. Hypnotherapy may be of benefit to you in dealing with your hidden memories and dispelling your other personality. Good luck.", "edited": 1492354661.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;During the break in while you hid as a child a shot was fired. Burglars don&amp;#39;t normally fire their firearms for fun during a robbery. Perhaps there is more to the story that your parents withheld from you and you have been repressing since. You could be the host personality for another who developed to deal with what happened and is responsible for the writing you found in your backpack that you can&amp;#39;t remember and is the voice in your sleep. Hypnotherapy may be of benefit to you in dealing with your hidden memories and dispelling your other personality. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc0kae", "score_hidden": false, "stickied": false, "created": 1492377505.0, "created_utc": 1492348705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgc32ay", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "RCONSPIRACYISCORRUPT", "parent_id": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Hope you continue this story. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hope you continue this story. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc32ay", "score_hidden": false, "stickied": false, "created": 1492381864.0, "created_utc": 1492353064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgch6rx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "youhaveanicehouse", "parent_id": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Maybe you could leave another recording playing for your sleeping self telling you to remember to not be afraid and asking questions about what's happening to you. It seems that while you sleep you kind of know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you could leave another recording playing for your sleeping self telling you to remember to not be afraid and asking questions about what&amp;#39;s happening to you. It seems that while you sleep you kind of know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgch6rx", "score_hidden": false, "stickied": false, "created": 1492400975.0, "created_utc": 1492372175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgcizf2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CleanRoach", "parent_id": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "You should video record your sleep. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should video record your sleep. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcizf2", "score_hidden": false, "stickied": false, "created": 1492403277.0, "created_utc": 1492374477.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgcpym6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EllieJoe", "parent_id": "t1_dgcopve", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oooh, right. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oooh, right. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcpym6", "score_hidden": false, "stickied": false, "created": 1492412550.0, "created_utc": 1492383750.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcopve", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "maddiegonebonkers13", "parent_id": "t1_dgcn9dv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "There were two voices. The \"yes\" was said​ by OP and the preceding words like \"window\" were said by the entity with the gruff voice. That is how OP knew he wasn't the only one talking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There were two voices. The &amp;quot;yes&amp;quot; was said​ by OP and the preceding words like &amp;quot;window&amp;quot; were said by the entity with the gruff voice. That is how OP knew he wasn&amp;#39;t the only one talking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcopve", "score_hidden": false, "stickied": false, "created": 1492410841.0, "created_utc": 1492382041.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcn9dv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EllieJoe", "parent_id": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I exclaimed in terror, “I know that’s not my voice, because I just replied to it.” Can someone explain this to me? I feel stupid, but I don't get it :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I exclaimed in terror, “I know that’s not my voice, because I just replied to it.” Can someone explain this to me? I feel stupid, but I don&amp;#39;t get it :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcn9dv", "score_hidden": false, "stickied": false, "created": 1492408883.0, "created_utc": 1492380083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgcrwj3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "transmordred", "parent_id": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Maybe you should try placing a video recorder in your room, to see if you can find out what's doing the talking? I hope you're able to get to the bottom of this and get some decent sleep, either way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you should try placing a video recorder in your room, to see if you can find out what&amp;#39;s doing the talking? I hope you&amp;#39;re able to get to the bottom of this and get some decent sleep, either way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcrwj3", "score_hidden": false, "stickied": false, "created": 1492415197.0, "created_utc": 1492386397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgcfi6a", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SleepinMongoose", "parent_id": "t1_dgc30eh", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Thank you for your help with clarification, and thank you for reading!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your help with clarification, and thank you for reading!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcfi6a", "score_hidden": false, "stickied": false, "created": 1492398764.0, "created_utc": 1492369964.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc30eh", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "RNGjitse", "parent_id": "t1_dgc2wkx", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "He eyeballed his current backpack, but went back when he realised he needed his old one. The one he eyeballed was his current college one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He eyeballed his current backpack, but went back when he realised he needed his old one. The one he eyeballed was his current college one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc30eh", "score_hidden": false, "stickied": false, "created": 1492381782.0, "created_utc": 1492352982.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65oc0z", "likes": null, "replies": "", "user_reports": [], "id": "dgcfho7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SleepinMongoose", "parent_id": "t1_dgc2wkx", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "College backpack vs. backpack from middle school. Thanks for reading!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;College backpack vs. backpack from middle school. Thanks for reading!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcfho7", "score_hidden": false, "stickied": false, "created": 1492398743.0, "created_utc": 1492369943.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc2wkx", "gilded": 0, "archived": false, "score": -30, "report_reasons": null, "author": "RCONSPIRACYISCORRUPT", "parent_id": "t3_65oc0z", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "How could you \"eyeball your backpack if you had to go and find it the next day?  Totally didn't add up that bit. Still good but it took me out of the story ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How could you &amp;quot;eyeball your backpack if you had to go and find it the next day?  Totally didn&amp;#39;t add up that bit. Still good but it took me out of the story &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc2wkx", "score_hidden": false, "stickied": false, "created": 1492381616.0, "created_utc": 1492352816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -30}}], "after": null, "before": null}}]