[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So right off the bat I should probably tell you that I have a very, &lt;em&gt;very&lt;/em&gt; bad habit of exploring abandoned and condemned places. Its like an addiction, honestly - some people have drugs, some alcohol, still others cigarettes, and there I am, somewhere in the middle of all that - breaking in windows and stealing into forbidden pits in the dead of night, for no other reason than to purchase the littlest thrill. Like other addictions, too, this one is expensive, and dangerous, and its gotten me into trouble with the law on more than one occasion. And I know all of this, see, and yet &lt;em&gt;still&lt;/em&gt; I persist in the ill-advised exploration of apartment complexes and houses and factories and warehouses and churches and places of business, and any manner of building, really, assuming of course that its been abandoned before I get there. I&amp;#39;m 31, by the way - and in the years since this nonsense began I&amp;#39;ve lost track of the number of times well meaning loved ones have said “&lt;em&gt;Jesus,&lt;/em&gt; Andy. Grow up, will you, before you fall through a rotted floor and snap your neck.” &lt;/p&gt;\n\n&lt;p&gt;To their credit, and while I haven&amp;#39;t yet come particularly close to a neck-snapping, my hobby &lt;em&gt;has&lt;/em&gt; yielded more than a few close calls and broken bones and even a handful of hospital stays. There was the time I snapped my ankle six years back, for example, when exploring the now demolished Westport Hills apartment complex up on Main and 7th. Then there was the time the rappel line almost broke when I was scaling the wall of the St. Joseph Cardiovascular Center, about a year after they moved to the new facility, &lt;em&gt;and&lt;/em&gt; the time I dislocated a shoulder after falling through a rotted staircase in the old Swift River High School gymnasium. On top of those incidents, I&amp;#39;ve broken toes fourteen times, fingers eleven, and have racked up so many scrapes, bruises, and cuts that even my physician says it&amp;#39;s a wonder I can still take the bike out as often as I do (I may or may not have been telling him, just in case, that my injuries are caused by an infatuation with offroad biking). My fiancé even calculated once, after reviewing these incidents and factoring in the opportunity cost of missed wages, that my hobby has cost me a rough total of $52,667.89 in the decade since I’ve started. Her presenting that number to me was a way of saying it was time for a change, of course, but I didn&amp;#39;t listen to her any more than I&amp;#39;d listened to my physician, or my parents, or my friends. &lt;/p&gt;\n\n&lt;p&gt;No - it took something vastly more strange and twisted than medical fees and fractured toes to finally break my infatuation with “urban spelunking.” &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I was in the midst of exploring an old, long abandoned, dilapidated and multi-storied warehouse in a south-of-downtown district full of such places - although none quite so large as this - and the first thing I noticed that set this place apart was an excess of spider-webs. They were everywhere: in every corner, behind every bookshelf, on every doorknob and desk and table and chair. The entirety of this place had been made into an arachnid metropolis, and for the life of me I couldn’t recall ever hearing about a species of spider that spun silk with such reckless abandon (although perhaps the absence of men explained this behavior). Now! To a person less acquainted with ‘urban spelunking,’ as its called, this might’ve been a good a reason as any to turn back the way they came and never again set foot in this place. But for me, a man who spends as much time as possible in dark places and undercrofts and in abandoned locales - cobwebs are the most common and the least worrisome of the things I regularly encounter. And so, interest piqued and seeing no reason to give up the evening, I pressed forward. &lt;/p&gt;\n\n&lt;p&gt;The rest of the floor presented more of the same. Old architecture, chipped paint, rotting doors on red-rusted hinges, window panes smeared hard with dirt, and spider-webs; more than can be reasonably counted. By now I had spent at least most of the time since entering the building clearing webs from my hair and coat and shoes, and from my face, too. My fingers were sticky with silk, and each footstep I took produced a soft and peculiar &lt;em&gt;crunching&lt;/em&gt; sound that, after looking down, I realized was the result of walking overtop a thick carpet of those webs filled up with insect remains. &lt;/p&gt;\n\n&lt;p&gt;The next floor down - more filled with silk than the one I’d been on, if its possible, is when I encountered the first actual spider. Its true; with all the webs I’d seen thus far I hadn’t spotted a single eight-legged crawler among them, and only after I saw the first one a floor below did I realize the strangeness of that. But there she was, a big thing, leg-span the size of my outstretched palm and with a buttercream swirl on her abdomen, feasting on a housefly. She didn’t seem to notice me. But I took a few photos of her, and took mental note of her bizarre size and demeanor before moving onward.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;What the hell is this place?&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;My answer came soon enough. I found a desktop still on, miraculously enough, likely powered through some kind of backup generator, and once I booted it up I found the following chat log:&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;*2/2517:&lt;/p&gt;\n\n&lt;p&gt;Yo, you seeing all these fuckin’ webs?&lt;/p&gt;\n\n&lt;p&gt;Yeah. Talked to Matt earlier. Apparently he and Pittman are getting an exterminator down here to see what’s up.&lt;/p&gt;\n\n&lt;p&gt;When?&lt;/p&gt;\n\n&lt;p&gt;Saturday.&lt;/p&gt;\n\n&lt;p&gt;Good. Wish it was Friday, though. Haven’t had a half day in forever.&lt;/p&gt;\n\n&lt;p&gt;Right?*&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;*2/26/17&lt;/p&gt;\n\n&lt;p&gt;Found the biggest fuckin’ spider by the door this morning. &lt;/p&gt;\n\n&lt;p&gt;One with the red legs?&lt;/p&gt;\n\n&lt;p&gt;Yeah. Creepy as hell. &lt;/p&gt;\n\n&lt;p&gt;You kill it?&lt;/p&gt;\n\n&lt;p&gt;Fuck no. I ain’t risking my life if we’re getting an exterminator this weekend. &lt;/p&gt;\n\n&lt;p&gt;My thoughts exactly. We were all staring at the thing this morning from the break room. Cathy was losing her mind. &lt;/p&gt;\n\n&lt;p&gt;That why she went home early?&lt;/p&gt;\n\n&lt;p&gt;Yeah. Said she didn’t feel good. &lt;/p&gt;\n\n&lt;p&gt;Heh. Neither do I.*&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;*2/27/17&lt;/p&gt;\n\n&lt;p&gt;Dude Marcos quit today.&lt;/p&gt;\n\n&lt;p&gt;Which one is Marcos?&lt;/p&gt;\n\n&lt;p&gt;Janitor.&lt;/p&gt;\n\n&lt;p&gt;Oh shit. Really? He was a cool dude. I bum cigs from him on my fifteen. &lt;/p&gt;\n\n&lt;p&gt;Gotta bring your own, now. Guy’s never coming back.&lt;/p&gt;\n\n&lt;p&gt;What happened?&lt;/p&gt;\n\n&lt;p&gt;Apparently he found something in the basement that scared him shitless. Wouldn’t talk about it in detail. &lt;/p&gt;\n\n&lt;p&gt;Like a body?&lt;/p&gt;\n\n&lt;p&gt;I don’t know. Said something about webs. Pittman tried to get him to stick around, but he fuckin’ threw his key ring at him and left. &lt;/p&gt;\n\n&lt;p&gt;Seriously? &lt;/p&gt;\n\n&lt;p&gt;Yeah. Part of me wants to check it out myself. But not if its those fuckin’ spiders. No way. &lt;/p&gt;\n\n&lt;p&gt;Prolly is, man. I saw another one of those motherfuckers today in the bathroom. Must’ve been a half-pounder. I think it hissed at me. &lt;/p&gt;\n\n&lt;p&gt;Bet you had no problem pissing.&lt;/p&gt;\n\n&lt;p&gt;Lol.*&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;*2/28/17.&lt;/p&gt;\n\n&lt;p&gt;Was that guy in the overalls the exterminator?&lt;/p&gt;\n\n&lt;p&gt;I think so. &lt;/p&gt;\n\n&lt;p&gt;He’s been down there for a while. &lt;/p&gt;\n\n&lt;p&gt;Just thinking the same thing. Glad they didn’t wait till Saturday, at least.&lt;/p&gt;\n\n&lt;p&gt;Yeah but don’t they usually do an estimate before they get to work?&lt;/p&gt;\n\n&lt;p&gt;Idk. Depends.&lt;/p&gt;\n\n&lt;p&gt;Either way. He’s been down there since like, 9 AM. No way it should take this long to scout the place out. &lt;/p&gt;\n\n&lt;p&gt;For real. Pittman went down after him, too. &lt;/p&gt;\n\n&lt;p&gt;When?&lt;/p&gt;\n\n&lt;p&gt;Hour ago. Maybe two.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;*Yo. Look at Matt.&lt;/p&gt;\n\n&lt;p&gt;What’s his problem?&lt;/p&gt;\n\n&lt;p&gt;Idk. He’s been pacing like that for an hour. &lt;/p&gt;\n\n&lt;p&gt;Maybe he’s worried about Pittman. I can hear the accounting guys talking about this shit, too. Rumor’s getting around fast. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;*Uhh - why are there cops here?&lt;/p&gt;\n\n&lt;p&gt;Dude idk but Matt’s like, hyperventilating talking to them in his office. I overheard it on the way back from the can. &lt;/p&gt;\n\n&lt;p&gt;Still no sign of Pittman or the exterminator?&lt;/p&gt;\n\n&lt;p&gt;Nope. Hundred bucks Matt called the cops cause of that.&lt;/p&gt;\n\n&lt;p&gt;No shit. You think they’re okay?&lt;/p&gt;\n\n&lt;p&gt;No. You?&lt;/p&gt;\n\n&lt;p&gt;No. Whatever Marcos found down there the other day might’ve gotten ‘em. &lt;/p&gt;\n\n&lt;p&gt;Fuck, man. I might bolt. This is weird.*&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;*Did you get the email?&lt;/p&gt;\n\n&lt;p&gt;Yeah. They better not dock my PTO for this shit.&lt;/p&gt;\n\n&lt;p&gt;Who cares? This whole building is fucked if they’re clearing it out ‘indefinitely’ cause of some spider problem. &lt;/p&gt;\n\n&lt;p&gt;Think we’re out of jobs?&lt;/p&gt;\n\n&lt;p&gt;Idk. But I ain’t setting foot in this shit hole for a long, long time.*&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I shut the PC down and took in more ‘sights’ around the corner. More webs were there, and more spiders. One of them - sitting in its web in the highest corner between two windows - was an even more massive creature, with six eyes big enough to be seen glinting in the dark from the other end of the room. I estimated its weight to be at least a full pound, and in addition to those eyes I could see its pincers moving in and out as of shoveling its mouth with food that wasn’t there. I stepped a bit closer, and shined my flashlight on him to get a better l-&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Hissssssss!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I stumbled back and lowered the beam. I’d never heard a spider of any kind make a noise quite so loud, and I didn’t particularly care to find out what else differentiated it from other arachnids. So I started to back away, slowly, while- &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Hisssssssssssss!!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;All its pincers expanded as it vocalized the noise, and then it started pounding its tiny feet against the web, wobbling it; and it looked like it was getting ready to pounce. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Hisssssssssssss!!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;At that I turned around and ran, back in the direction I came, but I didn’t get far before I felt a small weight hit up against the small of my back, followed by the unmistakable sensation of tiny, skittering legs crawling their way up to my shoulder. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;HISSSSSSSSS!!!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;“FUCK!! Get the ff-&lt;em&gt;FUCK&lt;/em&gt; off me!!” I shook violently and thrashed around until I felt the weight  dislodge and fly off in the direction of the far wall. Then I shuddered and shook some more, for good measure, and when I turned to look for the spider, expecting it to be scampering off back to safety, I instead saw it sprinting towards me at full speed - likely at least fifteen miles per hour, maybe twenty. Only by bringing another desk crashing down on top of its head did I put a stop to it. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Fuck this place.&lt;/em&gt; I got my things back in order and started heading up towards the door, but again, I stopped in my tracks. There were dozens of the damn things, I saw - hundreds, maybe - staring at me hungrily from the pit of the darkness and blocking my way upstairs to the rappel line. One of them, a two pounder, stepped forward, and then others followed. One at first. Then five. Then ten. Then twenty, thirty, fifty - soon an uncountable horde of hideous, mutant eight-legged things were skittering and then thundering their way towards me.&lt;/p&gt;\n\n&lt;p&gt;I turned and ran, of course, around a corner, then another, stepping over webs and spiders and half-eaten insects and pieces of furniture so covered in thick, white silk that I couldn’t tell what they were, and all the way I was chased madly by the spiders. Eventually I found my way to the door leading down deeper into the building, to the third floor, and without thinking I ran my shoulder into it and threw it open and bounded down the stairs. Behind me - not even by a full five feet - was the &lt;em&gt;skittering.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;I looked around the new floor madly in search of a fire escape or any open windows at all that made afford me a comfortable enough descent to the ground outside. But there was nothing but windows bolted tight and a sign pointing down to the fourth floor, and then a janitor’s closet. In my haste to get to safety in whichever way presented itself soonest, I chose the janitor’s closet, regrettably - slamming the door shut behind me and leaning up against the far wall and breathing heavily in relief, however temporary it might’ve been. Then, and only then, did I realize the extent of my mistake: I was trapped. &lt;/p&gt;\n\n&lt;p&gt;And the &lt;em&gt;thumping&lt;/em&gt; began seconds later.  &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Thump. Thump. Thump. Thumpthumpthumpthumpthumpthumpthump.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The sounds of spiders leaping onto the shut door of the closet in search of a way inside was a chilling one, to say the least, especially when it occurred simultaneously with my above listed realization - but not quite as unnerving as the sound of skittering coming from &lt;em&gt;within the closet.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I looked down and with my flashlight saw that a multitude of little spiders, freshly hatched and yet each as big as a fist, had found their way quite easily underneath the crack of the door. I howled and stomped and slammed things down and heard a wet &lt;em&gt;squelch&lt;/em&gt; each time I did, and yet still they came. Soon they were on my shoes, and then inside them, and then on my ankle and crawling up my leg to the knee, and then up to my waist. Then I felt them on my back and chest, and soon they exploded from my shirt sleeves and collar and crawled their way down onto my arms and up to my throat and my face, hissing and chomping as they did. I wanted to scream but I couldn’t open my mouth to do so, for fear the things would crawl inside it. But thrash and shake and grab for them I did do, although with each spiderling I removed I soon felt five more, then ten - replace it. It was hopeless; I couldn’t stay here. I felt around the closet for something I could use - anything at all - and stopped when I brushed the cold metal of a fire extinguisher. So I grabbed it from the wall and let loose with it as soon as I’d kicked the closet door back open. &lt;/p&gt;\n\n&lt;p&gt;The spray sent waves of the waiting adult spiders reeling backwards in surprise, but once they realized they couldn’t be harmed by the foam, they rolled back in and started scampering towards me even after I threw the emptied red canister at them - killing two - and dashed hard for the fourth floor staircase. Luckily, a spiderling fell off my flesh with each footfall, and soon few enough remained that I could pick the bastards from my clothes and toss them into the walls without missing a beat. And so down I went, deeper and deeper and deeper; down one flight of stairs, and then another, and then another, driven not be destination but by the relentless, insatiable sea of legs and teeth following me down. &lt;/p&gt;\n\n&lt;p&gt;Only when I reached the bottom of that staircase and slam the much more secure door shut behind me did I take note of the lack of windows or exit points and the shifting of the air from at least somewhat clean to stale and musty and filthy - and again, realize my mistake. I was in the basement. And there was no escape to be made here, nor respite to be found.&lt;/p&gt;\n\n&lt;p&gt;I shined my flashlight around the room and caught my breath. Not only was there an even thicker carpet of webbing on the floor, so full in fact that it reach up to my knees, but I located the source of that abominable stench dangling from the ceiling.&lt;/p&gt;\n\n&lt;p&gt;Men. &lt;/p&gt;\n\n&lt;p&gt;Dozens and dozens of men, wrapped in silk, bereft of blood and color, hanging still and lifelessly from the rafter. On the ground were stiff limbs and innards, too, and in the back of the room was a formless mass, taking up most of the wall there. I stared hard at it for a bit to determine its nature. &lt;/p&gt;\n\n&lt;p&gt;And then the mass moved.&lt;/p&gt;\n\n&lt;p&gt;It was a monstrous, loathsome thing - a queen spider the size of a school bus with bristling hairs a half-foot long a piece - and it was drawn in my direction by the flashlight and by the rhythmic  &lt;em&gt;thump thump thumping&lt;/em&gt; of the other spiders throwing themselves up against the staircase door. She wobbled over, not yet aware of my location in the room but vastly too close for my meager comfort, and each of her footfalls shook the very walls of the room enough to loose strands of webbing from the dangling corpses above. &lt;/p&gt;\n\n&lt;p&gt;And then I made another mistake. A grave one; more so than hiding in the closet or trapping myself down here in the basement, and almost as grave as choosing this building to explore against all others. I moved. Just a little bit - just a quick step towards the relative safety of the wall over to my right before stopping. But it was enough. &lt;/p&gt;\n\n&lt;p&gt;That’s the thing about spiders - especially those spiders into whose webs you’ve stumbled; they’re constantly, incessantly, obsessively, &lt;em&gt;insatiably&lt;/em&gt; hungry, and nothing grabs their attention quite like a vibration in the lines of their rich-spun silk. Sometimes its dust or leaves or bits of dirt that cause it. But other times - like this one, I’m afraid - its food. And they’re very good at telling the difference. &lt;/p&gt;\n\n&lt;p&gt;I stopped abruptly (a bit too abruptly, perhaps) and slowly - as slowly as I could without reinforcing the queen’s intuition - I turned around to look at her. Her stance was different. She was crouched now. Still as stone, massive head tilted ever so slightly off to one side, legs bent at an odd angle. She was waiting for another sign of movement; the tiniest hint, even, that could tip her off to my exact location in this hideous labyrinth. And she could wait through the night for that one mistake; she was bred for this. And judging by her collection of bloodless trophies, she was quite good at it, too. &lt;/p&gt;\n\n&lt;p&gt;I didn’t dare move, but shake I did do - I shivered and quivered and quaked and sweat and couldn’t even wipe beads of the latter from my eyes, for fear that such a maneuver would be my last. &lt;em&gt;How sensitive were these webs to subtle movement? How sensitive is she?&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The whole room shook and I nearly fell into the webbing at my knees. &lt;em&gt;What the hell was that?!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;There it was again. I shook and wobbled, but held my ground and did my very, very best to stay still and quiet and small. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;My knees buckled, but still I stood my ground. I realized then, to my dismay, that she was stomping at the webs on the ground herself to get me to fall into them, knowing as I did that such a collapse would instantaneously - and quite fatally - give away my whereabouts. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I had to act. I had to do something. Anything. So I wracked my brain. There were no windows in this room, sadly, and only a single door that was the only thing between where I now stood and a horde of three pound spiders who’d followed me here. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Then, all of a sudden, I had an idea. Not a brilliant one, but it was a bit better than nothing. So I threw it into action. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This time I moved when she did, so her slamming her tree-trunk sized front leg into the ground masked my own movement just enough to keep her guessing. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;I moved again. The door was less than a foot away; possibly mere inches. If only I could reach out and wrap my hand around the bent brass of the knob…&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I grabbed it at last, and with a deep breath threw it open, allowing the shapeless mass of spiders to pour into the room. One came at first. Then five, ten, fifteen, thirty, fifty - soon so many of them were flooding in they could no longer be counted. And I, for the time being, was safely behind the door as they flew past, and I could feel the webs on the ground shaking under the multitude of fresh legs.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;THUD. THUD. THUD. THUD. THUD.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The Mother now had an abundance of new vibrations with which to contend, and I used her resulting and violent confusion to swing around the door the second the last small spider had flown through the threshold of it. Then, as I stood alone atop the lowest stair on the case, I withdrew a small gas lighter from my left-hand pants pocket. &lt;/p&gt;\n\n&lt;p&gt;That’s the thing about spider-webs, you see. They collect dust and dirt and, especially in industrial and residential areas - lint as well. Lots and lots and lots of it, over time - and those things, as it turns out, are quite flammable. So I knelt down and touched the tip of the flame to the nearest strand of web, and &lt;em&gt;whoosh!&lt;/em&gt; What started as a small spark soon washed over into a roaring, towering, monstrous inferno that consumed the room. Spiders squealed and leapt into the air and curled over and had their legs weathered by flame, and in the light of the flame I could see the Mother herself fully. She was an abhorrent mutation, saddled with a seething and writhing mass of eggs upon her back, some of which burst from exposure to the heat and smoke. Some spiderlings, each the size of a man and yet bizarrely underdeveloped, crawled out of the tatters upon the Mother’s back and tumbled straight into the fire below her and went up in ashes like the horde around them. She screeched something wicked as she saw this, and then turned towards me, wreathed in fire, and sprinted forward. I turned and ran, of course, up one flight of stairs, then another, and another, around the corner, and across the third floor with the closet. &lt;/p&gt;\n\n&lt;p&gt;By now the entire building was filled up with thick plumes of smoke and ash, and parts of the structure were crumbling away. None of this, of course, beset the Mother. She thundered right up behind me, smashing aside walls and furniture and webs and bellowing a twisted, hoarse shriek of anger the likes of which I’ve never heard nor wish to hear again. I tore across the burning floor, over desks and through flickering webs and tossing anything I could budge at speed behind me to slow her advance. &lt;/p&gt;\n\n&lt;p&gt;But in the end the building slowed it for me; I heard a tremendous, monstrous, cacophonous &lt;em&gt;cracking&lt;/em&gt; sound above and looked and saw, even as I fled, the ceiling itself giving way with the weight of the two floors above pushing it downward. I doubled my efforts of escape, huffing and puffing and sweating and praying and crying, and dove through a window and out into the night air just as the roof itself collapsed upon the Mother, killing her instantly and showing the street block in a blanket of sparkling ash. &lt;/p&gt;\n\n&lt;p&gt;I sat on the curb for a minute or two, breathing heavily and coming to terms with the fact that I was indeed alive after what was, by several orders of magnitude, the most harrowing ordeal of my life. I patted myself down. Cuts. Scrapes. Bruises. Nothing out of the ordinary. There were sirens in the vicinity, I heard, and I wasn’t particularly interested in adding an Arson charge to my record. So I took off in the opposite direction, towards my car, and I drove home. &lt;/p&gt;\n\n&lt;p&gt;I’ve been on my couch for a good hour now, still recovering and writing this account. Its been quite therapeutic, actually - getting all this on paper. Funny how that works. And now that its been set in stone, so to speak, I’ll write this, too: I’m retiring from ‘urban spelunking,’ effective immediately. I’m sure my fiance will be proud, and relieved. I know I am. But what &lt;em&gt;isn’t&lt;/em&gt; so reassuring is the fact that, ever since I got home and slammed the door shut and poured myself a cold stout, I’ve heard the faintest sound coming from the closet where I threw my gear - something so soft, in fact, that if my ears weren’t so attuned to its nature I might’ve missed it altogether. &lt;/p&gt;\n\n&lt;p&gt;It sounds like skittering. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.facebook.com/Jesse-Clark-1240521306017443/\"&gt;Facebook&lt;/a&gt;. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So right off the bat I should probably tell you that I have a very, *very* bad habit of exploring abandoned and condemned places. Its like an addiction, honestly - some people have drugs, some alcohol, still others cigarettes, and there I am, somewhere in the middle of all that - breaking in windows and stealing into forbidden pits in the dead of night, for no other reason than to purchase the littlest thrill. Like other addictions, too, this one is expensive, and dangerous, and its gotten me into trouble with the law on more than one occasion. And I know all of this, see, and yet *still* I persist in the ill-advised exploration of apartment complexes and houses and factories and warehouses and churches and places of business, and any manner of building, really, assuming of course that its been abandoned before I get there. I'm 31, by the way - and in the years since this nonsense began I've lost track of the number of times well meaning loved ones have said “*Jesus,* Andy. Grow up, will you, before you fall through a rotted floor and snap your neck.” \n\nTo their credit, and while I haven't yet come particularly close to a neck-snapping, my hobby *has* yielded more than a few close calls and broken bones and even a handful of hospital stays. There was the time I snapped my ankle six years back, for example, when exploring the now demolished Westport Hills apartment complex up on Main and 7th. Then there was the time the rappel line almost broke when I was scaling the wall of the St. Joseph Cardiovascular Center, about a year after they moved to the new facility, *and* the time I dislocated a shoulder after falling through a rotted staircase in the old Swift River High School gymnasium. On top of those incidents, I've broken toes fourteen times, fingers eleven, and have racked up so many scrapes, bruises, and cuts that even my physician says it's a wonder I can still take the bike out as often as I do (I may or may not have been telling him, just in case, that my injuries are caused by an infatuation with offroad biking). My fiancé even calculated once, after reviewing these incidents and factoring in the opportunity cost of missed wages, that my hobby has cost me a rough total of $52,667.89 in the decade since I’ve started. Her presenting that number to me was a way of saying it was time for a change, of course, but I didn't listen to her any more than I'd listened to my physician, or my parents, or my friends. \n\nNo - it took something vastly more strange and twisted than medical fees and fractured toes to finally break my infatuation with “urban spelunking.” \n\n---\n\nI was in the midst of exploring an old, long abandoned, dilapidated and multi-storied warehouse in a south-of-downtown district full of such places - although none quite so large as this - and the first thing I noticed that set this place apart was an excess of spider-webs. They were everywhere: in every corner, behind every bookshelf, on every doorknob and desk and table and chair. The entirety of this place had been made into an arachnid metropolis, and for the life of me I couldn’t recall ever hearing about a species of spider that spun silk with such reckless abandon (although perhaps the absence of men explained this behavior). Now! To a person less acquainted with ‘urban spelunking,’ as its called, this might’ve been a good a reason as any to turn back the way they came and never again set foot in this place. But for me, a man who spends as much time as possible in dark places and undercrofts and in abandoned locales - cobwebs are the most common and the least worrisome of the things I regularly encounter. And so, interest piqued and seeing no reason to give up the evening, I pressed forward. \n\nThe rest of the floor presented more of the same. Old architecture, chipped paint, rotting doors on red-rusted hinges, window panes smeared hard with dirt, and spider-webs; more than can be reasonably counted. By now I had spent at least most of the time since entering the building clearing webs from my hair and coat and shoes, and from my face, too. My fingers were sticky with silk, and each footstep I took produced a soft and peculiar *crunching* sound that, after looking down, I realized was the result of walking overtop a thick carpet of those webs filled up with insect remains. \n\nThe next floor down - more filled with silk than the one I’d been on, if its possible, is when I encountered the first actual spider. Its true; with all the webs I’d seen thus far I hadn’t spotted a single eight-legged crawler among them, and only after I saw the first one a floor below did I realize the strangeness of that. But there she was, a big thing, leg-span the size of my outstretched palm and with a buttercream swirl on her abdomen, feasting on a housefly. She didn’t seem to notice me. But I took a few photos of her, and took mental note of her bizarre size and demeanor before moving onward.\n\n*What the hell is this place?*.\n\nMy answer came soon enough. I found a desktop still on, miraculously enough, likely powered through some kind of backup generator, and once I booted it up I found the following chat log:\n\n---\n\n*2/2517:\n\nYo, you seeing all these fuckin’ webs?\n\nYeah. Talked to Matt earlier. Apparently he and Pittman are getting an exterminator down here to see what’s up.\n\nWhen?\n\nSaturday.\n\nGood. Wish it was Friday, though. Haven’t had a half day in forever.\n\nRight?*\n\n--- \n*2/26/17\n\nFound the biggest fuckin’ spider by the door this morning. \n\nOne with the red legs?\n\nYeah. Creepy as hell. \n\nYou kill it?\n\nFuck no. I ain’t risking my life if we’re getting an exterminator this weekend. \n\nMy thoughts exactly. We were all staring at the thing this morning from the break room. Cathy was losing her mind. \n\nThat why she went home early?\n\nYeah. Said she didn’t feel good. \n\nHeh. Neither do I.*\n\n---\n\n*2/27/17\n\nDude Marcos quit today.\n\nWhich one is Marcos?\n\nJanitor.\n\nOh shit. Really? He was a cool dude. I bum cigs from him on my fifteen. \n\nGotta bring your own, now. Guy’s never coming back.\n\nWhat happened?\n\nApparently he found something in the basement that scared him shitless. Wouldn’t talk about it in detail. \n\nLike a body?\n\nI don’t know. Said something about webs. Pittman tried to get him to stick around, but he fuckin’ threw his key ring at him and left. \n\nSeriously? \n\nYeah. Part of me wants to check it out myself. But not if its those fuckin’ spiders. No way. \n\nProlly is, man. I saw another one of those motherfuckers today in the bathroom. Must’ve been a half-pounder. I think it hissed at me. \n\nBet you had no problem pissing.\n\nLol.*\n\n---\n\n*2/28/17.\n\nWas that guy in the overalls the exterminator?\n\nI think so. \n\nHe’s been down there for a while. \n\nJust thinking the same thing. Glad they didn’t wait till Saturday, at least.\n\nYeah but don’t they usually do an estimate before they get to work?\n\nIdk. Depends.\n\nEither way. He’s been down there since like, 9 AM. No way it should take this long to scout the place out. \n\nFor real. Pittman went down after him, too. \n\nWhen?\n\nHour ago. Maybe two.\n\n---\n\n*Yo. Look at Matt.\n\nWhat’s his problem?\n\nIdk. He’s been pacing like that for an hour. \n\nMaybe he’s worried about Pittman. I can hear the accounting guys talking about this shit, too. Rumor’s getting around fast. \n\n---\n\n*Uhh - why are there cops here?\n\nDude idk but Matt’s like, hyperventilating talking to them in his office. I overheard it on the way back from the can. \n\nStill no sign of Pittman or the exterminator?\n\nNope. Hundred bucks Matt called the cops cause of that.\n\nNo shit. You think they’re okay?\n\nNo. You?\n\nNo. Whatever Marcos found down there the other day might’ve gotten ‘em. \n\nFuck, man. I might bolt. This is weird.*\n\n---\n\n*Did you get the email?\n\nYeah. They better not dock my PTO for this shit.\n\nWho cares? This whole building is fucked if they’re clearing it out ‘indefinitely’ cause of some spider problem. \n\nThink we’re out of jobs?\n\nIdk. But I ain’t setting foot in this shit hole for a long, long time.*\n\n---\n\nI shut the PC down and took in more ‘sights’ around the corner. More webs were there, and more spiders. One of them - sitting in its web in the highest corner between two windows - was an even more massive creature, with six eyes big enough to be seen glinting in the dark from the other end of the room. I estimated its weight to be at least a full pound, and in addition to those eyes I could see its pincers moving in and out as of shoveling its mouth with food that wasn’t there. I stepped a bit closer, and shined my flashlight on him to get a better l-\n\n*Hissssssss!*\n\nI stumbled back and lowered the beam. I’d never heard a spider of any kind make a noise quite so loud, and I didn’t particularly care to find out what else differentiated it from other arachnids. So I started to back away, slowly, while- \n\n*Hisssssssssssss!!*\n\nAll its pincers expanded as it vocalized the noise, and then it started pounding its tiny feet against the web, wobbling it; and it looked like it was getting ready to pounce. \n\n*Hisssssssssssss!!*\n\nAt that I turned around and ran, back in the direction I came, but I didn’t get far before I felt a small weight hit up against the small of my back, followed by the unmistakable sensation of tiny, skittering legs crawling their way up to my shoulder. \n\n*HISSSSSSSSS!!!*\n\n“FUCK!! Get the ff-*FUCK* off me!!” I shook violently and thrashed around until I felt the weight  dislodge and fly off in the direction of the far wall. Then I shuddered and shook some more, for good measure, and when I turned to look for the spider, expecting it to be scampering off back to safety, I instead saw it sprinting towards me at full speed - likely at least fifteen miles per hour, maybe twenty. Only by bringing another desk crashing down on top of its head did I put a stop to it. \n\n*Fuck this place.* I got my things back in order and started heading up towards the door, but again, I stopped in my tracks. There were dozens of the damn things, I saw - hundreds, maybe - staring at me hungrily from the pit of the darkness and blocking my way upstairs to the rappel line. One of them, a two pounder, stepped forward, and then others followed. One at first. Then five. Then ten. Then twenty, thirty, fifty - soon an uncountable horde of hideous, mutant eight-legged things were skittering and then thundering their way towards me.\n\nI turned and ran, of course, around a corner, then another, stepping over webs and spiders and half-eaten insects and pieces of furniture so covered in thick, white silk that I couldn’t tell what they were, and all the way I was chased madly by the spiders. Eventually I found my way to the door leading down deeper into the building, to the third floor, and without thinking I ran my shoulder into it and threw it open and bounded down the stairs. Behind me - not even by a full five feet - was the *skittering.* \n\nI looked around the new floor madly in search of a fire escape or any open windows at all that made afford me a comfortable enough descent to the ground outside. But there was nothing but windows bolted tight and a sign pointing down to the fourth floor, and then a janitor’s closet. In my haste to get to safety in whichever way presented itself soonest, I chose the janitor’s closet, regrettably - slamming the door shut behind me and leaning up against the far wall and breathing heavily in relief, however temporary it might’ve been. Then, and only then, did I realize the extent of my mistake: I was trapped. \n\nAnd the *thumping* began seconds later.  \n\n*Thump. Thump. Thump. Thumpthumpthumpthumpthumpthumpthump.*\n\nThe sounds of spiders leaping onto the shut door of the closet in search of a way inside was a chilling one, to say the least, especially when it occurred simultaneously with my above listed realization - but not quite as unnerving as the sound of skittering coming from *within the closet.*\n\nI looked down and with my flashlight saw that a multitude of little spiders, freshly hatched and yet each as big as a fist, had found their way quite easily underneath the crack of the door. I howled and stomped and slammed things down and heard a wet *squelch* each time I did, and yet still they came. Soon they were on my shoes, and then inside them, and then on my ankle and crawling up my leg to the knee, and then up to my waist. Then I felt them on my back and chest, and soon they exploded from my shirt sleeves and collar and crawled their way down onto my arms and up to my throat and my face, hissing and chomping as they did. I wanted to scream but I couldn’t open my mouth to do so, for fear the things would crawl inside it. But thrash and shake and grab for them I did do, although with each spiderling I removed I soon felt five more, then ten - replace it. It was hopeless; I couldn’t stay here. I felt around the closet for something I could use - anything at all - and stopped when I brushed the cold metal of a fire extinguisher. So I grabbed it from the wall and let loose with it as soon as I’d kicked the closet door back open. \n\nThe spray sent waves of the waiting adult spiders reeling backwards in surprise, but once they realized they couldn’t be harmed by the foam, they rolled back in and started scampering towards me even after I threw the emptied red canister at them - killing two - and dashed hard for the fourth floor staircase. Luckily, a spiderling fell off my flesh with each footfall, and soon few enough remained that I could pick the bastards from my clothes and toss them into the walls without missing a beat. And so down I went, deeper and deeper and deeper; down one flight of stairs, and then another, and then another, driven not be destination but by the relentless, insatiable sea of legs and teeth following me down. \n\nOnly when I reached the bottom of that staircase and slam the much more secure door shut behind me did I take note of the lack of windows or exit points and the shifting of the air from at least somewhat clean to stale and musty and filthy - and again, realize my mistake. I was in the basement. And there was no escape to be made here, nor respite to be found.\n\nI shined my flashlight around the room and caught my breath. Not only was there an even thicker carpet of webbing on the floor, so full in fact that it reach up to my knees, but I located the source of that abominable stench dangling from the ceiling.\n\nMen. \n\nDozens and dozens of men, wrapped in silk, bereft of blood and color, hanging still and lifelessly from the rafter. On the ground were stiff limbs and innards, too, and in the back of the room was a formless mass, taking up most of the wall there. I stared hard at it for a bit to determine its nature. \n\nAnd then the mass moved.\n\nIt was a monstrous, loathsome thing - a queen spider the size of a school bus with bristling hairs a half-foot long a piece - and it was drawn in my direction by the flashlight and by the rhythmic  *thump thump thumping* of the other spiders throwing themselves up against the staircase door. She wobbled over, not yet aware of my location in the room but vastly too close for my meager comfort, and each of her footfalls shook the very walls of the room enough to loose strands of webbing from the dangling corpses above. \n\nAnd then I made another mistake. A grave one; more so than hiding in the closet or trapping myself down here in the basement, and almost as grave as choosing this building to explore against all others. I moved. Just a little bit - just a quick step towards the relative safety of the wall over to my right before stopping. But it was enough. \n\nThat’s the thing about spiders - especially those spiders into whose webs you’ve stumbled; they’re constantly, incessantly, obsessively, *insatiably* hungry, and nothing grabs their attention quite like a vibration in the lines of their rich-spun silk. Sometimes its dust or leaves or bits of dirt that cause it. But other times - like this one, I’m afraid - its food. And they’re very good at telling the difference. \n\nI stopped abruptly (a bit too abruptly, perhaps) and slowly - as slowly as I could without reinforcing the queen’s intuition - I turned around to look at her. Her stance was different. She was crouched now. Still as stone, massive head tilted ever so slightly off to one side, legs bent at an odd angle. She was waiting for another sign of movement; the tiniest hint, even, that could tip her off to my exact location in this hideous labyrinth. And she could wait through the night for that one mistake; she was bred for this. And judging by her collection of bloodless trophies, she was quite good at it, too. \n\nI didn’t dare move, but shake I did do - I shivered and quivered and quaked and sweat and couldn’t even wipe beads of the latter from my eyes, for fear that such a maneuver would be my last. *How sensitive were these webs to subtle movement? How sensitive is she?* \n\n*THUD.*\n\nThe whole room shook and I nearly fell into the webbing at my knees. *What the hell was that?!*\n\n*THUD.* \n\nThere it was again. I shook and wobbled, but held my ground and did my very, very best to stay still and quiet and small. \n\n*THUD.*\n\nMy knees buckled, but still I stood my ground. I realized then, to my dismay, that she was stomping at the webs on the ground herself to get me to fall into them, knowing as I did that such a collapse would instantaneously - and quite fatally - give away my whereabouts. \n\n*THUD.*\n\nI had to act. I had to do something. Anything. So I wracked my brain. There were no windows in this room, sadly, and only a single door that was the only thing between where I now stood and a horde of three pound spiders who’d followed me here. \n\n*THUD.*\n\nThen, all of a sudden, I had an idea. Not a brilliant one, but it was a bit better than nothing. So I threw it into action. \n\n*THUD.*\n\nThis time I moved when she did, so her slamming her tree-trunk sized front leg into the ground masked my own movement just enough to keep her guessing. \n\n*THUD.* \n\nI moved again. The door was less than a foot away; possibly mere inches. If only I could reach out and wrap my hand around the bent brass of the knob…\n\n*THUD.*\n\nI grabbed it at last, and with a deep breath threw it open, allowing the shapeless mass of spiders to pour into the room. One came at first. Then five, ten, fifteen, thirty, fifty - soon so many of them were flooding in they could no longer be counted. And I, for the time being, was safely behind the door as they flew past, and I could feel the webs on the ground shaking under the multitude of fresh legs.\n\n*THUD. THUD. THUD. THUD. THUD.*\n\nThe Mother now had an abundance of new vibrations with which to contend, and I used her resulting and violent confusion to swing around the door the second the last small spider had flown through the threshold of it. Then, as I stood alone atop the lowest stair on the case, I withdrew a small gas lighter from my left-hand pants pocket. \n\nThat’s the thing about spider-webs, you see. They collect dust and dirt and, especially in industrial and residential areas - lint as well. Lots and lots and lots of it, over time - and those things, as it turns out, are quite flammable. So I knelt down and touched the tip of the flame to the nearest strand of web, and *whoosh!* What started as a small spark soon washed over into a roaring, towering, monstrous inferno that consumed the room. Spiders squealed and leapt into the air and curled over and had their legs weathered by flame, and in the light of the flame I could see the Mother herself fully. She was an abhorrent mutation, saddled with a seething and writhing mass of eggs upon her back, some of which burst from exposure to the heat and smoke. Some spiderlings, each the size of a man and yet bizarrely underdeveloped, crawled out of the tatters upon the Mother’s back and tumbled straight into the fire below her and went up in ashes like the horde around them. She screeched something wicked as she saw this, and then turned towards me, wreathed in fire, and sprinted forward. I turned and ran, of course, up one flight of stairs, then another, and another, around the corner, and across the third floor with the closet. \n\nBy now the entire building was filled up with thick plumes of smoke and ash, and parts of the structure were crumbling away. None of this, of course, beset the Mother. She thundered right up behind me, smashing aside walls and furniture and webs and bellowing a twisted, hoarse shriek of anger the likes of which I’ve never heard nor wish to hear again. I tore across the burning floor, over desks and through flickering webs and tossing anything I could budge at speed behind me to slow her advance. \n\nBut in the end the building slowed it for me; I heard a tremendous, monstrous, cacophonous *cracking* sound above and looked and saw, even as I fled, the ceiling itself giving way with the weight of the two floors above pushing it downward. I doubled my efforts of escape, huffing and puffing and sweating and praying and crying, and dove through a window and out into the night air just as the roof itself collapsed upon the Mother, killing her instantly and showing the street block in a blanket of sparkling ash. \n\n\nI sat on the curb for a minute or two, breathing heavily and coming to terms with the fact that I was indeed alive after what was, by several orders of magnitude, the most harrowing ordeal of my life. I patted myself down. Cuts. Scrapes. Bruises. Nothing out of the ordinary. There were sirens in the vicinity, I heard, and I wasn’t particularly interested in adding an Arson charge to my record. So I took off in the opposite direction, towards my car, and I drove home. \n\nI’ve been on my couch for a good hour now, still recovering and writing this account. Its been quite therapeutic, actually - getting all this on paper. Funny how that works. And now that its been set in stone, so to speak, I’ll write this, too: I’m retiring from ‘urban spelunking,’ effective immediately. I’m sure my fiance will be proud, and relieved. I know I am. But what *isn’t* so reassuring is the fact that, ever since I got home and slammed the door shut and poured myself a cold stout, I’ve heard the faintest sound coming from the closet where I threw my gear - something so soft, in fact, that if my ears weren’t so attuned to its nature I might’ve missed it altogether. \n\nIt sounds like skittering. \n\n---\n\n[Facebook](https://www.facebook.com/Jesse-Clark-1240521306017443/). ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pi0s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 185, "report_reasons": null, "author": "TheJesseClark", "saved": false, "mod_reports": [], "name": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492362544.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65pi0s/all_the_damn_cobwebs_at_7th_and_hull/", "num_reports": null, "locked": false, "stickied": false, "created": 1492383483.0, "url": "https://www.reddit.com/r/nosleep/comments/65pi0s/all_the_damn_cobwebs_at_7th_and_hull/", "author_flair_text": null, "quarantine": false, "title": "All The Damn Cobwebs At 7th And Hull", "created_utc": 1492354683.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 185}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgdbn8r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DarkChronos32", "parent_id": "t1_dgdbfpe", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The vibrations in the boss fight would be really fun to design.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The vibrations in the boss fight would be really fun to design.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdbn8r", "score_hidden": false, "stickied": false, "created": 1492451807.0, "created_utc": 1492423007.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbfpe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Geek1979", "parent_id": "t1_dgdazjs", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm thinking the spider mother could be some kind of an aberration. Maybe her lair has a portal or something in it, or like an altar where an idiotic wizard/cleric drew her onto this plane. Having the room full of webs in pitch black darkness is a great touch. The webs are highly flammable, which is great for the players, until they realize the mother's children have no problem blocking them from the exit if they set fire to the room. I don't think the warehouse would be 7 stories tall, but I love the idea of railroading the players down the stairs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m thinking the spider mother could be some kind of an aberration. Maybe her lair has a portal or something in it, or like an altar where an idiotic wizard/cleric drew her onto this plane. Having the room full of webs in pitch black darkness is a great touch. The webs are highly flammable, which is great for the players, until they realize the mother&amp;#39;s children have no problem blocking them from the exit if they set fire to the room. I don&amp;#39;t think the warehouse would be 7 stories tall, but I love the idea of railroading the players down the stairs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdbfpe", "score_hidden": false, "stickied": false, "created": 1492451092.0, "created_utc": 1492422292.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdazjs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DarkChronos32", "parent_id": "t1_dgcetty", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "So I'm not the only one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m not the only one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdazjs", "score_hidden": false, "stickied": false, "created": 1492449542.0, "created_utc": 1492420742.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcetty", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Geek1979", "parent_id": "t1_dgc9ahg", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I'm already writing it in my head.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m already writing it in my head.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcetty", "score_hidden": false, "stickied": false, "created": 1492397871.0, "created_utc": 1492369071.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9ahg", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Meilikki", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This would be an amazing D&amp;D encounter/quest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This would be an amazing D&amp;amp;D encounter/quest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc9ahg", "score_hidden": false, "stickied": false, "created": 1492390520.0, "created_utc": 1492361720.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgc9ypy", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "komstock", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Honestly OP, just get your house tented and fumigated. It ain't worth losing your life over. Also, just to make sure you don't just have an overactive imagination after your ordeal I'd find an open and obviously spiderless place, and confirm that any skittering is either real or imagined, not an unknown.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly OP, just get your house tented and fumigated. It ain&amp;#39;t worth losing your life over. Also, just to make sure you don&amp;#39;t just have an overactive imagination after your ordeal I&amp;#39;d find an open and obviously spiderless place, and confirm that any skittering is either real or imagined, not an unknown.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc9ypy", "score_hidden": false, "stickied": false, "created": 1492391393.0, "created_utc": 1492362593.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgc9tge", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thewrytruth", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Time to burn down your apartment, too!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Time to burn down your apartment, too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc9tge", "score_hidden": false, "stickied": false, "created": 1492391197.0, "created_utc": 1492362397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgcrejh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pina_colada_twist", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Dear gawd I can't stop shuddering. That was the most triggering thing I've read since... well... ever. Truly horrifying. I'm glad you made it out, I'd personally burn down your residence then put a few states (or continents or planets) between me and it. I hope you're okay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dear gawd I can&amp;#39;t stop shuddering. That was the most triggering thing I&amp;#39;ve read since... well... ever. Truly horrifying. I&amp;#39;m glad you made it out, I&amp;#39;d personally burn down your residence then put a few states (or continents or planets) between me and it. I hope you&amp;#39;re okay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcrejh", "score_hidden": false, "stickied": false, "created": 1492414538.0, "created_utc": 1492385738.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgd619o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MasterToast", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I love urbex as well but definitely feel hesitant now. Your writing is like Poe's--incredible work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love urbex as well but definitely feel hesitant now. Your writing is like Poe&amp;#39;s--incredible work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd619o", "score_hidden": false, "stickied": false, "created": 1492436204.0, "created_utc": 1492407404.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgch46z", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "IcyHolix", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Eek why did I read through the entire thing when I have arachnophobia ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eek why did I read through the entire thing when I have arachnophobia &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgch46z", "score_hidden": false, "stickied": false, "created": 1492400882.0, "created_utc": 1492372082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgc4nwp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "G_FATHER1259", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lil John ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lil John &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgc4nwp", "score_hidden": false, "stickied": false, "created": 1492384288.0, "created_utc": 1492355488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgcv6ia", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Splask", "parent_id": "t1_dgcuozu", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "7th and hull.\nedit: nice story btw, I can definitely envision a place like that in some strange corner of the city.", "edited": 1492393621.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;7th and hull.\nedit: nice story btw, I can definitely envision a place like that in some strange corner of the city.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcv6ia", "score_hidden": false, "stickied": false, "created": 1492419625.0, "created_utc": 1492390825.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgd4dbw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stabby11303", "parent_id": "t1_dgcuozu", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yep, I guessed it as well. Also seems like you used some actual middle/high school names! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, I guessed it as well. Also seems like you used some actual middle/high school names! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd4dbw", "score_hidden": false, "stickied": false, "created": 1492432931.0, "created_utc": 1492404131.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuozu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheJesseClark", "parent_id": "t1_dgcu9ug", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "As in Richmond, VA? How'd you guess that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As in Richmond, VA? How&amp;#39;d you guess that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcuozu", "score_hidden": false, "stickied": false, "created": 1492418977.0, "created_utc": 1492390177.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu9ug", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Splask", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Rva?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rva?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcu9ug", "score_hidden": false, "stickied": false, "created": 1492418421.0, "created_utc": 1492389621.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgd138g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Pull the fire alarm to get everyone out of your apartment building and then ARACHNINAPALM!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pull the fire alarm to get everyone out of your apartment building and then ARACHNINAPALM!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd138g", "score_hidden": false, "stickied": false, "created": 1492427705.0, "created_utc": 1492398905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgda29n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mmhmmyeahright", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "As a full on arachnophobe I cannot believe I made it through this!\nI just couldn't give up reading though, not until I knew you were safe, or at least not suffering anymore the chomping jaws of....ahh heck I can't even say the word, (rhymes with cider), without shivering like a tree in a hurricane!\n\nBurn your house down!!! Torch that bitch like a hero!\nJesus Almighty! Yeeeeesh!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a full on arachnophobe I cannot believe I made it through this!\nI just couldn&amp;#39;t give up reading though, not until I knew you were safe, or at least not suffering anymore the chomping jaws of....ahh heck I can&amp;#39;t even say the word, (rhymes with cider), without shivering like a tree in a hurricane!&lt;/p&gt;\n\n&lt;p&gt;Burn your house down!!! Torch that bitch like a hero!\nJesus Almighty! Yeeeeesh!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgda29n", "score_hidden": false, "stickied": false, "created": 1492446324.0, "created_utc": 1492417524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65pi0s", "likes": null, "replies": "", "user_reports": [], "id": "dgdk4la", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iloveagoodscare", "parent_id": "t3_65pi0s", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That was very frightening, you were lucky to get out of there alive. I'd call an exterminator to deal your closet but you better tell him that the spider might be larger than average.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was very frightening, you were lucky to get out of there alive. I&amp;#39;d call an exterminator to deal your closet but you better tell him that the spider might be larger than average.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdk4la", "score_hidden": false, "stickied": false, "created": 1492468902.0, "created_utc": 1492440102.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]