[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve already told the local authorities everything I can. I&amp;#39;ve tried to convince them that I&amp;#39;m not a lunatic or comedian telling some long, cruel, twisted joke. I&amp;#39;ve tried writing op-ed&amp;#39;s in local newspapers, but no one will let me publish them. This town seems intent on plugging its ears and averting its eyes to my testimony. All I can hope is that the internet will be a little kinder to my side of what happened to May Higgins.&lt;/p&gt;\n\n&lt;p&gt;May Higgins, for those of you who don&amp;#39;t live in my town--and with our four-digit population, it&amp;#39;s safe to assume that&amp;#39;s everyone reading this--was a cheerleader at a college just five miles from our little town. She&amp;#39;d lived in her home town all her life, was the only person in the history of time who could look good even with bangs and overalls, and because of her state ranking in cheer, drill, and gymnastics, she was a kind of local sports hero. When she received a full-tuition cheer scholarship, everyone in a three-mile radius went nuts--they were so proud that someone from our little patch of country might be known for something more than repairing cars or farming corn. They basked in the glow of their neighbor-and-idol, looked down at their little ones and told them with an unshakable certainty, &amp;quot;That could be you one day. If May Higgins could make it big, you could make it big, too.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For a while, this is how I knew May--as a face. A pretty face, sure, but without any exchanges or meaningful run-ins between us, there wasn&amp;#39;t any real reason for me to care about May Higgins. That was, until about a month ago, when she entered my little run-down Chevron.&lt;/p&gt;\n\n&lt;p&gt;Though it&amp;#39;s not the best way to earn a living, &amp;quot;gas station manager&amp;quot; is probably the best job I can land. The little gas station store is crumbly and in dire need of a renovation. The pumps might work fine, but not the little blue-and-red hut next to it. The front entrance only opens with a big shove since the hinges have rusted into a greasy orange-red. If a customer is either strong or persistent enough to creak the door open, the first thing that greets them is the sickeningly sweet smell of Pepsi that some drunk asswipe spilled years ago and hasn&amp;#39;t ever left the floor, despite my fervent cleaning. If that doesn&amp;#39;t deter them from getting their bag of Lays, the chime connected to the front door--which is both extremely delayed and extremely loud--usually knocks them flat on their ass.&lt;/p&gt;\n\n&lt;p&gt;At this point, it&amp;#39;s useless to interact with them. Sometimes, if you&amp;#39;re lucky, they&amp;#39;ll give you a tired look and a sullen &amp;quot;thanks&amp;quot; at the checkout. Other times, they&amp;#39;ll just grimace and stay dead silent as they shuffle over to the counter. The second they get situated in their cars, they peel out at fifty, ready to tell their friends in the big city about the weird hick gas station they went to one time with a manager too incompetent to fix anything. It&amp;#39;s even worse with the locals--everybody knows everybody, and when somebody bad-mouths anybody, everybody hears it. I&amp;#39;ve been working there for two years, after the last guy quit and promptly left the town. After all the dirty looks I&amp;#39;ve gotten, I can understand why he did both.&lt;/p&gt;\n\n&lt;p&gt;Only three people in my entire life haven&amp;#39;t given me shit about my gas station: my papa, my best friend Ned, and May Higgins.&lt;/p&gt;\n\n&lt;p&gt;I knew something was up with May that night for two reasons. First, she went to my gas station. From what she was made out to be, May probably had people who did that kind of errand for her. I just couldn&amp;#39;t picture May Higgins driving all alone through the cornfields between our town and the freeway in the dead of night. Second, her nose didn&amp;#39;t twitch when she walked into my shop--it was as if the Pepsi smell didn&amp;#39;t bug her in the slightest. I recognized her the second she entered, of course, so I asked her in a feeble attempt to make conversation, &amp;quot;Ey, yer May Higgins, aren&amp;#39;t ya? The young cheer star, right?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;May turned to me with the biggest smile any customer had ever sent my way. &amp;quot;I wouldn&amp;#39;t say &amp;#39;star&amp;#39;,&amp;quot; she laughed, &amp;quot;but I guess that&amp;#39;s what people around here call me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Didn&amp;#39;t expect her to be humble. Or with such a high-pitched voice. &amp;quot;Yea.&amp;quot; I replied, watching her inspect the aisles one-by-one. &amp;quot;Ey, um... do you need help findin&amp;#39; some gum.. er... chips er somethin&amp;#39;?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She stopped strolling around and gazed at me intently. &amp;quot;Some beef jerky, if you have it.&amp;quot; She inquired.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Huh. Wouldn&amp;#39;t peg ya as the jerky-eatin&amp;#39; type.&amp;quot; I wondered under my breath.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What&amp;#39;s that?&amp;quot; She asked, rubbing her forehead.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Nuthin&amp;#39;. Um... I think there&amp;#39;s Slim Jims in the fourth aisle down, right behind ya.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;May marched over to the aisle and eyed the jerky. A little frown crossed her face. &amp;quot;Sorry to bug you, mister; I&amp;#39;m wondering if you have any more.&amp;quot; She asked.&lt;/p&gt;\n\n&lt;p&gt;Now I was aching with curiosity. There&amp;#39;s no way this one-hundred-twenty-pound lady needed more jerky than what was on the shelf. Maybe she was buying for some friends--for a party, maybe. But what group of jackasses gets together for a party and thinks, &amp;quot;You know what we really need to get this party started? Some Slim Jims!&amp;quot; And who in their right mind would send out cheer star May Higgins to pick it up?&lt;/p&gt;\n\n&lt;p&gt;I would have continued along with my Red Bull-fueled train of thought if it hadn&amp;#39;t been blasted from its tracks by the door chime, which blared as obnoxiously late and loud as ever.&lt;/p&gt;\n\n&lt;p&gt;May didn&amp;#39;t even look startled, but I assured her anyway, &amp;quot;Don&amp;#39;t worry, it does that sometimes. Sorry, what were ya askin&amp;#39; about?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If you don&amp;#39;t have any, I understand.&amp;quot; May continued. &amp;quot;I know it&amp;#39;s an odd request, but I really need as much as possible.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Naw, it&amp;#39;s not odd... I have more in the back.&amp;quot; I assured her. &amp;quot;Do ya mind if I ask what it&amp;#39;s fer, though?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;May looked over at me chillingly. &amp;quot;Do you really want to know?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I stared at her for a while, calculating my response. I couldn&amp;#39;t really believe how intimidating this girl suddenly was. There was nothing physically threatening about her--I was a solid foot taller than her, and with a pistol tucked under the checkout counter, there was no way she could take advantage of me. I couldn&amp;#39;t even believe my brain was going in this direction; May Higgins wouldn&amp;#39;t attack anyone, and certainly wouldn&amp;#39;t attack a gas station manager who could smack her down in an instant.&lt;/p&gt;\n\n&lt;p&gt;But then, she didn&amp;#39;t need to attack me physically. May Higgins was the town&amp;#39;s pride and joy. If she spoke even one sour word about me, everyone would be on my ass, and I figured May knew that just as well as I did. Maybe that&amp;#39;s why she asked me if I really wanted to know what she what the jerky was for. It was like a test--a warning. The water going out to sea before a tsunami of social dismemberment.&lt;/p&gt;\n\n&lt;p&gt;So I said nothing. Nothing except for, &amp;quot;I&amp;#39;ll bring out the box from the back,&amp;quot; &amp;quot;here&amp;#39;s your total, ma&amp;#39;am,&amp;quot; and &amp;quot;thank you, ma&amp;#39;am&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And then, May left without another word. As her skinny silhouette disappeared with her jerky into a small red sedan, I realized how much of a jackass I was. She was one of the few people who ever treated me with respect, and all I&amp;#39;d done was make her uncomfortable the entire time she was in my store. What did I care what she did with the Slim Jims? What did it matter how many she&amp;#39;d bought? Idiot, idiot, idiot.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when I decided I would apologize to her. Without another thought, I locked up the store, got into my pickup, and revved off to follow May Higgins&amp;#39;s car as it drove into the night.&lt;/p&gt;\n\n&lt;p&gt;One mile went by. Then two. Then five. After about ten miles, I realized that I had left the paved road and was bumping around across sand and rocks. A familiar sense of foreboding crept into my head, but I promptly expelled it; it&amp;#39;s my paranoia and overactive imagination that got me into trouble with May in the first place. It wasn&amp;#39;t going to screw things up again.&lt;/p&gt;\n\n&lt;p&gt;The lights of May&amp;#39;s car grew closer and faded, and I realized she&amp;#39;d stopped in the middle of the desert.&lt;/p&gt;\n\n&lt;p&gt;At this point, whatever was left of my survival instinct slammed on the brakes and shut off the engine. I slid my keys into my front pocket in an effort to stop my nosy mind from edging the truck forward. Something about this whole damned thing was off and I couldn&amp;#39;t just keep ignoring it. I was right to be suspicious of May at the station, and I was right to be suspicious now. I strained to adjust my eyes to the darkness, trying desperately to outline the shape of May&amp;#39;s car parked in the middle of the road, surrounded on either sides by endless rows of dark stalks.&lt;/p&gt;\n\n&lt;p&gt;They adjusted just in time to catch the driver&amp;#39;s side door on May&amp;#39;s little car burst open--just in time to see May sprint from the car into the adjacent field, screaming at the top of her lungs. I trembled in my dim truck as the screams increased in both pitch and volume and pierced my eardrums in a solid stream of white noise.&lt;/p&gt;\n\n&lt;p&gt;And then, nothing.&lt;/p&gt;\n\n&lt;p&gt;The dry stalks, the dull, cracked road, the dark clouds hanging in the sky--nothing stirred.&lt;/p&gt;\n\n&lt;p&gt;Everything was completely, dreadfully still.&lt;/p&gt;\n\n&lt;p&gt;And then, something crept out of the corn field.&lt;/p&gt;\n\n&lt;p&gt;Something tall, skinny, and definitely not May Higgins.&lt;/p&gt;\n\n&lt;p&gt;It looked almost like a stalk of corn itself--gangly, and shambling along on long, tattered limbs. I thought--or, rather, hoped--that my eyes were playing games with me until it violently erected its spine and charged May&amp;#39;s car. Upon reaching the car, it snapped its head back and bellowed a metallic, grinding moan before slamming itself against the trunk repeatedly and headfirst. Each time, the car&amp;#39;s skeleton creaked and its backside became increasingly dented until finally, with a weak pop, the trunk slowly opened. I could&amp;#39;ve sworn I saw a grin split the tall thing&amp;#39;s face as it readjusted its neck and plunged its dripping jaws into the box of Slim Jims stowed away in May&amp;#39;s trunk.&lt;/p&gt;\n\n&lt;p&gt;As the sickening crunch of cardboard, plastic, and meat echoed through the fields, I reached down to my side and fumbled around for my pistol in a desperate effort to comfort myself... only to realize that I&amp;#39;d left it at the store.&lt;/p&gt;\n\n&lt;p&gt;Still looking bewilderedly at the floor of the truck, praying for my pistol to magically appear, I wondered how much longer it would be before that thing finished eating. I wondered how much longer it would take for it to notice my truck idling in the road. I didn&amp;#39;t want to find out.&lt;/p&gt;\n\n&lt;p&gt;Then, my mind turned to May Higgins. The poor girl had probably been feeding whatever this thing was to keep it away from other people. Of course, this only made me more guilty about how I&amp;#39;d treated her; in the end, all she wanted was to help my town and keep this monster at bay. How long had she been shouldering the burden? How many times had she driven here, dashed out of the car, screamed to get its attention, and hid out in the field, hoping it would be satisfied with the meal she&amp;#39;d brought it? Hoping it wouldn&amp;#39;t turn on her?&lt;/p&gt;\n\n&lt;p&gt;How many close scrapes had May had with this thing? What if this time, it got to her before it got to the car?&lt;/p&gt;\n\n&lt;p&gt;Why had May&amp;#39;s screaming stopped so abruptly?&lt;/p&gt;\n\n&lt;p&gt;The noise from May&amp;#39;s car ceased. I looked up from the truck&amp;#39;s floor to see a pair of bright, yellow, throbbing eyes pressed against my windshield.&lt;/p&gt;\n\n&lt;p&gt;I let out a pathetic yelp and scrambled for my keys, tugging them from my pocket just as that thing let out another sharp, resonating moan. I jammed my keys into the ignition as a violent crack rippled through my truck; the thing had bashed its head into my engine. &amp;quot;No, no, no, no.&amp;quot; I stammered as I twisted my key, only to hear the engine splutter and wheeze. &amp;quot;No, no, no, no, no, NO!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Another crack. Metal and bone crunched together, and just as I jolted my head up, it stared at me again with piercing, greedy eyes. I tried the ignition again--nothing. I screamed in a mix of agony and terror, gripping and wrenching the key. Finally, my truck purred to life, and I whipped my head up again, ready to run over that damned monstrosity... only to find that it wasn&amp;#39;t there.&lt;/p&gt;\n\n&lt;p&gt;My heart plunked into my lower intestine. Another crack came from above, and the roof right next to my head crunched like an aluminum can. Without another thought, I peeled my truck backwards, sending the monster hurtling forward and smack onto the road in a cloud of dust. As I swerved my car around, I sped all the way back to my gas station. I looked into the mirror to see that thing&amp;#39;s yellow eyes still glinting back in the distance, and I pressed even harder on the gas.&lt;/p&gt;\n\n&lt;p&gt;When I finally reached the station, I realized that the creature was only about a mile behind me--that it would be upon my store in maybe only a minute. I bashed the door open, sprinted for the checkout counter, snatched up my pistol--&lt;/p&gt;\n\n&lt;p&gt;It was in the doorway now.&lt;/p&gt;\n\n&lt;p&gt;--Pointed the gun, clenched my jaw, tightened my grip, and fired all six bullets into its thin body, sending it convulsing and screaming through the plexiglass and into a twitching mess on the cement outside. With about a billion glass shards in my arms and face, and feeling none too eager to fight the creature through my stinging pain, I didn&amp;#39;t wait to see if it was still alive. Instead, I ran into the back room of the store, barricaded the door with all the soda and beer boxes I could find, and dialed the police--something I probably should have done a long time ago.&lt;/p&gt;\n\n&lt;p&gt;They arrived ten minutes later and, after another ten, coaxed me out of the back room. The creature--or what was left of it--was no longer outside my shop. In its place was a puddle of blood and a large red stain leading back into the cornfields. When the sheriff finally arrived to check out the bizarre scene, he let out a full-bellied sigh and grunted, &amp;quot;Son. You didn&amp;#39;t... you didn&amp;#39;t shoot one of yer customers or nothin&amp;#39; stupid like that, did ya?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;After a long, worn stare, I finally replied, &amp;quot;It attacked May Higgins, too.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s all the sheriff needed to hear before a full shitload of squad cars arrived and set out on the biggest search-and-rescue mission this little town ever engineered. I led them down the dirt road to May&amp;#39;s car and they sprawled out, covering just about every nook and cranny. It only took them an hour to find May.&lt;/p&gt;\n\n&lt;p&gt;She was found terribly bloodied and dirt-caked, with cracked lips, broken ribs and bones, and a fractured skull... but alive.&lt;/p&gt;\n\n&lt;p&gt;The police sent me to the same hospital as May in the big city--though I recovered within about a day. I asked the staff how bad her injuries were multiple times, and I was met with stony looks. When I finally got a nurse&amp;#39;s assistant to crack, she told me &amp;quot;All I can tell you is that we&amp;#39;ve seen people hit by cars in better condition than her. It&amp;#39;s going to take time, and, honestly, we&amp;#39;re not even sure right now if we&amp;#39;ll release her at all.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Of course, they did eventually release May Higgins--two-hundred and seventy days later. And when they did, her first request was to speak with me. I met her at a bench just across from her school--her face and physique were just as perfect as the day she walked into my station.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re the talk of the town.&amp;quot; She cheered, beaming. &amp;quot;The most &amp;#39;invaluable asset&amp;#39; in finding me, is what I recall the paper said.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah,&amp;quot; I acknowledged, &amp;quot;I guess that&amp;#39;s what people around here are sayin&amp;#39;. Some of &amp;#39;em, at least. There&amp;#39;s still a decent chunk that thinks I&amp;#39;m the one who beat you so bad.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;May sighed. &amp;quot;There are always a few nuts--critics who&amp;#39;ll do anything to tear you down.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A slight breeze lifted the hair from her face, and I could see a faint scar running across her forehead. &amp;quot;So,&amp;quot; she asked, &amp;quot;does anyone know about what did it?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The police are working on discerning whether it was a &amp;#39;bear&amp;#39; or &amp;#39;serial killer&amp;#39;.&amp;quot; I groaned.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, in other words--&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They have no idea what&amp;#39;s out there.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah.&amp;quot; May muttered.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ya know, maybe I shot it enough to kill it.&amp;quot; I proposed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Bullets won&amp;#39;t do the job.&amp;quot; May corrected. &amp;quot;Even point-blank. Trust me, I&amp;#39;ve tried.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And gotten away?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well, I&amp;#39;m experienced. I&amp;#39;ve been dealing with it for a long time. The jerky is enough to distract it since it usually goes for the largest hunks of meat it can find.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Jeezus, May.&amp;quot; I gasped.&lt;/p&gt;\n\n&lt;p&gt;I looked over at her again. Every few seconds, little shivers ran up and down her body, and I could tell she was still re-living that horrible night.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So,&amp;quot; I tried to change the subject, &amp;quot;I&amp;#39;ve decided to move to the big city. I transferred to a Chevron far outta the county. Don&amp;#39;t worry... I&amp;#39;m sure some other dumbass&amp;#39;ll come along and be more than happy to supply ya with jerky.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;May chuckled. &amp;quot;I&amp;#39;ve made a bit of a change as well. I&amp;#39;m taking a little break from cheer--removing myself from unnecessary stress until I get my bearings. The college understands, and I&amp;#39;ve managed to cut a deal so I can keep my scholarship.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The bell of the college&amp;#39;s church tolled, and May told me she had to get going. I wanted to leave on as best terms as possible, but my mind was still whirring with questions that had been stewing inside of it for months.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;May,&amp;quot; I beckoned, &amp;quot;why haven&amp;#39;t ya told anyone?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I really have to be going--I&amp;#39;m going to miss my class. Here&amp;#39;s my email, if you want to chat.&amp;quot; She dropped a slip of paper on the bench next to me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;May, people are goin&amp;#39; to get hurt. Someone&amp;#39;s goin&amp;#39; to wander into those fields at the wrong time and it&amp;#39;s gonna maul &amp;#39;em.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please--we can talk later.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I looked over at the paper she&amp;#39;d given me.&lt;/p&gt;\n\n&lt;p&gt;It was completely blank.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;May! May, I want to know! You can&amp;#39;t do this on yer own! If I hadn&amp;#39;t distracted it, it would&amp;#39;ve killed ya!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;May dashed away. I finally got my senses and stood to follow her, shouting like a jackass. &amp;quot;May, one day the jerky won&amp;#39;t be enough! One day it&amp;#39;s gonna need more, May!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She gave me one last guilty nod before rushing into her lecture hall, disappearing from my life just as quickly as she&amp;#39;d entered it.&lt;/p&gt;\n\n&lt;p&gt;I was about to whip the door open and follow after her, but the same feeling that made me slam down on my brakes that one fateful night froze me in place. &amp;quot;May.&amp;quot; I whispered.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;May, how did ya get away all those times? How didn&amp;#39;t it find ya? How didn&amp;#39;t you get hurt all those other times?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I already knew the answer.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How&amp;#39;d you get that scar on yer forehead, May?&amp;quot; I chuckled to myself as fear I&amp;#39;d not felt in months trickled back into my veins. &amp;quot;And why do you always wear bangs?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've already told the local authorities everything I can. I've tried to convince them that I'm not a lunatic or comedian telling some long, cruel, twisted joke. I've tried writing op-ed's in local newspapers, but no one will let me publish them. This town seems intent on plugging its ears and averting its eyes to my testimony. All I can hope is that the internet will be a little kinder to my side of what happened to May Higgins.\n\nMay Higgins, for those of you who don't live in my town--and with our four-digit population, it's safe to assume that's everyone reading this--was a cheerleader at a college just five miles from our little town. She'd lived in her home town all her life, was the only person in the history of time who could look good even with bangs and overalls, and because of her state ranking in cheer, drill, and gymnastics, she was a kind of local sports hero. When she received a full-tuition cheer scholarship, everyone in a three-mile radius went nuts--they were so proud that someone from our little patch of country might be known for something more than repairing cars or farming corn. They basked in the glow of their neighbor-and-idol, looked down at their little ones and told them with an unshakable certainty, \"That could be you one day. If May Higgins could make it big, you could make it big, too.\"\n\nFor a while, this is how I knew May--as a face. A pretty face, sure, but without any exchanges or meaningful run-ins between us, there wasn't any real reason for me to care about May Higgins. That was, until about a month ago, when she entered my little run-down Chevron.\n\nThough it's not the best way to earn a living, \"gas station manager\" is probably the best job I can land. The little gas station store is crumbly and in dire need of a renovation. The pumps might work fine, but not the little blue-and-red hut next to it. The front entrance only opens with a big shove since the hinges have rusted into a greasy orange-red. If a customer is either strong or persistent enough to creak the door open, the first thing that greets them is the sickeningly sweet smell of Pepsi that some drunk asswipe spilled years ago and hasn't ever left the floor, despite my fervent cleaning. If that doesn't deter them from getting their bag of Lays, the chime connected to the front door--which is both extremely delayed and extremely loud--usually knocks them flat on their ass.\n\nAt this point, it's useless to interact with them. Sometimes, if you're lucky, they'll give you a tired look and a sullen \"thanks\" at the checkout. Other times, they'll just grimace and stay dead silent as they shuffle over to the counter. The second they get situated in their cars, they peel out at fifty, ready to tell their friends in the big city about the weird hick gas station they went to one time with a manager too incompetent to fix anything. It's even worse with the locals--everybody knows everybody, and when somebody bad-mouths anybody, everybody hears it. I've been working there for two years, after the last guy quit and promptly left the town. After all the dirty looks I've gotten, I can understand why he did both.\n\nOnly three people in my entire life haven't given me shit about my gas station: my papa, my best friend Ned, and May Higgins.\n\nI knew something was up with May that night for two reasons. First, she went to my gas station. From what she was made out to be, May probably had people who did that kind of errand for her. I just couldn't picture May Higgins driving all alone through the cornfields between our town and the freeway in the dead of night. Second, her nose didn't twitch when she walked into my shop--it was as if the Pepsi smell didn't bug her in the slightest. I recognized her the second she entered, of course, so I asked her in a feeble attempt to make conversation, \"Ey, yer May Higgins, aren't ya? The young cheer star, right?\"\n\nMay turned to me with the biggest smile any customer had ever sent my way. \"I wouldn't say 'star',\" she laughed, \"but I guess that's what people around here call me.\"\n\nDidn't expect her to be humble. Or with such a high-pitched voice. \"Yea.\" I replied, watching her inspect the aisles one-by-one. \"Ey, um... do you need help findin' some gum.. er... chips er somethin'?\"\n\nShe stopped strolling around and gazed at me intently. \"Some beef jerky, if you have it.\" She inquired.\n\n\"Huh. Wouldn't peg ya as the jerky-eatin' type.\" I wondered under my breath.\n\n\"What's that?\" She asked, rubbing her forehead.\n\n\"Nuthin'. Um... I think there's Slim Jims in the fourth aisle down, right behind ya.\"\n\nMay marched over to the aisle and eyed the jerky. A little frown crossed her face. \"Sorry to bug you, mister; I'm wondering if you have any more.\" She asked.\n\nNow I was aching with curiosity. There's no way this one-hundred-twenty-pound lady needed more jerky than what was on the shelf. Maybe she was buying for some friends--for a party, maybe. But what group of jackasses gets together for a party and thinks, \"You know what we really need to get this party started? Some Slim Jims!\" And who in their right mind would send out cheer star May Higgins to pick it up?\n\nI would have continued along with my Red Bull-fueled train of thought if it hadn't been blasted from its tracks by the door chime, which blared as obnoxiously late and loud as ever.\n\nMay didn't even look startled, but I assured her anyway, \"Don't worry, it does that sometimes. Sorry, what were ya askin' about?\"\n\n\"If you don't have any, I understand.\" May continued. \"I know it's an odd request, but I really need as much as possible.\"\n\n\"Naw, it's not odd... I have more in the back.\" I assured her. \"Do ya mind if I ask what it's fer, though?\"\n\nMay looked over at me chillingly. \"Do you really want to know?\"\n\nI stared at her for a while, calculating my response. I couldn't really believe how intimidating this girl suddenly was. There was nothing physically threatening about her--I was a solid foot taller than her, and with a pistol tucked under the checkout counter, there was no way she could take advantage of me. I couldn't even believe my brain was going in this direction; May Higgins wouldn't attack anyone, and certainly wouldn't attack a gas station manager who could smack her down in an instant.\n\nBut then, she didn't need to attack me physically. May Higgins was the town's pride and joy. If she spoke even one sour word about me, everyone would be on my ass, and I figured May knew that just as well as I did. Maybe that's why she asked me if I really wanted to know what she what the jerky was for. It was like a test--a warning. The water going out to sea before a tsunami of social dismemberment.\n\nSo I said nothing. Nothing except for, \"I'll bring out the box from the back,\" \"here's your total, ma'am,\" and \"thank you, ma'am\".\n\nAnd then, May left without another word. As her skinny silhouette disappeared with her jerky into a small red sedan, I realized how much of a jackass I was. She was one of the few people who ever treated me with respect, and all I'd done was make her uncomfortable the entire time she was in my store. What did I care what she did with the Slim Jims? What did it matter how many she'd bought? Idiot, idiot, idiot.\n\nThat's when I decided I would apologize to her. Without another thought, I locked up the store, got into my pickup, and revved off to follow May Higgins's car as it drove into the night.\n\nOne mile went by. Then two. Then five. After about ten miles, I realized that I had left the paved road and was bumping around across sand and rocks. A familiar sense of foreboding crept into my head, but I promptly expelled it; it's my paranoia and overactive imagination that got me into trouble with May in the first place. It wasn't going to screw things up again.\n\nThe lights of May's car grew closer and faded, and I realized she'd stopped in the middle of the desert.\n\nAt this point, whatever was left of my survival instinct slammed on the brakes and shut off the engine. I slid my keys into my front pocket in an effort to stop my nosy mind from edging the truck forward. Something about this whole damned thing was off and I couldn't just keep ignoring it. I was right to be suspicious of May at the station, and I was right to be suspicious now. I strained to adjust my eyes to the darkness, trying desperately to outline the shape of May's car parked in the middle of the road, surrounded on either sides by endless rows of dark stalks.\n\nThey adjusted just in time to catch the driver's side door on May's little car burst open--just in time to see May sprint from the car into the adjacent field, screaming at the top of her lungs. I trembled in my dim truck as the screams increased in both pitch and volume and pierced my eardrums in a solid stream of white noise.\n\nAnd then, nothing.\n\nThe dry stalks, the dull, cracked road, the dark clouds hanging in the sky--nothing stirred.\n\nEverything was completely, dreadfully still.\n\nAnd then, something crept out of the corn field.\n\nSomething tall, skinny, and definitely not May Higgins.\n\nIt looked almost like a stalk of corn itself--gangly, and shambling along on long, tattered limbs. I thought--or, rather, hoped--that my eyes were playing games with me until it violently erected its spine and charged May's car. Upon reaching the car, it snapped its head back and bellowed a metallic, grinding moan before slamming itself against the trunk repeatedly and headfirst. Each time, the car's skeleton creaked and its backside became increasingly dented until finally, with a weak pop, the trunk slowly opened. I could've sworn I saw a grin split the tall thing's face as it readjusted its neck and plunged its dripping jaws into the box of Slim Jims stowed away in May's trunk.\n\nAs the sickening crunch of cardboard, plastic, and meat echoed through the fields, I reached down to my side and fumbled around for my pistol in a desperate effort to comfort myself... only to realize that I'd left it at the store.\n\nStill looking bewilderedly at the floor of the truck, praying for my pistol to magically appear, I wondered how much longer it would be before that thing finished eating. I wondered how much longer it would take for it to notice my truck idling in the road. I didn't want to find out.\n\nThen, my mind turned to May Higgins. The poor girl had probably been feeding whatever this thing was to keep it away from other people. Of course, this only made me more guilty about how I'd treated her; in the end, all she wanted was to help my town and keep this monster at bay. How long had she been shouldering the burden? How many times had she driven here, dashed out of the car, screamed to get its attention, and hid out in the field, hoping it would be satisfied with the meal she'd brought it? Hoping it wouldn't turn on her?\n\nHow many close scrapes had May had with this thing? What if this time, it got to her before it got to the car?\n\nWhy had May's screaming stopped so abruptly?\n\nThe noise from May's car ceased. I looked up from the truck's floor to see a pair of bright, yellow, throbbing eyes pressed against my windshield.\n\nI let out a pathetic yelp and scrambled for my keys, tugging them from my pocket just as that thing let out another sharp, resonating moan. I jammed my keys into the ignition as a violent crack rippled through my truck; the thing had bashed its head into my engine. \"No, no, no, no.\" I stammered as I twisted my key, only to hear the engine splutter and wheeze. \"No, no, no, no, no, NO!\"\n\nAnother crack. Metal and bone crunched together, and just as I jolted my head up, it stared at me again with piercing, greedy eyes. I tried the ignition again--nothing. I screamed in a mix of agony and terror, gripping and wrenching the key. Finally, my truck purred to life, and I whipped my head up again, ready to run over that damned monstrosity... only to find that it wasn't there.\n\nMy heart plunked into my lower intestine. Another crack came from above, and the roof right next to my head crunched like an aluminum can. Without another thought, I peeled my truck backwards, sending the monster hurtling forward and smack onto the road in a cloud of dust. As I swerved my car around, I sped all the way back to my gas station. I looked into the mirror to see that thing's yellow eyes still glinting back in the distance, and I pressed even harder on the gas.\n\nWhen I finally reached the station, I realized that the creature was only about a mile behind me--that it would be upon my store in maybe only a minute. I bashed the door open, sprinted for the checkout counter, snatched up my pistol--\n\nIt was in the doorway now.\n\n--Pointed the gun, clenched my jaw, tightened my grip, and fired all six bullets into its thin body, sending it convulsing and screaming through the plexiglass and into a twitching mess on the cement outside. With about a billion glass shards in my arms and face, and feeling none too eager to fight the creature through my stinging pain, I didn't wait to see if it was still alive. Instead, I ran into the back room of the store, barricaded the door with all the soda and beer boxes I could find, and dialed the police--something I probably should have done a long time ago.\n\nThey arrived ten minutes later and, after another ten, coaxed me out of the back room. The creature--or what was left of it--was no longer outside my shop. In its place was a puddle of blood and a large red stain leading back into the cornfields. When the sheriff finally arrived to check out the bizarre scene, he let out a full-bellied sigh and grunted, \"Son. You didn't... you didn't shoot one of yer customers or nothin' stupid like that, did ya?\"\n\nAfter a long, worn stare, I finally replied, \"It attacked May Higgins, too.\"\n\nThat's all the sheriff needed to hear before a full shitload of squad cars arrived and set out on the biggest search-and-rescue mission this little town ever engineered. I led them down the dirt road to May's car and they sprawled out, covering just about every nook and cranny. It only took them an hour to find May.\n\nShe was found terribly bloodied and dirt-caked, with cracked lips, broken ribs and bones, and a fractured skull... but alive.\n\nThe police sent me to the same hospital as May in the big city--though I recovered within about a day. I asked the staff how bad her injuries were multiple times, and I was met with stony looks. When I finally got a nurse's assistant to crack, she told me \"All I can tell you is that we've seen people hit by cars in better condition than her. It's going to take time, and, honestly, we're not even sure right now if we'll release her at all.\"\n\nOf course, they did eventually release May Higgins--two-hundred and seventy days later. And when they did, her first request was to speak with me. I met her at a bench just across from her school--her face and physique were just as perfect as the day she walked into my station.\n\n\"You're the talk of the town.\" She cheered, beaming. \"The most 'invaluable asset' in finding me, is what I recall the paper said.\"\n\n\"Yeah,\" I acknowledged, \"I guess that's what people around here are sayin'. Some of 'em, at least. There's still a decent chunk that thinks I'm the one who beat you so bad.\"\n\nMay sighed. \"There are always a few nuts--critics who'll do anything to tear you down.\"\n\nA slight breeze lifted the hair from her face, and I could see a faint scar running across her forehead. \"So,\" she asked, \"does anyone know about what did it?\"\n\n\"The police are working on discerning whether it was a 'bear' or 'serial killer'.\" I groaned.\n\n\"So, in other words--\"\n\n\"They have no idea what's out there.\"\n\n\"Yeah.\" May muttered.\n\n\"Ya know, maybe I shot it enough to kill it.\" I proposed.\n\n\"Bullets won't do the job.\" May corrected. \"Even point-blank. Trust me, I've tried.\"\n\n\"And gotten away?\"\n\n\"Well, I'm experienced. I've been dealing with it for a long time. The jerky is enough to distract it since it usually goes for the largest hunks of meat it can find.\"\n\n\"Jeezus, May.\" I gasped.\n\nI looked over at her again. Every few seconds, little shivers ran up and down her body, and I could tell she was still re-living that horrible night.\n\n\"So,\" I tried to change the subject, \"I've decided to move to the big city. I transferred to a Chevron far outta the county. Don't worry... I'm sure some other dumbass'll come along and be more than happy to supply ya with jerky.\"\n\nMay chuckled. \"I've made a bit of a change as well. I'm taking a little break from cheer--removing myself from unnecessary stress until I get my bearings. The college understands, and I've managed to cut a deal so I can keep my scholarship.\"\n\nThe bell of the college's church tolled, and May told me she had to get going. I wanted to leave on as best terms as possible, but my mind was still whirring with questions that had been stewing inside of it for months.\n\n\"May,\" I beckoned, \"why haven't ya told anyone?\"\n\n\"I really have to be going--I'm going to miss my class. Here's my email, if you want to chat.\" She dropped a slip of paper on the bench next to me.\n\n\"May, people are goin' to get hurt. Someone's goin' to wander into those fields at the wrong time and it's gonna maul 'em.\"\n\n\"Please--we can talk later.\"\n\nI looked over at the paper she'd given me.\n\nIt was completely blank.\n\n\"May! May, I want to know! You can't do this on yer own! If I hadn't distracted it, it would've killed ya!\"\n\nMay dashed away. I finally got my senses and stood to follow her, shouting like a jackass. \"May, one day the jerky won't be enough! One day it's gonna need more, May!\"\n\nShe gave me one last guilty nod before rushing into her lecture hall, disappearing from my life just as quickly as she'd entered it.\n\nI was about to whip the door open and follow after her, but the same feeling that made me slam down on my brakes that one fateful night froze me in place. \"May.\" I whispered.\n\n\"May, how did ya get away all those times? How didn't it find ya? How didn't you get hurt all those other times?\"\n\nI already knew the answer.\n\n\"How'd you get that scar on yer forehead, May?\" I chuckled to myself as fear I'd not felt in months trickled back into my veins. \"And why do you always wear bangs?\"", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qk16", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 196, "report_reasons": null, "author": "okonkwos_gun", "saved": false, "mod_reports": [], "name": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65qk16/what_happened_to_may_higgins/", "num_reports": null, "locked": false, "stickied": false, "created": 1492395758.0, "url": "https://www.reddit.com/r/nosleep/comments/65qk16/what_happened_to_may_higgins/", "author_flair_text": null, "quarantine": false, "title": "What happened to May Higgins", "created_utc": 1492366958.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 196}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgdmjwm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t1_dgdlt9v", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's a good point. She could be connected to a string of disappearances no one would ever suspect her of. A major university would potentially provide her with very fertile hunting grounds if that is the case.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a good point. She could be connected to a string of disappearances no one would ever suspect her of. A major university would potentially provide her with very fertile hunting grounds if that is the case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdmjwm", "score_hidden": false, "stickied": false, "created": 1492471879.0, "created_utc": 1492443079.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlt9v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sasstronaut7", "parent_id": "t1_dgcya5g", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I believe she knew about the monster but has been keeping it fed with a little more than just jerkey. That's why she wouldn't let op help after and just ignored him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe she knew about the monster but has been keeping it fed with a little more than just jerkey. That&amp;#39;s why she wouldn&amp;#39;t let op help after and just ignored him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdlt9v", "score_hidden": false, "stickied": false, "created": 1492471011.0, "created_utc": 1492442211.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcya5g", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I do not believe May is the Corn Monster. She most likely formed a symbiotic relationship with it at some point with her providing it with food and companionship and it reciprocating by imparting her with beauty, ability, and intelligence. I suppose the responsibility of maintaining their arcane accord became too much for May as the beast became increasingly demanding leading up to the incident when it injured both of you. Distracting the Corn Monster that night probably saved her. SNAP INTO A SLIM JIM!!! Good luck.", "edited": 1492396190.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not believe May is the Corn Monster. She most likely formed a symbiotic relationship with it at some point with her providing it with food and companionship and it reciprocating by imparting her with beauty, ability, and intelligence. I suppose the responsibility of maintaining their arcane accord became too much for May as the beast became increasingly demanding leading up to the incident when it injured both of you. Distracting the Corn Monster that night probably saved her. SNAP INTO A SLIM JIM!!! Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcya5g", "score_hidden": false, "stickied": false, "created": 1492423764.0, "created_utc": 1492394964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgd2yfo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LittleMissMurderess", "parent_id": "t1_dgd1ry3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I think that's how she got the scar on her forehead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s how she got the scar on her forehead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd2yfo", "score_hidden": false, "stickied": false, "created": 1492430537.0, "created_utc": 1492401737.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dge1pzz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MsAnthr0py", "parent_id": "t1_dgd1ry3", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It also says that the thing was pounding its head on the trunk of the car so maybe that explains the scar on her forehead", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It also says that the thing was pounding its head on the trunk of the car so maybe that explains the scar on her forehead&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dge1pzz", "score_hidden": false, "stickied": false, "created": 1492488914.0, "created_utc": 1492460114.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1ry3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gavin1772", "parent_id": "t1_dgczk8m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Could be, but why would she have taken so long to recover this time? And without even bullet wounds or anything like that? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could be, but why would she have taken so long to recover this time? And without even bullet wounds or anything like that? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd1ry3", "score_hidden": false, "stickied": false, "created": 1492428699.0, "created_utc": 1492399899.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczk8m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RoseTintMahWorld", "parent_id": "t1_dgcuqyo", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Maybe she tried shooting herself before or during the transition? (I really think it's her :/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe she tried shooting herself before or during the transition? (I really think it&amp;#39;s her :/)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgczk8m", "score_hidden": false, "stickied": false, "created": 1492425559.0, "created_utc": 1492396759.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuqyo", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Gavin1772", "parent_id": "t1_dgcf6kc", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "That's what I assumed too, but I imagine if she is, she can't control it, and that would mean she wouldn't have been able to try shooting it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I assumed too, but I imagine if she is, she can&amp;#39;t control it, and that would mean she wouldn&amp;#39;t have been able to try shooting it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcuqyo", "score_hidden": false, "stickied": false, "created": 1492419052.0, "created_utc": 1492390252.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf6kc", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "xdirewolvesx", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Is she the monster?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is she the monster?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcf6kc", "score_hidden": false, "stickied": false, "created": 1492398339.0, "created_utc": 1492369539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgcvu47", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Step47_", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This was so good. Absolutely amazing. Very intense.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was so good. Absolutely amazing. Very intense.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcvu47", "score_hidden": false, "stickied": false, "created": 1492420477.0, "created_utc": 1492391677.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgcyg3x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "beaudean8", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It would make sense why she is so good at everything.  Poor May.  What a heavy burden she has to keep to herself. Maybe you should try to be her friend and help her if she will let you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would make sense why she is so good at everything.  Poor May.  What a heavy burden she has to keep to herself. Maybe you should try to be her friend and help her if she will let you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcyg3x", "score_hidden": false, "stickied": false, "created": 1492423993.0, "created_utc": 1492395193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgcuzz4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RoseTintMahWorld", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Uh oh. Looks like you better transfer to a chevron in her college town and keep an eye on Miss Higgins. Don't forget the trunk full of jerky (or whole sides of beef, that might work a bit better) Don't get caught spying on her though.. Good luck OP!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh oh. Looks like you better transfer to a chevron in her college town and keep an eye on Miss Higgins. Don&amp;#39;t forget the trunk full of jerky (or whole sides of beef, that might work a bit better) Don&amp;#39;t get caught spying on her though.. Good luck OP!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcuzz4", "score_hidden": false, "stickied": false, "created": 1492419387.0, "created_utc": 1492390587.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgd8oqa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-teaqueen-", "parent_id": "t1_dgcznv8", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Yes! Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd8oqa", "score_hidden": false, "stickied": false, "created": 1492442124.0, "created_utc": 1492413324.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcznv8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RoseTintMahWorld", "parent_id": "t1_dgcyy6k", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It seems like some people think May is the monster (the final conversation and thoughts from op kinda made me think that) and some people think she is just helping it/protecting people from it. Was that your question?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems like some people think May is the monster (the final conversation and thoughts from op kinda made me think that) and some people think she is just helping it/protecting people from it. Was that your question?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcznv8", "score_hidden": false, "stickied": false, "created": 1492425700.0, "created_utc": 1492396900.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyy6k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-teaqueen-", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Someone please explain ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Someone please explain &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcyy6k", "score_hidden": false, "stickied": false, "created": 1492424692.0, "created_utc": 1492395892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgd1ww4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deadlywaffle139", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I thought you were talking about the May-Hegglin Anomaly in WBC... don's ask me why... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought you were talking about the May-Hegglin Anomaly in WBC... don&amp;#39;s ask me why... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd1ww4", "score_hidden": false, "stickied": false, "created": 1492428907.0, "created_utc": 1492400107.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgd7j33", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mmhmmyeahright", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ooooh this is Jeepers Creepers like, (one of my all time favorite makes-no-sense-creepy-monster movie), with a hopefully exciting twist.\nStay safe OP, your character needs to bring us more of this story :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooooh this is Jeepers Creepers like, (one of my all time favorite makes-no-sense-creepy-monster movie), with a hopefully exciting twist.\nStay safe OP, your character needs to bring us more of this story :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd7j33", "score_hidden": false, "stickied": false, "created": 1492439427.0, "created_utc": 1492410627.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65qk16", "likes": null, "replies": "", "user_reports": [], "id": "dgckzqz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Benivav", "parent_id": "t3_65qk16", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Jeez that is seriously creepy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jeez that is seriously creepy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgckzqz", "score_hidden": false, "stickied": false, "created": 1492405911.0, "created_utc": 1492377111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]