[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recalling all this now is something I&amp;#39;ve wagered to avoid. It&amp;#39;s sad how my brain was manipulated like clay. Artisanly she tricked me. The person whom I looked up to and admired at the time turned out to be a horrible person. It&amp;#39;s awful not only in it&amp;#39;s calculated and sinful degeneracy, but also in its awful self-righteous indulgence. I can only say that &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a girl. Well, I am now at least. I was a girl in my mind, but my privates and the whole standing while I peed thing said otherwise. It&amp;#39;s a thing that people usually understand now, but back then the sensation and the feeling wasn&amp;#39;t nearly as accepted. It wouldn&amp;#39;t be a bad thing per say, but I&amp;#39;m not even sure if I even would have went through the process if it hadn&amp;#39;t been because of my childhood. &lt;/p&gt;\n\n&lt;p&gt;Oh my gosh guys, I&amp;#39;m so sorry. The stuff I&amp;#39;m about to tell you is pretty gross. It&amp;#39;s a long as heck story too, but maybe I ought to have it split up.&lt;/p&gt;\n\n&lt;p&gt;I think I met mommy around when I was thirteen. I was walking over to the drug store to pick up some water, because it was the summer and I think people needed to drink it? But yeah. While I was in the drugstore I saw this really rich looking lady sitting on the bench at the entrance. I mean she was stereotypical of an alley cat. A mob headed gal thick in her purse with Benj&amp;#39;s. She looked like she was a needle in a haystack. Looking just past her through the store window I saw scruffy looking businessmen and workfolk trudging along the street, wearing either loose cloths that deterred the heat or fancy clothes you&amp;#39;d drop a hundred on. And sitting here was this girl whose skin was so perfect and beautiful and young that the light that shown off the pavement almost made her look like an angel.&lt;/p&gt;\n\n&lt;p&gt;She wore a wide brimmed hat and all white, her attire looking lacy and wrought with the utmost top of the line in fashion sense. Even though I was young, I couldn&amp;#39;t help but be drawn to her beauty. I stared at her, and she eyed me dully. It was almost like being face to face with a stray cat who was thinking subconsciously as to how it was going to trick you. I blushed. She smiled lightly. From her smiling lips she brought up a small fag and took a draw of it. The smoke came out of her lips the same color of the rest of her. Chalky white.&lt;/p&gt;\n\n&lt;p&gt;Her voice was smooth and delicate. Raising one brow, she held up her palm and wiggled a finger towards her: The universal sign of &amp;quot;come over here.&amp;quot; You&amp;#39;re always told to never talk to strangers, but dang was the stranger intoxicatingly alluring. I looked at her with wide unsure eyes. In response she cocked her head like a confused puppy. Innocence befell her features. She was pure. Surelt there would be no threat with her. My young, barely deepening voice came out shaky.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Y-Yes&amp;#39;m? Ma&amp;#39;am...?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Evolving towards a perky demeanor she feigned offense and cluelessness.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ma&amp;#39;am? How terribly presumptious. No man has me yet. Think of calling women miss first, lest you wish to offend them in the off chance.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I blinked back at the apt advice, my cheeks starting to sear. I couldn&amp;#39;t formulate a good response. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Say, you&amp;#39;re quite a cutie. Have a little girlfriend?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My body was pounding. Her voice was delicate and gaited, so much so that by itself it could be dangerous. She was teasing me, but I couldn&amp;#39;t let this interaction be so one sided. In my youthful stubborness, I retorted.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No. But, uh, if you talk to kids so much you may be the type to uh...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I couldn&amp;#39;t talk. I&amp;#39;ve only heard this expression when people teased about marrying someone who was younger by a couple years.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Rob the cradle?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She scoffed and guffawed, nearly inhaling the smoke she was excreting from her plump looking glossy lips.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;W-what? You rascal you, you really are adorable. Hmph, well I&amp;#39;ll ask it outright then.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Reaching beside her she dug through her purse, a woman&amp;#39;s treasure trove. And a small white rectangle was produced. When I took it she gave a happy smile, I looked it over. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t give these to just anyone. Come to that address this Friday at nine. Tell your folks you&amp;#39;re interviewing for an apprenticeship. Tell them you&amp;#39;ll be looking for a job as a model. Surely it pays prettier then most jobs around here. It&amp;#39;s honest, and reputable. They&amp;#39;ll have heard of me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The card said &amp;quot;Miss Arachne&amp;#39;s Tailoring and Design.&amp;quot; Stylized and such. I don&amp;#39;t care about releasing the name. At this point it&amp;#39;s just another detail. It&amp;#39;s a pretty cool and silly name, I&amp;#39;ll admit that much. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Tell me your address too, will you dear? I may need to mail some letters from time to time. This is a big name company. We should have all of the plates filled before we eat, should we not?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I thought she was British. Or just rich. The way she talked was proper and refined. I had more or less little clue what she was referring to, but I nodded my head along in  not wanting to seem ignorant. &lt;/p&gt;\n\n&lt;p&gt;I remember rushing inside after the girl got up and decided to leave the drugstore with not much but another &amp;quot;You&amp;#39;re cute!&amp;quot; smile. My heart throbbed. Though she was teasing, this was the most recognition I had gotten from a lady ever. And with puberty setting it&amp;#39;s course I couldn&amp;#39;t help but think about her actually liking me. &lt;/p&gt;\n\n&lt;p&gt;My parents were confused, but also happy. They said to be careful walking alone and that they&amp;#39;d give me money for a quick call if I really needed to. I was looking forward to that day to arrive. And arrive it did.&lt;/p&gt;\n\n&lt;p&gt;I remember grabbing my finest hand-me-downs and shoes from my closet and having my father tie my tie. I looked goofy. I was thin and freshly showered. The day before I went to the barbers. A low cut that did out most of the raggedy length of my brown hair. I felt confident. In my mind all I wanted for all this prep was an off handed compliment or some teasing. &lt;/p&gt;\n\n&lt;p&gt;I trudged my way down to the poor side of town; businesses saved costs being down there. It had just rained. The moonlight glowered off the slick road and sidewalk. As night had fell the entire city seemed to sleep. You saw an odd potato skin eater in between the bricks and cobbles, and I remember gleeing subconsciously at being better off, especially with the new prospect of working at such a prestigious place. &lt;/p&gt;\n\n&lt;p&gt;As I reared a street corner I thumbed at the small square in my hand, rereading the paper for the umpteenth time. &amp;#39;Yes. It must be down here.&amp;#39; A few warehouses lined the alleyways. Doors that seemed to spell entrance. But beyond that...&lt;/p&gt;\n\n&lt;p&gt;Miss Arachne.&lt;/p&gt;\n\n&lt;p&gt;It was undoubtedly her. I had tried to reimagine that figure. But this fit the bill perfectly. I called out happily towards her. She called out through the silent alley.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey there cutie! Stand still please! You were a bit late by the way, but I&amp;#39;ll forgive you!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I felt stamping behind me, sloshing the alley way. It rapidly grew close until I tried to turn out of instinct. Something I didn&amp;#39;t expect happened. A masculine arm wrapped around my waist. I tried to jerk back my body and struggle, but just as quick as the first part had happened, the second part followed suit without much hesitation. A rag dug over my mouth and nose and dug into my teeth. I swear he could&amp;#39;ve broke something if he pressed any harder. My breath ran ragged, and I tasted something that subsequently burnt my nostrils. My eyes started to blink shut, and I saw Miss Arachne standing over in the same spot, looking amused as my consciousness slipped from my grasp.&lt;/p&gt;\n\n&lt;p&gt;I woke up being dragged through a hallway. Lined with a grand clock and many expensive and fashionable paintings and busts. The arm that was there as I passed out still wrapped around me, albeit it much lighter. I realized quickly in my consciousness that I was being held bridal style by the man. I saw a glimpse of him. He was a burly looking older man, maybe in his forties. He looked tanned, probably Italian. Scratchy thick beard, and stocky muscles lined his body. Realizing that he was looking surely forward, I closed my eyes once again. I was conscious, but I was worried what he&amp;#39;d do if he saw I was awake again. I felt my body being passed through a door frame into a room that was much cooler than the hallway. I was let down gently onto what had to have been one of the plushest things I had felt in my life. The height of comfort. It was welcome, and I murmured in contention, as I was no longer in the mans arms and was laid down on something quite comfortable. My head throbbed helplessly, but I could doze off any second if I chose to. My body was fighting an internal war, one that drew me drowsy inanely quick. &lt;/p&gt;\n\n&lt;p&gt;I felt my head being picked up gently and moved from something soft and hard to something soft and squishy and warm. It felt heavenly. I opened my eyes for a flicker, to see that my head was being rested on Lady Arachne&amp;#39;s lap. She must have saw too, because I could have sworn for the instant my eyes flew open I saw hers make contact. She ran her hands through my hair and &amp;quot;tsk&amp;#39;d&amp;quot; in a snide but gentle manner.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re not that good of an actor, cutie pie. Though I wish you didn&amp;#39;t cut your hair. You looked so cute with it all messy. I would have done some great posh styles to root for that nappy little head of yours.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My eyes flew open once again. The discomfort of before rang through my head. This lady was dangerous, my young mind knew this. Why did she do this? I darted up, and squeaked as my chest was caught by her arm, forcing my head back down on her squishy lap. I yelled and struggled as I tried to force with all of my might out of her grip. I saw her threw my twisting head and saw that she looked painfully calm, and amazingly delighted by my struggles.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;W-What are you doing Miss Arachne?! L-Let me out! My parents will call the cops on you--!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She held a finger to my lips and shushed me, the gesture was so gentle that it brought my voice down almost instantly. I snarled my blunt teeth at her, some were crooked from poor dental care. Giggling gently, she shook her head and then smiled with a gross look of pleasure.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please, call me &amp;quot;Mommy&amp;quot; now. Miss Arachne is what my employee&amp;#39;s call me, silly boy! Now repeat after me, mo-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I knew what she was saying was wrong. What was she doing? This lady was a loony! I have a mother. This made me frustrated. Tears welled up in my eyes and I quickly opened my mouth and bit down on her finger as hard as I could. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;YOWCH! Fuck!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She screeched as she felt my teeth dig mercilessly and childishly down into her digit. I felt blood well around my front teeth, which caused me to ease up quickly. Even though I did that, realizing that she was upset now, and scared of what that could mean, I couldn&amp;#39;t think as a palm smacked the side of my cheek with brutal force. She brought up her hand to her mouth and sucked on the bleeding digit.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why would you do that?! Geeze...! I didn&amp;#39;t want to do this, but you&amp;#39;ve been really squirmy. You better not be this stubborn, or I&amp;#39;ll just kill you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She said that so nonchalantly it was almost like it was the natural flow of the sentence. Her voice was also delicate. I had broke her facade and calm demeanor for a second, which made me feel a bit triumphant, but I knew that how quick she faded back to her gentle and caring tone meant that this lady was too strong for me to fight in any way. I felt like giving up. Tears welled my eyes as I hoped that she wouldn&amp;#39;t do anything horrible to me. I sniffled. &lt;/p&gt;\n\n&lt;p&gt;My eyes were so filled with tears I could barely see anything I saw sobbed. Arachne started to shush me with a matronly coo, trying to calm me as if I was a baby instead of a teenage boy. Her palm pressed into my cheek gently, tilting my head over to one side on her lap. I gladly accepted it&amp;#39;s warmth, not really focusing on whose warmth it was. After all, my real mother would have never done something so intimate to me, and it felt nice and comforting as my brain tried to figure out an answer. But before I could do that I felt a prick in the side of my neck. I opened my eyes quickly, flicking away the tears I reared my neck slightly, the palm that held my face forced me down once more, roughly this time. I felt metal slide into my neck, which made me want to gag. I tried to struggle, but soon I felt myself go familiar drowsy, and familiar numb as I passed out.&lt;/p&gt;\n\n&lt;p&gt;I woke up covered in blankets. They were nice and as soft as the couch. My face felt like it had just been throttled. My entire head and neck was sore and throbbed with my heartbeat. Sweat dripped down my head as if I was having a fever, which for all I knew, I might as well had. Arachne was sitting right next to me, across from a table.&lt;/p&gt;\n\n&lt;p&gt;Getting a better look at the room, it seemed to be some sort of study or something. It was lined with bookshelves and clocks, but open and had a fire place and sitting area. &lt;/p&gt;\n\n&lt;p&gt;It was nine again, is what the clock told me. I had been asleep for probably at least twenty hours. I wanted to sit up, but my neck was stiff. I did so slowly. At my bedside (or sofaside) was a plate of crackers and a bowl of hot soup. At least they were trying to accommodate for me. As I sat up I felt my -- Wait.&lt;/p&gt;\n\n&lt;p&gt;I looked down and saw I was wearing a blouse. And my bottom half was covered in a skirt. And I felt presences behind me --&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wow, he&amp;#39;s cute, huh?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You know how to pick &amp;#39;em, mommy!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;D&amp;#39;aw, is he, y&amp;#39;know --&amp;quot; &amp;quot;Shut up!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I wanna see him! I wanna see him!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I bolted -- nay, fell out of the sofa. I quickly stood up, even though it hurt. My chest heaved as I saw a set of -- multiple girls, staring at me with huge sadistic looking grins on their faces. They were all of different shapes and sizes. They were all pale like Arachne, is what I first noticed. But besides that, they all looked like girls just older than me, or around my age. Fifteen? Sixteen? Around that area, probably. Most of them were smiling, others were muttering. Others giggling. One called out their name.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey I&amp;#39;m Avaline! Your name is Christian, right?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Or maybe Cristina?&amp;quot; I heard one of them scoff out.&lt;/p&gt;\n\n&lt;p&gt;Miss Arachne shushed them all and I turned my head over to her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Don&amp;#39;t harass your sister too hard. She isn&amp;#39;t used to being so pretty.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I look down at my attire once again, the blouse, the skirt. I saw all the girls eyes on me. They wore amazingly stylish clothes and expensive looking make-up. It made them all look like total lookers. And I felt -- Wait, I was wearing womens underwear too? That means someone --&lt;/p&gt;\n\n&lt;p&gt;I quickly covered up my crotch, even though it was already covered up, closing my thighs together defensively.&lt;/p&gt;\n\n&lt;p&gt;A chorus of giggles greeted me in response, as the a few of the girls flooded from behind the sofa and started to... Harass me.&lt;/p&gt;\n\n&lt;p&gt;They hugged and patted my head, a couple of the ones that seemed creepily and disgustingly overjoyed at the thought of their new sister. It made me cry being degraded like this.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I-I&amp;#39;m not a girl...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I muttered as they patted and prodded me. I felt a pair of lips slide onto my neck for just a second. Soon I turned me head to see a black haired girl with blue cat-like eyes glowering at me dangerously with sadistic glee. Her face was porcelain, yet expressive enough. Like her cheeks had just thawed after being outside in the winter too long. I then saw her being smacked by one of the girls hugging me, to which she giggled weakly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Don&amp;#39;t freaking kiss her, you weirdo...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sorry, she&amp;#39;s too cute...!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s your sister.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sorry! I forgot!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Jezebel, will you ever learn?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My head throbbed painfully. I couldn&amp;#39;t make process of all this. My eyes leaked helplessly. This is when Arachne cleared he throat and waved her arm up in the air, shaking her head in disapproval.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That&amp;#39;s enough. Can&amp;#39;t you see the poor girl is overwhelmed? She&amp;#39;s... A bit under the weather, and this is quite a little to process. Her head must be killing. You all understand why, right?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;They all exchanged wide-eyed looks of comprehension.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So wait!? This is a -permanent- sister?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Whoa!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So cool!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yay!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m not sharing my room...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Again Arachne waited for them to rile down, the girls all seeming to exchange thoughts of happiness which was hard for me to understand. I remember slinking back down over to the sofa and laying back down quickly while I wasn&amp;#39;t being harassed so heavily. I swear they all conversed together about me for at least five minutes, talking back and forth about intricacies of myself that I had never once wagered to even think about for a second.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He has cute fingers, huh?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;-She- dumbass!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Right, right!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I wonder why his teeth are so messed up.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hopefully she doesn&amp;#39;t cry all the time...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;After a while it seemed like Arachne had enough of the talking, and went up to one of the girls. She was blonde, her body seemed well developed, though she was short and baby faced. Slim and athletic looking, she conversed with Arachne quietly and happily, before eyeing over to me for a couple moments and then nodding. Suddenly, Arachne clapped her hands together, shushing the room instantly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Alright everyone! We&amp;#39;re having Kate&amp;#39;s boyfriend over. You all behave. Remember that Christian here isn&amp;#39;t initiated in our family traditions yet. Try to help him out.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A chorus of feminine voices that sounded quite eager all responded in unison.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes mother!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A couple of the girls slipped from the rooms like snake, all conversing merrily as I heard them tramp through the hallway and down a set of stairs I wasn&amp;#39;t aware of at the time. It wasn&amp;#39;t thirteen seconds later until they came all holding something. At first I wasn&amp;#39;t sure what it was, but I saw as I painstakingly sat up. Bound with rope was a man that seemed physically quite too strong to have been subdued by three girls alone, yet, covered with a mass of strong rope was an older teenager who seemed to be gagged and had been crying. There was a crack in his forehead, from what I could make out at the time. Blood trickling down his skull.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Be careful when rounding corners, sheesh!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I just wanted to see what his blood looked like...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Fair enough.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;On the table in front of me they set the boy down. He looked at me and saw the innocence, or the confusion in my eyes. He pleaded through the gag, but I couldn&amp;#39;t make out anything. He squirmed as much as he could through the gag. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was wondering when we&amp;#39;d finally bag the jock. You couldn&amp;#39;t have actually had enjoyed spending time with him, right Kate?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Nah.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Suddenly Kate set forward and brandished what looked to be a kitchen butcher knife. Almost as if to confirm her plain statement. I saw a look of excitement dance like fire in the girls eyes as she held the blade, rounding towards the table and stooping low. She held the blade point towards his stomach. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This guy is disgusting. I told him I was sixteen and he still wanted to date me. He&amp;#39;s the owner of some gang. I figure if he goes missing they&amp;#39;ll assume all that. It was calculated to the tiniest degree. I brought him over so he could finally &amp;quot;make a woman out of me&amp;quot;, isn&amp;#39;t that right, Connor?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The man squirmed in his table, and as he did so the knife that was pressing against his stomach knicked some of the taut flesh of well toned body and ripped his black shirt. I could now see that just over where he was being tied with rope there was a well uniformed t-shirt and slacks. One that spelled he was part of a particular gang I had heard of around the city. Most of the pity for the man seemed to already be lost, as was told as I started to blink into his eyes coldly. I knew you shouldn&amp;#39;t be with a girl that young, it was illegal, and my dad always read stuff like that in the newspaper and coughed at it, revulsing at the crimes committed by perverts like him.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I want his stomach first.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Small or large intestine?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ew, you two are gross, there may still be poop in those!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;W-Well, your right...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I call his heart---&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;WHOA WHOA KATIE SHOULD GET THAT LET HER-- She stole his heart to begin with~&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;They all cooed sadistic quips and call outs of random body parts. Dibs here. Dibs there. It was almost like they were out getting candy at Halloween. It made my stomach churn. The throbbing in my neck started to level out, it felt like. Though my headache still was there. I felt the side of my neck where the needle had entered, now realizing as I felt turned my neck that there was two bandages. One on either side of my neck. &amp;#39;Where did I get the second one?&amp;#39; I worried subconsciously as my brain tried to trick me into distracting myself from the revolting sight about to unfold in front of me. &lt;/p&gt;\n\n&lt;p&gt;The girls all started to surround the boy, getting on their knees. Luckily their backs obscured most of it for me. I heard screams that could pierce the gag and banging of the table as he seemed to rock in agony. Sloppy slurping and sucking noises accompanied the screams quickly. Some times I&amp;#39;d hear a few satisfied grumbles escape the girls throats. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Mmm... Try this...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ok.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I saw blood start to trickle down from the table and onto the carpet. To which I heard Miss Arachne curse about &amp;#39;I should have brought the cloth...!&amp;#39; That&amp;#39;s when I sniffed, probably from whatever fever I had procured. And I smelled it. Something smelled, delectfully &lt;em&gt;sweet&lt;/em&gt;. I found myself drooling. My eyes dilated. I stared at my group of gnawing sisters. My stomach growled. &lt;/p&gt;\n\n&lt;p&gt;At to which Arachne called out over the sea of girls, &amp;quot;Someone give something for your new sister to try.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;They all turned their heads. Blood all coated the front of their faces, their mouths dripping with cartridge. Chunks of meat were caught in the stream of blood, brought by their sloppy eating. Most of their mouths hung open, all of their teeth looking pointy and almost canid. Suddenly, one of the girls stood up. At first I didn&amp;#39;t recognize her. But it was Jezebel. She was chewing something happily. Her mouth was full of food but she sauntered with a small grin on her mouth over to my laying self on the coach. Reaching forward, she forced open my mouth with little trouble, clenching on my jaw. She dove forward, and like a bird feeding it&amp;#39;s baby, she spit out her chewed food into my mouth. My teeth were dull, and the meat was chewy, but it tasted so good. And made the throbbing of my head stop as the juices filled my gullet. I ate it down after about thirty seconds of chewing without much question. Jezebel smiled at me and kissed my forehead.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Welcome to the family sis.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Recalling all this now is something I've wagered to avoid. It's sad how my brain was manipulated like clay. Artisanly she tricked me. The person whom I looked up to and admired at the time turned out to be a horrible person. It's awful not only in it's calculated and sinful degeneracy, but also in its awful self-righteous indulgence. I can only say that \n\nI'm a girl. Well, I am now at least. I was a girl in my mind, but my privates and the whole standing while I peed thing said otherwise. It's a thing that people usually understand now, but back then the sensation and the feeling wasn't nearly as accepted. It wouldn't be a bad thing per say, but I'm not even sure if I even would have went through the process if it hadn't been because of my childhood. \n\nOh my gosh guys, I'm so sorry. The stuff I'm about to tell you is pretty gross. It's a long as heck story too, but maybe I ought to have it split up.\n\nI think I met mommy around when I was thirteen. I was walking over to the drug store to pick up some water, because it was the summer and I think people needed to drink it? But yeah. While I was in the drugstore I saw this really rich looking lady sitting on the bench at the entrance. I mean she was stereotypical of an alley cat. A mob headed gal thick in her purse with Benj's. She looked like she was a needle in a haystack. Looking just past her through the store window I saw scruffy looking businessmen and workfolk trudging along the street, wearing either loose cloths that deterred the heat or fancy clothes you'd drop a hundred on. And sitting here was this girl whose skin was so perfect and beautiful and young that the light that shown off the pavement almost made her look like an angel.\n\nShe wore a wide brimmed hat and all white, her attire looking lacy and wrought with the utmost top of the line in fashion sense. Even though I was young, I couldn't help but be drawn to her beauty. I stared at her, and she eyed me dully. It was almost like being face to face with a stray cat who was thinking subconsciously as to how it was going to trick you. I blushed. She smiled lightly. From her smiling lips she brought up a small fag and took a draw of it. The smoke came out of her lips the same color of the rest of her. Chalky white.\n\nHer voice was smooth and delicate. Raising one brow, she held up her palm and wiggled a finger towards her: The universal sign of \"come over here.\" You're always told to never talk to strangers, but dang was the stranger intoxicatingly alluring. I looked at her with wide unsure eyes. In response she cocked her head like a confused puppy. Innocence befell her features. She was pure. Surelt there would be no threat with her. My young, barely deepening voice came out shaky.\n\n\"Y-Yes'm? Ma'am...?\"\n\nEvolving towards a perky demeanor she feigned offense and cluelessness.\n\n\"Ma'am? How terribly presumptious. No man has me yet. Think of calling women miss first, lest you wish to offend them in the off chance.\"\n\nI blinked back at the apt advice, my cheeks starting to sear. I couldn't formulate a good response. \n\n\"Say, you're quite a cutie. Have a little girlfriend?\"\n\nMy body was pounding. Her voice was delicate and gaited, so much so that by itself it could be dangerous. She was teasing me, but I couldn't let this interaction be so one sided. In my youthful stubborness, I retorted.\n\n\"No. But, uh, if you talk to kids so much you may be the type to uh...\"\n\nI couldn't talk. I've only heard this expression when people teased about marrying someone who was younger by a couple years.\n\n\"Rob the cradle?\"\n\nShe scoffed and guffawed, nearly inhaling the smoke she was excreting from her plump looking glossy lips.\n\n\"W-what? You rascal you, you really are adorable. Hmph, well I'll ask it outright then.\"\n\nReaching beside her she dug through her purse, a woman's treasure trove. And a small white rectangle was produced. When I took it she gave a happy smile, I looked it over. \n\n\"I don't give these to just anyone. Come to that address this Friday at nine. Tell your folks you're interviewing for an apprenticeship. Tell them you'll be looking for a job as a model. Surely it pays prettier then most jobs around here. It's honest, and reputable. They'll have heard of me.\"\n\nThe card said \"Miss Arachne's Tailoring and Design.\" Stylized and such. I don't care about releasing the name. At this point it's just another detail. It's a pretty cool and silly name, I'll admit that much. \n\n\"Tell me your address too, will you dear? I may need to mail some letters from time to time. This is a big name company. We should have all of the plates filled before we eat, should we not?\"\n\nI thought she was British. Or just rich. The way she talked was proper and refined. I had more or less little clue what she was referring to, but I nodded my head along in  not wanting to seem ignorant. \n\nI remember rushing inside after the girl got up and decided to leave the drugstore with not much but another \"You're cute!\" smile. My heart throbbed. Though she was teasing, this was the most recognition I had gotten from a lady ever. And with puberty setting it's course I couldn't help but think about her actually liking me. \n\nMy parents were confused, but also happy. They said to be careful walking alone and that they'd give me money for a quick call if I really needed to. I was looking forward to that day to arrive. And arrive it did.\n\nI remember grabbing my finest hand-me-downs and shoes from my closet and having my father tie my tie. I looked goofy. I was thin and freshly showered. The day before I went to the barbers. A low cut that did out most of the raggedy length of my brown hair. I felt confident. In my mind all I wanted for all this prep was an off handed compliment or some teasing. \n\nI trudged my way down to the poor side of town; businesses saved costs being down there. It had just rained. The moonlight glowered off the slick road and sidewalk. As night had fell the entire city seemed to sleep. You saw an odd potato skin eater in between the bricks and cobbles, and I remember gleeing subconsciously at being better off, especially with the new prospect of working at such a prestigious place. \n\nAs I reared a street corner I thumbed at the small square in my hand, rereading the paper for the umpteenth time. 'Yes. It must be down here.' A few warehouses lined the alleyways. Doors that seemed to spell entrance. But beyond that...\n\nMiss Arachne.\n\nIt was undoubtedly her. I had tried to reimagine that figure. But this fit the bill perfectly. I called out happily towards her. She called out through the silent alley.\n\n\"Hey there cutie! Stand still please! You were a bit late by the way, but I'll forgive you!\"\n\nI felt stamping behind me, sloshing the alley way. It rapidly grew close until I tried to turn out of instinct. Something I didn't expect happened. A masculine arm wrapped around my waist. I tried to jerk back my body and struggle, but just as quick as the first part had happened, the second part followed suit without much hesitation. A rag dug over my mouth and nose and dug into my teeth. I swear he could've broke something if he pressed any harder. My breath ran ragged, and I tasted something that subsequently burnt my nostrils. My eyes started to blink shut, and I saw Miss Arachne standing over in the same spot, looking amused as my consciousness slipped from my grasp.\n\nI woke up being dragged through a hallway. Lined with a grand clock and many expensive and fashionable paintings and busts. The arm that was there as I passed out still wrapped around me, albeit it much lighter. I realized quickly in my consciousness that I was being held bridal style by the man. I saw a glimpse of him. He was a burly looking older man, maybe in his forties. He looked tanned, probably Italian. Scratchy thick beard, and stocky muscles lined his body. Realizing that he was looking surely forward, I closed my eyes once again. I was conscious, but I was worried what he'd do if he saw I was awake again. I felt my body being passed through a door frame into a room that was much cooler than the hallway. I was let down gently onto what had to have been one of the plushest things I had felt in my life. The height of comfort. It was welcome, and I murmured in contention, as I was no longer in the mans arms and was laid down on something quite comfortable. My head throbbed helplessly, but I could doze off any second if I chose to. My body was fighting an internal war, one that drew me drowsy inanely quick. \n\nI felt my head being picked up gently and moved from something soft and hard to something soft and squishy and warm. It felt heavenly. I opened my eyes for a flicker, to see that my head was being rested on Lady Arachne's lap. She must have saw too, because I could have sworn for the instant my eyes flew open I saw hers make contact. She ran her hands through my hair and \"tsk'd\" in a snide but gentle manner.\n\n\"You're not that good of an actor, cutie pie. Though I wish you didn't cut your hair. You looked so cute with it all messy. I would have done some great posh styles to root for that nappy little head of yours.\"\n\nMy eyes flew open once again. The discomfort of before rang through my head. This lady was dangerous, my young mind knew this. Why did she do this? I darted up, and squeaked as my chest was caught by her arm, forcing my head back down on her squishy lap. I yelled and struggled as I tried to force with all of my might out of her grip. I saw her threw my twisting head and saw that she looked painfully calm, and amazingly delighted by my struggles.\n\n\"W-What are you doing Miss Arachne?! L-Let me out! My parents will call the cops on you--!\"\n\nShe held a finger to my lips and shushed me, the gesture was so gentle that it brought my voice down almost instantly. I snarled my blunt teeth at her, some were crooked from poor dental care. Giggling gently, she shook her head and then smiled with a gross look of pleasure.\n\n\"Please, call me \"Mommy\" now. Miss Arachne is what my employee's call me, silly boy! Now repeat after me, mo-\"\n\nI knew what she was saying was wrong. What was she doing? This lady was a loony! I have a mother. This made me frustrated. Tears welled up in my eyes and I quickly opened my mouth and bit down on her finger as hard as I could. \n\n\"YOWCH! Fuck!\"\n\nShe screeched as she felt my teeth dig mercilessly and childishly down into her digit. I felt blood well around my front teeth, which caused me to ease up quickly. Even though I did that, realizing that she was upset now, and scared of what that could mean, I couldn't think as a palm smacked the side of my cheek with brutal force. She brought up her hand to her mouth and sucked on the bleeding digit.\n\n\"Why would you do that?! Geeze...! I didn't want to do this, but you've been really squirmy. You better not be this stubborn, or I'll just kill you.\"\n\nShe said that so nonchalantly it was almost like it was the natural flow of the sentence. Her voice was also delicate. I had broke her facade and calm demeanor for a second, which made me feel a bit triumphant, but I knew that how quick she faded back to her gentle and caring tone meant that this lady was too strong for me to fight in any way. I felt like giving up. Tears welled my eyes as I hoped that she wouldn't do anything horrible to me. I sniffled. \n\nMy eyes were so filled with tears I could barely see anything I saw sobbed. Arachne started to shush me with a matronly coo, trying to calm me as if I was a baby instead of a teenage boy. Her palm pressed into my cheek gently, tilting my head over to one side on her lap. I gladly accepted it's warmth, not really focusing on whose warmth it was. After all, my real mother would have never done something so intimate to me, and it felt nice and comforting as my brain tried to figure out an answer. But before I could do that I felt a prick in the side of my neck. I opened my eyes quickly, flicking away the tears I reared my neck slightly, the palm that held my face forced me down once more, roughly this time. I felt metal slide into my neck, which made me want to gag. I tried to struggle, but soon I felt myself go familiar drowsy, and familiar numb as I passed out.\n\nI woke up covered in blankets. They were nice and as soft as the couch. My face felt like it had just been throttled. My entire head and neck was sore and throbbed with my heartbeat. Sweat dripped down my head as if I was having a fever, which for all I knew, I might as well had. Arachne was sitting right next to me, across from a table.\n\nGetting a better look at the room, it seemed to be some sort of study or something. It was lined with bookshelves and clocks, but open and had a fire place and sitting area. \n\nIt was nine again, is what the clock told me. I had been asleep for probably at least twenty hours. I wanted to sit up, but my neck was stiff. I did so slowly. At my bedside (or sofaside) was a plate of crackers and a bowl of hot soup. At least they were trying to accommodate for me. As I sat up I felt my -- Wait.\n\nI looked down and saw I was wearing a blouse. And my bottom half was covered in a skirt. And I felt presences behind me --\n\n\"Wow, he's cute, huh?\"\n\n\"You know how to pick 'em, mommy!\"\n\n\"D'aw, is he, y'know --\" \"Shut up!\"\n\n\"I wanna see him! I wanna see him!\" \n\nI bolted -- nay, fell out of the sofa. I quickly stood up, even though it hurt. My chest heaved as I saw a set of -- multiple girls, staring at me with huge sadistic looking grins on their faces. They were all of different shapes and sizes. They were all pale like Arachne, is what I first noticed. But besides that, they all looked like girls just older than me, or around my age. Fifteen? Sixteen? Around that area, probably. Most of them were smiling, others were muttering. Others giggling. One called out their name.\n\n\"Hey I'm Avaline! Your name is Christian, right?\"\n\n\"Or maybe Cristina?\" I heard one of them scoff out.\n\nMiss Arachne shushed them all and I turned my head over to her.\n\n\"Don't harass your sister too hard. She isn't used to being so pretty.\"\n\nI look down at my attire once again, the blouse, the skirt. I saw all the girls eyes on me. They wore amazingly stylish clothes and expensive looking make-up. It made them all look like total lookers. And I felt -- Wait, I was wearing womens underwear too? That means someone --\n\nI quickly covered up my crotch, even though it was already covered up, closing my thighs together defensively.\n\nA chorus of giggles greeted me in response, as the a few of the girls flooded from behind the sofa and started to... Harass me.\n\nThey hugged and patted my head, a couple of the ones that seemed creepily and disgustingly overjoyed at the thought of their new sister. It made me cry being degraded like this.\n\n\"I-I'm not a girl...\"\n\nI muttered as they patted and prodded me. I felt a pair of lips slide onto my neck for just a second. Soon I turned me head to see a black haired girl with blue cat-like eyes glowering at me dangerously with sadistic glee. Her face was porcelain, yet expressive enough. Like her cheeks had just thawed after being outside in the winter too long. I then saw her being smacked by one of the girls hugging me, to which she giggled weakly.\n\n\"Don't freaking kiss her, you weirdo...\"\n\n\"Sorry, she's too cute...!\"\n\n\"It's your sister.\"\n\n\"Sorry! I forgot!\"\n\n\"Jezebel, will you ever learn?\"\n\nMy head throbbed painfully. I couldn't make process of all this. My eyes leaked helplessly. This is when Arachne cleared he throat and waved her arm up in the air, shaking her head in disapproval.\n\n\"That's enough. Can't you see the poor girl is overwhelmed? She's... A bit under the weather, and this is quite a little to process. Her head must be killing. You all understand why, right?\"\n\nThey all exchanged wide-eyed looks of comprehension.\n\n\"So wait!? This is a -permanent- sister?!\"\n\n\"Whoa!\"\n\n\"So cool!\"\n\n\"Yay!\"\n\n\"I'm not sharing my room...\"\n\nAgain Arachne waited for them to rile down, the girls all seeming to exchange thoughts of happiness which was hard for me to understand. I remember slinking back down over to the sofa and laying back down quickly while I wasn't being harassed so heavily. I swear they all conversed together about me for at least five minutes, talking back and forth about intricacies of myself that I had never once wagered to even think about for a second.\n\n\"He has cute fingers, huh?\"\n\n\"-She- dumbass!\"\n\n\"Right, right!\"\n\n\"I wonder why his teeth are so messed up.\"\n\n\"Hopefully she doesn't cry all the time...\"\n\nAfter a while it seemed like Arachne had enough of the talking, and went up to one of the girls. She was blonde, her body seemed well developed, though she was short and baby faced. Slim and athletic looking, she conversed with Arachne quietly and happily, before eyeing over to me for a couple moments and then nodding. Suddenly, Arachne clapped her hands together, shushing the room instantly.\n\n\"Alright everyone! We're having Kate's boyfriend over. You all behave. Remember that Christian here isn't initiated in our family traditions yet. Try to help him out.\"\n\nA chorus of feminine voices that sounded quite eager all responded in unison.\n\n\"Yes mother!\"\n\nA couple of the girls slipped from the rooms like snake, all conversing merrily as I heard them tramp through the hallway and down a set of stairs I wasn't aware of at the time. It wasn't thirteen seconds later until they came all holding something. At first I wasn't sure what it was, but I saw as I painstakingly sat up. Bound with rope was a man that seemed physically quite too strong to have been subdued by three girls alone, yet, covered with a mass of strong rope was an older teenager who seemed to be gagged and had been crying. There was a crack in his forehead, from what I could make out at the time. Blood trickling down his skull.\n\n\"Be careful when rounding corners, sheesh!\"\n\n\"I just wanted to see what his blood looked like...\"\n\n\"Fair enough.\"\n\nOn the table in front of me they set the boy down. He looked at me and saw the innocence, or the confusion in my eyes. He pleaded through the gag, but I couldn't make out anything. He squirmed as much as he could through the gag. \n\n\"I was wondering when we'd finally bag the jock. You couldn't have actually had enjoyed spending time with him, right Kate?\"\n\n\"Nah.\"\n\nSuddenly Kate set forward and brandished what looked to be a kitchen butcher knife. Almost as if to confirm her plain statement. I saw a look of excitement dance like fire in the girls eyes as she held the blade, rounding towards the table and stooping low. She held the blade point towards his stomach. \n\n\"This guy is disgusting. I told him I was sixteen and he still wanted to date me. He's the owner of some gang. I figure if he goes missing they'll assume all that. It was calculated to the tiniest degree. I brought him over so he could finally \"make a woman out of me\", isn't that right, Connor?\"\n\nThe man squirmed in his table, and as he did so the knife that was pressing against his stomach knicked some of the taut flesh of well toned body and ripped his black shirt. I could now see that just over where he was being tied with rope there was a well uniformed t-shirt and slacks. One that spelled he was part of a particular gang I had heard of around the city. Most of the pity for the man seemed to already be lost, as was told as I started to blink into his eyes coldly. I knew you shouldn't be with a girl that young, it was illegal, and my dad always read stuff like that in the newspaper and coughed at it, revulsing at the crimes committed by perverts like him.  \n\n\"I want his stomach first.\"\n\n\"Small or large intestine?\"\n\n\"Ew, you two are gross, there may still be poop in those!\"\n\n\"W-Well, your right...\"\n\n\"I call his heart---\"\n\n\"WHOA WHOA KATIE SHOULD GET THAT LET HER-- She stole his heart to begin with~\"\n\nThey all cooed sadistic quips and call outs of random body parts. Dibs here. Dibs there. It was almost like they were out getting candy at Halloween. It made my stomach churn. The throbbing in my neck started to level out, it felt like. Though my headache still was there. I felt the side of my neck where the needle had entered, now realizing as I felt turned my neck that there was two bandages. One on either side of my neck. 'Where did I get the second one?' I worried subconsciously as my brain tried to trick me into distracting myself from the revolting sight about to unfold in front of me. \n\nThe girls all started to surround the boy, getting on their knees. Luckily their backs obscured most of it for me. I heard screams that could pierce the gag and banging of the table as he seemed to rock in agony. Sloppy slurping and sucking noises accompanied the screams quickly. Some times I'd hear a few satisfied grumbles escape the girls throats. \n\n\"Mmm... Try this...\"\n\n\"Ok.\"\n\nI saw blood start to trickle down from the table and onto the carpet. To which I heard Miss Arachne curse about 'I should have brought the cloth...!' That's when I sniffed, probably from whatever fever I had procured. And I smelled it. Something smelled, delectfully *sweet*. I found myself drooling. My eyes dilated. I stared at my group of gnawing sisters. My stomach growled. \n\nAt to which Arachne called out over the sea of girls, \"Someone give something for your new sister to try.\"\n\nThey all turned their heads. Blood all coated the front of their faces, their mouths dripping with cartridge. Chunks of meat were caught in the stream of blood, brought by their sloppy eating. Most of their mouths hung open, all of their teeth looking pointy and almost canid. Suddenly, one of the girls stood up. At first I didn't recognize her. But it was Jezebel. She was chewing something happily. Her mouth was full of food but she sauntered with a small grin on her mouth over to my laying self on the coach. Reaching forward, she forced open my mouth with little trouble, clenching on my jaw. She dove forward, and like a bird feeding it's baby, she spit out her chewed food into my mouth. My teeth were dull, and the meat was chewy, but it tasted so good. And made the throbbing of my head stop as the juices filled my gullet. I ate it down after about thirty seconds of chewing without much question. Jezebel smiled at me and kissed my forehead.\n\n\"Welcome to the family sis.\"\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Child Abuse", "id": "65s8ot", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 164, "report_reasons": null, "author": "FiioRite", "saved": false, "mod_reports": [], "name": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": true, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": "flair-trigger", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65s8ot/my_fifteen_older_sisters/", "num_reports": null, "locked": false, "stickied": false, "created": 1492415482.0, "url": "https://www.reddit.com/r/nosleep/comments/65s8ot/my_fifteen_older_sisters/", "author_flair_text": null, "quarantine": false, "title": "My Fifteen Older \"Sisters\".", "created_utc": 1492386682.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 164}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgd4mwm", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "sapphiresugar", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I thought Ms Arachne was going to be a spider-woman hybrid /spider but it turns out that all of you are actually some sort of vampire?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought Ms Arachne was going to be a spider-woman hybrid /spider but it turns out that all of you are actually some sort of vampire?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd4mwm", "score_hidden": false, "stickied": false, "created": 1492433423.0, "created_utc": 1492404623.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgdp70c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sasstronaut7", "parent_id": "t1_dgcxglf", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I am confused also.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am confused also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdp70c", "score_hidden": false, "stickied": false, "created": 1492474897.0, "created_utc": 1492446097.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxglf", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "Neiroe", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "~~What even is this?~~ What is the resolution of the story?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;del&gt;What even is this?&lt;/del&gt; What is the resolution of the story?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcxglf", "score_hidden": false, "stickied": false, "created": 1492422610.0, "created_utc": 1492393810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgd3ugu", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Sorry about your experience OP. It sounds like you ran into the family that the Manson family thought was too dysfunctional to play with. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry about your experience OP. It sounds like you ran into the family that the Manson family thought was too dysfunctional to play with. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd3ugu", "score_hidden": false, "stickied": false, "created": 1492432009.0, "created_utc": 1492403209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgcyis1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "redbull771", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "that is some messed up stuff Op. how long have you been with them?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;that is some messed up stuff Op. how long have you been with them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgcyis1", "score_hidden": false, "stickied": false, "created": 1492424098.0, "created_utc": 1492395298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgd70qc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Sarms555", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "So... weirdly intriguing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So... weirdly intriguing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd70qc", "score_hidden": false, "stickied": false, "created": 1492438295.0, "created_utc": 1492409495.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgd5ldw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "zlooch", "parent_id": "t1_dgd1jnn", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "No he wasn't.\n\nHe says that he felt \"different\" but that there's no way he would have pursued any lasting treatments,  if not for the abuse and headfuck of this experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No he wasn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;He says that he felt &amp;quot;different&amp;quot; but that there&amp;#39;s no way he would have pursued any lasting treatments,  if not for the abuse and headfuck of this experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd5ldw", "score_hidden": false, "stickied": false, "created": 1492435302.0, "created_utc": 1492406502.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgdt9f8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ana1ytics", "parent_id": "t1_dgd1jnn", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Lol. \"Artisanly\" and \"per say\" almost made me quit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol. &amp;quot;Artisanly&amp;quot; and &amp;quot;per say&amp;quot; almost made me quit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdt9f8", "score_hidden": false, "stickied": false, "created": 1492479417.0, "created_utc": 1492450617.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgdz3c5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PeanutButter707", "parent_id": "t1_dgd1jnn", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "She sounds like she was, she mentioned \"feeling like a girl inside\" beforehand and how she felt not matching up with her body. Could just be that this happening is what really awakened the need to fully transition.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds like she was, she mentioned &amp;quot;feeling like a girl inside&amp;quot; beforehand and how she felt not matching up with her body. Could just be that this happening is what really awakened the need to fully transition.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdz3c5", "score_hidden": false, "stickied": false, "created": 1492485959.0, "created_utc": 1492457159.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1jnn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RoseTintMahWorld", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Im confused as hell.. And intrigued. Your use of the English language is.. Interesting. I need.. More. Were you trans  before your initiation?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im confused as hell.. And intrigued. Your use of the English language is.. Interesting. I need.. More. Were you trans  before your initiation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd1jnn", "score_hidden": false, "stickied": false, "created": 1492428367.0, "created_utc": 1492399567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgd4lne", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mmhmmyeahright", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This was a difficult read, but incredibly original. My interest has been piqued. \nI want to know more of this story.\nI'm curious about what was injected into your neck that would bring a hunger for (ewwww gross!) human flesh.\nDon't keep us waiting for the next part.\nWeird, confusing, macabre, eerie, and did I mention, gross?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was a difficult read, but incredibly original. My interest has been piqued. \nI want to know more of this story.\nI&amp;#39;m curious about what was injected into your neck that would bring a hunger for (ewwww gross!) human flesh.\nDon&amp;#39;t keep us waiting for the next part.\nWeird, confusing, macabre, eerie, and did I mention, gross?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd4lne", "score_hidden": false, "stickied": false, "created": 1492433356.0, "created_utc": 1492404556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgd4sxr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "koiotchka", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Ooooo wow!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooooo wow!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd4sxr", "score_hidden": false, "stickied": false, "created": 1492433740.0, "created_utc": 1492404940.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgd7snc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SilverMight", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Are you out of there? Any phones or something to call for help?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you out of there? Any phones or something to call for help?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd7snc", "score_hidden": false, "stickied": false, "created": 1492440040.0, "created_utc": 1492411240.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgdhams", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheGreatBobbyS", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I haven't actually read your story, but living with 4 sisters myself that title scared the shit out of me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t actually read your story, but living with 4 sisters myself that title scared the shit out of me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdhams", "score_hidden": false, "stickied": false, "created": 1492464859.0, "created_utc": 1492436059.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65s8ot", "likes": null, "replies": "", "user_reports": [], "id": "dgdwku3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnotherDeletedAcct", "parent_id": "t3_65s8ot", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "How does this end? I want to know more!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does this end? I want to know more!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdwku3", "score_hidden": false, "stickied": false, "created": 1492483100.0, "created_utc": 1492454300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]