[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My job is stressful. I work as a nurse on an acute psychiatric unit. Being attacked because someone thinks I&amp;#39;m a demon, or sent from the government to kill them, or any number of other things is just a part of the job. Working in such a volatile environment like that for six years has made me kind of fearless. I don&amp;#39;t hesitate to talk to the dirty homeless guy hallucinating his ass off as he wanders around downtown. I step in when I see people losing it. I go up to the crying lady outside the store and ask how I can help. It&amp;#39;s just second nature now not to shy away from awkward situations. &lt;/p&gt;\n\n&lt;p&gt;When I first started at my hospital, I worked the graveyard shift. Aside from the occasional psychotic patient unable to sleep and determined to cause an uproar, my nights at work were quiet, with patients in bed three hours into my shift. The hospital sits on the bank of a river, in the heart of the city. I spent my breaks down my the water, stretching my legs along the beautiful walk, with a breath taking view of the many colorful lights of the various buildings across the river. If I was lucky, I&amp;#39;d catch a glimpse of a manatee or dolphin. Rare at night, but more likely on my way out to my car after my shift had ended. My husband wasn&amp;#39;t very fond of this habit. He had voiced many times that he was worried I&amp;#39;d be “beat up and raped by some bum.” I always laughed and told him I wasn&amp;#39;t scared, that I&amp;#39;d just take them back to the unit and check them in after taking them down. Then I would remind him that we had security, and cameras, and that no one had ever been hurt there. He would shake his head, knowing I wouldn&amp;#39;t change my stubborn ways, and then steal a Kevin Hart joke, saying “Yeah, but they might touch your lip, then you&amp;#39;ll get a bum-bump and I&amp;#39;ll have to leave you because I&amp;#39;m not kissing you on your bum-bump!”&lt;/p&gt;\n\n&lt;p&gt;He was so relieved when I went to dayshift. There were more staff members during the day for when things on the unit went sideways and my walks by the water happened under the safe glow of sunshine rather than moonlight. Having a normal sleep schedule was fantastic and getting more than a few hours of actual interaction with patients each day renewed my passion for my job. &lt;/p&gt;\n\n&lt;p&gt;I started seeing the crows on my breaks during my first week on days. I would see more than a dozen on any given day as I walked the 1/4 mile path by the river. They would studiously watch the people there and stealthily pick up any food scraps dropped by those having lunch. During my second month, I started bring little treats for them on my walks with me and would drop them behind me when I saw a crow watching me in a tree or toss one ahead when a crow sat perched on the rail that kept clumsy folks from going for an unintended swim. It didn&amp;#39;t take very long for them to start following me on my walks, eagerly anticipating the bits of dried fruit or nuts I would toss out. They say crows are extremely intelligent and remember when people are nice, or mean, to them, sometimes even over generations. I love animals, and my walks became an even better escape from the stress of a bad work day once I had my little friends to feed.&lt;/p&gt;\n\n&lt;p&gt;Losing the $5 an hour night shift differential was a heavy hit to our bank account. We still had enough money to pay the bills and play a little, but not much left to throw into savings. So when our wedding anniversary neared and we wanted to go on a nice vacation, I started picking up extra shifts to help get us there. When a coworker asked if I could pick up their night shift so they could actually go out New Year&amp;#39;s Eve this year, I was more than happy to accommodate. It was a Saturday and weekends added another $5 an hour to the differential, so that was an extra $120 in differential alone, then time and a half for overtime, and holiday pay. That one shift would add a grand to my paycheck.&lt;/p&gt;\n\n&lt;p&gt;I only managed to get a couple hours sleep in before the night shift, but thankfully the patients were calm. We had a good bunch at the moment, and were able to let them stay up til midnight with no issues. We counted down the seconds by the large floor to ceiling dayroom window, with a great view of the fireworks the city set off from a barge in the river. My patients were all asleep by 1:00 AM, and I felt like I wasn&amp;#39;t far behind them, about to nod off in the nurses station. I told my coworkers that I needed to take my break and get moving or I was going to be sleeping on my keyboard instead of charting with it. I headed down to the river with my lunch like always and started walking to my favorite area, near the end of hospital property where it met one of the few heavily wooded parks left downtown. I missed seeing the crows along the path, but the lights across the way were lovely and my attention was soon focused on the other side of the river. That&amp;#39;s why I didn&amp;#39;t notice them until I was almost to my secluded spot by the park. Two men, holding onto what had to have been beer bottles. Working in psych may have made me braver, but it didn&amp;#39;t make me stupid, and it gave me spider senses for trouble brewing. I knew then I should turn around. That I should text my coworkers to call security to investigate and run off the drunks. But I also didn&amp;#39;t want to draw attention to myself. So, I took a seat on the bench nearest me, opened my lunch, and attempted to act like I wasn&amp;#39;t watching them from the corner of my vision and that my heart rate hadn&amp;#39;t begun to climb to a rapid pace as they whispered to each other after noticing me. When they tossed their bottles into the river and started my way I quickly closed my lunch box and started to get up. &lt;/p&gt;\n\n&lt;p&gt;“Hey no, wait, we just wanna ask you a question!” guy number one yelled.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah, don&amp;#39;t leave! Hang on!” guy number two chimed in, as they picked up the pace. &lt;/p&gt;\n\n&lt;p&gt;I tossed out “Sorry, gotta get back to work!” and began to hustle back towards the hospital. &lt;/p&gt;\n\n&lt;p&gt;I hadn&amp;#39;t made it more than a few steps when I felt a hand lock on my arm and spin me around. “Let me go!” I yelled as I came face to face with guy number one. Guy number two moved ahead to get behind me.&lt;/p&gt;\n\n&lt;p&gt;“Hey now sugar, don&amp;#39;t be rude” guy number one grinned.&lt;/p&gt;\n\n&lt;p&gt;“Nobody should have to work on New Year&amp;#39;s Eve, you should come have some fun with us instead.” guy number two chimed behind me. &lt;/p&gt;\n\n&lt;p&gt;“Nurses don&amp;#39;t get holidays off, I need to get back to work now, I&amp;#39;m late already. Please let me go, my coworkers are gonna get worried and send security out to look for me if I don&amp;#39;t get back.” I lied hoping my voice didn&amp;#39;t sound as faint and scared as I felt. I still had 20 minutes left until my break was up, and it would probably take 15 more beyond that for anyone to worry.&lt;/p&gt;\n\n&lt;p&gt;“Awe, don&amp;#39;t be like that.” guy number one crooned, “I think you just need a good reason to stay.” &lt;/p&gt;\n\n&lt;p&gt;He pulled me towards him and tried to shove his hand down my pants. Psych workers get some training in basic self defense, how to subdue people without hurting them, etc. I immediately put that training (and some good old fashioned violence) to use to break his hold on my arm, pulling through the weak point where his thumb and fingers meet, then spun away, but not before throwing an elbow to his groin and stamping on his foot. “You fucking bitch!” he spat as I started to run towards the park. As they followed I felt myself beginning to panic. I&amp;#39;m no athlete, there was no way I could outrun them, and I had never actually gone into the park; I had no idea which way led to safety and I couldn&amp;#39;t go back towards the hospital without them easily grabbing me. &lt;/p&gt;\n\n&lt;p&gt;I was screaming for help when I tripped over a tree root as the paved path gave way to the park, and they were on me in moments. A rough hand shoved over my mouth as they began to pull at my scrubs and hold me down. Tears started to stream down my face as I looked up into the limbs of the tree above me, blurring my vision. Dark swirls started to dance in my vision and I thought surely I was about to lose consciousness, that swimming imagery familiar from the few times I had passed out in my life. For some reason, their grip on me started to loosen, and I began to realize that it wasn&amp;#39;t my muffled yells that I was hearing, but that of my attackers. The dark swirls in my vision remained, but I finally saw it was not swirls at all, but my little crows. A dozen were on the men already, and more were swooping down from the tree we were under, pecking and scratching at the men. They had completely lost all focus on me and were swatting wildly at the crows, screaming as blood began to cover their arms and faces. The swarm of crows seemed to be pushing the men towards the water, relentlessly cawing and pecking all the way. They fell into the icy river yet still the crows persisted. The current carried them slowly away from the shore and they were quickly pulled under when they reached the middle of the river. The crows began settling back into the tree as I stood there shocked, trying to process what had just happened. I gazed up at my little friends, this murder of crows, and they gazed back at me, an occasional quiet caw vocalized. The last crow from the water landed near my feet and dropped something down. I picked it up and looked into the dead eye of guy number one. &lt;/p&gt;\n\n&lt;p&gt;When my breathing finally slowed to normal, I brushed the dirt from my scrubs and walked back to the path, to where my discarded lunch box lay. After picking it up I went back to the tree and began to toss it&amp;#39;s contents to the crows, who happily came down from the tree to accept their reward. Shaking, I put the eye into the bag that had held my sandwich. Once the birds had finished their late night snack, I walked back to the hospital, returning from my break just a few minutes late. When my coworkers asked what happened to make my scrubs dirty, noting the dirt stains and few flecks of blood on my pants, they didn&amp;#39;t question it when I simply said I had tripped outside. Just like my husband didn&amp;#39;t question it when I told him that the jar with an eye that now adorned my desk at home had been discarded from the teaching lab of the hospital.&lt;/p&gt;\n\n&lt;p&gt;You should always feed crows.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My job is stressful. I work as a nurse on an acute psychiatric unit. Being attacked because someone thinks I'm a demon, or sent from the government to kill them, or any number of other things is just a part of the job. Working in such a volatile environment like that for six years has made me kind of fearless. I don't hesitate to talk to the dirty homeless guy hallucinating his ass off as he wanders around downtown. I step in when I see people losing it. I go up to the crying lady outside the store and ask how I can help. It's just second nature now not to shy away from awkward situations. \n\nWhen I first started at my hospital, I worked the graveyard shift. Aside from the occasional psychotic patient unable to sleep and determined to cause an uproar, my nights at work were quiet, with patients in bed three hours into my shift. The hospital sits on the bank of a river, in the heart of the city. I spent my breaks down my the water, stretching my legs along the beautiful walk, with a breath taking view of the many colorful lights of the various buildings across the river. If I was lucky, I'd catch a glimpse of a manatee or dolphin. Rare at night, but more likely on my way out to my car after my shift had ended. My husband wasn't very fond of this habit. He had voiced many times that he was worried I'd be “beat up and raped by some bum.” I always laughed and told him I wasn't scared, that I'd just take them back to the unit and check them in after taking them down. Then I would remind him that we had security, and cameras, and that no one had ever been hurt there. He would shake his head, knowing I wouldn't change my stubborn ways, and then steal a Kevin Hart joke, saying “Yeah, but they might touch your lip, then you'll get a bum-bump and I'll have to leave you because I'm not kissing you on your bum-bump!”\n\nHe was so relieved when I went to dayshift. There were more staff members during the day for when things on the unit went sideways and my walks by the water happened under the safe glow of sunshine rather than moonlight. Having a normal sleep schedule was fantastic and getting more than a few hours of actual interaction with patients each day renewed my passion for my job. \n\nI started seeing the crows on my breaks during my first week on days. I would see more than a dozen on any given day as I walked the 1/4 mile path by the river. They would studiously watch the people there and stealthily pick up any food scraps dropped by those having lunch. During my second month, I started bring little treats for them on my walks with me and would drop them behind me when I saw a crow watching me in a tree or toss one ahead when a crow sat perched on the rail that kept clumsy folks from going for an unintended swim. It didn't take very long for them to start following me on my walks, eagerly anticipating the bits of dried fruit or nuts I would toss out. They say crows are extremely intelligent and remember when people are nice, or mean, to them, sometimes even over generations. I love animals, and my walks became an even better escape from the stress of a bad work day once I had my little friends to feed.\n\nLosing the $5 an hour night shift differential was a heavy hit to our bank account. We still had enough money to pay the bills and play a little, but not much left to throw into savings. So when our wedding anniversary neared and we wanted to go on a nice vacation, I started picking up extra shifts to help get us there. When a coworker asked if I could pick up their night shift so they could actually go out New Year's Eve this year, I was more than happy to accommodate. It was a Saturday and weekends added another $5 an hour to the differential, so that was an extra $120 in differential alone, then time and a half for overtime, and holiday pay. That one shift would add a grand to my paycheck.\n\nI only managed to get a couple hours sleep in before the night shift, but thankfully the patients were calm. We had a good bunch at the moment, and were able to let them stay up til midnight with no issues. We counted down the seconds by the large floor to ceiling dayroom window, with a great view of the fireworks the city set off from a barge in the river. My patients were all asleep by 1:00 AM, and I felt like I wasn't far behind them, about to nod off in the nurses station. I told my coworkers that I needed to take my break and get moving or I was going to be sleeping on my keyboard instead of charting with it. I headed down to the river with my lunch like always and started walking to my favorite area, near the end of hospital property where it met one of the few heavily wooded parks left downtown. I missed seeing the crows along the path, but the lights across the way were lovely and my attention was soon focused on the other side of the river. That's why I didn't notice them until I was almost to my secluded spot by the park. Two men, holding onto what had to have been beer bottles. Working in psych may have made me braver, but it didn't make me stupid, and it gave me spider senses for trouble brewing. I knew then I should turn around. That I should text my coworkers to call security to investigate and run off the drunks. But I also didn't want to draw attention to myself. So, I took a seat on the bench nearest me, opened my lunch, and attempted to act like I wasn't watching them from the corner of my vision and that my heart rate hadn't begun to climb to a rapid pace as they whispered to each other after noticing me. When they tossed their bottles into the river and started my way I quickly closed my lunch box and started to get up. \n\n“Hey no, wait, we just wanna ask you a question!” guy number one yelled.\n\n\"Yeah, don't leave! Hang on!” guy number two chimed in, as they picked up the pace. \n\nI tossed out “Sorry, gotta get back to work!” and began to hustle back towards the hospital. \n\nI hadn't made it more than a few steps when I felt a hand lock on my arm and spin me around. “Let me go!” I yelled as I came face to face with guy number one. Guy number two moved ahead to get behind me.\n\n“Hey now sugar, don't be rude” guy number one grinned.\n\n“Nobody should have to work on New Year's Eve, you should come have some fun with us instead.” guy number two chimed behind me. \n\n“Nurses don't get holidays off, I need to get back to work now, I'm late already. Please let me go, my coworkers are gonna get worried and send security out to look for me if I don't get back.” I lied hoping my voice didn't sound as faint and scared as I felt. I still had 20 minutes left until my break was up, and it would probably take 15 more beyond that for anyone to worry.\n\n“Awe, don't be like that.” guy number one crooned, “I think you just need a good reason to stay.” \n\nHe pulled me towards him and tried to shove his hand down my pants. Psych workers get some training in basic self defense, how to subdue people without hurting them, etc. I immediately put that training (and some good old fashioned violence) to use to break his hold on my arm, pulling through the weak point where his thumb and fingers meet, then spun away, but not before throwing an elbow to his groin and stamping on his foot. “You fucking bitch!” he spat as I started to run towards the park. As they followed I felt myself beginning to panic. I'm no athlete, there was no way I could outrun them, and I had never actually gone into the park; I had no idea which way led to safety and I couldn't go back towards the hospital without them easily grabbing me. \n\nI was screaming for help when I tripped over a tree root as the paved path gave way to the park, and they were on me in moments. A rough hand shoved over my mouth as they began to pull at my scrubs and hold me down. Tears started to stream down my face as I looked up into the limbs of the tree above me, blurring my vision. Dark swirls started to dance in my vision and I thought surely I was about to lose consciousness, that swimming imagery familiar from the few times I had passed out in my life. For some reason, their grip on me started to loosen, and I began to realize that it wasn't my muffled yells that I was hearing, but that of my attackers. The dark swirls in my vision remained, but I finally saw it was not swirls at all, but my little crows. A dozen were on the men already, and more were swooping down from the tree we were under, pecking and scratching at the men. They had completely lost all focus on me and were swatting wildly at the crows, screaming as blood began to cover their arms and faces. The swarm of crows seemed to be pushing the men towards the water, relentlessly cawing and pecking all the way. They fell into the icy river yet still the crows persisted. The current carried them slowly away from the shore and they were quickly pulled under when they reached the middle of the river. The crows began settling back into the tree as I stood there shocked, trying to process what had just happened. I gazed up at my little friends, this murder of crows, and they gazed back at me, an occasional quiet caw vocalized. The last crow from the water landed near my feet and dropped something down. I picked it up and looked into the dead eye of guy number one. \n\nWhen my breathing finally slowed to normal, I brushed the dirt from my scrubs and walked back to the path, to where my discarded lunch box lay. After picking it up I went back to the tree and began to toss it's contents to the crows, who happily came down from the tree to accept their reward. Shaking, I put the eye into the bag that had held my sandwich. Once the birds had finished their late night snack, I walked back to the hospital, returning from my break just a few minutes late. When my coworkers asked what happened to make my scrubs dirty, noting the dirt stains and few flecks of blood on my pants, they didn't question it when I simply said I had tripped outside. Just like my husband didn't question it when I told him that the jar with an eye that now adorned my desk at home had been discarded from the teaching lab of the hospital.\n\nYou should always feed crows.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Graphic Violence", "id": "65si7m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 195, "report_reasons": null, "author": "SassyRescueNinja", "saved": false, "mod_reports": [], "name": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": true, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": 1492390412.0, "link_flair_css_class": "flair-trigger", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65si7m/always_feed_the_crows/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418752.0, "url": "https://www.reddit.com/r/nosleep/comments/65si7m/always_feed_the_crows/", "author_flair_text": null, "quarantine": false, "title": "Always Feed the Crows", "created_utc": 1492389952.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 20, "visited": false, "subreddit_type": "public", "ups": 195}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgdo3ul", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Sasstronaut7", "parent_id": "t1_dgd0zuy", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This is so adorable &lt;3 bless the Crow named Raven ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is so adorable &amp;lt;3 bless the Crow named Raven &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdo3ul", "score_hidden": false, "stickied": false, "created": 1492473665.0, "created_utc": 1492444865.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgds3gy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "draegunfly", "parent_id": "t1_dgdoc8d", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Crows and Ravens can speak (as well as the rest of the Corvid family) if they are taught at a young age. It's pretty cool. They are much easier to understand than parrots. You should youtube some videos.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Crows and Ravens can speak (as well as the rest of the Corvid family) if they are taught at a young age. It&amp;#39;s pretty cool. They are much easier to understand than parrots. You should youtube some videos.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgds3gy", "score_hidden": false, "stickied": false, "created": 1492478122.0, "created_utc": 1492449322.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdoc8d", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SentinelBacon", "parent_id": "t1_dgdoaa6", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Oh!I was confused as i though crows couldnt speak", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh!I was confused as i though crows couldnt speak&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdoc8d", "score_hidden": false, "stickied": false, "created": 1492473932.0, "created_utc": 1492445132.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdoaa6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "draegunfly", "parent_id": "t1_dgdnqpj", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "With her beak? I'm not sure I understand your question. Corvids can mimic words just like a parrot, if they're taught to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With her beak? I&amp;#39;m not sure I understand your question. Corvids can mimic words just like a parrot, if they&amp;#39;re taught to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdoaa6", "score_hidden": false, "stickied": false, "created": 1492473868.0, "created_utc": 1492445068.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnqpj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SentinelBacon", "parent_id": "t1_dgd0zuy", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "How did your crow speak?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How did your crow speak?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdnqpj", "score_hidden": false, "stickied": false, "created": 1492473248.0, "created_utc": 1492444448.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0zuy", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "draegunfly", "parent_id": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "When I was a kid, I had a Crow named Raven. She could talk. She would follow me to school and would be waiting in a tree for me when school ended. She'd scream out, \"Get Lost!\" if anyone bothered us on the way home.  Of course, I also trained her to say Nevermore.\n\nWhen I had to move (to another country), I took her to a bird sanctuary. She (read as her carer) sent me postcards until she passed away.  \n\nYour story filled me with a warm nostalgia for my sweet Crow named Raven.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was a kid, I had a Crow named Raven. She could talk. She would follow me to school and would be waiting in a tree for me when school ended. She&amp;#39;d scream out, &amp;quot;Get Lost!&amp;quot; if anyone bothered us on the way home.  Of course, I also trained her to say Nevermore.&lt;/p&gt;\n\n&lt;p&gt;When I had to move (to another country), I took her to a bird sanctuary. She (read as her carer) sent me postcards until she passed away.  &lt;/p&gt;\n\n&lt;p&gt;Your story filled me with a warm nostalgia for my sweet Crow named Raven.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd0zuy", "score_hidden": false, "stickied": false, "created": 1492427571.0, "created_utc": 1492398771.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgd0obf", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "IcePhoenix96", "parent_id": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Crows are bros. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Crows are bros. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd0obf", "score_hidden": false, "stickied": false, "created": 1492427106.0, "created_utc": 1492398306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgd8o5h", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "They don't call them a murder for nothing OP. A little known fact about crows is that they give people names. This would be a unique sound you will hear your friends make only when you are around. I suppose they may have named your attackers. I wonder what \"two dead pieces of shit\" would sound like in crow. At least they let you keep an eye on them. Good luck.", "edited": 1492422876.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They don&amp;#39;t call them a murder for nothing OP. A little known fact about crows is that they give people names. This would be a unique sound you will hear your friends make only when you are around. I suppose they may have named your attackers. I wonder what &amp;quot;two dead pieces of shit&amp;quot; would sound like in crow. At least they let you keep an eye on them. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd8o5h", "score_hidden": false, "stickied": false, "created": 1492442079.0, "created_utc": 1492413279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgdf8er", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "dick-dick-goose", "parent_id": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Occasional patient causing an uproar? Patients in bed three hours into your shift? Put in a good word for me, I'm coming to work there. I work overnight 12s, and am beset by sundowners and insomniacs all night every night! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Occasional patient causing an uproar? Patients in bed three hours into your shift? Put in a good word for me, I&amp;#39;m coming to work there. I work overnight 12s, and am beset by sundowners and insomniacs all night every night! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdf8er", "score_hidden": false, "stickied": false, "created": 1492461268.0, "created_utc": 1492432468.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgdbwjr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "leahmonster", "parent_id": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Amazing. Great storytelling!! I'm glad you're ok.. thank those crows with some peanuts!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amazing. Great storytelling!! I&amp;#39;m glad you&amp;#39;re ok.. thank those crows with some peanuts!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdbwjr", "score_hidden": false, "stickied": false, "created": 1492452671.0, "created_utc": 1492423871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgdmtjh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Iloveagoodscare", "parent_id": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This was one of those scary yet heartwarming stories. I always like it when animals are heroes. Thank goodness for Crows!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was one of those scary yet heartwarming stories. I always like it when animals are heroes. Thank goodness for Crows!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdmtjh", "score_hidden": false, "stickied": false, "created": 1492472191.0, "created_utc": 1492443391.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65si7m", "likes": null, "replies": "", "user_reports": [], "id": "dgdwg0v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "w33dw1tch", "parent_id": "t3_65si7m", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Was just telling my friend yesterday that I always intend to carry nuts for the crows because of this exact situation, but I never remember to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was just telling my friend yesterday that I always intend to carry nuts for the crows because of this exact situation, but I never remember to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdwg0v", "score_hidden": false, "stickied": false, "created": 1492482947.0, "created_utc": 1492454147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]