[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nosleep", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The house is never empty.&lt;br/&gt;\nI listen to the other inhabitants leave, heavy feet on the dilapidated stairs, voices receding, swallowed by the wood and plaster of the long corridors. Even after those sounds have dissipated, and I am left here alone, I can &lt;em&gt;feel&lt;/em&gt; those who lived here before. Many essences suffuse the bones of this sprawling manor.&lt;br/&gt;\nThere are far more rooms than current residents, as the house isn’t exactly the most desirable living space. It hunches on the edge of a cliff at the end of a cul-de-sac, and one might think it the sort of place to which the hip and wholesome would flock, for romantic sea-views and artful isolation.&lt;br/&gt;\nBut were you to view the house yourself, you’d soon see why they don’t.&lt;br/&gt;\nThe landlord, a tall, skeletal man of Polynesian descent, told me that it was once called ‘Hedges House’. It was a beautiful place in its heyday, surrounded by thick privet and spreading elms, their boundary boscage concealing interior gardens rampant with camellias; almost maze-like in their placement.&lt;br/&gt;\nBut time was not kind to the lands around the house. One coastal storm too many had eaten away the land behind it, bringing the edge of the cliff creeping ever closer. Eventually, the owners had abandoned it, finally moving out when only a narrow strip of grass separated the walls of the house from the fifty-foot precipice.&lt;br/&gt;\nThat had been more than twenty years ago, and hungry erosion had since claimed even that strip of sward. On the stony beach below the house, lathes of timber and chunks of plaster bleached in the salty air, the cliff having claimed the outermost room of the house – a solar or conservatory perhaps.  The glass from its windows was now smooth, transparent jewels, tumbled by the lashing tides.&lt;br/&gt;\nNo one in their right mind would live in a crumbling house teetering on the edge of such a deathly fall. But then, not a single soul living here can be called sane.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nIn a piquant display of irony, someone had knocked out the first ‘H’ from the rusted wrought-iron gate that sat across the gap in the outer hedge; so that it read ‘edges House’.&lt;br/&gt;\nI’d moved here due to financial constraints, as the house was by far the cheapest place around for the size of the rooms. I think the door to my second-floor abode was lime green when I first moved in, but in a curious twist of fate, the paint had slowly flaked away until it revealed an undercoat of vibrant yellow-orange, my favourite colour. Things like that seemed to just &lt;em&gt;happen&lt;/em&gt; in the house, and over time you stopped questioning it, as each coincidence seemed harmless enough. My room was spacious, airy and high-ceilinged. The regular pattern of scuffmarks that scarred the wooden floorboards made me speculate whether the previous occupant had been a dancer, a theory borne out by a bloody-toed ballet shoe I found behind the ancient steel oil heater. The windows were huge and arched, letting in all the blue-white light reflecting off the ocean below the cliff.&lt;br/&gt;\nThat first night was a hard one. I’d moved in during a manic phase, the newest medication still finding its way through the maze of my brain, and I’d cleaned the room all day until my body, at least, was exhausted. But lying in the unfamiliar single bed that night, springs creaking beneath me, sleep did not come. Instead, my ears betrayed my racing mind by picking up and amplifying every sound the house made, and it made plenty.&lt;br/&gt;\nOh, it creaked and it &lt;em&gt;groaned&lt;/em&gt; - so loudly that I feared some part of it was alive and in pain, imminently collapsing. When something snapped, forcefully and abruptly, sending a shudder through the entire place, I could bear no more. I ran down the darkened stairwell in my pyjamas, weeping in terror and hoping that I would make it out before the whole house tumbled over the cliff.&lt;br/&gt;\nBut it did not fall.&lt;br/&gt;\nIt seemed so impossible that it still stood, I could not bring myself to go back inside. So I stood there in the tangled camellia garden, shivering with fear, looking up at the strange hodgepodge of windows that peppered the outside of the manor.&lt;br/&gt;\nThe scent of tobacco wafted through the air, and a woman’s warm voice called from the edge of the light near the front door,&lt;br/&gt;\n“It’s naught to worry about, love. The house is always shifting, making strange noises. If it was going to fall down, it would have done so long, long ago.”&lt;br/&gt;\nAnd that’s how I met Mary Mudgeway.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\n&lt;em&gt;In the flat next door lives one Mary Mudgeway&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Hanging half in the hall and half in her door&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;She stands there for sailors&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Who came for her favours&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;In the days of her past&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;But don’t anymore&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nI’ve never been a smoker, but I became one after Mary befriended me. She gifted me her spare pipe, and we would pack the bowls with a fragrant blend of her own making and puff away like a pair of Victorian gentlemen, watching the sun set over the peninsula.&lt;br/&gt;\nStuck somewhere between old and young, Mary was still beautiful in a faded way, like a dried blossom hanging forgotten in a florist’s shop. When she smiled, the crow’s feet multiplied, and when she spoke, a web-work of lines tugged at her lips, themselves plumped with products made from bee venom and lemon.&lt;br/&gt;\nShe said she still had a few clients who came to her, but as her body had betrayed her by ageing, most of the work had faded away. Having never learned another trade and suffering extreme dyslexia, Mary had chosen the house for the same reasons as the rest of us; the rooms were large and the rent was low.&lt;br/&gt;\nOne night, as we chuffed sweet herbs by the porch, she asked me if I’d ever made love to another woman and delicately placed a hand on the curve of my hip. The gesture had thrilled me briefly, but through beetroot blushes, I told her that I didn’t feel that way about women.&lt;br/&gt;\nLong after she had gone, I could still feel the heat of her palm where it had grazed me. I climbed the gap-toothed spiral stairs to the balcony on the corner of the third floor, where you could see into the windows along the southwest wall of the house. Mary undressed languidly and sensually, as though quite aware she was being observed. Slipping on a gown of faded coral silk, she opened her window wide.&lt;br/&gt;\nFor a moment, I thought she was going to jump; that she’d had enough of life and the crumbling house. I may even have been vain enough to wonder whether my rejection had been the last straw – but instead she just waited there, the breeze from the ocean stirring the hems of her robe.&lt;br/&gt;\nAnd it was then that I smelled the change.&lt;br/&gt;\nRank with the reek of dead fish, the air turned foul. Rising up from the stony beach below, the fingers of the stench curled around the balcony and gripped my throat, making me gag. Decay and sweet rot, dusted with the sharp mustiness of rotting seaweed.&lt;br/&gt;\nMary saw him before I did, her head tracking him as he lurched up the rocks and dug strong fingers into the face of the cliff. A stinking man, his oil-skin coat and hat in greasy, fluttering tatters. Paralysed, I watched with guilt and trepidation as he scaled the precipice, then, gifting a final waft of death to the night air, he hauled himself through Mary’s window.&lt;br/&gt;\nI saw her step in, and I saw her lips brush the grey flesh under his hat. So gently and tenderly she undressed him, removing first the heavy coat, then the sea-battered woollen rags he wore beneath – until the pallid, naked corpse of a sailor stood before her. His ragged, crab-eaten erection stood proudly below the cavity where his organs had once clustered, long gone to the creatures of the deeps.&lt;br/&gt;\nI’d like to tell you that I was not such a voyeur that I watched an undead sailor ravage my neighbour, but that would be a lie. Spellbound with horror, I watched as Mary expertly plied her trade, and when the lusty corpse was done, I watched him place a pile of tarnished silver coins in her shaking hands, then leave the same way that he arrived.&lt;br/&gt;\nI understood then exactly why Mary had made a pass at me; for if her bed had been full that night, there would have been no room for dead men.&lt;br/&gt;\nAnd she knew I had no access to any sunken treasure to pay for her services, even if I’d wanted to.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\n&lt;em&gt;Down on the first floor dwells a Petr Petrowski&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Bald as an egg and skin thin as a caul&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;“Not catching” he told me&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Of his wasting malady&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;But other than that&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Never speaks much at all&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nWhen first I chanced upon Petr, I thought him some kind of ghoulish spirit wandering the house.  Shamefully, I squealed in fear rather than saying hello, then ran to Mary – who told me the gaunt man was a resident, not a revenant.&lt;br/&gt;\nWith a thick Polish accent and very little command of English, he was a quiet man who kept mostly to his rooms, which had an outer door to the gardens and a peeling veranda. Some days his skin had more colour, but his general pallor spoke of some grave illness, as did the great dark circles that bruised the pouches beneath his watery blue eyes.&lt;br/&gt;\nWhen the hearse pulled up outside his door, I assumed the mystery illness had finally bested him, and he had finally shuffled off this mortal coil. But instead, Petr hauled his grey-suited bones from the driver’s seat, quite alive. I admit I enjoyed the black humour of a man so close to the edge of death working &lt;em&gt;with&lt;/em&gt; the dead. Anyone stumbling into his workplace might think him a client, not a mortician.&lt;br/&gt;\nAs I understood it, his work was sparse. Exclusively serving the local Polish community, he lived off their deaths like some ancient, bald vulture, hauling bodies home to the house where he meticulously embalmed them. Whenever he had a client, the eye-watering stink of potent chemicals wafted up from his church-like windows.&lt;br/&gt;\nHe seemed an ascetic and antisocial man. But one restless night when my mania would not let me sleep, I crept down to the gardens for a pipe of Mary’s sweet herbs, and rather than formaldehyde fumes, &lt;em&gt;music&lt;/em&gt; and &lt;em&gt;laughter&lt;/em&gt; was emanating from Petr’s steepled windows.&lt;br/&gt;\nPeeking through the warped stained glass, I chanced a glimpse of him inside. He was dancing as if illness had never once visited him.  A tall woman, resplendent in an orange and yellow dress, pressed her rosy cheek to his grey flesh as they turned about the floor, and her pin-up curls shone golden in the candlelight.&lt;br/&gt;\nThat old Petr was such a ladies’ man, who would have guessed? As my weeks in the house turned to months, I observed three different women in his room at night.  None visited more than once, and stranger still, each wore the same bright dress.&lt;br/&gt;\nThere was a story here that needed to be written; a mystery that needed unravelling.&lt;br/&gt;\nI watched him for days; coming and going in his great black car. When eventually he hauled a heavy coffin from the back of the hearse and wheeled it into his little workshop, I decided to brave the fumes. With a handkerchief knotted around my face, I peered through the crack of the opened window.&lt;br/&gt;\nThe deceased was a woman, and I watched as Petr carefully and reverently prepared her body. When he methodically laid out a dozen old-fashioned hair curlers, and draped an orange and yellow dress over the back of a chair, I felt a preternatural thrill shoot up my spine.&lt;br/&gt;\nIn his tiny kitchen, Petr had set a table for two, complete with guttering candles and large glasses of scarlet wine. He gently arranged the dead woman in her seat, then put the needle down on a battered record player and took his place opposite her as a scratchy violin began to play.&lt;br/&gt;\nFor many long minutes, they sat there, the half-dead man and the all-dead woman.&lt;br/&gt;\nThen, with a small sigh and a tilt of her head, colour blushed her cheeks and she opened her eyes.&lt;br/&gt;\nAs though this were a perfectly ordinary thing, Petr began to speak in his own language. Gone was the halting, broken English; in his mother tongue, his voice was lyrical, deep and hypnotic. Even from my hidden perch by the window, its resonance sent pleasant tingles across my scalp and down the nape of my neck. I suddenly wanted Petr’s lips to whisper mysterious words against my skin.&lt;br/&gt;\nThey drank, and they laughed. Her hand brushed his, and they shared a kiss. The record changed, and they danced to some lively polka, the orange and yellow dress swirling about her hips and their mouths meeting more and more often – until he picked her up in arms that no longer trembled with illness and he carried her through the door to his bedroom.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nIn the morning, the bright dress was hung in a locked closet, and the woman’s body wheeled back out to the hearse, dead as cold wax once more. I returned to my room, to write down what I had seen, perplexed by the events that I had observed.&lt;br/&gt;\nHad I not already witnessed Mary’s tryst with the dead sailor, I might have written the whole incident off as delusions born of a formaldehyde-addled nightmare. But I knew that there was something highly unnatural happening in this house, some uncanny power at work.&lt;br/&gt;\nAnd I needed to know &lt;em&gt;more&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\n&lt;em&gt;The Ransoms are fighting, a clattering racket&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Thrown pans and dishes hit the walls and the floor&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;No children in evidence&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;In their first floor residence&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Just a man and his wife&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;In perpetual war&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nWe all heard the Ransoms fighting. When the wind blew from the south, it was unavoidable; the breeze pushed their shouted imprecations back through our windows and made us all cringe.&lt;br/&gt;\n“She should leave him,” said Mary, as we drank tea in my kitchen, her comforting presence soothing my nerves as much as the hot brew.&lt;br/&gt;\nThere’s no doubt that she’s right, and yet Ruby and Robbie stay together, despite the incendiary hatred that fills their part of the house. He’s a tall, thrust-jawed man with a widower’s peak, and his heavy workman’s boots thump up and down the stairs like artillery warning that the fighting will shortly begin.&lt;br/&gt;\nThere’s always a good ten minutes of calm after he comes home – a golden window of silence where neither husband nor wife says anything to one another, and all we hear is the bang of pipes from their shower while he sluices off the dust and grime from the demolition sites he works on.&lt;br/&gt;\nOh, they don’t &lt;em&gt;always&lt;/em&gt; fight; sometimes there are ordinary conversation and dinner sounds, which are quickly followed by some of the loudest fucking I’ve ever heard in my life. He grunts and bawls like a rabid hog, and she screams, while the headboard smashes into the walls until my lampshade starts to swing in time to their rhythm.&lt;br/&gt;\nYou don’t see Ruby very often, usually only at night and in the weekends. She’s a delicate thing, long dark hair framing a pale face and bruised red lips, her waspish, hourglass frame the exact opposite of her husband’s hulking, brutish trapezoid.&lt;br/&gt;\nTheir domestic disputes seem to revolve around the fact that Robbie works hard and expects Ruby to fulfil all her ‘wifely duties’ to his satisfaction on his return home. In turn, she resents being locked away all day, her whole existence captive to his whims and desires.&lt;br/&gt;\nWhy she didn’t just leave him was another, albeit more prosaic, kind of mystery. Every time I passed her during my sleepless explorations of the strange house, I would feel a pang of guilt that I wasn’t doing anything to help her.&lt;br/&gt;\nWhen I lost a whole night of precious sleep to her screaming “No, no NO!” during one of their hours-long fucking sprees, concern and compassion finally overcame my complacency. I decided I was going to &lt;em&gt;do&lt;/em&gt; something.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nI knocked until my knuckles were bruised, listening for any signs of life inside the Ransom’s quarters, but not a sound betrayed the presence of anyone inside.&lt;br/&gt;\nRobbie was at work, I had listened to his boots stomping away hours ago. I knew that he locked the door fast behind him, so if Ruby wished to leave, her only egress would be a precarious climb down the ramshackle side of the house over the cliff.&lt;br/&gt;\nI was angry now, angry enough to do something stupid. When I’m in one of my ‘high’ phases, I need to do things, to change the world around me; to frenetically create or destroy. In this instance, being denied entry to their rooms was the focus of my frustration and determination.&lt;br/&gt;\nThe room beside theirs was empty; full of flattened cardboard boxes and broken furniture, but the windows were wide enough to climb out. Clinging to the side of the house, laughing wildly into the wind at the terrifying drop to the beach below me, I swung around the exterior and crabbed along the narrow ledge until I reached their rickety balcony.&lt;br/&gt;\nA single, lonely chair sat upon it, warped by the weather.&lt;br/&gt;\nInside, their apartment was a curious duality; one side of the windows was draped with lacy curtains, while the opposite side was shaded by old bamboo blinds, dusty and bug-eaten. Men’s clothing was strewn about the lounge, but shelves and hooks meant for books and crockery held only women’s clothing; washed, ironed, and neatly folded or hung. To the left of the bathroom sink was an impressive array of neatly placed cosmetics and beauty products, while the right side of the porcelain unit held only a bar of abrasive soap and a pungent tub of Swarfega, both sitting in a pool of greasy grime.&lt;br/&gt;\nIn a water-spotted glass behind the sink sat a single toothbrush.&lt;br/&gt;\nThe door to the bedroom was closed. I vividly imagined that beyond it suffered Ruby, bound and gagged, cuffed to one of the steel radiators ubiquitous to the house. Or worse, no longer suffering, lying murdered in a pool of her own blood.&lt;br/&gt;\nGritting my teeth, I pushed open the door to see only a drooping, single bed, narrow and empty. Now I didn’t know what to think.&lt;br/&gt;\nIt was as if Ruby didn’t exist.&lt;br/&gt;\nBefore I could pry further, or stop to muse on what exactly was happening here, the sound of heavy, angry steps began thumping up the stairs.&lt;br/&gt;\nRobbie was home early.&lt;br/&gt;\nThere was no way I could make it out over the balcony in time. I’d have to resort to the age-old trope of hiding in the wardrobe, hoping that I could make my escape while he showered.&lt;br/&gt;\nI waited in the camphor darkness, listening to Robbie undressing, muttering to himself. The shower came on, a stutter of ancient pipes in the wall near my head making me jump. Incongruously, Robbie’s hateful voice began to sing a Broadway showtune, and I crept out of my hidey-hole.&lt;br/&gt;\nThen something odd and miraculous happened.&lt;br/&gt;\nAs I listened, his voice rose one octave, then another. Before another three bars were done, the beautiful soprano voice of Ruby rang out clearly from the bathroom.&lt;br/&gt;\nThe door was ajar, and pressing my eye to it, I saw only one body in the shower – the pale curves of the diminutive wife shrouded in the steam.&lt;br/&gt;\n“Ruby!” I hissed, my original plan back in action.&lt;br/&gt;\nShe froze, her voice dying away.&lt;br/&gt;\n“Who’s there?”&lt;br/&gt;\n“The girl from the second floor, we pass on the stairs sometimes.”&lt;br/&gt;\n“What are you doing in here?”&lt;br/&gt;\n“I came to help you! I came to talk to you about Robbie. Where is he?”&lt;br/&gt;\nThe door opened, and Ruby stared out at me. She was stark naked, her hair beading water on skin so translucent she seemed slightly transparent, and her dark eyes were huge.&lt;br/&gt;\n“You have to get out before he comes back.”&lt;br/&gt;\n“What do you mean?”&lt;br/&gt;\n“Look at the balcony.”&lt;br/&gt;\nThrough the cloudy glass of the double-doors, I saw the single chair I’d passed on the way in. But now a &lt;em&gt;shadow&lt;/em&gt; sat in it, roughly the size and shape of Robbie – and as I watched, it grew more solid, more substantial and &lt;em&gt;real&lt;/em&gt;.&lt;br/&gt;\n“I don’t understand.”&lt;br/&gt;\nUnselfconscious, she began to move about the lounge, picking out clothes from the neat, feminine piles.&lt;br/&gt;\n“He’s not real. He’s the person I have to be, during the day, to survive. &lt;em&gt;This&lt;/em&gt; is the real me. But I can only exist in this house, do you understand?”&lt;br/&gt;\nThe shadow on the balcony turned its head, resolving smears of dark eyes and a bulging jaw now, insubstantial fists clenching and unclenching.&lt;br/&gt;\n“He’ll kill you if he realises you’re here,” she hissed, “you need to &lt;em&gt;get out!&lt;/em&gt;”&lt;br/&gt;\nAnd so, fear and confusion lending me speed, I fled.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nI’ve seen her since, on the stairs and in the garden, those great expressive eyes pleading me not to tell anyone, not to expose her secret. I think that when Robbie sleeps, she can exist alone, and that’s why she lets him beat her and rape her in that sagging single bed. Perhaps after he has expended his towering rage and frustration, after he has grunted his seed into her, he becomes a shadow and fades away, only reappearing when dawn breaks over the side of the house.&lt;br/&gt;\nLike all of us here, Ruby has found a precarious balance that allows her to exist.&lt;br/&gt;\nI think, for me, her price would be too high.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\n&lt;em&gt;In the south-western spire dwells Jeremy Jackson&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Green-painted nails and tufted, spiked hair&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;As a butcher’s apprentice&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Hands red to the wrist&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;He hauls bags of offal&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Leaving stains on the stairs&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nThere are always seagulls circling the spire on the corner of the house, and I don’t know how Jeremy stands it. Their incessant calls would drive me mad, and I think before long I’d borrow the slug-gun the landlord uses on rats, and I’d blast every screeching bird out of the sky.&lt;br/&gt;\nWith carefully drawn eyebrows, twin lip piercings, and a hint of a lisp, Jeremy’s sexuality is proudly on display to the world, almost as obvious as his ribs. Thin to the point of painful, his wrists like cotton-reels, any whispers of ‘gay’ behind his back are probably less frequent than hushed murmurs of ‘anorexia’.&lt;br/&gt;\nStill, having run the gamut of eating disorders myself, I’m not one to judge. And Jeremy seems happy enough, living alone in his crumbling tower like the queerest wizard of them all. We have a sort of unspoken friendship that is quite different from the one I share with Mary. As an artist of rotating disciplines, my own colourful appearance seemed to mark me instantly as the sort of person Jeremy can count on as an ally.&lt;br/&gt;\nSometimes he’ll join Mary and me for a pipe, though the pungent tang of his own smoke tells me that his blend is much less legal than ours. He always offers me a puff, of course, but I decline. Experience taught me long ago that weed wreaks merry havoc with my medication, and the immediate hazy benefits aren’t worth the suicidal lows that follow.&lt;br/&gt;\nHow he survives as a butcher’s apprentice – let alone how he got the job in the first place – is quite beyond me. But I &lt;em&gt;do&lt;/em&gt; know that he is very good at it, and he really seems to enjoy it, even though it pays a pittance.&lt;br/&gt;\nAnd there’s an added bonus, worth more than money, as far as Jeremy is concerned. He gets to take home all the offal he can carry.&lt;br/&gt;\nFor quite a long time, I couldn’t figure out what his secret was, what fell bargain he had struck with the House. All the rest of us had found a knife-edge to balance upon, so what was his?&lt;br/&gt;\nEmboldened by my other discoveries, and suspecting Jeremy’s very feyness might predispose him to know what I was talking about, I decided to simply ask him.&lt;br/&gt;\nGreen eyes regarded me levelly, then he replied quietly,&lt;br/&gt;\n“I feed it.”&lt;br/&gt;\n“How?” I wondered.&lt;br/&gt;\n“Come by tonight, after sundown, and I’ll show you.”  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nThe stairs grew dusty the higher I climbed, and mildew spread a dark patina across the ancient plaster walls. To reach the spire, you had to briefly exit the main part of the manor, braving the walk across a narrow span of crumbling brick. The rusted iron rails to either side would be no help at all should the wind roaring around you get its wish to throw you off.&lt;br/&gt;\nStains spattered the bricks, bloody and bold, a slippery reminder of Jeremy’s grisly trade in animal flesh. I wondered just how many double-bagged bundles of gore had been dragged over the causeway, and how often he had nearly fallen.&lt;br/&gt;\nThe pea-green door opened at my touch, revealing a neat room that had been largely converted to a kitchen. Gas bottles and a stove sat to one side, and a large wooden table dominated the rest of the spire, well-scarred with knife-marks.&lt;br/&gt;\nBut what I truly noticed first were the smells.&lt;br/&gt;\nSeveral huge pots were bubbling on the gas stove, vats of broths and gravies, which Jeremy stirred by turns as he waved hello with the other emaciated hand. Inside the oven, large baking dishes lurked – a waft of rich meats made me salivate as he opened the door to prod something with a skewer.&lt;br/&gt;\n“Right on time,” he said, unfamiliar colour in his cheeks.&lt;br/&gt;\nThe meal he served was massive and exquisite, and he gave me a quirky smile as he placed the steaming plate in front of me.&lt;br/&gt;\n“I really hope you like paleo.”&lt;br/&gt;\nWhich part, or which animal, each delicacy of the meat-rich meal had come from, I didn’t ask. But it was clear that everything consisted of organs or waste offcuts; the faintly rubbery texture of liver and heart mixing pleasantly with fatty marrow gravy and blood sausage.&lt;br/&gt;\nBut what struck me even more than Jeremy’s cooking ability, was his ability to &lt;em&gt;eat&lt;/em&gt;. Plate after plate vanished into that scarecrow body, the mismatched bone china licked clean by his eager tongue. It belied belief that his shrunken stomach could hold so much, and I stopped eating long before he even slowed, unable to prevent myself from staring as he wolfed down even more.&lt;br/&gt;\nEventually there was nothing left, bar the scraps of meat on my own plate.  His eyes fastened on the congealing remains, ravenous and sly.&lt;br/&gt;\n“You gonna eat that?”&lt;br/&gt;\nWith a shake of my head, I pushed my leftovers across the table.&lt;br/&gt;\nHe sat for a while, silent but for his gut rumbling as he digested the epic feast. Anticipation bubbled somewhere beneath my own ribcage, as I waited for something to happen.&lt;br/&gt;\n“The next part isn’t very pleasant,” he cautioned, taking off his apron and shirt, “I just thought I’d warn you.”&lt;br/&gt;\nDumbly, I nodded as he walked bare-chested to the window, every bone in his torso a stark stripe of shadow. The balloon of his belly was shiny as a ripe boil in the moonlight as he rested it tenderly on the sill.&lt;br/&gt;\nHanging over the lintel, Jeremy opened his mouth and began to vomit.&lt;br/&gt;\nIt came out in a torrent, thick and bloody. The force of it even gushed twin jets from his nostrils. I heard a nearly subsonic moan escape from the boy as the geyser of puke pumped down the side of the house.&lt;br/&gt;\nFar below, under the trajectory from the window, a darkened split opened in the roof, quickly widening to an eager hole. A mouth, but one ringed with broken glass and chunks of brick for its grinding teeth.&lt;br/&gt;\nAnd into that maw the nutritious vomit poured. Jeremy fed the house just as a mother bird would feed her chick.&lt;br/&gt;\nIt was too much. The rich food was already sitting poorly in my stomach, and I felt my gut heave in sympathy, a brown slurry splattering the floor. Jeremy didn’t notice; his eyes were rolled back, showing only silvery whites, as the river of semi-digested food continued to flow.&lt;br/&gt;\nEventually it had to stop, and the wasted boy slumped sideways to the floor, his chin and chest caked with a bib of macerated offal.&lt;br/&gt;\nThe hole in the house closed with a &lt;em&gt;crack&lt;/em&gt; that made the entire spire shiver, and Jeremy opened one eye and regarded me weakly.&lt;br/&gt;\n“If you wouldn’t mind, could you carry me to bed?”  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nI cleaned up as best I could. I washed the dishes while the boy slept, ensconced in the tiny gabled attic above the kitchen, his gentle snores keeping me company.&lt;br/&gt;\nWhat this house was, I was no longer sure. At first I thought it offered each of us what we wanted, at a price. But the more I saw and the more I learned, the less this seemed true.&lt;br/&gt;\nIf I wanted to know what was truly going on, I would need to speak to the person who had resided here longer than anyone. The landlord.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\n&lt;em&gt;In the bowels of the building labours Tama Taeafai&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Shirt stained with the sweat of landlord and master&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;He hauls concrete and planks&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;To shore up the shanks&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Of the teetering house&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Made of edges and plaster&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nWhen he’s not labouring somewhere amongst the crumbling foundations, the landlord is often found in a little office at the end of the entry hall, one hand pressed to his forehead as he scribbles in his neat books. Not a man fond of technology, he barely tolerates a landline in the house, and is prone to long rants about the government if you even mention the possibility of Wi-Fi.&lt;br/&gt;\nHis slacks are always dusted grey with the cement he carries on his bony shoulders two bags at a time, ropy muscles wrestling each other beneath his sweat-soaked shirt. On a quiet night, you can hear the electric concrete mixer grinding away, and feel the faint thrumming through the floorboards, like something alive.&lt;br/&gt;\nApart from insisting that the rent is paid before nine o’clock in the morning every Monday, he seems an amiable enough fellow, and leaves us to our devices. If your kitchen tap breaks, he will fix it within the day, and if a window blows out in a storm, he’ll repair it pretty much immediately.&lt;br/&gt;\nAnd he must know exactly what the house is, and exactly what it does. I was absolutely &lt;em&gt;certain&lt;/em&gt; of that.&lt;br/&gt;\nThe door to the basement is always locked when he’s not down there. It’s a great white thing of reinforced wood with an imposing padlock. I did speculate that I could probably duplicate the key if I pressed a plasticine mould of it while he slept, but there was no need. I have found certain passages and pathways within the house that allow access to areas I shouldn’t be in; especially if one is mad enough to climb around the cliff-side of the house.&lt;br/&gt;\nAnd when I can’t afford my meds, or I just can’t bring myself to swallow them and the mania kicks in, I’m &lt;em&gt;more&lt;/em&gt; than mad enough.&lt;br/&gt;\nThe room that was taken by the sea, some fifteen years ago, still gapes open over the cliff like a wound that never heals. In the ruins of that place is a doorway, and that doorway leads to a boarded-up hallway, with a hatch in the floorboards.&lt;br/&gt;\nFrom there I found I could enter a duct, and crawl through it into the basement.&lt;br/&gt;\nIt&amp;#39;s cold down there, in the stone heart of the cliff, and the darkness lies heavy. A pullswitch turns on a single dim bulb, barely illuminating the cracked foundations of the house and the rough wooden beams that shore up the floors. In the corner crouches the bulbous shadow of the concrete mixer, its long electrical cable looping up the stairs to the power outlet that feeds it, and empty bags of cement are scattered everywhere, half-consumed by their own drifts of dust.&lt;br/&gt;\nAs I hunch in the half-light, there’s a hum and a whine, and the electric mixer turns on, loose chunks of cement clanking inside it.&lt;br/&gt;\n“In this house of edges,” says the landlord’s voice from the top of the stairs, “have you &lt;em&gt;never&lt;/em&gt; wondered which is your own precarious precipice?”&lt;br/&gt;\nHis long legs take the steep steps three at a time, his close-cropped hair grazing one of the support struts.  The strange shadows here distort perspective, and he seems impossibly tall, the angles of his limbs all wrong.&lt;br/&gt;\nFrightened and cornered, I glance around the room for another exit. The duct above me is too high to reach without assistance.&lt;br/&gt;\n“Well, have you?”&lt;br/&gt;\nThe concrete is cold against my back and my throat is drier than old cement dust.&lt;br/&gt;\n“It... the house balances my moods. It gives me things to do when I’m high, and it blanks out my lows.”&lt;br/&gt;\n“And what price do &lt;em&gt;you&lt;/em&gt; pay?”&lt;br/&gt;\n“I don’t know.”&lt;br/&gt;\nHis teeth are too white under the dim orange bulb, his smile unnerving.&lt;br/&gt;\n“See this crack?” He gestures with a broad brown hand at the sea-side wall, which drips glistening moisture. The crack runs floor to ceiling, widening at the base and arcing across the floor. Somewhere deep inside it, water sloshes in and out to the rhythm of the tide.&lt;br/&gt;\n“No matter how much concrete you pour into it, the damn thing won’t fill. A thousand bags I wasted, once upon a time, trying to solve the riddle.”&lt;br/&gt;\nHe’s directly in front of me now, looming over me. I can smell the rank sweat and the clinging dust as he places his arms on the wall either side of me.&lt;br/&gt;\n“You have a choice to make,” he says, his breath hot in my ear, “about that crack.”&lt;br/&gt;\nWith each syllable, I feel the darkness widen, watch the thin edge race across the concrete as it spreads.&lt;br/&gt;\n“If we don’t fill it soon, the house will fall and all of us with it.”&lt;br/&gt;\n“Then fill the damn thing, I won’t stop you!”&lt;br/&gt;\n“But with whom shall I fill it, dear Liza, dear Liza, but with &lt;em&gt;whom&lt;/em&gt; shall I fill it, dear Liza, with whom?”&lt;br/&gt;\nAnd it all makes a sudden, horrible sense. While Jeremy had been feeding second-hand food to the house, the landlord had been feeding it, too. With &lt;em&gt;human lives&lt;/em&gt;.&lt;br/&gt;\n“Why me? Why do I have to choose?”&lt;br/&gt;\n“Because that’s your price. That’s how you pay.”&lt;br/&gt;\n“The girl who had the room before me, the dancer. Who did she choose?”&lt;br/&gt;\nThe landlord’s smile flickers and dies, like his bulb has blown a fuse.&lt;br/&gt;\n“She didn’t choose.”&lt;br/&gt;\nThe floor shudders under our feet, and a cold wind howls out of the crack.&lt;br/&gt;\nClosing my eyes, I speak a single name.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\n&lt;em&gt;In her new rooms dances one Liza Ledger&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;So spacious and safe the ground floor&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;She keeps records of sins,&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Of all losses and wins&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;And when they don’t balance&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;She must settle the score&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;br/&gt;\nI think the others know about the power I now wield.&lt;br/&gt;\nMary is still friendly, but it’s careful and deferent, like someone speaking to a minister or judge - and in a way, I suppose that’s what I am. While the house is a living creature in its own strange way, it still requires human eyes and ears to keep track of its residents; to ensure that the pendulum never swings too far in either direction for any of the souls that make up its organs.&lt;br/&gt;\nI can feel every one of them, the others who tipped the balance. Those who became part of the foundations. Each of them thought they could beat the system, that they could take more from the house than it gave – and for a while, some of them did.&lt;br/&gt;\nThey rattle their concrete chains, deep within the filled-in chasm, bones through cement, hair mixed with stone. I don’t feel any sympathy for them. They knew the price, and they ultimately paid in full.&lt;br/&gt;\nI think my own price is worth it, and it comes with some perks. Ruby agrees; she says my new uniform is very beautiful, the dress fits like it was tailored for me. Oh, she’ll need to wash it a few more times before the smell of formaldehyde comes out. &lt;/p&gt;\n\n&lt;p&gt;But I’ve always loved orange and yellow, and it swirls so beautifully when the polka plays.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The house is never empty.  \nI listen to the other inhabitants leave, heavy feet on the dilapidated stairs, voices receding, swallowed by the wood and plaster of the long corridors. Even after those sounds have dissipated, and I am left here alone, I can *feel* those who lived here before. Many essences suffuse the bones of this sprawling manor.  \nThere are far more rooms than current residents, as the house isn’t exactly the most desirable living space. It hunches on the edge of a cliff at the end of a cul-de-sac, and one might think it the sort of place to which the hip and wholesome would flock, for romantic sea-views and artful isolation.  \nBut were you to view the house yourself, you’d soon see why they don’t.  \nThe landlord, a tall, skeletal man of Polynesian descent, told me that it was once called ‘Hedges House’. It was a beautiful place in its heyday, surrounded by thick privet and spreading elms, their boundary boscage concealing interior gardens rampant with camellias; almost maze-like in their placement.  \nBut time was not kind to the lands around the house. One coastal storm too many had eaten away the land behind it, bringing the edge of the cliff creeping ever closer. Eventually, the owners had abandoned it, finally moving out when only a narrow strip of grass separated the walls of the house from the fifty-foot precipice.  \nThat had been more than twenty years ago, and hungry erosion had since claimed even that strip of sward. On the stony beach below the house, lathes of timber and chunks of plaster bleached in the salty air, the cliff having claimed the outermost room of the house – a solar or conservatory perhaps.  The glass from its windows was now smooth, transparent jewels, tumbled by the lashing tides.  \nNo one in their right mind would live in a crumbling house teetering on the edge of such a deathly fall. But then, not a single soul living here can be called sane.\n\n&amp;nbsp;  \nIn a piquant display of irony, someone had knocked out the first ‘H’ from the rusted wrought-iron gate that sat across the gap in the outer hedge; so that it read ‘edges House’.  \nI’d moved here due to financial constraints, as the house was by far the cheapest place around for the size of the rooms. I think the door to my second-floor abode was lime green when I first moved in, but in a curious twist of fate, the paint had slowly flaked away until it revealed an undercoat of vibrant yellow-orange, my favourite colour. Things like that seemed to just *happen* in the house, and over time you stopped questioning it, as each coincidence seemed harmless enough. My room was spacious, airy and high-ceilinged. The regular pattern of scuffmarks that scarred the wooden floorboards made me speculate whether the previous occupant had been a dancer, a theory borne out by a bloody-toed ballet shoe I found behind the ancient steel oil heater. The windows were huge and arched, letting in all the blue-white light reflecting off the ocean below the cliff.  \nThat first night was a hard one. I’d moved in during a manic phase, the newest medication still finding its way through the maze of my brain, and I’d cleaned the room all day until my body, at least, was exhausted. But lying in the unfamiliar single bed that night, springs creaking beneath me, sleep did not come. Instead, my ears betrayed my racing mind by picking up and amplifying every sound the house made, and it made plenty.    \nOh, it creaked and it *groaned* - so loudly that I feared some part of it was alive and in pain, imminently collapsing. When something snapped, forcefully and abruptly, sending a shudder through the entire place, I could bear no more. I ran down the darkened stairwell in my pyjamas, weeping in terror and hoping that I would make it out before the whole house tumbled over the cliff.  \nBut it did not fall.  \nIt seemed so impossible that it still stood, I could not bring myself to go back inside. So I stood there in the tangled camellia garden, shivering with fear, looking up at the strange hodgepodge of windows that peppered the outside of the manor.  \nThe scent of tobacco wafted through the air, and a woman’s warm voice called from the edge of the light near the front door,  \n“It’s naught to worry about, love. The house is always shifting, making strange noises. If it was going to fall down, it would have done so long, long ago.”  \nAnd that’s how I met Mary Mudgeway.  \n\n&amp;nbsp;  \n\n------------------\n\n&amp;nbsp;  \n*In the flat next door lives one Mary Mudgeway*  \n*Hanging half in the hall and half in her door*  \n*She stands there for sailors*  \n*Who came for her favours*  \n*In the days of her past*  \n*But don’t anymore*\n\n&amp;nbsp;  \nI’ve never been a smoker, but I became one after Mary befriended me. She gifted me her spare pipe, and we would pack the bowls with a fragrant blend of her own making and puff away like a pair of Victorian gentlemen, watching the sun set over the peninsula.  \nStuck somewhere between old and young, Mary was still beautiful in a faded way, like a dried blossom hanging forgotten in a florist’s shop. When she smiled, the crow’s feet multiplied, and when she spoke, a web-work of lines tugged at her lips, themselves plumped with products made from bee venom and lemon.  \nShe said she still had a few clients who came to her, but as her body had betrayed her by ageing, most of the work had faded away. Having never learned another trade and suffering extreme dyslexia, Mary had chosen the house for the same reasons as the rest of us; the rooms were large and the rent was low.  \nOne night, as we chuffed sweet herbs by the porch, she asked me if I’d ever made love to another woman and delicately placed a hand on the curve of my hip. The gesture had thrilled me briefly, but through beetroot blushes, I told her that I didn’t feel that way about women.  \nLong after she had gone, I could still feel the heat of her palm where it had grazed me. I climbed the gap-toothed spiral stairs to the balcony on the corner of the third floor, where you could see into the windows along the southwest wall of the house. Mary undressed languidly and sensually, as though quite aware she was being observed. Slipping on a gown of faded coral silk, she opened her window wide.  \nFor a moment, I thought she was going to jump; that she’d had enough of life and the crumbling house. I may even have been vain enough to wonder whether my rejection had been the last straw – but instead she just waited there, the breeze from the ocean stirring the hems of her robe.  \nAnd it was then that I smelled the change.  \nRank with the reek of dead fish, the air turned foul. Rising up from the stony beach below, the fingers of the stench curled around the balcony and gripped my throat, making me gag. Decay and sweet rot, dusted with the sharp mustiness of rotting seaweed.  \nMary saw him before I did, her head tracking him as he lurched up the rocks and dug strong fingers into the face of the cliff. A stinking man, his oil-skin coat and hat in greasy, fluttering tatters. Paralysed, I watched with guilt and trepidation as he scaled the precipice, then, gifting a final waft of death to the night air, he hauled himself through Mary’s window.  \nI saw her step in, and I saw her lips brush the grey flesh under his hat. So gently and tenderly she undressed him, removing first the heavy coat, then the sea-battered woollen rags he wore beneath – until the pallid, naked corpse of a sailor stood before her. His ragged, crab-eaten erection stood proudly below the cavity where his organs had once clustered, long gone to the creatures of the deeps.  \nI’d like to tell you that I was not such a voyeur that I watched an undead sailor ravage my neighbour, but that would be a lie. Spellbound with horror, I watched as Mary expertly plied her trade, and when the lusty corpse was done, I watched him place a pile of tarnished silver coins in her shaking hands, then leave the same way that he arrived.  \nI understood then exactly why Mary had made a pass at me; for if her bed had been full that night, there would have been no room for dead men.  \nAnd she knew I had no access to any sunken treasure to pay for her services, even if I’d wanted to.  \n\n&amp;nbsp;  \n\n------------------\n\n&amp;nbsp;  \n*Down on the first floor dwells a Petr Petrowski*  \n*Bald as an egg and skin thin as a caul*  \n*“Not catching” he told me*  \n*Of his wasting malady*  \n*But other than that*  \n*Never speaks much at all*  \n\n&amp;nbsp;  \nWhen first I chanced upon Petr, I thought him some kind of ghoulish spirit wandering the house.  Shamefully, I squealed in fear rather than saying hello, then ran to Mary – who told me the gaunt man was a resident, not a revenant.  \nWith a thick Polish accent and very little command of English, he was a quiet man who kept mostly to his rooms, which had an outer door to the gardens and a peeling veranda. Some days his skin had more colour, but his general pallor spoke of some grave illness, as did the great dark circles that bruised the pouches beneath his watery blue eyes.  \nWhen the hearse pulled up outside his door, I assumed the mystery illness had finally bested him, and he had finally shuffled off this mortal coil. But instead, Petr hauled his grey-suited bones from the driver’s seat, quite alive. I admit I enjoyed the black humour of a man so close to the edge of death working *with* the dead. Anyone stumbling into his workplace might think him a client, not a mortician.  \nAs I understood it, his work was sparse. Exclusively serving the local Polish community, he lived off their deaths like some ancient, bald vulture, hauling bodies home to the house where he meticulously embalmed them. Whenever he had a client, the eye-watering stink of potent chemicals wafted up from his church-like windows.  \nHe seemed an ascetic and antisocial man. But one restless night when my mania would not let me sleep, I crept down to the gardens for a pipe of Mary’s sweet herbs, and rather than formaldehyde fumes, *music* and *laughter* was emanating from Petr’s steepled windows.  \nPeeking through the warped stained glass, I chanced a glimpse of him inside. He was dancing as if illness had never once visited him.  A tall woman, resplendent in an orange and yellow dress, pressed her rosy cheek to his grey flesh as they turned about the floor, and her pin-up curls shone golden in the candlelight.  \nThat old Petr was such a ladies’ man, who would have guessed? As my weeks in the house turned to months, I observed three different women in his room at night.  None visited more than once, and stranger still, each wore the same bright dress.  \nThere was a story here that needed to be written; a mystery that needed unravelling.  \nI watched him for days; coming and going in his great black car. When eventually he hauled a heavy coffin from the back of the hearse and wheeled it into his little workshop, I decided to brave the fumes. With a handkerchief knotted around my face, I peered through the crack of the opened window.  \nThe deceased was a woman, and I watched as Petr carefully and reverently prepared her body. When he methodically laid out a dozen old-fashioned hair curlers, and draped an orange and yellow dress over the back of a chair, I felt a preternatural thrill shoot up my spine.  \nIn his tiny kitchen, Petr had set a table for two, complete with guttering candles and large glasses of scarlet wine. He gently arranged the dead woman in her seat, then put the needle down on a battered record player and took his place opposite her as a scratchy violin began to play.      \nFor many long minutes, they sat there, the half-dead man and the all-dead woman.  \nThen, with a small sigh and a tilt of her head, colour blushed her cheeks and she opened her eyes.  \nAs though this were a perfectly ordinary thing, Petr began to speak in his own language. Gone was the halting, broken English; in his mother tongue, his voice was lyrical, deep and hypnotic. Even from my hidden perch by the window, its resonance sent pleasant tingles across my scalp and down the nape of my neck. I suddenly wanted Petr’s lips to whisper mysterious words against my skin.  \nThey drank, and they laughed. Her hand brushed his, and they shared a kiss. The record changed, and they danced to some lively polka, the orange and yellow dress swirling about her hips and their mouths meeting more and more often – until he picked her up in arms that no longer trembled with illness and he carried her through the door to his bedroom.  \n\n&amp;nbsp;  \nIn the morning, the bright dress was hung in a locked closet, and the woman’s body wheeled back out to the hearse, dead as cold wax once more. I returned to my room, to write down what I had seen, perplexed by the events that I had observed.  \nHad I not already witnessed Mary’s tryst with the dead sailor, I might have written the whole incident off as delusions born of a formaldehyde-addled nightmare. But I knew that there was something highly unnatural happening in this house, some uncanny power at work.  \nAnd I needed to know *more*.\n\n&amp;nbsp;  \n\n------------------\n\n&amp;nbsp;  \n*The Ransoms are fighting, a clattering racket*  \n*Thrown pans and dishes hit the walls and the floor*  \n*No children in evidence*  \n*In their first floor residence*  \n*Just a man and his wife*  \n*In perpetual war*\n\n&amp;nbsp;  \nWe all heard the Ransoms fighting. When the wind blew from the south, it was unavoidable; the breeze pushed their shouted imprecations back through our windows and made us all cringe.  \n“She should leave him,” said Mary, as we drank tea in my kitchen, her comforting presence soothing my nerves as much as the hot brew.    \nThere’s no doubt that she’s right, and yet Ruby and Robbie stay together, despite the incendiary hatred that fills their part of the house. He’s a tall, thrust-jawed man with a widower’s peak, and his heavy workman’s boots thump up and down the stairs like artillery warning that the fighting will shortly begin.    \nThere’s always a good ten minutes of calm after he comes home – a golden window of silence where neither husband nor wife says anything to one another, and all we hear is the bang of pipes from their shower while he sluices off the dust and grime from the demolition sites he works on.  \nOh, they don’t *always* fight; sometimes there are ordinary conversation and dinner sounds, which are quickly followed by some of the loudest fucking I’ve ever heard in my life. He grunts and bawls like a rabid hog, and she screams, while the headboard smashes into the walls until my lampshade starts to swing in time to their rhythm.  \nYou don’t see Ruby very often, usually only at night and in the weekends. She’s a delicate thing, long dark hair framing a pale face and bruised red lips, her waspish, hourglass frame the exact opposite of her husband’s hulking, brutish trapezoid.  \nTheir domestic disputes seem to revolve around the fact that Robbie works hard and expects Ruby to fulfil all her ‘wifely duties’ to his satisfaction on his return home. In turn, she resents being locked away all day, her whole existence captive to his whims and desires.  \nWhy she didn’t just leave him was another, albeit more prosaic, kind of mystery. Every time I passed her during my sleepless explorations of the strange house, I would feel a pang of guilt that I wasn’t doing anything to help her.  \nWhen I lost a whole night of precious sleep to her screaming “No, no NO!” during one of their hours-long fucking sprees, concern and compassion finally overcame my complacency. I decided I was going to *do* something.\n\n&amp;nbsp;  \nI knocked until my knuckles were bruised, listening for any signs of life inside the Ransom’s quarters, but not a sound betrayed the presence of anyone inside.  \nRobbie was at work, I had listened to his boots stomping away hours ago. I knew that he locked the door fast behind him, so if Ruby wished to leave, her only egress would be a precarious climb down the ramshackle side of the house over the cliff.  \nI was angry now, angry enough to do something stupid. When I’m in one of my ‘high’ phases, I need to do things, to change the world around me; to frenetically create or destroy. In this instance, being denied entry to their rooms was the focus of my frustration and determination.  \nThe room beside theirs was empty; full of flattened cardboard boxes and broken furniture, but the windows were wide enough to climb out. Clinging to the side of the house, laughing wildly into the wind at the terrifying drop to the beach below me, I swung around the exterior and crabbed along the narrow ledge until I reached their rickety balcony.  \nA single, lonely chair sat upon it, warped by the weather.  \nInside, their apartment was a curious duality; one side of the windows was draped with lacy curtains, while the opposite side was shaded by old bamboo blinds, dusty and bug-eaten. Men’s clothing was strewn about the lounge, but shelves and hooks meant for books and crockery held only women’s clothing; washed, ironed, and neatly folded or hung. To the left of the bathroom sink was an impressive array of neatly placed cosmetics and beauty products, while the right side of the porcelain unit held only a bar of abrasive soap and a pungent tub of Swarfega, both sitting in a pool of greasy grime.  \nIn a water-spotted glass behind the sink sat a single toothbrush.  \nThe door to the bedroom was closed. I vividly imagined that beyond it suffered Ruby, bound and gagged, cuffed to one of the steel radiators ubiquitous to the house. Or worse, no longer suffering, lying murdered in a pool of her own blood.  \nGritting my teeth, I pushed open the door to see only a drooping, single bed, narrow and empty. Now I didn’t know what to think.  \nIt was as if Ruby didn’t exist.  \nBefore I could pry further, or stop to muse on what exactly was happening here, the sound of heavy, angry steps began thumping up the stairs.  \nRobbie was home early.  \nThere was no way I could make it out over the balcony in time. I’d have to resort to the age-old trope of hiding in the wardrobe, hoping that I could make my escape while he showered.  \nI waited in the camphor darkness, listening to Robbie undressing, muttering to himself. The shower came on, a stutter of ancient pipes in the wall near my head making me jump. Incongruously, Robbie’s hateful voice began to sing a Broadway showtune, and I crept out of my hidey-hole.  \nThen something odd and miraculous happened.  \nAs I listened, his voice rose one octave, then another. Before another three bars were done, the beautiful soprano voice of Ruby rang out clearly from the bathroom.  \nThe door was ajar, and pressing my eye to it, I saw only one body in the shower – the pale curves of the diminutive wife shrouded in the steam.  \n“Ruby!” I hissed, my original plan back in action.  \nShe froze, her voice dying away.  \n“Who’s there?”  \n“The girl from the second floor, we pass on the stairs sometimes.”  \n“What are you doing in here?”  \n“I came to help you! I came to talk to you about Robbie. Where is he?”  \nThe door opened, and Ruby stared out at me. She was stark naked, her hair beading water on skin so translucent she seemed slightly transparent, and her dark eyes were huge.  \n“You have to get out before he comes back.”  \n“What do you mean?”  \n“Look at the balcony.”  \nThrough the cloudy glass of the double-doors, I saw the single chair I’d passed on the way in. But now a *shadow* sat in it, roughly the size and shape of Robbie – and as I watched, it grew more solid, more substantial and *real*.  \n“I don’t understand.”  \nUnselfconscious, she began to move about the lounge, picking out clothes from the neat, feminine piles.  \n“He’s not real. He’s the person I have to be, during the day, to survive. *This* is the real me. But I can only exist in this house, do you understand?”  \nThe shadow on the balcony turned its head, resolving smears of dark eyes and a bulging jaw now, insubstantial fists clenching and unclenching.  \n“He’ll kill you if he realises you’re here,” she hissed, “you need to *get out!*”  \nAnd so, fear and confusion lending me speed, I fled.  \n\n&amp;nbsp;  \nI’ve seen her since, on the stairs and in the garden, those great expressive eyes pleading me not to tell anyone, not to expose her secret. I think that when Robbie sleeps, she can exist alone, and that’s why she lets him beat her and rape her in that sagging single bed. Perhaps after he has expended his towering rage and frustration, after he has grunted his seed into her, he becomes a shadow and fades away, only reappearing when dawn breaks over the side of the house.  \nLike all of us here, Ruby has found a precarious balance that allows her to exist.  \nI think, for me, her price would be too high.\n\n&amp;nbsp;  \n\n------------------\n\n&amp;nbsp;  \n*In the south-western spire dwells Jeremy Jackson*  \n*Green-painted nails and tufted, spiked hair*  \n*As a butcher’s apprentice*  \n*Hands red to the wrist*  \n*He hauls bags of offal*  \n*Leaving stains on the stairs*  \n\n&amp;nbsp;  \nThere are always seagulls circling the spire on the corner of the house, and I don’t know how Jeremy stands it. Their incessant calls would drive me mad, and I think before long I’d borrow the slug-gun the landlord uses on rats, and I’d blast every screeching bird out of the sky.  \nWith carefully drawn eyebrows, twin lip piercings, and a hint of a lisp, Jeremy’s sexuality is proudly on display to the world, almost as obvious as his ribs. Thin to the point of painful, his wrists like cotton-reels, any whispers of ‘gay’ behind his back are probably less frequent than hushed murmurs of ‘anorexia’.  \nStill, having run the gamut of eating disorders myself, I’m not one to judge. And Jeremy seems happy enough, living alone in his crumbling tower like the queerest wizard of them all. We have a sort of unspoken friendship that is quite different from the one I share with Mary. As an artist of rotating disciplines, my own colourful appearance seemed to mark me instantly as the sort of person Jeremy can count on as an ally.  \nSometimes he’ll join Mary and me for a pipe, though the pungent tang of his own smoke tells me that his blend is much less legal than ours. He always offers me a puff, of course, but I decline. Experience taught me long ago that weed wreaks merry havoc with my medication, and the immediate hazy benefits aren’t worth the suicidal lows that follow.  \nHow he survives as a butcher’s apprentice – let alone how he got the job in the first place – is quite beyond me. But I *do* know that he is very good at it, and he really seems to enjoy it, even though it pays a pittance.  \nAnd there’s an added bonus, worth more than money, as far as Jeremy is concerned. He gets to take home all the offal he can carry.  \nFor quite a long time, I couldn’t figure out what his secret was, what fell bargain he had struck with the House. All the rest of us had found a knife-edge to balance upon, so what was his?  \nEmboldened by my other discoveries, and suspecting Jeremy’s very feyness might predispose him to know what I was talking about, I decided to simply ask him.  \nGreen eyes regarded me levelly, then he replied quietly,  \n“I feed it.”  \n“How?” I wondered.   \n“Come by tonight, after sundown, and I’ll show you.”  \n\n&amp;nbsp;  \nThe stairs grew dusty the higher I climbed, and mildew spread a dark patina across the ancient plaster walls. To reach the spire, you had to briefly exit the main part of the manor, braving the walk across a narrow span of crumbling brick. The rusted iron rails to either side would be no help at all should the wind roaring around you get its wish to throw you off.  \nStains spattered the bricks, bloody and bold, a slippery reminder of Jeremy’s grisly trade in animal flesh. I wondered just how many double-bagged bundles of gore had been dragged over the causeway, and how often he had nearly fallen.    \nThe pea-green door opened at my touch, revealing a neat room that had been largely converted to a kitchen. Gas bottles and a stove sat to one side, and a large wooden table dominated the rest of the spire, well-scarred with knife-marks.    \nBut what I truly noticed first were the smells.  \nSeveral huge pots were bubbling on the gas stove, vats of broths and gravies, which Jeremy stirred by turns as he waved hello with the other emaciated hand. Inside the oven, large baking dishes lurked – a waft of rich meats made me salivate as he opened the door to prod something with a skewer.  \n“Right on time,” he said, unfamiliar colour in his cheeks.  \nThe meal he served was massive and exquisite, and he gave me a quirky smile as he placed the steaming plate in front of me.  \n“I really hope you like paleo.”  \nWhich part, or which animal, each delicacy of the meat-rich meal had come from, I didn’t ask. But it was clear that everything consisted of organs or waste offcuts; the faintly rubbery texture of liver and heart mixing pleasantly with fatty marrow gravy and blood sausage.  \nBut what struck me even more than Jeremy’s cooking ability, was his ability to *eat*. Plate after plate vanished into that scarecrow body, the mismatched bone china licked clean by his eager tongue. It belied belief that his shrunken stomach could hold so much, and I stopped eating long before he even slowed, unable to prevent myself from staring as he wolfed down even more.  \nEventually there was nothing left, bar the scraps of meat on my own plate.  His eyes fastened on the congealing remains, ravenous and sly.    \n“You gonna eat that?”  \nWith a shake of my head, I pushed my leftovers across the table.  \nHe sat for a while, silent but for his gut rumbling as he digested the epic feast. Anticipation bubbled somewhere beneath my own ribcage, as I waited for something to happen.  \n“The next part isn’t very pleasant,” he cautioned, taking off his apron and shirt, “I just thought I’d warn you.”  \nDumbly, I nodded as he walked bare-chested to the window, every bone in his torso a stark stripe of shadow. The balloon of his belly was shiny as a ripe boil in the moonlight as he rested it tenderly on the sill.    \nHanging over the lintel, Jeremy opened his mouth and began to vomit.  \nIt came out in a torrent, thick and bloody. The force of it even gushed twin jets from his nostrils. I heard a nearly subsonic moan escape from the boy as the geyser of puke pumped down the side of the house.  \nFar below, under the trajectory from the window, a darkened split opened in the roof, quickly widening to an eager hole. A mouth, but one ringed with broken glass and chunks of brick for its grinding teeth.  \nAnd into that maw the nutritious vomit poured. Jeremy fed the house just as a mother bird would feed her chick.  \nIt was too much. The rich food was already sitting poorly in my stomach, and I felt my gut heave in sympathy, a brown slurry splattering the floor. Jeremy didn’t notice; his eyes were rolled back, showing only silvery whites, as the river of semi-digested food continued to flow.  \nEventually it had to stop, and the wasted boy slumped sideways to the floor, his chin and chest caked with a bib of macerated offal.  \nThe hole in the house closed with a *crack* that made the entire spire shiver, and Jeremy opened one eye and regarded me weakly.  \n“If you wouldn’t mind, could you carry me to bed?”  \n\n&amp;nbsp;  \nI cleaned up as best I could. I washed the dishes while the boy slept, ensconced in the tiny gabled attic above the kitchen, his gentle snores keeping me company.  \nWhat this house was, I was no longer sure. At first I thought it offered each of us what we wanted, at a price. But the more I saw and the more I learned, the less this seemed true.  \nIf I wanted to know what was truly going on, I would need to speak to the person who had resided here longer than anyone. The landlord.\n\n&amp;nbsp;  \n\n------------------\n\n&amp;nbsp;  \n*In the bowels of the building labours Tama Taeafai*  \n*Shirt stained with the sweat of landlord and master*  \n*He hauls concrete and planks*  \n*To shore up the shanks*  \n*Of the teetering house*  \n*Made of edges and plaster*  \n\n&amp;nbsp;  \nWhen he’s not labouring somewhere amongst the crumbling foundations, the landlord is often found in a little office at the end of the entry hall, one hand pressed to his forehead as he scribbles in his neat books. Not a man fond of technology, he barely tolerates a landline in the house, and is prone to long rants about the government if you even mention the possibility of Wi-Fi.  \nHis slacks are always dusted grey with the cement he carries on his bony shoulders two bags at a time, ropy muscles wrestling each other beneath his sweat-soaked shirt. On a quiet night, you can hear the electric concrete mixer grinding away, and feel the faint thrumming through the floorboards, like something alive.  \nApart from insisting that the rent is paid before nine o’clock in the morning every Monday, he seems an amiable enough fellow, and leaves us to our devices. If your kitchen tap breaks, he will fix it within the day, and if a window blows out in a storm, he’ll repair it pretty much immediately.  \nAnd he must know exactly what the house is, and exactly what it does. I was absolutely *certain* of that.  \nThe door to the basement is always locked when he’s not down there. It’s a great white thing of reinforced wood with an imposing padlock. I did speculate that I could probably duplicate the key if I pressed a plasticine mould of it while he slept, but there was no need. I have found certain passages and pathways within the house that allow access to areas I shouldn’t be in; especially if one is mad enough to climb around the cliff-side of the house.  \nAnd when I can’t afford my meds, or I just can’t bring myself to swallow them and the mania kicks in, I’m *more* than mad enough.  \nThe room that was taken by the sea, some fifteen years ago, still gapes open over the cliff like a wound that never heals. In the ruins of that place is a doorway, and that doorway leads to a boarded-up hallway, with a hatch in the floorboards.  \nFrom there I found I could enter a duct, and crawl through it into the basement.  \nIt's cold down there, in the stone heart of the cliff, and the darkness lies heavy. A pullswitch turns on a single dim bulb, barely illuminating the cracked foundations of the house and the rough wooden beams that shore up the floors. In the corner crouches the bulbous shadow of the concrete mixer, its long electrical cable looping up the stairs to the power outlet that feeds it, and empty bags of cement are scattered everywhere, half-consumed by their own drifts of dust.  \nAs I hunch in the half-light, there’s a hum and a whine, and the electric mixer turns on, loose chunks of cement clanking inside it.  \n“In this house of edges,” says the landlord’s voice from the top of the stairs, “have you *never* wondered which is your own precarious precipice?”  \nHis long legs take the steep steps three at a time, his close-cropped hair grazing one of the support struts.  The strange shadows here distort perspective, and he seems impossibly tall, the angles of his limbs all wrong.  \nFrightened and cornered, I glance around the room for another exit. The duct above me is too high to reach without assistance.  \n“Well, have you?”  \nThe concrete is cold against my back and my throat is drier than old cement dust.  \n“It... the house balances my moods. It gives me things to do when I’m high, and it blanks out my lows.”  \n“And what price do *you* pay?”  \n“I don’t know.”  \nHis teeth are too white under the dim orange bulb, his smile unnerving.  \n“See this crack?” He gestures with a broad brown hand at the sea-side wall, which drips glistening moisture. The crack runs floor to ceiling, widening at the base and arcing across the floor. Somewhere deep inside it, water sloshes in and out to the rhythm of the tide.  \n“No matter how much concrete you pour into it, the damn thing won’t fill. A thousand bags I wasted, once upon a time, trying to solve the riddle.”  \nHe’s directly in front of me now, looming over me. I can smell the rank sweat and the clinging dust as he places his arms on the wall either side of me.  \n“You have a choice to make,” he says, his breath hot in my ear, “about that crack.”  \nWith each syllable, I feel the darkness widen, watch the thin edge race across the concrete as it spreads.  \n“If we don’t fill it soon, the house will fall and all of us with it.”  \n“Then fill the damn thing, I won’t stop you!”  \n“But with whom shall I fill it, dear Liza, dear Liza, but with *whom* shall I fill it, dear Liza, with whom?”  \nAnd it all makes a sudden, horrible sense. While Jeremy had been feeding second-hand food to the house, the landlord had been feeding it, too. With *human lives*.  \n“Why me? Why do I have to choose?”  \n“Because that’s your price. That’s how you pay.”  \n“The girl who had the room before me, the dancer. Who did she choose?”  \nThe landlord’s smile flickers and dies, like his bulb has blown a fuse.  \n“She didn’t choose.”  \nThe floor shudders under our feet, and a cold wind howls out of the crack.  \nClosing my eyes, I speak a single name.\n\n&amp;nbsp;  \n\n------------------\n\n&amp;nbsp;  \n*In her new rooms dances one Liza Ledger*  \n*So spacious and safe the ground floor*  \n*She keeps records of sins,*  \n*Of all losses and wins*  \n*And when they don’t balance*  \n*She must settle the score*\n\n&amp;nbsp;  \nI think the others know about the power I now wield.  \nMary is still friendly, but it’s careful and deferent, like someone speaking to a minister or judge - and in a way, I suppose that’s what I am. While the house is a living creature in its own strange way, it still requires human eyes and ears to keep track of its residents; to ensure that the pendulum never swings too far in either direction for any of the souls that make up its organs.    \nI can feel every one of them, the others who tipped the balance. Those who became part of the foundations. Each of them thought they could beat the system, that they could take more from the house than it gave – and for a while, some of them did.  \nThey rattle their concrete chains, deep within the filled-in chasm, bones through cement, hair mixed with stone. I don’t feel any sympathy for them. They knew the price, and they ultimately paid in full.  \nI think my own price is worth it, and it comes with some perks. Ruby agrees; she says my new uniform is very beautiful, the dress fits like it was tailored for me. Oh, she’ll need to wash it a few more times before the smell of formaldehyde comes out. \n\nBut I’ve always loved orange and yellow, and it swirls so beautifully when the polka plays.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65tob2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 188, "report_reasons": null, "author": "Cymoril_Melnibone", "saved": false, "mod_reports": [], "name": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "approved_by": null, "over_18": false, "domain": "self.nosleep", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rm4d", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "trophy", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nosleep/comments/65tob2/house_of_edges/", "num_reports": null, "locked": false, "stickied": false, "created": 1492434081.0, "url": "https://www.reddit.com/r/nosleep/comments/65tob2/house_of_edges/", "author_flair_text": "Jan. 2016", "quarantine": false, "title": "House of Edges", "created_utc": 1492405281.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 188}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdathn", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "amyss", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "It's perfect. All your stories are a serious cut above but this morsel was even more amazing than the usual fantastic stories. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s perfect. All your stories are a serious cut above but this morsel was even more amazing than the usual fantastic stories. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdathn", "score_hidden": false, "stickied": false, "created": 1492448952.0, "created_utc": 1492420152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdaq10", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "2BrkOnThru", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "A beautifully written tale that is hauntingly poetic in both rhyme and verse.\nI suppose it only fitting that a necromancer restore the equilibrium to a house on the very precipice of demise. The sea will never forgive the house that balances above it or stop sending it's angry waters to assail the strange crack in the precarious foundation that holds it. The house of the hedges became the house of the edges that teeters on ledges for which you have made pledges. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A beautifully written tale that is hauntingly poetic in both rhyme and verse.\nI suppose it only fitting that a necromancer restore the equilibrium to a house on the very precipice of demise. The sea will never forgive the house that balances above it or stop sending it&amp;#39;s angry waters to assail the strange crack in the precarious foundation that holds it. The house of the hedges became the house of the edges that teeters on ledges for which you have made pledges. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdaq10", "score_hidden": false, "stickied": false, "created": 1492448612.0, "created_utc": 1492419812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdcozo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "undercoverburger", "parent_id": "t1_dgd7pmv", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "I thought so too! A thriller! I was imagining a more eerie version of Ms. Peregrine's Home For Peculiar Children, creepy but a fun ride. Wouldn't be surprised if this inspires a movie of some sort.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought so too! A thriller! I was imagining a more eerie version of Ms. Peregrine&amp;#39;s Home For Peculiar Children, creepy but a fun ride. Wouldn&amp;#39;t be surprised if this inspires a movie of some sort.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdcozo", "score_hidden": false, "stickied": false, "created": 1492455168.0, "created_utc": 1492426368.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7pmv", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "OrangeChickenAnd7Up", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Holy hell, this was captivating from start to finish. I love your writing style, and the level of detail was perfect- not so in-depth that it became droll, but still able to vividly paint a haunting picture. This had such an enchanting air of mystery, complimented by a grim, yet almost serene, underlying sense of unease. The poems separating each chapter were a very nice touch, as well. You really don't see writing like this anymore, especially in horror.\n\nThis needs to be....something. A movie seems too condensed. A mini-series, perhaps? Or an entry in a published series of short stories? This almost reminded me of something you might see in American Horror Story, but better. Wow.", "edited": 1492411410.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy hell, this was captivating from start to finish. I love your writing style, and the level of detail was perfect- not so in-depth that it became droll, but still able to vividly paint a haunting picture. This had such an enchanting air of mystery, complimented by a grim, yet almost serene, underlying sense of unease. The poems separating each chapter were a very nice touch, as well. You really don&amp;#39;t see writing like this anymore, especially in horror.&lt;/p&gt;\n\n&lt;p&gt;This needs to be....something. A movie seems too condensed. A mini-series, perhaps? Or an entry in a published series of short stories? This almost reminded me of something you might see in American Horror Story, but better. Wow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd7pmv", "score_hidden": false, "stickied": false, "created": 1492439839.0, "created_utc": 1492411039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdc5bs", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "hongvanngh", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Jeremy sound alot like Simon from Faerie Town. Are they relate?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jeremy sound alot like Simon from Faerie Town. Are they relate?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdc5bs", "score_hidden": false, "stickied": false, "created": 1492453456.0, "created_utc": 1492424656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgd7kqp", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "DemonsNMySleep", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "The most beautiful and interesting story I've read all week. Bravo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The most beautiful and interesting story I&amp;#39;ve read all week. Bravo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgd7kqp", "score_hidden": false, "stickied": false, "created": 1492439537.0, "created_utc": 1492410737.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdhvgq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Iloveagoodscare", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": " this was beautifully written. It could be a full-length book if you just added some extra characters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this was beautifully written. It could be a full-length book if you just added some extra characters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdhvgq", "score_hidden": false, "stickied": false, "created": 1492465754.0, "created_utc": 1492436954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdfl9h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "umbraibis", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This is hauntingly beautiful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is hauntingly beautiful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdfl9h", "score_hidden": false, "stickied": false, "created": 1492461956.0, "created_utc": 1492433156.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdfzl9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "morganethielen", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Beautiful and creepy. Thanks for sharing! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Beautiful and creepy. Thanks for sharing! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdfzl9", "score_hidden": false, "stickied": false, "created": 1492462680.0, "created_utc": 1492433880.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdnma2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sasstronaut7", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This was so captivating and hauntingly beautiful. It read like a poem, both tragic and thrilling. One of the most interesting and beautiful things I've read in a long time. Thank you. &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was so captivating and hauntingly beautiful. It read like a poem, both tragic and thrilling. One of the most interesting and beautiful things I&amp;#39;ve read in a long time. Thank you. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdnma2", "score_hidden": false, "stickied": false, "created": 1492473109.0, "created_utc": 1492444309.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdtuzp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CanadianMuse", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This is fantastic! But I love all your stories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is fantastic! But I love all your stories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdtuzp", "score_hidden": false, "stickied": false, "created": 1492480073.0, "created_utc": 1492451273.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdtzw6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "made-of-bees", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This is so beautiful, so captivating, I couldn't put it down. Wow. I adored it, I wish there was more, but of course it was perfect as it was. I'm speechless.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is so beautiful, so captivating, I couldn&amp;#39;t put it down. Wow. I adored it, I wish there was more, but of course it was perfect as it was. I&amp;#39;m speechless.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdtzw6", "score_hidden": false, "stickied": false, "created": 1492480225.0, "created_utc": 1492451425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdu892", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Azazelsheep", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "This was amazing! I get so excited every time you post something new, it's always such beautiful writing. You really are talented :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was amazing! I get so excited every time you post something new, it&amp;#39;s always such beautiful writing. You really are talented :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdu892", "score_hidden": false, "stickied": false, "created": 1492480477.0, "created_utc": 1492451677.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rm4d", "removal_reason": null, "link_id": "t3_65tob2", "likes": null, "replies": "", "user_reports": [], "id": "dgdx9r4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AGirlisRed821", "parent_id": "t3_65tob2", "subreddit_name_prefixed": "r/nosleep", "controversiality": 0, "body": "Great write...reminds me a little of Edgar Allen Poe, your writing style, but it was extremely captivating.  Would love to read more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great write...reminds me a little of Edgar Allen Poe, your writing style, but it was extremely captivating.  Would love to read more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nosleep", "name": "t1_dgdx9r4", "score_hidden": false, "stickied": false, "created": 1492483885.0, "created_utc": 1492455085.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]