[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Bitcoin", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;UASF, as explained well by shaolinfry &lt;a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2017-February/013643.html\"&gt;here&lt;/a&gt;, is a scheme that basically requires overwhelming support from the userbase of Bitcoin. For this reason, even though it&amp;#39;s a soft fork, which is fundamentally safer than a hardfork, is a risky strategy. Why support it? Why not just let things lie, and accept that updating Bitcoin is hard and that isn&amp;#39;t, by any means, an unambiguously bad thing?&lt;/p&gt;\n\n&lt;p&gt;The answer at a high level, is that &lt;strong&gt;miners are now fully convinced that they not only have a say in changes to Bitcoin, but the only say&lt;/strong&gt;. And that is a disaster.&lt;/p&gt;\n\n&lt;h3&gt;Scenario:&lt;/h3&gt;\n\n&lt;p&gt;2 months from now, no UASF gained any traction, miners, led by Jihan Wu, celebrate this victory and enact a new fork. It doesn&amp;#39;t matter if it&amp;#39;s a soft or hard fork, but the former are easier to do. It could be something stupid and disruptive like only allow transactions that say &amp;quot;Jihan wu is great!&amp;quot; in an OP_RETURN (note: SF because rule restriction, so old nodes don&amp;#39;t get kicked off the main chain; but still massively disruptive because disabling old node txs). Or more realistically it could be some kind of hard fork to move to &amp;quot;emergent consensus&amp;quot;, where miners entirely control the size of blocks, or .. whatever. What&amp;#39;s far more important to Jihan and his crew is to establish the &lt;em&gt;precedent&lt;/em&gt; - we say what the main chain is, because we have the hashpower.&lt;/p&gt;\n\n&lt;p&gt;If we&amp;#39;ve given up on any ideas of user activation, &lt;strong&gt;we are completely powerless to stop it&lt;/strong&gt;. And that goes as much for Roger Ver as it does for Greg Maxwell, users, developers, anybody. Hash power no longer just orders transactions - it sets &lt;em&gt;all&lt;/em&gt; rules, full stop. Many will say &amp;quot;they won&amp;#39;t try to force a block reward increase or huge fees, they&amp;#39;d be going against their real incentives&amp;quot; - of course, mostly true, at least today. But it can be much more subtle, to start with. Hashpower sets rules on covert asicboost, enabling monopoly. It sets rules that decide what kinds of transactions are allowed. Jihan may feel (and there&amp;#39;s evidence that some miners &lt;em&gt;do&lt;/em&gt; feel this) that privacy-enhancing upgrades are intolerable; to stay on the right side of governments, no kinds of easy mixing tech is allowed. No second layer (which is too good for privacy) payment channels allowed. Let&amp;#39;s disable OP_CSV that&amp;#39;s &amp;quot;complicated&amp;quot;, &amp;quot;technical debt&amp;quot;.&lt;/p&gt;\n\n&lt;h3&gt;So is anything realistic without UASF coordination, or are we doomed?&lt;/h3&gt;\n\n&lt;p&gt;Disabling covert asicboost does &lt;em&gt;not&lt;/em&gt; disable asicboost, it only stops miners having a &lt;em&gt;secret&lt;/em&gt; reason to prevent a protocol upgrade (whether they&amp;#39;ve done it or not in the past). Consider people on the fence, e.g. Brian Armstrong at Coinbase. Can he stand up in public and say &amp;quot;I am against only blocking a secret usage of asicboost, which incentivises miners to block protocol updates apart from any other reason, to the tune of $100 million&amp;quot;? On what planet could he say that with a straight face? And the same for any other economically important actor - even miners cannot; although, probably some will, by spouting some bullshit. For this specific case, I think we should be able to get &lt;em&gt;everyone&lt;/em&gt; economically significant on board, if only they can be told the facts in a simple, straightforward way. However, if I am wrong about that, the entire Bitcoin project to me is right on the brink of failure. Bitcoin controlled by miners will be a very shitty Paypal, ultimately.&lt;/p&gt;\n\n&lt;h3&gt;Counterargument - why is a &amp;quot;cabal&amp;quot; of &amp;quot;Core&amp;quot; devs any better than a cabal of miners?&lt;/h3&gt;\n\n&lt;p&gt;Here we come to the heart of the matter - should there be anyone in charge of changes? If so, who?&lt;/p&gt;\n\n&lt;p&gt;My first response is - no one should be able to make &lt;em&gt;any&lt;/em&gt; changes, period, ideally. This is a &lt;em&gt;possible&lt;/em&gt;, &lt;em&gt;ideal&lt;/em&gt;, future - and at least we&amp;#39;re trending in that direction. Changes are &lt;em&gt;very&lt;/em&gt; hard, and I suspect many super-bright people with slightly thin skin have been very upset about how hard it is to get consensus on their proposals (one reason for so much friction).&lt;/p&gt;\n\n&lt;p&gt;But that future is not here yet, so let&amp;#39;s look at the past: Satoshi pushed changes and told the miners to upgrade, end of story. Now we have hundreds of developers, with a much smaller number having the most influence. We use an open source governance process, where people gain influence via valued contribution over a long time, and even when they have influence, there are thousands of eyes on their proposed updates.&lt;/p&gt;\n\n&lt;p&gt;This governance model isn&amp;#39;t perfect, because it involves people. It &lt;em&gt;ought&lt;/em&gt; to work fine mostly for low-level technical changes. As a somewhat tech-savvy user, rather than contributor, I&amp;#39;m happy to let those who&amp;#39;ve proved themselves make the technical decisions, but with the understanding that the project has huge inertia, and that not every decision will be perfect. It&amp;#39;s hubris to think you deserve your opinion on technical topics to be heard when you haven&amp;#39;t put in the hours on the details of the code.&lt;/p&gt;\n\n&lt;p&gt;So while trivial changes to the code either don&amp;#39;t happen, or don&amp;#39;t cause contention anyway, some quite profound changes, over a period of time, still gain traction today, despite the aforementioned inertia - and segwit is by far the most important one recently, &lt;strong&gt;because it fixes a bug in the design of Bitcoin&lt;/strong&gt;. Make no mistake, segwit is a huge deal - not because it increases the block size, that&amp;#39;s a compromise really, but because it finally fixes a bug that will allow people to write code &lt;em&gt;without&lt;/em&gt; touching the consensus layer, that enables real innovation; Lightning is the standout illustration of this, but there&amp;#39;ll probably be others. Because of this bugfix nature, enabling innovation, segwit might be the &lt;em&gt;last&lt;/em&gt; such big change that&amp;#39;s even needed. So in this sense, we might actually fall at the last hurdle.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "UASF, as explained well by shaolinfry [here](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2017-February/013643.html), is a scheme that basically requires overwhelming support from the userbase of Bitcoin. For this reason, even though it's a soft fork, which is fundamentally safer than a hardfork, is a risky strategy. Why support it? Why not just let things lie, and accept that updating Bitcoin is hard and that isn't, by any means, an unambiguously bad thing?\n\nThe answer at a high level, is that **miners are now fully convinced that they not only have a say in changes to Bitcoin, but the only say**. And that is a disaster.\n\n### Scenario:\n2 months from now, no UASF gained any traction, miners, led by Jihan Wu, celebrate this victory and enact a new fork. It doesn't matter if it's a soft or hard fork, but the former are easier to do. It could be something stupid and disruptive like only allow transactions that say \"Jihan wu is great!\" in an OP_RETURN (note: SF because rule restriction, so old nodes don't get kicked off the main chain; but still massively disruptive because disabling old node txs). Or more realistically it could be some kind of hard fork to move to \"emergent consensus\", where miners entirely control the size of blocks, or .. whatever. What's far more important to Jihan and his crew is to establish the *precedent* - we say what the main chain is, because we have the hashpower.\n\nIf we've given up on any ideas of user activation, **we are completely powerless to stop it**. And that goes as much for Roger Ver as it does for Greg Maxwell, users, developers, anybody. Hash power no longer just orders transactions - it sets *all* rules, full stop. Many will say \"they won't try to force a block reward increase or huge fees, they'd be going against their real incentives\" - of course, mostly true, at least today. But it can be much more subtle, to start with. Hashpower sets rules on covert asicboost, enabling monopoly. It sets rules that decide what kinds of transactions are allowed. Jihan may feel (and there's evidence that some miners *do* feel this) that privacy-enhancing upgrades are intolerable; to stay on the right side of governments, no kinds of easy mixing tech is allowed. No second layer (which is too good for privacy) payment channels allowed. Let's disable OP_CSV that's \"complicated\", \"technical debt\".\n\n### So is anything realistic without UASF coordination, or are we doomed?\n\nDisabling covert asicboost does *not* disable asicboost, it only stops miners having a *secret* reason to prevent a protocol upgrade (whether they've done it or not in the past). Consider people on the fence, e.g. Brian Armstrong at Coinbase. Can he stand up in public and say \"I am against only blocking a secret usage of asicboost, which incentivises miners to block protocol updates apart from any other reason, to the tune of $100 million\"? On what planet could he say that with a straight face? And the same for any other economically important actor - even miners cannot; although, probably some will, by spouting some bullshit. For this specific case, I think we should be able to get *everyone* economically significant on board, if only they can be told the facts in a simple, straightforward way. However, if I am wrong about that, the entire Bitcoin project to me is right on the brink of failure. Bitcoin controlled by miners will be a very shitty Paypal, ultimately.\n\n### Counterargument - why is a \"cabal\" of \"Core\" devs any better than a cabal of miners?\n\nHere we come to the heart of the matter - should there be anyone in charge of changes? If so, who?\n\nMy first response is - no one should be able to make *any* changes, period, ideally. This is a *possible*, *ideal*, future - and at least we're trending in that direction. Changes are *very* hard, and I suspect many super-bright people with slightly thin skin have been very upset about how hard it is to get consensus on their proposals (one reason for so much friction).\n\n\nBut that future is not here yet, so let's look at the past: Satoshi pushed changes and told the miners to upgrade, end of story. Now we have hundreds of developers, with a much smaller number having the most influence. We use an open source governance process, where people gain influence via valued contribution over a long time, and even when they have influence, there are thousands of eyes on their proposed updates.\n\nThis governance model isn't perfect, because it involves people. It *ought* to work fine mostly for low-level technical changes. As a somewhat tech-savvy user, rather than contributor, I'm happy to let those who've proved themselves make the technical decisions, but with the understanding that the project has huge inertia, and that not every decision will be perfect. It's hubris to think you deserve your opinion on technical topics to be heard when you haven't put in the hours on the details of the code.\n\nSo while trivial changes to the code either don't happen, or don't cause contention anyway, some quite profound changes, over a period of time, still gain traction today, despite the aforementioned inertia - and segwit is by far the most important one recently, **because it fixes a bug in the design of Bitcoin**. Make no mistake, segwit is a huge deal - not because it increases the block size, that's a compromise really, but because it finally fixes a bug that will allow people to write code *without* touching the consensus layer, that enables real innovation; Lightning is the standout illustration of this, but there'll probably be others. Because of this bugfix nature, enabling innovation, segwit might be the *last* such big change that's even needed. So in this sense, we might actually fall at the last hurdle.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sntn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 86, "report_reasons": null, "author": "waxwing", "saved": false, "mod_reports": [], "name": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "approved_by": null, "over_18": false, "domain": "self.Bitcoin", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s3qj", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Bitcoin/comments/64sntn/the_problem_is_quite_urgent_or_why_some_uasf_does/", "num_reports": null, "locked": false, "stickied": false, "created": 1491963774.0, "url": "https://www.reddit.com/r/Bitcoin/comments/64sntn/the_problem_is_quite_urgent_or_why_some_uasf_does/", "author_flair_text": null, "quarantine": false, "title": "The problem is quite urgent, or why *some* UASF does make sense", "created_utc": 1491934974.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 86}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg53dnc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kaiser13", "parent_id": "t1_dg51csv", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "hear, hear", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hear, hear&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg53dnc", "score_hidden": false, "stickied": false, "created": 1491981220.0, "created_utc": 1491952420.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg5ob28", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Highw4ys", "parent_id": "t1_dg5mot2", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "I'm not him, but he's saying that **UASF** wasn't tested thoroughly.\n\nAnd I fully agree with him, I support SegWit, but not UASF.\n\nAnd I'm convinced that all the big companies that expressed their UASF support so fast do not completely understand what it is all about, and merely jumped aboard some sort of hype train.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not him, but he&amp;#39;s saying that &lt;strong&gt;UASF&lt;/strong&gt; wasn&amp;#39;t tested thoroughly.&lt;/p&gt;\n\n&lt;p&gt;And I fully agree with him, I support SegWit, but not UASF.&lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m convinced that all the big companies that expressed their UASF support so fast do not completely understand what it is all about, and merely jumped aboard some sort of hype train.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5ob28", "score_hidden": false, "stickied": false, "created": 1492018555.0, "created_utc": 1491989755.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg5oupz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "krazyest", "parent_id": "t1_dg5mot2", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "UASF for SegWit of course. SegWit itself is very well tested and lots of research has been done describing its benefits and risks. Where is this research for UASF activation?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;UASF for SegWit of course. SegWit itself is very well tested and lots of research has been done describing its benefits and risks. Where is this research for UASF activation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5oupz", "score_hidden": false, "stickied": false, "created": 1492020260.0, "created_utc": 1491991460.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mot2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "enqueued", "parent_id": "t1_dg5mb07", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "Are you saying SegWit wasn't tested thoroughly or UASF?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you saying SegWit wasn&amp;#39;t tested thoroughly or UASF?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5mot2", "score_hidden": false, "stickied": false, "created": 1492013457.0, "created_utc": 1491984657.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mb07", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "krazyest", "parent_id": "t1_dg51csv", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "I'm very pro-SegWit, yet I'm against UASF SegWit as it has been presented. Why? Because this is not how you deploy changes in Bitcoin. Why? Because UASF SegWit as it has been presented is too fast. \n\nEvery such a change should be peer reviewed to extreme, this was not. Then it should be tested like crazy, this was not. Then tested like crazy on testnet, this was not. And during this process of endless testing and review bugs would be found. They would be fixed and the whole process of testing would start over again. This did not happen here. This is not how you deploy changes in Bitcoin.\n\nAnd especially with changes that require a huge number of people to cooperate together (i.e. upgrade) need very long activation time, not just couple of months like we see here. This quick activation is why this is doomed. Many people will simply not upgrade on time. There are many different reasons for that. \n\nHow about backports for example? I'm not sure about that, but is there a backport of UASF SegWit to all versions of Bitcoin Core that are relevant? Or do we force everyone to jump to v0.14? This might be a problem if we do ...\n\nIf there is super wide consensus of users, then UASF might make sense, but only if you make it right, not in hurry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very pro-SegWit, yet I&amp;#39;m against UASF SegWit as it has been presented. Why? Because this is not how you deploy changes in Bitcoin. Why? Because UASF SegWit as it has been presented is too fast. &lt;/p&gt;\n\n&lt;p&gt;Every such a change should be peer reviewed to extreme, this was not. Then it should be tested like crazy, this was not. Then tested like crazy on testnet, this was not. And during this process of endless testing and review bugs would be found. They would be fixed and the whole process of testing would start over again. This did not happen here. This is not how you deploy changes in Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;And especially with changes that require a huge number of people to cooperate together (i.e. upgrade) need very long activation time, not just couple of months like we see here. This quick activation is why this is doomed. Many people will simply not upgrade on time. There are many different reasons for that. &lt;/p&gt;\n\n&lt;p&gt;How about backports for example? I&amp;#39;m not sure about that, but is there a backport of UASF SegWit to all versions of Bitcoin Core that are relevant? Or do we force everyone to jump to v0.14? This might be a problem if we do ...&lt;/p&gt;\n\n&lt;p&gt;If there is super wide consensus of users, then UASF might make sense, but only if you make it right, not in hurry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5mb07", "score_hidden": false, "stickied": false, "created": 1492012320.0, "created_utc": 1491983520.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg5h819", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "thieflar", "parent_id": "t1_dg5e3ch", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "It's like talking to an angry wall.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like talking to an angry wall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5h819", "score_hidden": false, "stickied": false, "created": 1492000670.0, "created_utc": 1491971870.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg5mewy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mousepower1", "parent_id": "t1_dg5m7g5", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "I am 100% against the signature discount. To me it just looks like the corruption of bitcoin and discounts being put in place to benefit lightning and other commercial systems when they come. I believe in equal payment for network use, and this doesn't do that.\n\n\nYou mentioned both the virtual block size and discount in your post. I think you hit the nail on the head with those two items. Without those items segwit would simply be an upgrade and there wouldnt be all this arguing about it being a good or bad scaling solution. The scaling solution could then be performed separately as HF or otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am 100% against the signature discount. To me it just looks like the corruption of bitcoin and discounts being put in place to benefit lightning and other commercial systems when they come. I believe in equal payment for network use, and this doesn&amp;#39;t do that.&lt;/p&gt;\n\n&lt;p&gt;You mentioned both the virtual block size and discount in your post. I think you hit the nail on the head with those two items. Without those items segwit would simply be an upgrade and there wouldnt be all this arguing about it being a good or bad scaling solution. The scaling solution could then be performed separately as HF or otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5mewy", "score_hidden": false, "stickied": false, "created": 1492012634.0, "created_utc": 1491983834.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5m7g5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "enqueued", "parent_id": "t1_dg5e3ch", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "Which changes do you not agree with? Which do you think could be changed to improve miner support?\n\nSegwit really is only one change. It can't really be broken down with one notable exception. The introduction of a virtual block weight with witness discounts could be removed, I suppose, if that's *really* the barrier to adoption. But I don't think any informed observer would claim so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which changes do you not agree with? Which do you think could be changed to improve miner support?&lt;/p&gt;\n\n&lt;p&gt;Segwit really is only one change. It can&amp;#39;t really be broken down with one notable exception. The introduction of a virtual block weight with witness discounts could be removed, I suppose, if that&amp;#39;s &lt;em&gt;really&lt;/em&gt; the barrier to adoption. But I don&amp;#39;t think any informed observer would claim so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5m7g5", "score_hidden": false, "stickied": false, "created": 1492012026.0, "created_utc": 1491983226.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e3ch", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mousepower1", "parent_id": "t1_dg5d81j", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "Sounds like alot of changes, not one.\nI don't agree with all of the changes in segwit, and neither do the miners. So why not take the high road and make a smaller less contentious update?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like alot of changes, not one.\nI don&amp;#39;t agree with all of the changes in segwit, and neither do the miners. So why not take the high road and make a smaller less contentious update?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5e3ch", "score_hidden": false, "stickied": false, "created": 1491995606.0, "created_utc": 1491966806.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5d81j", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "thieflar", "parent_id": "t1_dg5blx9", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "SegWit is just one change, though: an improved new transaction format. All the myriad benefits of the proposal (including the blocksize increase it achieves) are results of the careful, intelligent design of this new format.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;SegWit is just one change, though: an improved new transaction format. All the myriad benefits of the proposal (including the blocksize increase it achieves) are results of the careful, intelligent design of this new format.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5d81j", "score_hidden": false, "stickied": false, "created": 1491994362.0, "created_utc": 1491965562.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg5rvby", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mousepower1", "parent_id": "t1_dg5rof0", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "Why not? Sometimes it is good to look for a slightly different technical solution.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why not? Sometimes it is good to look for a slightly different technical solution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5rvby", "score_hidden": false, "stickied": false, "created": 1492027786.0, "created_utc": 1491998986.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rof0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bitdrunk", "parent_id": "t1_dg5blx9", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "&gt; So abandon segwit, \n\nNo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So abandon segwit, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5rof0", "score_hidden": false, "stickied": false, "created": 1492027403.0, "created_utc": 1491998603.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5blx9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mousepower1", "parent_id": "t1_dg51csv", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "A better choice is to campaign for a more sensible option. I am sure there are parts of the segwit upgrade which the miners agree with. \n\nSo abandon segwit, and make the upgrades everyone agrees with, then move on to other more contentious upgrades. Trying to rewrite the rule book after the game has already started is inviting trouble.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A better choice is to campaign for a more sensible option. I am sure there are parts of the segwit upgrade which the miners agree with. &lt;/p&gt;\n\n&lt;p&gt;So abandon segwit, and make the upgrades everyone agrees with, then move on to other more contentious upgrades. Trying to rewrite the rule book after the game has already started is inviting trouble.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5blx9", "score_hidden": false, "stickied": false, "created": 1491992123.0, "created_utc": 1491963323.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51csv", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "jky__", "parent_id": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "This is why I'm so confused by all this fear around USAF. What other choice do we have? Let Jihan set the precedence for Bitcoin upgrades? The ability for users to resist oppression is the fundamental reason Bitcoin works.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why I&amp;#39;m so confused by all this fear around USAF. What other choice do we have? Let Jihan set the precedence for Bitcoin upgrades? The ability for users to resist oppression is the fundamental reason Bitcoin works.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg51csv", "score_hidden": false, "stickied": false, "created": 1491978565.0, "created_utc": 1491949765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg4oxln", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "belcher_", "parent_id": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "Good post. Well worth a read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good post. Well worth a read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg4oxln", "score_hidden": false, "stickied": false, "created": 1491964419.0, "created_utc": 1491935619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg565pd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "earonesty", "parent_id": "t1_dg53srq", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "Guilty", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Guilty&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg565pd", "score_hidden": false, "stickied": false, "created": 1491984965.0, "created_utc": 1491956165.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg53srq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "nopara73", "parent_id": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "&gt; It's hubris to think you deserve your opinion on technical topics to be heard when you haven't put in the hours on the details of the code.  \n  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s hubris to think you deserve your opinion on technical topics to be heard when you haven&amp;#39;t put in the hours on the details of the code.  &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg53srq", "score_hidden": false, "stickied": false, "created": 1491981796.0, "created_utc": 1491952996.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg50bej", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dsterry", "parent_id": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "Should possibly get a sticky. Definitely a tweet: https://twitter.com/weex/status/851918888782635009", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Should possibly get a sticky. Definitely a tweet: &lt;a href=\"https://twitter.com/weex/status/851918888782635009\"&gt;https://twitter.com/weex/status/851918888782635009&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg50bej", "score_hidden": false, "stickied": false, "created": 1491977239.0, "created_utc": 1491948439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg5d3t3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thieflar", "parent_id": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "This is the best post I've read in a good while.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the best post I&amp;#39;ve read in a good while.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5d3t3", "score_hidden": false, "stickied": false, "created": 1491994196.0, "created_utc": 1491965396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg5o5hc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Da-Allusion", "parent_id": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "&gt;miners are now fully convinced that they not only have a say in changes to Bitcoin, but the only say.\n\nDon't be so binary...Bitcoin users will have the say, as usual. The main usecase of bitcoin to ensure a decentralized currency will be protected. The changes will come when they will, as long as Bitcoin isn't hurt than no worries. It is good that the miners understand they are not the only option, thanks UASF.\n\nThey may celebrate if UASF doesn't get activated, but they will learn a major lesson :).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;miners are now fully convinced that they not only have a say in changes to Bitcoin, but the only say.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t be so binary...Bitcoin users will have the say, as usual. The main usecase of bitcoin to ensure a decentralized currency will be protected. The changes will come when they will, as long as Bitcoin isn&amp;#39;t hurt than no worries. It is good that the miners understand they are not the only option, thanks UASF.&lt;/p&gt;\n\n&lt;p&gt;They may celebrate if UASF doesn&amp;#39;t get activated, but they will learn a major lesson :).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg5o5hc", "score_hidden": false, "stickied": false, "created": 1492018068.0, "created_utc": 1491989268.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3qj", "removal_reason": null, "link_id": "t3_64sntn", "likes": null, "replies": "", "user_reports": [], "id": "dg53f9e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MuKKMan", "parent_id": "t3_64sntn", "subreddit_name_prefixed": "r/Bitcoin", "controversiality": 0, "body": "If Jihan is able to destroy bitcoin, that indeed sucks. But I'm not worried, we will just start a new, better Bitcoin and try again. Right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If Jihan is able to destroy bitcoin, that indeed sucks. But I&amp;#39;m not worried, we will just start a new, better Bitcoin and try again. Right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Bitcoin", "name": "t1_dg53f9e", "score_hidden": false, "stickied": false, "created": 1491981283.0, "created_utc": 1491952483.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]