[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Fitness", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Howdy everyone.&lt;/p&gt;\n\n&lt;p&gt;One of our most important goals for &lt;a href=\"/r/Fitness\"&gt;r/Fitness&lt;/a&gt; is for it to be a place where people who know nothing about fitness can get solid, reliable information. Separating the wheat from the chaff is a daunting challenge that beginners often face, and the volume of information that the internet gives them access to makes that problem that much harder to solve. &amp;quot;I&amp;#39;ve tried Googling but I get so much conflicting information&amp;quot; is a phrase that we see dozens of variants of hundreds of times each week.&lt;/p&gt;\n\n&lt;p&gt;The popularity of 2-Suns and lvysaur&amp;#39;s programs has forced us to consider what place routines created by individual users have in &lt;a href=\"/r/Fitness\"&gt;r/Fitness&lt;/a&gt;. If you&amp;#39;ve been around here for any amount of time, you&amp;#39;ll know that something we (and regulars) try to pound into the heads of beginners is - &amp;quot;&lt;em&gt;Stop trying to create your own &amp;#39;custom&amp;#39; routine.&lt;/em&gt;&amp;quot; These two things are somewhat at odds with each other.&lt;/p&gt;\n\n&lt;p&gt;We do not want the popularity of these programs to open the door for &lt;a href=\"/r/Fitness\"&gt;r/Fitness&lt;/a&gt; to turn into a dumpster where everybody thinks they&amp;#39;ve come up with the next great thing and starts slapping their name on shit routines, prompting large threads of people arguing their merits or failings, and generally degrading the signal to noise ratio for effective program choices. Or, to put it another way, BodyBuilding.com already exists and we don&amp;#39;t want &lt;a href=\"/r/Fitness\"&gt;r/Fitness&lt;/a&gt; to be another one.&lt;/p&gt;\n\n&lt;p&gt;Going forward, we will no longer be allowing routine posts in the vein of what 2-Suns and lvsaur have done in the past. We will also be redirecting all posts with questions specifically about their routines to the users themselves. We think it is unlikely that, in practice, this will come up very often - but this announcement is in the spirit of transparency and having something official to point it if it does.&lt;/p&gt;\n\n&lt;p&gt;So, TLDR:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Going forward, &amp;quot;branded&amp;quot; routines and posts focused on or specific to them will not be permitted on &lt;a href=\"/r/Fitness\"&gt;r/Fitness&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;Routine critique threads are still permitted, provided they meet the requirements of Rule #9.&lt;/li&gt;\n&lt;li&gt;Structured progress posts can still include the poster&amp;#39;s homemade routine if they personally used it to make progress.&lt;/li&gt;\n&lt;li&gt;Rare exceptions &lt;em&gt;may&lt;/em&gt; be made to this policy in extraordinary cases. GZCL/Cody LeFever is an example of someone who would meet this criteria. If you have to ask if you are an extraordinary case that warrants an exception, you probably aren&amp;#39;t.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;If you have any questions about this, please use the Message the Moderators link from the sidebar.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Howdy everyone.\n\nOne of our most important goals for r/Fitness is for it to be a place where people who know nothing about fitness can get solid, reliable information. Separating the wheat from the chaff is a daunting challenge that beginners often face, and the volume of information that the internet gives them access to makes that problem that much harder to solve. \"I've tried Googling but I get so much conflicting information\" is a phrase that we see dozens of variants of hundreds of times each week.\n\nThe popularity of 2-Suns and lvysaur's programs has forced us to consider what place routines created by individual users have in r/Fitness. If you've been around here for any amount of time, you'll know that something we (and regulars) try to pound into the heads of beginners is - \"*Stop trying to create your own 'custom' routine.*\" These two things are somewhat at odds with each other.\n\nWe do not want the popularity of these programs to open the door for r/Fitness to turn into a dumpster where everybody thinks they've come up with the next great thing and starts slapping their name on shit routines, prompting large threads of people arguing their merits or failings, and generally degrading the signal to noise ratio for effective program choices. Or, to put it another way, BodyBuilding.com already exists and we don't want r/Fitness to be another one.\n\nGoing forward, we will no longer be allowing routine posts in the vein of what 2-Suns and lvsaur have done in the past. We will also be redirecting all posts with questions specifically about their routines to the users themselves. We think it is unlikely that, in practice, this will come up very often - but this announcement is in the spirit of transparency and having something official to point it if it does.\n\nSo, TLDR:\n\n- Going forward, \"branded\" routines and posts focused on or specific to them will not be permitted on r/Fitness.\n- Routine critique threads are still permitted, provided they meet the requirements of Rule #9.\n- Structured progress posts can still include the poster's homemade routine if they personally used it to make progress.\n- Rare exceptions *may* be made to this policy in extraordinary cases. GZCL/Cody LeFever is an example of someone who would meet this criteria. If you have to ask if you are an extraordinary case that warrants an exception, you probably aren't.\n\nIf you have any questions about this, please use the Message the Moderators link from the sidebar.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xe48", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 26, "report_reasons": null, "author": "purplespengler", "saved": false, "mod_reports": [], "name": "t3_65xe48", "subreddit_name_prefixed": "r/Fitness", "approved_by": null, "over_18": false, "domain": "self.Fitness", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhx4", "edited": 1492458265.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": true, "spoiler": false, "permalink": "/r/Fitness/comments/65xe48/moderation_update_user_created_routines/", "num_reports": null, "locked": true, "stickied": false, "created": 1492482720.0, "url": "https://www.reddit.com/r/Fitness/comments/65xe48/moderation_update_user_created_routines/", "author_flair_text": "Benevolent Dictatorship", "quarantine": false, "title": "Moderation Update: User Created Routines", "created_utc": 1492453920.0, "distinguished": "moderator", "media": null, "upvote_ratio": 0.73, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]