[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AsianBeauty", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.ratzillacosme.com/skin/review-the-ordinary/\"&gt;http://www.ratzillacosme.com/skin/review-the-ordinary/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So Ratzilla doesn&amp;#39;t rave about The Ordinary as many of us do. Her only remarkable products are the Squalane and the 20% Ascorbyl Tetraisopalmitate ones.&lt;/p&gt;\n\n&lt;p&gt;What I found a bit strange was her constant whining about TO not being a &amp;quot;sciency&amp;quot; brand. She considers that labeling percentages of ingredients is misleading people into buying something that isn&amp;#39;t proven to work. K.&lt;/p&gt;\n\n&lt;p&gt;I personally find some of their products pretty useless, the caffeine one comes to mind. But there&amp;#39;s actually research on a lot of TO products, like the Retinoid, the various Ascorbic derivatives, the Glycolic, Salicylic, Lactic acis, Niacinamide, Arbutin... I&amp;#39;m probably missing some.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not so sure about peptides, but I&amp;#39;ve read many times that they&amp;#39;re showing promising results. Not to mention that in the cosmetic industry you cannot always see effects in short time spans.&lt;/p&gt;\n\n&lt;p&gt;She also complains about customer service. But hey, TO is very open unlike most cosmetic companies. They always give transparent information about their formulations. I couldn&amp;#39;t care less about their CS, you can buy TO in a bunch of places. What makes TO so valuable for me is to get minimalistic yet effective products and at an affordable price.&lt;/p&gt;\n\n&lt;p&gt;I found her review quite surprising given the fact that she usually has nice and thorough reviews about sunscreens and lotions. Pretty objective ones if you ask me. IMO not this time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "http://www.ratzillacosme.com/skin/review-the-ordinary/\n\nSo Ratzilla doesn't rave about The Ordinary as many of us do. Her only remarkable products are the Squalane and the 20% Ascorbyl Tetraisopalmitate ones.\n\nWhat I found a bit strange was her constant whining about TO not being a \"sciency\" brand. She considers that labeling percentages of ingredients is misleading people into buying something that isn't proven to work. K.\n\nI personally find some of their products pretty useless, the caffeine one comes to mind. But there's actually research on a lot of TO products, like the Retinoid, the various Ascorbic derivatives, the Glycolic, Salicylic, Lactic acis, Niacinamide, Arbutin... I'm probably missing some.\n\nI'm not so sure about peptides, but I've read many times that they're showing promising results. Not to mention that in the cosmetic industry you cannot always see effects in short time spans.\n\nShe also complains about customer service. But hey, TO is very open unlike most cosmetic companies. They always give transparent information about their formulations. I couldn't care less about their CS, you can buy TO in a bunch of places. What makes TO so valuable for me is to get minimalistic yet effective products and at an affordable price.\n\nI found her review quite surprising given the fact that she usually has nice and thorough reviews about sunscreens and lotions. Pretty objective ones if you ask me. IMO not this time.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "65lfsh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "sohrsdom", "saved": false, "mod_reports": [], "name": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "approved_by": null, "over_18": false, "domain": "self.AsianBeauty", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/32GyjCkUXvUUeFuMcQUrjuLMe2B-oWgbl3ogjlhs-II.jpg?s=bf83b23671ae10b9a62bc4e8470a090d", "width": 450, "height": 450}, "resolutions": [{"url": "https://i.redditmedia.com/32GyjCkUXvUUeFuMcQUrjuLMe2B-oWgbl3ogjlhs-II.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=35955ca33a8e7301898becf21d5da822", "width": 108, "height": 108}, {"url": "https://i.redditmedia.com/32GyjCkUXvUUeFuMcQUrjuLMe2B-oWgbl3ogjlhs-II.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=0696f0591bff5369abecf1c03959ea46", "width": 216, "height": 216}, {"url": "https://i.redditmedia.com/32GyjCkUXvUUeFuMcQUrjuLMe2B-oWgbl3ogjlhs-II.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=60d66e3918733f28e3b17f1c3962a6ff", "width": 320, "height": 320}], "variants": {}, "id": "dY51G-WtTU-b1mZj8ZJgBKnk-YgR6nJaQWjOZZDCye4"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2w0u7", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AsianBeauty/comments/65lfsh/discussion_ratzilla_isnt_a_fan_of_the_ordinary/", "num_reports": null, "locked": false, "stickied": false, "created": 1492319205.0, "url": "https://www.reddit.com/r/AsianBeauty/comments/65lfsh/discussion_ratzilla_isnt_a_fan_of_the_ordinary/", "author_flair_text": null, "quarantine": false, "title": "[Discussion] Ratzilla isn't a fan of The Ordinary, link inside", "created_utc": 1492290405.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 40, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgbvzvx", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "neopetian", "parent_id": "t1_dgbbrle", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I'm actually quite in agreement with critiques about the science-washing that goes on with their marketing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m actually quite in agreement with critiques about the science-washing that goes on with their marketing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbvzvx", "score_hidden": false, "stickied": false, "created": 1492364638.0, "created_utc": 1492335838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbrle", "gilded": 0, "archived": false, "score": 72, "report_reasons": null, "author": "SleepySundayKittens", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I think there is a misinterpretation here. She doesn't complain that TO is *not* a sciency brand. Her point was she doesn't like that they sell from the science angle by filling their site and instruction manual with science jargon without reference to studies proving effectiveness, and she finds it similar to the way 'natural' brands sell on the natural angle.  That's how I read it, anyway.  Which I mean, it is kind of true and I can see how wholistically it can seem gimmicky.  \n\nIn terms of CS remarks, I didn't have trouble with shipping anything, but I have seen complaints about their CS being completely unresponsive. \nThe one time I had contact with them was that I made an order forgetting to apply their sale coupon, it was the last day for the coupon (I think this was August 31St last year). Called them to see if I could cancel and reorder, the lady picks up the phone and tells me straight up it is useless to cancel and reorder and apply the coupon because it's expired.  I checked by making a separate order and she straight up lied because you could apply it. She just couldn't bother to do something.  At the time I didn't really care either, it was just a few pounds. But it doesn't make you feel good, nor is it professional to kind of tell a small lie.  so I am not really surprised by the other bad experiences. \nu/lgbtqbbq wrote a review also on her blog faceonomics about the brand which I thought made a lot of sense. Gothamista's review on YouTube also agrees with the application feel of some of the products being just wrong. And anyway I wouldn't think any review is objective.  I don't think that's possible since it is based on one persons experience and viewpoint.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think there is a misinterpretation here. She doesn&amp;#39;t complain that TO is &lt;em&gt;not&lt;/em&gt; a sciency brand. Her point was she doesn&amp;#39;t like that they sell from the science angle by filling their site and instruction manual with science jargon without reference to studies proving effectiveness, and she finds it similar to the way &amp;#39;natural&amp;#39; brands sell on the natural angle.  That&amp;#39;s how I read it, anyway.  Which I mean, it is kind of true and I can see how wholistically it can seem gimmicky.  &lt;/p&gt;\n\n&lt;p&gt;In terms of CS remarks, I didn&amp;#39;t have trouble with shipping anything, but I have seen complaints about their CS being completely unresponsive. \nThe one time I had contact with them was that I made an order forgetting to apply their sale coupon, it was the last day for the coupon (I think this was August 31St last year). Called them to see if I could cancel and reorder, the lady picks up the phone and tells me straight up it is useless to cancel and reorder and apply the coupon because it&amp;#39;s expired.  I checked by making a separate order and she straight up lied because you could apply it. She just couldn&amp;#39;t bother to do something.  At the time I didn&amp;#39;t really care either, it was just a few pounds. But it doesn&amp;#39;t make you feel good, nor is it professional to kind of tell a small lie.  so I am not really surprised by the other bad experiences. \n&lt;a href=\"/u/lgbtqbbq\"&gt;u/lgbtqbbq&lt;/a&gt; wrote a review also on her blog faceonomics about the brand which I thought made a lot of sense. Gothamista&amp;#39;s review on YouTube also agrees with the application feel of some of the products being just wrong. And anyway I wouldn&amp;#39;t think any review is objective.  I don&amp;#39;t think that&amp;#39;s possible since it is based on one persons experience and viewpoint.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbbrle", "score_hidden": false, "stickied": false, "created": 1492326890.0, "created_utc": 1492298090.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 72}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgb7ded", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "illuminateddd", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I've seen people here discuss some of the stuff Ratzilla's said about this sub and her overall attitude, so I don't give a crap honestly\n\nThe Ordinary is fine in my book so far. I don't doubt the overall quality - the stuff I've (and my mom) tried, worked for us well, and the price is remarkable. Have to say I've never encountered their customer service myself, and the fact that it does seem like their products under separate brands are kind of like \"okay, good, great\", but I mean I didn't ask for a new face for $6, so I'm not too bothered so far, I guess.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen people here discuss some of the stuff Ratzilla&amp;#39;s said about this sub and her overall attitude, so I don&amp;#39;t give a crap honestly&lt;/p&gt;\n\n&lt;p&gt;The Ordinary is fine in my book so far. I don&amp;#39;t doubt the overall quality - the stuff I&amp;#39;ve (and my mom) tried, worked for us well, and the price is remarkable. Have to say I&amp;#39;ve never encountered their customer service myself, and the fact that it does seem like their products under separate brands are kind of like &amp;quot;okay, good, great&amp;quot;, but I mean I didn&amp;#39;t ask for a new face for $6, so I&amp;#39;m not too bothered so far, I guess.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgb7ded", "score_hidden": false, "stickied": false, "created": 1492320621.0, "created_utc": 1492291821.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgbw4m1", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "neopetian", "parent_id": "t1_dgbbhoo", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Right? The critiques were primarily aimed at their marketing choices which I actually thought were quite valid, long-standing critiques. \n\n\nThe science jargon and moral high-ground which they use to market their products becomes extra hollow when you consider things like their use of niacinamide. Previous use has always been capped at 5% but they sell theirs at 10% and critique other companies for not having scientific basis in their product decisions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right? The critiques were primarily aimed at their marketing choices which I actually thought were quite valid, long-standing critiques. &lt;/p&gt;\n\n&lt;p&gt;The science jargon and moral high-ground which they use to market their products becomes extra hollow when you consider things like their use of niacinamide. Previous use has always been capped at 5% but they sell theirs at 10% and critique other companies for not having scientific basis in their product decisions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbw4m1", "score_hidden": false, "stickied": false, "created": 1492365105.0, "created_utc": 1492336305.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbhoo", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "vanityrex", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I read her review as rather mild-to-positive, not at all negative. If anything, most of her criticism have to do with TO's marketing, not their actual products, which is a strange thing to be defensive about, especially given Deciem's habit of [abusing pseudo-sciencey jargon](https://www.reddit.com/r/AsianBeauty/comments/52fbxo/niod_skin_science_and_my_issues_with/). \n\nedit: TO, not \"the TO\"", "edited": 1492298427.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read her review as rather mild-to-positive, not at all negative. If anything, most of her criticism have to do with TO&amp;#39;s marketing, not their actual products, which is a strange thing to be defensive about, especially given Deciem&amp;#39;s habit of &lt;a href=\"https://www.reddit.com/r/AsianBeauty/comments/52fbxo/niod_skin_science_and_my_issues_with/\"&gt;abusing pseudo-sciencey jargon&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;edit: TO, not &amp;quot;the TO&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbbhoo", "score_hidden": false, "stickied": false, "created": 1492326492.0, "created_utc": 1492297692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgbb00q", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "__looking_for_things", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Eh, TO is hit or miss and has been for most people. Not everything works for everyone. A person can dislike whatever they want for any reason (this is most obvious when PC is being spoken about). And, seconding what's been said already there have been multiple posts on TO inelegance, some care, some don't. \n\nI didn't find Ratzilla's review overly bias or see it as her whining. I also don't blame her about the science aspect of it because TO *does lean heavily* on this as a selling point yet they don't give any studies to back up claims (interesting though how people call out PC for only listing studies instead of linking but whatever). It would be great if that changes or if it already has because when I was looking at their product line a few weeks back, I sure had to do a google search on Ascorbyl Glucoside because no info was presented. The lack of studies doesn't bother this sub or r/sca I think because we do research or ask others who have done research, the science branding of TO speaks to us as skincare hobbiests (sp?), and we're cheap. \n\nCustomer service is big deal to a lot of people. I know that it is because of the amount of users here in r/ab I see complaining about the shipment of their goods and contacting sellers/ websites, so I think her complaint here has merit. I don't order from the TO website because they post about late shipments and they're out of products at any given time so I moved my money to another supplier of TO products to avoid that. Again, CS is a big deal to some people, if it's not to you that's cool but don't discount it as a baseless complaint. \n\nPersonally, I can't say yet if TO is effective because I'm only a couple of weeks into using a few products. And if these products aren't effective (I'm a skeptic until I see my pics) oh well, I didn't waste a large amount of money. \n\nAnd lastly, who cares if she didn't like it? I don't understand why everyone has to jump into the hype about the same brand and when someone doesn't their opinion is trashed by the sub.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, TO is hit or miss and has been for most people. Not everything works for everyone. A person can dislike whatever they want for any reason (this is most obvious when PC is being spoken about). And, seconding what&amp;#39;s been said already there have been multiple posts on TO inelegance, some care, some don&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t find Ratzilla&amp;#39;s review overly bias or see it as her whining. I also don&amp;#39;t blame her about the science aspect of it because TO &lt;em&gt;does lean heavily&lt;/em&gt; on this as a selling point yet they don&amp;#39;t give any studies to back up claims (interesting though how people call out PC for only listing studies instead of linking but whatever). It would be great if that changes or if it already has because when I was looking at their product line a few weeks back, I sure had to do a google search on Ascorbyl Glucoside because no info was presented. The lack of studies doesn&amp;#39;t bother this sub or &lt;a href=\"/r/sca\"&gt;r/sca&lt;/a&gt; I think because we do research or ask others who have done research, the science branding of TO speaks to us as skincare hobbiests (sp?), and we&amp;#39;re cheap. &lt;/p&gt;\n\n&lt;p&gt;Customer service is big deal to a lot of people. I know that it is because of the amount of users here in &lt;a href=\"/r/ab\"&gt;r/ab&lt;/a&gt; I see complaining about the shipment of their goods and contacting sellers/ websites, so I think her complaint here has merit. I don&amp;#39;t order from the TO website because they post about late shipments and they&amp;#39;re out of products at any given time so I moved my money to another supplier of TO products to avoid that. Again, CS is a big deal to some people, if it&amp;#39;s not to you that&amp;#39;s cool but don&amp;#39;t discount it as a baseless complaint. &lt;/p&gt;\n\n&lt;p&gt;Personally, I can&amp;#39;t say yet if TO is effective because I&amp;#39;m only a couple of weeks into using a few products. And if these products aren&amp;#39;t effective (I&amp;#39;m a skeptic until I see my pics) oh well, I didn&amp;#39;t waste a large amount of money. &lt;/p&gt;\n\n&lt;p&gt;And lastly, who cares if she didn&amp;#39;t like it? I don&amp;#39;t understand why everyone has to jump into the hype about the same brand and when someone doesn&amp;#39;t their opinion is trashed by the sub.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbb00q", "score_hidden": false, "stickied": false, "created": 1492325774.0, "created_utc": 1492296974.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgc8dc7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stickning", "parent_id": "t1_dgbge70", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I definitely have, both via email and over the phone. They've given me routine advice a couple of times and answered questions I had, even though I had a lot of questions and it took awhile, the guy I spoke to didn't try to get rid of me, or shorten the convo, or deliver what seemed like pre-written lines. I was pretty pleased, actually. And my last two orders were sent out the day after I placed them (the shortest it's ever taken them to get out an order to me; I think they might be hiring &amp; training additional ppl). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I definitely have, both via email and over the phone. They&amp;#39;ve given me routine advice a couple of times and answered questions I had, even though I had a lot of questions and it took awhile, the guy I spoke to didn&amp;#39;t try to get rid of me, or shorten the convo, or deliver what seemed like pre-written lines. I was pretty pleased, actually. And my last two orders were sent out the day after I placed them (the shortest it&amp;#39;s ever taken them to get out an order to me; I think they might be hiring &amp;amp; training additional ppl). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgc8dc7", "score_hidden": false, "stickied": false, "created": 1492389335.0, "created_utc": 1492360535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbge70", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "palaisroyal", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "IMO everyone is entitled to their opinion based on their experience with the products and the brand, Ratzilla the same. I have seen her post negative reviews in the past (albeit rare) so it isn't really that surprising. I was wondering, has anyone else received beyond excellent CS from Deciem? I visited one of their physical stores and the sales rep actually knew what they were talking about and had extensive product knowledge, routine order etc in comparison to people from major beauty stores *cough* Sephora &amp; Mecca Cosmetica *cough* ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMO everyone is entitled to their opinion based on their experience with the products and the brand, Ratzilla the same. I have seen her post negative reviews in the past (albeit rare) so it isn&amp;#39;t really that surprising. I was wondering, has anyone else received beyond excellent CS from Deciem? I visited one of their physical stores and the sales rep actually knew what they were talking about and had extensive product knowledge, routine order etc in comparison to people from major beauty stores &lt;em&gt;cough&lt;/em&gt; Sephora &amp;amp; Mecca Cosmetica &lt;em&gt;cough&lt;/em&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbge70", "score_hidden": false, "stickied": false, "created": 1492333444.0, "created_utc": 1492304644.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgc0teu", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Thatsbasic", "parent_id": "t1_dgbb11x", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Thank you for writing this. The Ordinary isn't the be-all, end-all science skincare company, and r/asianbeauty isn't the be-all, end-all internet source for Asian and Asian-style skincare.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for writing this. The Ordinary isn&amp;#39;t the be-all, end-all science skincare company, and &lt;a href=\"/r/asianbeauty\"&gt;r/asianbeauty&lt;/a&gt; isn&amp;#39;t the be-all, end-all internet source for Asian and Asian-style skincare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgc0teu", "score_hidden": false, "stickied": false, "created": 1492377994.0, "created_utc": 1492349194.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb11x", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "sodappend", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I found it to be a reasonable review. I didn't find her whiney at all \n- she's right that the 'sciency' skincare aesthetic can be just as misleading as 'all-natural' skincare. It's all marketing.\n\nTO can be hit-or-miss, IMO. While the prices you pay to access active ingredients are amazing, their formulations aren't always going to be the best or most effective (YMMV, of course.) Some of their formulations are actually pretty terrible - I use the Azelaic acid on my body but I would never be able to layer it on my face, and just hearing about the texture of the vitamin c suspension from all the reviews I've seen of it make me never want to touch it with a ten foot pole. I wan't to point out that she never said the products and the active ingredients in them aren't effective in general - just that they didn't do much for her skin. I think that's fair.\n\nPersonally I really love Buffet because it makes my skin feel nice and it has *potential* anti-aging benefits in the long run, but she's also right in that research on peptides are very limited.\n\nOverall I agree with her. The Ordinary has some good products, some decent products, and a few terrible ones. The prices make the brand very appealing, but in the end it's just an average brand. \n\nA little off-topic, but I quite like how critical Ratzilla is of the AB community's attitude in general, even if I don't *always* agree with her. It's very refreshing to read someone who doesn't buy into hype so easily and offers opposing views. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found it to be a reasonable review. I didn&amp;#39;t find her whiney at all \n- she&amp;#39;s right that the &amp;#39;sciency&amp;#39; skincare aesthetic can be just as misleading as &amp;#39;all-natural&amp;#39; skincare. It&amp;#39;s all marketing.&lt;/p&gt;\n\n&lt;p&gt;TO can be hit-or-miss, IMO. While the prices you pay to access active ingredients are amazing, their formulations aren&amp;#39;t always going to be the best or most effective (YMMV, of course.) Some of their formulations are actually pretty terrible - I use the Azelaic acid on my body but I would never be able to layer it on my face, and just hearing about the texture of the vitamin c suspension from all the reviews I&amp;#39;ve seen of it make me never want to touch it with a ten foot pole. I wan&amp;#39;t to point out that she never said the products and the active ingredients in them aren&amp;#39;t effective in general - just that they didn&amp;#39;t do much for her skin. I think that&amp;#39;s fair.&lt;/p&gt;\n\n&lt;p&gt;Personally I really love Buffet because it makes my skin feel nice and it has &lt;em&gt;potential&lt;/em&gt; anti-aging benefits in the long run, but she&amp;#39;s also right in that research on peptides are very limited.&lt;/p&gt;\n\n&lt;p&gt;Overall I agree with her. The Ordinary has some good products, some decent products, and a few terrible ones. The prices make the brand very appealing, but in the end it&amp;#39;s just an average brand. &lt;/p&gt;\n\n&lt;p&gt;A little off-topic, but I quite like how critical Ratzilla is of the AB community&amp;#39;s attitude in general, even if I don&amp;#39;t &lt;em&gt;always&lt;/em&gt; agree with her. It&amp;#39;s very refreshing to read someone who doesn&amp;#39;t buy into hype so easily and offers opposing views. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbb11x", "score_hidden": false, "stickied": false, "created": 1492325816.0, "created_utc": 1492297016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgb6szn", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "theCuriousAmerican", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Mmm her attitudes on this sub and the reception of said attitude is split. \n\nHow people view her as a result is also split. TO even on this sub is very split. Many people have noticed its cosmetic inelegance and spotty customer service. There were posts about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mmm her attitudes on this sub and the reception of said attitude is split. &lt;/p&gt;\n\n&lt;p&gt;How people view her as a result is also split. TO even on this sub is very split. Many people have noticed its cosmetic inelegance and spotty customer service. There were posts about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgb6szn", "score_hidden": false, "stickied": false, "created": 1492319838.0, "created_utc": 1492291038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgb96op", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "NotInARushYet", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I didn't buy directly from TO but an official stockist so can't really comment on customer service, but I have used quite a few of their products now for about two months with results. I highly recommend it especially as a student on a budget. Surprisingly one of her of the items she recommended the Ascorbyl Tetraisopalmitate does contain coconut oil derivatives which have been causing break outs for some people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t buy directly from TO but an official stockist so can&amp;#39;t really comment on customer service, but I have used quite a few of their products now for about two months with results. I highly recommend it especially as a student on a budget. Surprisingly one of her of the items she recommended the Ascorbyl Tetraisopalmitate does contain coconut oil derivatives which have been causing break outs for some people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgb96op", "score_hidden": false, "stickied": false, "created": 1492323126.0, "created_utc": 1492294326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgbdoml", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "trucie", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "The caffeine is actually the only one I repurchase, it depuff my eyebags like magic ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The caffeine is actually the only one I repurchase, it depuff my eyebags like magic &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbdoml", "score_hidden": false, "stickied": false, "created": 1492329580.0, "created_utc": 1492300780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgc72g7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "uglybutterfly025", "parent_id": "t1_dgc0zxp", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I think most people who see or\nHear about the ordinary on instagram or whatever don't really know the difference between the acids or what they're supposed to smell like anyway. Most just go to the website, read what information is under each little picture and decide based almost solely on that. Is it effective? Who knows, not those people. I say this because my first purchase there I was one. The beauty industry has done a great job making acids look like a cure all ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think most people who see or\nHear about the ordinary on instagram or whatever don&amp;#39;t really know the difference between the acids or what they&amp;#39;re supposed to smell like anyway. Most just go to the website, read what information is under each little picture and decide based almost solely on that. Is it effective? Who knows, not those people. I say this because my first purchase there I was one. The beauty industry has done a great job making acids look like a cure all &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgc72g7", "score_hidden": false, "stickied": false, "created": 1492387600.0, "created_utc": 1492358800.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0zxp", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Thatsbasic", "parent_id": "t1_dgbbvmy", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Tracy u/fanserviced mentioned this thought and an even deeper suspicion in a recent review. At first it seems a little far fetched but if the company is deliberately making the Lactic Acid smell like THAT, the theory suddenly seems more plausible to me. 😂\n\n&gt; Part of me wonders if the Ordinary’s formulations are effective, but purposely a little shitty to encourage people to pony up for the more sophisticated Hylamide and NIOD lines. This isn’t some profound, original thought — plenty of people have been speculating along those lines. For example, the repulsive scent in the lactic acids comes from an added fragrance. It really doesn’t need to be there, but for some reason it is, and it really spoils an otherwise fine product (the 10% lactic).\n\nhttp://www.fanserviced-b.com/sorry-i-cant-get-it-up-for-the-ordinary/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tracy &lt;a href=\"/u/fanserviced\"&gt;u/fanserviced&lt;/a&gt; mentioned this thought and an even deeper suspicion in a recent review. At first it seems a little far fetched but if the company is deliberately making the Lactic Acid smell like THAT, the theory suddenly seems more plausible to me. 😂&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Part of me wonders if the Ordinary’s formulations are effective, but purposely a little shitty to encourage people to pony up for the more sophisticated Hylamide and NIOD lines. This isn’t some profound, original thought — plenty of people have been speculating along those lines. For example, the repulsive scent in the lactic acids comes from an added fragrance. It really doesn’t need to be there, but for some reason it is, and it really spoils an otherwise fine product (the 10% lactic).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.fanserviced-b.com/sorry-i-cant-get-it-up-for-the-ordinary/\"&gt;http://www.fanserviced-b.com/sorry-i-cant-get-it-up-for-the-ordinary/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgc0zxp", "score_hidden": false, "stickied": false, "created": 1492378341.0, "created_utc": 1492349541.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbvmy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "uglybutterfly025", "parent_id": "t1_dgbaofm", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "The thing that they did that I think is smart is link all their other website to the Ordinary. So you hear about the ordinary and you look at their site, order something, now you see all their other companies and products too and you find something you want later ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing that they did that I think is smart is link all their other website to the Ordinary. So you hear about the ordinary and you look at their site, order something, now you see all their other companies and products too and you find something you want later &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbbvmy", "score_hidden": false, "stickied": false, "created": 1492327054.0, "created_utc": 1492298254.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbaofm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theCuriousAmerican", "parent_id": "t1_dgba2pw", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I agree they have higher end products that focus on that experience too. :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree they have higher end products that focus on that experience too. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbaofm", "score_hidden": false, "stickied": false, "created": 1492325293.0, "created_utc": 1492296493.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgba2pw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "uglybutterfly025", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I don't like that she says it might sink the company after the hype dies down to me saying something g like that makes it seem like you're just casting stones. Anyone who has been to The Ordinary website can see that they own many other sister companies that have a variety of other products. I've used a couple of the ordinary's products and the customer service was fine and the serums were good ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t like that she says it might sink the company after the hype dies down to me saying something g like that makes it seem like you&amp;#39;re just casting stones. Anyone who has been to The Ordinary website can see that they own many other sister companies that have a variety of other products. I&amp;#39;ve used a couple of the ordinary&amp;#39;s products and the customer service was fine and the serums were good &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgba2pw", "score_hidden": false, "stickied": false, "created": 1492324401.0, "created_utc": 1492295601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgd2ahb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ondine____", "parent_id": "t1_dgccrc6", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Thanks for taking the time to write this post! I'll keep all these in mind. I have to admit I've never seen some of the ingredients in their products (like the ALA) other than the usual hyaluronic acid, oils etc. so I was pretty intrigued. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for taking the time to write this post! I&amp;#39;ll keep all these in mind. I have to admit I&amp;#39;ve never seen some of the ingredients in their products (like the ALA) other than the usual hyaluronic acid, oils etc. so I was pretty intrigued. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgd2ahb", "score_hidden": false, "stickied": false, "created": 1492429471.0, "created_utc": 1492400671.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccrc6", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "thebirdisdead", "parent_id": "t1_dgc1e7t", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I'm not using their squalane, but I am using squalane in my routine and I *highly* recommend it. It's very light and makes my skin softer than anything. When my squalane runs out, I'll probably restock from the Ordinary. I'm currently using:\n\nLAA vitamin c suspension-from all the reviews, I thought this was going to be terrible. Surprisingly, mine actually isn't gritty the way the reviews describe it. It's an odd consistency, sort of a thick, white sort of emulsion texture. Too thick to use the dropper bottle it comes with, but spreads and sinks in easily when it touches my skin, not at all what I would have expected just looking at it. It does have occasional tiny vitamin c crystals, which are the gritty bits everyone complains about, but they're pretty rare, definitely not part of the overall texture. I like that it's not water based and therefore not prone to oxidation, but not oily like other non-aqueous formulas I've tried. Also the price point is pretty beautiful.  \n\n10% Argireline solution-This is pretty new. I use it in the hope that it will prevent me from tensing the skin around my eyes and forehead so much. No idea if it works, but the formula itself is light as water, pretty much the consistency of a light hydrating toner. Sinks in quickly, no residue. Much cheaper than other formulas out there that contain argireline, a high percentage, and really inoffensive to use.\n\nBuffet serum-I've always tried to have peptides in my routine. Typically they've been scattered about and expensive. With this serum though, all my peptides are in one place and cheap. It's a clear, light serum consistency. Spreads easily, sinks in easily. No residue. \n\nAlpha Arbutin 2%-I don't use this much anymore except as an occasional spot treatment because I'm already quite pale and don't have any lasting hyperpigmentation. But it's a similar consistency to the Buffet. Clear, serum texture, spreads easily, no noticeable residue for me. For lightening, it's quite powerful, and way cheaper than any other 2% alpha Arbutin products I've come across.\n\n\nAlpha Lipoic Acid 5%-this stuff is intense and when I introduced it too quickly into my routine I got some peeling. I'm big on antioxidants in my routine though, so I love it. Before the Ordinary I had never seen ALA sold as the primary ingredient in any skincare item. This in a non-aqueous solution, because ALA tends to be highly unstable in water, and I love that the Ordinary pays attention to that kind of thing, and also ships it in a dark bottle to protect it from sunlight. This is an oil texture, so lately I've been mixing it with my skincare oils during that part of my routine-a few drops mixed with rosehip oil or squalane, or alternately mixed into my lotion depending on how I'm feeling. \n\nAzelaic 10% Suspension-I wasn't sure how I was going to feel about this, because the medium is a little odd. It's thicker than my Curology formula, and I use a thin layer. I don't use it every day, but it sinks in surprisingly well on me and I don't mind the cream/lotion texture as much as I thought I would. Still unsure of the best place for it in my routine.\n\n\nThings from the Ordinary that *haven't* worked for me include:\n\n10% niacinamide+zinc-unfortunately this broke me out, but otherwise would have beeb nice. Similar texture consistency to Buffet/alpha Arbutin.\n\nThe 2% retinol-I really wanted to like this because of the price point, but it seemed to break me out. I'm not sure if it was purging, but either way I didn't like it as much as my current retinol HG, so I gave up on it.\n\nThere's some mini-reviews for you!", "edited": 1492367963.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not using their squalane, but I am using squalane in my routine and I &lt;em&gt;highly&lt;/em&gt; recommend it. It&amp;#39;s very light and makes my skin softer than anything. When my squalane runs out, I&amp;#39;ll probably restock from the Ordinary. I&amp;#39;m currently using:&lt;/p&gt;\n\n&lt;p&gt;LAA vitamin c suspension-from all the reviews, I thought this was going to be terrible. Surprisingly, mine actually isn&amp;#39;t gritty the way the reviews describe it. It&amp;#39;s an odd consistency, sort of a thick, white sort of emulsion texture. Too thick to use the dropper bottle it comes with, but spreads and sinks in easily when it touches my skin, not at all what I would have expected just looking at it. It does have occasional tiny vitamin c crystals, which are the gritty bits everyone complains about, but they&amp;#39;re pretty rare, definitely not part of the overall texture. I like that it&amp;#39;s not water based and therefore not prone to oxidation, but not oily like other non-aqueous formulas I&amp;#39;ve tried. Also the price point is pretty beautiful.  &lt;/p&gt;\n\n&lt;p&gt;10% Argireline solution-This is pretty new. I use it in the hope that it will prevent me from tensing the skin around my eyes and forehead so much. No idea if it works, but the formula itself is light as water, pretty much the consistency of a light hydrating toner. Sinks in quickly, no residue. Much cheaper than other formulas out there that contain argireline, a high percentage, and really inoffensive to use.&lt;/p&gt;\n\n&lt;p&gt;Buffet serum-I&amp;#39;ve always tried to have peptides in my routine. Typically they&amp;#39;ve been scattered about and expensive. With this serum though, all my peptides are in one place and cheap. It&amp;#39;s a clear, light serum consistency. Spreads easily, sinks in easily. No residue. &lt;/p&gt;\n\n&lt;p&gt;Alpha Arbutin 2%-I don&amp;#39;t use this much anymore except as an occasional spot treatment because I&amp;#39;m already quite pale and don&amp;#39;t have any lasting hyperpigmentation. But it&amp;#39;s a similar consistency to the Buffet. Clear, serum texture, spreads easily, no noticeable residue for me. For lightening, it&amp;#39;s quite powerful, and way cheaper than any other 2% alpha Arbutin products I&amp;#39;ve come across.&lt;/p&gt;\n\n&lt;p&gt;Alpha Lipoic Acid 5%-this stuff is intense and when I introduced it too quickly into my routine I got some peeling. I&amp;#39;m big on antioxidants in my routine though, so I love it. Before the Ordinary I had never seen ALA sold as the primary ingredient in any skincare item. This in a non-aqueous solution, because ALA tends to be highly unstable in water, and I love that the Ordinary pays attention to that kind of thing, and also ships it in a dark bottle to protect it from sunlight. This is an oil texture, so lately I&amp;#39;ve been mixing it with my skincare oils during that part of my routine-a few drops mixed with rosehip oil or squalane, or alternately mixed into my lotion depending on how I&amp;#39;m feeling. &lt;/p&gt;\n\n&lt;p&gt;Azelaic 10% Suspension-I wasn&amp;#39;t sure how I was going to feel about this, because the medium is a little odd. It&amp;#39;s thicker than my Curology formula, and I use a thin layer. I don&amp;#39;t use it every day, but it sinks in surprisingly well on me and I don&amp;#39;t mind the cream/lotion texture as much as I thought I would. Still unsure of the best place for it in my routine.&lt;/p&gt;\n\n&lt;p&gt;Things from the Ordinary that &lt;em&gt;haven&amp;#39;t&lt;/em&gt; worked for me include:&lt;/p&gt;\n\n&lt;p&gt;10% niacinamide+zinc-unfortunately this broke me out, but otherwise would have beeb nice. Similar texture consistency to Buffet/alpha Arbutin.&lt;/p&gt;\n\n&lt;p&gt;The 2% retinol-I really wanted to like this because of the price point, but it seemed to break me out. I&amp;#39;m not sure if it was purging, but either way I didn&amp;#39;t like it as much as my current retinol HG, so I gave up on it.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s some mini-reviews for you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgccrc6", "score_hidden": false, "stickied": false, "created": 1492395082.0, "created_utc": 1492366282.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgdftnh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ondine____", "parent_id": "t1_dgdeyle", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I see! Thanks :) just placed an order for it and the argan oil. Fingers crossed it works out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see! Thanks :) just placed an order for it and the argan oil. Fingers crossed it works out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgdftnh", "score_hidden": false, "stickied": false, "created": 1492462388.0, "created_utc": 1492433588.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdeyle", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stickning", "parent_id": "t1_dgd2dji", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "It's not particularly sticky, it's more like an oil - like any other squalane, really. I use it am &amp; pm - it can leave my skin a bit shiny, so I mix it into my moisturizer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not particularly sticky, it&amp;#39;s more like an oil - like any other squalane, really. I use it am &amp;amp; pm - it can leave my skin a bit shiny, so I mix it into my moisturizer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgdeyle", "score_hidden": false, "stickied": false, "created": 1492460730.0, "created_utc": 1492431930.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2dji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ondine____", "parent_id": "t1_dgc8jf9", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I see! How does the texture feel like? Is it sticky? I'm thinking of adding it into my PM routine which is basically just micellar water and aloe vera gel right now and I'm not sure whether I should use it as my last step or before the gel. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see! How does the texture feel like? Is it sticky? I&amp;#39;m thinking of adding it into my PM routine which is basically just micellar water and aloe vera gel right now and I&amp;#39;m not sure whether I should use it as my last step or before the gel. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgd2dji", "score_hidden": false, "stickied": false, "created": 1492429603.0, "created_utc": 1492400803.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8jf9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Stickning", "parent_id": "t1_dgc1e7t", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "The squalane is great - very no-frills, excellent quality, good price. I used to use Peter Thomas Roth Squalane, with is $21/oz on Amazon; TO's is $7.90/oz. No brainer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The squalane is great - very no-frills, excellent quality, good price. I used to use Peter Thomas Roth Squalane, with is $21/oz on Amazon; TO&amp;#39;s is $7.90/oz. No brainer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgc8jf9", "score_hidden": false, "stickied": false, "created": 1492389556.0, "created_utc": 1492360756.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1e7t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ondine____", "parent_id": "t1_dgbv2vf", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Which of their products are you using? I'm thinking of getting the squalane oil since my skin is screaming for hydration, but there doesn't appear to be a lot of reviews on it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which of their products are you using? I&amp;#39;m thinking of getting the squalane oil since my skin is screaming for hydration, but there doesn&amp;#39;t appear to be a lot of reviews on it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgc1e7t", "score_hidden": false, "stickied": false, "created": 1492379086.0, "created_utc": 1492350286.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbv2vf", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "thebirdisdead", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "The Ordinary has been gradually taking over my routine. I'm willing to forgive them whatever marketing and costumer service flukes they've made so far because their products are cheap, no frills, and kind of amazing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Ordinary has been gradually taking over my routine. I&amp;#39;m willing to forgive them whatever marketing and costumer service flukes they&amp;#39;ve made so far because their products are cheap, no frills, and kind of amazing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbv2vf", "score_hidden": false, "stickied": false, "created": 1492361501.0, "created_utc": 1492332701.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgc6ovr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "capybara3000", "parent_id": "t1_dgbwu07", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "It is possible that the markup is due to distribution deals with other stockists. I have no special insight into this, but it is often the case that companies have to match the price that third-party retailers are selling it at within a country.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is possible that the markup is due to distribution deals with other stockists. I have no special insight into this, but it is often the case that companies have to match the price that third-party retailers are selling it at within a country.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgc6ovr", "score_hidden": false, "stickied": false, "created": 1492387076.0, "created_utc": 1492358276.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgempwg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HunnyPopcorn", "parent_id": "t1_dgbwu07", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Maybe it's a regional thing? I've dealt with their CS twice and they have been very responsive and wonderful (I'm in the US)! One of the Hylamide's products did not work out for me, so when I sent an email regarding a return, they replied the next business day, refunded me right away and let me keep the product. Second time, they accidently sent me 2 squalanes instead of the 2 rosehip oils I ordered. The let me keep both squalanes and shipped me the 2 rosehip oils.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe it&amp;#39;s a regional thing? I&amp;#39;ve dealt with their CS twice and they have been very responsive and wonderful (I&amp;#39;m in the US)! One of the Hylamide&amp;#39;s products did not work out for me, so when I sent an email regarding a return, they replied the next business day, refunded me right away and let me keep the product. Second time, they accidently sent me 2 squalanes instead of the 2 rosehip oils I ordered. The let me keep both squalanes and shipped me the 2 rosehip oils.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgempwg", "score_hidden": false, "stickied": false, "created": 1492514879.0, "created_utc": 1492486079.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbwu07", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cataelle", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "In terms of CS, I'm kinda wondering if maybe there's a difference in buying experience when you're in NA or outside (I always assumed Ratzilla is in Japan but idk).  \n  \nOne of the things that turns me off from Deciem is how they automatically adjust prices depending on where you geolocate: I can get nearly half off just by using a Canadian proxy without any changes to shipping price. With how much TO builds its image on reasonable pricing, the whole not-mentioning-markups is really ?? to me. Additionally, I've ordered twice so far and each time I got no shipping info and was totally in the blind until I got a missed delivery slip from Japan Post. I emailed the first time asking for shipping info (they didn't even mark my order as \"shipped\") and didn't get a response until after it arrived. Same with emailing about a product restock: didn't get a response until almost a week after it restocked. So they answer, but their response time makes responding entirely pointless.  \n  \nIdk if this is how Deciem CS usually works, or maybe I just have had bad luck/timing, but I can honestly say I am not a fan of Deciem's CS. I continue to order from them simply because I trust it'll get here eventually, which is something I can't say the same for about other companies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In terms of CS, I&amp;#39;m kinda wondering if maybe there&amp;#39;s a difference in buying experience when you&amp;#39;re in NA or outside (I always assumed Ratzilla is in Japan but idk).  &lt;/p&gt;\n\n&lt;p&gt;One of the things that turns me off from Deciem is how they automatically adjust prices depending on where you geolocate: I can get nearly half off just by using a Canadian proxy without any changes to shipping price. With how much TO builds its image on reasonable pricing, the whole not-mentioning-markups is really ?? to me. Additionally, I&amp;#39;ve ordered twice so far and each time I got no shipping info and was totally in the blind until I got a missed delivery slip from Japan Post. I emailed the first time asking for shipping info (they didn&amp;#39;t even mark my order as &amp;quot;shipped&amp;quot;) and didn&amp;#39;t get a response until after it arrived. Same with emailing about a product restock: didn&amp;#39;t get a response until almost a week after it restocked. So they answer, but their response time makes responding entirely pointless.  &lt;/p&gt;\n\n&lt;p&gt;Idk if this is how Deciem CS usually works, or maybe I just have had bad luck/timing, but I can honestly say I am not a fan of Deciem&amp;#39;s CS. I continue to order from them simply because I trust it&amp;#39;ll get here eventually, which is something I can&amp;#39;t say the same for about other companies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbwu07", "score_hidden": false, "stickied": false, "created": 1492367555.0, "created_utc": 1492338755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgbyaae", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "k4zoo", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "the niacinamide one disappointed me so I've been wary about TO but whaaaa they have a glycolic and lactic acid serum....I may have to look into this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the niacinamide one disappointed me so I&amp;#39;ve been wary about TO but whaaaa they have a glycolic and lactic acid serum....I may have to look into this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbyaae", "score_hidden": false, "stickied": false, "created": 1492372130.0, "created_utc": 1492343330.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgcib6n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "psithyrstes", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "I love The Ordinary and its sciencewashing is a huge problem. For instance, I have yet to see any sources on their claims that acids like AHAs and BHAs are inflammatory, yet it's something they claim constantly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love The Ordinary and its sciencewashing is a huge problem. For instance, I have yet to see any sources on their claims that acids like AHAs and BHAs are inflammatory, yet it&amp;#39;s something they claim constantly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgcib6n", "score_hidden": false, "stickied": false, "created": 1492402419.0, "created_utc": 1492373619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgbdxo1", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "pm_me_ur_river_otter", "parent_id": "t1_dgbd223", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "a few times!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a few times!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbdxo1", "score_hidden": false, "stickied": false, "created": 1492329911.0, "created_utc": 1492301111.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbd223", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ZeeBail", "parent_id": "t1_dgb7nrk", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Um, so I have to ask... have you ever actually been PM'd a river otter pic?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Um, so I have to ask... have you ever actually been PM&amp;#39;d a river otter pic?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbd223", "score_hidden": false, "stickied": false, "created": 1492328725.0, "created_utc": 1492299925.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7nrk", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "pm_me_ur_river_otter", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Is anyone surprised", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is anyone surprised&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgb7nrk", "score_hidden": false, "stickied": false, "created": 1492321004.0, "created_utc": 1492292204.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgb92ew", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "GiveMeABreak25", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "It's more about her hatred of anything any of the reddit skin care sub's like than anything. Moving on......", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s more about her hatred of anything any of the reddit skin care sub&amp;#39;s like than anything. Moving on......&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgb92ew", "score_hidden": false, "stickied": false, "created": 1492322964.0, "created_utc": 1492294164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgbje2w", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "gabbygoldstein", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "She probably couldn't get an affiliate link for them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She probably couldn&amp;#39;t get an affiliate link for them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgbje2w", "score_hidden": false, "stickied": false, "created": 1492337806.0, "created_utc": 1492309006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgcra8s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "oitb", "parent_id": "t1_dgcr3wk", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "yes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yes&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgcra8s", "score_hidden": false, "stickied": false, "created": 1492414382.0, "created_utc": 1492385582.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr3wk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lackingagency", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 1, "body": "I respect her as a skincare blogger, but she always comes off like she has a chip on her shoulder tbqh.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I respect her as a skincare blogger, but she always comes off like she has a chip on her shoulder tbqh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgcr3wk", "score_hidden": false, "stickied": false, "created": 1492414139.0, "created_utc": 1492385339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgcme40", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Puppywanton", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "The Ordinary's products are hit or miss IMO. So is their customer service. When it's good, it's great, but then there are times when it is so lacklustre. So far I'm in agreement about the ATIP in vit F. Guess I should pick up the squalane too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Ordinary&amp;#39;s products are hit or miss IMO. So is their customer service. When it&amp;#39;s good, it&amp;#39;s great, but then there are times when it is so lacklustre. So far I&amp;#39;m in agreement about the ATIP in vit F. Guess I should pick up the squalane too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgcme40", "score_hidden": false, "stickied": false, "created": 1492407728.0, "created_utc": 1492378928.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w0u7", "removal_reason": null, "link_id": "t3_65lfsh", "likes": null, "replies": "", "user_reports": [], "id": "dgevxeh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ronrinesu", "parent_id": "t3_65lfsh", "subreddit_name_prefixed": "r/AsianBeauty", "controversiality": 0, "body": "Tbh I don't understand why a lot of bloggers hated on that brand. Their serums are between 6-9€. I don't know where everyone else lives but finding a serum that works in that price-range is very hard in the EU. I got into AB exactly because it's affordable. My old favorite the Mizon Snail Ampoule comes to mind in terms of a great inexpensive product. \n\nI recently ordered 5 of the TO serums and I am pretty impressed, it all came down to 32€ and free shipping and they even shipped with express delivery (altho the express private-own company in France is utter crap but that isn't any brand's fault) so I had a very positive experience. I didn't even have to pay tax because they ship from the UK. I absolutely loved the hyaluronic acid serum, I have dry skin so this comes really handy and it's dirt cheap, so yes please. I still haven't properly tested the squalane but the texture seems nice. The niacinamide serum has great texture as well. The caffeine serum looks interesting, I've been using it daily for a week, I barely have dark circles so it might work on me. The vitamin C suspension has kinda of an icky formula but I can live with it if it works, especially for that price tag. \n\nCustomer service was nice because I messaged them asking if they deliver free over 30€ to Bulgaria too because I wanted to get her some serums as a birthday gift, they responded within an hour. \n\nQuite honestly, as a blogger I am really bummed when another blogger bashes an entire brand just because they didn't like the couple of products they used. \n\nAlso, in terms of sciencewashing, again as a bio major, TO are definitely on the nicer side of the things. Sciencewashing in skincare has been a thing for ages and theirs is truly minimal compared to some other brands, so I find it a little odd to complain about that specifically. It's good to stay critical but when the vast majority of this sub uses ferments, snails and propolis in their routine while there are minimal or no studies to prove their effectiveness but that hasn't stopped many of us from using these ingredients, it's just a bit weird. I don't know, their marketing is really the last thing that bothers me in this case. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tbh I don&amp;#39;t understand why a lot of bloggers hated on that brand. Their serums are between 6-9€. I don&amp;#39;t know where everyone else lives but finding a serum that works in that price-range is very hard in the EU. I got into AB exactly because it&amp;#39;s affordable. My old favorite the Mizon Snail Ampoule comes to mind in terms of a great inexpensive product. &lt;/p&gt;\n\n&lt;p&gt;I recently ordered 5 of the TO serums and I am pretty impressed, it all came down to 32€ and free shipping and they even shipped with express delivery (altho the express private-own company in France is utter crap but that isn&amp;#39;t any brand&amp;#39;s fault) so I had a very positive experience. I didn&amp;#39;t even have to pay tax because they ship from the UK. I absolutely loved the hyaluronic acid serum, I have dry skin so this comes really handy and it&amp;#39;s dirt cheap, so yes please. I still haven&amp;#39;t properly tested the squalane but the texture seems nice. The niacinamide serum has great texture as well. The caffeine serum looks interesting, I&amp;#39;ve been using it daily for a week, I barely have dark circles so it might work on me. The vitamin C suspension has kinda of an icky formula but I can live with it if it works, especially for that price tag. &lt;/p&gt;\n\n&lt;p&gt;Customer service was nice because I messaged them asking if they deliver free over 30€ to Bulgaria too because I wanted to get her some serums as a birthday gift, they responded within an hour. &lt;/p&gt;\n\n&lt;p&gt;Quite honestly, as a blogger I am really bummed when another blogger bashes an entire brand just because they didn&amp;#39;t like the couple of products they used. &lt;/p&gt;\n\n&lt;p&gt;Also, in terms of sciencewashing, again as a bio major, TO are definitely on the nicer side of the things. Sciencewashing in skincare has been a thing for ages and theirs is truly minimal compared to some other brands, so I find it a little odd to complain about that specifically. It&amp;#39;s good to stay critical but when the vast majority of this sub uses ferments, snails and propolis in their routine while there are minimal or no studies to prove their effectiveness but that hasn&amp;#39;t stopped many of us from using these ingredients, it&amp;#39;s just a bit weird. I don&amp;#39;t know, their marketing is really the last thing that bothers me in this case. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AsianBeauty", "name": "t1_dgevxeh", "score_hidden": true, "stickied": false, "created": 1492534144.0, "created_utc": 1492505344.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]