[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "nintendo", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Nintendo Switch takes a piece of DNA from each video game platform Nintendo has released. From the 2 Controllers of the Famicom, to the portability of the Game Boy, to the motion and touch controls of the Wii and DS, and everything in between.&lt;/p&gt;\n\n&lt;p&gt;But one system in that long line of inspiration seems to be the pony Nintendo&amp;#39;s betting the Switch on being the most, the Famicom. Both it and the Switch seem to have a lot in common. They come with 2 controllers, they were built using commonly used, off-the-shelf chipsets (and thus were made easy for developers to program for), and offer a lot in terms of potential for peripherals and add-ons (Famicom had the Disk System, ROB, Gun, etc, and the Switch has that battery pack, amiibo, and who knows what else Nintendo has in development).&lt;/p&gt;\n\n&lt;p&gt;But the main thing they both have in common, is that they seem to mark a new starting point for Nintendo&amp;#39;s software development. At the time of the Famicom, Nintendo was still trying to find an identity as a game developer. Mario had just barely become the company mascot, and many of the creators and artists we know today like Shigeru Miyamoto and Yoshio Sakamoto were still very new to the company. As such, Nintendo did a lot of throwing stuff at the wall to see what sticks.  We saw a lot of games from Nintendo&amp;#39;s in-house studios that you wouldn&amp;#39;t normally associate with Nintendo. A lot of Sports games, Mach Rider, The Famicom Detective series, Wild Gunman, StarTropics, Urban Champion, Clu Clu Land, Joy-Mech Fight, hell, it was the starting point for Nintendo&amp;#39;s lesser known properties like Kid Icarus, and was where Metroid, Fire Emblem, and Nintendo Wars (Advance Wars essentially) were born. Fire Emblem and Advance Wars were largely developed by Nintendo R&amp;amp;D1, since Intelligent Systems at the time was nothing more than just a guy hired by Nintendo to assist programming. &lt;/p&gt;\n\n&lt;p&gt;This brings us to the Switch. Nintendo has restructured it&amp;#39;s in-house development, and much of the old guard from the Famicom and Super Famicom era are taking a back seat, leaving the N64 and onward era stars like Yoshiaki Koizumi, along young and upcoming developers and directors like Splatoon co-creator Tsubasa Sakaguchi to call the shots. With the likes of 1-2 Switch, ARMS, and the other unconventional games Nintendo probably has lined up, Nintendo probably sees the Switch as an opportunity to hit the reset button, and re-invent themselves as a game developer. I&amp;#39;m looking forward to seeing what&amp;#39;s next from Nintendo&amp;#39;s talent. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The Nintendo Switch takes a piece of DNA from each video game platform Nintendo has released. From the 2 Controllers of the Famicom, to the portability of the Game Boy, to the motion and touch controls of the Wii and DS, and everything in between.\n\nBut one system in that long line of inspiration seems to be the pony Nintendo's betting the Switch on being the most, the Famicom. Both it and the Switch seem to have a lot in common. They come with 2 controllers, they were built using commonly used, off-the-shelf chipsets (and thus were made easy for developers to program for), and offer a lot in terms of potential for peripherals and add-ons (Famicom had the Disk System, ROB, Gun, etc, and the Switch has that battery pack, amiibo, and who knows what else Nintendo has in development).\n\nBut the main thing they both have in common, is that they seem to mark a new starting point for Nintendo's software development. At the time of the Famicom, Nintendo was still trying to find an identity as a game developer. Mario had just barely become the company mascot, and many of the creators and artists we know today like Shigeru Miyamoto and Yoshio Sakamoto were still very new to the company. As such, Nintendo did a lot of throwing stuff at the wall to see what sticks.  We saw a lot of games from Nintendo's in-house studios that you wouldn't normally associate with Nintendo. A lot of Sports games, Mach Rider, The Famicom Detective series, Wild Gunman, StarTropics, Urban Champion, Clu Clu Land, Joy-Mech Fight, hell, it was the starting point for Nintendo's lesser known properties like Kid Icarus, and was where Metroid, Fire Emblem, and Nintendo Wars (Advance Wars essentially) were born. Fire Emblem and Advance Wars were largely developed by Nintendo R&amp;D1, since Intelligent Systems at the time was nothing more than just a guy hired by Nintendo to assist programming. \n\nThis brings us to the Switch. Nintendo has restructured it's in-house development, and much of the old guard from the Famicom and Super Famicom era are taking a back seat, leaving the N64 and onward era stars like Yoshiaki Koizumi, along young and upcoming developers and directors like Splatoon co-creator Tsubasa Sakaguchi to call the shots. With the likes of 1-2 Switch, ARMS, and the other unconventional games Nintendo probably has lined up, Nintendo probably sees the Switch as an opportunity to hit the reset button, and re-invent themselves as a game developer. I'm looking forward to seeing what's next from Nintendo's talent. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Please Explain Answers", "id": "65re7l", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 269, "report_reasons": null, "author": "TheMisterManGuy", "saved": false, "mod_reports": [], "name": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "approved_by": null, "over_18": false, "domain": "self.nintendo", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhnk", "edited": false, "link_flair_css_class": "explain", "author_flair_css_class": "metroid", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/nintendo/comments/65re7l/is_nintendo_trying_to_make_the_switch_their_next/", "num_reports": null, "locked": false, "stickied": false, "created": 1492405325.0, "url": "https://www.reddit.com/r/nintendo/comments/65re7l/is_nintendo_trying_to_make_the_switch_their_next/", "author_flair_text": "", "quarantine": false, "title": "Is Nintendo trying to make the Switch their next Famicom?", "created_utc": 1492376525.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 96, "visited": false, "subreddit_type": "public", "ups": 269}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv0rn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rockincellist", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "C'mon people, let's have an actual discussion alright?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;C&amp;#39;mon people, let&amp;#39;s have an actual discussion alright?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcv0rn", "score_hidden": true, "stickied": true, "created": 1492419414.0, "created_utc": 1492390614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgcqlu4", "gilded": 0, "archived": false, "score": 83, "report_reasons": null, "author": "Alianjaro", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Thanks for the effort you put in your post, OP. IDK if I'm missing an inside joke, but I don't think this post deserves to get dismissed like this.\n\nThese are interesting parallels you are drawing, and while I don't think there was an active effort hardware-wise to go back to the roots, both consoles do mark a transition. I guess Nintendo is showing continuity in the way it deals with change.\n\nLike any average Nintendo fan I'll admit I'm a little apprehensive of the future in terms of what the new designers are capable of doing since Splatoon actually didn't click with me at all, but at the same time I'm thrilled to see how things will unfold.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the effort you put in your post, OP. IDK if I&amp;#39;m missing an inside joke, but I don&amp;#39;t think this post deserves to get dismissed like this.&lt;/p&gt;\n\n&lt;p&gt;These are interesting parallels you are drawing, and while I don&amp;#39;t think there was an active effort hardware-wise to go back to the roots, both consoles do mark a transition. I guess Nintendo is showing continuity in the way it deals with change.&lt;/p&gt;\n\n&lt;p&gt;Like any average Nintendo fan I&amp;#39;ll admit I&amp;#39;m a little apprehensive of the future in terms of what the new designers are capable of doing since Splatoon actually didn&amp;#39;t click with me at all, but at the same time I&amp;#39;m thrilled to see how things will unfold.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcqlu4", "score_hidden": false, "stickied": false, "created": 1492413452.0, "created_utc": 1492384652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 83}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgda932", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ozzagahwihung", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I agree that they seem to be re-branding themselves (or trying to) with the switch,  but I'm not sure they are trying to re-create the NES atmosphere specifically. \n\nThey are doing what they suggests do with pretty much all of their new consoles,  and what separates then from other console manufacturers: they are creating a new need in the market and then catering towards that need. \n\nThink about it: Sony and Microsoft don't do this. They just bring out the same old shit every time,  albeit with new and better technology. Nintendo is more interested in selling an experience than selling consoles. \n\nSure,  the Wii U didn't successfully do this,  but you can see how they tried to create a niche with it. A better example by far is the Wii. Nintendo created a need that didn't previously exist,  and were so successful in filling that niche that they even ended up selling consoles to grandmas. \n\nI think THAT'S what they are doing with the switch: selling an image, or lifestyle rather than selling a console. And it sends to be working. ", "edited": 1492418363.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that they seem to be re-branding themselves (or trying to) with the switch,  but I&amp;#39;m not sure they are trying to re-create the NES atmosphere specifically. &lt;/p&gt;\n\n&lt;p&gt;They are doing what they suggests do with pretty much all of their new consoles,  and what separates then from other console manufacturers: they are creating a new need in the market and then catering towards that need. &lt;/p&gt;\n\n&lt;p&gt;Think about it: Sony and Microsoft don&amp;#39;t do this. They just bring out the same old shit every time,  albeit with new and better technology. Nintendo is more interested in selling an experience than selling consoles. &lt;/p&gt;\n\n&lt;p&gt;Sure,  the Wii U didn&amp;#39;t successfully do this,  but you can see how they tried to create a niche with it. A better example by far is the Wii. Nintendo created a need that didn&amp;#39;t previously exist,  and were so successful in filling that niche that they even ended up selling consoles to grandmas. &lt;/p&gt;\n\n&lt;p&gt;I think THAT&amp;#39;S what they are doing with the switch: selling an image, or lifestyle rather than selling a console. And it sends to be working. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgda932", "score_hidden": false, "stickied": false, "created": 1492446964.0, "created_utc": 1492418164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdarx3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "DaGoz", "parent_id": "t1_dgd6v3f", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "As someone who was in high school during the PS1 and N64 days, I'll tell you what I remember:\n\nWhen the N64 was coming, all the gamemags were describing it like \"Sony has been playing Sim City with the disasters turned off\", meaning the N64 was going to destroy everything they built. And we believed it, we were being sold PS1 graphics, but with the loading time of cartridges.\n\nThen it hit, with Mario 64 and Pilot Wings, and.... Yeah, it was awesome. But then a funny thing happened: The PS1 was releasing games with fully rendered cinematics, huge worlds to explore with pre-rendered backgrounds, and multidisk games. As opposed to the Genesis/SNES wars, for the first time we could look at two consoles and say \"The N64 actually CAN'T DO THAT.\" \n\nI think that was the turning point in perception, the PS1 was cutting edge with edgier games and graphics, while the N64 was more cartoonish and more lightweight. OoT helped some, but by that point, \"Playstation\" had entered the cultural venacular, and there was no looking back. And I admit, the Playstation was pretty cool. I remember playing Wing Commander 4 on it and thinking \"Wow, they have a whole filmed movie in this game. The N64 could never do this.\"\n\nThe other thing, and something that is often overlooked, is that it was pretty easy to hack the PS1 and PS2 and download roms to burn on CD and play. Me and my buddies had huge collections of games we downloaded and burned to CD. Again, this is something that added to the \"edginess\" of the PS1 (we're all haxxors now!) and really helped since we were a bunch of broke teenagers who couldn't afford to drop 50 bucks on a game all that often. Compare it with the N64 and their cartridges, which even if it could be hacked would still be difficult to get the materials needed.\n\nThe GameCube just reinforced the notion that Nintendo was the company of lightweights while all the serious games and power were on the PS2.", "edited": 1492430863.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who was in high school during the PS1 and N64 days, I&amp;#39;ll tell you what I remember:&lt;/p&gt;\n\n&lt;p&gt;When the N64 was coming, all the gamemags were describing it like &amp;quot;Sony has been playing Sim City with the disasters turned off&amp;quot;, meaning the N64 was going to destroy everything they built. And we believed it, we were being sold PS1 graphics, but with the loading time of cartridges.&lt;/p&gt;\n\n&lt;p&gt;Then it hit, with Mario 64 and Pilot Wings, and.... Yeah, it was awesome. But then a funny thing happened: The PS1 was releasing games with fully rendered cinematics, huge worlds to explore with pre-rendered backgrounds, and multidisk games. As opposed to the Genesis/SNES wars, for the first time we could look at two consoles and say &amp;quot;The N64 actually CAN&amp;#39;T DO THAT.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I think that was the turning point in perception, the PS1 was cutting edge with edgier games and graphics, while the N64 was more cartoonish and more lightweight. OoT helped some, but by that point, &amp;quot;Playstation&amp;quot; had entered the cultural venacular, and there was no looking back. And I admit, the Playstation was pretty cool. I remember playing Wing Commander 4 on it and thinking &amp;quot;Wow, they have a whole filmed movie in this game. The N64 could never do this.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The other thing, and something that is often overlooked, is that it was pretty easy to hack the PS1 and PS2 and download roms to burn on CD and play. Me and my buddies had huge collections of games we downloaded and burned to CD. Again, this is something that added to the &amp;quot;edginess&amp;quot; of the PS1 (we&amp;#39;re all haxxors now!) and really helped since we were a bunch of broke teenagers who couldn&amp;#39;t afford to drop 50 bucks on a game all that often. Compare it with the N64 and their cartridges, which even if it could be hacked would still be difficult to get the materials needed.&lt;/p&gt;\n\n&lt;p&gt;The GameCube just reinforced the notion that Nintendo was the company of lightweights while all the serious games and power were on the PS2.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdarx3", "score_hidden": false, "stickied": false, "created": 1492448799.0, "created_utc": 1492419999.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdbzo7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CantFindMyWallet", "parent_id": "t1_dgd6v3f", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "N64 was outsold by PS1 by a significant margin. On what planet is that \"retaining dominance?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;N64 was outsold by PS1 by a significant margin. On what planet is that &amp;quot;retaining dominance?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdbzo7", "score_hidden": false, "stickied": false, "created": 1492452948.0, "created_utc": 1492424148.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdrgcz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nunboi", "parent_id": "t1_dgdfgh7", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Spot on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Spot on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdrgcz", "score_hidden": true, "stickied": false, "created": 1492477404.0, "created_utc": 1492448604.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfgh7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgd9emj", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I think it was more of what to you prefer, 5 gold medals (n64) or 10 silver medals (ps1), sure the n64 had near perfect games, but the ps1 had tons of quality ones", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it was more of what to you prefer, 5 gold medals (n64) or 10 silver medals (ps1), sure the n64 had near perfect games, but the ps1 had tons of quality ones&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdfgh7", "score_hidden": true, "stickied": false, "created": 1492461700.0, "created_utc": 1492432900.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9emj", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "nunboi", "parent_id": "t1_dgd7fo0", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "The perception of who \"won\" between the PS1 and N64, in my experience, has to do with one's age during the platoforms' heyday. \n\nAll of my friends a year or two younger than me were solidly in the N64 camp. Their parent's likely bought them the system and they had a bunch of solid games, many with great couch co-op. \n\nMeanwhile for friends even slightly older than me, they ALL had Playstations. Outside of Twisted Metal, there wasn't much co-op gaming being done, but they all had libraries of games, many of which I'd never heard of.\n\nFor what it's worth, I was super poor and didn't get a chance to buy either system until 2000. I was stoked for Smackdown, saved all my birthday and christmas cash and bought the thing for that game. I was instantly jealous of my friends with No Mercy lol.\n\nFunny enough, a few years later, everyone had a PS2 (that DVD player sure helped) and I only knew a couple people with Game Cubes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The perception of who &amp;quot;won&amp;quot; between the PS1 and N64, in my experience, has to do with one&amp;#39;s age during the platoforms&amp;#39; heyday. &lt;/p&gt;\n\n&lt;p&gt;All of my friends a year or two younger than me were solidly in the N64 camp. Their parent&amp;#39;s likely bought them the system and they had a bunch of solid games, many with great couch co-op. &lt;/p&gt;\n\n&lt;p&gt;Meanwhile for friends even slightly older than me, they ALL had Playstations. Outside of Twisted Metal, there wasn&amp;#39;t much co-op gaming being done, but they all had libraries of games, many of which I&amp;#39;d never heard of.&lt;/p&gt;\n\n&lt;p&gt;For what it&amp;#39;s worth, I was super poor and didn&amp;#39;t get a chance to buy either system until 2000. I was stoked for Smackdown, saved all my birthday and christmas cash and bought the thing for that game. I was instantly jealous of my friends with No Mercy lol.&lt;/p&gt;\n\n&lt;p&gt;Funny enough, a few years later, everyone had a PS2 (that DVD player sure helped) and I only knew a couple people with Game Cubes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd9emj", "score_hidden": false, "stickied": false, "created": 1492444187.0, "created_utc": 1492415387.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7fo0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ponchopunch", "parent_id": "t1_dgd777g", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Hmm, I didn't know that the PS1 outsold the N64. I personally agree that the GameCube is actually probably one of Nintendo's most superior offerings and I hadn't considered it's poor sales as a response to the showings of the N64. You've definitely swayed me. It will definitely be interesting to see what happens to all of those extra sales of the Wii did over the Wii U, and if many of them end up moving toward the Switch.\n\nSo far I'm personally optimistic about the Switch. I think it should be a really cool console that Nintendo is definitely using to pivot their marketing strategy and how they choose to roll things out the consumers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm, I didn&amp;#39;t know that the PS1 outsold the N64. I personally agree that the GameCube is actually probably one of Nintendo&amp;#39;s most superior offerings and I hadn&amp;#39;t considered it&amp;#39;s poor sales as a response to the showings of the N64. You&amp;#39;ve definitely swayed me. It will definitely be interesting to see what happens to all of those extra sales of the Wii did over the Wii U, and if many of them end up moving toward the Switch.&lt;/p&gt;\n\n&lt;p&gt;So far I&amp;#39;m personally optimistic about the Switch. I think it should be a really cool console that Nintendo is definitely using to pivot their marketing strategy and how they choose to roll things out the consumers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd7fo0", "score_hidden": false, "stickied": false, "created": 1492439206.0, "created_utc": 1492410406.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd777g", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgd6v3f", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I wont deny that the n64 had great titles, but they lost many of their third party support though and the ps1 outsold the n64, the ps2 sold that much because of the dvd capabilities and people moving from the ps1 and i think the n64 was the one that made the console fps a common day thing, i honestly think nintendo did a better job with the gamecube, but i think the damage was done, they recovered with the wii but most of the sales were from your grandma and aunt playing wii sports and not from nintendo fans", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wont deny that the n64 had great titles, but they lost many of their third party support though and the ps1 outsold the n64, the ps2 sold that much because of the dvd capabilities and people moving from the ps1 and i think the n64 was the one that made the console fps a common day thing, i honestly think nintendo did a better job with the gamecube, but i think the damage was done, they recovered with the wii but most of the sales were from your grandma and aunt playing wii sports and not from nintendo fans&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd777g", "score_hidden": false, "stickied": false, "created": 1492438696.0, "created_utc": 1492409896.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdxy0i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrhargett", "parent_id": "t1_dgdmplo", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "That damage stands to this day. Nintendo is still viewed as the \"kids\" and \"casuals\" gaming company by lots of gamers. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That damage stands to this day. Nintendo is still viewed as the &amp;quot;kids&amp;quot; and &amp;quot;casuals&amp;quot; gaming company by lots of gamers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdxy0i", "score_hidden": true, "stickied": false, "created": 1492484644.0, "created_utc": 1492455844.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmplo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bitchfighter", "parent_id": "t1_dgd6v3f", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "There's quite a bit of inaccurate/revisionist history going on about the PS1/N64 era. Super Nintendo may have \"won\" the 16 bit console wars, bet Sega had a very effective marketing campaign that really damaged Nintendo's image. This definitely stuck through the next (several, imo) console cycles. In retrospect, yes, we can look back and say the N64 was a great console; but make no mistake the PS1 was absolutely cleaning its clock back in their day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s quite a bit of inaccurate/revisionist history going on about the PS1/N64 era. Super Nintendo may have &amp;quot;won&amp;quot; the 16 bit console wars, bet Sega had a very effective marketing campaign that really damaged Nintendo&amp;#39;s image. This definitely stuck through the next (several, imo) console cycles. In retrospect, yes, we can look back and say the N64 was a great console; but make no mistake the PS1 was absolutely cleaning its clock back in their day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdmplo", "score_hidden": true, "stickied": false, "created": 1492472064.0, "created_utc": 1492443264.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6v3f", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ponchopunch", "parent_id": "t1_dgd3p28", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I feel like Ninty still retained their dominance throughout the N64 era. Sure it waned and the competition becoming hungrier and fiercer, but I think the \"death knell\" for Nintendo came with the GameCube. That was when Sony REALLY gained footing with the PS2 and the Xbox made the console FPS a common day thing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like Ninty still retained their dominance throughout the N64 era. Sure it waned and the competition becoming hungrier and fiercer, but I think the &amp;quot;death knell&amp;quot; for Nintendo came with the GameCube. That was when Sony REALLY gained footing with the PS2 and the Xbox made the console FPS a common day thing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd6v3f", "score_hidden": false, "stickied": false, "created": 1492437946.0, "created_utc": 1492409146.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdwm3w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Catguin", "parent_id": "t1_dgdpsk7", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "It wasn't the case in any other part of the world. This is almost entirely due to SOA hiring Tom kolinsky as its ceo and how well he was able to manage the company. At the time he took the position Nintendo had a 90+% market share of the video game industry, had been using anti competitive practices to keep competition out. Despite these factors kolinsky came in when Sega had barely been able to dent Nintendos market share, and brought then to 60+% of the North American market share. Sega then went on to ignore all of his strategies and suggestions in their other regions, and that's how they ended up making nothing but failed consoles and being relegated to a third party company. \n\nWait, what we were talking about? I got too invested in Tom kolinsky being awesome and kinda got lost. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t the case in any other part of the world. This is almost entirely due to SOA hiring Tom kolinsky as its ceo and how well he was able to manage the company. At the time he took the position Nintendo had a 90+% market share of the video game industry, had been using anti competitive practices to keep competition out. Despite these factors kolinsky came in when Sega had barely been able to dent Nintendos market share, and brought then to 60+% of the North American market share. Sega then went on to ignore all of his strategies and suggestions in their other regions, and that&amp;#39;s how they ended up making nothing but failed consoles and being relegated to a third party company. &lt;/p&gt;\n\n&lt;p&gt;Wait, what we were talking about? I got too invested in Tom kolinsky being awesome and kinda got lost. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdwm3w", "score_hidden": true, "stickied": false, "created": 1492483140.0, "created_utc": 1492454340.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpsk7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgdn6fb", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I know, but i heard from people that in europe that wasnt the case, and its not like they had that much competition before the genesis", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know, but i heard from people that in europe that wasnt the case, and its not like they had that much competition before the genesis&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdpsk7", "score_hidden": true, "stickied": false, "created": 1492475565.0, "created_utc": 1492446765.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn6fb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Catguin", "parent_id": "t1_dgd3p28", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Keep in mind that Nintendo controlled the gaming industry before Sega genesis hit its stride in North America ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep in mind that Nintendo controlled the gaming industry before Sega genesis hit its stride in North America &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdn6fb", "score_hidden": true, "stickied": false, "created": 1492472602.0, "created_utc": 1492443802.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3p28", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgd25ho", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "More like 1985-1995, in the n64 era is when some people started to move on from nintendo ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More like 1985-1995, in the n64 era is when some people started to move on from nintendo &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd3p28", "score_hidden": false, "stickied": false, "created": 1492431761.0, "created_utc": 1492402961.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd25ho", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "nameucanthate", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Wow, OP, i'm sorry that the people who have commented don't seem to understand what you're trying to say. For what it's worth, I'd say that in terms of reinvention with both Breath of the Wild and Mario Odyssey looking a hell of a lot like Super Mario Bros, Super Mario 64, The Legend of Zelda, and Ocarina of Time, in terms of significant landmarks/contributions to gaming, then yes, the Switch is going to mark Nintendo's massive return to form. \n\nI think we're about to hit another golden age for Nintendo in 2017-2019 that will rival 1996-1999. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, OP, i&amp;#39;m sorry that the people who have commented don&amp;#39;t seem to understand what you&amp;#39;re trying to say. For what it&amp;#39;s worth, I&amp;#39;d say that in terms of reinvention with both Breath of the Wild and Mario Odyssey looking a hell of a lot like Super Mario Bros, Super Mario 64, The Legend of Zelda, and Ocarina of Time, in terms of significant landmarks/contributions to gaming, then yes, the Switch is going to mark Nintendo&amp;#39;s massive return to form. &lt;/p&gt;\n\n&lt;p&gt;I think we&amp;#39;re about to hit another golden age for Nintendo in 2017-2019 that will rival 1996-1999. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd25ho", "score_hidden": false, "stickied": false, "created": 1492429261.0, "created_utc": 1492400461.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd9ox0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "gnukan", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "You've got a point. Both the nes and the switch were built to encourage people to spread the word (nes because it was their first real console and switch because a lot of players left with the wii u), and two controllers bundled with the system is a great way of getting owners of the system to show it to other people. Switch does this even better, since you don't even need to get people to come to your house to play.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve got a point. Both the nes and the switch were built to encourage people to spread the word (nes because it was their first real console and switch because a lot of players left with the wii u), and two controllers bundled with the system is a great way of getting owners of the system to show it to other people. Switch does this even better, since you don&amp;#39;t even need to get people to come to your house to play.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd9ox0", "score_hidden": false, "stickied": false, "created": 1492445092.0, "created_utc": 1492416292.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgcsin1", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Fiti99", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I would say so, while i like both sony and microsoft, they seem to be trying to compete with the pc market, while nintendo isnt, so in a way they dont have that much of competition and you get an unique experience with them (you also had it with previous systems, but people saw nintendo as a second, third or fourth option, unlike now and the famicom/nes era when people see them as their own thing)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say so, while i like both sony and microsoft, they seem to be trying to compete with the pc market, while nintendo isnt, so in a way they dont have that much of competition and you get an unique experience with them (you also had it with previous systems, but people saw nintendo as a second, third or fourth option, unlike now and the famicom/nes era when people see them as their own thing)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcsin1", "score_hidden": false, "stickied": false, "created": 1492416032.0, "created_utc": 1492387232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdd004", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ChefKiyo", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "OP I get you're trying to be super optimistic here but what exactly are you talking about with your changes and ideology with Nintendo that you think is different only this time?\n\nThis has always been Nintendo's thing, to create a system that will break the mold of the competition and be a service unmatched. They don't always hit the target that well, but always try their best. You dismiss the WiiU era as if that wasn't always about change but your skewed view isn't seeing the bigger picture here.\n\nThe Switch is the WiiU rebranded. Sure it doesn't have a controller with a screen, but that's because the console is just that. Before we had Nintendo wanting a home console AND a portable console because they assumed it was two entirely different markets but once the numbers showed otherwise it became a \"let's make sure our console is mobile now to meet the target audience.\" Besides this, the Switch provides an experience on par to what the WiiU did minus actual touch features and a second screen. It's a sacrifice sure, but if you think Nintendo has shifted mentality ONLY now with Switch then you really haven't been a Nintendo fan for that long and seen the approach they take with each generation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP I get you&amp;#39;re trying to be super optimistic here but what exactly are you talking about with your changes and ideology with Nintendo that you think is different only this time?&lt;/p&gt;\n\n&lt;p&gt;This has always been Nintendo&amp;#39;s thing, to create a system that will break the mold of the competition and be a service unmatched. They don&amp;#39;t always hit the target that well, but always try their best. You dismiss the WiiU era as if that wasn&amp;#39;t always about change but your skewed view isn&amp;#39;t seeing the bigger picture here.&lt;/p&gt;\n\n&lt;p&gt;The Switch is the WiiU rebranded. Sure it doesn&amp;#39;t have a controller with a screen, but that&amp;#39;s because the console is just that. Before we had Nintendo wanting a home console AND a portable console because they assumed it was two entirely different markets but once the numbers showed otherwise it became a &amp;quot;let&amp;#39;s make sure our console is mobile now to meet the target audience.&amp;quot; Besides this, the Switch provides an experience on par to what the WiiU did minus actual touch features and a second screen. It&amp;#39;s a sacrifice sure, but if you think Nintendo has shifted mentality ONLY now with Switch then you really haven&amp;#39;t been a Nintendo fan for that long and seen the approach they take with each generation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdd004", "score_hidden": false, "stickied": false, "created": 1492456068.0, "created_utc": 1492427268.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdansu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Slimshaydena", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I have felt that the last few recent 3DS titles coming from Nintendo have been special in a way. They seem to have shaking up previously untouched mechanics &amp; UI quirks. \n\nIt's been a pretty refreshing ride to see the direction the company seems to be heading. Still don't agree with half the decisions they make.. but there has been a feeling of something stirring within the company over the last few years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have felt that the last few recent 3DS titles coming from Nintendo have been special in a way. They seem to have shaking up previously untouched mechanics &amp;amp; UI quirks. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been a pretty refreshing ride to see the direction the company seems to be heading. Still don&amp;#39;t agree with half the decisions they make.. but there has been a feeling of something stirring within the company over the last few years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdansu", "score_hidden": false, "stickied": false, "created": 1492448397.0, "created_utc": 1492419597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdmhf6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "QuantumElectronicsDu", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "They're not trying to make it their next Famicom, they're trying to make it their next Wii.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re not trying to make it their next Famicom, they&amp;#39;re trying to make it their next Wii.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdmhf6", "score_hidden": true, "stickied": false, "created": 1492471800.0, "created_utc": 1492443000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgddvjq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MEGA_MJRS", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "&gt;portability of the Game Boy\n\nSurely you mean the portability of the Game Cube? It had a handle ffs ^^^^/s", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;portability of the Game Boy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Surely you mean the portability of the Game Cube? It had a handle ffs &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;/s&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgddvjq", "score_hidden": false, "stickied": false, "created": 1492458327.0, "created_utc": 1492429527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dge07g4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dragonnyxx", "parent_id": "t1_dgdovjb", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "They're already selling them as fast as they can make them. The price won't drop until that changes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re already selling them as fast as they can make them. The price won&amp;#39;t drop until that changes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dge07g4", "score_hidden": true, "stickied": false, "created": 1492487213.0, "created_utc": 1492458413.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdovjb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnalogAccount", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I just wish the system were slightly cheaper and came with a quality pack in title. Make it 249.99 with a killer pack-in game and I think you'd see it take off for the moon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just wish the system were slightly cheaper and came with a quality pack in title. Make it 249.99 with a killer pack-in game and I think you&amp;#39;d see it take off for the moon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdovjb", "score_hidden": true, "stickied": false, "created": 1492474540.0, "created_utc": 1492445740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dge2qsv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "arogance1", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "They're not trying to make it the new Famicom, they're trying to make it the New Switch, an amazing console in its own right", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re not trying to make it the new Famicom, they&amp;#39;re trying to make it the New Switch, an amazing console in its own right&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dge2qsv", "score_hidden": true, "stickied": false, "created": 1492490051.0, "created_utc": 1492461251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdglz9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ManualSearch", "parent_id": "t1_dgddf20", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "The conversation has to be had. OP seems to think that creativity is more important than profit, and that being talked about is more important than being a good game. They're also holding different games to different standards (eg star fox and galaxy). If OP is gonna post about it, then they need to have concrete reasons why this is the case. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The conversation has to be had. OP seems to think that creativity is more important than profit, and that being talked about is more important than being a good game. They&amp;#39;re also holding different games to different standards (eg star fox and galaxy). If OP is gonna post about it, then they need to have concrete reasons why this is the case. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdglz9", "score_hidden": true, "stickied": false, "created": 1492463755.0, "created_utc": 1492434955.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddf20", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zatOMG", "parent_id": "t1_dgda0cp", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Dude quit wasting your time on this clown. His OP is crap so ignore it.\n\nAlthough I did enjoy you obliterating his bullshit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude quit wasting your time on this clown. His OP is crap so ignore it.&lt;/p&gt;\n\n&lt;p&gt;Although I did enjoy you obliterating his bullshit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgddf20", "score_hidden": false, "stickied": false, "created": 1492457186.0, "created_utc": 1492428386.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda0cp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ManualSearch", "parent_id": "t1_dgd8vxp", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "&gt;Wii Fit was talked about on talk shows.\n\nSo... the games you want are games that talk show hosts talk about? That are talked about in magazine articles? Wii Fit was talked about in these mediums because a video game about exercise was notable, not because it was a good game. I'd rather, when discussing good video games, be discussing it with people who are experienced with video games, and not the mom who writes the Healthy Living article in Home and Life Magazine.\n\nNintendo's goal is to sell games. Having them talked about helps out a lot, sure... but if that free advertising was all Nintendo needed, then New Super Mario Bros Wii wouldn't have beaten Wii Fit in sales.\n\nBecause you're right. Wii Fit was talked about outside of gaming. You know what wasn't? Super Mario Galaxy. Creative games and games being talked about aren't connected together. Gone Home wasn't talked about outside of gaming. Risk of Rain isn't talked about outside of gaming. Va11-Hall A isn't talked about outside of gaming.\n\nBeing talked about doesn't make a game better. Being talked about MIGHT make a game sell better, but it also might not. I don't play video games because they're talked about a bunch, I play them because they're fun.\n\n&gt;Calling Galaxy 'a 3D Mario game with a pointer' is underselling it.\n\nYeah, but so is calling Super Mario 3D World a 'conservative and stagnant' game. Super Mario 3D World was the attempt at meshing the standard 2D platforming aspects of Mario with multiplayer ability and enhanced graphics. It was designed to get non-gamers into the Wii by giving people access to a basic game, that most people have experience with, and people can play *together*. If you're willing to say that Galaxy was 'creative enough' to count because it was in space and had some gravity effects, then 3D World should also count, since it had a semi-retro 2D feel and four player support. Again, we're comparing what you *think* is 'creative enough' versus what actually *is* creative enough.\n\n&gt;It's about making people stand up and take notice.\n\n*Who* take notice, dude? Magazine editors and talk show hosts?\n\nSales are an adequate reflection of how much hype and rank a game is. A game undersells or flops if it doesn't get the attention it needs. A game oversells if it gets extra. \n\nCritical reception, in this case, also goes to the more 'samey' titles. [Splatoon](http://www.metacritic.com/game/wii-u/splatoon) holds a Metacritic of 81, while [3D World](http://www.metacritic.com/game/wii-u/super-mario-3d-world) holds a 93, and [New Super Mario Bros U](http://www.metacritic.com/game/wii-u/new-super-mario-bros-u) holds an 84. \n\n'Engagement' and 'Cultural Influence' are buzzwords with no objective measurement system and barely any hold on this conversation in any way. You think that Splatoon clicked with the global community more, and I outright disagree. If you can somehow measure cultural influence, then I'd love to hear it, but I guarantee you that there's more art, music/remixes, and content for the Mario series than there is for Splatoon on the Internet right now. And, as of writing, Metacritic User Scores put 3D World ahead of Splatoon. That's pretty telling about 'global significance'.\n\nThe reason the game had more fan art is because Mario is a giant series and Mario fan art isn't categorized by game anymore. Mario is Kleenex. He already holds the cultural signifigance. My mom knows who Mario is. The 60-year old grocery clerk knows who Mario is. \n\nThe reason Splatoon has more 'merchandise' is because Mario merchandise isn't ranked by game, whereas Splatoon only has one game that the merchandise can be FOR. \n\nAlso, Splatoon is a new IP, and Mario's been around for a while. The reason you notice Splatoon's influence more is because Splatoon is more new... but people 'taking notice' doesn't make a game good. Again, and I can't stress this enough, I (and I think most people) prefer good games over popular ones.\n\n&gt;Look at all the memes.\n\nThis is your best argument? That 1-2 Switch can be meme'd, and that's what Nintendo should be targeting? That people can meme a game?\n\nMario is so ubiquitous that everyone knows who he is. Pokemon is so overarching that everyone knows who Pikachu is, even though main series Pokemon titles have only had minor changes each generation.\n\nSure, people make jokes online about how the milking game looks like giving a handjob. People also make weird Rule 34 art of Samus blowing Mario. I don't consider either of these things important to gaming in any way, and I would love to hear how you think they matter. Meme-ing a game might get people to notice it more, but so does running thirty second TV ads. 'Influence' does fuck all for Nintendo if the game doesn't sell.\n\nYou have yet to defend your argument on why impact should matter. You say you want creative games. That's fair, that's fine, you're totally allowed to have that opinion. But at the end of the day, whether you like it or not, Nintendo is a company and companies exist to make money. Splatoon did not sell as well as 3D World. Splatoon is not critically ranked as high as 3D World. A game having an 'impact' does not make it commercially viable, or a good game. It just means people have seen it more. \n\nET for the Atari had an impact on gaming, and now 10000 cartridges are sitting buried in Arizona somewhere. Superman 64 had an impact on gaming, and now still only like 10% of everyone who has ever owned it has beaten it.\n\nI don't need a game to be influential to enjoy it. Many of the games I play aren't games most people have ever heard of. Why does influence matter, over quality and fun?\n\n&gt;Nintendo's done all this cool shit, though!\n&gt;\"Create Something Unique\"\n\nAnd you're sitting there and saying 'this is not enough, they should do more'.\n\nNintendo is fully capable of doing interesting and creative things. The Switch was just released, and it is creative. Splatoon is a creative take on team based shooters. Kid Icarus: Uprising was an interesting way to make the newest KI game. \n\nOver the last ten years, Nintendo has created a bunch of new, interesting IPs. They have made games that were fresh and exciting and new. They have built hype and made sales.\n\nYou'll notice, the theme isn't \"Create Something Unique to /u/TheMisterManGuy\", it's \"Create Something Unique\", and Nintendo does that. But you're still living in this fantasy where Nintendo can constantly make 'ground-breaking' changes and new games, and they'll be fine. That's delusional.\n\nThere's a reason that CoD and Halo get new entries to the same series with minimal changes. There's a reason why every Harvest Moon game is basically the same game. There's a reason why people buy FIFA 2017 even after owning FIFA 2016.\n\nYou are holding Nintendo to a golden standard that is, again, dangerous and risky for Nintendo as a company. Nintendo can't live off of \"occasional safe-bet\" games, especially when phrasing it that way, combined with the dismissive tone you're taking with all the creative and interesting stuff that Nintendo HAS done in the last ten years, because it's not as much as you'd like.\n\nYou said earlier that Star Fox Zero was 'Star Fox 64 except with a forced asymmetrical gimmick'. However, Star Fox Zero isn't Star Fox 64. Star Fox Zero was a new Star Fox game, with a new controller scheme, new missions including using vehicles in different ways, Arwings turning into little walking dinosaurs, a new story and levels... and probably some other stuff, too. Star Fox Zero was a new game, with new creative ideas in it.\n\n[And it did not do well.](http://www.metacritic.com/game/wii-u/star-fox-zero)\n\nSo when Nintendo tries to be creative and fails, or just 'isn't creative enough for your tastes', then the game is just a rehash of an old game. But if Nintendo takes the same Mario 3D formula and puts it in space with some gravity effects, you praise it.\n\nYou are letting your opinions on individual games affect your opinion on Nintendo's creativity. You are incorrect in your initial assertion. Nintendo is still being just as creative as always, and doing it in a safe and healthy way, that ensures that the company can continue to survive.\n\nYou can choose 95% risky, creative games that you are unsure of if they'll succeed each time, if you want. Anyone who runs a company or holds a business degree will tell you how bad of an idea that is.\n\nI'd rather Nintendo made 15% new, interesting, creative games, and used the other 85% to make sure they're still around for the next new, creative title. I want Nintendo to survive, and I won't live in an idealistic fantasy where Nintendo can create games like Splatoon 'most of the time' and survive as a company.\n\nYou're holding your expectations too high. You need to temper them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Wii Fit was talked about on talk shows.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So... the games you want are games that talk show hosts talk about? That are talked about in magazine articles? Wii Fit was talked about in these mediums because a video game about exercise was notable, not because it was a good game. I&amp;#39;d rather, when discussing good video games, be discussing it with people who are experienced with video games, and not the mom who writes the Healthy Living article in Home and Life Magazine.&lt;/p&gt;\n\n&lt;p&gt;Nintendo&amp;#39;s goal is to sell games. Having them talked about helps out a lot, sure... but if that free advertising was all Nintendo needed, then New Super Mario Bros Wii wouldn&amp;#39;t have beaten Wii Fit in sales.&lt;/p&gt;\n\n&lt;p&gt;Because you&amp;#39;re right. Wii Fit was talked about outside of gaming. You know what wasn&amp;#39;t? Super Mario Galaxy. Creative games and games being talked about aren&amp;#39;t connected together. Gone Home wasn&amp;#39;t talked about outside of gaming. Risk of Rain isn&amp;#39;t talked about outside of gaming. Va11-Hall A isn&amp;#39;t talked about outside of gaming.&lt;/p&gt;\n\n&lt;p&gt;Being talked about doesn&amp;#39;t make a game better. Being talked about MIGHT make a game sell better, but it also might not. I don&amp;#39;t play video games because they&amp;#39;re talked about a bunch, I play them because they&amp;#39;re fun.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Calling Galaxy &amp;#39;a 3D Mario game with a pointer&amp;#39; is underselling it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, but so is calling Super Mario 3D World a &amp;#39;conservative and stagnant&amp;#39; game. Super Mario 3D World was the attempt at meshing the standard 2D platforming aspects of Mario with multiplayer ability and enhanced graphics. It was designed to get non-gamers into the Wii by giving people access to a basic game, that most people have experience with, and people can play &lt;em&gt;together&lt;/em&gt;. If you&amp;#39;re willing to say that Galaxy was &amp;#39;creative enough&amp;#39; to count because it was in space and had some gravity effects, then 3D World should also count, since it had a semi-retro 2D feel and four player support. Again, we&amp;#39;re comparing what you &lt;em&gt;think&lt;/em&gt; is &amp;#39;creative enough&amp;#39; versus what actually &lt;em&gt;is&lt;/em&gt; creative enough.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s about making people stand up and take notice.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Who&lt;/em&gt; take notice, dude? Magazine editors and talk show hosts?&lt;/p&gt;\n\n&lt;p&gt;Sales are an adequate reflection of how much hype and rank a game is. A game undersells or flops if it doesn&amp;#39;t get the attention it needs. A game oversells if it gets extra. &lt;/p&gt;\n\n&lt;p&gt;Critical reception, in this case, also goes to the more &amp;#39;samey&amp;#39; titles. &lt;a href=\"http://www.metacritic.com/game/wii-u/splatoon\"&gt;Splatoon&lt;/a&gt; holds a Metacritic of 81, while &lt;a href=\"http://www.metacritic.com/game/wii-u/super-mario-3d-world\"&gt;3D World&lt;/a&gt; holds a 93, and &lt;a href=\"http://www.metacritic.com/game/wii-u/new-super-mario-bros-u\"&gt;New Super Mario Bros U&lt;/a&gt; holds an 84. &lt;/p&gt;\n\n&lt;p&gt;&amp;#39;Engagement&amp;#39; and &amp;#39;Cultural Influence&amp;#39; are buzzwords with no objective measurement system and barely any hold on this conversation in any way. You think that Splatoon clicked with the global community more, and I outright disagree. If you can somehow measure cultural influence, then I&amp;#39;d love to hear it, but I guarantee you that there&amp;#39;s more art, music/remixes, and content for the Mario series than there is for Splatoon on the Internet right now. And, as of writing, Metacritic User Scores put 3D World ahead of Splatoon. That&amp;#39;s pretty telling about &amp;#39;global significance&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;The reason the game had more fan art is because Mario is a giant series and Mario fan art isn&amp;#39;t categorized by game anymore. Mario is Kleenex. He already holds the cultural signifigance. My mom knows who Mario is. The 60-year old grocery clerk knows who Mario is. &lt;/p&gt;\n\n&lt;p&gt;The reason Splatoon has more &amp;#39;merchandise&amp;#39; is because Mario merchandise isn&amp;#39;t ranked by game, whereas Splatoon only has one game that the merchandise can be FOR. &lt;/p&gt;\n\n&lt;p&gt;Also, Splatoon is a new IP, and Mario&amp;#39;s been around for a while. The reason you notice Splatoon&amp;#39;s influence more is because Splatoon is more new... but people &amp;#39;taking notice&amp;#39; doesn&amp;#39;t make a game good. Again, and I can&amp;#39;t stress this enough, I (and I think most people) prefer good games over popular ones.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Look at all the memes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is your best argument? That 1-2 Switch can be meme&amp;#39;d, and that&amp;#39;s what Nintendo should be targeting? That people can meme a game?&lt;/p&gt;\n\n&lt;p&gt;Mario is so ubiquitous that everyone knows who he is. Pokemon is so overarching that everyone knows who Pikachu is, even though main series Pokemon titles have only had minor changes each generation.&lt;/p&gt;\n\n&lt;p&gt;Sure, people make jokes online about how the milking game looks like giving a handjob. People also make weird Rule 34 art of Samus blowing Mario. I don&amp;#39;t consider either of these things important to gaming in any way, and I would love to hear how you think they matter. Meme-ing a game might get people to notice it more, but so does running thirty second TV ads. &amp;#39;Influence&amp;#39; does fuck all for Nintendo if the game doesn&amp;#39;t sell.&lt;/p&gt;\n\n&lt;p&gt;You have yet to defend your argument on why impact should matter. You say you want creative games. That&amp;#39;s fair, that&amp;#39;s fine, you&amp;#39;re totally allowed to have that opinion. But at the end of the day, whether you like it or not, Nintendo is a company and companies exist to make money. Splatoon did not sell as well as 3D World. Splatoon is not critically ranked as high as 3D World. A game having an &amp;#39;impact&amp;#39; does not make it commercially viable, or a good game. It just means people have seen it more. &lt;/p&gt;\n\n&lt;p&gt;ET for the Atari had an impact on gaming, and now 10000 cartridges are sitting buried in Arizona somewhere. Superman 64 had an impact on gaming, and now still only like 10% of everyone who has ever owned it has beaten it.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t need a game to be influential to enjoy it. Many of the games I play aren&amp;#39;t games most people have ever heard of. Why does influence matter, over quality and fun?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Nintendo&amp;#39;s done all this cool shit, though!\n&amp;quot;Create Something Unique&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And you&amp;#39;re sitting there and saying &amp;#39;this is not enough, they should do more&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Nintendo is fully capable of doing interesting and creative things. The Switch was just released, and it is creative. Splatoon is a creative take on team based shooters. Kid Icarus: Uprising was an interesting way to make the newest KI game. &lt;/p&gt;\n\n&lt;p&gt;Over the last ten years, Nintendo has created a bunch of new, interesting IPs. They have made games that were fresh and exciting and new. They have built hype and made sales.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll notice, the theme isn&amp;#39;t &amp;quot;Create Something Unique to &lt;a href=\"/u/TheMisterManGuy\"&gt;/u/TheMisterManGuy&lt;/a&gt;&amp;quot;, it&amp;#39;s &amp;quot;Create Something Unique&amp;quot;, and Nintendo does that. But you&amp;#39;re still living in this fantasy where Nintendo can constantly make &amp;#39;ground-breaking&amp;#39; changes and new games, and they&amp;#39;ll be fine. That&amp;#39;s delusional.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a reason that CoD and Halo get new entries to the same series with minimal changes. There&amp;#39;s a reason why every Harvest Moon game is basically the same game. There&amp;#39;s a reason why people buy FIFA 2017 even after owning FIFA 2016.&lt;/p&gt;\n\n&lt;p&gt;You are holding Nintendo to a golden standard that is, again, dangerous and risky for Nintendo as a company. Nintendo can&amp;#39;t live off of &amp;quot;occasional safe-bet&amp;quot; games, especially when phrasing it that way, combined with the dismissive tone you&amp;#39;re taking with all the creative and interesting stuff that Nintendo HAS done in the last ten years, because it&amp;#39;s not as much as you&amp;#39;d like.&lt;/p&gt;\n\n&lt;p&gt;You said earlier that Star Fox Zero was &amp;#39;Star Fox 64 except with a forced asymmetrical gimmick&amp;#39;. However, Star Fox Zero isn&amp;#39;t Star Fox 64. Star Fox Zero was a new Star Fox game, with a new controller scheme, new missions including using vehicles in different ways, Arwings turning into little walking dinosaurs, a new story and levels... and probably some other stuff, too. Star Fox Zero was a new game, with new creative ideas in it.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.metacritic.com/game/wii-u/star-fox-zero\"&gt;And it did not do well.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So when Nintendo tries to be creative and fails, or just &amp;#39;isn&amp;#39;t creative enough for your tastes&amp;#39;, then the game is just a rehash of an old game. But if Nintendo takes the same Mario 3D formula and puts it in space with some gravity effects, you praise it.&lt;/p&gt;\n\n&lt;p&gt;You are letting your opinions on individual games affect your opinion on Nintendo&amp;#39;s creativity. You are incorrect in your initial assertion. Nintendo is still being just as creative as always, and doing it in a safe and healthy way, that ensures that the company can continue to survive.&lt;/p&gt;\n\n&lt;p&gt;You can choose 95% risky, creative games that you are unsure of if they&amp;#39;ll succeed each time, if you want. Anyone who runs a company or holds a business degree will tell you how bad of an idea that is.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d rather Nintendo made 15% new, interesting, creative games, and used the other 85% to make sure they&amp;#39;re still around for the next new, creative title. I want Nintendo to survive, and I won&amp;#39;t live in an idealistic fantasy where Nintendo can create games like Splatoon &amp;#39;most of the time&amp;#39; and survive as a company.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re holding your expectations too high. You need to temper them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgda0cp", "score_hidden": false, "stickied": false, "created": 1492446147.0, "created_utc": 1492417347.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8vxp", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "TheMisterManGuy", "parent_id": "t1_dgd7qe3", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "&gt; Mate, you're going to have to be more precise in your description, here. What do you consider 'impacting the industry'? **Fewer people talked about Wii Fit than they did Skyward Sword (released in 2011)**. You're, again, discrediting the impact that other WiiU titles, like Pikmin 3, Wonderful 101, Hyrule Warriors, and Mario Maker had on gaming. I'd even argue Other M had a big impact on gaming, or at least on Metroid, albeit a negative one. It's fine if you didn't feel like these games were big deals, but your feelings on games doesn't equate to facts. I certainly don't feel like ARMS is making that big of an impact on gaming, but opinion in this case doesn't matter.\n\nYou're forgetting just how big games like Wii Fit were at the time. They were featured on talk shows, featured all over the news, and talked about by people who never even gotten into games before. Just because the closed off circle of \"hardcore gamers\" didn't really talk about it much, doesn't mean nobody talked about it. Meanwhile games like the Wonderful 101 bombed, Hyrule Warriors only appealed to fans of the series, and Pikmin 3 was never going to be a system seller. Splatoon and Mario Maker were two of the only Wii U games that made an impact on the industry, and that's because they were in tune with where the industry is now. \n\n&gt; Ultimately, it's not Nintendo's job to reinvent the wheel over and over again. The reason that Splatoon seemed to have a 'major impact on the industry' was because it was a new IP. With a company such as Nintendo, you cannot expect them to mix up how they create fourteen different IPs every time they produce a new game. Zelda is going to be like Zelda games, Pokemon is going to be like Pokemon games... and I find it a little funny that you'd call Galaxy a 'major impact' when Galaxy was pretty similar to all the other 3D Mario games, except with a pointer.\n\nI'm not asking Nintendo to make a bunch of new IPs at the expense of everything else. I'm asking them to be less conservative and stagnant with their franchises and games and take more risks. Mario Galaxy for example, has the core fundamentals of a 3D Mario game. But to call it just a 3D Mario game with a pointer is failing to understand what makes it such a special game. The game's groundbreaking ambition comes from it's space theme, and how the developers went all out with executing it. You're launching Mario to different planets, platforming upside down and inside out, dragging Mario across the stars, and exploring elaborate and grandiose areas and planets one after another. They could've easily just taken Super Mario 64, added new power-ups, levels, and prettier graphics, and called it a day. But they actually went above and beyond, and deconstructed the fundamentals of Mario Platforming simply by placing the whole thing in space. This is what I mean. Nintendo taking the well known conventions of a flagship property, and completely flipping them on its head. It's also why I was disappointed by 3D World because it actually regresses Mario Platforming by sticking to the status quo, it wasn't the game that people were expecting from a 3D Mario. This is what I want to see more of from them, especially from their mascot. I don't mind a safe, conservative game every so often, but when you're not doing anything bold or groundbreaking to balance it out, it makes you look creatively bankrupt. \n\n&gt;It sounds more like you're letting your opinion skew the facts. Super Mario 3D World, a game that you're criticizing due to it's 'same-ness', sold 5.5 million units, less than a million under Super Mario Galaxy 2. 3D World is literally the third highest selling Wii U game, under Mario Kart 8, and New Super Mario Bros U. (another samey Mario game). If you're going to call Splatoon's release a 'major impact' to gaming, you have to be able to acknowledge that it sold less than Smash 5, a new Mario Kart, and two 'samey' Super Mario Bros games.\n\nImpact involves much more than just sales. It also factors in things like critical reception, engagement, cultural influence, etc. Super Mario 3D World may have sold pretty well, but groundbreaking game it was not. Splatoon had a much bigger impact because it provided something different, something ambitious, and something interesting. It's a completely fresh take on the shooter, It's played by millions of people online, it has a ton of fan-art and merchandise, it has a small but growing competitive scene, and it was one of the only Wii U games that didn't feel like a retread or safe-bet. This is what I mean. It's not just a matter of selling a few million copies, it's a matter of actually making people stand up and take notice.\n\n&gt;1-2-Switch, a game that you're praising as different and unique... it's not doing well, dude. Mid level reviews all around, and it's being beaten out on the eShop by Shovel Knight and the Binding of Issac, games that have been out for years. The feeling I'm getting, from talking with others, isn't looking too favorable on ARMS, either. Most of the games I can buy on the eShop are games that I already own on my PC for CHEAPER, or bought for a different console altogether. It's pretty telling when the headliner bit for the Nindies presentation was fucking Stardew Valley. \n\nLike I said, Impact means more than just sales. 1-2 Switch may have lukewarm critical reception. But what matters is that it's unique, it's interesting, it's making people take notice. I mean look at all the memes and gifs the Milk mini-game alone has received. \n\n&gt;Is this what you want? Nintendo to release kooky, interesting, new idea games, that don't sell and push Nintendo farther underwater? Nintendo's eShop being for old Indie titles and the Virtual Console? Because I don't want that. I don't think many people do. I like a new interesting idea. I applaud Breath of the Wild's and Galaxy's creativity, but Super Mario 3 and Tetris still sell.\n\n&gt;Your \"right track\" is incredibly dangerous and risky for Nintendo as a company. I'm not calling you a hater, but I am going to say that you're living in a weird fantasy where you both expect Nintendo to continuously make 'ground-breaking new concepts' (while, I'll add, dismissing the unique things they have done in a lot of their games), while at the same time expecting them to last as a company.\n\nWe're talking about the company who saved the video game market in the US back in the 80s, revolutionized playing video games on the go, essentially created the platforming and action-adventure genres, showed everyone how 3D gameplay should be done, broke down the barriers of video games to newcomers, pioneered the modern casual game, and made a console that you can literally take with you anywhere. Nintendo is more than capable of changing the status quo when necessary. \n\nI don't expect every game they put out to be new and groundbreaking. Like I said, I'm fine with the occasional safe-bet game. But if all you're doing is just desperately clinging to the past, and not moving forward, or staying in tune with where the market is going, people will leave you behind. \n\n&gt;Nintendo still carries the same ambition they have always had. Nintendo's #1 goal, above EVERYTHING, is to make GOOD games. Not necessarily unique, or 'ground-breaking'. Just good. I will happily call you a cynic, because at the end of the day, Nintendo did a good job with the WiiU releases, and the last thing I think any of us want them to do is focus on making garbage with \"amazing concepts\". If it's unique and won't sell, then it's not worth making. \n\nNintendo's corporate motto has always been *Dokusou*, which roughly translated, means *\"Create Something Unique\"*. What's the point of having that slogan if all you're doing is sticking to the same design and mechanical tropes with no change or improvement just because they sell?", "edited": 1492414384.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Mate, you&amp;#39;re going to have to be more precise in your description, here. What do you consider &amp;#39;impacting the industry&amp;#39;? &lt;strong&gt;Fewer people talked about Wii Fit than they did Skyward Sword (released in 2011)&lt;/strong&gt;. You&amp;#39;re, again, discrediting the impact that other WiiU titles, like Pikmin 3, Wonderful 101, Hyrule Warriors, and Mario Maker had on gaming. I&amp;#39;d even argue Other M had a big impact on gaming, or at least on Metroid, albeit a negative one. It&amp;#39;s fine if you didn&amp;#39;t feel like these games were big deals, but your feelings on games doesn&amp;#39;t equate to facts. I certainly don&amp;#39;t feel like ARMS is making that big of an impact on gaming, but opinion in this case doesn&amp;#39;t matter.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re forgetting just how big games like Wii Fit were at the time. They were featured on talk shows, featured all over the news, and talked about by people who never even gotten into games before. Just because the closed off circle of &amp;quot;hardcore gamers&amp;quot; didn&amp;#39;t really talk about it much, doesn&amp;#39;t mean nobody talked about it. Meanwhile games like the Wonderful 101 bombed, Hyrule Warriors only appealed to fans of the series, and Pikmin 3 was never going to be a system seller. Splatoon and Mario Maker were two of the only Wii U games that made an impact on the industry, and that&amp;#39;s because they were in tune with where the industry is now. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Ultimately, it&amp;#39;s not Nintendo&amp;#39;s job to reinvent the wheel over and over again. The reason that Splatoon seemed to have a &amp;#39;major impact on the industry&amp;#39; was because it was a new IP. With a company such as Nintendo, you cannot expect them to mix up how they create fourteen different IPs every time they produce a new game. Zelda is going to be like Zelda games, Pokemon is going to be like Pokemon games... and I find it a little funny that you&amp;#39;d call Galaxy a &amp;#39;major impact&amp;#39; when Galaxy was pretty similar to all the other 3D Mario games, except with a pointer.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not asking Nintendo to make a bunch of new IPs at the expense of everything else. I&amp;#39;m asking them to be less conservative and stagnant with their franchises and games and take more risks. Mario Galaxy for example, has the core fundamentals of a 3D Mario game. But to call it just a 3D Mario game with a pointer is failing to understand what makes it such a special game. The game&amp;#39;s groundbreaking ambition comes from it&amp;#39;s space theme, and how the developers went all out with executing it. You&amp;#39;re launching Mario to different planets, platforming upside down and inside out, dragging Mario across the stars, and exploring elaborate and grandiose areas and planets one after another. They could&amp;#39;ve easily just taken Super Mario 64, added new power-ups, levels, and prettier graphics, and called it a day. But they actually went above and beyond, and deconstructed the fundamentals of Mario Platforming simply by placing the whole thing in space. This is what I mean. Nintendo taking the well known conventions of a flagship property, and completely flipping them on its head. It&amp;#39;s also why I was disappointed by 3D World because it actually regresses Mario Platforming by sticking to the status quo, it wasn&amp;#39;t the game that people were expecting from a 3D Mario. This is what I want to see more of from them, especially from their mascot. I don&amp;#39;t mind a safe, conservative game every so often, but when you&amp;#39;re not doing anything bold or groundbreaking to balance it out, it makes you look creatively bankrupt. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It sounds more like you&amp;#39;re letting your opinion skew the facts. Super Mario 3D World, a game that you&amp;#39;re criticizing due to it&amp;#39;s &amp;#39;same-ness&amp;#39;, sold 5.5 million units, less than a million under Super Mario Galaxy 2. 3D World is literally the third highest selling Wii U game, under Mario Kart 8, and New Super Mario Bros U. (another samey Mario game). If you&amp;#39;re going to call Splatoon&amp;#39;s release a &amp;#39;major impact&amp;#39; to gaming, you have to be able to acknowledge that it sold less than Smash 5, a new Mario Kart, and two &amp;#39;samey&amp;#39; Super Mario Bros games.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Impact involves much more than just sales. It also factors in things like critical reception, engagement, cultural influence, etc. Super Mario 3D World may have sold pretty well, but groundbreaking game it was not. Splatoon had a much bigger impact because it provided something different, something ambitious, and something interesting. It&amp;#39;s a completely fresh take on the shooter, It&amp;#39;s played by millions of people online, it has a ton of fan-art and merchandise, it has a small but growing competitive scene, and it was one of the only Wii U games that didn&amp;#39;t feel like a retread or safe-bet. This is what I mean. It&amp;#39;s not just a matter of selling a few million copies, it&amp;#39;s a matter of actually making people stand up and take notice.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;1-2-Switch, a game that you&amp;#39;re praising as different and unique... it&amp;#39;s not doing well, dude. Mid level reviews all around, and it&amp;#39;s being beaten out on the eShop by Shovel Knight and the Binding of Issac, games that have been out for years. The feeling I&amp;#39;m getting, from talking with others, isn&amp;#39;t looking too favorable on ARMS, either. Most of the games I can buy on the eShop are games that I already own on my PC for CHEAPER, or bought for a different console altogether. It&amp;#39;s pretty telling when the headliner bit for the Nindies presentation was fucking Stardew Valley. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like I said, Impact means more than just sales. 1-2 Switch may have lukewarm critical reception. But what matters is that it&amp;#39;s unique, it&amp;#39;s interesting, it&amp;#39;s making people take notice. I mean look at all the memes and gifs the Milk mini-game alone has received. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Is this what you want? Nintendo to release kooky, interesting, new idea games, that don&amp;#39;t sell and push Nintendo farther underwater? Nintendo&amp;#39;s eShop being for old Indie titles and the Virtual Console? Because I don&amp;#39;t want that. I don&amp;#39;t think many people do. I like a new interesting idea. I applaud Breath of the Wild&amp;#39;s and Galaxy&amp;#39;s creativity, but Super Mario 3 and Tetris still sell.&lt;/p&gt;\n\n&lt;p&gt;Your &amp;quot;right track&amp;quot; is incredibly dangerous and risky for Nintendo as a company. I&amp;#39;m not calling you a hater, but I am going to say that you&amp;#39;re living in a weird fantasy where you both expect Nintendo to continuously make &amp;#39;ground-breaking new concepts&amp;#39; (while, I&amp;#39;ll add, dismissing the unique things they have done in a lot of their games), while at the same time expecting them to last as a company.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We&amp;#39;re talking about the company who saved the video game market in the US back in the 80s, revolutionized playing video games on the go, essentially created the platforming and action-adventure genres, showed everyone how 3D gameplay should be done, broke down the barriers of video games to newcomers, pioneered the modern casual game, and made a console that you can literally take with you anywhere. Nintendo is more than capable of changing the status quo when necessary. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t expect every game they put out to be new and groundbreaking. Like I said, I&amp;#39;m fine with the occasional safe-bet game. But if all you&amp;#39;re doing is just desperately clinging to the past, and not moving forward, or staying in tune with where the market is going, people will leave you behind. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Nintendo still carries the same ambition they have always had. Nintendo&amp;#39;s #1 goal, above EVERYTHING, is to make GOOD games. Not necessarily unique, or &amp;#39;ground-breaking&amp;#39;. Just good. I will happily call you a cynic, because at the end of the day, Nintendo did a good job with the WiiU releases, and the last thing I think any of us want them to do is focus on making garbage with &amp;quot;amazing concepts&amp;quot;. If it&amp;#39;s unique and won&amp;#39;t sell, then it&amp;#39;s not worth making. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nintendo&amp;#39;s corporate motto has always been &lt;em&gt;Dokusou&lt;/em&gt;, which roughly translated, means &lt;em&gt;&amp;quot;Create Something Unique&amp;quot;&lt;/em&gt;. What&amp;#39;s the point of having that slogan if all you&amp;#39;re doing is sticking to the same design and mechanical tropes with no change or improvement just because they sell?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd8vxp", "score_hidden": false, "stickied": false, "created": 1492442668.0, "created_utc": 1492413868.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7qe3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ManualSearch", "parent_id": "t1_dgd6gce", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "&gt;But prior to Splatoon, the last time a Nintendo game had a major impact on the industry was with Super Mario Galaxy and Wii Fit in 07-08.\n\nMate, you're going to have to be more precise in your description, here. What do you consider 'impacting the industry'? Fewer people talked about Wii Fit than they did Skyward Sword (released in 2011). You're, again, discrediting the impact that other WiiU titles, like Pikmin 3, Wonderful 101, Hyrule Warriors, and Mario Maker had on gaming. I'd even argue Other M had a big impact on gaming, or at least on Metroid, albeit a negative one. It's fine if you didn't feel like these games were big deals, but your feelings on games doesn't equate to facts. I certainly don't feel like ARMS is making that big of an impact on gaming, but opinion in this case doesn't matter. \n\nUltimately, it's not Nintendo's job to reinvent the wheel over and over again. The reason that Splatoon seemed to have a 'major impact on the industry' was because it was a new IP. With a company such as Nintendo, you cannot expect them to mix up how they create fourteen different IPs every time they produce a new game. Zelda is going to be like Zelda games, Pokemon is going to be like Pokemon games... and I find it a little funny that you'd call Galaxy a 'major impact' when Galaxy was pretty similar to all the other 3D Mario games, except with a pointer.\n\n&gt;I understand BotW was a WiiU game...\n\nThen how can you argue that the Switch is the driving force for the change? If Nintendo was acknowledging and actively changing before the Switch was being developed, then how can you argue that the Switch is behind this?\n\n&gt;When people expect a 3D Mario game, they expect something ambitious, ground-breaking, and potentially game-changing.\n\n... what.\n\nMate, did you play the Galaxy series? They were great games, but I'd hardly call them 'ambitious' or 'ground-breaking'. They were 3D Mario games.\n\nMario is a platforming game. It's about collecting coins or bits or whatever, and beating Bowser in different levels. I'll give you that Galaxy had some gravity mechanics, but implying that Nintendo has to add some small tweaks to the mechanics of a Mario game for it to be worthwhile does the opposite of what you're asking for - it encourages lazy changes to make people feel like the game is 'new' in some way.\n\nIt sounds more like you're letting your opinion skew the facts. Super Mario 3D World, a game that you're criticizing due to it's 'same-ness', [sold 5.5 million units](https://en.wikipedia.org/wiki/Super_Mario_3D_World#Sales), less than a million under [Super Mario Galaxy 2](https://en.wikipedia.org/wiki/Super_Mario_Galaxy_2#Sales). 3D World is literally the [third highest selling Wii U game](https://en.wikipedia.org/wiki/List_of_best-selling_Wii_U_video_games), under Mario Kart 8, and New Super Mario Bros U. (another samey Mario game). If you're going to call Splatoon's release a 'major impact' to gaming, you have to be able to acknowledge that it sold less than Smash 5, a new Mario Kart, and two 'samey' Super Mario Bros games.\n\nSo then, what do we do? What do we argue when games that you consider to be these fresh, new, big hitters, this 'return to form' as you will, undersell a Mario Kart with fresh new paint? Or Smash Bros with Little Mac? Or Super Mario Bros 8 and 9? The 'return to form' you want is, frankly, unprofitable:\n\n1-2-Switch, a game that you're praising as different and unique... [it's not doing well, dude.](https://en.wikipedia.org/wiki/1-2-Switch) Mid level reviews all around, and it's being beaten out on the eShop by Shovel Knight and the Binding of Issac, games that have been out for years. The feeling I'm getting, from talking with others, isn't looking too favorable on ARMS, either. Most of the games I can buy on the eShop are games that I already own on my PC for CHEAPER, or bought for a different console altogether. It's pretty telling when the headliner bit for the Nindies presentation was fucking Stardew Valley.\n\nIs this what you want? Nintendo to release kooky, interesting, new idea games, that don't sell and push Nintendo farther underwater?\n Nintendo's eShop being for old Indie titles and the Virtual Console? Because I don't want that. I don't think many people do. I like a new interesting idea. I applaud Breath of the Wild's and Galaxy's creativity, but Super Mario 3 and Tetris still sell.\n\nYour \"right track\" is incredibly dangerous and risky for Nintendo as a company. I'm not calling you a hater, but I am going to say that you're living in a weird fantasy where you both expect Nintendo to continuously make 'ground-breaking new concepts' (while, I'll add, dismissing the unique things they have done in a lot of their games), while at the same time expecting them to last as a company.\n\nNintendo still carries the same ambition they have always had. Nintendo's #1 goal, above EVERYTHING, is to make GOOD games. Not necessarily unique, or 'ground-breaking'. Just good. I will happily call you a cynic, because at the end of the day, Nintendo did a good job with the WiiU releases, and the last thing I think any of us want them to do is focus on making garbage with \"amazing concepts\". If it's unique and won't sell, then it's not worth making.", "edited": 1492411275.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But prior to Splatoon, the last time a Nintendo game had a major impact on the industry was with Super Mario Galaxy and Wii Fit in 07-08.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Mate, you&amp;#39;re going to have to be more precise in your description, here. What do you consider &amp;#39;impacting the industry&amp;#39;? Fewer people talked about Wii Fit than they did Skyward Sword (released in 2011). You&amp;#39;re, again, discrediting the impact that other WiiU titles, like Pikmin 3, Wonderful 101, Hyrule Warriors, and Mario Maker had on gaming. I&amp;#39;d even argue Other M had a big impact on gaming, or at least on Metroid, albeit a negative one. It&amp;#39;s fine if you didn&amp;#39;t feel like these games were big deals, but your feelings on games doesn&amp;#39;t equate to facts. I certainly don&amp;#39;t feel like ARMS is making that big of an impact on gaming, but opinion in this case doesn&amp;#39;t matter. &lt;/p&gt;\n\n&lt;p&gt;Ultimately, it&amp;#39;s not Nintendo&amp;#39;s job to reinvent the wheel over and over again. The reason that Splatoon seemed to have a &amp;#39;major impact on the industry&amp;#39; was because it was a new IP. With a company such as Nintendo, you cannot expect them to mix up how they create fourteen different IPs every time they produce a new game. Zelda is going to be like Zelda games, Pokemon is going to be like Pokemon games... and I find it a little funny that you&amp;#39;d call Galaxy a &amp;#39;major impact&amp;#39; when Galaxy was pretty similar to all the other 3D Mario games, except with a pointer.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I understand BotW was a WiiU game...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then how can you argue that the Switch is the driving force for the change? If Nintendo was acknowledging and actively changing before the Switch was being developed, then how can you argue that the Switch is behind this?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When people expect a 3D Mario game, they expect something ambitious, ground-breaking, and potentially game-changing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;... what.&lt;/p&gt;\n\n&lt;p&gt;Mate, did you play the Galaxy series? They were great games, but I&amp;#39;d hardly call them &amp;#39;ambitious&amp;#39; or &amp;#39;ground-breaking&amp;#39;. They were 3D Mario games.&lt;/p&gt;\n\n&lt;p&gt;Mario is a platforming game. It&amp;#39;s about collecting coins or bits or whatever, and beating Bowser in different levels. I&amp;#39;ll give you that Galaxy had some gravity mechanics, but implying that Nintendo has to add some small tweaks to the mechanics of a Mario game for it to be worthwhile does the opposite of what you&amp;#39;re asking for - it encourages lazy changes to make people feel like the game is &amp;#39;new&amp;#39; in some way.&lt;/p&gt;\n\n&lt;p&gt;It sounds more like you&amp;#39;re letting your opinion skew the facts. Super Mario 3D World, a game that you&amp;#39;re criticizing due to it&amp;#39;s &amp;#39;same-ness&amp;#39;, &lt;a href=\"https://en.wikipedia.org/wiki/Super_Mario_3D_World#Sales\"&gt;sold 5.5 million units&lt;/a&gt;, less than a million under &lt;a href=\"https://en.wikipedia.org/wiki/Super_Mario_Galaxy_2#Sales\"&gt;Super Mario Galaxy 2&lt;/a&gt;. 3D World is literally the &lt;a href=\"https://en.wikipedia.org/wiki/List_of_best-selling_Wii_U_video_games\"&gt;third highest selling Wii U game&lt;/a&gt;, under Mario Kart 8, and New Super Mario Bros U. (another samey Mario game). If you&amp;#39;re going to call Splatoon&amp;#39;s release a &amp;#39;major impact&amp;#39; to gaming, you have to be able to acknowledge that it sold less than Smash 5, a new Mario Kart, and two &amp;#39;samey&amp;#39; Super Mario Bros games.&lt;/p&gt;\n\n&lt;p&gt;So then, what do we do? What do we argue when games that you consider to be these fresh, new, big hitters, this &amp;#39;return to form&amp;#39; as you will, undersell a Mario Kart with fresh new paint? Or Smash Bros with Little Mac? Or Super Mario Bros 8 and 9? The &amp;#39;return to form&amp;#39; you want is, frankly, unprofitable:&lt;/p&gt;\n\n&lt;p&gt;1-2-Switch, a game that you&amp;#39;re praising as different and unique... &lt;a href=\"https://en.wikipedia.org/wiki/1-2-Switch\"&gt;it&amp;#39;s not doing well, dude.&lt;/a&gt; Mid level reviews all around, and it&amp;#39;s being beaten out on the eShop by Shovel Knight and the Binding of Issac, games that have been out for years. The feeling I&amp;#39;m getting, from talking with others, isn&amp;#39;t looking too favorable on ARMS, either. Most of the games I can buy on the eShop are games that I already own on my PC for CHEAPER, or bought for a different console altogether. It&amp;#39;s pretty telling when the headliner bit for the Nindies presentation was fucking Stardew Valley.&lt;/p&gt;\n\n&lt;p&gt;Is this what you want? Nintendo to release kooky, interesting, new idea games, that don&amp;#39;t sell and push Nintendo farther underwater?\n Nintendo&amp;#39;s eShop being for old Indie titles and the Virtual Console? Because I don&amp;#39;t want that. I don&amp;#39;t think many people do. I like a new interesting idea. I applaud Breath of the Wild&amp;#39;s and Galaxy&amp;#39;s creativity, but Super Mario 3 and Tetris still sell.&lt;/p&gt;\n\n&lt;p&gt;Your &amp;quot;right track&amp;quot; is incredibly dangerous and risky for Nintendo as a company. I&amp;#39;m not calling you a hater, but I am going to say that you&amp;#39;re living in a weird fantasy where you both expect Nintendo to continuously make &amp;#39;ground-breaking new concepts&amp;#39; (while, I&amp;#39;ll add, dismissing the unique things they have done in a lot of their games), while at the same time expecting them to last as a company.&lt;/p&gt;\n\n&lt;p&gt;Nintendo still carries the same ambition they have always had. Nintendo&amp;#39;s #1 goal, above EVERYTHING, is to make GOOD games. Not necessarily unique, or &amp;#39;ground-breaking&amp;#39;. Just good. I will happily call you a cynic, because at the end of the day, Nintendo did a good job with the WiiU releases, and the last thing I think any of us want them to do is focus on making garbage with &amp;quot;amazing concepts&amp;quot;. If it&amp;#39;s unique and won&amp;#39;t sell, then it&amp;#39;s not worth making.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd7qe3", "score_hidden": false, "stickied": false, "created": 1492439889.0, "created_utc": 1492411089.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6gce", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "TheMisterManGuy", "parent_id": "t1_dgd599o", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "&gt; Nintendo is doing the same stuff Nintendo has always done. During the WiiU, we saw powerful software being designed, like Smash 4, Xenoblade Chronicles X, and Captain Toad. We saw titles that flopped, like Star Fox Zero. We saw new IPs being created, like Nintendoland and Splatoon. Nintendo is not doing anything 'different', and certainly not to a level I'd call a 're-invention'.\n\nNintendo has always done experiments. But prior to Splatoon, the last time a Nintendo game had a major impact on the industry was with Super Mario Galaxy and Wii Fit in 07-08. Nintendo throughout much of the Wii U era, had in my opinion, been very stagnant and safe. Relying on recycled concepts from the previous generation, and even regressing in some areas like 3D World and Star Fox Zero (which is yet another retread of 64, this time with a forced asymmetrical gimmick). You know a prolific publisher was going downhill when the flagship launch title for their new home console, was yet another sterile and phoned-in Mario sidescroller. Splatoon honestly, was a breath of fresh air for Nintendo, as it was the first truly original game to come out of them with any sort of industry impact in more than 5 years. \n\n&gt;Your \"new rules\" for Zelda and Mario are, frankly, you adding emphasis to a game being designed a different way. Breath of the Wild is a great game, and the open world concept in Zelda is new... but this is unrelated to the Switch. BotW has been in development since early in the Wii U's cycle. If anything, we have the WiiU's generation to credit for a lot of what made BotW amazing. I have no idea what \"new rules\" you're talking about with Oddessy, since we've only seen like... one teaser trailer for it. Where are you finding all this information about \"new rules\" in the new Mario?\nYou're making this argument that Nintendo has 'lost their way as a developer' months after they released Breath of the Wild, a game that was created for the WiiU and has garnered critical acclaim. Sure, it was put on Switch too, to help sell systems... but let's not forget that BotW was originally a WiiU game.\n\nI understand that Breath of the Wild was conceived as a Wii U game, but it was conceived around the time Nintendo began realizing that their software was becoming too conservative, and thus, needed to change. Breath of the Wild shows what Nintendo can do when they're not being creatively stubborn, and is a much needed change of pace for the Zelda series.\n\nAs for Mario, while the games are still fun, its impossible to deny that even Nintendo's mustached Italiano was dry for ideas. 3D World is a great game, but it wasn't the 3D Mario the Wii U needed. How do you go from the ambition, scope, and grandiose imagination of the Galaxy games, to the safe, sterile, and overly-polished world of the Wii U's 3D Mario game? Super Mario Odyssey marks a true return to form for Mario. When people expect a 3D Mario game, they expect something ambitious, ground-breaking, and potentially game-changing. 3D World, while fantastic in its own right, was none of those things. \n\nKeep in mind, I'm not saying Nintendo's Wii U output was bad. I recognize the quality of games like Captain Toad, 3D World, Donkey Kong Country: Tropical Freeze, Smash 4 and so on. Even at their lowest point, Nintendo is still able to pump out consistently well made games. However, just making a good Mario Kart, or a good Smash Bros. doesn't mean Nintendo hasn't gone downhill. I say Nintendo has lost their way because they had forgotten the ambition and logical innovation they're usually known for. Either presenting ground-breaking new concepts, or drastically changing up their well known properties. Solving problems that actually existed, and even creating stuff you didn't even know you wanted. But for much of the Wii U's life, they  have taken their strengths way too far, and simply became a shallow parody of themselves. If you want proof, all you have to do is look at E3 2015 and the unwanted spin-offs nobody asked for, by this point it became abundantly clear how far Nintendo had fallen. Call me harsh, call me a cynic, even call me a hater if you will and I realize that most of this is just my opinion, but I've just been disappointed by Nintendo's direction in the Wii U era. \n\nWith the Switch though, things are looking a little rosier, and Nintendo is really starting to get back on the right track.", "edited": 1492410279.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Nintendo is doing the same stuff Nintendo has always done. During the WiiU, we saw powerful software being designed, like Smash 4, Xenoblade Chronicles X, and Captain Toad. We saw titles that flopped, like Star Fox Zero. We saw new IPs being created, like Nintendoland and Splatoon. Nintendo is not doing anything &amp;#39;different&amp;#39;, and certainly not to a level I&amp;#39;d call a &amp;#39;re-invention&amp;#39;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nintendo has always done experiments. But prior to Splatoon, the last time a Nintendo game had a major impact on the industry was with Super Mario Galaxy and Wii Fit in 07-08. Nintendo throughout much of the Wii U era, had in my opinion, been very stagnant and safe. Relying on recycled concepts from the previous generation, and even regressing in some areas like 3D World and Star Fox Zero (which is yet another retread of 64, this time with a forced asymmetrical gimmick). You know a prolific publisher was going downhill when the flagship launch title for their new home console, was yet another sterile and phoned-in Mario sidescroller. Splatoon honestly, was a breath of fresh air for Nintendo, as it was the first truly original game to come out of them with any sort of industry impact in more than 5 years. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your &amp;quot;new rules&amp;quot; for Zelda and Mario are, frankly, you adding emphasis to a game being designed a different way. Breath of the Wild is a great game, and the open world concept in Zelda is new... but this is unrelated to the Switch. BotW has been in development since early in the Wii U&amp;#39;s cycle. If anything, we have the WiiU&amp;#39;s generation to credit for a lot of what made BotW amazing. I have no idea what &amp;quot;new rules&amp;quot; you&amp;#39;re talking about with Oddessy, since we&amp;#39;ve only seen like... one teaser trailer for it. Where are you finding all this information about &amp;quot;new rules&amp;quot; in the new Mario?\nYou&amp;#39;re making this argument that Nintendo has &amp;#39;lost their way as a developer&amp;#39; months after they released Breath of the Wild, a game that was created for the WiiU and has garnered critical acclaim. Sure, it was put on Switch too, to help sell systems... but let&amp;#39;s not forget that BotW was originally a WiiU game.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I understand that Breath of the Wild was conceived as a Wii U game, but it was conceived around the time Nintendo began realizing that their software was becoming too conservative, and thus, needed to change. Breath of the Wild shows what Nintendo can do when they&amp;#39;re not being creatively stubborn, and is a much needed change of pace for the Zelda series.&lt;/p&gt;\n\n&lt;p&gt;As for Mario, while the games are still fun, its impossible to deny that even Nintendo&amp;#39;s mustached Italiano was dry for ideas. 3D World is a great game, but it wasn&amp;#39;t the 3D Mario the Wii U needed. How do you go from the ambition, scope, and grandiose imagination of the Galaxy games, to the safe, sterile, and overly-polished world of the Wii U&amp;#39;s 3D Mario game? Super Mario Odyssey marks a true return to form for Mario. When people expect a 3D Mario game, they expect something ambitious, ground-breaking, and potentially game-changing. 3D World, while fantastic in its own right, was none of those things. &lt;/p&gt;\n\n&lt;p&gt;Keep in mind, I&amp;#39;m not saying Nintendo&amp;#39;s Wii U output was bad. I recognize the quality of games like Captain Toad, 3D World, Donkey Kong Country: Tropical Freeze, Smash 4 and so on. Even at their lowest point, Nintendo is still able to pump out consistently well made games. However, just making a good Mario Kart, or a good Smash Bros. doesn&amp;#39;t mean Nintendo hasn&amp;#39;t gone downhill. I say Nintendo has lost their way because they had forgotten the ambition and logical innovation they&amp;#39;re usually known for. Either presenting ground-breaking new concepts, or drastically changing up their well known properties. Solving problems that actually existed, and even creating stuff you didn&amp;#39;t even know you wanted. But for much of the Wii U&amp;#39;s life, they  have taken their strengths way too far, and simply became a shallow parody of themselves. If you want proof, all you have to do is look at E3 2015 and the unwanted spin-offs nobody asked for, by this point it became abundantly clear how far Nintendo had fallen. Call me harsh, call me a cynic, even call me a hater if you will and I realize that most of this is just my opinion, but I&amp;#39;ve just been disappointed by Nintendo&amp;#39;s direction in the Wii U era. &lt;/p&gt;\n\n&lt;p&gt;With the Switch though, things are looking a little rosier, and Nintendo is really starting to get back on the right track.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd6gce", "score_hidden": false, "stickied": false, "created": 1492437062.0, "created_utc": 1492408262.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd599o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ManualSearch", "parent_id": "t1_dgd3jbh", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "Here's the problem: all these 'new and fresh' ideas you're putting forward, all these examples of 're-invention' that Nintendo is doing to push forward the Switch, is frankly ignoring the truth. Your OP, as well as this post, sound like you're just trying to use use complex-sounding words to make people think you're smart.\n\nNintendo is doing the same stuff Nintendo has *always done*. During the WiiU, we saw powerful software being designed, like Smash 4, Xenoblade Chronicles X, and Captain Toad. We saw titles that flopped, like Star Fox Zero. We saw new IPs being created, like Nintendoland and Splatoon. Nintendo is not doing anything 'different', and certainly not to a level I'd call a 're-invention'.\n\nYour \"new rules\" for Zelda and Mario are, frankly, you adding emphasis to a game being designed a different way. Breath of the Wild is a great game, and the open world concept in Zelda is new... but this is unrelated to the Switch. BotW has been in development since early in the WiiU's cycle. If anything, we have the WiiU's generation to credit for a lot of what made BotW amazing. I have no idea what \"new rules\" you're talking about with Oddessy, since we've only seen like... one teaser trailer for it. Where are you finding all this information about \"new rules\" in the new Mario?\n\nYou're making this argument that Nintendo has 'lost their way as a developer' months after they released Breath of the Wild, a game that was created **for the WiiU** and has garnered **critical acclaim**. Sure, it was put on Switch too, to help sell systems... but let's not forget that BotW was originally a WiiU game.\n\nSo I guess what I'm saying is I don't understand what you're saying. I admit that the WiiU bombed hard, but the reason that it bombed had nothing to do with Nintendo's software. It didn't sell well due to customer confusion, which kept third party companies from developing software for it. Over the WiiU's life cycle, we've seen plenty of new, fresh, and interesting software from Nintendo, including BotW and Mario Maker, new hit IPs in Splatoon and Captain Toad, and some great sequels like Smash 4 and Pikmin 3. \n\nWhere are you drawing this idea that Nintendo is doing something that they weren't doing for the WiiU? What are the things you think Nintendo is doing now, that they weren't doing during the WiiU generation? If you're going to present this idea that the Switch is 'rebooting Nintendo's in-house talent', you're going to have to bring more to the table than 'they hired a few new dudes and are making a new IP'. \n\nSo let's hear it. How do you think Nintendo is operating differently than they always have?", "edited": 1492406263.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s the problem: all these &amp;#39;new and fresh&amp;#39; ideas you&amp;#39;re putting forward, all these examples of &amp;#39;re-invention&amp;#39; that Nintendo is doing to push forward the Switch, is frankly ignoring the truth. Your OP, as well as this post, sound like you&amp;#39;re just trying to use use complex-sounding words to make people think you&amp;#39;re smart.&lt;/p&gt;\n\n&lt;p&gt;Nintendo is doing the same stuff Nintendo has &lt;em&gt;always done&lt;/em&gt;. During the WiiU, we saw powerful software being designed, like Smash 4, Xenoblade Chronicles X, and Captain Toad. We saw titles that flopped, like Star Fox Zero. We saw new IPs being created, like Nintendoland and Splatoon. Nintendo is not doing anything &amp;#39;different&amp;#39;, and certainly not to a level I&amp;#39;d call a &amp;#39;re-invention&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Your &amp;quot;new rules&amp;quot; for Zelda and Mario are, frankly, you adding emphasis to a game being designed a different way. Breath of the Wild is a great game, and the open world concept in Zelda is new... but this is unrelated to the Switch. BotW has been in development since early in the WiiU&amp;#39;s cycle. If anything, we have the WiiU&amp;#39;s generation to credit for a lot of what made BotW amazing. I have no idea what &amp;quot;new rules&amp;quot; you&amp;#39;re talking about with Oddessy, since we&amp;#39;ve only seen like... one teaser trailer for it. Where are you finding all this information about &amp;quot;new rules&amp;quot; in the new Mario?&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re making this argument that Nintendo has &amp;#39;lost their way as a developer&amp;#39; months after they released Breath of the Wild, a game that was created &lt;strong&gt;for the WiiU&lt;/strong&gt; and has garnered &lt;strong&gt;critical acclaim&lt;/strong&gt;. Sure, it was put on Switch too, to help sell systems... but let&amp;#39;s not forget that BotW was originally a WiiU game.&lt;/p&gt;\n\n&lt;p&gt;So I guess what I&amp;#39;m saying is I don&amp;#39;t understand what you&amp;#39;re saying. I admit that the WiiU bombed hard, but the reason that it bombed had nothing to do with Nintendo&amp;#39;s software. It didn&amp;#39;t sell well due to customer confusion, which kept third party companies from developing software for it. Over the WiiU&amp;#39;s life cycle, we&amp;#39;ve seen plenty of new, fresh, and interesting software from Nintendo, including BotW and Mario Maker, new hit IPs in Splatoon and Captain Toad, and some great sequels like Smash 4 and Pikmin 3. &lt;/p&gt;\n\n&lt;p&gt;Where are you drawing this idea that Nintendo is doing something that they weren&amp;#39;t doing for the WiiU? What are the things you think Nintendo is doing now, that they weren&amp;#39;t doing during the WiiU generation? If you&amp;#39;re going to present this idea that the Switch is &amp;#39;rebooting Nintendo&amp;#39;s in-house talent&amp;#39;, you&amp;#39;re going to have to bring more to the table than &amp;#39;they hired a few new dudes and are making a new IP&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s hear it. How do you think Nintendo is operating differently than they always have?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd599o", "score_hidden": false, "stickied": false, "created": 1492434628.0, "created_utc": 1492405828.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3jbh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TheMisterManGuy", "parent_id": "t1_dgd1p09", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "As I mentioned, the Famicom served as a key starting point for Nintendo's in-house studios. At the time, Nintendo was still relatively new to the video game industry, with their only prior experience being Arcades, home pong machines, and the Game &amp; Watch line. As such, they were still trying to find a cohesive identity as a software developer. This led to some ground-breaking titles, and some unique gems too, as well as games you never expect from Nintendo nowadays like the Famicom Detective series or The Mysterious Murasame Castle. By the end of the Super Famicom era, Nintendo had established themselves as THE leading game developer and publisher, always showing everyone else how things should be done. \n\nIn the Wii U era though, Nintendo had sort of lost their way as a developer, and had fallen behind many other developers from the indie, mobile, and even AAA space. The reason I brought up the Famicom in relation to the Nintendo Switch is because the Switch, the way I see it, marks a key turning point for Nintendo as a developer. A chance to start fresh, and try and find a new identity for their software. That means New rules for Mario and Zelda, New characters like Spring Man and Inklings, New Creators like Kosuke Yabuki and Tsubasa Sakaguchi, and a New Generation of leaders like Koizumi and Takahashi. The Switch in a way, is sort of a reboot for Nintendo's in-house talent, and a way for Nintendo to re-invent both their iconic properties, and themselves as a game developer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As I mentioned, the Famicom served as a key starting point for Nintendo&amp;#39;s in-house studios. At the time, Nintendo was still relatively new to the video game industry, with their only prior experience being Arcades, home pong machines, and the Game &amp;amp; Watch line. As such, they were still trying to find a cohesive identity as a software developer. This led to some ground-breaking titles, and some unique gems too, as well as games you never expect from Nintendo nowadays like the Famicom Detective series or The Mysterious Murasame Castle. By the end of the Super Famicom era, Nintendo had established themselves as THE leading game developer and publisher, always showing everyone else how things should be done. &lt;/p&gt;\n\n&lt;p&gt;In the Wii U era though, Nintendo had sort of lost their way as a developer, and had fallen behind many other developers from the indie, mobile, and even AAA space. The reason I brought up the Famicom in relation to the Nintendo Switch is because the Switch, the way I see it, marks a key turning point for Nintendo as a developer. A chance to start fresh, and try and find a new identity for their software. That means New rules for Mario and Zelda, New characters like Spring Man and Inklings, New Creators like Kosuke Yabuki and Tsubasa Sakaguchi, and a New Generation of leaders like Koizumi and Takahashi. The Switch in a way, is sort of a reboot for Nintendo&amp;#39;s in-house talent, and a way for Nintendo to re-invent both their iconic properties, and themselves as a game developer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd3jbh", "score_hidden": false, "stickied": false, "created": 1492431492.0, "created_utc": 1492402692.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgddbx1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zatOMG", "parent_id": "t1_dgda6oq", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "He may be condisecending but at least he doesn't have his head up his ass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He may be condisecending but at least he doesn&amp;#39;t have his head up his ass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgddbx1", "score_hidden": false, "stickied": false, "created": 1492456958.0, "created_utc": 1492428158.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgda8tz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ManualSearch", "parent_id": "t1_dgda6oq", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "I can't see the difference between your last post and what Barney told me while I was five. ", "edited": 1492418321.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t see the difference between your last post and what Barney told me while I was five. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgda8tz", "score_hidden": false, "stickied": false, "created": 1492446940.0, "created_utc": 1492418140.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda6oq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgda2hr", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "[deleted]", "edited": 1492437531.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgda6oq", "score_hidden": false, "stickied": false, "created": 1492446736.0, "created_utc": 1492417936.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda2hr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ManualSearch", "parent_id": "t1_dgd9x2u", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "It's a point Nintendo mentioned in their own reveal of the Nintendo Switch. It's not a fresh point, or one that was invented by OP. It was invented by Nintendo's marketing team.\n\nMy future self is just fine, thanks. Telling me how bad my condescending tone is while condescending me is pretty hypocritical. So please, for the sake of my not wanting to be told how to talk on the Internet by some rando, get lost.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a point Nintendo mentioned in their own reveal of the Nintendo Switch. It&amp;#39;s not a fresh point, or one that was invented by OP. It was invented by Nintendo&amp;#39;s marketing team.&lt;/p&gt;\n\n&lt;p&gt;My future self is just fine, thanks. Telling me how bad my condescending tone is while condescending me is pretty hypocritical. So please, for the sake of my not wanting to be told how to talk on the Internet by some rando, get lost.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgda2hr", "score_hidden": false, "stickied": false, "created": 1492446347.0, "created_utc": 1492417547.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9x2u", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgd9qyr", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "[deleted]", "edited": 1492437522.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd9x2u", "score_hidden": false, "stickied": false, "created": 1492445839.0, "created_utc": 1492417039.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9qyr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ManualSearch", "parent_id": "t1_dgd98gs", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Would you please explain which points you found were good?\n\nBecause, if you notice below, I'm still arguing the points he's making, and I'd love to understand better how any of these points are good.\n\nOP's argument is that Nintendo doesn't make enough creative endeavors. My argument is that judging creativity based on a goal line that you yourself set only means that you have high standards. Nintendo makes creative stuff all the time, and just because it's not enough for the OP doesn't mean that the OP is right.\n\nNintendo is not 're-inventing' themselves by making 1-2 Switch and ARMS. Nintendo is not 're-inventing' themselves by releasing the Switch. What Nintendo is doing is trying to make a video game console that is good, will sell well, and people will like.\n\nIt doesn't make it 'the new Famicom', it just makes it a new console.\n\nSo what points did you think were good? What points did OP make that you thought made sense and weren't OP's opinion warping the facts of the matter?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you please explain which points you found were good?&lt;/p&gt;\n\n&lt;p&gt;Because, if you notice below, I&amp;#39;m still arguing the points he&amp;#39;s making, and I&amp;#39;d love to understand better how any of these points are good.&lt;/p&gt;\n\n&lt;p&gt;OP&amp;#39;s argument is that Nintendo doesn&amp;#39;t make enough creative endeavors. My argument is that judging creativity based on a goal line that you yourself set only means that you have high standards. Nintendo makes creative stuff all the time, and just because it&amp;#39;s not enough for the OP doesn&amp;#39;t mean that the OP is right.&lt;/p&gt;\n\n&lt;p&gt;Nintendo is not &amp;#39;re-inventing&amp;#39; themselves by making 1-2 Switch and ARMS. Nintendo is not &amp;#39;re-inventing&amp;#39; themselves by releasing the Switch. What Nintendo is doing is trying to make a video game console that is good, will sell well, and people will like.&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t make it &amp;#39;the new Famicom&amp;#39;, it just makes it a new console.&lt;/p&gt;\n\n&lt;p&gt;So what points did you think were good? What points did OP make that you thought made sense and weren&amp;#39;t OP&amp;#39;s opinion warping the facts of the matter?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd9qyr", "score_hidden": false, "stickied": false, "created": 1492445281.0, "created_utc": 1492416481.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd98gs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgd1p09", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "[deleted]", "edited": 1492437512.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd98gs", "score_hidden": false, "stickied": false, "created": 1492443677.0, "created_utc": 1492414877.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd8xwk", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Ambitus", "parent_id": "t1_dgd1p09", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "Jesus why do you have such an offended tone?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus why do you have such an offended tone?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd8xwk", "score_hidden": false, "stickied": false, "created": 1492442821.0, "created_utc": 1492414021.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1p09", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "ManualSearch", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "DAE think Nintendo is trying to make the Switch their next video game console???\n\nWhat the hell are you asking me, here? If by 'next Famicom' you mean 'next very successful system', then sure. They're trying to do that with every console they make. They're a business, it's their job.\n\nIf by 'next Famicom', you mean 'a system with similarities to the Famicom', then mate, I hate to break this to you, but I can draw parallels to most systems and the Famicom. It's not difficult to make connections like that.\n\nI think Nintendo is trying to make the Switch a popular system that lots of people will want to play. And I think they're doing that by including elements that help people play it the ways they want to. It's, in short, the exact same thing they've done with every other video game console ever. It's their job, as designers, to do that.\n\nSo, no. I don't think 'Nintendo is trying to make the Switch their next Famicom'. I think Nintendo is trying to make the Switch a successful gaming console, just like they did with the Famicom.\n\nWhat are you asking me, here?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DAE think Nintendo is trying to make the Switch their next video game console???&lt;/p&gt;\n\n&lt;p&gt;What the hell are you asking me, here? If by &amp;#39;next Famicom&amp;#39; you mean &amp;#39;next very successful system&amp;#39;, then sure. They&amp;#39;re trying to do that with every console they make. They&amp;#39;re a business, it&amp;#39;s their job.&lt;/p&gt;\n\n&lt;p&gt;If by &amp;#39;next Famicom&amp;#39;, you mean &amp;#39;a system with similarities to the Famicom&amp;#39;, then mate, I hate to break this to you, but I can draw parallels to most systems and the Famicom. It&amp;#39;s not difficult to make connections like that.&lt;/p&gt;\n\n&lt;p&gt;I think Nintendo is trying to make the Switch a popular system that lots of people will want to play. And I think they&amp;#39;re doing that by including elements that help people play it the ways they want to. It&amp;#39;s, in short, the exact same thing they&amp;#39;ve done with every other video game console ever. It&amp;#39;s their job, as designers, to do that.&lt;/p&gt;\n\n&lt;p&gt;So, no. I don&amp;#39;t think &amp;#39;Nintendo is trying to make the Switch their next Famicom&amp;#39;. I think Nintendo is trying to make the Switch a successful gaming console, just like they did with the Famicom.&lt;/p&gt;\n\n&lt;p&gt;What are you asking me, here?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd1p09", "score_hidden": false, "stickied": false, "created": 1492428580.0, "created_utc": 1492399780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgcy0z8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ThaNorth", "parent_id": "t1_dgcvqi8", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Oohh, right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oohh, right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcy0z8", "score_hidden": false, "stickied": false, "created": 1492423406.0, "created_utc": 1492394606.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvqi8", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "TinyFoxFairyGirl", "parent_id": "t1_dgcu1g8", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Famicon=NES\n\nSuper Famicon=SNES", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Famicon=NES&lt;/p&gt;\n\n&lt;p&gt;Super Famicon=SNES&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcvqi8", "score_hidden": false, "stickied": false, "created": 1492420348.0, "created_utc": 1492391548.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd2em0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PlasmaGruntWill", "parent_id": "t1_dgd24ec", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "i'm not convinced", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m not convinced&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd2em0", "score_hidden": false, "stickied": false, "created": 1492429649.0, "created_utc": 1492400849.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd24ec", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "ThaNorth", "parent_id": "t1_dgd1j0m", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Heh, not the same.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heh, not the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd24ec", "score_hidden": false, "stickied": false, "created": 1492429214.0, "created_utc": 1492400414.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1j0m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PlasmaGruntWill", "parent_id": "t1_dgcu1g8", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "3DS?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;3DS?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd1j0m", "score_hidden": false, "stickied": false, "created": 1492428341.0, "created_utc": 1492399541.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgczpq0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jokoman444", "parent_id": "t1_dgcz16t", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Agreed, just providing the statistics.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed, just providing the statistics.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgczpq0", "score_hidden": false, "stickied": false, "created": 1492425767.0, "created_utc": 1492396967.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd0y6t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgd0q7c", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Sadly the slim models are only backwards compatible with ps1 games and only a few ps2 games are available in the ps store, there is the silent hill hd collection but i read that its full of bugs so i want to play the originals", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sadly the slim models are only backwards compatible with ps1 games and only a few ps2 games are available in the ps store, there is the silent hill hd collection but i read that its full of bugs so i want to play the originals&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd0y6t", "score_hidden": false, "stickied": false, "created": 1492427505.0, "created_utc": 1492398705.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0q7c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-amiibo-", "parent_id": "t1_dgd0hak", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Aren't they available via PS3?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aren&amp;#39;t they available via PS3?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd0q7c", "score_hidden": false, "stickied": false, "created": 1492427182.0, "created_utc": 1492398382.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0hak", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgczx8t", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I really need a ps2, the silent hill games alone make me want to buy one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really need a ps2, the silent hill games alone make me want to buy one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd0hak", "score_hidden": false, "stickied": false, "created": 1492426830.0, "created_utc": 1492398030.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczx8t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-amiibo-", "parent_id": "t1_dgcz16t", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I'd say the PS1 library is littered with quality games, but with the pretence \"for that generation\". A lot of the good PS1 games are just outright outshone by PS2 titles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say the PS1 library is littered with quality games, but with the pretence &amp;quot;for that generation&amp;quot;. A lot of the good PS1 games are just outright outshone by PS2 titles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgczx8t", "score_hidden": false, "stickied": false, "created": 1492426047.0, "created_utc": 1492397247.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcz16t", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "rube", "parent_id": "t1_dgcyeip", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "&gt; ridiculously large and littered with quality titles.\n\nIt's of course a matter of opinion, but I'd say the SNES overall had more high quality games compared to the PS1.  It has nothing to do with the total number of games.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;ridiculously large and littered with quality titles.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s of course a matter of opinion, but I&amp;#39;d say the SNES overall had more high quality games compared to the PS1.  It has nothing to do with the total number of games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcz16t", "score_hidden": false, "stickied": false, "created": 1492424809.0, "created_utc": 1492396009.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd0thy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MashimaroG4", "parent_id": "t1_dgcyeip", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I still have a PS1 for the game library. of that 1,200 titles probably 1,000 were crap, but there were some real gems in there that wouldn't get made today (or would be made as a mobile game) . I also really loved the \"party\" games on the Game Cube, Not just Mario party, but shrek-park, pac-man-party, it seems everyone was releasing games meant to be played on the couch with friends. I really hope we get some more couch-friendly board game types with the switch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I still have a PS1 for the game library. of that 1,200 titles probably 1,000 were crap, but there were some real gems in there that wouldn&amp;#39;t get made today (or would be made as a mobile game) . I also really loved the &amp;quot;party&amp;quot; games on the Game Cube, Not just Mario party, but shrek-park, pac-man-party, it seems everyone was releasing games meant to be played on the couch with friends. I really hope we get some more couch-friendly board game types with the switch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd0thy", "score_hidden": false, "stickied": false, "created": 1492427316.0, "created_utc": 1492398516.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd237g", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ThaNorth", "parent_id": "t1_dgcyeip", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "You know I'm not talking about just numbers. As I said in my first post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know I&amp;#39;m not talking about just numbers. As I said in my first post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd237g", "score_hidden": false, "stickied": false, "created": 1492429164.0, "created_utc": 1492400364.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyeip", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Jokoman444", "parent_id": "t1_dgcy2ce", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "NES/Famicom: 714 titles\nGameCube: 661 titles\nSNES/Super Famicom: 721 titles\nPS1: **1,238 titles** :O", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;NES/Famicom: 714 titles\nGameCube: 661 titles\nSNES/Super Famicom: 721 titles\nPS1: &lt;strong&gt;1,238 titles&lt;/strong&gt; :O&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcyeip", "score_hidden": false, "stickied": false, "created": 1492423932.0, "created_utc": 1492395132.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgcyfmn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgcy2ce", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Thats why i said \"imo\", the gamecube has great games too", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thats why i said &amp;quot;imo&amp;quot;, the gamecube has great games too&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcyfmn", "score_hidden": false, "stickied": false, "created": 1492423975.0, "created_utc": 1492395175.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcy2ce", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThaNorth", "parent_id": "t1_dgcwu3s", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": " The Gamecube?The library isn't close to what the SNES or PS1 has. C'mon, man. You know that's a goddamn lie.", "edited": 1492395091.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Gamecube?The library isn&amp;#39;t close to what the SNES or PS1 has. C&amp;#39;mon, man. You know that&amp;#39;s a goddamn lie.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcy2ce", "score_hidden": false, "stickied": false, "created": 1492423460.0, "created_utc": 1492394660.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwu3s", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Fiti99", "parent_id": "t1_dgcu1g8", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "The ps1, gamecube, gba and ps3 are on par with the snes imo\n\nEdit: i also put wii u on par with those but i know im in the minority there (or maybe the only one) and it doesnt have many games compared to those systems", "edited": 1492403429.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The ps1, gamecube, gba and ps3 are on par with the snes imo&lt;/p&gt;\n\n&lt;p&gt;Edit: i also put wii u on par with those but i know im in the minority there (or maybe the only one) and it doesnt have many games compared to those systems&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcwu3s", "score_hidden": false, "stickied": false, "created": 1492421756.0, "created_utc": 1492392956.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu1g8", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "ThaNorth", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": " Nothing will match the SNES because the SNES game library is ridiculously large and littered with quality titles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing will match the SNES because the SNES game library is ridiculously large and littered with quality titles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcu1g8", "score_hidden": false, "stickied": false, "created": 1492418099.0, "created_utc": 1492389299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgcy4ul", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "salamander_poo", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 1, "body": "theyre trying to make the switch their first switch", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;theyre trying to make the switch their first switch&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgcy4ul", "score_hidden": false, "stickied": false, "created": 1492423556.0, "created_utc": 1492394756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd8qby", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "NefariousJoe", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "They're not trying to make it the next Wii, and that's all that matters right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re not trying to make it the next Wii, and that&amp;#39;s all that matters right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd8qby", "score_hidden": false, "stickied": false, "created": 1492442238.0, "created_utc": 1492413438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdnuig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheBionicBoy", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "The NES was a rebirth for the gaming industry, the Switch is a rebirth for Nintendo.\n\nNintendo has broken conventions with their hardware since the Wii, and are now giving the same treatment to their franchises. It's a risky move which so far has payed off rather well.\n\nThe Switch really feels the next Famicom, because the situation is the same: the console market is shrinking. Less and less people are gaming, and out of the woodwork comes Nintendo with something brand new and exciting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The NES was a rebirth for the gaming industry, the Switch is a rebirth for Nintendo.&lt;/p&gt;\n\n&lt;p&gt;Nintendo has broken conventions with their hardware since the Wii, and are now giving the same treatment to their franchises. It&amp;#39;s a risky move which so far has payed off rather well.&lt;/p&gt;\n\n&lt;p&gt;The Switch really feels the next Famicom, because the situation is the same: the console market is shrinking. Less and less people are gaming, and out of the woodwork comes Nintendo with something brand new and exciting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgdnuig", "score_hidden": true, "stickied": false, "created": 1492473365.0, "created_utc": 1492444565.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnk", "removal_reason": null, "link_id": "t3_65re7l", "likes": null, "replies": "", "user_reports": [], "id": "dgd8yoi", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Ambitus", "parent_id": "t1_dgd7j2p", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "Definitely 100% completely relevant and absolutely contributes to the discussion op wanted to have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely 100% completely relevant and absolutely contributes to the discussion op wanted to have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd8yoi", "score_hidden": false, "stickied": false, "created": 1492442883.0, "created_utc": 1492414083.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7j2p", "gilded": 0, "archived": false, "score": -23, "report_reasons": null, "author": "ph4nt0m117", "parent_id": "t3_65re7l", "subreddit_name_prefixed": "r/nintendo", "controversiality": 0, "body": "I have a better question for you, Op, why is nintendo shooting themselves in the foot, knees, and gouging their eyes out so they don't see their mistakes?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a better question for you, Op, why is nintendo shooting themselves in the foot, knees, and gouging their eyes out so they don&amp;#39;t see their mistakes?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "nintendo", "name": "t1_dgd7j2p", "score_hidden": false, "stickied": false, "created": 1492439426.0, "created_utc": 1492410626.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -23}}], "after": null, "before": null}}]