[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As this post is being writen I would like you to pay atention to &lt;a href=\"http://store.steampowered.com/app/460790/\"&gt;this&lt;/a&gt; If you haven&amp;#39;t played it yet please go and do so, Its a awesome game and If you like character action games you will adore this game fighting mechanics.&lt;/p&gt;\n\n&lt;p&gt;Now the true purpose of this post, wend was your gaming &amp;quot;renaissance&amp;quot;, wend started to categorise games in your mind memorising genres, publishers and developers.&lt;/p&gt;\n\n&lt;p&gt;As a example I was born in 1992 and in Portugal where gaming media wasn&amp;#39;t and I cant remember a time in my life without video games. I had a bootleg NES witch had a modded chip with &amp;quot;50&amp;quot; games included (18 games and some modified versions of those same games). At that time I din&amp;#39;t really knew how games worked, I loved Contra and Tetris but I dint knew anything else. Growing up I got my hands on a Sega Saturn with Sonic CD and eventually a PC and my cousins tough me how to get emulators and rom compilations. This was what I think was the beginning, games are just games and nothing more.&lt;/p&gt;\n\n&lt;p&gt;The next &amp;quot;phase&amp;quot; was the PC, I had huge rom compilations for SNES N64 and Arcade, and got a taste for some RTS like Tzar, and getting my first realization what video game companies where, playing FF 4, 5, 6, Secret of Mana 3 (translated), and a few others made me realise what Square was, Super Smash Bros made Nintendo as a company click on my head and Warcraft 3, Diablo 2 made me a Blizzard fan. In the following years I only played PC culminating in 6 years of WoW mostly only playing some Nintendo, both portable and home consoles but no more than 20ish titles.&lt;/p&gt;\n\n&lt;p&gt;Turn 2009, Cataclysm beta is starting and my curiosity turned me to Youtube, mostly John &amp;quot;TotalBiscuit&amp;quot; Bain. Shortly after the problems with that expansion I start to look else where for my games and due to being older this came with a revelation. I bought a PS3 and spend all of my pocket money on second hand games and saved for some Triple AAA, and I after a year I felt my eyes truly open to gaming, from that time onward I discovered Independent games, different genres with RPG elements mostly, just so much stuff.&lt;/p&gt;\n\n&lt;p&gt;Why is Bayonetta at the start of the post? Because it was one of the first games I got for the PS3, and wend I discovered one of my favourite studios ever. Made me realise how I came from ignorance, to open mindless in what is my favourite past time in my life. I could go on and on about other titles that I loved but this post is long as it is.&lt;/p&gt;\n\n&lt;p&gt;So whats your story? How did your love and attention to this hobby evolved during the your time in it, what major titles shaped your tastes and lest just take a second to appreciate that even in its less than optimal state the industry is, how awesome games truly are. I just fucking love games.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As this post is being writen I would like you to pay atention to [this](http://store.steampowered.com/app/460790/) If you haven't played it yet please go and do so, Its a awesome game and If you like character action games you will adore this game fighting mechanics.\n\nNow the true purpose of this post, wend was your gaming \"renaissance\", wend started to categorise games in your mind memorising genres, publishers and developers.\n\nAs a example I was born in 1992 and in Portugal where gaming media wasn't and I cant remember a time in my life without video games. I had a bootleg NES witch had a modded chip with \"50\" games included (18 games and some modified versions of those same games). At that time I din't really knew how games worked, I loved Contra and Tetris but I dint knew anything else. Growing up I got my hands on a Sega Saturn with Sonic CD and eventually a PC and my cousins tough me how to get emulators and rom compilations. This was what I think was the beginning, games are just games and nothing more.\n\nThe next \"phase\" was the PC, I had huge rom compilations for SNES N64 and Arcade, and got a taste for some RTS like Tzar, and getting my first realization what video game companies where, playing FF 4, 5, 6, Secret of Mana 3 (translated), and a few others made me realise what Square was, Super Smash Bros made Nintendo as a company click on my head and Warcraft 3, Diablo 2 made me a Blizzard fan. In the following years I only played PC culminating in 6 years of WoW mostly only playing some Nintendo, both portable and home consoles but no more than 20ish titles.\n\nTurn 2009, Cataclysm beta is starting and my curiosity turned me to Youtube, mostly John \"TotalBiscuit\" Bain. Shortly after the problems with that expansion I start to look else where for my games and due to being older this came with a revelation. I bought a PS3 and spend all of my pocket money on second hand games and saved for some Triple AAA, and I after a year I felt my eyes truly open to gaming, from that time onward I discovered Independent games, different genres with RPG elements mostly, just so much stuff.\n\nWhy is Bayonetta at the start of the post? Because it was one of the first games I got for the PS3, and wend I discovered one of my favourite studios ever. Made me realise how I came from ignorance, to open mindless in what is my favourite past time in my life. I could go on and on about other titles that I loved but this post is long as it is.\n\nSo whats your story? How did your love and attention to this hobby evolved during the your time in it, what major titles shaped your tastes and lest just take a second to appreciate that even in its less than optimal state the industry is, how awesome games truly are. I just fucking love games.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657zcn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "darkstorm69", "saved": false, "mod_reports": [], "name": "t3_657zcn", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/657zcn/wend_was_your_gaming_renaissance/", "num_reports": null, "locked": false, "stickied": false, "created": 1492143166.0, "url": "https://www.reddit.com/r/truegaming/comments/657zcn/wend_was_your_gaming_renaissance/", "author_flair_text": null, "quarantine": false, "title": "Wend was your Gaming \"renaissance\"?", "created_utc": 1492114366.0, "distinguished": null, "media": null, "upvote_ratio": 0.43, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": "", "user_reports": [], "id": "dgad6ik", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ademnus", "parent_id": "t3_657zcn", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "My parents took me to Disney World when I was a kid and we stayed at an insanely cool village with a huge toy store. The first evening, when the folks were settling in, they let me go to the village and I went into the toy store. On the wall was a TV showing games on the Atari 2600 -and I've been hooked on gaming ever since.\n\nFor me, watching games go from Pong to Atari to intellivision, apple IIC to Mac to ipad, Sega to Playstation to Steam on my rig, I can point to so many times when it felt like the stars had aligned and there was a season of iconic gaming.\n\nOne of those moments for me was playing N64 for the first time and realizing all of the awesome possibilities. But then, there were always moments when you saw what potential lay in all of this technology. I remember that first time I booted up the Encarta Encyclopedia one of my first computers and seeing the awesome potential of hypertext and archives. \n\nBut in the end, there was a long period over many evolutions of gaming and computers that the fantasy RPG saw its heyday and there were so many iconic moments that signaled the halcyon days of the genre. It's hard to pick just one but I think the one that really showed me what games were going to become was [King's Field 2 on the Playstation](https://www.youtube.com/watch?v=QCEy2EEt0GY). It had just the right blend of surreal imagery and sound to be addictive and fascinating, like you were really exploring a strange, alien world and it's level design was intricate and involved, challenging and absorbing. I played the living shit out of that game lol. But I distinctly remember thinking how if we could do this now that in a few more years we'd see deeper, realer adventures. It's been amazing to watch this artform grow from [this](https://youtu.be/64-VQjygTGc?t=31s) to [this](https://www.youtube.com/watch?v=SUMzVkzoRjs) to [this](https://youtu.be/a8UxuVIG6T4?t=3m38s) to [this](https://www.youtube.com/watch?v=3EMTXPui58Q) \n\nI can't wait to see where we go next.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My parents took me to Disney World when I was a kid and we stayed at an insanely cool village with a huge toy store. The first evening, when the folks were settling in, they let me go to the village and I went into the toy store. On the wall was a TV showing games on the Atari 2600 -and I&amp;#39;ve been hooked on gaming ever since.&lt;/p&gt;\n\n&lt;p&gt;For me, watching games go from Pong to Atari to intellivision, apple IIC to Mac to ipad, Sega to Playstation to Steam on my rig, I can point to so many times when it felt like the stars had aligned and there was a season of iconic gaming.&lt;/p&gt;\n\n&lt;p&gt;One of those moments for me was playing N64 for the first time and realizing all of the awesome possibilities. But then, there were always moments when you saw what potential lay in all of this technology. I remember that first time I booted up the Encarta Encyclopedia one of my first computers and seeing the awesome potential of hypertext and archives. &lt;/p&gt;\n\n&lt;p&gt;But in the end, there was a long period over many evolutions of gaming and computers that the fantasy RPG saw its heyday and there were so many iconic moments that signaled the halcyon days of the genre. It&amp;#39;s hard to pick just one but I think the one that really showed me what games were going to become was &lt;a href=\"https://www.youtube.com/watch?v=QCEy2EEt0GY\"&gt;King&amp;#39;s Field 2 on the Playstation&lt;/a&gt;. It had just the right blend of surreal imagery and sound to be addictive and fascinating, like you were really exploring a strange, alien world and it&amp;#39;s level design was intricate and involved, challenging and absorbing. I played the living shit out of that game lol. But I distinctly remember thinking how if we could do this now that in a few more years we&amp;#39;d see deeper, realer adventures. It&amp;#39;s been amazing to watch this artform grow from &lt;a href=\"https://youtu.be/64-VQjygTGc?t=31s\"&gt;this&lt;/a&gt; to &lt;a href=\"https://www.youtube.com/watch?v=SUMzVkzoRjs\"&gt;this&lt;/a&gt; to &lt;a href=\"https://youtu.be/a8UxuVIG6T4?t=3m38s\"&gt;this&lt;/a&gt; to &lt;a href=\"https://www.youtube.com/watch?v=3EMTXPui58Q\"&gt;this&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t wait to see where we go next.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgad6ik", "score_hidden": false, "stickied": false, "created": 1492265205.0, "created_utc": 1492236405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": "", "user_reports": [], "id": "dgaty94", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wackawacka69", "parent_id": "t3_657zcn", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "2004: Half-Life 2, Far Cry, Doom 3, San Andreas.\n\nThat seems more like a golden era, though. A renaissance is more accurately a resurgence after a dark era. For me, that'd be like...right now, as we're finally seeing the tide turn against the idea that every single game needs to be a generic open-world action-adventure, with a paper-thin plot and branching dialogue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;2004: Half-Life 2, Far Cry, Doom 3, San Andreas.&lt;/p&gt;\n\n&lt;p&gt;That seems more like a golden era, though. A renaissance is more accurately a resurgence after a dark era. For me, that&amp;#39;d be like...right now, as we&amp;#39;re finally seeing the tide turn against the idea that every single game needs to be a generic open-world action-adventure, with a paper-thin plot and branching dialogue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgaty94", "score_hidden": false, "stickied": false, "created": 1492302288.0, "created_utc": 1492273488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": "", "user_reports": [], "id": "dg8g6gs", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "GinsbergsPeacock", "parent_id": "t1_dg8fli3", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'd never do that. 99% of all media is pulp, and video games are no exception.\n\nIn recent years I've become very picky about art direction and ludonarrative harmony, particularly the former. I'd say it was probably Final Fantasy X or Twilight Princess that made me realize developers had the potential to craft real worlds, not just areas to fill space between puzzles, combat, gates and fetchquests.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d never do that. 99% of all media is pulp, and video games are no exception.&lt;/p&gt;\n\n&lt;p&gt;In recent years I&amp;#39;ve become very picky about art direction and ludonarrative harmony, particularly the former. I&amp;#39;d say it was probably Final Fantasy X or Twilight Princess that made me realize developers had the potential to craft real worlds, not just areas to fill space between puzzles, combat, gates and fetchquests.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg8g6gs", "score_hidden": false, "stickied": false, "created": 1492156744.0, "created_utc": 1492127944.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8fli3", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "darkstorm69", "parent_id": "t1_dg8fasm", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'm not talking about a Industry renaissance but a more personal one, the point where you open your eyes to how big gaming really was, wend you went from knowing and playing just a couple of games to checking mostly everything that was out there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not talking about a Industry renaissance but a more personal one, the point where you open your eyes to how big gaming really was, wend you went from knowing and playing just a couple of games to checking mostly everything that was out there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg8fli3", "score_hidden": false, "stickied": false, "created": 1492155934.0, "created_utc": 1492127134.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8fasm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GinsbergsPeacock", "parent_id": "t1_dg8emzx", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yes it is, although that's precisely what the author asked for so I gave it to him. I don't like the way the post is worded, since it either boils down to pretty uncontrovertible evidence for 2007/2011 (or 1998 for the nostalgia-gogglers), or niche arguments that their few underrated gems constitute an industry-wide \"renaissance.\"\n\nBy contrast, I can't really say that Journey or Hyper Light Drifter were enough to signify an actual renaissance, much as I enjoyed them. To me, a renaissance would not just be a couple good indie games coming out, but evidence that AAA developers started to put more care into their irresponsibly priced blockbusters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes it is, although that&amp;#39;s precisely what the author asked for so I gave it to him. I don&amp;#39;t like the way the post is worded, since it either boils down to pretty uncontrovertible evidence for 2007/2011 (or 1998 for the nostalgia-gogglers), or niche arguments that their few underrated gems constitute an industry-wide &amp;quot;renaissance.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;By contrast, I can&amp;#39;t really say that Journey or Hyper Light Drifter were enough to signify an actual renaissance, much as I enjoyed them. To me, a renaissance would not just be a couple good indie games coming out, but evidence that AAA developers started to put more care into their irresponsibly priced blockbusters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg8fasm", "score_hidden": false, "stickied": false, "created": 1492155537.0, "created_utc": 1492126737.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8emzx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kered13", "parent_id": "t1_dg89ezo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "That's mostly just a reflection of 2007 and 2011 being huge years for gaming. When people talk about the biggest years for gaming, in terms of the number and quality of games that came out, 2007, 2011, and 1998 are usually at the top of the list.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s mostly just a reflection of 2007 and 2011 being huge years for gaming. When people talk about the biggest years for gaming, in terms of the number and quality of games that came out, 2007, 2011, and 1998 are usually at the top of the list.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg8emzx", "score_hidden": false, "stickied": false, "created": 1492154675.0, "created_utc": 1492125875.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg89ezo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GinsbergsPeacock", "parent_id": "t3_657zcn", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "2005-2007, no question. My favorite games were released during that period:\n\n* Psychonauts\n* Shadow of the Colossus\n* Okami\n* LoZ: Twilight Princess\n* Bioshock\n* Portal (and the Orange Box)\n\nAnd for some people:\n\n* Super Mario Galaxy\n* Elder Scrolls: Oblivion\n* God of War\n* Final Fantasy XII\n* Assassin's Creed\n\n2011 was probably a second renaissance, but I didn't really play those as much:\n\n* Minecraft\n* Elder Scrolls: Skyrim\n* Portal 2\n* Dark Souls\n* From Dust\n* Alice: Madness Returns", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;2005-2007, no question. My favorite games were released during that period:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Psychonauts&lt;/li&gt;\n&lt;li&gt;Shadow of the Colossus&lt;/li&gt;\n&lt;li&gt;Okami&lt;/li&gt;\n&lt;li&gt;LoZ: Twilight Princess&lt;/li&gt;\n&lt;li&gt;Bioshock&lt;/li&gt;\n&lt;li&gt;Portal (and the Orange Box)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And for some people:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Super Mario Galaxy&lt;/li&gt;\n&lt;li&gt;Elder Scrolls: Oblivion&lt;/li&gt;\n&lt;li&gt;God of War&lt;/li&gt;\n&lt;li&gt;Final Fantasy XII&lt;/li&gt;\n&lt;li&gt;Assassin&amp;#39;s Creed&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;2011 was probably a second renaissance, but I didn&amp;#39;t really play those as much:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Minecraft&lt;/li&gt;\n&lt;li&gt;Elder Scrolls: Skyrim&lt;/li&gt;\n&lt;li&gt;Portal 2&lt;/li&gt;\n&lt;li&gt;Dark Souls&lt;/li&gt;\n&lt;li&gt;From Dust&lt;/li&gt;\n&lt;li&gt;Alice: Madness Returns&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg89ezo", "score_hidden": false, "stickied": false, "created": 1492147874.0, "created_utc": 1492119074.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_657zcn", "likes": null, "replies": "", "user_reports": [], "id": "dg8kudh", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "EdEmKay", "parent_id": "t3_657zcn", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "2010 was amazing for me cause Limbo and Red Dead are still in my top 5 but i don't think i've ever enjoyed gaming as much as in 2007. everything was so exciting, halo 3 introduced me to multiplayer gaming, cod 4 came out, i still play crackdown to this day, and the first proper taste of half life i ever had was the orange box, although it took me years to properly sit down and play the whole thing. i used to obsess over the E3 demos of assassins creed and mass effect, and i still think the darkness is one of the sickest shooters i've ever played. i think if i had to relive the same year in gaming over and over again, i'd desperately plead to play limbo and the neverhood but it would easily be 2007. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;2010 was amazing for me cause Limbo and Red Dead are still in my top 5 but i don&amp;#39;t think i&amp;#39;ve ever enjoyed gaming as much as in 2007. everything was so exciting, halo 3 introduced me to multiplayer gaming, cod 4 came out, i still play crackdown to this day, and the first proper taste of half life i ever had was the orange box, although it took me years to properly sit down and play the whole thing. i used to obsess over the E3 demos of assassins creed and mass effect, and i still think the darkness is one of the sickest shooters i&amp;#39;ve ever played. i think if i had to relive the same year in gaming over and over again, i&amp;#39;d desperately plead to play limbo and the neverhood but it would easily be 2007. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg8kudh", "score_hidden": false, "stickied": false, "created": 1492163151.0, "created_utc": 1492134351.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]