[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why would I want the Gold Edition of Shadow of War?&lt;/p&gt;\n\n&lt;p&gt;It is basically a season pass at its core, okay. But then it also gives you 4 legendary chieftains from the get-go. I can&amp;#39;t help but think this would make the game incredibly unbalanced from the start and ruin the progression for those that get this edition. I love to be heavily challenged in my games, and think that good game design keeps the challenge at a good rate throughout. Shadow of Mordor already had problems with its difficulty, as when you learned the game combos and leveled up enough nothing was a challenge.&lt;/p&gt;\n\n&lt;p&gt;Other games do this too, even Fallout New Vegas with all the DLC starts you out with way more gear then a starting adventurer should have and ruins the impact of the rags-to-riches RPG mechanic. &lt;/p&gt;\n\n&lt;p&gt;Why is this included in pre-rewards? Who legitimately wants these? The only acceptable ones are cosmetic IMO, and even those feel like boring as hell rewards and I&amp;#39;m always annoyed when they can&amp;#39;t be gotten through other means.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Why would I want the Gold Edition of Shadow of War?\n\nIt is basically a season pass at its core, okay. But then it also gives you 4 legendary chieftains from the get-go. I can't help but think this would make the game incredibly unbalanced from the start and ruin the progression for those that get this edition. I love to be heavily challenged in my games, and think that good game design keeps the challenge at a good rate throughout. Shadow of Mordor already had problems with its difficulty, as when you learned the game combos and leveled up enough nothing was a challenge.\n\nOther games do this too, even Fallout New Vegas with all the DLC starts you out with way more gear then a starting adventurer should have and ruins the impact of the rags-to-riches RPG mechanic. \n\nWhy is this included in pre-rewards? Who legitimately wants these? The only acceptable ones are cosmetic IMO, and even those feel like boring as hell rewards and I'm always annoyed when they can't be gotten through other means.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659ejo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "shadekiller0", "saved": false, "mod_reports": [], "name": "t3_659ejo", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/659ejo/preorder_bonuses_screwing_up_game_balance_shadow/", "num_reports": null, "locked": false, "stickied": false, "created": 1492158265.0, "url": "https://www.reddit.com/r/truegaming/comments/659ejo/preorder_bonuses_screwing_up_game_balance_shadow/", "author_flair_text": null, "quarantine": false, "title": "Preorder Bonuses screwing up game balance? (Shadow of War)", "created_utc": 1492129465.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": "", "user_reports": [], "id": "dgacau3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shadekiller0", "parent_id": "t1_dg9fof4", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "My best experience with SoM was in the beginning when I wasn't good at the battle system and didn't have much power. I lost a lot and got to make use of the nemesis system. Skipping that skips the best parts of the game in the shadow series imho ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My best experience with SoM was in the beginning when I wasn&amp;#39;t good at the battle system and didn&amp;#39;t have much power. I lost a lot and got to make use of the nemesis system. Skipping that skips the best parts of the game in the shadow series imho &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgacau3", "score_hidden": false, "stickied": false, "created": 1492263300.0, "created_utc": 1492234500.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fof4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Meegs294", "parent_id": "t1_dg8i4vj", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Also most of these bonuses, while blatantly over powered early, tend to be quickly out classed. I don't specifically hunt them down, but I'll use them if I have them. Usually it just means I can plow through the beginning hours of a game and get to the meat at the center. I think a lot of people look at it the same. That said, I'll avoid them in tightly focused games where the beginning is SUPPOSED to be difficult, usually by selling them off for a jump start to my economy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also most of these bonuses, while blatantly over powered early, tend to be quickly out classed. I don&amp;#39;t specifically hunt them down, but I&amp;#39;ll use them if I have them. Usually it just means I can plow through the beginning hours of a game and get to the meat at the center. I think a lot of people look at it the same. That said, I&amp;#39;ll avoid them in tightly focused games where the beginning is SUPPOSED to be difficult, usually by selling them off for a jump start to my economy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg9fof4", "score_hidden": false, "stickied": false, "created": 1492219075.0, "created_utc": 1492190275.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8i4vj", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "bvanplays", "parent_id": "t3_659ejo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yes they definitely screw with the \"balance\" or pacing of the games.\n\nThat being said, it apparently makes more money than it loses otherwise people wouldn't do it.\n\n&gt; Why is this included in pre-rewards? Who legitimately wants these?\n\nI think reddit in general has a hard time realizing that the scope of the world is waaaaaay bigger than whatever subreddit you're in. I would wager most gamers purchasing these games don't give two shits about the slightly messed up pacing (and it is mostly just slightly and short lived). Especially when they're just pre-order bonuses, someone who's already interested in a game may just bite the bullet and pre-order if something looks cool or fun enough.\n\nPlus, I bet a nontrivial amount of gaming enthusiasts are similar to myself where while I'll certainly notice if a pre-order item is messing up the pacing/balance of the game, but I don't care at all. I don't care about DLC, map packs, cosmetics, season passes, whatever. None of it bothers me. And there are probably lots of people this way, I just don't make a post about how much it doesn't bother me every time someone else makes a post complaining about whatever the latest DLC drama is.\n\n&gt; Why would I want the Gold Edition of Shadow of War?\n\nYou wouldn't. But enough other people do that it exists. Pretty simple actually.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes they definitely screw with the &amp;quot;balance&amp;quot; or pacing of the games.&lt;/p&gt;\n\n&lt;p&gt;That being said, it apparently makes more money than it loses otherwise people wouldn&amp;#39;t do it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why is this included in pre-rewards? Who legitimately wants these?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think reddit in general has a hard time realizing that the scope of the world is waaaaaay bigger than whatever subreddit you&amp;#39;re in. I would wager most gamers purchasing these games don&amp;#39;t give two shits about the slightly messed up pacing (and it is mostly just slightly and short lived). Especially when they&amp;#39;re just pre-order bonuses, someone who&amp;#39;s already interested in a game may just bite the bullet and pre-order if something looks cool or fun enough.&lt;/p&gt;\n\n&lt;p&gt;Plus, I bet a nontrivial amount of gaming enthusiasts are similar to myself where while I&amp;#39;ll certainly notice if a pre-order item is messing up the pacing/balance of the game, but I don&amp;#39;t care at all. I don&amp;#39;t care about DLC, map packs, cosmetics, season passes, whatever. None of it bothers me. And there are probably lots of people this way, I just don&amp;#39;t make a post about how much it doesn&amp;#39;t bother me every time someone else makes a post complaining about whatever the latest DLC drama is.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why would I want the Gold Edition of Shadow of War?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You wouldn&amp;#39;t. But enough other people do that it exists. Pretty simple actually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg8i4vj", "score_hidden": false, "stickied": false, "created": 1492159436.0, "created_utc": 1492130636.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": "", "user_reports": [], "id": "dgac8vv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shadekiller0", "parent_id": "t1_dga8n9f", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I was speaking to my friend about this, as a sort of \"Get up and go\" culture where people just want to complete a game and move on. I'm not opposed to them if they don't have to affect me, I guess I just didn't see the draw and it confused me why anyone would want to dilute their own experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was speaking to my friend about this, as a sort of &amp;quot;Get up and go&amp;quot; culture where people just want to complete a game and move on. I&amp;#39;m not opposed to them if they don&amp;#39;t have to affect me, I guess I just didn&amp;#39;t see the draw and it confused me why anyone would want to dilute their own experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgac8vv", "score_hidden": false, "stickied": false, "created": 1492263189.0, "created_utc": 1492234389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga8n9f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "digitaldeadstar", "parent_id": "t3_659ejo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "People play games for all sorts of reasons.  Take someone who just wants to enjoy the story without much hassle.  Stronger chieftains may help them speed up that aspect of the game.  Or maybe they didn't care for the whole chieftains/nemesis type system from Shadow of Mordor but want to get all the achievements or items or whatever else, so they use more powerful chieftains to make it a bit easier.  Maybe they just aren't that good at video games and want any advantage they can get.  \n\nI'm fine with these sort of pre-order bonuses in games.  So long as it's not impacting any sort of multiplayer games and giving someone an extra advantage over others then I don't see an issue with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People play games for all sorts of reasons.  Take someone who just wants to enjoy the story without much hassle.  Stronger chieftains may help them speed up that aspect of the game.  Or maybe they didn&amp;#39;t care for the whole chieftains/nemesis type system from Shadow of Mordor but want to get all the achievements or items or whatever else, so they use more powerful chieftains to make it a bit easier.  Maybe they just aren&amp;#39;t that good at video games and want any advantage they can get.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m fine with these sort of pre-order bonuses in games.  So long as it&amp;#39;s not impacting any sort of multiplayer games and giving someone an extra advantage over others then I don&amp;#39;t see an issue with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dga8n9f", "score_hidden": false, "stickied": false, "created": 1492256796.0, "created_utc": 1492227996.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": "", "user_reports": [], "id": "dgagbwj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DoctorProffalternate", "parent_id": "t3_659ejo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "i agree. i've read all the comments and i still find it strange. i mean SOW is one thing, but FNV? you can literally open up the console and get yourself whatever weapon you'd like. why pay for it? i guess it's just the human mind at work. most people (and people in this sub aren't \"most people\") want a mildly challenging experience but don't like placing restrictions on themselves nor cheating for it- they want it \"as is\". for some reason buying weapons with real money is considered legitimate but getting them through console is cheating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i agree. i&amp;#39;ve read all the comments and i still find it strange. i mean SOW is one thing, but FNV? you can literally open up the console and get yourself whatever weapon you&amp;#39;d like. why pay for it? i guess it&amp;#39;s just the human mind at work. most people (and people in this sub aren&amp;#39;t &amp;quot;most people&amp;quot;) want a mildly challenging experience but don&amp;#39;t like placing restrictions on themselves nor cheating for it- they want it &amp;quot;as is&amp;quot;. for some reason buying weapons with real money is considered legitimate but getting them through console is cheating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgagbwj", "score_hidden": false, "stickied": false, "created": 1492273247.0, "created_utc": 1492244447.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": "", "user_reports": [], "id": "dgac5a4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shadekiller0", "parent_id": "t1_dg9i70k", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I really just want it to be almost unfairly hard so that the nemesis system can work more often. Honestly, I would be down for almost any options to increase difficulty, as I already turned off slowdowns and button prompts for SoM. It will most likely be as you describe, but I'm holding out hope", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really just want it to be almost unfairly hard so that the nemesis system can work more often. Honestly, I would be down for almost any options to increase difficulty, as I already turned off slowdowns and button prompts for SoM. It will most likely be as you describe, but I&amp;#39;m holding out hope&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgac5a4", "score_hidden": false, "stickied": false, "created": 1492262987.0, "created_utc": 1492234187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": "", "user_reports": [], "id": "dgahwyl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NotGloomp", "parent_id": "t1_dg9i70k", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "As someone who has been following the pre-release info pretty closely it seems they put more focus on difficulty. Hard mode will be \"meaningfully difficult\" and not just buffs to the orcs and nerfs to you. Hopefully they deliver.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who has been following the pre-release info pretty closely it seems they put more focus on difficulty. Hard mode will be &amp;quot;meaningfully difficult&amp;quot; and not just buffs to the orcs and nerfs to you. Hopefully they deliver.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgahwyl", "score_hidden": false, "stickied": false, "created": 1492278242.0, "created_utc": 1492249442.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i70k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "super_ktkm", "parent_id": "t3_659ejo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I don't preorder games, but if I did, I'd see this power boost as a way to skip past the slog of tutorials that are included in every game.\n\nIn my **opinion,** Shadow of Mordor never even toed the line in terms of how overpowered you were in comparison to your enemies and instead took a giant leap. I had to purposely get killed to really experience the Nemesis system. I highly doubt that Shadow of War will stray far from that power fantasy, so from the start I can tell that the preorder bonus is aimed towards anyone who struggled with Shadow of War, which doesn't sound like you or I.\n\nI like to be heavily challenged in a subset of my games too, but do you have hope that Shadow of War will? I'm going to purchase it but purely for the \"Western vision of Dynasty Warriors\" feel-good ridiculousness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t preorder games, but if I did, I&amp;#39;d see this power boost as a way to skip past the slog of tutorials that are included in every game.&lt;/p&gt;\n\n&lt;p&gt;In my &lt;strong&gt;opinion,&lt;/strong&gt; Shadow of Mordor never even toed the line in terms of how overpowered you were in comparison to your enemies and instead took a giant leap. I had to purposely get killed to really experience the Nemesis system. I highly doubt that Shadow of War will stray far from that power fantasy, so from the start I can tell that the preorder bonus is aimed towards anyone who struggled with Shadow of War, which doesn&amp;#39;t sound like you or I.&lt;/p&gt;\n\n&lt;p&gt;I like to be heavily challenged in a subset of my games too, but do you have hope that Shadow of War will? I&amp;#39;m going to purchase it but purely for the &amp;quot;Western vision of Dynasty Warriors&amp;quot; feel-good ridiculousness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg9i70k", "score_hidden": false, "stickied": false, "created": 1492222000.0, "created_utc": 1492193200.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": "", "user_reports": [], "id": "dgb4lnj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ShiraCheshire", "parent_id": "t3_659ejo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I agree. I'm very much against pre-order bonuses that are nothing but \"Here's a hat that makes you ridiculously overpowered for the first two hours of the game!\"\n\nIf a game is handing pre-order players superpowers early on, either the game has no balance whatsoever or it's doing itself a serious disservice. Not to mention that it's a cheap and low effort way for companies to advertise pre-orders without actually giving the player anything of value. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. I&amp;#39;m very much against pre-order bonuses that are nothing but &amp;quot;Here&amp;#39;s a hat that makes you ridiculously overpowered for the first two hours of the game!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If a game is handing pre-order players superpowers early on, either the game has no balance whatsoever or it&amp;#39;s doing itself a serious disservice. Not to mention that it&amp;#39;s a cheap and low effort way for companies to advertise pre-orders without actually giving the player anything of value. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgb4lnj", "score_hidden": false, "stickied": false, "created": 1492316804.0, "created_utc": 1492288004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_659ejo", "likes": null, "replies": "", "user_reports": [], "id": "dgac78p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shadekiller0", "parent_id": "t1_dg9pixv", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I am not claiming anything or pretending to know any more than anybody else. But look for example at the legendary rune bonuses in SoM. The runes were arguably the best way to power up your character, and getting super strong ones off the bat got in the way of that progression. I just suspect that this would be a similar situation", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not claiming anything or pretending to know any more than anybody else. But look for example at the legendary rune bonuses in SoM. The runes were arguably the best way to power up your character, and getting super strong ones off the bat got in the way of that progression. I just suspect that this would be a similar situation&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgac78p", "score_hidden": false, "stickied": false, "created": 1492263095.0, "created_utc": 1492234295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9pixv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Shemzu", "parent_id": "t3_659ejo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "You say this not knowing how common or uncommon legendary warchiefs are, or even how much power difference there is between low lvl chiefs and high lvl chiefs. Talion cannot control orcs higher level than him, so these guys will have to start at very low power level like you and level up through training missions and such as you do. What evidence if any do you have that these low level starter warchiefs are the dramatic power spike you claim them to be?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You say this not knowing how common or uncommon legendary warchiefs are, or even how much power difference there is between low lvl chiefs and high lvl chiefs. Talion cannot control orcs higher level than him, so these guys will have to start at very low power level like you and level up through training missions and such as you do. What evidence if any do you have that these low level starter warchiefs are the dramatic power spike you claim them to be?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dg9pixv", "score_hidden": false, "stickied": false, "created": 1492230811.0, "created_utc": 1492202011.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]