[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Seeing as I lack any recent systems and I have a Macbook Air, I obviously can play very few new mainstream video games. However, as a big Persona fan, I took a gamble on buying the new game given my friends let me have unlimited access to their Playstation 4.&lt;/p&gt;\n\n&lt;p&gt;Even though I have seen many videos of the gameplay, the visual design still blew me out of the water. For example, let&amp;#39;s take the &lt;a href=\"http://cdn.gamer-network.net/2017/usgamer/persona-5_9.png\"&gt;battle UI&lt;/a&gt;. The game completely does away with traditional menu systems of JRPGs despite having the same gameplay as them. Also it stands out how the presentation is not grid-based and is incredibly stylized like a comic book. &lt;/p&gt;\n\n&lt;p&gt;Also look at the general &lt;a href=\"http://personacentral.com/wp-content/uploads/2016/09/Persona-5-Menu.jpg\"&gt;menu screen&lt;/a&gt; of the game. Its functionality isn&amp;#39;t different than any other video game menu, but like the battle menu, it is highly stylized. &lt;/p&gt;\n\n&lt;p&gt;Then there is the general &lt;a href=\"http://assets.rpgsite.net/images/images/000/049/160/original/p5_5bestthings_003.jpg\"&gt;field screen&lt;/a&gt;, which is supposed to be a representation of Tokyo. You can instantly tell there are supposed to be many people in the area, but it isn&amp;#39;t hard to pick out the player character. The cartoon sound effects are seamlessly blended into the more realistic environment. Also, even the mini map looks stylized because it uses variable line widths. &lt;/p&gt;\n\n&lt;p&gt;Persona 5 has received great acclaim for its visual presentation and polish. However, I don&amp;#39;t think hardware capability is responsible for this. From my understanding, the Playstation 3 version has mostly the same graphics. Because of this, I think there are other ways that game makers can improve on visual direction without relying on new hardware.&lt;/p&gt;\n\n&lt;p&gt;Of course, I might just be out of the loop on new video games. Do you think there&amp;#39;s any other games that push visual presentation like Persona 5, and how? What other kind of innovations in visual presentation would you like to see in the future?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Seeing as I lack any recent systems and I have a Macbook Air, I obviously can play very few new mainstream video games. However, as a big Persona fan, I took a gamble on buying the new game given my friends let me have unlimited access to their Playstation 4.\n\nEven though I have seen many videos of the gameplay, the visual design still blew me out of the water. For example, let's take the [battle UI](http://cdn.gamer-network.net/2017/usgamer/persona-5_9.png). The game completely does away with traditional menu systems of JRPGs despite having the same gameplay as them. Also it stands out how the presentation is not grid-based and is incredibly stylized like a comic book. \n\nAlso look at the general [menu screen](http://personacentral.com/wp-content/uploads/2016/09/Persona-5-Menu.jpg) of the game. Its functionality isn't different than any other video game menu, but like the battle menu, it is highly stylized. \n\nThen there is the general [field screen](http://assets.rpgsite.net/images/images/000/049/160/original/p5_5bestthings_003.jpg), which is supposed to be a representation of Tokyo. You can instantly tell there are supposed to be many people in the area, but it isn't hard to pick out the player character. The cartoon sound effects are seamlessly blended into the more realistic environment. Also, even the mini map looks stylized because it uses variable line widths. \n\nPersona 5 has received great acclaim for its visual presentation and polish. However, I don't think hardware capability is responsible for this. From my understanding, the Playstation 3 version has mostly the same graphics. Because of this, I think there are other ways that game makers can improve on visual direction without relying on new hardware.\n\nOf course, I might just be out of the loop on new video games. Do you think there's any other games that push visual presentation like Persona 5, and how? What other kind of innovations in visual presentation would you like to see in the future?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65lz2j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 82, "report_reasons": null, "author": "chaosakita", "saved": false, "mod_reports": [], "name": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65lz2j/does_persona_5_show_you_dont_need_new_hardware_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492325679.0, "url": "https://www.reddit.com/r/truegaming/comments/65lz2j/does_persona_5_show_you_dont_need_new_hardware_to/", "author_flair_text": null, "quarantine": false, "title": "Does Persona 5 show you don't need new hardware to present innovative visual design in games? What other games do you say push the envelope in visual presentation?", "created_utc": 1492296879.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 82}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgbqipn", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "DestroyedArkana", "parent_id": "t1_dgbhv23", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "That's a good comparison to how painting evolved recently, getting more stylized with technology. From my (very basic) knowledge of painting, you get guys like Van Gogh and later Picasso popping up from 1850-1900 who were quite skilled in normal painting and ended up making more experimental paintings, which is right about the time photography began to take off.\n\nAs for games, we've known that art direction is more important than realism since the N64/PS1 era, since technology will always be moving forwards and standards will always be harder to meet. Having things be stylized means they will always look like they are supposed to, instead of being a rough facsimile of real life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a good comparison to how painting evolved recently, getting more stylized with technology. From my (very basic) knowledge of painting, you get guys like Van Gogh and later Picasso popping up from 1850-1900 who were quite skilled in normal painting and ended up making more experimental paintings, which is right about the time photography began to take off.&lt;/p&gt;\n\n&lt;p&gt;As for games, we&amp;#39;ve known that art direction is more important than realism since the N64/PS1 era, since technology will always be moving forwards and standards will always be harder to meet. Having things be stylized means they will always look like they are supposed to, instead of being a rough facsimile of real life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbqipn", "score_hidden": false, "stickied": false, "created": 1492349416.0, "created_utc": 1492320616.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbhv23", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "turtlespace", "parent_id": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This is a bit of a variation on the \"graphics vs art direction\" debate. \n\nAs game engines and creation tools become more and more easy to use and require less engineering or programming experience to use, I think we'll start to see more artist driven games like this. \n\nThere's a pretty interesting GDC presentation ([Check it out here ](https://youtu.be/7Rt0wOyCCAI)) that goes into how high quality realistic game assets are becoming increasingly easy to produce - as photogrammetry and object scanning techniques get better and easier to use, realistic graphics will no longer be so expensive that only AAA studios can afford to produce them - so the way to differentiate a game will have to be through the unique qualities of it's art direction. \n\nThis makes a lot of sense to me - I think a good comparison could be made with what happened to painting after the invention of photography. Once everyone could produce incredibly realistic images relatively easily, many artists needed to differentiate themselves by creating images that cameras couldn't, so we got impressionism, cubism, surrealism, etc. I wouldn't be surprised if we got something similar with games (though of course stylization has always existed.)", "edited": 1492322691.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a bit of a variation on the &amp;quot;graphics vs art direction&amp;quot; debate. &lt;/p&gt;\n\n&lt;p&gt;As game engines and creation tools become more and more easy to use and require less engineering or programming experience to use, I think we&amp;#39;ll start to see more artist driven games like this. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a pretty interesting GDC presentation (&lt;a href=\"https://youtu.be/7Rt0wOyCCAI\"&gt;Check it out here &lt;/a&gt;) that goes into how high quality realistic game assets are becoming increasingly easy to produce - as photogrammetry and object scanning techniques get better and easier to use, realistic graphics will no longer be so expensive that only AAA studios can afford to produce them - so the way to differentiate a game will have to be through the unique qualities of it&amp;#39;s art direction. &lt;/p&gt;\n\n&lt;p&gt;This makes a lot of sense to me - I think a good comparison could be made with what happened to painting after the invention of photography. Once everyone could produce incredibly realistic images relatively easily, many artists needed to differentiate themselves by creating images that cameras couldn&amp;#39;t, so we got impressionism, cubism, surrealism, etc. I wouldn&amp;#39;t be surprised if we got something similar with games (though of course stylization has always existed.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbhv23", "score_hidden": false, "stickied": false, "created": 1492335561.0, "created_utc": 1492306761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgbhzzd", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "hampig", "parent_id": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think it does. Beautiful, extremely stylish game, and it's accomplished through thoughtful design and a few stylish eyes instead of brute force and image scanning. \n\nThere are a few games I can think of that did something similar to varying degrees of success. \n\nRay Gigantic is extremely interesting with some of its visuals. I give them kudos for doing something different even if it didn't work out entirely. \n\nI think the Boku No Natsuyasumi games are gorgeous and probably one of the most effective games in existence as far as setting up an atmosphere. \n\nTime and Eternity is another one that really does something interesting and unique that I definitely appreciate. Once again, the game isn't amazing, but it sure does it's own thing visually. \n\nPersonally I'd love to see somebody take the concepts in Time and Eternity and do them right. That could make for something truly beautiful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it does. Beautiful, extremely stylish game, and it&amp;#39;s accomplished through thoughtful design and a few stylish eyes instead of brute force and image scanning. &lt;/p&gt;\n\n&lt;p&gt;There are a few games I can think of that did something similar to varying degrees of success. &lt;/p&gt;\n\n&lt;p&gt;Ray Gigantic is extremely interesting with some of its visuals. I give them kudos for doing something different even if it didn&amp;#39;t work out entirely. &lt;/p&gt;\n\n&lt;p&gt;I think the Boku No Natsuyasumi games are gorgeous and probably one of the most effective games in existence as far as setting up an atmosphere. &lt;/p&gt;\n\n&lt;p&gt;Time and Eternity is another one that really does something interesting and unique that I definitely appreciate. Once again, the game isn&amp;#39;t amazing, but it sure does it&amp;#39;s own thing visually. &lt;/p&gt;\n\n&lt;p&gt;Personally I&amp;#39;d love to see somebody take the concepts in Time and Eternity and do them right. That could make for something truly beautiful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbhzzd", "score_hidden": false, "stickied": false, "created": 1492335763.0, "created_utc": 1492306963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgcyz85", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LeftwordMovement", "parent_id": "t1_dgc0mfo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I agree with you, though I will say he isn't wrong that the younger generation doesn't have much of a say in triple A gaming (though this is true, no matter where you go). He also wasn't saying that star wars lacks themes, but that western devs just copy star wars rather than try to tell their own stories (something I also disagree with). \n\nFor every Persona that comes out of Japan, there's also like tons of like compile heart games (not ragging on people who like that, but it's laughable if that makes one think that the influences behind that are literary). Also, Hideo Kojima, for example, cites most of his influences on western film. And Miyazaki also claims a lot of his influence for DS came from failed attempts at reading and misunderstanding western fantasy books. \n\nThat being said, one only needs to go to itch.io to see all the wackiness that the west is capable of putting out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with you, though I will say he isn&amp;#39;t wrong that the younger generation doesn&amp;#39;t have much of a say in triple A gaming (though this is true, no matter where you go). He also wasn&amp;#39;t saying that star wars lacks themes, but that western devs just copy star wars rather than try to tell their own stories (something I also disagree with). &lt;/p&gt;\n\n&lt;p&gt;For every Persona that comes out of Japan, there&amp;#39;s also like tons of like compile heart games (not ragging on people who like that, but it&amp;#39;s laughable if that makes one think that the influences behind that are literary). Also, Hideo Kojima, for example, cites most of his influences on western film. And Miyazaki also claims a lot of his influence for DS came from failed attempts at reading and misunderstanding western fantasy books. &lt;/p&gt;\n\n&lt;p&gt;That being said, one only needs to go to itch.io to see all the wackiness that the west is capable of putting out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgcyz85", "score_hidden": false, "stickied": false, "created": 1492424730.0, "created_utc": 1492395930.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dge1990", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chaosakita", "parent_id": "t1_dge09d4", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'm saying that Persona has NEVER carried the SMT prefix in Japan. Persona 2 definitely did not have the SMT prefix in its home country. Calling Persona part of the SMT franchise is an American thing to do. Did you even read the link I posted?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m saying that Persona has NEVER carried the SMT prefix in Japan. Persona 2 definitely did not have the SMT prefix in its home country. Calling Persona part of the SMT franchise is an American thing to do. Did you even read the link I posted?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge1990", "score_hidden": true, "stickied": false, "created": 1492488399.0, "created_utc": 1492459599.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge09d4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t1_dgdzffo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; Apparently, Atlus treats Persona and SMT as separate franchises in Japan.\n\nSince P3/P4, Persona became its own thing, but its roots are from SMT. They are a SMT spin off and always have been, they just don't carry the SMT prefix anymore. What SMT calls \"demons\" are \"personas\" in Persona, with the exact same designs and appearance. The elements and skills from Persona are, for the most part, the same from SMT, and some vary even among SMT games, like the element called \"wind\" being called \"force\" in other games.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Apparently, Atlus treats Persona and SMT as separate franchises in Japan.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Since P3/P4, Persona became its own thing, but its roots are from SMT. They are a SMT spin off and always have been, they just don&amp;#39;t carry the SMT prefix anymore. What SMT calls &amp;quot;demons&amp;quot; are &amp;quot;personas&amp;quot; in Persona, with the exact same designs and appearance. The elements and skills from Persona are, for the most part, the same from SMT, and some vary even among SMT games, like the element called &amp;quot;wind&amp;quot; being called &amp;quot;force&amp;quot; in other games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge09d4", "score_hidden": true, "stickied": false, "created": 1492487274.0, "created_utc": 1492458474.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzffo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chaosakita", "parent_id": "t1_dgdy22s", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Apparently, Atlus treats Persona and SMT as separate franchises in Japan. Persona 3 and 4 were never marketed as SMT games in Japan even though both series have a lot of similarities.  \n\nHere's the source I was talking about\n\nhttp://nenilein.tumblr.com/post/144856573157/since-persona-5-doesnt-have-shin-megami-tensei-at", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Apparently, Atlus treats Persona and SMT as separate franchises in Japan. Persona 3 and 4 were never marketed as SMT games in Japan even though both series have a lot of similarities.  &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the source I was talking about&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://nenilein.tumblr.com/post/144856573157/since-persona-5-doesnt-have-shin-megami-tensei-at\"&gt;http://nenilein.tumblr.com/post/144856573157/since-persona-5-doesnt-have-shin-megami-tensei-at&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdzffo", "score_hidden": true, "stickied": false, "created": 1492486340.0, "created_utc": 1492457540.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy22s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t1_dgc0mfo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; besides having similar demon names and move abilities\n\nSimilar? It's nearly *exactly* the same demons and moves and overall mechanics, at least in the battle department. \n\nThe main conceptual difference is that in SMT you make pacts with demons so you can summon them as battle partners and in Persona, demons are called \"personas\" and you summon them as manifestations of your own soul, and instead of having 3-4 of them in battle, you use only one and switch between them during battle.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;besides having similar demon names and move abilities&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Similar? It&amp;#39;s nearly &lt;em&gt;exactly&lt;/em&gt; the same demons and moves and overall mechanics, at least in the battle department. &lt;/p&gt;\n\n&lt;p&gt;The main conceptual difference is that in SMT you make pacts with demons so you can summon them as battle partners and in Persona, demons are called &amp;quot;personas&amp;quot; and you summon them as manifestations of your own soul, and instead of having 3-4 of them in battle, you use only one and switch between them during battle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdy22s", "score_hidden": true, "stickied": false, "created": 1492484777.0, "created_utc": 1492455977.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgdtd1j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chaosakita", "parent_id": "t1_dgdt32d", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I've seen NGE compared to Star Wars because both have similar levels of cultural recognition. Everyone knows what the Force and who Darth Vader is. So apparently people in Japan would recognize Shinji and Eva-01 too. I don't know anything about Yamato or how popular it is.\n\nHere's something I found about it:\n\nhttps://www.reddit.com/r/japan/comments/2cwaye/how_did_neon_genesis_evangelion_have_a/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen NGE compared to Star Wars because both have similar levels of cultural recognition. Everyone knows what the Force and who Darth Vader is. So apparently people in Japan would recognize Shinji and Eva-01 too. I don&amp;#39;t know anything about Yamato or how popular it is.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s something I found about it:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/japan/comments/2cwaye/how_did_neon_genesis_evangelion_have_a/\"&gt;https://www.reddit.com/r/japan/comments/2cwaye/how_did_neon_genesis_evangelion_have_a/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdtd1j", "score_hidden": true, "stickied": false, "created": 1492479526.0, "created_utc": 1492450726.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdt32d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yukeake", "parent_id": "t1_dgc0mfo", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; Neon Genesis Evangelion, which isn't surprising as that anime is Japan's Star Wars. \n\nWouldn't that title go to Yamato?  NGE is a more recent classic.  Probably more akin to LotR for us Westerners.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Neon Genesis Evangelion, which isn&amp;#39;t surprising as that anime is Japan&amp;#39;s Star Wars. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wouldn&amp;#39;t that title go to Yamato?  NGE is a more recent classic.  Probably more akin to LotR for us Westerners.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdt32d", "score_hidden": true, "stickied": false, "created": 1492479223.0, "created_utc": 1492450423.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0mfo", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "chaosakita", "parent_id": "t1_dgbxywq", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Huh? This is simplifying culture to the extreme. \n\nSure Persona was based off of Shin Megami Tensei which was based off of a novel series. But that was back on the 1980s. Also Persona has little to do with SMT besides having similar demon names and move abilities. Apparently they are barely considered the same series in Japan (will try to provide a source once I'm not on mobile), so it doesn't seem like you have a good grasp on Japanese pop culture. \n\nIf anything Persona draws much more influence from anime. For example Persona 3 has a lot of parallels with Neon Genesis Evangelion, which isn't surprising as that anime is Japan's Star Wars. The Persona games are great but nothing in them suggests that the writers are particularly literary. \n\nI'm tired of the idea that Japan is some mystical society. Definitely has its quirks but it doesn't need to be placed on a pedestal all the time.  \n\nAlso its weird how you cite Eragon as a possible good influence to video games when that book was a huge Star Wars ripoff and the very kind of thing you criticize in video games. It's personally one of my least favorite book series ever.   \n\nSaying that Star Wars lacks themes is another ludicrous claim. Maybe not today but George Lucas used to be a more experimental filmmaker who idolized people like Kurosawa. He also was influenced by Joseph Campbell. Star Wars touches upon a number of themes such as concerns of a totalitarian government, the possibility of redemption, and the nature of the soul. This is from the top of my head. Saying the average JRPG is deeper shows a clear amount of bias to me. \n\nI don't know where I'm going in the post anymore. But I think your post shows a lot of misunderstanding of American and Japanese culture. ", "edited": 1492349312.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh? This is simplifying culture to the extreme. &lt;/p&gt;\n\n&lt;p&gt;Sure Persona was based off of Shin Megami Tensei which was based off of a novel series. But that was back on the 1980s. Also Persona has little to do with SMT besides having similar demon names and move abilities. Apparently they are barely considered the same series in Japan (will try to provide a source once I&amp;#39;m not on mobile), so it doesn&amp;#39;t seem like you have a good grasp on Japanese pop culture. &lt;/p&gt;\n\n&lt;p&gt;If anything Persona draws much more influence from anime. For example Persona 3 has a lot of parallels with Neon Genesis Evangelion, which isn&amp;#39;t surprising as that anime is Japan&amp;#39;s Star Wars. The Persona games are great but nothing in them suggests that the writers are particularly literary. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m tired of the idea that Japan is some mystical society. Definitely has its quirks but it doesn&amp;#39;t need to be placed on a pedestal all the time.  &lt;/p&gt;\n\n&lt;p&gt;Also its weird how you cite Eragon as a possible good influence to video games when that book was a huge Star Wars ripoff and the very kind of thing you criticize in video games. It&amp;#39;s personally one of my least favorite book series ever.   &lt;/p&gt;\n\n&lt;p&gt;Saying that Star Wars lacks themes is another ludicrous claim. Maybe not today but George Lucas used to be a more experimental filmmaker who idolized people like Kurosawa. He also was influenced by Joseph Campbell. Star Wars touches upon a number of themes such as concerns of a totalitarian government, the possibility of redemption, and the nature of the soul. This is from the top of my head. Saying the average JRPG is deeper shows a clear amount of bias to me. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know where I&amp;#39;m going in the post anymore. But I think your post shows a lot of misunderstanding of American and Japanese culture. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgc0mfo", "score_hidden": false, "stickied": false, "created": 1492377620.0, "created_utc": 1492348820.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxywq", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "NorrisOBE", "parent_id": "t1_dgbw3jb", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I believe that it's also a matter of difference of inspiration pool that influenced the creativity of Western and Japanese game development.\n\nIf you look at Japanese developers, both young and old developers are raised on literature. People like Hironobu Sakaguchi, Hidetaka Miyazaki and Yoko Taro were avid readers and it influenced their games a lot. In regards to Persona 5, it is a spin off of a game series adapted from a novel . And the \"otaku\" section of game development are heavily influenced by manga and light novels other than just anime and Western pop culture. There's even Murakami and Mishima influences even in modern Japanese videogames. Japan has a literary society and it shows in their pop culture.\n\nWhereas Western game development has taken more influences from movies than other mediums of fiction. Many recent games felt like ripoffs of Star Wars, Aliens and Lord of the Rings rather than from a more varied pool of influences dating centuries. It used to be that old videogames like Fallout 2 were heavily influenced by A Boy and His Dog and we even had videogames that straight up adapt novels (Like I Have No Mouth and I Must Scream) but now majority of Western video games felt like they are on a mission to be the next Star Wars instead of taking themes, motifs and symbolism and then creating original work out of it (Something that can only work amongst those well-versed in literature). \n\nSo you have completely different inspiration pools. Japanese developers can read books and manga and then by learning of the themes and motifs of such works they try and create original works from those themes and motifs. Whereas western developers watched Star Wars and Aliens and they said \"I'm going to make that\".\n\nAnd the generation raised by Harry Potter, Eragon and 13 Reasons Why have yet to truly influence videogame development. Millenials are heavy readers but they have yet to make a mark in mainstream AAA gaming so we're still stuck with a shallow stream of videogame stories.", "edited": 1492342687.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe that it&amp;#39;s also a matter of difference of inspiration pool that influenced the creativity of Western and Japanese game development.&lt;/p&gt;\n\n&lt;p&gt;If you look at Japanese developers, both young and old developers are raised on literature. People like Hironobu Sakaguchi, Hidetaka Miyazaki and Yoko Taro were avid readers and it influenced their games a lot. In regards to Persona 5, it is a spin off of a game series adapted from a novel . And the &amp;quot;otaku&amp;quot; section of game development are heavily influenced by manga and light novels other than just anime and Western pop culture. There&amp;#39;s even Murakami and Mishima influences even in modern Japanese videogames. Japan has a literary society and it shows in their pop culture.&lt;/p&gt;\n\n&lt;p&gt;Whereas Western game development has taken more influences from movies than other mediums of fiction. Many recent games felt like ripoffs of Star Wars, Aliens and Lord of the Rings rather than from a more varied pool of influences dating centuries. It used to be that old videogames like Fallout 2 were heavily influenced by A Boy and His Dog and we even had videogames that straight up adapt novels (Like I Have No Mouth and I Must Scream) but now majority of Western video games felt like they are on a mission to be the next Star Wars instead of taking themes, motifs and symbolism and then creating original work out of it (Something that can only work amongst those well-versed in literature). &lt;/p&gt;\n\n&lt;p&gt;So you have completely different inspiration pools. Japanese developers can read books and manga and then by learning of the themes and motifs of such works they try and create original works from those themes and motifs. Whereas western developers watched Star Wars and Aliens and they said &amp;quot;I&amp;#39;m going to make that&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And the generation raised by Harry Potter, Eragon and 13 Reasons Why have yet to truly influence videogame development. Millenials are heavy readers but they have yet to make a mark in mainstream AAA gaming so we&amp;#39;re still stuck with a shallow stream of videogame stories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbxywq", "score_hidden": false, "stickied": false, "created": 1492371221.0, "created_utc": 1492342421.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbw3jb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "EbilSmurfs", "parent_id": "t1_dgbv3zq", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I don't disagree with you here, my point was only that we can't say Western games don't have the creativity that Eastern games have. There are plenty of wacky and crazy Western games, they just aren't AAA because of funding.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t disagree with you here, my point was only that we can&amp;#39;t say Western games don&amp;#39;t have the creativity that Eastern games have. There are plenty of wacky and crazy Western games, they just aren&amp;#39;t AAA because of funding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbw3jb", "score_hidden": false, "stickied": false, "created": 1492365003.0, "created_utc": 1492336203.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbv3zq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ElizaRei", "parent_id": "t1_dgbso4v", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Japanese games can only be wacky because Japanese publishers guess it will sell enough *in Japan*. It's always about sales numbers, but Japanese gamers just have different tastes. For example, I dont think games like The Elder Scrolls or Mass Effect would easily find funding there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Japanese games can only be wacky because Japanese publishers guess it will sell enough &lt;em&gt;in Japan&lt;/em&gt;. It&amp;#39;s always about sales numbers, but Japanese gamers just have different tastes. For example, I dont think games like The Elder Scrolls or Mass Effect would easily find funding there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbv3zq", "score_hidden": false, "stickied": false, "created": 1492361602.0, "created_utc": 1492332802.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbso4v", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "EbilSmurfs", "parent_id": "t1_dgbpn46", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; You can't put Western Cinematic orchestra and you can't have an \"Ultra-realistic\" character design like in Horizon or RE7.\n\nI think this is only a problem with marketing and not game design. The \"West\" absolutely has the creativity with music and art to design a game on the level of Persona 5, but the money is tied up. If your game doesn't have the right amount of things deemed popular you can't make the game, and that includes these interesting art styles we like to discuss. I think if Western Developers were given the ability to get as wacky as the Japanese Developers we could see these types of games from both hemispheres. Unfortunately the West seems more focused grouped and homogeneous, and I do think that is a funding issue more than an artist issue. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You can&amp;#39;t put Western Cinematic orchestra and you can&amp;#39;t have an &amp;quot;Ultra-realistic&amp;quot; character design like in Horizon or RE7.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think this is only a problem with marketing and not game design. The &amp;quot;West&amp;quot; absolutely has the creativity with music and art to design a game on the level of Persona 5, but the money is tied up. If your game doesn&amp;#39;t have the right amount of things deemed popular you can&amp;#39;t make the game, and that includes these interesting art styles we like to discuss. I think if Western Developers were given the ability to get as wacky as the Japanese Developers we could see these types of games from both hemispheres. Unfortunately the West seems more focused grouped and homogeneous, and I do think that is a funding issue more than an artist issue. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbso4v", "score_hidden": false, "stickied": false, "created": 1492354383.0, "created_utc": 1492325583.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpn46", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "NorrisOBE", "parent_id": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think the difference is that Persona 5 has a completely different art direction than majority of Western video games.\n\nI mean, Persona 5 wants the gamer to explore Tokyo both day and night, with a strong emphasis on Shibuya (An area with a heavy Jazz and dance music scene). The game is a sequel a spinoff of a popular game series but is also heavily influenced by Jojo's Bizarre Adventure. And the game's themes and motifs are inspired by thievery and procedural literature like Arsene Lupin. \n\nAnd thus the end result is a very stylish game that has to represent Tokyo/Shibuya, Arsene Lupin, Jojo references and the previous Persona games in general. That's why the game had a very stylish menu, a House Music/Jazz/Hip Hop soundtrack and unique character design that compliments Tokyo aesthetics. You can't put Western Cinematic orchestra and you can't have an \"Ultra-realistic\" character design like in Horizon or RE7. It has to be unique, stylish and fitting.\n\nPS: Kind of off-topic, but there's a conception of a studio's headquarters location influencing the games they make. In Atlus' case, being located in Setagaya has really influenced the SMT and Persona series' rebellious and anti-establishment message. Setagaya is a college city with 7 universities and tonnes of reknowned high schools. It's also a uniquely left-wing city with an Otaku mayor from The Social Democratic Party. Also, it was the site of [The Setagaya Murders](https://theintercultural.wordpress.com/2012/12/31/the-setagaya-family-murders/) which heavily affected Japan.", "edited": 1492320533.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the difference is that Persona 5 has a completely different art direction than majority of Western video games.&lt;/p&gt;\n\n&lt;p&gt;I mean, Persona 5 wants the gamer to explore Tokyo both day and night, with a strong emphasis on Shibuya (An area with a heavy Jazz and dance music scene). The game is a sequel a spinoff of a popular game series but is also heavily influenced by Jojo&amp;#39;s Bizarre Adventure. And the game&amp;#39;s themes and motifs are inspired by thievery and procedural literature like Arsene Lupin. &lt;/p&gt;\n\n&lt;p&gt;And thus the end result is a very stylish game that has to represent Tokyo/Shibuya, Arsene Lupin, Jojo references and the previous Persona games in general. That&amp;#39;s why the game had a very stylish menu, a House Music/Jazz/Hip Hop soundtrack and unique character design that compliments Tokyo aesthetics. You can&amp;#39;t put Western Cinematic orchestra and you can&amp;#39;t have an &amp;quot;Ultra-realistic&amp;quot; character design like in Horizon or RE7. It has to be unique, stylish and fitting.&lt;/p&gt;\n\n&lt;p&gt;PS: Kind of off-topic, but there&amp;#39;s a conception of a studio&amp;#39;s headquarters location influencing the games they make. In Atlus&amp;#39; case, being located in Setagaya has really influenced the SMT and Persona series&amp;#39; rebellious and anti-establishment message. Setagaya is a college city with 7 universities and tonnes of reknowned high schools. It&amp;#39;s also a uniquely left-wing city with an Otaku mayor from The Social Democratic Party. Also, it was the site of &lt;a href=\"https://theintercultural.wordpress.com/2012/12/31/the-setagaya-family-murders/\"&gt;The Setagaya Murders&lt;/a&gt; which heavily affected Japan.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbpn46", "score_hidden": false, "stickied": false, "created": 1492347780.0, "created_utc": 1492318980.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgbwyfy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dude2dudette", "parent_id": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "It's an old game now but I felt, upon its release, Valkyria Chronicles on PS3 really pushed the envelope with the art style. From the [stylised, comic-esque sound effects](https://www.wired.com/images_blogs/gamelife/images/2008/10/01/valkyria_chronicles.jpg) over weapon and [grenade](https://upload.wikimedia.org/wikipedia/en/thumb/b/b2/Valkyria_Chronicles_battle.jpg/220px-Valkyria_Chronicles_battle.jpg) use to the actual character design. The obvious differences of 'Darksens' compared to the other people is just one example of the attention to detail. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s an old game now but I felt, upon its release, Valkyria Chronicles on PS3 really pushed the envelope with the art style. From the &lt;a href=\"https://www.wired.com/images_blogs/gamelife/images/2008/10/01/valkyria_chronicles.jpg\"&gt;stylised, comic-esque sound effects&lt;/a&gt; over weapon and &lt;a href=\"https://upload.wikimedia.org/wikipedia/en/thumb/b/b2/Valkyria_Chronicles_battle.jpg/220px-Valkyria_Chronicles_battle.jpg\"&gt;grenade&lt;/a&gt; use to the actual character design. The obvious differences of &amp;#39;Darksens&amp;#39; compared to the other people is just one example of the attention to detail. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbwyfy", "score_hidden": false, "stickied": false, "created": 1492367970.0, "created_utc": 1492339170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgbwye7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zeddyzed", "parent_id": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "One interesting thing is that the middleware for 2D UI isn't really as well developed or popular as other middleware.  For a while some sort of embedded Flash was a common choice, I don't know if there are other products these days. \n\nSo those fancy 2D transitions and animations for P5's UI can be a bit of a pain, if you had to manually code for them. Whereas some good UI middleware can eliminate the need for code, allowing artists and designers to directly construct complex 2D UI via WYSIWYG software.\n\nMost of the time GUI coding is left behind as an afterthought, to lesser skilled junior coders etc. It's rare that a developer focuses so much on UI polish.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One interesting thing is that the middleware for 2D UI isn&amp;#39;t really as well developed or popular as other middleware.  For a while some sort of embedded Flash was a common choice, I don&amp;#39;t know if there are other products these days. &lt;/p&gt;\n\n&lt;p&gt;So those fancy 2D transitions and animations for P5&amp;#39;s UI can be a bit of a pain, if you had to manually code for them. Whereas some good UI middleware can eliminate the need for code, allowing artists and designers to directly construct complex 2D UI via WYSIWYG software.&lt;/p&gt;\n\n&lt;p&gt;Most of the time GUI coding is left behind as an afterthought, to lesser skilled junior coders etc. It&amp;#39;s rare that a developer focuses so much on UI polish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbwye7", "score_hidden": false, "stickied": false, "created": 1492367965.0, "created_utc": 1492339165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgdfnm0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bangersss", "parent_id": "t1_dgbz9r2", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "And around the same time; Okami. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And around the same time; Okami. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdfnm0", "score_hidden": true, "stickied": false, "created": 1492462079.0, "created_utc": 1492433279.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbz9r2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "okiyama", "parent_id": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think katamari damacy proved this point a while back. You don't need fancy graphics to gave a really unique and inspired art and design style. The problem is that you need a pretty genius art director which are hard to come by in video games. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think katamari damacy proved this point a while back. You don&amp;#39;t need fancy graphics to gave a really unique and inspired art and design style. The problem is that you need a pretty genius art director which are hard to come by in video games. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbz9r2", "score_hidden": false, "stickied": false, "created": 1492374694.0, "created_utc": 1492345894.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65lz2j", "likes": null, "replies": "", "user_reports": [], "id": "dgcpr9b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GoodLuckGuy", "parent_id": "t3_65lz2j", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "It certainly does show that, though I don't think this is really debated anymore. The Graphics vs Art Direction debate was essentially settled during the indie game explosion of 2008-2012.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It certainly does show that, though I don&amp;#39;t think this is really debated anymore. The Graphics vs Art Direction debate was essentially settled during the indie game explosion of 2008-2012.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgcpr9b", "score_hidden": false, "stickied": false, "created": 1492412265.0, "created_utc": 1492383465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]