[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What makes a puzzle worth revisiting?&lt;/p&gt;\n\n&lt;p&gt;I often find that games that are puzzle-heavy (Portal being one example) cause me to lose interest in playing it again. Once I know the solution, what&amp;#39;s the fun in replaying if I have to do every puzzle all over again? There is the experience of revisiting an environment or retelling a story, but if much of the game is &amp;quot;filler&amp;quot; the second time through, is it even fun?&lt;/p&gt;\n\n&lt;p&gt;On the other hand, games like Picross tend to grab my attention more than once. The solution to a puzzle is so complex or long that I can&amp;#39;t remember the exact solution, so I discover it again with every playthrough. Sudoku-type games have a random element to them to make each puzzle &amp;quot;unique&amp;quot;, and there are so many combinations that you&amp;#39;re bound to mostly get a new puzzle each time.&lt;/p&gt;\n\n&lt;p&gt;In a game like Catherine, I don&amp;#39;t necessarily mind playing through all the puzzles because I&amp;#39;ve learned the &amp;quot;tricks&amp;quot; and can solve them quickly. Each puzzle has multiple solutions, as well. I haven&amp;#39;t played Breath of the Wild, but there are somewhere around 100 &amp;quot;puzzles&amp;quot; in shrines, and more in the form of Korok seed hunting. From what I&amp;#39;ve seen, many are fairly straightforward or simple applications of skills or have some &amp;quot;trick&amp;quot; to them. Some have multiple solutions.&lt;/p&gt;\n\n&lt;p&gt;How do you feel about puzzle-laden games or puzzle games in general in regards to replayability? What makes a puzzle fun the second time? Is it the same thing that makes it fun the first time? Those of you on second playthroughs of games with lots of puzzles, do you dread having to redo them, enjoy the rewards/puzzles themselves, or tend to avoid them entirely?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What makes a puzzle worth revisiting?\n\nI often find that games that are puzzle-heavy (Portal being one example) cause me to lose interest in playing it again. Once I know the solution, what's the fun in replaying if I have to do every puzzle all over again? There is the experience of revisiting an environment or retelling a story, but if much of the game is \"filler\" the second time through, is it even fun?\n\nOn the other hand, games like Picross tend to grab my attention more than once. The solution to a puzzle is so complex or long that I can't remember the exact solution, so I discover it again with every playthrough. Sudoku-type games have a random element to them to make each puzzle \"unique\", and there are so many combinations that you're bound to mostly get a new puzzle each time.\n\nIn a game like Catherine, I don't necessarily mind playing through all the puzzles because I've learned the \"tricks\" and can solve them quickly. Each puzzle has multiple solutions, as well. I haven't played Breath of the Wild, but there are somewhere around 100 \"puzzles\" in shrines, and more in the form of Korok seed hunting. From what I've seen, many are fairly straightforward or simple applications of skills or have some \"trick\" to them. Some have multiple solutions.\n\nHow do you feel about puzzle-laden games or puzzle games in general in regards to replayability? What makes a puzzle fun the second time? Is it the same thing that makes it fun the first time? Those of you on second playthroughs of games with lots of puzzles, do you dread having to redo them, enjoy the rewards/puzzles themselves, or tend to avoid them entirely?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65mabk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "TheFoxyDanceHut", "saved": false, "mod_reports": [], "name": "t3_65mabk", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": 1492302467.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65mabk/puzzles_and_replayability/", "num_reports": null, "locked": false, "stickied": false, "created": 1492329641.0, "url": "https://www.reddit.com/r/truegaming/comments/65mabk/puzzles_and_replayability/", "author_flair_text": null, "quarantine": false, "title": "Puzzles and Replayability", "created_utc": 1492300841.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": "", "user_reports": [], "id": "dgbrhn0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Scorpion_Frog", "parent_id": "t1_dgbhk37", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Funny, im doing the same thing in botw. However, i think ill definitely play the game over again afterwards. The reason being that a lot of the situations can be done in a large variety of ways. The shrines are very obviously the true puzzle part of the game, but they are also the most strict or \"static\". \n\nThe combat on the other hand can be handled like a puzzle as well, and its very satisfying. I often save right in front of a camp of enemies then fight the camp and reload and fight them several times (a couple camps i fought almost 20 times in a row) because it is just so interesting to me how differently you can handle the situations. \n\nThis replayability is not just about how many ways the puzzle can be solved, but also about finding a balance between the fun of just doing what you want vs being efficient. I know there are games out there where efficiency can change the feel and be very satisfying, but i cant remmeber any others right now. \n\nTldr: puzzles that have an extra layer of efficiency that you learn makes it satisfying to replay. Puzzles that can only be done one way are not\n\nEdit:if anyones interested i have a very good personal example of this from BOTW but itll be a long write up so not going to bother unless asked :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Funny, im doing the same thing in botw. However, i think ill definitely play the game over again afterwards. The reason being that a lot of the situations can be done in a large variety of ways. The shrines are very obviously the true puzzle part of the game, but they are also the most strict or &amp;quot;static&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;The combat on the other hand can be handled like a puzzle as well, and its very satisfying. I often save right in front of a camp of enemies then fight the camp and reload and fight them several times (a couple camps i fought almost 20 times in a row) because it is just so interesting to me how differently you can handle the situations. &lt;/p&gt;\n\n&lt;p&gt;This replayability is not just about how many ways the puzzle can be solved, but also about finding a balance between the fun of just doing what you want vs being efficient. I know there are games out there where efficiency can change the feel and be very satisfying, but i cant remmeber any others right now. &lt;/p&gt;\n\n&lt;p&gt;Tldr: puzzles that have an extra layer of efficiency that you learn makes it satisfying to replay. Puzzles that can only be done one way are not&lt;/p&gt;\n\n&lt;p&gt;Edit:if anyones interested i have a very good personal example of this from BOTW but itll be a long write up so not going to bother unless asked :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbrhn0", "score_hidden": false, "stickied": false, "created": 1492351508.0, "created_utc": 1492322708.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": "", "user_reports": [], "id": "dgbixkp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheFoxyDanceHut", "parent_id": "t1_dgbhk37", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Good point. A lot of people give games just a once-over these days. So I guess it doesn't hurt, and the initial wow factor only adds to the enjoyment if you're only doing it once.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good point. A lot of people give games just a once-over these days. So I guess it doesn&amp;#39;t hurt, and the initial wow factor only adds to the enjoyment if you&amp;#39;re only doing it once.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbixkp", "score_hidden": false, "stickied": false, "created": 1492337135.0, "created_utc": 1492308335.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbhk37", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ashsimmonds", "parent_id": "t3_65mabk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'm ~120 hours into Zelda BotW and haven't done any of the primary quest stuff yet, just been doing shrines and side-quests and generall exploring. I know that once I've done all those I'll be set to do the main stuff easy enough, and will probably never look at the game again.  \n  \nAs you say the puzzles are fun and rewarding the first time around, but apart from maybe trying to do them quick for a speed run I don't see the point. When it comes to speed run stuff though I don't really care - this is what I consider the \"puzzle\" element of racing sims to be - figuring out the optimum way to get around a track quickly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m ~120 hours into Zelda BotW and haven&amp;#39;t done any of the primary quest stuff yet, just been doing shrines and side-quests and generall exploring. I know that once I&amp;#39;ve done all those I&amp;#39;ll be set to do the main stuff easy enough, and will probably never look at the game again.  &lt;/p&gt;\n\n&lt;p&gt;As you say the puzzles are fun and rewarding the first time around, but apart from maybe trying to do them quick for a speed run I don&amp;#39;t see the point. When it comes to speed run stuff though I don&amp;#39;t really care - this is what I consider the &amp;quot;puzzle&amp;quot; element of racing sims to be - figuring out the optimum way to get around a track quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbhk37", "score_hidden": false, "stickied": false, "created": 1492335128.0, "created_utc": 1492306328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": "", "user_reports": [], "id": "dgbwnsz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Redhavok", "parent_id": "t3_65mabk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt;Picross\n\nA fan of link-a-pix myself, oddly soothing completing the large ones. Though I would enjoy it more if the solution varied each time. As far as idle games go those are like the best thing since Minesweeper. \n\nAnyway..\n\nReplayability in some puzzle games comes from mastery. MGS Special Missions, or whatever, is part figuring out how to beat the puzzle, and the next is trying to do it very fast. \n\nArkham games technically have that too in predator maps, but the main replayability there is finding out how to get all 3 medals in one go.There was one I got down from something like 40 minutes down to 6 minutes or something. Learning to make those bold split second choices, timing things out, and honing your strategy. \n\nThe most obvious thing would be variation. Between puzzles and within the same puzzle. Puzzle A can be 2+2 and puzzle B is 6 + 17, but puzzle A should also come as 1+3 and 3+1 and 6-2. Same ultimate solution but getting there slightly different ways each time either by varying the puzzle or giving options to solving it(like using different gadgets in Arkham games, or shuffling a rubiks cube). \n\nSatisfying interaction helps a lot. The right sounds and response times, a nice aesthetic, so even if the particular puzzle isn't for you, you still are happy to be doing it. There's this puzzle in Spyro 3 with seeds and beanstalk things, really was not a fan of it, but it was fun too plant the seeds and bounce on things and burn the guy trying to help you, also there may have been enemies on some platforms. General user-friendliness is great. Some puzzles have cool ideas but trying to play them makes you want to throw the controller out the window. \n\nAn element of curiosity is amazing if you can pull it off. The Witness is one example but I don't want to spoil that. An older example, again Spyro, there is a platform that lights up when you stand on it. What the hell?. The ones next to it light up too, like the Billie Jean music video, but they turn off sometimes. What happens if you jump on each one only once? 'secret' level just opens up out of nowhere. SO satisfying. Didn't tell you it was there, you just discover it and take the puzzle upon yourself. \n\nA more complicated example would be Fez. Fuck translating all of that stuff, but somebody did it. Silent Hills Shakespeare puzzle was bullshit too. \n\nA simple translation would be the number stations in Arkham City. Not part of the game, you stumble stumble on them and figure out they represent letters, you decode them and you get the message, which is actually a very very very early sneak peek at Arkham Knight. A reward like that is also good motivation keep solving puzzles too, even if they are not ones you particularly enjoy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Picross&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A fan of link-a-pix myself, oddly soothing completing the large ones. Though I would enjoy it more if the solution varied each time. As far as idle games go those are like the best thing since Minesweeper. &lt;/p&gt;\n\n&lt;p&gt;Anyway..&lt;/p&gt;\n\n&lt;p&gt;Replayability in some puzzle games comes from mastery. MGS Special Missions, or whatever, is part figuring out how to beat the puzzle, and the next is trying to do it very fast. &lt;/p&gt;\n\n&lt;p&gt;Arkham games technically have that too in predator maps, but the main replayability there is finding out how to get all 3 medals in one go.There was one I got down from something like 40 minutes down to 6 minutes or something. Learning to make those bold split second choices, timing things out, and honing your strategy. &lt;/p&gt;\n\n&lt;p&gt;The most obvious thing would be variation. Between puzzles and within the same puzzle. Puzzle A can be 2+2 and puzzle B is 6 + 17, but puzzle A should also come as 1+3 and 3+1 and 6-2. Same ultimate solution but getting there slightly different ways each time either by varying the puzzle or giving options to solving it(like using different gadgets in Arkham games, or shuffling a rubiks cube). &lt;/p&gt;\n\n&lt;p&gt;Satisfying interaction helps a lot. The right sounds and response times, a nice aesthetic, so even if the particular puzzle isn&amp;#39;t for you, you still are happy to be doing it. There&amp;#39;s this puzzle in Spyro 3 with seeds and beanstalk things, really was not a fan of it, but it was fun too plant the seeds and bounce on things and burn the guy trying to help you, also there may have been enemies on some platforms. General user-friendliness is great. Some puzzles have cool ideas but trying to play them makes you want to throw the controller out the window. &lt;/p&gt;\n\n&lt;p&gt;An element of curiosity is amazing if you can pull it off. The Witness is one example but I don&amp;#39;t want to spoil that. An older example, again Spyro, there is a platform that lights up when you stand on it. What the hell?. The ones next to it light up too, like the Billie Jean music video, but they turn off sometimes. What happens if you jump on each one only once? &amp;#39;secret&amp;#39; level just opens up out of nowhere. SO satisfying. Didn&amp;#39;t tell you it was there, you just discover it and take the puzzle upon yourself. &lt;/p&gt;\n\n&lt;p&gt;A more complicated example would be Fez. Fuck translating all of that stuff, but somebody did it. Silent Hills Shakespeare puzzle was bullshit too. &lt;/p&gt;\n\n&lt;p&gt;A simple translation would be the number stations in Arkham City. Not part of the game, you stumble stumble on them and figure out they represent letters, you decode them and you get the message, which is actually a very very very early sneak peek at Arkham Knight. A reward like that is also good motivation keep solving puzzles too, even if they are not ones you particularly enjoy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgbwnsz", "score_hidden": false, "stickied": false, "created": 1492366966.0, "created_utc": 1492338166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": "", "user_reports": [], "id": "dgcj32a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheFoxyDanceHut", "parent_id": "t1_dgcik6p", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "God I love contraption games. Things like that make me want to replay them, and I rarely get to a puzzle I've done before and think \"no thanks\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God I love contraption games. Things like that make me want to replay them, and I rarely get to a puzzle I&amp;#39;ve done before and think &amp;quot;no thanks&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgcj32a", "score_hidden": false, "stickied": false, "created": 1492403412.0, "created_utc": 1492374612.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcik6p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mtomato", "parent_id": "t3_65mabk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Self-imposed challenges can be a fun way to replay a puzzle game, like by trying to find the most broken ways to solve the puzzles.\n\nFor example, in Contraption Maker the first puzzle in the \"Pretty much impossible\" level set can be [solved with only two items](https://www.youtube.com/watch?v=Dyix8V_o3TQ). Here the goal is to get a bowling ball into a cardboard box on the other side of the screen, and that's needed is explosives in the right spot to send the bowling ball flying and a rope to trigger another explosion to open the path to the box.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Self-imposed challenges can be a fun way to replay a puzzle game, like by trying to find the most broken ways to solve the puzzles.&lt;/p&gt;\n\n&lt;p&gt;For example, in Contraption Maker the first puzzle in the &amp;quot;Pretty much impossible&amp;quot; level set can be &lt;a href=\"https://www.youtube.com/watch?v=Dyix8V_o3TQ\"&gt;solved with only two items&lt;/a&gt;. Here the goal is to get a bowling ball into a cardboard box on the other side of the screen, and that&amp;#39;s needed is explosives in the right spot to send the bowling ball flying and a rope to trigger another explosion to open the path to the box.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgcik6p", "score_hidden": false, "stickied": false, "created": 1492402736.0, "created_utc": 1492373936.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": "", "user_reports": [], "id": "dgdgihs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thesausagez", "parent_id": "t3_65mabk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Stephen Lavelle (creator of Stephen's Sausage Roll) said something on Twitter that I found interesting. Something along the lines of: the problem with replaying puzzle games is that usually you remember all the best puzzles, so you're left just replaying the worst ones. That only applies to a traditional puzzle game like SSR. Zachtronics games, for instance, are really fun to spend extra time on, optimizing your solution as much as you can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stephen Lavelle (creator of Stephen&amp;#39;s Sausage Roll) said something on Twitter that I found interesting. Something along the lines of: the problem with replaying puzzle games is that usually you remember all the best puzzles, so you&amp;#39;re left just replaying the worst ones. That only applies to a traditional puzzle game like SSR. Zachtronics games, for instance, are really fun to spend extra time on, optimizing your solution as much as you can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdgihs", "score_hidden": true, "stickied": false, "created": 1492463590.0, "created_utc": 1492434790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": "", "user_reports": [], "id": "dgboced", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "postal83", "parent_id": "t3_65mabk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "The old LucasArts and Sierra adventure games have virtually no replay value.  These games are best replayed like a decade later.  Which is nice, because a lot of remasters have been popping up and it gives me an excuse to revisit the puzzles again.\n\nI just finished Thimbleweed Park and I'm sad it's over.  Such a well made puzzle game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The old LucasArts and Sierra adventure games have virtually no replay value.  These games are best replayed like a decade later.  Which is nice, because a lot of remasters have been popping up and it gives me an excuse to revisit the puzzles again.&lt;/p&gt;\n\n&lt;p&gt;I just finished Thimbleweed Park and I&amp;#39;m sad it&amp;#39;s over.  Such a well made puzzle game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgboced", "score_hidden": false, "stickied": false, "created": 1492345459.0, "created_utc": 1492316659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65mabk", "likes": null, "replies": "", "user_reports": [], "id": "dgdb1b9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ItsDonut", "parent_id": "t3_65mabk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I've beaten portal 5+ times and portal 2 probably around 3 times. These playthrough to were all really spaced out so I forget all the puzzles which makes them fun again. I may remember some bits but I still enjoy playing those games again. I think puzzle games have replayability (for me at least) because I forget the puzzles after a few months but portal has been the only ones I've ever gone back to because I love the story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve beaten portal 5+ times and portal 2 probably around 3 times. These playthrough to were all really spaced out so I forget all the puzzles which makes them fun again. I may remember some bits but I still enjoy playing those games again. I think puzzle games have replayability (for me at least) because I forget the puzzles after a few months but portal has been the only ones I&amp;#39;ve ever gone back to because I love the story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdb1b9", "score_hidden": true, "stickied": false, "created": 1492449712.0, "created_utc": 1492420912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]