[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;ve finished Nier: Automatas five true endings a few days ago and I left a bit disappointed because people&amp;#39;s exaggerated use of allegedly felt emotions. Let me explain. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m always trying to stay away from hype, because like many people I&amp;#39;ve been tricked in buying something too early already. This time it was different. I&amp;#39;ve played the original Nier, I tried the demo and had a blast. I knew that Automata would be my kind of game with its different approach on telling a story in games. And it was! It&amp;#39;s a great game with interesting ideas and gameplay. But there was a different kind of hype that tricked me this time. The hype around a really emotional story that affects you in many ways. People threw around loosely that this game &amp;quot;destroyed them&amp;quot;, &amp;quot;shook them&amp;quot;, the had to &amp;quot;process what had happened even days later&amp;quot; and so on. I&amp;#39;m a sucker for story driven games so I was like &amp;quot;oh boy lets do this&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to spoil anything but apart from a clever mechanic at the very end, the story really went right through me. Even after I learned everything that was to learn, all the dramatic scenes did nothing. I couldn&amp;#39;t relate to the characters and therefore wasn&amp;#39;t affected when stuff went down. But even if I could relate heavily with them, I don&amp;#39;t see how this game could evoke so many feelings in so many people. Yes it is a refreshing way to tell a story and I&amp;#39;m all for that kind of games apart from the mainstream, but it&amp;#39;s really nothing that we haven&amp;#39;t seen in other media. &lt;/p&gt;\n\n&lt;p&gt;That led me to the realization how people play loosely with their emotions these days. It&amp;#39;s something that we can already see on the internet daily and it really irks me. But until now I thought that at least after experiencing a whole game of ~30 hours that the people would be more honest with their experience. &lt;/p&gt;\n\n&lt;p&gt;Has someone experienced this elsewhere? Maybe with the same game? Am I overreacting? It&amp;#39;s just something that I really heavily noticed this time around.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, I've finished Nier: Automatas five true endings a few days ago and I left a bit disappointed because people's exaggerated use of allegedly felt emotions. Let me explain. \n\nI'm always trying to stay away from hype, because like many people I've been tricked in buying something too early already. This time it was different. I've played the original Nier, I tried the demo and had a blast. I knew that Automata would be my kind of game with its different approach on telling a story in games. And it was! It's a great game with interesting ideas and gameplay. But there was a different kind of hype that tricked me this time. The hype around a really emotional story that affects you in many ways. People threw around loosely that this game \"destroyed them\", \"shook them\", the had to \"process what had happened even days later\" and so on. I'm a sucker for story driven games so I was like \"oh boy lets do this\". \n\nI don't want to spoil anything but apart from a clever mechanic at the very end, the story really went right through me. Even after I learned everything that was to learn, all the dramatic scenes did nothing. I couldn't relate to the characters and therefore wasn't affected when stuff went down. But even if I could relate heavily with them, I don't see how this game could evoke so many feelings in so many people. Yes it is a refreshing way to tell a story and I'm all for that kind of games apart from the mainstream, but it's really nothing that we haven't seen in other media. \n\nThat led me to the realization how people play loosely with their emotions these days. It's something that we can already see on the internet daily and it really irks me. But until now I thought that at least after experiencing a whole game of ~30 hours that the people would be more honest with their experience. \n\nHas someone experienced this elsewhere? Maybe with the same game? Am I overreacting? It's just something that I really heavily noticed this time around.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65o97i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "dongmcbong", "saved": false, "mod_reports": [], "name": "t3_65o97i", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65o97i/does_hype_influence_our_emotions_or_is_it_a_new/", "num_reports": null, "locked": false, "stickied": false, "created": 1492361829.0, "url": "https://www.reddit.com/r/truegaming/comments/65o97i/does_hype_influence_our_emotions_or_is_it_a_new/", "author_flair_text": null, "quarantine": false, "title": "Does hype influence our emotions? Or is it a new \"emotional circle jerk\"?", "created_utc": 1492333029.0, "distinguished": null, "media": null, "upvote_ratio": 0.52, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65o97i", "likes": null, "replies": "", "user_reports": [], "id": "dgd57y0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "digitaldeadstar", "parent_id": "t3_65o97i", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "At the end of the day people react differently to things and may find it more emotional than someone else will.  This isn't years ago where the only people you talked to about games were a few real life friends.  You're getting opinions from across the world from hundreds or thousands of players - each with their own reaction to the game.  When reading reviews or comments from other players, emotional reactions probably stand out more.  Reading someone was \"destroyed\" by the game sticks with you more than hearing \"yeah, I liked the game.\"  I'd also argue that games you're more interested in, these same reactions probably stand out even more so since it builds on hype or excitement you may already have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At the end of the day people react differently to things and may find it more emotional than someone else will.  This isn&amp;#39;t years ago where the only people you talked to about games were a few real life friends.  You&amp;#39;re getting opinions from across the world from hundreds or thousands of players - each with their own reaction to the game.  When reading reviews or comments from other players, emotional reactions probably stand out more.  Reading someone was &amp;quot;destroyed&amp;quot; by the game sticks with you more than hearing &amp;quot;yeah, I liked the game.&amp;quot;  I&amp;#39;d also argue that games you&amp;#39;re more interested in, these same reactions probably stand out even more so since it builds on hype or excitement you may already have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgd57y0", "score_hidden": true, "stickied": false, "created": 1492434550.0, "created_utc": 1492405750.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65o97i", "likes": null, "replies": "", "user_reports": [], "id": "dgdb4tl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ItsDonut", "parent_id": "t3_65o97i", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think it's part hype and part just that some people get more emotionally attached to media. For example I know people who cry during movies or get mad at characters on screen. I love movies but I've never cried or had any intense emotions from them because they just don't have that effect on me. Everyone experiences stuff differently and I'm sure some people's experiences get influenced partially by hype.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s part hype and part just that some people get more emotionally attached to media. For example I know people who cry during movies or get mad at characters on screen. I love movies but I&amp;#39;ve never cried or had any intense emotions from them because they just don&amp;#39;t have that effect on me. Everyone experiences stuff differently and I&amp;#39;m sure some people&amp;#39;s experiences get influenced partially by hype.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdb4tl", "score_hidden": true, "stickied": false, "created": 1492450044.0, "created_utc": 1492421244.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65o97i", "likes": null, "replies": "", "user_reports": [], "id": "dgc5f69", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Katana314", "parent_id": "t3_65o97i", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I haven't played Near A Tomato because hype savviness made me think I would have an experience similar to yours, and $60 is a heavy bet on a director you've never heard of. But, I have heard responses to comments like yours saying that \"The ending was actually a layer deeper than you realized, and you didn't get it all right away.\"\n\nThat's not impossible, since I know some people didn't think so hard about Spec Ops: The Line's endings until days later. But I remain dubious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t played Near A Tomato because hype savviness made me think I would have an experience similar to yours, and $60 is a heavy bet on a director you&amp;#39;ve never heard of. But, I have heard responses to comments like yours saying that &amp;quot;The ending was actually a layer deeper than you realized, and you didn&amp;#39;t get it all right away.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s not impossible, since I know some people didn&amp;#39;t think so hard about Spec Ops: The Line&amp;#39;s endings until days later. But I remain dubious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgc5f69", "score_hidden": false, "stickied": false, "created": 1492385348.0, "created_utc": 1492356548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65o97i", "likes": null, "replies": "", "user_reports": [], "id": "dgcgjcn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "awwnuts07", "parent_id": "t3_65o97i", "subreddit_name_prefixed": "r/truegaming", "controversiality": 1, "body": "&gt; That led me to the realization how people play loosely with their emotions these days. It's something that we can already see on the internet daily and it really irks me. But until now I thought that at least after experiencing a whole game of ~30 hours that the people would be more honest with their experience.\n\nSeriously? You can't look beyond your own viewpoint and see how other people would feel differently than you?Think of it these terms: Name a game, book, movie or piece of art that touched you emotionally. It's pretty much a guarantee that there are a plethora of people who gave that same piece of media a shot, but felt nothing, saw it as completely uninteresting or thought it was outright trash. It has nothing to do with hype, but rather, the life and experiences they've had didn't allow them to connect in the same you did. ", "edited": 1492372094.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That led me to the realization how people play loosely with their emotions these days. It&amp;#39;s something that we can already see on the internet daily and it really irks me. But until now I thought that at least after experiencing a whole game of ~30 hours that the people would be more honest with their experience.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Seriously? You can&amp;#39;t look beyond your own viewpoint and see how other people would feel differently than you?Think of it these terms: Name a game, book, movie or piece of art that touched you emotionally. It&amp;#39;s pretty much a guarantee that there are a plethora of people who gave that same piece of media a shot, but felt nothing, saw it as completely uninteresting or thought it was outright trash. It has nothing to do with hype, but rather, the life and experiences they&amp;#39;ve had didn&amp;#39;t allow them to connect in the same you did. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgcgjcn", "score_hidden": false, "stickied": false, "created": 1492400118.0, "created_utc": 1492371318.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65o97i", "likes": null, "replies": "", "user_reports": [], "id": "dgcfeut", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "huckleberry_loke", "parent_id": "t3_65o97i", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Great post - I'm interested in this thread.  You quoted a lot of impressions from individuals such as 'it destroyed or shook them' - where exactly are these comments from?  I assume players on reviews, or comment sections?  I'd love for you to link a few articles by the press that support this.\n\nCan you find any?\n\nThe reason I ask this is because hype (for most casual gamers) comes from the press...or trailers.  I imagine the average person looking to buy a game isn't going to sift through the cancer of many Youtube comment sections to find these 'impressions' you speak of, but I could be wrong.\n\nI actually want to cover the hype topic on my channel at some point, so I'm looking forward to see how this thread develops.\n\n-Tone Loke from Downward Thrust", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post - I&amp;#39;m interested in this thread.  You quoted a lot of impressions from individuals such as &amp;#39;it destroyed or shook them&amp;#39; - where exactly are these comments from?  I assume players on reviews, or comment sections?  I&amp;#39;d love for you to link a few articles by the press that support this.&lt;/p&gt;\n\n&lt;p&gt;Can you find any?&lt;/p&gt;\n\n&lt;p&gt;The reason I ask this is because hype (for most casual gamers) comes from the press...or trailers.  I imagine the average person looking to buy a game isn&amp;#39;t going to sift through the cancer of many Youtube comment sections to find these &amp;#39;impressions&amp;#39; you speak of, but I could be wrong.&lt;/p&gt;\n\n&lt;p&gt;I actually want to cover the hype topic on my channel at some point, so I&amp;#39;m looking forward to see how this thread develops.&lt;/p&gt;\n\n&lt;p&gt;-Tone Loke from Downward Thrust&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgcfeut", "score_hidden": false, "stickied": false, "created": 1492398640.0, "created_utc": 1492369840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65o97i", "likes": null, "replies": "", "user_reports": [], "id": "dgcme21", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GoodLuckGuy", "parent_id": "t3_65o97i", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "It sounds like you are one of the many victims of overhype. Overhype is a big problem in the industry these days but it can only be a problem to you personally if you allow yourself to succumb to it.\n\nYou can allow yourself to experience hype without having it cause you problems. The trick is to not give in to your own confirmation bias. If you are excited about a game, you should try to see if anyone is saying anything bad about it, or if trusted sources are less enthusiastic about hyped elements than the general reception. If anything you read that may work against the hype of a game makes sense to you, you should take it into consideration before purchase.\n\nAlso, don't buy day one unless you have friends buying day one. The only value in a day one purchase is that you can participate in the initial conversation about the game after launch; but if you don't have anyone to talk about the game with, you won't be part of the conversation, therefore losing the one advantage you had when buying day one.\nFor example, I was overall disappointed with Bioshock Infinite despite buying the game day one, however, I bought the game alongside a large number of friends at a midnight release. Over the course of about two weeks me and my friends had myriad conversations about Infinite's strange narrative and mechanical themes, and because the game had just come out, we weren't working off preconceived notions about the game as our views of the game were fresh and wholly our own, as most of us hadn't spent any time reading about a game that we were playing. For me, the book club like effect you can get with a game when buying it in a group on launch, can justify the purchase of an otherwise lacking game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you are one of the many victims of overhype. Overhype is a big problem in the industry these days but it can only be a problem to you personally if you allow yourself to succumb to it.&lt;/p&gt;\n\n&lt;p&gt;You can allow yourself to experience hype without having it cause you problems. The trick is to not give in to your own confirmation bias. If you are excited about a game, you should try to see if anyone is saying anything bad about it, or if trusted sources are less enthusiastic about hyped elements than the general reception. If anything you read that may work against the hype of a game makes sense to you, you should take it into consideration before purchase.&lt;/p&gt;\n\n&lt;p&gt;Also, don&amp;#39;t buy day one unless you have friends buying day one. The only value in a day one purchase is that you can participate in the initial conversation about the game after launch; but if you don&amp;#39;t have anyone to talk about the game with, you won&amp;#39;t be part of the conversation, therefore losing the one advantage you had when buying day one.\nFor example, I was overall disappointed with Bioshock Infinite despite buying the game day one, however, I bought the game alongside a large number of friends at a midnight release. Over the course of about two weeks me and my friends had myriad conversations about Infinite&amp;#39;s strange narrative and mechanical themes, and because the game had just come out, we weren&amp;#39;t working off preconceived notions about the game as our views of the game were fresh and wholly our own, as most of us hadn&amp;#39;t spent any time reading about a game that we were playing. For me, the book club like effect you can get with a game when buying it in a group on launch, can justify the purchase of an otherwise lacking game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgcme21", "score_hidden": false, "stickied": false, "created": 1492407726.0, "created_utc": 1492378926.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]