[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All I&amp;#39;ve been hearing for the past couple years is how game budgets seem to be ballooning causing many smaller or mid-tier developers to either go under or get swallowed up by a larger studio. This creates a problem of creating more and more homogenized games in order to appeal to every demographic as well as the constant push towards more and more realistic graphics. What can studios or even we as consumers do about this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "All I've been hearing for the past couple years is how game budgets seem to be ballooning causing many smaller or mid-tier developers to either go under or get swallowed up by a larger studio. This creates a problem of creating more and more homogenized games in order to appeal to every demographic as well as the constant push towards more and more realistic graphics. What can studios or even we as consumers do about this?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65td8a", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "Wyvern39", "saved": false, "mod_reports": [], "name": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65td8a/what_could_realistically_be_done_to_solve_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492429734.0, "url": "https://www.reddit.com/r/truegaming/comments/65td8a/what_could_realistically_be_done_to_solve_the/", "author_flair_text": null, "quarantine": false, "title": "What could realistically be done to solve the problem of ever-increasing budgets for AAA games?", "created_utc": 1492400934.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 32, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgd3ppx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mithrillion", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Hopefully the game creator's tools will improve over time as well. Creating assets and writing efficient code can be quite costly nowadays, but that could change in the future. Maybe more universally applicable game engines will appear. Just see how much Unity has improved the maximum possible scope of indie developers, now imagine something like Unity but can also be easily used for heavier games without everything looking samey. We are moving in the direction of doing more while knowing less about the low levels.\n\nAlso, new machine learning techniques can potentially alleviate the workload of graphics designers. For example, a lot of natural terrains we see today are generated by [Perlin noise](https://en.wikipedia.org/wiki/Perlin_noise), which is useful, but only for very random surfaces and still needs a fair amount of manual adjustments. With techniques like [style transferring](http://www.theverge.com/2017/3/30/15124466/ai-photo-style-transfer-deep-neural-nets-adobe), we might be able to easily apply a consistent art style onto bare models. There exist algorithms to colour B&amp;W images from \"experience\" already. Image if we could draw a few polygons, select a style and the machine would flesh out the textures or even model details like carvings for us. There will always be a delay between research and industry application, but this time it appears that even the stereotypically anti-automation artists have noticed the potential.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hopefully the game creator&amp;#39;s tools will improve over time as well. Creating assets and writing efficient code can be quite costly nowadays, but that could change in the future. Maybe more universally applicable game engines will appear. Just see how much Unity has improved the maximum possible scope of indie developers, now imagine something like Unity but can also be easily used for heavier games without everything looking samey. We are moving in the direction of doing more while knowing less about the low levels.&lt;/p&gt;\n\n&lt;p&gt;Also, new machine learning techniques can potentially alleviate the workload of graphics designers. For example, a lot of natural terrains we see today are generated by &lt;a href=\"https://en.wikipedia.org/wiki/Perlin_noise\"&gt;Perlin noise&lt;/a&gt;, which is useful, but only for very random surfaces and still needs a fair amount of manual adjustments. With techniques like &lt;a href=\"http://www.theverge.com/2017/3/30/15124466/ai-photo-style-transfer-deep-neural-nets-adobe\"&gt;style transferring&lt;/a&gt;, we might be able to easily apply a consistent art style onto bare models. There exist algorithms to colour B&amp;amp;W images from &amp;quot;experience&amp;quot; already. Image if we could draw a few polygons, select a style and the machine would flesh out the textures or even model details like carvings for us. There will always be a delay between research and industry application, but this time it appears that even the stereotypically anti-automation artists have noticed the potential.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgd3ppx", "score_hidden": true, "stickied": false, "created": 1492431792.0, "created_utc": 1492402992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdptpp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t1_dgd8eu9", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; Stop with the photorealism obsession. It's that simple.\n\nCompletely agreed. I was about to post a comment of my own saying \"if they only stopped caring a bit about damn fancy graphics\", then I saw your comment.\n\nThere are many indie games that became big hits and, at least from a graphics perspective, weren't full blown big dick triple A graphics: Binding of Isaac, Hotline Miami, Shovel Knight...hell, Minecraft became a multi-million business and still has a huge following.\n\nBut sadly, \"regressing\" on the graphics department would make any AAA companies lose a lot of money so I don't think we're gonna see any improvements. Thankfully we still have small companies still kicking who can make arguably better games than what many AAA games have become for the past few years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Stop with the photorealism obsession. It&amp;#39;s that simple.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Completely agreed. I was about to post a comment of my own saying &amp;quot;if they only stopped caring a bit about damn fancy graphics&amp;quot;, then I saw your comment.&lt;/p&gt;\n\n&lt;p&gt;There are many indie games that became big hits and, at least from a graphics perspective, weren&amp;#39;t full blown big dick triple A graphics: Binding of Isaac, Hotline Miami, Shovel Knight...hell, Minecraft became a multi-million business and still has a huge following.&lt;/p&gt;\n\n&lt;p&gt;But sadly, &amp;quot;regressing&amp;quot; on the graphics department would make any AAA companies lose a lot of money so I don&amp;#39;t think we&amp;#39;re gonna see any improvements. Thankfully we still have small companies still kicking who can make arguably better games than what many AAA games have become for the past few years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdptpp", "score_hidden": true, "stickied": false, "created": 1492475601.0, "created_utc": 1492446801.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdesrt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pedruben", "parent_id": "t1_dgdekuk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "It feels unfair to compare two games with a massive advertising budget against two indie games. Especially when the crowd in question is \"casual\".\n\n\nIn return, Minecraft is still popular and that game is around a decade old.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It feels unfair to compare two games with a massive advertising budget against two indie games. Especially when the crowd in question is &amp;quot;casual&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;In return, Minecraft is still popular and that game is around a decade old.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdesrt", "score_hidden": true, "stickied": false, "created": 1492460401.0, "created_utc": 1492431601.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdz46o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdql5o", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I must say that even though it sounds a bit extreme, I agree with you. But what we see today, as crazy as it may sound, is that people who don't have the time or etc etc etc etc to play games are the ones who are being favoured by the \"best\" Devs out there.\n\nI just thank God daily for the Soulsborne series. Thanks to it, I not only discovered those games, but also came to realize that the indie market has a lot of great experiences for the ones who likes challenges on games.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I must say that even though it sounds a bit extreme, I agree with you. But what we see today, as crazy as it may sound, is that people who don&amp;#39;t have the time or etc etc etc etc to play games are the ones who are being favoured by the &amp;quot;best&amp;quot; Devs out there.&lt;/p&gt;\n\n&lt;p&gt;I just thank God daily for the Soulsborne series. Thanks to it, I not only discovered those games, but also came to realize that the indie market has a lot of great experiences for the ones who likes challenges on games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdz46o", "score_hidden": true, "stickied": false, "created": 1492485985.0, "created_utc": 1492457185.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdql5o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t1_dgdo0w2", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; a lot of people who grew up gaming in the 80's, 90's and early 2000's don't have time to dedicate to games right now, so they just want an \"automatic gameplay experience\" that gives that some kind of reward (advancing through the story, seeing the next cutscene, defeating a boss by pressing two buttons, you name it). Then again, having these kind of experiences, with hifi graphics, well made cutscenes, well written dialogue (which is pretty much a Halley in the gaming industry) and such, again, costs a lot of money. But as long as they keep selling, the devs will keep making it.\n\nIMO if they want to take part in a hobby which demands, for the most part, a lot of time but chose to have a life which gives them little time, it's their problem. It's quite annoying when I see people here and there complaining that 40-80 (or more) hour RPGs are too big because now they have wife and kids...well, nobody put a gun to your face and forced you to marry and breed now, did they? I love my hobby, it's been the biggest passion of mine for around 20 years now. I know it demands time and money so I do my best to balance my personal life to make sure gaming has it's fair share.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;a lot of people who grew up gaming in the 80&amp;#39;s, 90&amp;#39;s and early 2000&amp;#39;s don&amp;#39;t have time to dedicate to games right now, so they just want an &amp;quot;automatic gameplay experience&amp;quot; that gives that some kind of reward (advancing through the story, seeing the next cutscene, defeating a boss by pressing two buttons, you name it). Then again, having these kind of experiences, with hifi graphics, well made cutscenes, well written dialogue (which is pretty much a Halley in the gaming industry) and such, again, costs a lot of money. But as long as they keep selling, the devs will keep making it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;IMO if they want to take part in a hobby which demands, for the most part, a lot of time but chose to have a life which gives them little time, it&amp;#39;s their problem. It&amp;#39;s quite annoying when I see people here and there complaining that 40-80 (or more) hour RPGs are too big because now they have wife and kids...well, nobody put a gun to your face and forced you to marry and breed now, did they? I love my hobby, it&amp;#39;s been the biggest passion of mine for around 20 years now. I know it demands time and money so I do my best to balance my personal life to make sure gaming has it&amp;#39;s fair share.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdql5o", "score_hidden": true, "stickied": false, "created": 1492476441.0, "created_utc": 1492447641.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo0w2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdlybk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt;Hoo boy, where do I even start? First of all, unfortunately? Yes, humans have the freedom to care about the aspect of a game that you don't necessarily. That's not a problem. People having the freedom to choose what they like is not a problem. Secondly, no. Have you seen reviews of games like journey, flower, braid, or even thomas was alone? None of these games are photorealistic, but they still resonated with people in a big way. The stanley parable is another big example of this.\n\nFor the first part, I think that it was pretty much implied that everything that every one of us write on reddit is based on our point of view (unless stated otherwise). That being said, there is no reason for you to get nervous with me saying \"unfortunately\". Yes, humans have the freedom of choice, and again, unfortunately, they're choosing to praise something that IN MY OPINION is not what the games should be about. And I agree with the examples that you gave having great reviews. But they are the exception of the exception. Have you seen the amount of shit that Zelda BOTW gets all over the internet because of washed up textures and FPS drops? That's what people care about these days, and that costs a lot of money.\n\n&gt;This kind of argument really bothers me. It speaks to a kind of ownership that was never really granted. There is nothing wrong with casual players. Nothing. They're there, they like different games than we do. This is not a problem. People keep treating it like it's this massive problem, but people are going to have their own tastes and preferences. That's just how it goes. I mean, how would you feel if someone was calling you a problem or an infection or a cancer that's destroying the game industry? A little acceptance is all we need here, folks, it's not hard.\n\nAgain, you're showing a level of stress that should not be shown as a response to my post. Yes, there is nothing wrong with casual players. LOL, they are not a cancer or an infection (and I never implied anything even close to it).\n\nThat being said, casual gamers are the ones that are driving the industry right now simply because they are the majority. Even more because not only people who started gaming recently are considered casuals, but also because a lot of people who grew up gaming in the 80's, 90's and early 2000's don't have time to dedicate to games right now, so they just want an \"automatic gameplay experience\" that gives that some kind of reward (advancing through the story, seeing the next cutscene, defeating a boss by pressing two buttons, you name it). Then again, having these kind of experiences, with hifi graphics, well made cutscenes, well written dialogue (which is pretty much a Halley in the gaming industry) and such, again, costs a lot of money. But as long as they keep selling, the devs will keep making it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Hoo boy, where do I even start? First of all, unfortunately? Yes, humans have the freedom to care about the aspect of a game that you don&amp;#39;t necessarily. That&amp;#39;s not a problem. People having the freedom to choose what they like is not a problem. Secondly, no. Have you seen reviews of games like journey, flower, braid, or even thomas was alone? None of these games are photorealistic, but they still resonated with people in a big way. The stanley parable is another big example of this.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For the first part, I think that it was pretty much implied that everything that every one of us write on reddit is based on our point of view (unless stated otherwise). That being said, there is no reason for you to get nervous with me saying &amp;quot;unfortunately&amp;quot;. Yes, humans have the freedom of choice, and again, unfortunately, they&amp;#39;re choosing to praise something that IN MY OPINION is not what the games should be about. And I agree with the examples that you gave having great reviews. But they are the exception of the exception. Have you seen the amount of shit that Zelda BOTW gets all over the internet because of washed up textures and FPS drops? That&amp;#39;s what people care about these days, and that costs a lot of money.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This kind of argument really bothers me. It speaks to a kind of ownership that was never really granted. There is nothing wrong with casual players. Nothing. They&amp;#39;re there, they like different games than we do. This is not a problem. People keep treating it like it&amp;#39;s this massive problem, but people are going to have their own tastes and preferences. That&amp;#39;s just how it goes. I mean, how would you feel if someone was calling you a problem or an infection or a cancer that&amp;#39;s destroying the game industry? A little acceptance is all we need here, folks, it&amp;#39;s not hard.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, you&amp;#39;re showing a level of stress that should not be shown as a response to my post. Yes, there is nothing wrong with casual players. LOL, they are not a cancer or an infection (and I never implied anything even close to it).&lt;/p&gt;\n\n&lt;p&gt;That being said, casual gamers are the ones that are driving the industry right now simply because they are the majority. Even more because not only people who started gaming recently are considered casuals, but also because a lot of people who grew up gaming in the 80&amp;#39;s, 90&amp;#39;s and early 2000&amp;#39;s don&amp;#39;t have time to dedicate to games right now, so they just want an &amp;quot;automatic gameplay experience&amp;quot; that gives that some kind of reward (advancing through the story, seeing the next cutscene, defeating a boss by pressing two buttons, you name it). Then again, having these kind of experiences, with hifi graphics, well made cutscenes, well written dialogue (which is pretty much a Halley in the gaming industry) and such, again, costs a lot of money. But as long as they keep selling, the devs will keep making it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdo0w2", "score_hidden": true, "stickied": false, "created": 1492473570.0, "created_utc": 1492444770.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlybk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Racecarlock", "parent_id": "t1_dgdekuk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; Unfortunately, they care about story. They care about being emotionally invested in the game. And that comes with the cost of having photorealistic graphics.\n\nHoo boy, where do I even start?\n\nFirst of all, unfortunately? Yes, humans have the freedom to care about the aspect of a game that you don't necessarily. That's not a problem. People having the freedom to choose what they like is not a problem.\n\nSecondly, no. Have you seen reviews of games like journey, flower, braid, or even thomas was alone? None of these games are photorealistic, but they still resonated with people in a big way. The stanley parable is another big example of this.\n\n&gt;2 - Which is just a consequence of 1. The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them. On the other hand, mediocre gameplay experiences with great graphical quality like Uncharted or The Last Of Us, are praised up and down. With this, I don't see the scenario changing very soon.\n\nThis kind of argument really bothers me. It speaks to a kind of ownership that was never really granted. There is nothing wrong with casual players. Nothing. They're there, they like different games than we do. This is not a problem. People keep treating it like it's this massive problem, but people are going to have their own tastes and preferences. That's just how it goes. I mean, how would you feel if someone was calling you a problem or an infection or a cancer that's destroying the game industry? A little acceptance is all we need here, folks, it's not hard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Unfortunately, they care about story. They care about being emotionally invested in the game. And that comes with the cost of having photorealistic graphics.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hoo boy, where do I even start?&lt;/p&gt;\n\n&lt;p&gt;First of all, unfortunately? Yes, humans have the freedom to care about the aspect of a game that you don&amp;#39;t necessarily. That&amp;#39;s not a problem. People having the freedom to choose what they like is not a problem.&lt;/p&gt;\n\n&lt;p&gt;Secondly, no. Have you seen reviews of games like journey, flower, braid, or even thomas was alone? None of these games are photorealistic, but they still resonated with people in a big way. The stanley parable is another big example of this.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;2 - Which is just a consequence of 1. The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp;amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them. On the other hand, mediocre gameplay experiences with great graphical quality like Uncharted or The Last Of Us, are praised up and down. With this, I don&amp;#39;t see the scenario changing very soon.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This kind of argument really bothers me. It speaks to a kind of ownership that was never really granted. There is nothing wrong with casual players. Nothing. They&amp;#39;re there, they like different games than we do. This is not a problem. People keep treating it like it&amp;#39;s this massive problem, but people are going to have their own tastes and preferences. That&amp;#39;s just how it goes. I mean, how would you feel if someone was calling you a problem or an infection or a cancer that&amp;#39;s destroying the game industry? A little acceptance is all we need here, folks, it&amp;#39;s not hard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdlybk", "score_hidden": true, "stickied": false, "created": 1492471180.0, "created_utc": 1492442380.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdqha3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdpj2h", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I can totally understand you. I'm also married at this point, and back at 2008 - 2013, I also had very few time to dedicate to games. Today I'm on a different situation, so I can spend 20 or so hours on it, and I really feel like the players that can dedicate a bit of their time to gaming are being abandoned by the AAA industry, and that really makes me sad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can totally understand you. I&amp;#39;m also married at this point, and back at 2008 - 2013, I also had very few time to dedicate to games. Today I&amp;#39;m on a different situation, so I can spend 20 or so hours on it, and I really feel like the players that can dedicate a bit of their time to gaming are being abandoned by the AAA industry, and that really makes me sad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdqha3", "score_hidden": true, "stickied": false, "created": 1492476326.0, "created_utc": 1492447526.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpj2h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dgdolcg", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt;Concluding this, for as absurd as it seems, for me is just wrong to continue calling all that the gaming industry makes as \"games\". I mean, what is a game? The way I see it (and correct me if I'm wrong), is a set of rules that you have to learn and master to overcome and be victorious. THe \"games\" today aren't anything like this. You're always victorious, you can't lose, otherwise the frustration will make you feel like you wasted 60 bucks and never buy anything else from this dev. Just call them interactive entertainment then.\n\nI actually don't disagree with you there. Games are by and large easier, but you also have to remember that games are more popular than they used to be BECAUSE they are easier and more accessible. it's a compromise that I feel developers had to make in order to keep their business running and keep up with the rest of the industry.\n\nHell, I used to love challenging games back in high school and university. But I work full time now, have a wife, social circle and my own place that I need to take care of, I literally have like 2-3 hours a WEEK that I can spend on gaming. I would rather spend that exploring the world of The Witcher 3 on normal mode or easily killing a bunch of goofs in the beautifully rendered locals of Uncharted 4 than dying over and over in Bloodborne or Super Meat Boy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Concluding this, for as absurd as it seems, for me is just wrong to continue calling all that the gaming industry makes as &amp;quot;games&amp;quot;. I mean, what is a game? The way I see it (and correct me if I&amp;#39;m wrong), is a set of rules that you have to learn and master to overcome and be victorious. THe &amp;quot;games&amp;quot; today aren&amp;#39;t anything like this. You&amp;#39;re always victorious, you can&amp;#39;t lose, otherwise the frustration will make you feel like you wasted 60 bucks and never buy anything else from this dev. Just call them interactive entertainment then.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I actually don&amp;#39;t disagree with you there. Games are by and large easier, but you also have to remember that games are more popular than they used to be BECAUSE they are easier and more accessible. it&amp;#39;s a compromise that I feel developers had to make in order to keep their business running and keep up with the rest of the industry.&lt;/p&gt;\n\n&lt;p&gt;Hell, I used to love challenging games back in high school and university. But I work full time now, have a wife, social circle and my own place that I need to take care of, I literally have like 2-3 hours a WEEK that I can spend on gaming. I would rather spend that exploring the world of The Witcher 3 on normal mode or easily killing a bunch of goofs in the beautifully rendered locals of Uncharted 4 than dying over and over in Bloodborne or Super Meat Boy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdpj2h", "score_hidden": true, "stickied": false, "created": 1492475272.0, "created_utc": 1492446472.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdolcg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdn85y", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I sincerely don't know what was about my post that really seemed to get people irritated like if I was attacking the \"casual\" gamer. What I said is pretty much summed up in a single phrase of your post:\n\n&gt;Most people just don't have the time and patience for this.\n\nI totally agree with this.\n\nBut what's the catch here?\n\nIs that the people who just don't have the time or patience to play a Soulsborne, or a Super Meat Boy or whatever game that present a challenge are the enormous majority of the gamers nowadays. \n\nAnd thinking from the Devs side, what do you do if you can't challenge the player because he will get frustrated and stop playing your game. You try to excel in other departments. But improving on those other departments costs a lot of money (a lot more that refining a gameplay would).\n\nTake a game like Assassin's Creed for example. All of them are built on nicely made cities with a lot of places to explore. What's the big problem there? The game pretty much plays itself for you. You have absolutely ZERO challenge in doing parkour. You just press A and suddenly you're on top of the world. Sure, when you're up there, the visuals certainly are pretty nice. But wouldn't be better if they added some kind of challenging platforming and climbing skills to get up there? They just can't, otherwise people will get frustrated and stop playing the game.\n\nConcluding this, for as absurd as it seems, for me is just wrong to continue calling all that the gaming industry makes as \"games\". I mean, what is a game? The way I see it (and correct me if I'm wrong), is a set of rules that you have to learn and master to overcome and be victorious. THe \"games\" today aren't anything like this. You're always victorious, you can't lose, otherwise the frustration will make you feel like you wasted 60 bucks and never buy anything else from this dev. Just call them interactive entertainment then.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sincerely don&amp;#39;t know what was about my post that really seemed to get people irritated like if I was attacking the &amp;quot;casual&amp;quot; gamer. What I said is pretty much summed up in a single phrase of your post:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Most people just don&amp;#39;t have the time and patience for this.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I totally agree with this.&lt;/p&gt;\n\n&lt;p&gt;But what&amp;#39;s the catch here?&lt;/p&gt;\n\n&lt;p&gt;Is that the people who just don&amp;#39;t have the time or patience to play a Soulsborne, or a Super Meat Boy or whatever game that present a challenge are the enormous majority of the gamers nowadays. &lt;/p&gt;\n\n&lt;p&gt;And thinking from the Devs side, what do you do if you can&amp;#39;t challenge the player because he will get frustrated and stop playing your game. You try to excel in other departments. But improving on those other departments costs a lot of money (a lot more that refining a gameplay would).&lt;/p&gt;\n\n&lt;p&gt;Take a game like Assassin&amp;#39;s Creed for example. All of them are built on nicely made cities with a lot of places to explore. What&amp;#39;s the big problem there? The game pretty much plays itself for you. You have absolutely ZERO challenge in doing parkour. You just press A and suddenly you&amp;#39;re on top of the world. Sure, when you&amp;#39;re up there, the visuals certainly are pretty nice. But wouldn&amp;#39;t be better if they added some kind of challenging platforming and climbing skills to get up there? They just can&amp;#39;t, otherwise people will get frustrated and stop playing the game.&lt;/p&gt;\n\n&lt;p&gt;Concluding this, for as absurd as it seems, for me is just wrong to continue calling all that the gaming industry makes as &amp;quot;games&amp;quot;. I mean, what is a game? The way I see it (and correct me if I&amp;#39;m wrong), is a set of rules that you have to learn and master to overcome and be victorious. THe &amp;quot;games&amp;quot; today aren&amp;#39;t anything like this. You&amp;#39;re always victorious, you can&amp;#39;t lose, otherwise the frustration will make you feel like you wasted 60 bucks and never buy anything else from this dev. Just call them interactive entertainment then.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdolcg", "score_hidden": true, "stickied": false, "created": 1492474219.0, "created_utc": 1492445419.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn85y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dgdekuk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I don't think I necessarily agree with this. You are probably referring to the casual, mainstream market that will move the majority of a game's copies. I don't think photorealistic visuals are as big of a selling point as you think they are. Most of my friends are VERY casual gamers and they enjoy games like Donkey Kong Country, Mario Kart, Candy Crush etc., games with stylized/cartoony graphics but finely tuned gameplay (yes, even Candy Crush has solid gameplay for what it is). There are many photorealistic games coming out that don't sell well. The Order 1886, Ryse etc and some others were touted for their visuals but didn't necessarily get any significant critical or commercial success. Meanwhile recent games like Nier Automata and Persona 5, which don't have realistic graphics, have received critical acclaim and strong sales. \n\nI also have an issue with you using Super Meat Boy and Salt and Sanctuary as examples of finely tuned gameplay. These games are specialized niche products by design and are only directed to a specific demographic - i.e. long-time gamers with lots of experience and the free time required to succeed at these games. The average adult with a 9-5 job and family/social responsibilities doesn't have the time, patience or inclination for these games. Your perspective is quite short-sighted - why would they spend their time getting frustrated over and over in something like Dark Souls when they can the satisfaction of completing a level or quest in the same amount of time in something like Uncharted or Horizon Zero Dawn?\n\nBy the way, The Last of Us has GREAT mechanics that perfectly complements its setting and story and on a storytelling front it blows away 99.9% of games - and you're seriously wondering why it was such a massive success? Same with The Witcher 3 - sure, the gameplay isn't as finely tuned as more hardcore aRPGs like Dark Souls, but it also succeeds on other fronts - like its wonderful narratives, characters, and graphics. It's a case of the sum being greater than its parts - that's what most people care about. Sure, Super Meat Boy is excellent mechanics, but it's also ridiculously difficult and requires a significant time commitment or previous experience in the genre to get good at. Same with something like Salt &amp; Sanctuary, FTL, the Soulsborne games etc. Most people just don't have the time and patience for this.\n\nHardcore gamers have a very myopic viewpoint when it comes to the \"casual\" gamer, as if they were some inferior class of people playing games. Believe it or not, games aren't the be all and end all for most people, and most just want a relaxing, stress-free time that allows them to feel some sense of achievement or satisfaction without excessive frustration. Mechanical competence in games is not a priority for casual gamers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think I necessarily agree with this. You are probably referring to the casual, mainstream market that will move the majority of a game&amp;#39;s copies. I don&amp;#39;t think photorealistic visuals are as big of a selling point as you think they are. Most of my friends are VERY casual gamers and they enjoy games like Donkey Kong Country, Mario Kart, Candy Crush etc., games with stylized/cartoony graphics but finely tuned gameplay (yes, even Candy Crush has solid gameplay for what it is). There are many photorealistic games coming out that don&amp;#39;t sell well. The Order 1886, Ryse etc and some others were touted for their visuals but didn&amp;#39;t necessarily get any significant critical or commercial success. Meanwhile recent games like Nier Automata and Persona 5, which don&amp;#39;t have realistic graphics, have received critical acclaim and strong sales. &lt;/p&gt;\n\n&lt;p&gt;I also have an issue with you using Super Meat Boy and Salt and Sanctuary as examples of finely tuned gameplay. These games are specialized niche products by design and are only directed to a specific demographic - i.e. long-time gamers with lots of experience and the free time required to succeed at these games. The average adult with a 9-5 job and family/social responsibilities doesn&amp;#39;t have the time, patience or inclination for these games. Your perspective is quite short-sighted - why would they spend their time getting frustrated over and over in something like Dark Souls when they can the satisfaction of completing a level or quest in the same amount of time in something like Uncharted or Horizon Zero Dawn?&lt;/p&gt;\n\n&lt;p&gt;By the way, The Last of Us has GREAT mechanics that perfectly complements its setting and story and on a storytelling front it blows away 99.9% of games - and you&amp;#39;re seriously wondering why it was such a massive success? Same with The Witcher 3 - sure, the gameplay isn&amp;#39;t as finely tuned as more hardcore aRPGs like Dark Souls, but it also succeeds on other fronts - like its wonderful narratives, characters, and graphics. It&amp;#39;s a case of the sum being greater than its parts - that&amp;#39;s what most people care about. Sure, Super Meat Boy is excellent mechanics, but it&amp;#39;s also ridiculously difficult and requires a significant time commitment or previous experience in the genre to get good at. Same with something like Salt &amp;amp; Sanctuary, FTL, the Soulsborne games etc. Most people just don&amp;#39;t have the time and patience for this.&lt;/p&gt;\n\n&lt;p&gt;Hardcore gamers have a very myopic viewpoint when it comes to the &amp;quot;casual&amp;quot; gamer, as if they were some inferior class of people playing games. Believe it or not, games aren&amp;#39;t the be all and end all for most people, and most just want a relaxing, stress-free time that allows them to feel some sense of achievement or satisfaction without excessive frustration. Mechanical competence in games is not a priority for casual gamers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdn85y", "score_hidden": true, "stickied": false, "created": 1492472657.0, "created_utc": 1492443857.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdzzfz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t1_dgdz8tq", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "When I say \"ruining\", I don't mean like \"oh my god we'll have another video game crash like in the 80s\". I mean in the sense that, at least regarding some big studios, there is a visible decline in quality and some shitty practices, all in the name of selling more. Casual gamers aren't really devoted to gaming as a hobby, they have a shallow view of it, much like as if they were watching some random movies or TV shows. They pay no mind if a franchise is going to the shitters in the failed attempt to please them and just move to the next big shiny thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I say &amp;quot;ruining&amp;quot;, I don&amp;#39;t mean like &amp;quot;oh my god we&amp;#39;ll have another video game crash like in the 80s&amp;quot;. I mean in the sense that, at least regarding some big studios, there is a visible decline in quality and some shitty practices, all in the name of selling more. Casual gamers aren&amp;#39;t really devoted to gaming as a hobby, they have a shallow view of it, much like as if they were watching some random movies or TV shows. They pay no mind if a franchise is going to the shitters in the failed attempt to please them and just move to the next big shiny thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdzzfz", "score_hidden": true, "stickied": false, "created": 1492486966.0, "created_utc": 1492458166.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdz8tq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdq2cw", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yeah, I think that it is a problem when the devs starts to deviate the media entirely, making it as palatable as possible just to please everyone.\n\nBut as for \"ruining\", I don't think this is true for devs. For all I know, they are selling like never before, so I don't see a way out of the situation we are now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I think that it is a problem when the devs starts to deviate the media entirely, making it as palatable as possible just to please everyone.&lt;/p&gt;\n\n&lt;p&gt;But as for &amp;quot;ruining&amp;quot;, I don&amp;#39;t think this is true for devs. For all I know, they are selling like never before, so I don&amp;#39;t see a way out of the situation we are now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdz8tq", "score_hidden": true, "stickied": false, "created": 1492486132.0, "created_utc": 1492457332.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq2cw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t1_dgdekuk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them.\n\nCall me an elitist prick, but the less casuals we have, the better. Being bigger in numbers, they are ruining the industry since companies care about making the biggest buck with the least possible effort, which leads them to appeal to the most common denominator, which is...surprise surprise, the overwhelming mass of casuals who don't give much of a shit about the hobby and let the AAA studios get away with anything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp;amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Call me an elitist prick, but the less casuals we have, the better. Being bigger in numbers, they are ruining the industry since companies care about making the biggest buck with the least possible effort, which leads them to appeal to the most common denominator, which is...surprise surprise, the overwhelming mass of casuals who don&amp;#39;t give much of a shit about the hobby and let the AAA studios get away with anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdq2cw", "score_hidden": true, "stickied": false, "created": 1492475865.0, "created_utc": 1492447065.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdekuk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgd8eu9", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I agree 100% with you, but I see some problems with this approach:\n\n1 - The devs already spoiled gamers with this. The majority of gamers today don't care about a fine tuned gameplay or balance. Unfortunately, they care about story. They care about being emotionally invested in the game. And that comes with the cost of having photorealistic graphics. I mean, there are some games that can achieve their goal without it, but the \"safe\" approach is to use it;\n\n2 - Which is just a consequence of 1. The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them. On the other hand, mediocre gameplay experiences with great graphical quality like Uncharted or The Last Of Us, are praised up and down. With this, I don't see the scenario changing very soon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree 100% with you, but I see some problems with this approach:&lt;/p&gt;\n\n&lt;p&gt;1 - The devs already spoiled gamers with this. The majority of gamers today don&amp;#39;t care about a fine tuned gameplay or balance. Unfortunately, they care about story. They care about being emotionally invested in the game. And that comes with the cost of having photorealistic graphics. I mean, there are some games that can achieve their goal without it, but the &amp;quot;safe&amp;quot; approach is to use it;&lt;/p&gt;\n\n&lt;p&gt;2 - Which is just a consequence of 1. The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp;amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them. On the other hand, mediocre gameplay experiences with great graphical quality like Uncharted or The Last Of Us, are praised up and down. With this, I don&amp;#39;t see the scenario changing very soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdekuk", "score_hidden": true, "stickied": false, "created": 1492459943.0, "created_utc": 1492431143.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8eu9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Racecarlock", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Stop with the photorealism obsession. It's that simple. Would it be cool to play an entirely photorealistic game? Yeah. But there are plenty of games that are already out there and are cool to play and aren't photorealistic.\n\nI'm not saying companies should stop entirely, but maybe slow it down to a few products trying to achieve it rather than having every product try to achieve it. There is nothing wrong with stylization.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop with the photorealism obsession. It&amp;#39;s that simple. Would it be cool to play an entirely photorealistic game? Yeah. But there are plenty of games that are already out there and are cool to play and aren&amp;#39;t photorealistic.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying companies should stop entirely, but maybe slow it down to a few products trying to achieve it rather than having every product try to achieve it. There is nothing wrong with stylization.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgd8eu9", "score_hidden": true, "stickied": false, "created": 1492441482.0, "created_utc": 1492412682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdcy4a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dougy_Sampson", "parent_id": "t1_dgd5snq", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "But that includes musicians and voice actors. I'm talkin' full time developers. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that includes musicians and voice actors. I&amp;#39;m talkin&amp;#39; full time developers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdcy4a", "score_hidden": true, "stickied": false, "created": 1492455917.0, "created_utc": 1492427117.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5snq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nameucanthate", "parent_id": "t1_dgd31ga", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Zelda had over 300 people working on it...\n\nhttp://nintendotoday.com/breath-of-the-wild-development/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Zelda had over 300 people working on it...&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://nintendotoday.com/breath-of-the-wild-development/\"&gt;http://nintendotoday.com/breath-of-the-wild-development/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgd5snq", "score_hidden": true, "stickied": false, "created": 1492435705.0, "created_utc": 1492406905.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdblv2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FreshGroundCoffee", "parent_id": "t1_dgd31ga", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'd say lengthy troubled projects is less down to big budgets in general, more that sometimes a project can be badly managed, and that applies anywhere.\n\nGames by their nature are hard things to produce, when you're starting out what *is* the process for finding fun. When you're at the start of a 3 year project, how much time do you allocate the level designers, the gameplay designers, the multiplayer balance team, etc, to make their bit fun, how many times do you allow them to say \"this isn't working, I'm going to try something new\" and do another iteration. And because of the web of dependencies in a project when someone changes something in their domain it means a lot of rework for other teams too, likely throwing up new complications. \n\nThe more complex the project, the more likely it's going to happen, and the alternative to a project running long in an effort to fill it's spec is for features to be cut or shrunk down to be less ambitious or reliable.\n\nYou know who we never hear about getting delayed or going over budget? The regular release series games, where there's a very predictable path to follow to the goal. That's where AAA excels. If you're looking for weird experimental projects then find it on a project that isn't a multi-million investment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say lengthy troubled projects is less down to big budgets in general, more that sometimes a project can be badly managed, and that applies anywhere.&lt;/p&gt;\n\n&lt;p&gt;Games by their nature are hard things to produce, when you&amp;#39;re starting out what &lt;em&gt;is&lt;/em&gt; the process for finding fun. When you&amp;#39;re at the start of a 3 year project, how much time do you allocate the level designers, the gameplay designers, the multiplayer balance team, etc, to make their bit fun, how many times do you allow them to say &amp;quot;this isn&amp;#39;t working, I&amp;#39;m going to try something new&amp;quot; and do another iteration. And because of the web of dependencies in a project when someone changes something in their domain it means a lot of rework for other teams too, likely throwing up new complications. &lt;/p&gt;\n\n&lt;p&gt;The more complex the project, the more likely it&amp;#39;s going to happen, and the alternative to a project running long in an effort to fill it&amp;#39;s spec is for features to be cut or shrunk down to be less ambitious or reliable.&lt;/p&gt;\n\n&lt;p&gt;You know who we never hear about getting delayed or going over budget? The regular release series games, where there&amp;#39;s a very predictable path to follow to the goal. That&amp;#39;s where AAA excels. If you&amp;#39;re looking for weird experimental projects then find it on a project that isn&amp;#39;t a multi-million investment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdblv2", "score_hidden": true, "stickied": false, "created": 1492451674.0, "created_utc": 1492422874.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd31ga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dougy_Sampson", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This really boils down to patience. If you'll recall, there were a number of games with lengthy productions prior to the most recent generation. Time is a valuable resource so many publishers focus on acquiring a ton of talent, crunching for 3 years, and then laying people off. You especially see this with Ubisoft projects, where every game is a global effort.\n\nFunny thing is, Japan is receiving a lot of attention this year for games such as Yakuza 0, Persona 5, Nier Automata, and Zelda. Compared to the west, these development cycles were longer and the teams were smaller. At one point, Nintendo mentioned they had over 100 people working on Zelda, which is pretty big....by 2003 standards.\n\nPoint is, less employees means less overhead BUT it does require a lot more patience and faith in a particular project. I'm not going to say there's a magic number in terms of size and length (tee hee) but allowing a studio to develop a culture will result in games people can identify with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This really boils down to patience. If you&amp;#39;ll recall, there were a number of games with lengthy productions prior to the most recent generation. Time is a valuable resource so many publishers focus on acquiring a ton of talent, crunching for 3 years, and then laying people off. You especially see this with Ubisoft projects, where every game is a global effort.&lt;/p&gt;\n\n&lt;p&gt;Funny thing is, Japan is receiving a lot of attention this year for games such as Yakuza 0, Persona 5, Nier Automata, and Zelda. Compared to the west, these development cycles were longer and the teams were smaller. At one point, Nintendo mentioned they had over 100 people working on Zelda, which is pretty big....by 2003 standards.&lt;/p&gt;\n\n&lt;p&gt;Point is, less employees means less overhead BUT it does require a lot more patience and faith in a particular project. I&amp;#39;m not going to say there&amp;#39;s a magic number in terms of size and length (tee hee) but allowing a studio to develop a culture will result in games people can identify with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgd31ga", "score_hidden": true, "stickied": false, "created": 1492430674.0, "created_utc": 1492401874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdc3ob", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blackmist", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Very little. Wages increase, hardware increases, expectations increase... None of that is about to change. Studios may decide that the risk is to great and focus on smaller titles, like Double Fine now do. Even larger studios throw out an indie game or two because they've had a good idea but can't risk the whole company on it.\n\nThe only thing that can be done is to make sure the audience is there. I believe this is already taken care of as long as there's no hard generation jumps in hardware. If the PS Pro and Xbox Scorpio approach is used from now on (even if old generations are eventually retired), it means there won't be an awkward phase where new mega-budget games get released to a maximum of a few million people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very little. Wages increase, hardware increases, expectations increase... None of that is about to change. Studios may decide that the risk is to great and focus on smaller titles, like Double Fine now do. Even larger studios throw out an indie game or two because they&amp;#39;ve had a good idea but can&amp;#39;t risk the whole company on it.&lt;/p&gt;\n\n&lt;p&gt;The only thing that can be done is to make sure the audience is there. I believe this is already taken care of as long as there&amp;#39;s no hard generation jumps in hardware. If the PS Pro and Xbox Scorpio approach is used from now on (even if old generations are eventually retired), it means there won&amp;#39;t be an awkward phase where new mega-budget games get released to a maximum of a few million people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdc3ob", "score_hidden": true, "stickied": false, "created": 1492453308.0, "created_utc": 1492424508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgd7f4x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jiimji", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Outsource all stuff in India,China or Bulgaria? because that's eventually what will happen with big publishers, once they moved all the production to these countries.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Outsource all stuff in India,China or Bulgaria? because that&amp;#39;s eventually what will happen with big publishers, once they moved all the production to these countries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgd7f4x", "score_hidden": true, "stickied": false, "created": 1492439173.0, "created_utc": 1492410373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdezrc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bangersss", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "You know those asset flip games? That's what cheap game production looks like, taken to an extreme. Maybe there's some middle ground though, together with procedural generation to reduce the burden of creating assets so devs can focus on creating the actual games. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know those asset flip games? That&amp;#39;s what cheap game production looks like, taken to an extreme. Maybe there&amp;#39;s some middle ground though, together with procedural generation to reduce the burden of creating assets so devs can focus on creating the actual games. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdezrc", "score_hidden": true, "stickied": false, "created": 1492460796.0, "created_utc": 1492431996.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgehqp1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AbsoluteRunner", "parent_id": "t1_dgdlpsl", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Is there a specific reason why they do this? If I had to guess it would be that consoles are too weak to use a general engine and have graphics like horizon. But I really don't know. Maybe it's just habit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there a specific reason why they do this? If I had to guess it would be that consoles are too weak to use a general engine and have graphics like horizon. But I really don&amp;#39;t know. Maybe it&amp;#39;s just habit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgehqp1", "score_hidden": true, "stickied": false, "created": 1492508739.0, "created_utc": 1492479939.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlpsl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ineffiable", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "It will really help if devs didn't stop churning out game engines only to use them for a game or two before going back and reworking it a lot.\n\nSo more consistent game engines and platforms in the future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It will really help if devs didn&amp;#39;t stop churning out game engines only to use them for a game or two before going back and reworking it a lot.&lt;/p&gt;\n\n&lt;p&gt;So more consistent game engines and platforms in the future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdlpsl", "score_hidden": true, "stickied": false, "created": 1492470894.0, "created_utc": 1492442094.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdo14n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Samuris27", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I would say that a large part of it is increasing demand for more content at higher graphical fidelity on average. Hear me out.\n\nGames on systems like Sega Dreamcast, Gamecube, PS1, PS2, Original XBOX. Look at all of those, all of them would be unacceptable by today's standards (graphically that is). If you don't believe me, play some game like Horizon: Zero Dawn, then go back to the original Halo 2 on XBOX, and let me know if you think Halo 2 would stack up to current gen games. \n\nAs gamers demand more... visually stunning games (lack of a better term here), the amount of work needed to bring these games up to an ever increasing bar increases immensely. Where before you could have maybe 10 guys doing all the character models and backgrounds, now you likely need 10x that (not exact by any means, just trying to show a trend).\n\nSmaller developers cannot hope to meet these increasing graphical demands, and it is generally rare to see the average gamer these days give most \"indie\" or small budget games the time of day. that is, unless you market it to a certain niche like retro side scrollers or horror puzzle games etc. And even then, most will only buy these games on reduced prices (steam sale anyone?). \n\nIt is a very special game that can avoid getting thrown to the side because it doesn't run at 4k 60 fps these days. At least in my view. Also, the price of failure is much higher for a smaller dev where one bad selling game can literally be the difference between keeping the lights on and bankruptcy. Larger developers don't necessarily have this issue because they have so many franchises that they field.\n\nSo I'd say that many games sell these days because they look good. Or have a unique style that the company markets successfully. Smaller devs likely don't even have the money to market as aggressively as their larger counterparts.\n\nI would say increasing graphical demand while also demanding that hardware/videogame prices be reasonable are the reason why we start seeing a lot of trends in gaming, like the gradual loss of couch coop, and more incomplete games that are fleshed out with paid DLC. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say that a large part of it is increasing demand for more content at higher graphical fidelity on average. Hear me out.&lt;/p&gt;\n\n&lt;p&gt;Games on systems like Sega Dreamcast, Gamecube, PS1, PS2, Original XBOX. Look at all of those, all of them would be unacceptable by today&amp;#39;s standards (graphically that is). If you don&amp;#39;t believe me, play some game like Horizon: Zero Dawn, then go back to the original Halo 2 on XBOX, and let me know if you think Halo 2 would stack up to current gen games. &lt;/p&gt;\n\n&lt;p&gt;As gamers demand more... visually stunning games (lack of a better term here), the amount of work needed to bring these games up to an ever increasing bar increases immensely. Where before you could have maybe 10 guys doing all the character models and backgrounds, now you likely need 10x that (not exact by any means, just trying to show a trend).&lt;/p&gt;\n\n&lt;p&gt;Smaller developers cannot hope to meet these increasing graphical demands, and it is generally rare to see the average gamer these days give most &amp;quot;indie&amp;quot; or small budget games the time of day. that is, unless you market it to a certain niche like retro side scrollers or horror puzzle games etc. And even then, most will only buy these games on reduced prices (steam sale anyone?). &lt;/p&gt;\n\n&lt;p&gt;It is a very special game that can avoid getting thrown to the side because it doesn&amp;#39;t run at 4k 60 fps these days. At least in my view. Also, the price of failure is much higher for a smaller dev where one bad selling game can literally be the difference between keeping the lights on and bankruptcy. Larger developers don&amp;#39;t necessarily have this issue because they have so many franchises that they field.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;d say that many games sell these days because they look good. Or have a unique style that the company markets successfully. Smaller devs likely don&amp;#39;t even have the money to market as aggressively as their larger counterparts.&lt;/p&gt;\n\n&lt;p&gt;I would say increasing graphical demand while also demanding that hardware/videogame prices be reasonable are the reason why we start seeing a lot of trends in gaming, like the gradual loss of couch coop, and more incomplete games that are fleshed out with paid DLC. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdo14n", "score_hidden": true, "stickied": false, "created": 1492473577.0, "created_utc": 1492444777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdt5ne", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "derpderp3200", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Something that is never going to happen, cooperation/open-sourcing assets such as textures and audio and creation of tools that allow quicker iteration using them. The amount of work that goes into creating and using PBR textures, mocap, high quality audio, is massive. The fact that all of bots has to be, and is done for every single game drives the costs up massively. That and procedural assistance tools for creating or modifying content and assets more rapidly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something that is never going to happen, cooperation/open-sourcing assets such as textures and audio and creation of tools that allow quicker iteration using them. The amount of work that goes into creating and using PBR textures, mocap, high quality audio, is massive. The fact that all of bots has to be, and is done for every single game drives the costs up massively. That and procedural assistance tools for creating or modifying content and assets more rapidly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdt5ne", "score_hidden": true, "stickied": false, "created": 1492479302.0, "created_utc": 1492450502.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65td8a", "likes": null, "replies": "", "user_reports": [], "id": "dgdyn6w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdup52", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Dark Souls is really surprising me for me as well. It had everything to be buried and forgotten (and almost did you Demon's Souls), but the destiny helped it to be what it is today.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dark Souls is really surprising me for me as well. It had everything to be buried and forgotten (and almost did you Demon&amp;#39;s Souls), but the destiny helped it to be what it is today.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdyn6w", "score_hidden": true, "stickied": false, "created": 1492485442.0, "created_utc": 1492456642.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdup52", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CzarSquid", "parent_id": "t1_dgdem1p", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "While the 2 is definitely true, the market for tight gameplay does exist. Dark Souls is unusual because it really shouldn't of been popular but managed to be both an AAA with good gameplay. Heck, Monster Hunter for the 3DS is the biggest 3rd party game series.\n\nThe big problem I see is a majority of people want easy games that are very flashy. Sells many more copies than skill based gameplay. This won't change but I'm glad some do against the trend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While the 2 is definitely true, the market for tight gameplay does exist. Dark Souls is unusual because it really shouldn&amp;#39;t of been popular but managed to be both an AAA with good gameplay. Heck, Monster Hunter for the 3DS is the biggest 3rd party game series.&lt;/p&gt;\n\n&lt;p&gt;The big problem I see is a majority of people want easy games that are very flashy. Sells many more copies than skill based gameplay. This won&amp;#39;t change but I&amp;#39;m glad some do against the trend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdup52", "score_hidden": true, "stickied": false, "created": 1492480986.0, "created_utc": 1492452186.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdem1p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t3_65td8a", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "For me, there are two main reasons for this problem.\n\n1 - The devs already spoiled gamers with this. The majority of gamers today don't care about a fine tuned gameplay or balance. Unfortunately, they care about story. They care about being emotionally invested in the game. And that comes with the cost of having photorealistic graphics. I mean, there are some games that can achieve their goal without it, but the \"safe\" approach is to use it;\n\n2 - Which is just a consequence of 1. The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them. On the other hand, mediocre gameplay experiences with great graphical quality like Uncharted or The Last Of Us, are praised up and down. \n\n\nIn all honesty, I don't see the scenario changing very soon. Changing to more gameplay based experiences would kill the interest and sales, so is a very complicated situation for the devs.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me, there are two main reasons for this problem.&lt;/p&gt;\n\n&lt;p&gt;1 - The devs already spoiled gamers with this. The majority of gamers today don&amp;#39;t care about a fine tuned gameplay or balance. Unfortunately, they care about story. They care about being emotionally invested in the game. And that comes with the cost of having photorealistic graphics. I mean, there are some games that can achieve their goal without it, but the &amp;quot;safe&amp;quot; approach is to use it;&lt;/p&gt;\n\n&lt;p&gt;2 - Which is just a consequence of 1. The amount of casual players in the gaming industry today is mindblowing. So, a game like Super Meat Boy or Salt &amp;amp; Sanctuary, which have one of the most fine tuned gameplay of recent times but stylized graphics, will mostly get unnoticed by them. On the other hand, mediocre gameplay experiences with great graphical quality like Uncharted or The Last Of Us, are praised up and down. &lt;/p&gt;\n\n&lt;p&gt;In all honesty, I don&amp;#39;t see the scenario changing very soon. Changing to more gameplay based experiences would kill the interest and sales, so is a very complicated situation for the devs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdem1p", "score_hidden": true, "stickied": false, "created": 1492460013.0, "created_utc": 1492431213.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]