[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One case that stands out for me is No Man&amp;#39;s Sky, since it was a game that I waited for a long time. Being a space enthusiast, I was excited with the possibility of travelling to another galaxies, exploring space and having fights there, and also exploring planets and places that I know that no other people in the history of earth would be able to find.&lt;/p&gt;\n\n&lt;p&gt;I preordered the game and then the truth came out. The planets were nothing more than a vast desert with copy/past stations all over the place. The space fights were extremely boring and badly implemented, and after three or four hours of gameplay, you could see that there was nothing else to do other than pointless exploration.&lt;/p&gt;\n\n&lt;p&gt;Then, almost one year after the launch, the game is receiving a lot of patches and updates. Is now possible to build bases, the exploration and mining appears to be improved and what not.&lt;/p&gt;\n\n&lt;p&gt;But somehow, since the week of launch, I just can&amp;#39;t get myself to play it again. The impact it made was so big that it simply made me totally lose interest in it.&lt;/p&gt;\n\n&lt;p&gt;So, I&amp;#39;m asking this question mainly because of No Man&amp;#39;s Sky, but would love to hear about other cases and experiences of yours. Have you had similar cases?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "One case that stands out for me is No Man's Sky, since it was a game that I waited for a long time. Being a space enthusiast, I was excited with the possibility of travelling to another galaxies, exploring space and having fights there, and also exploring planets and places that I know that no other people in the history of earth would be able to find.\n\nI preordered the game and then the truth came out. The planets were nothing more than a vast desert with copy/past stations all over the place. The space fights were extremely boring and badly implemented, and after three or four hours of gameplay, you could see that there was nothing else to do other than pointless exploration.\n\nThen, almost one year after the launch, the game is receiving a lot of patches and updates. Is now possible to build bases, the exploration and mining appears to be improved and what not.\n\nBut somehow, since the week of launch, I just can't get myself to play it again. The impact it made was so big that it simply made me totally lose interest in it.\n\nSo, I'm asking this question mainly because of No Man's Sky, but would love to hear about other cases and experiences of yours. Have you had similar cases?\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vktc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "LyzbietCorwi", "saved": false, "mod_reports": [], "name": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65vktc/do_you_think_that_a_good_post_launch_support_can/", "num_reports": null, "locked": false, "stickied": false, "created": 1492464972.0, "url": "https://www.reddit.com/r/truegaming/comments/65vktc/do_you_think_that_a_good_post_launch_support_can/", "author_flair_text": null, "quarantine": false, "title": "Do you think that a good post launch support can save an otherwise horrendous launch or the damage is already beyond repair?", "created_utc": 1492436172.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdyvyn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdqnqi", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Ubisoft seems to be a master in having the both cases: With R6 they started bad as you said and got better.\n\nWith The Division and For Honor, they've had a great start but started making the wrong decisions really fast.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ubisoft seems to be a master in having the both cases: With R6 they started bad as you said and got better.&lt;/p&gt;\n\n&lt;p&gt;With The Division and For Honor, they&amp;#39;ve had a great start but started making the wrong decisions really fast.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdyvyn", "score_hidden": true, "stickied": false, "created": 1492485721.0, "created_utc": 1492456921.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqnqi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rptroop", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think Rainbow Six: Siege might be a good example. The game seemed kinda DOA as it didn't really live up to the hype, and didn't seem like it was grasping an immediate audience.\nThen they hit their stride with content updates, got into the public eye, and bam now it's doing fantastically.\n\nEdit: phone typos", "edited": 1492472382.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Rainbow Six: Siege might be a good example. The game seemed kinda DOA as it didn&amp;#39;t really live up to the hype, and didn&amp;#39;t seem like it was grasping an immediate audience.\nThen they hit their stride with content updates, got into the public eye, and bam now it&amp;#39;s doing fantastically.&lt;/p&gt;\n\n&lt;p&gt;Edit: phone typos&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdqnqi", "score_hidden": true, "stickied": false, "created": 1492476518.0, "created_utc": 1492447718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdlgd7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SilverFirePrime", "parent_id": "t1_dgdiybe", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "The big difference between D3 and No Man's Sky is that with D3 is how the developer--player relationships stood after launch,\n\nWith D3 the player--developer bond was strained, it was not broken .\n\n A lot of people were burned by D3, put off by the acution house, hosed by the DRM, and more.  These people put who knows how much into their PCs, let alone the cost of the game, so I can completely understand why they didn't want anyting to do after that.  However, the core aspect of the game was in tact, and when it worked it was beautiful.\n\nAs patches came long Blizzard  was able to clean up a lot and have been add in a lot of extra content. receptive to the changes, and there have been people who said 'I'm not going to deal with this headache right now' have joined in as well.now that all the headaches have been removed.\n\nWith No Many's Sky,  so many promises were not kept that broke the player--developer relationship beyond the point of return.  It was so hyped and then delievered so little that it just feels wrong to a lot of people supporting the game right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The big difference between D3 and No Man&amp;#39;s Sky is that with D3 is how the developer--player relationships stood after launch,&lt;/p&gt;\n\n&lt;p&gt;With D3 the player--developer bond was strained, it was not broken .&lt;/p&gt;\n\n&lt;p&gt;A lot of people were burned by D3, put off by the acution house, hosed by the DRM, and more.  These people put who knows how much into their PCs, let alone the cost of the game, so I can completely understand why they didn&amp;#39;t want anyting to do after that.  However, the core aspect of the game was in tact, and when it worked it was beautiful.&lt;/p&gt;\n\n&lt;p&gt;As patches came long Blizzard  was able to clean up a lot and have been add in a lot of extra content. receptive to the changes, and there have been people who said &amp;#39;I&amp;#39;m not going to deal with this headache right now&amp;#39; have joined in as well.now that all the headaches have been removed.&lt;/p&gt;\n\n&lt;p&gt;With No Many&amp;#39;s Sky,  so many promises were not kept that broke the player--developer relationship beyond the point of return.  It was so hyped and then delievered so little that it just feels wrong to a lot of people supporting the game right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdlgd7", "score_hidden": true, "stickied": false, "created": 1492470575.0, "created_utc": 1492441775.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdiybe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LyzbietCorwi", "parent_id": "t1_dgdinoc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Diablo 3 is a good example because I only got the good part of it. I've played for the first time after the Reaper Of Souls versions was out there, but always thought it was funny that people still kept bashing it for past problems since they were gone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Diablo 3 is a good example because I only got the good part of it. I&amp;#39;ve played for the first time after the Reaper Of Souls versions was out there, but always thought it was funny that people still kept bashing it for past problems since they were gone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdiybe", "score_hidden": true, "stickied": false, "created": 1492467315.0, "created_utc": 1492438515.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdy89q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "the_dayman", "parent_id": "t1_dgdinoc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Personally, it just depends on when I played it.  I played Arkham Knight this month and it was probably one of my favorite games of they year.  I honestly forget when I see people trashing it online that it had such a bad launch... but hurt reputations to the publisher aside, I don't really care since it didn't affect me.\n\nOn the other hand, even if a game gets amazing post launch support, there's no going back for me.  Even if they added a ton of new stuff that would interest me, I've got so many other games on the backlog that it's just not worth it.  I've already seen the plot / tried the mechanics etc whatever the \"core\" of the game is.  No matter how much it's touched up I would just be too bored to revisit it for a better version, even if it's now in a version I would have originally liked.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, it just depends on when I played it.  I played Arkham Knight this month and it was probably one of my favorite games of they year.  I honestly forget when I see people trashing it online that it had such a bad launch... but hurt reputations to the publisher aside, I don&amp;#39;t really care since it didn&amp;#39;t affect me.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, even if a game gets amazing post launch support, there&amp;#39;s no going back for me.  Even if they added a ton of new stuff that would interest me, I&amp;#39;ve got so many other games on the backlog that it&amp;#39;s just not worth it.  I&amp;#39;ve already seen the plot / tried the mechanics etc whatever the &amp;quot;core&amp;quot; of the game is.  No matter how much it&amp;#39;s touched up I would just be too bored to revisit it for a better version, even if it&amp;#39;s now in a version I would have originally liked.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdy89q", "score_hidden": true, "stickied": false, "created": 1492484971.0, "created_utc": 1492456171.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdinoc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Procrastinare", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "For some people a game can be salvaged. Patches, support, expansions, and a caring development team can bring a game back from the dead.\n\nFor a lot of people the condition on launch day is never forgotten and never forgiven. They will dwell on what was wrong from now on and even discussing the improvements will be met with scorn. These players will never give any initially flawed game another chance. \"It's too little, too late.\"\n\nDiablo 3 is a pretty decent example. Just typing \"Diablo 3\" is going to rustle a lot of jimmies. That games launch was very controversial. Even though there's been a fuckton of patches and an expansion released that fixed a lot of the complaints, the early reputation is permanent and those who fully embraced the hate will never let it go. It's never going to be perfect, therefore there will always be a number of problems to point at to justify continuation of disappointment. And even if it became a perfect game, \"too little, too late\" will override their enjoyment. \"Why couldn't they have just launched it like this?! How hard was this?!\"\n\nFor some people hatred of a game is permanent once they've been wronged. Even if all of their demands were met and even exceeded there's simply no going back. For these people no amount of developer time is going to matter. They will hold a grudge from now until the end of time, justified or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For some people a game can be salvaged. Patches, support, expansions, and a caring development team can bring a game back from the dead.&lt;/p&gt;\n\n&lt;p&gt;For a lot of people the condition on launch day is never forgotten and never forgiven. They will dwell on what was wrong from now on and even discussing the improvements will be met with scorn. These players will never give any initially flawed game another chance. &amp;quot;It&amp;#39;s too little, too late.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Diablo 3 is a pretty decent example. Just typing &amp;quot;Diablo 3&amp;quot; is going to rustle a lot of jimmies. That games launch was very controversial. Even though there&amp;#39;s been a fuckton of patches and an expansion released that fixed a lot of the complaints, the early reputation is permanent and those who fully embraced the hate will never let it go. It&amp;#39;s never going to be perfect, therefore there will always be a number of problems to point at to justify continuation of disappointment. And even if it became a perfect game, &amp;quot;too little, too late&amp;quot; will override their enjoyment. &amp;quot;Why couldn&amp;#39;t they have just launched it like this?! How hard was this?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For some people hatred of a game is permanent once they&amp;#39;ve been wronged. Even if all of their demands were met and even exceeded there&amp;#39;s simply no going back. For these people no amount of developer time is going to matter. They will hold a grudge from now until the end of time, justified or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdinoc", "score_hidden": true, "stickied": false, "created": 1492466907.0, "created_utc": 1492438107.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dge3ca0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EdEmKay", "parent_id": "t1_dgdrinv", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "yeah like no matter how the politics or dev cycles or pressure or whatever works, what you release is what you deem releasable. unless you come out and say \"look, we have no choice but to release it in this state, we're on top of it, don't play it yet\" which *never* happens, then it's obviously first instinct to assume that the developer deemed the broken state of the game as its final state. a AAA release isn't some early access idea you can throw up on kickstarter or steam and just keep the players in the loop on your blog, you're a company of artists creating something we're buying, but releasing it unfinished and scrambling to finish it later once they have your money. that deserves critique and i don't think it's a reviewer's responsibility to ignore negatives in a game over the promise of a later fix. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah like no matter how the politics or dev cycles or pressure or whatever works, what you release is what you deem releasable. unless you come out and say &amp;quot;look, we have no choice but to release it in this state, we&amp;#39;re on top of it, don&amp;#39;t play it yet&amp;quot; which &lt;em&gt;never&lt;/em&gt; happens, then it&amp;#39;s obviously first instinct to assume that the developer deemed the broken state of the game as its final state. a AAA release isn&amp;#39;t some early access idea you can throw up on kickstarter or steam and just keep the players in the loop on your blog, you&amp;#39;re a company of artists creating something we&amp;#39;re buying, but releasing it unfinished and scrambling to finish it later once they have your money. that deserves critique and i don&amp;#39;t think it&amp;#39;s a reviewer&amp;#39;s responsibility to ignore negatives in a game over the promise of a later fix. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge3ca0", "score_hidden": true, "stickied": false, "created": 1492490720.0, "created_utc": 1492461920.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrinv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GrummelNet", "parent_id": "t1_dgdkyz7", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Especially when they charge (or overcharge) for the fix. Like Destiny had a terrible launch and ended up having very repetitive content and I ended up hating the game. Everyone I knew that played it said the taken king expansion fixed nearly every problem I had with the game but I would have had to spend $60 to get it whether or not I already had the game. Sure they fixed the game but the player they burned won't appreciate it if they don't let them do it for s fair price.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Especially when they charge (or overcharge) for the fix. Like Destiny had a terrible launch and ended up having very repetitive content and I ended up hating the game. Everyone I knew that played it said the taken king expansion fixed nearly every problem I had with the game but I would have had to spend $60 to get it whether or not I already had the game. Sure they fixed the game but the player they burned won&amp;#39;t appreciate it if they don&amp;#39;t let them do it for s fair price.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdrinv", "score_hidden": true, "stickied": false, "created": 1492477475.0, "created_utc": 1492448675.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkyz7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bangersss", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I don't think a game with a terrible launch can ever reach the same potential it would have if it had a flawless launch, no matter how much support it receives after launch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think a game with a terrible launch can ever reach the same potential it would have if it had a flawless launch, no matter how much support it receives after launch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdkyz7", "score_hidden": true, "stickied": false, "created": 1492469972.0, "created_utc": 1492441172.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdtkxe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ProNewbie", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Games can be saved from bad launches. Battlefield 4 was a horrible broken mess at launch and was heavily patched to fix it. Diablo 3 was a a mess at launch and had a very poorly implemented AH, it was completely turned around with heavy patching and RoS. Though I have no personal experience with it Rainbow Six Siege was a buggy mess at launch with a lot of hacking that was also fixed through heavy patching and continued support. So yes games can be saved from messy launches.\n\nI'm a bit skeptical about No Man's Sky being able to save itself though. The thing with the games mentioned above is the devs of those games didn't outright lie prior to their games launching. They had bugs and they didn't implement things correctly or perfectly, but they didn't lie about what their games were. Now people can start arguing and splitting hairs about that all they want. The problem I see with No Man's Sky is they flat out lied about features of their game. Sean Murray flat out lied in interviews about things that would or would not be in game. That is a hard wound to heal. People don't like being lied to, it immediately degrades trust and crushes any sort of foundation that could have been laid for trust. So even if they do patch the game and add a ton of new features they did far more damage than just launching a broken game they launched a lie and expected it to be ok. If they do turn it around and they regain their public image and everything works out awesome, I will be extremely surprised though if it works in their favor. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Games can be saved from bad launches. Battlefield 4 was a horrible broken mess at launch and was heavily patched to fix it. Diablo 3 was a a mess at launch and had a very poorly implemented AH, it was completely turned around with heavy patching and RoS. Though I have no personal experience with it Rainbow Six Siege was a buggy mess at launch with a lot of hacking that was also fixed through heavy patching and continued support. So yes games can be saved from messy launches.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a bit skeptical about No Man&amp;#39;s Sky being able to save itself though. The thing with the games mentioned above is the devs of those games didn&amp;#39;t outright lie prior to their games launching. They had bugs and they didn&amp;#39;t implement things correctly or perfectly, but they didn&amp;#39;t lie about what their games were. Now people can start arguing and splitting hairs about that all they want. The problem I see with No Man&amp;#39;s Sky is they flat out lied about features of their game. Sean Murray flat out lied in interviews about things that would or would not be in game. That is a hard wound to heal. People don&amp;#39;t like being lied to, it immediately degrades trust and crushes any sort of foundation that could have been laid for trust. So even if they do patch the game and add a ton of new features they did far more damage than just launching a broken game they launched a lie and expected it to be ok. If they do turn it around and they regain their public image and everything works out awesome, I will be extremely surprised though if it works in their favor. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdtkxe", "score_hidden": true, "stickied": false, "created": 1492479764.0, "created_utc": 1492450964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdki4k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jaehael", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Maybe it can be saved in the sense that a bad game can become a good game via patching, like FF XIV did, but undoing the bad press NMS got is nigh impossible. \n\nEven now, I still feel the features being implemented in the game should have already been there at launch, and that the devs would have to go above and beyond if they want their game to be 'accepted' as a good game by the masses.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe it can be saved in the sense that a bad game can become a good game via patching, like FF XIV did, but undoing the bad press NMS got is nigh impossible. &lt;/p&gt;\n\n&lt;p&gt;Even now, I still feel the features being implemented in the game should have already been there at launch, and that the devs would have to go above and beyond if they want their game to be &amp;#39;accepted&amp;#39; as a good game by the masses.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdki4k", "score_hidden": true, "stickied": false, "created": 1492469384.0, "created_utc": 1492440584.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdouvr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Leviafun365", "parent_id": "t1_dgdorok", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&lt;_&lt;", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;lt;_&amp;lt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdouvr", "score_hidden": true, "stickied": false, "created": 1492474522.0, "created_utc": 1492445722.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdorok", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgdomtz", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdorok", "score_hidden": true, "stickied": false, "created": 1492474421.0, "created_utc": 1492445621.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdomtz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Leviafun365", "parent_id": "t1_dgdnh6y", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Oh, I love the game just fine but ninnies like you who have to take it so personally when people don't care for something the same way you do just get me pissed.\n\nCan you imagine for a second, somebody trying to convince you of something by insulting you and your tastes at the same time? I doubt you'd have your mind changed.\n\nSo stuff it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I love the game just fine but ninnies like you who have to take it so personally when people don&amp;#39;t care for something the same way you do just get me pissed.&lt;/p&gt;\n\n&lt;p&gt;Can you imagine for a second, somebody trying to convince you of something by insulting you and your tastes at the same time? I doubt you&amp;#39;d have your mind changed.&lt;/p&gt;\n\n&lt;p&gt;So stuff it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdomtz", "score_hidden": true, "stickied": false, "created": 1492474266.0, "created_utc": 1492445466.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgduslz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Samuris27", "parent_id": "t1_dgdt010", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I guess my issue with this is that the game didn't really make me feel like we were actively looking for an alternative. What if (unlikely yes, but not impossible) all the remnant vaults were to suddenly go into standby? Is the initiative actively trying to reverse engineer terraforming tech? \n\nGranted it may be as simple as stating that the initiative is still too much of a fledgling effort to consider this. But it just sees to be open ended with no hint as to what next.\n\nThe angle that I am taking is that I personally like at least an indication of next steps for open points. Like in ME1, the main point at the end was that Shepard is going to find the reapers. But it may be unfair to compare Andromeda to ME1", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess my issue with this is that the game didn&amp;#39;t really make me feel like we were actively looking for an alternative. What if (unlikely yes, but not impossible) all the remnant vaults were to suddenly go into standby? Is the initiative actively trying to reverse engineer terraforming tech? &lt;/p&gt;\n\n&lt;p&gt;Granted it may be as simple as stating that the initiative is still too much of a fledgling effort to consider this. But it just sees to be open ended with no hint as to what next.&lt;/p&gt;\n\n&lt;p&gt;The angle that I am taking is that I personally like at least an indication of next steps for open points. Like in ME1, the main point at the end was that Shepard is going to find the reapers. But it may be unfair to compare Andromeda to ME1&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgduslz", "score_hidden": true, "stickied": false, "created": 1492481094.0, "created_utc": 1492452294.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdt010", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vhin", "parent_id": "t1_dgdrjrz", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "As a minor addition:\n\n&gt; Why do we suddenly trust that we can use their tech and it won't betray as some time down the road, considering that everything remnant wants to kill us if we get too close?\n\nWhat exactly is the alternative? The planets are not inhabitable. Yes, it's a risk to rely so heavily on the vaults to be able to survive/thrive in Heleus, but the only other choice would be to slowly run out of supplies and die on the Nexus.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a minor addition:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why do we suddenly trust that we can use their tech and it won&amp;#39;t betray as some time down the road, considering that everything remnant wants to kill us if we get too close?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What exactly is the alternative? The planets are not inhabitable. Yes, it&amp;#39;s a risk to rely so heavily on the vaults to be able to survive/thrive in Heleus, but the only other choice would be to slowly run out of supplies and die on the Nexus.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdt010", "score_hidden": true, "stickied": false, "created": 1492479130.0, "created_utc": 1492450330.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrjrz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Samuris27", "parent_id": "t1_dgdpvvk", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Thanks! I appreciate a level-headed response here truly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! I appreciate a level-headed response here truly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdrjrz", "score_hidden": true, "stickied": false, "created": 1492477510.0, "created_utc": 1492448710.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpvvk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Leviafun365", "parent_id": "t1_dgdok5h", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; What about the Scourge?\n\nSpeculated to be a superweapon used against the Jaardan by an unknown enemy, or an experiment created by the Jaardan that went horribly wrong.\n\n&gt; What's the resolution?\n\nAs of now, there's no indication the Scourge can be countered or destroyed. \n\n&gt; What about the Kett power dynamic?\n\nThe Archon of a sector (Ex. the one you face in Helius) answers directly to the Senate that resides on the Kett homeworld where the main empire resides. The Primus acts as an Archons second-in-command, with the Archons Sword being the chief enforcer.\n\n&gt; Why weren't we able to use that more to our advantage?\n\nYou sorta get the chance when The Primus offers you a killcode to her ship in an effort to give you more safer passage to kill The Archon that she deemed to be a heretic and traitor to their true purpose in Helius: Exaltation.\n\n&gt; Why is it that almost all the milky way races will be in this game even though it's a new galaxy and the best they could come up with were the Angara, the kett and a bunch of wild beasts on certain planets\n\nArks are the fastest answer to why many Milky Way races are coming over. But other Milky Races that were Non-Council races such as Batarians, Vorcha, Yahg, Geth, and drones such as the Keepers are heavily implied to not be onboard with the Initiative at all.\n\nThe Kett spread themselves thin throughout many Andromeda clusters to seek out and convert sentient races into themselves because they lack any reproductive capabilities and see religious meaning in it. The Angara are the main inhabitant of the Helius Cluster. The lack of Mass Relays in Andromeda bring out an reality that many intelligent alien species are just simply too isolated and far apart from each other to make contact.\n\n&gt; What about the nature of the remnant?\n\nThey are Jaardan security drones that more or less protect what remains of their legacy. I can't recall if it went any deeper than that.\n\n&gt; Why do we suddenly trust that we can use their tech and it won't betray as some time down the road, considering that everything remnant wants to kill us if we get too close?\n\nWith Meridian being the central control hub for all Remnant technology in Helius and now under Initiative control, it makes sense that we'd be more comfortable using tech we now know we have direct access to and can understand overtime.\n\n&gt; How did we suddenly be able to understand Kett and Angara, with a teensy bit of first contact?\n\nTranslation technology has been present in all ME games, and it appears to be able to seamlessly break down language barriers into something the user can comprehend. I will admit, it was done rather fast in the Angara's case during first contact so I'm not entirely sure how advanced these implants are.\n\n&gt; Would you be able to take a character seriously that says her dad is dead with a huge smile on her face?\n\nBioware couldn't have made the default for Sara Ryder to look more derp-tacular if they tried. I just customized my Ryder and it became a non-issue.\n\nWhoo... hope that helped out a bit, though.\n", "edited": 1492447081.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What about the Scourge?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Speculated to be a superweapon used against the Jaardan by an unknown enemy, or an experiment created by the Jaardan that went horribly wrong.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What&amp;#39;s the resolution?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As of now, there&amp;#39;s no indication the Scourge can be countered or destroyed. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What about the Kett power dynamic?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Archon of a sector (Ex. the one you face in Helius) answers directly to the Senate that resides on the Kett homeworld where the main empire resides. The Primus acts as an Archons second-in-command, with the Archons Sword being the chief enforcer.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why weren&amp;#39;t we able to use that more to our advantage?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You sorta get the chance when The Primus offers you a killcode to her ship in an effort to give you more safer passage to kill The Archon that she deemed to be a heretic and traitor to their true purpose in Helius: Exaltation.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why is it that almost all the milky way races will be in this game even though it&amp;#39;s a new galaxy and the best they could come up with were the Angara, the kett and a bunch of wild beasts on certain planets&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Arks are the fastest answer to why many Milky Way races are coming over. But other Milky Races that were Non-Council races such as Batarians, Vorcha, Yahg, Geth, and drones such as the Keepers are heavily implied to not be onboard with the Initiative at all.&lt;/p&gt;\n\n&lt;p&gt;The Kett spread themselves thin throughout many Andromeda clusters to seek out and convert sentient races into themselves because they lack any reproductive capabilities and see religious meaning in it. The Angara are the main inhabitant of the Helius Cluster. The lack of Mass Relays in Andromeda bring out an reality that many intelligent alien species are just simply too isolated and far apart from each other to make contact.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What about the nature of the remnant?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They are Jaardan security drones that more or less protect what remains of their legacy. I can&amp;#39;t recall if it went any deeper than that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why do we suddenly trust that we can use their tech and it won&amp;#39;t betray as some time down the road, considering that everything remnant wants to kill us if we get too close?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;With Meridian being the central control hub for all Remnant technology in Helius and now under Initiative control, it makes sense that we&amp;#39;d be more comfortable using tech we now know we have direct access to and can understand overtime.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;How did we suddenly be able to understand Kett and Angara, with a teensy bit of first contact?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Translation technology has been present in all ME games, and it appears to be able to seamlessly break down language barriers into something the user can comprehend. I will admit, it was done rather fast in the Angara&amp;#39;s case during first contact so I&amp;#39;m not entirely sure how advanced these implants are.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Would you be able to take a character seriously that says her dad is dead with a huge smile on her face?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Bioware couldn&amp;#39;t have made the default for Sara Ryder to look more derp-tacular if they tried. I just customized my Ryder and it became a non-issue.&lt;/p&gt;\n\n&lt;p&gt;Whoo... hope that helped out a bit, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdpvvk", "score_hidden": true, "stickied": false, "created": 1492475667.0, "created_utc": 1492446867.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdok5h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Samuris27", "parent_id": "t1_dgdnh6y", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Woah woah woah easy there. I say they dropped the ball because they left a few major plot points open. What about the scourge? What's the resolution? What about the Kett power dynamic? Why weren't we able to use that more to our advantage? Why is it that almost all the milky way races will be in this game even though it's a new galaxy and the best they could come up with were the Angara, the kett and a bunch of wild beasts on certain planets. What about the nature of the remnant? Why do we suddenly trust that we can use their tech and it won't betray as some time down the road, considering that everything remnant wants to kill us if we get too close? How did we suddenly be able to understand Kett and Angara, with a teensy bit of first contact? Considering that every time we need to activate a monolith, we need to scan some set of glyphs. \n\nSurely you agree to my other point that the animation was immersion breaking pre patch. Would you be able to take a character seriously that says her dad is dead with a huge smile on her face?\n\nBut yes I am totally misogynistic dude who prefers to play female Ryder and run with Drack and Jaal because I looove fapping to all the female characters /s. \n\nIf you want to be constructive and respectfully disagree, that's fine. But I sincerely hope you have the capacity to respect me as I will respect you.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woah woah woah easy there. I say they dropped the ball because they left a few major plot points open. What about the scourge? What&amp;#39;s the resolution? What about the Kett power dynamic? Why weren&amp;#39;t we able to use that more to our advantage? Why is it that almost all the milky way races will be in this game even though it&amp;#39;s a new galaxy and the best they could come up with were the Angara, the kett and a bunch of wild beasts on certain planets. What about the nature of the remnant? Why do we suddenly trust that we can use their tech and it won&amp;#39;t betray as some time down the road, considering that everything remnant wants to kill us if we get too close? How did we suddenly be able to understand Kett and Angara, with a teensy bit of first contact? Considering that every time we need to activate a monolith, we need to scan some set of glyphs. &lt;/p&gt;\n\n&lt;p&gt;Surely you agree to my other point that the animation was immersion breaking pre patch. Would you be able to take a character seriously that says her dad is dead with a huge smile on her face?&lt;/p&gt;\n\n&lt;p&gt;But yes I am totally misogynistic dude who prefers to play female Ryder and run with Drack and Jaal because I looove fapping to all the female characters /s. &lt;/p&gt;\n\n&lt;p&gt;If you want to be constructive and respectfully disagree, that&amp;#39;s fine. But I sincerely hope you have the capacity to respect me as I will respect you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdok5h", "score_hidden": true, "stickied": false, "created": 1492474182.0, "created_utc": 1492445382.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdp0ra", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TromboneSmuggler", "parent_id": "t1_dgdnh6y", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Wow, that escalated quickly.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that escalated quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdp0ra", "score_hidden": true, "stickied": false, "created": 1492474703.0, "created_utc": 1492445903.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnh6y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgdmv1r", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "[deleted]", "edited": 1492444697.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdnh6y", "score_hidden": true, "stickied": false, "created": 1492472945.0, "created_utc": 1492444145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmv1r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Samuris27", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "First impressions matter. Alot. One of the most recent examples was Mass Effect Andromeda. Combat was solid, but it is a game that should be, first and foremost, about narrative. \n\nIn terms of Narrative, they dropped the ball. Not just the story, but immersion wise. Game breaking glitches, glitches in quests, horrendous and same-ey character animations. This is arguably the reason why Mass Effect Andromeda did not sell nearly as well as EA had hoped. There were too many people who remembered Bioware for the compelling story and the immersive story telling a-la KOTOR, ME1, ME2, and most of ME3. ME Andromeda story is okay, but having great games starts to feed the expectation that each subsequent game needs to be better. \n\nPeople depend on good initial word of mouth to really sway them toward buying a game. Be it friends that tell them or good reviews. When those inital reports come back negative and they see the initial comments on how terrible the game is on preview/gameplay vids. That is damage from which many triple A games would be unable to recover.\n\nEnd of day, first impressions matter. You need to have a well polished game. You need to have a quality base game in order to bring in the crowds. Strike while the iron is hot is a very pertinent phrase for stuff like this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First impressions matter. Alot. One of the most recent examples was Mass Effect Andromeda. Combat was solid, but it is a game that should be, first and foremost, about narrative. &lt;/p&gt;\n\n&lt;p&gt;In terms of Narrative, they dropped the ball. Not just the story, but immersion wise. Game breaking glitches, glitches in quests, horrendous and same-ey character animations. This is arguably the reason why Mass Effect Andromeda did not sell nearly as well as EA had hoped. There were too many people who remembered Bioware for the compelling story and the immersive story telling a-la KOTOR, ME1, ME2, and most of ME3. ME Andromeda story is okay, but having great games starts to feed the expectation that each subsequent game needs to be better. &lt;/p&gt;\n\n&lt;p&gt;People depend on good initial word of mouth to really sway them toward buying a game. Be it friends that tell them or good reviews. When those inital reports come back negative and they see the initial comments on how terrible the game is on preview/gameplay vids. That is damage from which many triple A games would be unable to recover.&lt;/p&gt;\n\n&lt;p&gt;End of day, first impressions matter. You need to have a well polished game. You need to have a quality base game in order to bring in the crowds. Strike while the iron is hot is a very pertinent phrase for stuff like this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdmv1r", "score_hidden": true, "stickied": false, "created": 1492472240.0, "created_utc": 1492443440.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dgdiotp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "moonyeti", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think it can, but not for all audiences.  For those that actually bought the game on release and got burned, often there is no recovering these people.  I have been in that camp myself, where a launch is so bad I can never get into that game again even when things are fixed later.  But there have been loads of times where I waited because I heard about a botched launch.  Later, when things were patched and fixed I would play and enjoy it, but again there would be people burned from the initial release still refusing to play.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it can, but not for all audiences.  For those that actually bought the game on release and got burned, often there is no recovering these people.  I have been in that camp myself, where a launch is so bad I can never get into that game again even when things are fixed later.  But there have been loads of times where I waited because I heard about a botched launch.  Later, when things were patched and fixed I would play and enjoy it, but again there would be people burned from the initial release still refusing to play.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdiotp", "score_hidden": true, "stickied": false, "created": 1492466954.0, "created_utc": 1492438154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65vktc", "likes": null, "replies": "", "user_reports": [], "id": "dge5bve", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Renegade_Meister", "parent_id": "t3_65vktc", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "To sum up other comments that I agree with: On rare occasions, games by AAA pubs or devs have been saved from a bad launch, but nobody could have saved NMS from its train wreck of a launch launch. I'm hard pressed to think of indie game that has been \"saved\".\n\nI don't have personal experience with the \"saved\" games mentioned, but I do have first hand experience &amp; thoughts about why NMS is beyond saving: It has wounded so many pre-existing owners so deeply and alienated most people who heard the hype such that its content &amp; performance updates could never realistically recover a number of new players that exceeds the previously wounded.\n\nNMS new content doesn't make exploration more meaningful or significantly more varied for me personally. Bases and freighters are just a different thing to gather more resources for so that you can have different ways of gathering or storing more resources. The wheeled rover lets me bust through some resources, but other than that I'd just as soon", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To sum up other comments that I agree with: On rare occasions, games by AAA pubs or devs have been saved from a bad launch, but nobody could have saved NMS from its train wreck of a launch launch. I&amp;#39;m hard pressed to think of indie game that has been &amp;quot;saved&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have personal experience with the &amp;quot;saved&amp;quot; games mentioned, but I do have first hand experience &amp;amp; thoughts about why NMS is beyond saving: It has wounded so many pre-existing owners so deeply and alienated most people who heard the hype such that its content &amp;amp; performance updates could never realistically recover a number of new players that exceeds the previously wounded.&lt;/p&gt;\n\n&lt;p&gt;NMS new content doesn&amp;#39;t make exploration more meaningful or significantly more varied for me personally. Bases and freighters are just a different thing to gather more resources for so that you can have different ways of gathering or storing more resources. The wheeled rover lets me bust through some resources, but other than that I&amp;#39;d just as soon&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge5bve", "score_hidden": true, "stickied": false, "created": 1492493032.0, "created_utc": 1492464232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]