[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Are there any games that have universal critical acclaim or a huge devoted fan base that you personally do not enjoy or see the merit in? Over the years there have been a few series/games with much critical/fan praise behind them that I have not been able to get into fully. Some of them off the top of my head:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dark Souls/Bloodborne series&lt;/strong&gt; - I am fully expecting a lot of criticism for including these, as they are pretty much &amp;quot;untouchable&amp;quot; Reddit darlings, but I seriously can&amp;#39;t think of another series that I tried SO hard to like and just couldn&amp;#39;t. I&amp;#39;ve beaten the first Dark Souls, but I honestly found it to be a tedious and frustrating experience with none of the so-called sense of satisfaction and achievement most people claim to be the hallmark of the series. I found the combat dull and repetitive, and the game world vague and obscure to the point where it goes from mysterious and intriguing to lifeless and confusing. level design was good for the first half of the game and took a huge nosedive after Anor Londo. I&amp;#39;ve tried the subsequent games and Bloodborne as well (which I got halfway through), and just never felt like they were all that fun to play. I know I&amp;#39;m in the minority on this sub that don&amp;#39;t like these games, but they just didn&amp;#39;t do it for me&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bioshock series&lt;/strong&gt; - This applies to the two main titles that get the lion&amp;#39;s share of the acclaim - the first game and Infinite. Although they have interesting stories and cool visuals, the boring gameplay really detracts from the experience and I felt that the games find themselves to be more intellectually fulfilling than they actually are. Infinite in particular just felt like a generic FPS with a faux-deep story pasted on top to give it a depth it didn&amp;#39;t really have. These are games that I didn&amp;#39;t think were bad per se - just not up to the standards their reputation would suggest&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Metal Gear Solid 4 and 5&lt;/strong&gt; - let me preface by saying that I don&amp;#39;t have a ton of experience with the MGS games. I&amp;#39;ve played MGS 3 and Peace Walker and that&amp;#39;s it. I&amp;#39;ve heard that 4 and 5 are great games in their own right even if they&amp;#39;re not great MGS games, but I honestly didn&amp;#39;t feel that they were all that exceptional. 4 in particular felt like a step down in complexity from 3 (which I liked a lot), and 5 had one of the worst open worlds I&amp;#39;ve experienced in any big-budget AAA game. It also became very repetitive after the first 20-25 hours. &lt;/p&gt;\n\n&lt;p&gt;Anyway, these are my &amp;quot;don&amp;#39;t see what the hype is about&amp;quot; games/series. Agree? Disagree? Tear me a new one because I don&amp;#39;t like Dark Souls?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Are there any games that have universal critical acclaim or a huge devoted fan base that you personally do not enjoy or see the merit in? Over the years there have been a few series/games with much critical/fan praise behind them that I have not been able to get into fully. Some of them off the top of my head:\n\n**Dark Souls/Bloodborne series** - I am fully expecting a lot of criticism for including these, as they are pretty much \"untouchable\" Reddit darlings, but I seriously can't think of another series that I tried SO hard to like and just couldn't. I've beaten the first Dark Souls, but I honestly found it to be a tedious and frustrating experience with none of the so-called sense of satisfaction and achievement most people claim to be the hallmark of the series. I found the combat dull and repetitive, and the game world vague and obscure to the point where it goes from mysterious and intriguing to lifeless and confusing. level design was good for the first half of the game and took a huge nosedive after Anor Londo. I've tried the subsequent games and Bloodborne as well (which I got halfway through), and just never felt like they were all that fun to play. I know I'm in the minority on this sub that don't like these games, but they just didn't do it for me\n\n**Bioshock series** - This applies to the two main titles that get the lion's share of the acclaim - the first game and Infinite. Although they have interesting stories and cool visuals, the boring gameplay really detracts from the experience and I felt that the games find themselves to be more intellectually fulfilling than they actually are. Infinite in particular just felt like a generic FPS with a faux-deep story pasted on top to give it a depth it didn't really have. These are games that I didn't think were bad per se - just not up to the standards their reputation would suggest\n\n**Metal Gear Solid 4 and 5** - let me preface by saying that I don't have a ton of experience with the MGS games. I've played MGS 3 and Peace Walker and that's it. I've heard that 4 and 5 are great games in their own right even if they're not great MGS games, but I honestly didn't feel that they were all that exceptional. 4 in particular felt like a step down in complexity from 3 (which I liked a lot), and 5 had one of the worst open worlds I've experienced in any big-budget AAA game. It also became very repetitive after the first 20-25 hours. \n\nAnyway, these are my \"don't see what the hype is about\" games/series. Agree? Disagree? Tear me a new one because I don't like Dark Souls?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65whu0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "fabrar", "saved": false, "mod_reports": [], "name": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65whu0/what_are_some_popularcritically_acclaimedcult/", "num_reports": null, "locked": false, "stickied": false, "created": 1492474358.0, "url": "https://www.reddit.com/r/truegaming/comments/65whu0/what_are_some_popularcritically_acclaimedcult/", "author_flair_text": null, "quarantine": false, "title": "What are some popular/critically acclaimed/cult classic games/franchises that you find overrated/don't enjoy?", "created_utc": 1492445558.0, "distinguished": null, "media": null, "upvote_ratio": 0.53, "num_comments": 41, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgeaoot", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tippacanoe", "parent_id": "t1_dgdxqsd", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I absolutely hated that too about Bioshock, how the way to advance you keep having to go somewhere else until you forget why you are even doing what you are in the first place.  In Infinite I remember you have to find the electrical vigor to open some door so you go all over the place and it just seems that the characters would probably find some easier solution. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I absolutely hated that too about Bioshock, how the way to advance you keep having to go somewhere else until you forget why you are even doing what you are in the first place.  In Infinite I remember you have to find the electrical vigor to open some door so you go all over the place and it just seems that the characters would probably find some easier solution. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeaoot", "score_hidden": true, "stickied": false, "created": 1492499849.0, "created_utc": 1492471049.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxqsd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "girlscout-cookies", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "ugh, I love the Bioshock games but I hate playing them. I hate the combat, I hate the level design, I hate how literally half the game is getting to doors and then running around giant buildings to find the things to open the doors, I hate all the stupid hacking minigames in the first game, I hate how goddamn small the text is in infinite, I hate how half the world building is tucked in audio tapes that I can never find, the list goes on and on and on. \n\nbut I think the stories are genius. though I agree they can be a little too enamored with their own cleverness, they garner points in my book for being ambitious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ugh, I love the Bioshock games but I hate playing them. I hate the combat, I hate the level design, I hate how literally half the game is getting to doors and then running around giant buildings to find the things to open the doors, I hate all the stupid hacking minigames in the first game, I hate how goddamn small the text is in infinite, I hate how half the world building is tucked in audio tapes that I can never find, the list goes on and on and on. &lt;/p&gt;\n\n&lt;p&gt;but I think the stories are genius. though I agree they can be a little too enamored with their own cleverness, they garner points in my book for being ambitious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdxqsd", "score_hidden": true, "stickied": false, "created": 1492484420.0, "created_utc": 1492455620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdtbd9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bigvow", "parent_id": "t1_dgdqluz", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "It seems like a lot of Day 1 buyers of Destiny despise the game (rightfully so, the vanilla content is honestly pitiful). But those few who stuck around really enjoyed it. I got the Collection this past Thanksgiving and I've loved it all the way. If I bought it on release I would have probably given up on it like everyone else, but after 2 years of DLC and content drops, the game is chock-full of activities. Even if you don't want to hit max light the game takes a decent amount of time to fully complete. The lore is also amazing, I love the open ended mysteries that have been created (which is also a bit of a shame, since Bungie decided to hide all of it outside of the game).\n\n\n In the end though, Destiny seems to be a game that people either love or hate, there's very few middling opinions. You'll either love the gameplay loop and grind for better gear, or utterly hate the repetitiveness of the endgame.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems like a lot of Day 1 buyers of Destiny despise the game (rightfully so, the vanilla content is honestly pitiful). But those few who stuck around really enjoyed it. I got the Collection this past Thanksgiving and I&amp;#39;ve loved it all the way. If I bought it on release I would have probably given up on it like everyone else, but after 2 years of DLC and content drops, the game is chock-full of activities. Even if you don&amp;#39;t want to hit max light the game takes a decent amount of time to fully complete. The lore is also amazing, I love the open ended mysteries that have been created (which is also a bit of a shame, since Bungie decided to hide all of it outside of the game).&lt;/p&gt;\n\n&lt;p&gt;In the end though, Destiny seems to be a game that people either love or hate, there&amp;#39;s very few middling opinions. You&amp;#39;ll either love the gameplay loop and grind for better gear, or utterly hate the repetitiveness of the endgame.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdtbd9", "score_hidden": true, "stickied": false, "created": 1492479476.0, "created_utc": 1492450676.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdrw8e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kidney05", "parent_id": "t1_dgdr7d3", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "that's exactly how I felt about bioshock infinite-- more exploration of the sky world - columbia I think it's called? -- would have been cooler.  but it turns \"gamey\" so quickly.  t[his trailer showed some stuff that had potential-- scenes where you were talking around, not necessarily shooting at everyone](https://youtu.be/6WUt5dEMt_Y?t=6m12s), and it just feels so much more immersive.  I wanted a game where it actually felt like I was in a \"perfect city\" that had fallen to war and revolution... not just a game where i'm always chased by angry bad guys in every room i walk into.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;that&amp;#39;s exactly how I felt about bioshock infinite-- more exploration of the sky world - columbia I think it&amp;#39;s called? -- would have been cooler.  but it turns &amp;quot;gamey&amp;quot; so quickly.  t&lt;a href=\"https://youtu.be/6WUt5dEMt_Y?t=6m12s\"&gt;his trailer showed some stuff that had potential-- scenes where you were talking around, not necessarily shooting at everyone&lt;/a&gt;, and it just feels so much more immersive.  I wanted a game where it actually felt like I was in a &amp;quot;perfect city&amp;quot; that had fallen to war and revolution... not just a game where i&amp;#39;m always chased by angry bad guys in every room i walk into.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdrw8e", "score_hidden": true, "stickied": false, "created": 1492477899.0, "created_utc": 1492449099.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr7d3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dgdqluz", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yeah, the setting of Bioshock infinite is the best part but it was a missed opportunity because I felt like they could have let the game breathe a little bit and allowed some exploration to add more depth to the world. Instead, I beat the game in like 10-11 hours (and I suck at FPS games) and got through the linear levels pretty easily. No desire to revisit it again.\n\n&gt;in terms of Dark Souls, i'm impressed you played through one of the games. again, the pain to me here in those games is that you're replaying segments over and over every time you lose to a boss. that gets old for me quickly. but I've watched enough dark souls where I can see how it appeals to other people.\n\nYeah, repeating the same sections over and over was painful. I stuck through till the end because I wanted to see what all the hype was about and if it would get better as it went on. But it didn't, and actually got WORSE after a certain point lol. I also tried the newer games - Dark Souls 3 and Bloodborne - but they left me cold as well. Never touching a FromSoftware game ever again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, the setting of Bioshock infinite is the best part but it was a missed opportunity because I felt like they could have let the game breathe a little bit and allowed some exploration to add more depth to the world. Instead, I beat the game in like 10-11 hours (and I suck at FPS games) and got through the linear levels pretty easily. No desire to revisit it again.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;in terms of Dark Souls, i&amp;#39;m impressed you played through one of the games. again, the pain to me here in those games is that you&amp;#39;re replaying segments over and over every time you lose to a boss. that gets old for me quickly. but I&amp;#39;ve watched enough dark souls where I can see how it appeals to other people.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, repeating the same sections over and over was painful. I stuck through till the end because I wanted to see what all the hype was about and if it would get better as it went on. But it didn&amp;#39;t, and actually got WORSE after a certain point lol. I also tried the newer games - Dark Souls 3 and Bloodborne - but they left me cold as well. Never touching a FromSoftware game ever again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdr7d3", "score_hidden": true, "stickied": false, "created": 1492477126.0, "created_utc": 1492448326.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqluz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kidney05", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "[This youtube video more or less sums up how I feel about bioshock infinite](https://www.youtube.com/watch?v=VdNhwb7iuI4).  I try not to judge too many games hard, especially when I haven't played them, but I was actually super excited for Bioshock Infinite because I thought the setting looked brilliant.  turns out, what was about all I liked about the game.  the combat was so basic and repetitive, and no other part of the game was good enough to make up for it.  to me, this is probably the most overrated game in history.  I think it gets a huge pass because of how people felt about the first bioshock.\n\nanother game I played lots of and can't stand is Destiny.  the core shooting is decent, but the game doesn't have a good enough variety of enemies or gameplay actions to make it worth it.  lots of doing the same missions over and over, with little to no variation.  enemies always stay in the same places in the same numbers.  i played that game for something like 70 hours, and i just had to put it away forever.  I couldn't stand doing the same mission with a buddy and his rewards were better than mine, even though I had killed more of the enemies.  I get that having the \"random drops\" of gear can be cool, but to me it would be worthwhile if there were thousands of weapons and they were all vastly different.  instead, it was everyone saving up coins for the same few weapons.  I'm talking about vanilla destiny here-- I won't ever be going back though.\n\nin terms of Dark Souls, i'm impressed you played through one of the games.  again, the pain to me here in those games is that you're replaying segments over and over every time you lose to a boss.  that gets old for me quickly.  but I've watched enough dark souls where I can see how it appeals to other people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=VdNhwb7iuI4\"&gt;This youtube video more or less sums up how I feel about bioshock infinite&lt;/a&gt;.  I try not to judge too many games hard, especially when I haven&amp;#39;t played them, but I was actually super excited for Bioshock Infinite because I thought the setting looked brilliant.  turns out, what was about all I liked about the game.  the combat was so basic and repetitive, and no other part of the game was good enough to make up for it.  to me, this is probably the most overrated game in history.  I think it gets a huge pass because of how people felt about the first bioshock.&lt;/p&gt;\n\n&lt;p&gt;another game I played lots of and can&amp;#39;t stand is Destiny.  the core shooting is decent, but the game doesn&amp;#39;t have a good enough variety of enemies or gameplay actions to make it worth it.  lots of doing the same missions over and over, with little to no variation.  enemies always stay in the same places in the same numbers.  i played that game for something like 70 hours, and i just had to put it away forever.  I couldn&amp;#39;t stand doing the same mission with a buddy and his rewards were better than mine, even though I had killed more of the enemies.  I get that having the &amp;quot;random drops&amp;quot; of gear can be cool, but to me it would be worthwhile if there were thousands of weapons and they were all vastly different.  instead, it was everyone saving up coins for the same few weapons.  I&amp;#39;m talking about vanilla destiny here-- I won&amp;#39;t ever be going back though.&lt;/p&gt;\n\n&lt;p&gt;in terms of Dark Souls, i&amp;#39;m impressed you played through one of the games.  again, the pain to me here in those games is that you&amp;#39;re replaying segments over and over every time you lose to a boss.  that gets old for me quickly.  but I&amp;#39;ve watched enough dark souls where I can see how it appeals to other people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdqluz", "score_hidden": true, "stickied": false, "created": 1492476462.0, "created_utc": 1492447662.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgelwui", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenstake", "parent_id": "t1_dge3592", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Try out Smite. It's the MOBA you've been waiting for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try out Smite. It&amp;#39;s the MOBA you&amp;#39;ve been waiting for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgelwui", "score_hidden": true, "stickied": false, "created": 1492513811.0, "created_utc": 1492485011.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge3592", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DJOkamical", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "**Mortal Kombat**:  Found the art design to be fairly hideous and edgy, and overall I kind of just don't like how soulless each and every character is in this dark, gritty mess of a series.\n___\n**Witcher 3**: Loved the story, loved how well written and designed most of the quests and sidequests were. It's a good game.... but It can't hold my interest for the life of it due to it's boring, repetitive game play and stale main character.\n\n___\n**Most MOBAs**: I just don't like how the camera doesn't stick to the characters in these games. If the camera was locked to everyone's characters and the games were designed around this, I maybe could of ended up liking the genre.\n\n___\n**Mass Effect Series**: I just don't like Sci-Fi games so I'll never give this series a shot.\n\n___\n**Dark Souls 3**: They decided to take my favorite series, and mashed it up with it's hyper-active sister series \"Bloodborne\". Now it's less of a tactical, careful hack n' slash action rpg and more of a fast-paced infuriating brainless hack n' lightspeed slash mess.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Mortal Kombat&lt;/strong&gt;:  Found the art design to be fairly hideous and edgy, and overall I kind of just don&amp;#39;t like how soulless each and every character is in this dark, gritty mess of a series.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Witcher 3&lt;/strong&gt;: Loved the story, loved how well written and designed most of the quests and sidequests were. It&amp;#39;s a good game.... but It can&amp;#39;t hold my interest for the life of it due to it&amp;#39;s boring, repetitive game play and stale main character.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Most MOBAs&lt;/strong&gt;: I just don&amp;#39;t like how the camera doesn&amp;#39;t stick to the characters in these games. If the camera was locked to everyone&amp;#39;s characters and the games were designed around this, I maybe could of ended up liking the genre.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Mass Effect Series&lt;/strong&gt;: I just don&amp;#39;t like Sci-Fi games so I&amp;#39;ll never give this series a shot.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Dark Souls 3&lt;/strong&gt;: They decided to take my favorite series, and mashed it up with it&amp;#39;s hyper-active sister series &amp;quot;Bloodborne&amp;quot;. Now it&amp;#39;s less of a tactical, careful hack n&amp;#39; slash action rpg and more of a fast-paced infuriating brainless hack n&amp;#39; lightspeed slash mess.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge3592", "score_hidden": true, "stickied": false, "created": 1492490503.0, "created_utc": 1492461703.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdzrlm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheGallow", "parent_id": "t1_dgdzkxu", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Ironically, the most I was into that game was when I was playing Gwent.  I ended up forcing myself to stop playing Gwent so I could get more cards and experience the actual game.  \n\nThen I stopped playing the actual game. Sigh.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ironically, the most I was into that game was when I was playing Gwent.  I ended up forcing myself to stop playing Gwent so I could get more cards and experience the actual game.  &lt;/p&gt;\n\n&lt;p&gt;Then I stopped playing the actual game. Sigh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdzrlm", "score_hidden": true, "stickied": false, "created": 1492486723.0, "created_utc": 1492457923.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzkxu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baneofthesmurf", "parent_id": "t1_dgdzgos", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I've always wondered if the people that praise 3 so much are just in it for the gwent and don't want to admit it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always wondered if the people that praise 3 so much are just in it for the gwent and don&amp;#39;t want to admit it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdzkxu", "score_hidden": true, "stickied": false, "created": 1492486514.0, "created_utc": 1492457714.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzgos", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheGallow", "parent_id": "t1_dgdz4z1", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yeah, it's like I said though, Witcher 3 is a good game, but I just can't get into it.  It's weird because it's got everything that I like in a game.  I want to \"have played it\" but can't get myself to \"actually play it\".\nI really can't put my finger on any one cause, I just can't muster the will to play the game for more than a few hours before I want to shelf it for months.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it&amp;#39;s like I said though, Witcher 3 is a good game, but I just can&amp;#39;t get into it.  It&amp;#39;s weird because it&amp;#39;s got everything that I like in a game.  I want to &amp;quot;have played it&amp;quot; but can&amp;#39;t get myself to &amp;quot;actually play it&amp;quot;.\nI really can&amp;#39;t put my finger on any one cause, I just can&amp;#39;t muster the will to play the game for more than a few hours before I want to shelf it for months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdzgos", "score_hidden": true, "stickied": false, "created": 1492486380.0, "created_utc": 1492457580.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdz4z1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baneofthesmurf", "parent_id": "t1_dgdud5o", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I find it interesting that you didn't like Dark Souls because of its lack of story telling, but weren't sucked into any of the Witcher games. To me these games are polar opposites, DS having IMO great gameplay, but little story, and Witcher being fantastic on story/environment, but having gameplay that got stale after the first area. The fact that you don't really like either is somewhat perplexing to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find it interesting that you didn&amp;#39;t like Dark Souls because of its lack of story telling, but weren&amp;#39;t sucked into any of the Witcher games. To me these games are polar opposites, DS having IMO great gameplay, but little story, and Witcher being fantastic on story/environment, but having gameplay that got stale after the first area. The fact that you don&amp;#39;t really like either is somewhat perplexing to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdz4z1", "score_hidden": true, "stickied": false, "created": 1492486010.0, "created_utc": 1492457210.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgehu7r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flaktrack", "parent_id": "t1_dgdud5o", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; Diablo\n\nI loved D1 and D2 as a kid/teen. D3 landed and... it sucked. Now the auction house and what it did to the game design really did not help this, but I went back to play D1 and D2 and... they weren't very good either? Honestly, I'm not really sure why I liked them at all. \"Clones\" like Dungeon Siege and Torchlight that I actually enjoyed once are stale now too. These games lack any real depth and just don't hold my interest any more.\n\n&gt; Planetside\n\nThe first game was actually a lot better, but that was because it *forced* teamwork. Gameplay was slower and more tactical. Vehicles were a lot more threatening (due to require 2+ people to be effective... except Reavers and BFRs... ugh)... lots of other important differences. The second game is just a total free-for-all and it really hurts the game. They definitely took the wrong inspirations from Battlefield.\n\n&gt; Warframe\n\nThis game took a long time to grow on me. There is a lot of stuff that they do a horrible job explaining, and I just kept abandoning it after a few hours... but one day it clicked. Fun as hell, but I'll admit I only play it in bursts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Diablo&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I loved D1 and D2 as a kid/teen. D3 landed and... it sucked. Now the auction house and what it did to the game design really did not help this, but I went back to play D1 and D2 and... they weren&amp;#39;t very good either? Honestly, I&amp;#39;m not really sure why I liked them at all. &amp;quot;Clones&amp;quot; like Dungeon Siege and Torchlight that I actually enjoyed once are stale now too. These games lack any real depth and just don&amp;#39;t hold my interest any more.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Planetside&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The first game was actually a lot better, but that was because it &lt;em&gt;forced&lt;/em&gt; teamwork. Gameplay was slower and more tactical. Vehicles were a lot more threatening (due to require 2+ people to be effective... except Reavers and BFRs... ugh)... lots of other important differences. The second game is just a total free-for-all and it really hurts the game. They definitely took the wrong inspirations from Battlefield.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Warframe&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This game took a long time to grow on me. There is a lot of stuff that they do a horrible job explaining, and I just kept abandoning it after a few hours... but one day it clicked. Fun as hell, but I&amp;#39;ll admit I only play it in bursts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgehu7r", "score_hidden": true, "stickied": false, "created": 1492508851.0, "created_utc": 1492480051.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdv9tq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dgdud5o", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt;Undertale. This game was absolute garbage, I have no idea what people see in it. The plot was annoying, the characters were annoying, and then there were the graphics. I get that the graphics were supposed to be \"retro\", but there are \"retro\" graphics and then there are \"no-effort\" graphics. This fell squarely into the second category, I've played better looking oldschool Atari games.\n\nAgreed. This game was pretty awful. I didn't really find the story, which people rave about, to be all that compelling. gameplay is half-assed rhythm based garbage and the visuals are awful even for a game that's trying to capture a retro aesthetic\n\n&gt;Dark Souls. Couldn't get into it. My biggest gripe wasn't gameplay (I loved Demon's Souls and Bloodborne), but plot. I couldn't find agency in any of my actions. Why should I (the character) care about this world? What is driving my actions? In Demon's Soulds, I was fighting for my freedom, but in Dark Souls...? Uh, I guess I escaped the asylum so... yay? Wait, why are these god things attacking me? I beat a bunch of bosses, got tired of hunting for scraps of plot, and quit playing. I eventually looked up a plot synopsis and it still didn't make any sense.\n\nI also have no idea why people rave about the supposed deep \"lore\" of the series. To me, it just seems like generic dark fantasy 101 - and I'm basing this on the summaries I've seen on the wiki and YouTube videos. There's probably a reason the story is hidden in item descriptions - it's pretty shit. Fanboys act like it's amazing just because it's vague and obscure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Undertale. This game was absolute garbage, I have no idea what people see in it. The plot was annoying, the characters were annoying, and then there were the graphics. I get that the graphics were supposed to be &amp;quot;retro&amp;quot;, but there are &amp;quot;retro&amp;quot; graphics and then there are &amp;quot;no-effort&amp;quot; graphics. This fell squarely into the second category, I&amp;#39;ve played better looking oldschool Atari games.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed. This game was pretty awful. I didn&amp;#39;t really find the story, which people rave about, to be all that compelling. gameplay is half-assed rhythm based garbage and the visuals are awful even for a game that&amp;#39;s trying to capture a retro aesthetic&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Dark Souls. Couldn&amp;#39;t get into it. My biggest gripe wasn&amp;#39;t gameplay (I loved Demon&amp;#39;s Souls and Bloodborne), but plot. I couldn&amp;#39;t find agency in any of my actions. Why should I (the character) care about this world? What is driving my actions? In Demon&amp;#39;s Soulds, I was fighting for my freedom, but in Dark Souls...? Uh, I guess I escaped the asylum so... yay? Wait, why are these god things attacking me? I beat a bunch of bosses, got tired of hunting for scraps of plot, and quit playing. I eventually looked up a plot synopsis and it still didn&amp;#39;t make any sense.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I also have no idea why people rave about the supposed deep &amp;quot;lore&amp;quot; of the series. To me, it just seems like generic dark fantasy 101 - and I&amp;#39;m basing this on the summaries I&amp;#39;ve seen on the wiki and YouTube videos. There&amp;#39;s probably a reason the story is hidden in item descriptions - it&amp;#39;s pretty shit. Fanboys act like it&amp;#39;s amazing just because it&amp;#39;s vague and obscure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdv9tq", "score_hidden": true, "stickied": false, "created": 1492481631.0, "created_utc": 1492452831.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdud5o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheGallow", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "**Metal Gear series**.  I can't tell what it's trying to be, is it a drama, a comedy, a parody that takes itself too seriously?  I suppose if I take into account that Hideo Kojima is *fucking insane* it makes more sense, but I could never find a coherent plot among the games.  \nThat and the controls for the games I played have been kinda crap.  I mean, how many buttons do i need to press to get an ironsight view?  Ugh.\n\n**Undertale**.  This game was absolute *garbage*, I have no idea what people see in it.  The plot was annoying, the characters were annoying, and then there were the graphics.  I get that the graphics were supposed to be \"retro\", but there are \"retro\" graphics and then there are \"no-effort\" graphics.  This fell squarely into the second category, I've played better looking oldschool Atari games.\n\n**Witcher series**.  I will be the first to admit that this series is good.  However, I just can't get into it and I don't know why.  I've tried for all three games, on multiple occasions.  Just can't play it for more than a few hours before I shelf it for months.  \n\n**Dark Souls**.  Couldn't get into it.  My biggest gripe wasn't gameplay (I loved Demon's Souls and Bloodborne), but plot.  I couldn't find agency in any of my actions.  Why should I (the character) care about this world?  What is driving my actions?  In Demon's Soulds, I was fighting for my freedom, but in Dark Souls...?  Uh, I guess I escaped the asylum so... yay?  Wait, why are these god things attacking me?  I beat a bunch of bosses, got tired of hunting for scraps of plot, and quit playing.  I eventually looked up a plot synopsis and it still didn't make any sense.  \n\n**DOTA**.  Honestly, most of my complains with this game is because I'm comparing it to League of Legends.  I personally find the gameplay too slow and like the ability-centered mechanics of LoL better.  \n\n**Borderlands**.  It's not good.  Why do people keep saying it's good?  It's a generic shooter with stylized graphics, a sub-par plot, fall-flat humor, and a grindy snoozefest of progression.  Oh cool another shotgun with a scope.  \nLet's not forget the fact that I had to set up port-forwarding in *2009*.\n\n**Warframe**.  My friends loved this game, I called it Boreframe.  It was either grindy as fuck or pay-to-win bullshit.  \n\n**Planetside**.  Jesus talk about repetitive.  Played for hours and I think the front never moved.  Friends loved it and I'm starting to see a pattern with them.  \n\n**Diablo series**.  Ok so this one was hard to write because I played D2 back in the day and loved that game.  I put so many hours that I think it only comes in second to WoW.  D3... well, it's not the gameplay or plot, since it was pretty much more of the same, it's just... grindy?  Maybe as an adult I don't have the patience to tolerate the sheer RNG that it took to get 1) an item to drop, and 2) that item to be useful.   That and playing the same Acts over and over again.  I dunno, it just didn't capture me like D2 did.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Metal Gear series&lt;/strong&gt;.  I can&amp;#39;t tell what it&amp;#39;s trying to be, is it a drama, a comedy, a parody that takes itself too seriously?  I suppose if I take into account that Hideo Kojima is &lt;em&gt;fucking insane&lt;/em&gt; it makes more sense, but I could never find a coherent plot among the games.&lt;br/&gt;\nThat and the controls for the games I played have been kinda crap.  I mean, how many buttons do i need to press to get an ironsight view?  Ugh.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Undertale&lt;/strong&gt;.  This game was absolute &lt;em&gt;garbage&lt;/em&gt;, I have no idea what people see in it.  The plot was annoying, the characters were annoying, and then there were the graphics.  I get that the graphics were supposed to be &amp;quot;retro&amp;quot;, but there are &amp;quot;retro&amp;quot; graphics and then there are &amp;quot;no-effort&amp;quot; graphics.  This fell squarely into the second category, I&amp;#39;ve played better looking oldschool Atari games.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Witcher series&lt;/strong&gt;.  I will be the first to admit that this series is good.  However, I just can&amp;#39;t get into it and I don&amp;#39;t know why.  I&amp;#39;ve tried for all three games, on multiple occasions.  Just can&amp;#39;t play it for more than a few hours before I shelf it for months.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dark Souls&lt;/strong&gt;.  Couldn&amp;#39;t get into it.  My biggest gripe wasn&amp;#39;t gameplay (I loved Demon&amp;#39;s Souls and Bloodborne), but plot.  I couldn&amp;#39;t find agency in any of my actions.  Why should I (the character) care about this world?  What is driving my actions?  In Demon&amp;#39;s Soulds, I was fighting for my freedom, but in Dark Souls...?  Uh, I guess I escaped the asylum so... yay?  Wait, why are these god things attacking me?  I beat a bunch of bosses, got tired of hunting for scraps of plot, and quit playing.  I eventually looked up a plot synopsis and it still didn&amp;#39;t make any sense.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DOTA&lt;/strong&gt;.  Honestly, most of my complains with this game is because I&amp;#39;m comparing it to League of Legends.  I personally find the gameplay too slow and like the ability-centered mechanics of LoL better.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Borderlands&lt;/strong&gt;.  It&amp;#39;s not good.  Why do people keep saying it&amp;#39;s good?  It&amp;#39;s a generic shooter with stylized graphics, a sub-par plot, fall-flat humor, and a grindy snoozefest of progression.  Oh cool another shotgun with a scope.&lt;br/&gt;\nLet&amp;#39;s not forget the fact that I had to set up port-forwarding in &lt;em&gt;2009&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Warframe&lt;/strong&gt;.  My friends loved this game, I called it Boreframe.  It was either grindy as fuck or pay-to-win bullshit.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Planetside&lt;/strong&gt;.  Jesus talk about repetitive.  Played for hours and I think the front never moved.  Friends loved it and I&amp;#39;m starting to see a pattern with them.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Diablo series&lt;/strong&gt;.  Ok so this one was hard to write because I played D2 back in the day and loved that game.  I put so many hours that I think it only comes in second to WoW.  D3... well, it&amp;#39;s not the gameplay or plot, since it was pretty much more of the same, it&amp;#39;s just... grindy?  Maybe as an adult I don&amp;#39;t have the patience to tolerate the sheer RNG that it took to get 1) an item to drop, and 2) that item to be useful.   That and playing the same Acts over and over again.  I dunno, it just didn&amp;#39;t capture me like D2 did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdud5o", "score_hidden": true, "stickied": false, "created": 1492480623.0, "created_utc": 1492451823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgeajky", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tippacanoe", "parent_id": "t1_dgdvenb", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think a big problem with Uncharted is that it relies too much on combat that isn't fun in my opinion. Honestly most cover based shooters have the same problem where you end up hiding behind cover and just waiting for the enemy to pop out. So much of the time spent in combat is actually just waiting around which gets old when so much of the game is combat based. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a big problem with Uncharted is that it relies too much on combat that isn&amp;#39;t fun in my opinion. Honestly most cover based shooters have the same problem where you end up hiding behind cover and just waiting for the enemy to pop out. So much of the time spent in combat is actually just waiting around which gets old when so much of the game is combat based. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeajky", "score_hidden": true, "stickied": false, "created": 1492499669.0, "created_utc": 1492470869.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvenb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "let_them_burn", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "The Uncharted series and the Last of Us. I'm not calling them overrated, I just didn't enjoy them. I tried to force myself to get into both franchises. The problem for me was the combat. I found it abnormally frustrating, so much so that I couldn't invest myself in the story. I played through the entirety of the first Uncharted and halfway through the second before giving up. I made it an hour or two into TLOU. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Uncharted series and the Last of Us. I&amp;#39;m not calling them overrated, I just didn&amp;#39;t enjoy them. I tried to force myself to get into both franchises. The problem for me was the combat. I found it abnormally frustrating, so much so that I couldn&amp;#39;t invest myself in the story. I played through the entirety of the first Uncharted and halfway through the second before giving up. I made it an hour or two into TLOU. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdvenb", "score_hidden": true, "stickied": false, "created": 1492481781.0, "created_utc": 1492452981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgehbs1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flaktrack", "parent_id": "t1_dgdyogx", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I found all 3 boring slogs. Nice environments, lots of stuff to find... but the combat is so bad, even though it's so important to the series. All 3 of them share one of the worst combat systems I've ever played.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found all 3 boring slogs. Nice environments, lots of stuff to find... but the combat is so bad, even though it&amp;#39;s so important to the series. All 3 of them share one of the worst combat systems I&amp;#39;ve ever played.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgehbs1", "score_hidden": true, "stickied": false, "created": 1492508246.0, "created_utc": 1492479446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyogx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rccrisp", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "The amount of love poured over Morrowind and Oblivion is something I never got. I tried those games when they came out and I found them to be boring, sludgy slogs. People bitch how Skyrim is \"boring to explore\" but I honestly find Skyrim a billion times more fun to walk around than the janky messes the previous two Elder Scroll games were (even if I do agree with the complaint that Skrim's world feels more like \"fake RPG towns dotting an endless expanse.\") ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The amount of love poured over Morrowind and Oblivion is something I never got. I tried those games when they came out and I found them to be boring, sludgy slogs. People bitch how Skyrim is &amp;quot;boring to explore&amp;quot; but I honestly find Skyrim a billion times more fun to walk around than the janky messes the previous two Elder Scroll games were (even if I do agree with the complaint that Skrim&amp;#39;s world feels more like &amp;quot;fake RPG towns dotting an endless expanse.&amp;quot;) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdyogx", "score_hidden": true, "stickied": false, "created": 1492485482.0, "created_utc": 1492456682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dge14ep", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Soupjam_Stevens", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'm on the opposite end of the MGS spectrum. I played Guns of the Patriots and loved the gameplay, but had no idea what was going on. I wanted to play the rest of the main series before Phantom Pain so I bought the PS3 remaster with MGS2, MGS3 and Peacewalker. I haven't tried the other two yet but I couldn't get into MGS2's gameplay at all. Didn't even make it an hour in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m on the opposite end of the MGS spectrum. I played Guns of the Patriots and loved the gameplay, but had no idea what was going on. I wanted to play the rest of the main series before Phantom Pain so I bought the PS3 remaster with MGS2, MGS3 and Peacewalker. I haven&amp;#39;t tried the other two yet but I couldn&amp;#39;t get into MGS2&amp;#39;s gameplay at all. Didn&amp;#39;t even make it an hour in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge14ep", "score_hidden": true, "stickied": false, "created": 1492488245.0, "created_utc": 1492459445.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dge4wyt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KatareLoL", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "These aren't AAA or anything, but a couple titles I bought due to near-universal acclaim...\n\n**Conception 2**: supposed to be a love letter to Persona 4, but with a lot more harem. I was willing to tolerate the potentially grating harem plot for more Persona, and the cutscenes are decent (not great) if you enjoy trashy anime. The dungeon crawling, on the other hand, is straight up abysmal. Leveling feels like a chore, there are like eight different systems to worry about when assessing your damage, and none of them feel impactful to use. Not that any of them matter, because the game is excessively easy. You can set most of the boss battles on Rush Mode where everybody spams attack and you'll win, and that's without grinding out any of the optional areas.\n\n**Superbeat Xonic**: Dunno what everybody talking about this game got. What I received was an okay setlist for an unintuitive control scheme that didn't explain itself properly, with a difficulty level that is either excessively high (fail the song in three misses) or babymode easy depending on whether you set up the DJ system they straight up don't tell you about. The dealbreaker for me was when I finished the third set and they expected me to grind out three more player levels to unlock the next. Why should I have to grind stages in a rhythm game to unlock content I've already paid for? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These aren&amp;#39;t AAA or anything, but a couple titles I bought due to near-universal acclaim...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conception 2&lt;/strong&gt;: supposed to be a love letter to Persona 4, but with a lot more harem. I was willing to tolerate the potentially grating harem plot for more Persona, and the cutscenes are decent (not great) if you enjoy trashy anime. The dungeon crawling, on the other hand, is straight up abysmal. Leveling feels like a chore, there are like eight different systems to worry about when assessing your damage, and none of them feel impactful to use. Not that any of them matter, because the game is excessively easy. You can set most of the boss battles on Rush Mode where everybody spams attack and you&amp;#39;ll win, and that&amp;#39;s without grinding out any of the optional areas.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Superbeat Xonic&lt;/strong&gt;: Dunno what everybody talking about this game got. What I received was an okay setlist for an unintuitive control scheme that didn&amp;#39;t explain itself properly, with a difficulty level that is either excessively high (fail the song in three misses) or babymode easy depending on whether you set up the DJ system they straight up don&amp;#39;t tell you about. The dealbreaker for me was when I finished the third set and they expected me to grind out three more player levels to unlock the next. Why should I have to grind stages in a rhythm game to unlock content I&amp;#39;ve already paid for? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge4wyt", "score_hidden": true, "stickied": false, "created": 1492492528.0, "created_utc": 1492463728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgei2ei", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mancatdoe", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I am playing DS1 and agree with most of what you said about the series. For me I had to rely on a lot of guides and info outside of the game. The game asks you to waste a lot of time retrying and getting info from other players. While I accept the design choice I find it a bit lazy to form coherent progression. The game does hover the line between fair and unfair and well structured. But I don't think its innovative or exiciting in any manner.\n\nI played the first one and infinite and I did like both of them. For me infinite was better because the story and player engagement were much more. Because the main character was Booker who had a personality and the story revolves around him. The first one's story revolved around the player character but he didn't have any agency and basically a brute.\n\nDidn't play any of the MGS game can't comment.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am playing DS1 and agree with most of what you said about the series. For me I had to rely on a lot of guides and info outside of the game. The game asks you to waste a lot of time retrying and getting info from other players. While I accept the design choice I find it a bit lazy to form coherent progression. The game does hover the line between fair and unfair and well structured. But I don&amp;#39;t think its innovative or exiciting in any manner.&lt;/p&gt;\n\n&lt;p&gt;I played the first one and infinite and I did like both of them. For me infinite was better because the story and player engagement were much more. Because the main character was Booker who had a personality and the story revolves around him. The first one&amp;#39;s story revolved around the player character but he didn&amp;#39;t have any agency and basically a brute.&lt;/p&gt;\n\n&lt;p&gt;Didn&amp;#39;t play any of the MGS game can&amp;#39;t comment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgei2ei", "score_hidden": true, "stickied": false, "created": 1492509125.0, "created_utc": 1492480325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgeiomp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cymelion", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "**Spec Ops: The Line** Could never get interested in the combat the characters or the setting. It has now been spoiled a million times over that there is no point finishing it.\n\n**Any Final Fantasy after 7** FF7 was my first JRPG I spent months playing that on the Playstation but all the ones after were just too different for me to want to play them - I kept missing the combat and materia system. I might probably enjoy them now but have a shame pile so large that they're not going to get a look in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Spec Ops: The Line&lt;/strong&gt; Could never get interested in the combat the characters or the setting. It has now been spoiled a million times over that there is no point finishing it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Any Final Fantasy after 7&lt;/strong&gt; FF7 was my first JRPG I spent months playing that on the Playstation but all the ones after were just too different for me to want to play them - I kept missing the combat and materia system. I might probably enjoy them now but have a shame pile so large that they&amp;#39;re not going to get a look in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeiomp", "score_hidden": true, "stickied": false, "created": 1492509861.0, "created_utc": 1492481061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgejrl0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flaktrack", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Probably one of the games people profess their love for more than any other is **Deus Ex**, at least by my count... but I can't stand it. Everything feels so fake and rigid, like a teenager trying too hard to be cool. The gunplay is *awful*, the stealth is mediocre at best, and the story is very predictable and cliche. And that's how I felt when it first came out. Playing it again years later thinking I missed something, I have to say I like it even less now. And for a game that came out 2 years after Thief: The Dark Project (a far better game from the same studio and arguably the best stealth game of all time), that's inexcusable.\n\nWhat Human Revolution took away in player freedom (not nearly as much as people accuse it of doing), it gave back in far better storytelling and gameplay. Yet people seem to think the original is better? Crazy.\n\n**Bethesda**\n\nYup. An entire company worth of games: Fallout 3/4, Elder Scrolls, etc.. They're all just so bland: the worlds, the NPCs, and especially the combat.\n\nI've played Morrowind, Oblivion, and Skyrim, and while they were good time wasters, they weren't very good games. Exploring was sometimes interesting, but the combat - which is a huge part of the games - is horrible, and somehow it actually gets worse from game to game. By the time you get to Skyrim, the game felt like a padded room where nothing bad could happen to you compared to Morrowind, where at least things felt dangerous sometimes. Very overrated.\n\nFallout 3/4 were a whole new level of pain for me though, because I had played Fallout 1/2 and they were nothing alike. F3/F4 lack the great storytelling, the NPCs, the enemies, and just the world flavor of the first two. And with typically boring Bethesda combat, they didn't even manage to improve that. And on top of all that, they raped the hell out of the lore. No thanks. Also on a rather funny note, New Vegas, while still not great, somehow managed to be the better of the new games. Proof that the problem seems to be Bethesda, not the Fallout universe.\n\nDishonored was ok while it was still difficult, but it quickly gets so easy that I just couldn't enjoy it. Very predictable and ultimately meaningless story. Art direction was at least pretty good this time: coherent and visually interesting. Believable, even. Maybe open worlds aren't their thing?\n\n**Bioware**\n\nAnother company best summed up with a resounded \"meh\".\n\nGenerally speaking, the only real difference between Bioware's snoozefests and Bethesda's snoozefests is Bioware's focus on storytelling through dialogue vs. Bethesda's focus on storytelling through exploration. KOTOR, Jade Empire, Dragon Age... all of them got boring so fast I probably didn't break 50% story on any of them. Somehow, Mass Effect 1 and 2 were good enough I actually liked them (1 for the worldbuilding and exploration, 2 for the combat and amazing characters), but while ME3's combat was about as good as the 2nd, the story took a nosedive right off the starting line and never really got better, and character interactions were no where near as interesting... so into the bin for that one too.\n\nI remember Baldur's Gate 2 being a lot better than their recent fare. I don't know how to explain that. Is it just nostalgia goggles or was it actually better?\n\nNeverwinter Nights was... ok. Flawed and very easily exploitable (lol shadow dancers), but playable. Not very memorable though. Probably for the best.", "edited": 1492482718.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably one of the games people profess their love for more than any other is &lt;strong&gt;Deus Ex&lt;/strong&gt;, at least by my count... but I can&amp;#39;t stand it. Everything feels so fake and rigid, like a teenager trying too hard to be cool. The gunplay is &lt;em&gt;awful&lt;/em&gt;, the stealth is mediocre at best, and the story is very predictable and cliche. And that&amp;#39;s how I felt when it first came out. Playing it again years later thinking I missed something, I have to say I like it even less now. And for a game that came out 2 years after Thief: The Dark Project (a far better game from the same studio and arguably the best stealth game of all time), that&amp;#39;s inexcusable.&lt;/p&gt;\n\n&lt;p&gt;What Human Revolution took away in player freedom (not nearly as much as people accuse it of doing), it gave back in far better storytelling and gameplay. Yet people seem to think the original is better? Crazy.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bethesda&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yup. An entire company worth of games: Fallout 3/4, Elder Scrolls, etc.. They&amp;#39;re all just so bland: the worlds, the NPCs, and especially the combat.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve played Morrowind, Oblivion, and Skyrim, and while they were good time wasters, they weren&amp;#39;t very good games. Exploring was sometimes interesting, but the combat - which is a huge part of the games - is horrible, and somehow it actually gets worse from game to game. By the time you get to Skyrim, the game felt like a padded room where nothing bad could happen to you compared to Morrowind, where at least things felt dangerous sometimes. Very overrated.&lt;/p&gt;\n\n&lt;p&gt;Fallout 3/4 were a whole new level of pain for me though, because I had played Fallout 1/2 and they were nothing alike. F3/F4 lack the great storytelling, the NPCs, the enemies, and just the world flavor of the first two. And with typically boring Bethesda combat, they didn&amp;#39;t even manage to improve that. And on top of all that, they raped the hell out of the lore. No thanks. Also on a rather funny note, New Vegas, while still not great, somehow managed to be the better of the new games. Proof that the problem seems to be Bethesda, not the Fallout universe.&lt;/p&gt;\n\n&lt;p&gt;Dishonored was ok while it was still difficult, but it quickly gets so easy that I just couldn&amp;#39;t enjoy it. Very predictable and ultimately meaningless story. Art direction was at least pretty good this time: coherent and visually interesting. Believable, even. Maybe open worlds aren&amp;#39;t their thing?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bioware&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Another company best summed up with a resounded &amp;quot;meh&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Generally speaking, the only real difference between Bioware&amp;#39;s snoozefests and Bethesda&amp;#39;s snoozefests is Bioware&amp;#39;s focus on storytelling through dialogue vs. Bethesda&amp;#39;s focus on storytelling through exploration. KOTOR, Jade Empire, Dragon Age... all of them got boring so fast I probably didn&amp;#39;t break 50% story on any of them. Somehow, Mass Effect 1 and 2 were good enough I actually liked them (1 for the worldbuilding and exploration, 2 for the combat and amazing characters), but while ME3&amp;#39;s combat was about as good as the 2nd, the story took a nosedive right off the starting line and never really got better, and character interactions were no where near as interesting... so into the bin for that one too.&lt;/p&gt;\n\n&lt;p&gt;I remember Baldur&amp;#39;s Gate 2 being a lot better than their recent fare. I don&amp;#39;t know how to explain that. Is it just nostalgia goggles or was it actually better?&lt;/p&gt;\n\n&lt;p&gt;Neverwinter Nights was... ok. Flawed and very easily exploitable (lol shadow dancers), but playable. Not very memorable though. Probably for the best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgejrl0", "score_hidden": true, "stickied": false, "created": 1492511119.0, "created_utc": 1492482319.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdt1gl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gummy_Venus", "parent_id": "t1_dgdrhk9", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I hear you. I also came to the series late, so that might have coloured my impressions. But that being said, I *love* The Last of Us and think it's one of the best games I've ever played. I think it's because the story had heart. When you make a \"cinematic\" game that plays more like a movie, as Naughty Dog does, to win me over you need a great story. Uncharted hits the tropes and cliches hard -- which is great at emulating and putting you in a traditional movie experience. The experience was about \"being in a movie\". TLOU puts you in a relatively unoriginal post-apocalyptic scenario, but with *characters* that felt so genuine. The experience was about feeling what they felt, putting it head and shoulders above, imo.\n\nNot that the games *must* be compared or anything. I'm just outlining why I think there is a difference and how it landed for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hear you. I also came to the series late, so that might have coloured my impressions. But that being said, I &lt;em&gt;love&lt;/em&gt; The Last of Us and think it&amp;#39;s one of the best games I&amp;#39;ve ever played. I think it&amp;#39;s because the story had heart. When you make a &amp;quot;cinematic&amp;quot; game that plays more like a movie, as Naughty Dog does, to win me over you need a great story. Uncharted hits the tropes and cliches hard -- which is great at emulating and putting you in a traditional movie experience. The experience was about &amp;quot;being in a movie&amp;quot;. TLOU puts you in a relatively unoriginal post-apocalyptic scenario, but with &lt;em&gt;characters&lt;/em&gt; that felt so genuine. The experience was about feeling what they felt, putting it head and shoulders above, imo.&lt;/p&gt;\n\n&lt;p&gt;Not that the games &lt;em&gt;must&lt;/em&gt; be compared or anything. I&amp;#39;m just outlining why I think there is a difference and how it landed for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdt1gl", "score_hidden": true, "stickied": false, "created": 1492479174.0, "created_utc": 1492450374.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrhk9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dgdq42m", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I ADORE the Uncharted games (UC2 is probably one of my all-time favorites) and I will still agree with you that the gunplay is not all that great and Drake racking up the ridiculous kill count that he does is a little off-putting. However, in terms of an interactive cinematic experience, these games are bar none the best in the industry, I was actually awestruck at the voice acting and motion capture in Uncharted 4, and the set pieces, visuals and overall production design have always been top-tier. They also tend to have some VERY likeable characters, which definitely goes a long way. I think you need to take these games as what they are - more of an homage to the old-school Indiana Jones-type adventures as opposed to a mechanically sound third person shooter. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I ADORE the Uncharted games (UC2 is probably one of my all-time favorites) and I will still agree with you that the gunplay is not all that great and Drake racking up the ridiculous kill count that he does is a little off-putting. However, in terms of an interactive cinematic experience, these games are bar none the best in the industry, I was actually awestruck at the voice acting and motion capture in Uncharted 4, and the set pieces, visuals and overall production design have always been top-tier. They also tend to have some VERY likeable characters, which definitely goes a long way. I think you need to take these games as what they are - more of an homage to the old-school Indiana Jones-type adventures as opposed to a mechanically sound third person shooter. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdrhk9", "score_hidden": true, "stickied": false, "created": 1492477440.0, "created_utc": 1492448640.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdw5zj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t1_dgdq42m", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; The lore and backstory was dense for a newcomer to the series\n\nAs much as I absolutely loved Witcher 3 - except for Gwent, fuck that garbage - and love the whole Witcher universe and lore, I have to agree. While playing, it took some effort from me to remember all the names and events and places and understanding the relationships between them all, even after having played the two previous games. I've seen in other topics that if you read the books, many of those things start making more sense and they give you a clearer view, but yeah, the games are quite lore-heavy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The lore and backstory was dense for a newcomer to the series&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As much as I absolutely loved Witcher 3 - except for Gwent, fuck that garbage - and love the whole Witcher universe and lore, I have to agree. While playing, it took some effort from me to remember all the names and events and places and understanding the relationships between them all, even after having played the two previous games. I&amp;#39;ve seen in other topics that if you read the books, many of those things start making more sense and they give you a clearer view, but yeah, the games are quite lore-heavy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdw5zj", "score_hidden": true, "stickied": false, "created": 1492482633.0, "created_utc": 1492453833.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdr8m1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BSRussell", "parent_id": "t1_dgdq42m", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Gotta love that Nathan Drake body count.  It is generic, but I also don't know any game that does what it does.  It really goes for that Indiana Jones adventure feel and pulls it off, as it has writing/voice acting as good as anything I've seen in Hollywood.  It doesn't implicitly do anything new, it's just got incredibly production values and really tight setpieces with characters you actually enjoy seeing, which is a lot more than most games can muster.  I think your read is correct in saying that they're the best at what they aim to do, but the thing is they're the best by such a *massive margin* that it's hard to compare.\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gotta love that Nathan Drake body count.  It is generic, but I also don&amp;#39;t know any game that does what it does.  It really goes for that Indiana Jones adventure feel and pulls it off, as it has writing/voice acting as good as anything I&amp;#39;ve seen in Hollywood.  It doesn&amp;#39;t implicitly do anything new, it&amp;#39;s just got incredibly production values and really tight setpieces with characters you actually enjoy seeing, which is a lot more than most games can muster.  I think your read is correct in saying that they&amp;#39;re the best at what they aim to do, but the thing is they&amp;#39;re the best by such a &lt;em&gt;massive margin&lt;/em&gt; that it&amp;#39;s hard to compare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdr8m1", "score_hidden": true, "stickied": false, "created": 1492477165.0, "created_utc": 1492448365.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq42m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gummy_Venus", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 1, "body": "**Uncharted** - generic third-person shooter with typically snarky white action hero protagonist. It's not that the games are *bad* -- they are the absolute best at what they aim to do -- it's just that it's all so generic, and the gunplay never did it for me. This is also one of the only game series that hit me with \"ludonarrative dissonance\" with the simply insane body-count that Nathan Drake has racked up.\n\n**The Witcher 3** - I played about 12 hours into this game and I just didn't connect at all. Similar to Uncharted, it's all perfectly fine, but it just doesn't do anything for me. The combat was pretty boring, and I find Geralt to be wooden and generic. The lore and backstory was dense for a newcomer to the series, which certainly didn't help. I appreciated the fleshed-out side-quests, but there was still the typical open-world laundry-list of collectibles and points of interest. Probably great if you're into that kind of thing, but it really doesn't break any new ground or do anything interesting to me -- just gives you really well polished versions of established tropes.\n\nEDIT: Wow, fuck me for answering the question I guess. The circle-jerk for these games is strong. You know, I don't think *you* are stupid if you like these games. It's just an opinion.", "edited": 1492447936.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Uncharted&lt;/strong&gt; - generic third-person shooter with typically snarky white action hero protagonist. It&amp;#39;s not that the games are &lt;em&gt;bad&lt;/em&gt; -- they are the absolute best at what they aim to do -- it&amp;#39;s just that it&amp;#39;s all so generic, and the gunplay never did it for me. This is also one of the only game series that hit me with &amp;quot;ludonarrative dissonance&amp;quot; with the simply insane body-count that Nathan Drake has racked up.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Witcher 3&lt;/strong&gt; - I played about 12 hours into this game and I just didn&amp;#39;t connect at all. Similar to Uncharted, it&amp;#39;s all perfectly fine, but it just doesn&amp;#39;t do anything for me. The combat was pretty boring, and I find Geralt to be wooden and generic. The lore and backstory was dense for a newcomer to the series, which certainly didn&amp;#39;t help. I appreciated the fleshed-out side-quests, but there was still the typical open-world laundry-list of collectibles and points of interest. Probably great if you&amp;#39;re into that kind of thing, but it really doesn&amp;#39;t break any new ground or do anything interesting to me -- just gives you really well polished versions of established tropes.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Wow, fuck me for answering the question I guess. The circle-jerk for these games is strong. You know, I don&amp;#39;t think &lt;em&gt;you&lt;/em&gt; are stupid if you like these games. It&amp;#39;s just an opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdq42m", "score_hidden": true, "stickied": false, "created": 1492475920.0, "created_utc": 1492447120.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdrkw7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kidney05", "parent_id": "t1_dgdr6n0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "yeah, in theory the shrines are a great idea.  I like that you get more puzzles and you don't have to commit to the longer dungeon to have some puzzle solving.  before, the game came out, i assumed we'd have all the shrines and then 4-5 regular size dungeons, since zelda games typically seem to have 7-8 full size dungeons.  but with the dungeons being so short, and the shrines never being too tricky, it just feels like we got short changed in terms of dungeons.  But yeah, the dungeons are always the same deal-- take the elevator down, loading screen, wait for the slow voice to come on, etc etc.  it would have been cool if they were built right into the world, so when you're in the icy areas, they make more sense in that context... not the \"drag and drop anywhere\" way they're done now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah, in theory the shrines are a great idea.  I like that you get more puzzles and you don&amp;#39;t have to commit to the longer dungeon to have some puzzle solving.  before, the game came out, i assumed we&amp;#39;d have all the shrines and then 4-5 regular size dungeons, since zelda games typically seem to have 7-8 full size dungeons.  but with the dungeons being so short, and the shrines never being too tricky, it just feels like we got short changed in terms of dungeons.  But yeah, the dungeons are always the same deal-- take the elevator down, loading screen, wait for the slow voice to come on, etc etc.  it would have been cool if they were built right into the world, so when you&amp;#39;re in the icy areas, they make more sense in that context... not the &amp;quot;drag and drop anywhere&amp;quot; way they&amp;#39;re done now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdrkw7", "score_hidden": true, "stickied": false, "created": 1492477545.0, "created_utc": 1492448745.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr6n0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SaintOdhran", "parent_id": "t1_dgdquhf", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "The shrines really feel like a dungeon was dissected and its individual rooms just spread across the world.  I like that kind of incremental, one-room problem in something like Metroid, where it's more integrated into the world, but it feels less satisfying when it's set off like it is in Breath of the Wild, and the weakness of the Divine Beasts doesn't help that either.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The shrines really feel like a dungeon was dissected and its individual rooms just spread across the world.  I like that kind of incremental, one-room problem in something like Metroid, where it&amp;#39;s more integrated into the world, but it feels less satisfying when it&amp;#39;s set off like it is in Breath of the Wild, and the weakness of the Divine Beasts doesn&amp;#39;t help that either.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdr6n0", "score_hidden": true, "stickied": false, "created": 1492477103.0, "created_utc": 1492448303.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdquhf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kidney05", "parent_id": "t1_dgdpu7e", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "the worst part about zelda right now is you can't be critical of the new game without so many people downvoting you.  it's like the reviews have made this game untouchable.  breath of the wild is a good game, but it has its issues.  the combat is very basic, and there aren't that many enemies to vary it, only multiple colors of the same few enemy types.  also, in my opinion, the shrines are always one step short of actually making a good challenge.  the majority of them are like testing an idea, and you expect it to be harder in the next room-- but there is no next room.  you're done.  and the dungeons are an even worse example of this-- they're entirely too short.\n\ni'm not even done the game but i'm just burnt out on it.  haven't picked it up in a week or two.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the worst part about zelda right now is you can&amp;#39;t be critical of the new game without so many people downvoting you.  it&amp;#39;s like the reviews have made this game untouchable.  breath of the wild is a good game, but it has its issues.  the combat is very basic, and there aren&amp;#39;t that many enemies to vary it, only multiple colors of the same few enemy types.  also, in my opinion, the shrines are always one step short of actually making a good challenge.  the majority of them are like testing an idea, and you expect it to be harder in the next room-- but there is no next room.  you&amp;#39;re done.  and the dungeons are an even worse example of this-- they&amp;#39;re entirely too short.&lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;m not even done the game but i&amp;#39;m just burnt out on it.  haven&amp;#39;t picked it up in a week or two.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdquhf", "score_hidden": true, "stickied": false, "created": 1492476729.0, "created_utc": 1492447929.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpu7e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BSRussell", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I don't think this will generate too much shock as it's very much either a \"you play them or you don't\" series, but I just couldn't care less about Zelda.  I didn't even bother to read the review thread out of curiosity.  I played them when I was a kid, Link to the Past was a seminal game in my history, but beyond that I just don't get why people care.  Extremely simplistic gameplay, the same handful of generic characters, the same simple but slightly annoying puzzles the same general arc over and over.  They tend to be a master class in art direction, but beyond that I find them incredibly boring.\n\n\n\nAs for Soulsborne, I kinda get it.  I tend to have a *ton* of fun getting through about 75% of them, but then once I have my set of spells and my ideal weapon and there's nothing left to do on my character but incrementally improve stats I get bored quickly.  I'm a long time MGS fan and I absolutely *loathed* MGS V.  After about 15 hours I realized that it actively put me in a shitty mood and wasn't going to get any better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think this will generate too much shock as it&amp;#39;s very much either a &amp;quot;you play them or you don&amp;#39;t&amp;quot; series, but I just couldn&amp;#39;t care less about Zelda.  I didn&amp;#39;t even bother to read the review thread out of curiosity.  I played them when I was a kid, Link to the Past was a seminal game in my history, but beyond that I just don&amp;#39;t get why people care.  Extremely simplistic gameplay, the same handful of generic characters, the same simple but slightly annoying puzzles the same general arc over and over.  They tend to be a master class in art direction, but beyond that I find them incredibly boring.&lt;/p&gt;\n\n&lt;p&gt;As for Soulsborne, I kinda get it.  I tend to have a &lt;em&gt;ton&lt;/em&gt; of fun getting through about 75% of them, but then once I have my set of spells and my ideal weapon and there&amp;#39;s nothing left to do on my character but incrementally improve stats I get bored quickly.  I&amp;#39;m a long time MGS fan and I absolutely &lt;em&gt;loathed&lt;/em&gt; MGS V.  After about 15 hours I realized that it actively put me in a shitty mood and wasn&amp;#39;t going to get any better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdpu7e", "score_hidden": true, "stickied": false, "created": 1492475618.0, "created_utc": 1492446818.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdx8vl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "typodaemon", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Half Life and Half Life 2. Oh no, here come the downvotes!\n\nThe big draw of the first one was the story and the way the story was presented using scripted events in game. The big draw of the second one was again the story, but also the physics engine.\n\nI don't care for the story. I think it's on par with a sci-fi original movie in terms of plot devices and characters. It's better than what you found in most games at the time, but that's because most games at the time only had an opening cinematic and a closing cinematic to book end their gameplay. If you read the story in a book or saw it in a movie you wouldn't  praise it because it isn't anything special.\n\nThe physics engine was great and I'm really happy similar physics are a standard feature of games now. I just don't know why anyone would want a sequel about those bland characters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Half Life and Half Life 2. Oh no, here come the downvotes!&lt;/p&gt;\n\n&lt;p&gt;The big draw of the first one was the story and the way the story was presented using scripted events in game. The big draw of the second one was again the story, but also the physics engine.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care for the story. I think it&amp;#39;s on par with a sci-fi original movie in terms of plot devices and characters. It&amp;#39;s better than what you found in most games at the time, but that&amp;#39;s because most games at the time only had an opening cinematic and a closing cinematic to book end their gameplay. If you read the story in a book or saw it in a movie you wouldn&amp;#39;t  praise it because it isn&amp;#39;t anything special.&lt;/p&gt;\n\n&lt;p&gt;The physics engine was great and I&amp;#39;m really happy similar physics are a standard feature of games now. I just don&amp;#39;t know why anyone would want a sequel about those bland characters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdx8vl", "score_hidden": true, "stickied": false, "created": 1492483857.0, "created_utc": 1492455057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgeo1c9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nameucanthate", "parent_id": "t1_dgdvtae", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I never liked the Zelda series, and I usually give up halfway through each game just because I cannot slog through 8 fucking dungeons for the love of god. \n\n\nBut Breath of the Wild is so different from every other Zelda game that it has had me foaming at the mouth since last E3. I'm in love with the game, and can comfortably say it is my favourite game of all time. \n\nSo take it from somebody who was in the same boat as you, try out Breath of the Wild. It's so, so very worth it. It deserves the accolades and the plaudits, and I can't wait to pick it up again when the DLC comes along this Holiday season. \n\nDo yourself a favour and at least try it. If you don't like Breath of the Wild, then i'm willing to concur that the Legend of Zelda just isn't for you. But i'm going to remain adamant until you play Breath of the Wild, just because **it's so different**.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never liked the Zelda series, and I usually give up halfway through each game just because I cannot slog through 8 fucking dungeons for the love of god. &lt;/p&gt;\n\n&lt;p&gt;But Breath of the Wild is so different from every other Zelda game that it has had me foaming at the mouth since last E3. I&amp;#39;m in love with the game, and can comfortably say it is my favourite game of all time. &lt;/p&gt;\n\n&lt;p&gt;So take it from somebody who was in the same boat as you, try out Breath of the Wild. It&amp;#39;s so, so very worth it. It deserves the accolades and the plaudits, and I can&amp;#39;t wait to pick it up again when the DLC comes along this Holiday season. &lt;/p&gt;\n\n&lt;p&gt;Do yourself a favour and at least try it. If you don&amp;#39;t like Breath of the Wild, then i&amp;#39;m willing to concur that the Legend of Zelda just isn&amp;#39;t for you. But i&amp;#39;m going to remain adamant until you play Breath of the Wild, just because &lt;strong&gt;it&amp;#39;s so different&lt;/strong&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeo1c9", "score_hidden": true, "stickied": false, "created": 1492516771.0, "created_utc": 1492487971.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgehyxq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flaktrack", "parent_id": "t1_dge4zxy", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "The interesting thing about BOTW is that it is quite different from the rest of the series. It's quite a departure from the known formula. Perhaps the most similar game is Windwaker, but that's a stretch.\n\nYou might actually like the others more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The interesting thing about BOTW is that it is quite different from the rest of the series. It&amp;#39;s quite a departure from the known formula. Perhaps the most similar game is Windwaker, but that&amp;#39;s a stretch.&lt;/p&gt;\n\n&lt;p&gt;You might actually like the others more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgehyxq", "score_hidden": true, "stickied": false, "created": 1492509007.0, "created_utc": 1492480207.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4zxy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ravageprimal", "parent_id": "t1_dgdvtae", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I feel the same way.  I was not excited at all for Breath of the Wild, yet everyone was going ape shit for it.  I kept thinking \"Am I not watching the same trailers as them?\" because the trailers didn't make the game look exciting at all.  \n\nI ended up buying the game and it is fun, but I think I'm about done playing it and I'm nowhere even close to the end.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the same way.  I was not excited at all for Breath of the Wild, yet everyone was going ape shit for it.  I kept thinking &amp;quot;Am I not watching the same trailers as them?&amp;quot; because the trailers didn&amp;#39;t make the game look exciting at all.  &lt;/p&gt;\n\n&lt;p&gt;I ended up buying the game and it is fun, but I think I&amp;#39;m about done playing it and I&amp;#39;m nowhere even close to the end.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge4zxy", "score_hidden": true, "stickied": false, "created": 1492492629.0, "created_utc": 1492463829.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvtae", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "poison-fang-blade", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 1, "body": "**Legend of Zelda series** - There are many (not LoZ) games that I look at, see reviews and opinions and think \"Hey, this looks cool, I wanna play it someday\". Zelda games elicit *nothing* from me. Well, not nothing, if apathy counts as something. Everything looks so plain, so generic to me. Sometimes it feels annoying because everyone and their mothers like it, some of the games are highly praised and yet I feel nothing.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Legend of Zelda series&lt;/strong&gt; - There are many (not LoZ) games that I look at, see reviews and opinions and think &amp;quot;Hey, this looks cool, I wanna play it someday&amp;quot;. Zelda games elicit &lt;em&gt;nothing&lt;/em&gt; from me. Well, not nothing, if apathy counts as something. Everything looks so plain, so generic to me. Sometimes it feels annoying because everyone and their mothers like it, some of the games are highly praised and yet I feel nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdvtae", "score_hidden": true, "stickied": false, "created": 1492482234.0, "created_utc": 1492453434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65whu0", "likes": null, "replies": "", "user_reports": [], "id": "dgdvo10", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SpuriousSpunk", "parent_id": "t3_65whu0", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "**The Last of Us/Uncharted**: I get it, it is supposed to be focused on the character development and the overall narrative however it is not all that interesting since type of story has been written so many times. Also, the gameplay and level design is awfully boring; why play a game that is not fun let a lone continue the story because of this? I also have the same problem with Uncharted, the gameplay is so generic and people tell me that it is about the story and characters. Once again, the story and characters are honestly not that engaging or interesting, it is okay at best, and I felt myself droning on in the repetitive formula. I feel TLOU and Uncharted fall into the problems honestly, that's why I lumped them together.\n\n\n**World of Warcraft**: I did raids and dungeons, leveled up quickly because of RAF and I think the most fun I had was getting my first flying mount and just exploring the snowy plains with my dwarf. I was desperately trying to play with people and communicate to have more fun with friends. Honestly, I do not mind the grind if I have company but I do not enjoy playing alone unless learning new things or listening to podcasts. I do not feel WoW is a bad game, honestly if it was free, I would make it my time killer/stress relieving game where I'd just play a podcast and just kill two hours. Other than that, I did not have a ton of fun doing the same raids and dungeons the same way, with the same classes, all the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;The Last of Us/Uncharted&lt;/strong&gt;: I get it, it is supposed to be focused on the character development and the overall narrative however it is not all that interesting since type of story has been written so many times. Also, the gameplay and level design is awfully boring; why play a game that is not fun let a lone continue the story because of this? I also have the same problem with Uncharted, the gameplay is so generic and people tell me that it is about the story and characters. Once again, the story and characters are honestly not that engaging or interesting, it is okay at best, and I felt myself droning on in the repetitive formula. I feel TLOU and Uncharted fall into the problems honestly, that&amp;#39;s why I lumped them together.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;World of Warcraft&lt;/strong&gt;: I did raids and dungeons, leveled up quickly because of RAF and I think the most fun I had was getting my first flying mount and just exploring the snowy plains with my dwarf. I was desperately trying to play with people and communicate to have more fun with friends. Honestly, I do not mind the grind if I have company but I do not enjoy playing alone unless learning new things or listening to podcasts. I do not feel WoW is a bad game, honestly if it was free, I would make it my time killer/stress relieving game where I&amp;#39;d just play a podcast and just kill two hours. Other than that, I did not have a ton of fun doing the same raids and dungeons the same way, with the same classes, all the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdvo10", "score_hidden": true, "stickied": false, "created": 1492482073.0, "created_utc": 1492453273.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]