[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A book I&amp;#39;m reading (&lt;em&gt;Being Mortal&lt;/em&gt;, taking a lot from this in what follows) discusses an experiment of patients undergoing colonoscopies and kidney stone procedures awake.  The patients get a device that lets them rate their pain every 60 seconds on a scale of 1 to 10.  Then also at the end of the procedures, patients rate the total amount of pain they experienced during the procedure.  &lt;/p&gt;\n\n&lt;p&gt;People assumed the final ratings would represent something like the average of the moment-to-moment ratings.  But actually, the final ratings were best predicted by the &lt;strong&gt;Peak-End Rule&lt;/strong&gt; - an average of the pain experienced at two moments: the single worst moment of the procedure and the very end.  This would hold true even when the ending was an anomaly.  Just a few minutes without pain at the end of the procedure dramatically reduced overall pain ratings even if they&amp;#39;d experienced a long duration of a high level of pain.  &lt;/p&gt;\n\n&lt;p&gt;Further studies confirmed the Peak-End rule and have shown that it also applies to pleasurable experiences, which brings me to videogames.  As I read this it hit me that I really think this applies to how people talk about videogames.  How many games have you heard people rave about that have hours and hours of boring content?  You think to yourself, &amp;quot;Where are people getting these rave reviews?&amp;quot;  I really think this Peak-End rule explains it: though the game may have hours and hours of boring content, the peak moments of enjoyment are extremely high, and the game probably ends on a high note.  &lt;/p&gt;\n\n&lt;p&gt;As a personal example, I have more fond memories of Dragon&amp;#39;s Dogma than I do of Ori and the Blind Forest.  Dragon&amp;#39;s Dogma had hours of me traveling across paths I&amp;#39;d already run dozens of times before boringly fighting weak orcs I&amp;#39;d fought dozens of times before.  But the high points of taking down a chimera, dragon, or griffin were amazing.  And if you&amp;#39;d played that game to the end, you know that the ending also takes that game to an entirely new level.  &lt;/p&gt;\n\n&lt;p&gt;Contrast that with Ori and the Blind Forest.  I enjoyed that game all the way through.  Every moment was an interesting new platforming challenge, Ori handled beautifully, and the visuals were constantly stunning.  But it never had a &lt;strong&gt;Peak&lt;/strong&gt; as high as Dragon&amp;#39;s Dogma, and the &lt;strong&gt;End&lt;/strong&gt; wasn&amp;#39;t as special.  &lt;/p&gt;\n\n&lt;p&gt;Thus I remember Dragon&amp;#39;s Dogma much more fondly.  And I see that pattern in general - especially because games often end with a bang and some of the best content, so a person who played to the very ending usually has a higher opinion of the game than someone who only played to the 75% point.  Do you agree or disagree?  Why?  Do &lt;em&gt;you&lt;/em&gt; think this &lt;strong&gt;Peak-End&lt;/strong&gt; rule apply to how &lt;em&gt;you&lt;/em&gt; remember games?  Do you think it applies broadly to people in general?  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A book I'm reading (*Being Mortal*, taking a lot from this in what follows) discusses an experiment of patients undergoing colonoscopies and kidney stone procedures awake.  The patients get a device that lets them rate their pain every 60 seconds on a scale of 1 to 10.  Then also at the end of the procedures, patients rate the total amount of pain they experienced during the procedure.  \n\nPeople assumed the final ratings would represent something like the average of the moment-to-moment ratings.  But actually, the final ratings were best predicted by the **Peak-End Rule** - an average of the pain experienced at two moments: the single worst moment of the procedure and the very end.  This would hold true even when the ending was an anomaly.  Just a few minutes without pain at the end of the procedure dramatically reduced overall pain ratings even if they'd experienced a long duration of a high level of pain.  \n\nFurther studies confirmed the Peak-End rule and have shown that it also applies to pleasurable experiences, which brings me to videogames.  As I read this it hit me that I really think this applies to how people talk about videogames.  How many games have you heard people rave about that have hours and hours of boring content?  You think to yourself, \"Where are people getting these rave reviews?\"  I really think this Peak-End rule explains it: though the game may have hours and hours of boring content, the peak moments of enjoyment are extremely high, and the game probably ends on a high note.  \n\nAs a personal example, I have more fond memories of Dragon's Dogma than I do of Ori and the Blind Forest.  Dragon's Dogma had hours of me traveling across paths I'd already run dozens of times before boringly fighting weak orcs I'd fought dozens of times before.  But the high points of taking down a chimera, dragon, or griffin were amazing.  And if you'd played that game to the end, you know that the ending also takes that game to an entirely new level.  \n\nContrast that with Ori and the Blind Forest.  I enjoyed that game all the way through.  Every moment was an interesting new platforming challenge, Ori handled beautifully, and the visuals were constantly stunning.  But it never had a **Peak** as high as Dragon's Dogma, and the **End** wasn't as special.  \n\nThus I remember Dragon's Dogma much more fondly.  And I see that pattern in general - especially because games often end with a bang and some of the best content, so a person who played to the very ending usually has a higher opinion of the game than someone who only played to the 75% point.  Do you agree or disagree?  Why?  Do *you* think this **Peak-End** rule apply to how *you* remember games?  Do you think it applies broadly to people in general?  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ww7l", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 243, "report_reasons": null, "author": "__Nikipedia__", "saved": false, "mod_reports": [], "name": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65ww7l/how_the_peakend_rule_applies_to_videogames/", "num_reports": null, "locked": false, "stickied": false, "created": 1492478070.0, "url": "https://www.reddit.com/r/truegaming/comments/65ww7l/how_the_peakend_rule_applies_to_videogames/", "author_flair_text": null, "quarantine": false, "title": "How the Peak-End rule applies to videogames", "created_utc": 1492449270.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 43, "visited": false, "subreddit_type": "public", "ups": 243}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge1md2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "acepincter", "parent_id": "t1_dgdz4r8", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Great description and I find it relatable.  Myself, I played Far Cry 3 and 4 to completion and 4 to the 100% achievement.  What I notice about 4 as a comparison to your example, is that you usually end up doing most of the sidequest / exploration stuff *en route* to objectives that matter, or you start wishing you had that upgrade, skill point, or weapon before you move on to that one difficult mission.\n\nIn this way, you reach your personal ideal level of completion *at the same time* as you are ready to advance to the final fight or game-end.  Game-end doesn't leave you feeling like you still have grinding to do - there may be some leftover missions that you didn't do, but you'll do them because they're *interesting challenges* and not because they are obvious attempts to prolong the game's length.  Or you won't do them at all, and won't mind, because you've had your fill.  This probably leads to feeling a higher sense of \"peak-ending\" as you simultaneously end the game and also know you've done everything *you wanted to* do.  \n\nThe Arena is the exception to this rule, the one place with a long-lasting grindout that adds little to any sense of completion, but can be a really good challenge.\n\nPeople have begun to really rally the hate flag on Ubisoft's open-world formula, but I feel they have achieved a terrific balance and I enjoyed every minute of those two games.  \n\nThe MMO-FPS I play is always punctuated by many exciting moments throughout the course of a play session, and I'll be the first to admit I remember those awesome saves or plays we made, far more than I remember the times we were getting trounced, or the wasted time spent travelling or holding a point for what feels like hours.", "edited": 1492460199.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great description and I find it relatable.  Myself, I played Far Cry 3 and 4 to completion and 4 to the 100% achievement.  What I notice about 4 as a comparison to your example, is that you usually end up doing most of the sidequest / exploration stuff &lt;em&gt;en route&lt;/em&gt; to objectives that matter, or you start wishing you had that upgrade, skill point, or weapon before you move on to that one difficult mission.&lt;/p&gt;\n\n&lt;p&gt;In this way, you reach your personal ideal level of completion &lt;em&gt;at the same time&lt;/em&gt; as you are ready to advance to the final fight or game-end.  Game-end doesn&amp;#39;t leave you feeling like you still have grinding to do - there may be some leftover missions that you didn&amp;#39;t do, but you&amp;#39;ll do them because they&amp;#39;re &lt;em&gt;interesting challenges&lt;/em&gt; and not because they are obvious attempts to prolong the game&amp;#39;s length.  Or you won&amp;#39;t do them at all, and won&amp;#39;t mind, because you&amp;#39;ve had your fill.  This probably leads to feeling a higher sense of &amp;quot;peak-ending&amp;quot; as you simultaneously end the game and also know you&amp;#39;ve done everything &lt;em&gt;you wanted to&lt;/em&gt; do.  &lt;/p&gt;\n\n&lt;p&gt;The Arena is the exception to this rule, the one place with a long-lasting grindout that adds little to any sense of completion, but can be a really good challenge.&lt;/p&gt;\n\n&lt;p&gt;People have begun to really rally the hate flag on Ubisoft&amp;#39;s open-world formula, but I feel they have achieved a terrific balance and I enjoyed every minute of those two games.  &lt;/p&gt;\n\n&lt;p&gt;The MMO-FPS I play is always punctuated by many exciting moments throughout the course of a play session, and I&amp;#39;ll be the first to admit I remember those awesome saves or plays we made, far more than I remember the times we were getting trounced, or the wasted time spent travelling or holding a point for what feels like hours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge1md2", "score_hidden": true, "stickied": false, "created": 1492488806.0, "created_utc": 1492460006.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdz4r8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "turtlespace", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This is a really interesting comparison, and I think it might explain the prevalence of a certain type of game that gets relatively good reviews, sells well, is played a lot, but most of the discussion around it online is negative. I would include games like The Division, Destiny, Diablo 3, and a number of others in this category. \n\nThese games are really susceptible to having an overall negative impression from players despite high playtimes and popularity, I think because of the effect you describe. They kind of encourage an \"endless\" playtime, you can always grind for more stuff and get better gear in those games - so rather than stopping when the game says its over like most games, players play this type of game until they're bored of it or frustrated with it. \n\nThis leads to a long stretch of being unhappy with the game before they stop playing it. It's hard to end your experience with this type of game on a high note, because you are encouraged to keep playing after the games best moments are over with, and because of this players last moments and overall impression of the game will be of being bored or frustrated or whatever problem caused them to stop playing. \n\nYou don't often see similar complaints with other types of \"endless\" games - because the experience there is more uniform. Spelunky, Binding of Isaac, and games like it don't frontload the experience with great levels and missions and then encourage players to keep going after that content is exhausted. Players overall impression of those games will remain more positive after they're bored of playing them because there was never an obvious dropoff in content and quality. \n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a really interesting comparison, and I think it might explain the prevalence of a certain type of game that gets relatively good reviews, sells well, is played a lot, but most of the discussion around it online is negative. I would include games like The Division, Destiny, Diablo 3, and a number of others in this category. &lt;/p&gt;\n\n&lt;p&gt;These games are really susceptible to having an overall negative impression from players despite high playtimes and popularity, I think because of the effect you describe. They kind of encourage an &amp;quot;endless&amp;quot; playtime, you can always grind for more stuff and get better gear in those games - so rather than stopping when the game says its over like most games, players play this type of game until they&amp;#39;re bored of it or frustrated with it. &lt;/p&gt;\n\n&lt;p&gt;This leads to a long stretch of being unhappy with the game before they stop playing it. It&amp;#39;s hard to end your experience with this type of game on a high note, because you are encouraged to keep playing after the games best moments are over with, and because of this players last moments and overall impression of the game will be of being bored or frustrated or whatever problem caused them to stop playing. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t often see similar complaints with other types of &amp;quot;endless&amp;quot; games - because the experience there is more uniform. Spelunky, Binding of Isaac, and games like it don&amp;#39;t frontload the experience with great levels and missions and then encourage players to keep going after that content is exhausted. Players overall impression of those games will remain more positive after they&amp;#39;re bored of playing them because there was never an obvious dropoff in content and quality. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdz4r8", "score_hidden": true, "stickied": false, "created": 1492486003.0, "created_utc": 1492457203.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgeib73", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "indeedwatson", "parent_id": "t1_dgehgap", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Those descriptions of smb sound pretty similar to descriptions of dks. It is pointing out the difficulty, but it is not *why* it is popular. I think some better examples of what you're trying to say would be games like I wanna be the guy, or even Dustforce.\n\n&gt;Further, there is very little in Dark Souls that requires any kind of significant increase in mechanical skill, even SL1 runs. The actual mechanics don't change much, it just requires you to be very, very consistent; this is a skill in and of itself, but it's a different skill. It's about being able to precisely execute a relatively simple set of commands time and again without a mistake.\n\nHave you done a challenge run? It's not really the same in some ways. Sure the world itself doesn't change, but the fact that you will always pretty much get one shot changes how you have to approach things. The world doesn't change but how you interact with it does by your limitations. In SMB you can't really change your limitations much because you're already pretty limited in what you can do, so the world is what gets harder, things get tighter. But the core mechanics themselves don't really change either.\n\n&gt;On the default difficulty for these games, this is mitigated by them not being terribly punishing\n\nThis is my whole point.\n\nDmc is faster for sure, but I don't think it's as precise. The movements of the characters are way more spectacular so you can't have the type of thing you seen in hitbox porn in dks, position in general is less important, or at least less precise, because you're dealing with tons of enemies and you yourself are way more bullet spongy, so to speak. But anyway, the type of difficulty is different for sure, and the higher ends might be more extreme in dmc, but the base difficulty of a normal playthrough of dmc is not harder than a normal playthrough of dks imo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those descriptions of smb sound pretty similar to descriptions of dks. It is pointing out the difficulty, but it is not &lt;em&gt;why&lt;/em&gt; it is popular. I think some better examples of what you&amp;#39;re trying to say would be games like I wanna be the guy, or even Dustforce.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Further, there is very little in Dark Souls that requires any kind of significant increase in mechanical skill, even SL1 runs. The actual mechanics don&amp;#39;t change much, it just requires you to be very, very consistent; this is a skill in and of itself, but it&amp;#39;s a different skill. It&amp;#39;s about being able to precisely execute a relatively simple set of commands time and again without a mistake.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Have you done a challenge run? It&amp;#39;s not really the same in some ways. Sure the world itself doesn&amp;#39;t change, but the fact that you will always pretty much get one shot changes how you have to approach things. The world doesn&amp;#39;t change but how you interact with it does by your limitations. In SMB you can&amp;#39;t really change your limitations much because you&amp;#39;re already pretty limited in what you can do, so the world is what gets harder, things get tighter. But the core mechanics themselves don&amp;#39;t really change either.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;On the default difficulty for these games, this is mitigated by them not being terribly punishing&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is my whole point.&lt;/p&gt;\n\n&lt;p&gt;Dmc is faster for sure, but I don&amp;#39;t think it&amp;#39;s as precise. The movements of the characters are way more spectacular so you can&amp;#39;t have the type of thing you seen in hitbox porn in dks, position in general is less important, or at least less precise, because you&amp;#39;re dealing with tons of enemies and you yourself are way more bullet spongy, so to speak. But anyway, the type of difficulty is different for sure, and the higher ends might be more extreme in dmc, but the base difficulty of a normal playthrough of dmc is not harder than a normal playthrough of dks imo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeib73", "score_hidden": true, "stickied": false, "created": 1492509425.0, "created_utc": 1492480625.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgen1lw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KDBA", "parent_id": "t1_dgehgap", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; But it's less difficult than it is punishing\n\nAs a *fan* of Dark Souls I've been saying this to people for years. It's one of the reasons I like it.\n\nYou don't need to boringly grind mechanical skill to microsecond precision, you just need to actually bother to *learn* from your mistakes, and once you do you're golden.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But it&amp;#39;s less difficult than it is punishing&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As a &lt;em&gt;fan&lt;/em&gt; of Dark Souls I&amp;#39;ve been saying this to people for years. It&amp;#39;s one of the reasons I like it.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need to boringly grind mechanical skill to microsecond precision, you just need to actually bother to &lt;em&gt;learn&lt;/em&gt; from your mistakes, and once you do you&amp;#39;re golden.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgen1lw", "score_hidden": true, "stickied": false, "created": 1492515327.0, "created_utc": 1492486527.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehgap", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSlippiestFists", "parent_id": "t1_dgeffbq", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I understand the point you're making and I can agree with part of it, but there are a number of points I have to disagree with:\n\n&gt; indeed SMB is insanely popular and its fame isn't for its difficulty.\n\nThat is absolutely where it's fame came from, especially early on.  Look at its metacritic summary:\n\n&gt;Summary: Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux.\n\nor its reviews:\n\n&gt;Super Meat Boy's difficulty will likely turn off some gamers. But if you like your 2D platformers challenging and rewarding then you'll be hard pressed to find a better game out there.\n\n-\n\n&gt;This game is most certainly not for everyone--if you can't handle extremely hard games, you're better off marveling at this spectacle from a distance--but those who can stomach the difficult and appreciate the bizarre will take every ounce of punishment Super Meat Boy dishes out and beg for more.\n\n-\n\n&gt;Even though Super Meat Boy will make most casual players shy away from it due to its extreme, raw (pun intended) level of difficulty, there's plenty of content to dig through and it's all well worth the effort.\n\nLater levels in Super Meat Boy require a level of precision in their jumps that most gamers are not used to.  Almost nothing in Dark Souls follows this: the vast majority of gameplay is not intended to be timed to the frame or difficult mechanically.  Combat is just basic movement, shielding, dodging, and attacking; none of this requires any kind of real precision, and you can watch even basic players pick it up and play it relatively quickly.\n\nFurther, there is very little in Dark Souls that requires any kind of significant increase in mechanical skill, even SL1 runs.  The actual mechanics don't change much, it just requires you to be very, very consistent; this is a skill in and of itself, but it's a different skill.  It's about being able to precisely execute a relatively simple set of commands time and again without a mistake.\n\nOn the other hand, Bayonetta or any other character action game generally requires a much tighter set of timing.  The game moves much quicker, and there's much less time to react to a larger amount of stimuli.  On the default difficulty for these games, this is mitigated by them not being terribly punishing; you can take a number of hits without dying, and there are plenty of items that can heal you up that can be purchased from the shop.  This means most players can get through the game, even without being particularly proficient, but that doesn't change the fact that the skill set required is a different one than Dark Souls.\n\nAnd that's my central point: it's not that Dark Souls is an easy game.  It's not.  But it's less difficult than it is punishing; very little in it is overly difficult to perform, even on harder difficulty levels, but failure to perform results in extremely harsh consequences.  By contrast, games like Bayonetta or DMC possess a great number of mechanics that require an extremely high level of dexterity.  As the difficulty level goes up you fight faster enemies with different mechanics (ie, Devil Trigger enemies are faster and nearly impossible to stagger on Dante Must Die difficulty), and the result is that you must be able to perform a very high number of precise actions in a very short span of time.  I have no hard evidence, but I would posit that consistently performing a few simple actions repeatedly is less difficult than consistently performing a high number of more complicated actions repeatedly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand the point you&amp;#39;re making and I can agree with part of it, but there are a number of points I have to disagree with:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;indeed SMB is insanely popular and its fame isn&amp;#39;t for its difficulty.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is absolutely where it&amp;#39;s fame came from, especially early on.  Look at its metacritic summary:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Summary: Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who&amp;#39;s trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;or its reviews:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Super Meat Boy&amp;#39;s difficulty will likely turn off some gamers. But if you like your 2D platformers challenging and rewarding then you&amp;#39;ll be hard pressed to find a better game out there.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This game is most certainly not for everyone--if you can&amp;#39;t handle extremely hard games, you&amp;#39;re better off marveling at this spectacle from a distance--but those who can stomach the difficult and appreciate the bizarre will take every ounce of punishment Super Meat Boy dishes out and beg for more.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Even though Super Meat Boy will make most casual players shy away from it due to its extreme, raw (pun intended) level of difficulty, there&amp;#39;s plenty of content to dig through and it&amp;#39;s all well worth the effort.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Later levels in Super Meat Boy require a level of precision in their jumps that most gamers are not used to.  Almost nothing in Dark Souls follows this: the vast majority of gameplay is not intended to be timed to the frame or difficult mechanically.  Combat is just basic movement, shielding, dodging, and attacking; none of this requires any kind of real precision, and you can watch even basic players pick it up and play it relatively quickly.&lt;/p&gt;\n\n&lt;p&gt;Further, there is very little in Dark Souls that requires any kind of significant increase in mechanical skill, even SL1 runs.  The actual mechanics don&amp;#39;t change much, it just requires you to be very, very consistent; this is a skill in and of itself, but it&amp;#39;s a different skill.  It&amp;#39;s about being able to precisely execute a relatively simple set of commands time and again without a mistake.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, Bayonetta or any other character action game generally requires a much tighter set of timing.  The game moves much quicker, and there&amp;#39;s much less time to react to a larger amount of stimuli.  On the default difficulty for these games, this is mitigated by them not being terribly punishing; you can take a number of hits without dying, and there are plenty of items that can heal you up that can be purchased from the shop.  This means most players can get through the game, even without being particularly proficient, but that doesn&amp;#39;t change the fact that the skill set required is a different one than Dark Souls.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s my central point: it&amp;#39;s not that Dark Souls is an easy game.  It&amp;#39;s not.  But it&amp;#39;s less difficult than it is punishing; very little in it is overly difficult to perform, even on harder difficulty levels, but failure to perform results in extremely harsh consequences.  By contrast, games like Bayonetta or DMC possess a great number of mechanics that require an extremely high level of dexterity.  As the difficulty level goes up you fight faster enemies with different mechanics (ie, Devil Trigger enemies are faster and nearly impossible to stagger on Dante Must Die difficulty), and the result is that you must be able to perform a very high number of precise actions in a very short span of time.  I have no hard evidence, but I would posit that consistently performing a few simple actions repeatedly is less difficult than consistently performing a high number of more complicated actions repeatedly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgehgap", "score_hidden": true, "stickied": false, "created": 1492508401.0, "created_utc": 1492479601.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeffbq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "indeedwatson", "parent_id": "t1_dge7fq3", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "The thing about those games you mentioned is not that they're exactly harder, it's that they encourage mastery. They're more arcade and gamey than Dark Souls, so through the HUD, points system, replays, etc, they encourage you to polish your skills.\n\nI wouldn't say SMB or DMC are any harder than DkS on a casual playthrough, indeed SMB is insanely popular and its fame isn't for its difficulty.\n\nDks refrains from using non-game elements to encourage mastery, but nonetheless the possibility is there. If you've done any challenge runs, such as beating the game at level 1, I would compare the difficulty with the higher levels of those other games, specially if you move onto NG+. It's also worth pointing out that Dark Souls 2 had a covenant which made the game way harder as well, so that's the only instance where they push you to challenge yourself beyond the regular path of the game, but normally you have to seek out that mastery.\n\nComparing casual playthroughs of dks, smb and dmc, they're all similar difficulty to me. It's when you push the envelop that they get harder, and they all have room for that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing about those games you mentioned is not that they&amp;#39;re exactly harder, it&amp;#39;s that they encourage mastery. They&amp;#39;re more arcade and gamey than Dark Souls, so through the HUD, points system, replays, etc, they encourage you to polish your skills.&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t say SMB or DMC are any harder than DkS on a casual playthrough, indeed SMB is insanely popular and its fame isn&amp;#39;t for its difficulty.&lt;/p&gt;\n\n&lt;p&gt;Dks refrains from using non-game elements to encourage mastery, but nonetheless the possibility is there. If you&amp;#39;ve done any challenge runs, such as beating the game at level 1, I would compare the difficulty with the higher levels of those other games, specially if you move onto NG+. It&amp;#39;s also worth pointing out that Dark Souls 2 had a covenant which made the game way harder as well, so that&amp;#39;s the only instance where they push you to challenge yourself beyond the regular path of the game, but normally you have to seek out that mastery.&lt;/p&gt;\n\n&lt;p&gt;Comparing casual playthroughs of dks, smb and dmc, they&amp;#39;re all similar difficulty to me. It&amp;#39;s when you push the envelop that they get harder, and they all have room for that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeffbq", "score_hidden": true, "stickied": false, "created": 1492505867.0, "created_utc": 1492477067.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgecoq1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "YourNightmare_", "parent_id": "t1_dge7fq3", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "You nailed my thoughts exactly, thanks for the input. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You nailed my thoughts exactly, thanks for the input. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgecoq1", "score_hidden": true, "stickied": false, "created": 1492502432.0, "created_utc": 1492473632.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge7fq3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSlippiestFists", "parent_id": "t1_dge6sr4", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yeah, and it can be argued that the game not properly incentivizing more experimentation (and it fact, in some ways actively punishing it) is indeed a failure of design.  It's sort of odd honestly, that they put so many options into it then go out of their way to make many of them a pain to use.  \n\nThe other thing about Dark Souls that I think leads to its incredibly positive reception is that they're the easiest hard games you can play, if that makes sense.  I mean that in the sense that yes, they're generally quite punishing, but as you noted the actual gameplay itself isn't particularly challenging moment to moment.  The trick is in learning the game's shenanigans and how to approach various situations.  There's a reason that your first Souls game is always the hardest; because the lessons carry forward from one to the next pretty easily.  \n\nMeanwhile, compare this to something like Super Meat Boy; the game isn't punishing at all (death sets you back only a few seconds), but later levels require a level of precision and mechanical skill that large chunks of players simply don't possess.  Or at least not without a shit ton of practice and time.  This is also true of things like Bayonetta or Devil May Cry.\n\nAs a result, Dark Souls manages to *feel* like a really difficult game without actually being truly difficult, and that leads to a strong sense of accomplishment in a playerbase that would end up angry and discouraged at more traditionally difficult games.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, and it can be argued that the game not properly incentivizing more experimentation (and it fact, in some ways actively punishing it) is indeed a failure of design.  It&amp;#39;s sort of odd honestly, that they put so many options into it then go out of their way to make many of them a pain to use.  &lt;/p&gt;\n\n&lt;p&gt;The other thing about Dark Souls that I think leads to its incredibly positive reception is that they&amp;#39;re the easiest hard games you can play, if that makes sense.  I mean that in the sense that yes, they&amp;#39;re generally quite punishing, but as you noted the actual gameplay itself isn&amp;#39;t particularly challenging moment to moment.  The trick is in learning the game&amp;#39;s shenanigans and how to approach various situations.  There&amp;#39;s a reason that your first Souls game is always the hardest; because the lessons carry forward from one to the next pretty easily.  &lt;/p&gt;\n\n&lt;p&gt;Meanwhile, compare this to something like Super Meat Boy; the game isn&amp;#39;t punishing at all (death sets you back only a few seconds), but later levels require a level of precision and mechanical skill that large chunks of players simply don&amp;#39;t possess.  Or at least not without a shit ton of practice and time.  This is also true of things like Bayonetta or Devil May Cry.&lt;/p&gt;\n\n&lt;p&gt;As a result, Dark Souls manages to &lt;em&gt;feel&lt;/em&gt; like a really difficult game without actually being truly difficult, and that leads to a strong sense of accomplishment in a playerbase that would end up angry and discouraged at more traditionally difficult games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge7fq3", "score_hidden": true, "stickied": false, "created": 1492495632.0, "created_utc": 1492466832.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgeikq5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ArcanumMBD", "parent_id": "t1_dge6sr4", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt;  it's just that I found cheesing through the game so effective that I didn't try anything else. I think once I got the Havel shield I literally didn't switch it for anything else the entire game.\n\nYeah that's your problem right there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s just that I found cheesing through the game so effective that I didn&amp;#39;t try anything else. I think once I got the Havel shield I literally didn&amp;#39;t switch it for anything else the entire game.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah that&amp;#39;s your problem right there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeikq5", "score_hidden": true, "stickied": false, "created": 1492509735.0, "created_utc": 1492480935.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6sr4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dge6le7", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "That's fair. Despite the criticism I'm heaping on the game, from an objective standpoint I can see what people would enjoy about the combat. it does allow for a lot of variety - it's just that I found cheesing through the game so effective that I didn't try anything else. I think once I got the Havel shield I literally didn't switch it for anything else the entire game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s fair. Despite the criticism I&amp;#39;m heaping on the game, from an objective standpoint I can see what people would enjoy about the combat. it does allow for a lot of variety - it&amp;#39;s just that I found cheesing through the game so effective that I didn&amp;#39;t try anything else. I think once I got the Havel shield I literally didn&amp;#39;t switch it for anything else the entire game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge6sr4", "score_hidden": true, "stickied": false, "created": 1492494841.0, "created_utc": 1492466041.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6le7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSlippiestFists", "parent_id": "t1_dge6191", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt; But hey, people seem to love them so maybe there’s some mystical quality that I am not seeing.\n\nIt's the combat system.  Dislike it or not, but there's a fair bit more depth in there than you're letting on.  The weapons all have different attack ranges, timings, movesets, etc.  Yes, you can just shield and circle people forever, but you don't have to, and playing through the game as a naked guy who dodges through everything is a lot more fun.  It's the sort of system that gives back what you put into it.  That's maybe not your cup of tea, and that's fine, but there's a lot of fun to be had in there if you want to play around with it.\n\nI do agree they get a fairly annoying variety of fan worship on reddit, but there's a reason that the games are so well-received both critically and by fans.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But hey, people seem to love them so maybe there’s some mystical quality that I am not seeing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s the combat system.  Dislike it or not, but there&amp;#39;s a fair bit more depth in there than you&amp;#39;re letting on.  The weapons all have different attack ranges, timings, movesets, etc.  Yes, you can just shield and circle people forever, but you don&amp;#39;t have to, and playing through the game as a naked guy who dodges through everything is a lot more fun.  It&amp;#39;s the sort of system that gives back what you put into it.  That&amp;#39;s maybe not your cup of tea, and that&amp;#39;s fine, but there&amp;#39;s a lot of fun to be had in there if you want to play around with it.&lt;/p&gt;\n\n&lt;p&gt;I do agree they get a fairly annoying variety of fan worship on reddit, but there&amp;#39;s a reason that the games are so well-received both critically and by fans.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge6le7", "score_hidden": true, "stickied": false, "created": 1492494581.0, "created_utc": 1492465781.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6191", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dge54ts", "subreddit_name_prefixed": "r/truegaming", "controversiality": 1, "body": "I don't think it's going too far at all, and in fact, the game and the series as a whole are imo vastly overhyped in this sub and reddit in general. Yes, the level design is good (mostly), but it's pretty bleh in other areas. Combat quickly gets dull and you can use a similar strategy for pretty much all minor enemies aside from bosses. I pretty much lockon-strafe/circle-attacked by way through the whole game and it was tedious and boring. Visuals are nothing to write home about but then again it's an older game so that can be excused. I don't recall any of the music at all, and the lore is generic dark fantasy 101. I've read wiki summaries and seen youtube videos of the story and it's nothing you can't find in the fantasy section of a bargain bookstore.\n\nGranted, I did enjoy certain sections - as I mentioned above Sen's Fortress and Anor Londo are excellently designed and fun to play, and there are some great boss fights. Overall though, taken as a whole the game is mediocre. Another tangentially related annoyance I have about the series is the fanbase. I find the fans of this game extremely touchy and sensitive with a strange refusal to accept any criticism about the series at all. Any criticism, however valid, is waved away with “oh that’s just how they MEANT the game to be”. Alright…I guess if they meant the game to have a plodding combat system, bland visuals, generic plot with the only discerning feature being the odd great level and enhanced difficulty, then mission successful. \n\nI haven’t even gone into the lackluster back half of the game after Ornstein and Smough. Every level after that was unmemorable with maybe the exception of Ariamis and with some mind-bogglingly bad design decisions (Bed of Chaos? What exactly were they smoking? Demon Ruins? Did they fall asleep while designing that stage?). So basically Dark Souls is a quarter of a good game. Subsequent games were more of the same, and only Bloodborne was slightly better, but not enough to merit completing.\n\nBut hey, people seem to love them so maybe there’s some mystical quality that I am not seeing.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think it&amp;#39;s going too far at all, and in fact, the game and the series as a whole are imo vastly overhyped in this sub and reddit in general. Yes, the level design is good (mostly), but it&amp;#39;s pretty bleh in other areas. Combat quickly gets dull and you can use a similar strategy for pretty much all minor enemies aside from bosses. I pretty much lockon-strafe/circle-attacked by way through the whole game and it was tedious and boring. Visuals are nothing to write home about but then again it&amp;#39;s an older game so that can be excused. I don&amp;#39;t recall any of the music at all, and the lore is generic dark fantasy 101. I&amp;#39;ve read wiki summaries and seen youtube videos of the story and it&amp;#39;s nothing you can&amp;#39;t find in the fantasy section of a bargain bookstore.&lt;/p&gt;\n\n&lt;p&gt;Granted, I did enjoy certain sections - as I mentioned above Sen&amp;#39;s Fortress and Anor Londo are excellently designed and fun to play, and there are some great boss fights. Overall though, taken as a whole the game is mediocre. Another tangentially related annoyance I have about the series is the fanbase. I find the fans of this game extremely touchy and sensitive with a strange refusal to accept any criticism about the series at all. Any criticism, however valid, is waved away with “oh that’s just how they MEANT the game to be”. Alright…I guess if they meant the game to have a plodding combat system, bland visuals, generic plot with the only discerning feature being the odd great level and enhanced difficulty, then mission successful. &lt;/p&gt;\n\n&lt;p&gt;I haven’t even gone into the lackluster back half of the game after Ornstein and Smough. Every level after that was unmemorable with maybe the exception of Ariamis and with some mind-bogglingly bad design decisions (Bed of Chaos? What exactly were they smoking? Demon Ruins? Did they fall asleep while designing that stage?). So basically Dark Souls is a quarter of a good game. Subsequent games were more of the same, and only Bloodborne was slightly better, but not enough to merit completing.&lt;/p&gt;\n\n&lt;p&gt;But hey, people seem to love them so maybe there’s some mystical quality that I am not seeing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge6191", "score_hidden": true, "stickied": false, "created": 1492493888.0, "created_utc": 1492465088.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge54ts", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "irvinne", "parent_id": "t1_dgdzwwv", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "\"Mediocre\" is a bit far, don't you think? It's not THAT bad. It certainly hasn't aged the best (IMO Bloodborne and Dark Souls 3 beat it in nearly all departments mechanically speaking) but it still holds up relatively well. A lot better than Demon's Souls, for sure.    \n   \nAnd even discounting the gameplay *(the horror)* the game still gets a lot of points for visual design, music, unusual storytelling and a well put together world with a interesting lore. It has the reputation it has because it's a very memorable game in a lot of ways, not just because of its difficulty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Mediocre&amp;quot; is a bit far, don&amp;#39;t you think? It&amp;#39;s not THAT bad. It certainly hasn&amp;#39;t aged the best (IMO Bloodborne and Dark Souls 3 beat it in nearly all departments mechanically speaking) but it still holds up relatively well. A lot better than Demon&amp;#39;s Souls, for sure.    &lt;/p&gt;\n\n&lt;p&gt;And even discounting the gameplay &lt;em&gt;(the horror)&lt;/em&gt; the game still gets a lot of points for visual design, music, unusual storytelling and a well put together world with a interesting lore. It has the reputation it has because it&amp;#39;s a very memorable game in a lot of ways, not just because of its difficulty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge54ts", "score_hidden": true, "stickied": false, "created": 1492492795.0, "created_utc": 1492463995.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgejnt1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dgeciy8", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "&gt;Every aspect of the game, from how you start, how your character looks, how the multiplayer works, the mechanics of acquiring souls, the exploration of a dead world, the punctuation of relief through finding bonfires, the soundtrack (and lack of it through most of the game), the way the world is mostly indifferent to you, the bleak ending, the obscure lore that you have to put together through scraps of descriptions in items and through item placements, and how you have to guess NPC and bosses motivations and relationships through their locations and what items they guard or hold.\n\nI guess it's subjective then, because none of these factors really struck any sort of chord for me at all. I feel like people prescribe more artificial meaning to the world and the lore than there actually is. The story felt pretty half-assed to me anyway. Either commit to a story or don't tell it at all. It's irrelevant to playing the game anyway. It's just to me the whole felt just as mediocre as the parts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Every aspect of the game, from how you start, how your character looks, how the multiplayer works, the mechanics of acquiring souls, the exploration of a dead world, the punctuation of relief through finding bonfires, the soundtrack (and lack of it through most of the game), the way the world is mostly indifferent to you, the bleak ending, the obscure lore that you have to put together through scraps of descriptions in items and through item placements, and how you have to guess NPC and bosses motivations and relationships through their locations and what items they guard or hold.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I guess it&amp;#39;s subjective then, because none of these factors really struck any sort of chord for me at all. I feel like people prescribe more artificial meaning to the world and the lore than there actually is. The story felt pretty half-assed to me anyway. Either commit to a story or don&amp;#39;t tell it at all. It&amp;#39;s irrelevant to playing the game anyway. It&amp;#39;s just to me the whole felt just as mediocre as the parts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgejnt1", "score_hidden": true, "stickied": false, "created": 1492510994.0, "created_utc": 1492482194.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeciy8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "indeedwatson", "parent_id": "t1_dgdzwwv", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Well I'm not sure where to start because to me its place is entirely warranted.\n\nWhat you've done is listed things, mainly areas, which can be considered flaws. And you're right, some of those individual parts (mainly the demon ruins, there's nothing particularly bad or different in quality about Blighttown and New Londo, they provide unique atmospheric worlds which are intricate and provide their own personality by having different challenges and enemies that match the area in design and tone) are flawed, as are many others that you haven't mentioned here.\n\nBut the real reason Dark Souls is so good (I'm not talking about popular) is not Anor Londo, it's not the bosses, not even the difficutly, the combat or the intertwined level design or the varied mobs and bosses or the memorable music; it's not any individual component. The reason it's so good is that in art the whole is more important than the sum of its parts.\n\nEvery aspect of the game, from how you start, how your character looks, how the multiplayer works, the mechanics of acquiring souls, the exploration of a dead world, the punctuation of relief through finding bonfires, the soundtrack (and lack of it through most of the game), the way the world is mostly indifferent to you, the bleak ending, the obscure lore that you have to put together through scraps of descriptions in items and through item placements, and how you have to guess NPC and bosses motivations and relationships through their locations and what items they guard or hold.\n\nAll these work together to paint a world for you to experience. It's more than a challenge through tight combat mechanics, as they too serve to deliver the message of this world of decay and struggle. All these parts work in unison according to a greater core idea or concept, and this is what very often defines a great work, regardless if it's music, movies, novels or games.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;m not sure where to start because to me its place is entirely warranted.&lt;/p&gt;\n\n&lt;p&gt;What you&amp;#39;ve done is listed things, mainly areas, which can be considered flaws. And you&amp;#39;re right, some of those individual parts (mainly the demon ruins, there&amp;#39;s nothing particularly bad or different in quality about Blighttown and New Londo, they provide unique atmospheric worlds which are intricate and provide their own personality by having different challenges and enemies that match the area in design and tone) are flawed, as are many others that you haven&amp;#39;t mentioned here.&lt;/p&gt;\n\n&lt;p&gt;But the real reason Dark Souls is so good (I&amp;#39;m not talking about popular) is not Anor Londo, it&amp;#39;s not the bosses, not even the difficutly, the combat or the intertwined level design or the varied mobs and bosses or the memorable music; it&amp;#39;s not any individual component. The reason it&amp;#39;s so good is that in art the whole is more important than the sum of its parts.&lt;/p&gt;\n\n&lt;p&gt;Every aspect of the game, from how you start, how your character looks, how the multiplayer works, the mechanics of acquiring souls, the exploration of a dead world, the punctuation of relief through finding bonfires, the soundtrack (and lack of it through most of the game), the way the world is mostly indifferent to you, the bleak ending, the obscure lore that you have to put together through scraps of descriptions in items and through item placements, and how you have to guess NPC and bosses motivations and relationships through their locations and what items they guard or hold.&lt;/p&gt;\n\n&lt;p&gt;All these work together to paint a world for you to experience. It&amp;#39;s more than a challenge through tight combat mechanics, as they too serve to deliver the message of this world of decay and struggle. All these parts work in unison according to a greater core idea or concept, and this is what very often defines a great work, regardless if it&amp;#39;s music, movies, novels or games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeciy8", "score_hidden": true, "stickied": false, "created": 1492502225.0, "created_utc": 1492473425.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzwwv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t1_dgdy6xj", "subreddit_name_prefixed": "r/truegaming", "controversiality": 1, "body": "Would also include Dark Souls in this theory, but because I believe that, having beaten it, it's a pretty mediocre game whose reputation has been inflated because of the difficulty level. There are definitely high points - Undead Burg/Parish, Sen's Fortress and Anor Londo are great level designs, and there are some great bosses like Ornstein and Smough, Four Kings, Gwynn etc. However, the second half of the game is EXTREMELY lackluster, and even the first half is punctuated by some pretty shitty gameplay (the entirety of Blighttown and New Londo Ruins, the boring nothing of Lower Burg and Darkroot Forest etc.). Those few boss fights and levels are pretty solid, but I guess for some gamers good enough to elevate the game into some kind of classic - which I don't think it's even close to being. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would also include Dark Souls in this theory, but because I believe that, having beaten it, it&amp;#39;s a pretty mediocre game whose reputation has been inflated because of the difficulty level. There are definitely high points - Undead Burg/Parish, Sen&amp;#39;s Fortress and Anor Londo are great level designs, and there are some great bosses like Ornstein and Smough, Four Kings, Gwynn etc. However, the second half of the game is EXTREMELY lackluster, and even the first half is punctuated by some pretty shitty gameplay (the entirety of Blighttown and New Londo Ruins, the boring nothing of Lower Burg and Darkroot Forest etc.). Those few boss fights and levels are pretty solid, but I guess for some gamers good enough to elevate the game into some kind of classic - which I don&amp;#39;t think it&amp;#39;s even close to being. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdzwwv", "score_hidden": true, "stickied": false, "created": 1492486888.0, "created_utc": 1492458088.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy6xj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "indeedwatson", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'm guessing more people will mention dark souls, I think what you describe is a big part of the appeal of the series. While in your example the negative aspect you describe is boredom, in dks I have found long stretches of my play time are colored by frustration or even rage (I think we've all been there), and I often thought to myself why do I do this? And the answer of course comes after 20, 30, 40 deaths to the same boss until the death is theirs instead of yours. Then you get to experience a cocktail of accomplishment, relief, closure and even fulfilled revenge.\n\nNow what's interesting is that along the path you'll have a few fights where you're literally 1 hit away from victory and somehow you die with 3 estus in your pocket. It can be infuriating but also very tense, so while the victory is the main peak that will influence the impact the game has in your memory, those \"almost\" peaks are also very important.\n\nI'm not sure the actual ending of the game is very relevant in this context, at least in my particular example.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m guessing more people will mention dark souls, I think what you describe is a big part of the appeal of the series. While in your example the negative aspect you describe is boredom, in dks I have found long stretches of my play time are colored by frustration or even rage (I think we&amp;#39;ve all been there), and I often thought to myself why do I do this? And the answer of course comes after 20, 30, 40 deaths to the same boss until the death is theirs instead of yours. Then you get to experience a cocktail of accomplishment, relief, closure and even fulfilled revenge.&lt;/p&gt;\n\n&lt;p&gt;Now what&amp;#39;s interesting is that along the path you&amp;#39;ll have a few fights where you&amp;#39;re literally 1 hit away from victory and somehow you die with 3 estus in your pocket. It can be infuriating but also very tense, so while the victory is the main peak that will influence the impact the game has in your memory, those &amp;quot;almost&amp;quot; peaks are also very important.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure the actual ending of the game is very relevant in this context, at least in my particular example.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdy6xj", "score_hidden": true, "stickied": false, "created": 1492484928.0, "created_utc": 1492456128.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdyfxo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fabrar", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Reading about this theory, I think for me anyway, this rule definitely applies. I'll give one example where I've experienced this:\n\n**Grand Theft Auto** - I'm going to compare GTA San Andreas and GTA 4 here. GTA SA is one of my favorite games of all time but from an objective standpoints, it has a lot of flaws. The gameplay mechanics like shooting and melee are clumsy and awkward, there are many bugs and glitches, and the graphics were pretty underwhelming even when the game was released. However, the game had so many \"peaks\" in the forms of some unforgettable missions - the one where you infiltrate the military base to get the jetpack, the one where you do an amphibious assault of the ship owned by the Asian gang, the one where you're burning a field of weed before the cops get there, the one where you ride your bike into a plane and sabotage it from the inside - the list goes on and on. GTA SA also had a killer ending with another awesome mission. I played this game more than a decade ago and I still remember these set pieces and characters vividly.\n\nCompare this with GTA 4, and even GTA 5. I enjoyed these games on their own merits and again, from a technical standpoint, they're superior to SA in every way - better visuals, better combat mechanics, better driving etc. However, they didn't have very many missions that, for me, anyway, reached the crazy highs of the ones in SA. So although I enjoyed playing them, and objectively speaking, they're BETTER in many ways, the SA missions are what I remember the most, that's the game with the most peaks and the best end for me thus it will also remain the best game in the series for me. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading about this theory, I think for me anyway, this rule definitely applies. I&amp;#39;ll give one example where I&amp;#39;ve experienced this:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Grand Theft Auto&lt;/strong&gt; - I&amp;#39;m going to compare GTA San Andreas and GTA 4 here. GTA SA is one of my favorite games of all time but from an objective standpoints, it has a lot of flaws. The gameplay mechanics like shooting and melee are clumsy and awkward, there are many bugs and glitches, and the graphics were pretty underwhelming even when the game was released. However, the game had so many &amp;quot;peaks&amp;quot; in the forms of some unforgettable missions - the one where you infiltrate the military base to get the jetpack, the one where you do an amphibious assault of the ship owned by the Asian gang, the one where you&amp;#39;re burning a field of weed before the cops get there, the one where you ride your bike into a plane and sabotage it from the inside - the list goes on and on. GTA SA also had a killer ending with another awesome mission. I played this game more than a decade ago and I still remember these set pieces and characters vividly.&lt;/p&gt;\n\n&lt;p&gt;Compare this with GTA 4, and even GTA 5. I enjoyed these games on their own merits and again, from a technical standpoint, they&amp;#39;re superior to SA in every way - better visuals, better combat mechanics, better driving etc. However, they didn&amp;#39;t have very many missions that, for me, anyway, reached the crazy highs of the ones in SA. So although I enjoyed playing them, and objectively speaking, they&amp;#39;re BETTER in many ways, the SA missions are what I remember the most, that&amp;#39;s the game with the most peaks and the best end for me thus it will also remain the best game in the series for me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdyfxo", "score_hidden": true, "stickied": false, "created": 1492485212.0, "created_utc": 1492456412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge3sic", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ice_Cold345", "parent_id": "t1_dgdyj6f", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I'm in that same boat of liking a ton of games and not exactly finishing them.  Most of the time, I'll stop about halfway-ish and won't pick the game up for nearly a year.  Most recently I did this Witcher 3, but I've also done it with every Rockstar sandbox game, minus GTAV, Jax 2, and Mass Effect 2 to name a few.\n\nMy biggest issue with a lot of games is that middle section is the part that kills it for me a lot.  The beginning can be insanely fun, but the middle is the part that I feel is often the place that I get sick of stuff.  It's also a reason I have restart-itis, where I get bored of a run after a few hours, so I want to restart it again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in that same boat of liking a ton of games and not exactly finishing them.  Most of the time, I&amp;#39;ll stop about halfway-ish and won&amp;#39;t pick the game up for nearly a year.  Most recently I did this Witcher 3, but I&amp;#39;ve also done it with every Rockstar sandbox game, minus GTAV, Jax 2, and Mass Effect 2 to name a few.&lt;/p&gt;\n\n&lt;p&gt;My biggest issue with a lot of games is that middle section is the part that kills it for me a lot.  The beginning can be insanely fun, but the middle is the part that I feel is often the place that I get sick of stuff.  It&amp;#39;s also a reason I have restart-itis, where I get bored of a run after a few hours, so I want to restart it again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge3sic", "score_hidden": true, "stickied": false, "created": 1492491222.0, "created_utc": 1492462422.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge27w8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "spriteguard", "parent_id": "t1_dgdyj6f", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I've found that quitting while I am still enjoying a game has a big positive impact on my gaming experience. I do speedruns, but I stop as soon as they stop being fun, which means I don't get a ton of world records but I don't end up hating every game I play either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve found that quitting while I am still enjoying a game has a big positive impact on my gaming experience. I do speedruns, but I stop as soon as they stop being fun, which means I don&amp;#39;t get a ton of world records but I don&amp;#39;t end up hating every game I play either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge27w8", "score_hidden": true, "stickied": false, "created": 1492489469.0, "created_utc": 1492460669.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge48zq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spooge", "parent_id": "t1_dgdyj6f", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This is an intriguing point and one that's often over looked. I'm not sure if it's just with this current generation of comupter games, but I remember when the end of a game meant the end. You were done. You could play through it again and perhaps complete it faster, but ultimately you had completed it and that was enough. Now, endings tend to be pretty vague! Okay, so you still get the credits but there's often a lot of unaswered questions! Many games leave you wanting a sequal, or a fix to a broken story ...Half Life 3? A games replayability, is often reliant on multiple endings, or even having no ending at all - take Minecraft, for example! You can 'complete' the game by defeating the Ender Dragon, but that's certainly not the end of your game. The same could be said for Rockstar and Bethesda - sure you can see the credits, but there's a load of stuff you missed, so go back and try again! Some games, upon completion, give you new items that would make you replay but with a slightly different approach, but you're still playing the same game. \n\nSequals, Updates, even patches are causing us to loose sight of what it means to finish a game, and you could argue the same for Movies and TV Series! I dunno? Maybe we're all expecting a bit too much? \n\nThere's a part of me that would be happy if Half Life 3 never came out.", "edited": 1492463733.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an intriguing point and one that&amp;#39;s often over looked. I&amp;#39;m not sure if it&amp;#39;s just with this current generation of comupter games, but I remember when the end of a game meant the end. You were done. You could play through it again and perhaps complete it faster, but ultimately you had completed it and that was enough. Now, endings tend to be pretty vague! Okay, so you still get the credits but there&amp;#39;s often a lot of unaswered questions! Many games leave you wanting a sequal, or a fix to a broken story ...Half Life 3? A games replayability, is often reliant on multiple endings, or even having no ending at all - take Minecraft, for example! You can &amp;#39;complete&amp;#39; the game by defeating the Ender Dragon, but that&amp;#39;s certainly not the end of your game. The same could be said for Rockstar and Bethesda - sure you can see the credits, but there&amp;#39;s a load of stuff you missed, so go back and try again! Some games, upon completion, give you new items that would make you replay but with a slightly different approach, but you&amp;#39;re still playing the same game. &lt;/p&gt;\n\n&lt;p&gt;Sequals, Updates, even patches are causing us to loose sight of what it means to finish a game, and you could argue the same for Movies and TV Series! I dunno? Maybe we&amp;#39;re all expecting a bit too much? &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a part of me that would be happy if Half Life 3 never came out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge48zq", "score_hidden": true, "stickied": false, "created": 1492491743.0, "created_utc": 1492462943.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyj6f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VincentGrayson", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "If find myself having the opposite experience. I buy and play a lot of games, but I tend to not finish them, and stop playing before I get sick of them. IMO, games tend to struggle with ending well.\n\nAs a result, I find that I like a lot of games, far more than most people I know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If find myself having the opposite experience. I buy and play a lot of games, but I tend to not finish them, and stop playing before I get sick of them. IMO, games tend to struggle with ending well.&lt;/p&gt;\n\n&lt;p&gt;As a result, I find that I like a lot of games, far more than most people I know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdyj6f", "score_hidden": true, "stickied": false, "created": 1492485314.0, "created_utc": 1492456514.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge3xy2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SvenHudson", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I recently bought Assassin's Creed Unity on sale and quit pretty late into it after realizing that I just wasn't having a lot of fun and I thought on reflection that the main reason for that was the way the series started asking you to rate every single mission you completed on a scale of one to five stars. I felt most missions were just adequate or mediocre and that rating window was like a constant reminder that I wasn't particularly enjoying the vast majority of the game, and wondered if maybe my fonder memories of earlier games were me only having conscious recollection of the fun bits. \n\nThat recent moment of self-awareness has me inclined to think I'm pretty damn susceptible to the this Peak-End rule you're describing.\n\nOr maybe Unity just sucked, I dunno.\n\nI will say that I don't think your examination of Dragon's Dogma is totally fair. I, for one, enjoy my time hiking in that and several other open world RPGs. It's nice to take in the sights and keep an eye out for special encounters or hidden detour spots and it's encouraging to effortlessly slaughter enemies who gave me trouble in the past.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recently bought Assassin&amp;#39;s Creed Unity on sale and quit pretty late into it after realizing that I just wasn&amp;#39;t having a lot of fun and I thought on reflection that the main reason for that was the way the series started asking you to rate every single mission you completed on a scale of one to five stars. I felt most missions were just adequate or mediocre and that rating window was like a constant reminder that I wasn&amp;#39;t particularly enjoying the vast majority of the game, and wondered if maybe my fonder memories of earlier games were me only having conscious recollection of the fun bits. &lt;/p&gt;\n\n&lt;p&gt;That recent moment of self-awareness has me inclined to think I&amp;#39;m pretty damn susceptible to the this Peak-End rule you&amp;#39;re describing.&lt;/p&gt;\n\n&lt;p&gt;Or maybe Unity just sucked, I dunno.&lt;/p&gt;\n\n&lt;p&gt;I will say that I don&amp;#39;t think your examination of Dragon&amp;#39;s Dogma is totally fair. I, for one, enjoy my time hiking in that and several other open world RPGs. It&amp;#39;s nice to take in the sights and keep an eye out for special encounters or hidden detour spots and it&amp;#39;s encouraging to effortlessly slaughter enemies who gave me trouble in the past.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge3xy2", "score_hidden": true, "stickied": false, "created": 1492491392.0, "created_utc": 1492462592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgeefp1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "orionsbelt05", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Personally, some of my favorite games have piss-poor endings. I was nodding in agreement while reading your post, and then I stopped to think about it, and realized that I didn't really agree.\n\nOne of my favorites of recent years is Shadow of Mordor, which had an absolute trash of a final boss fight, and even the final mission was disappointing because I was overpowered after having 100%ed the game. I just played through Dishonored three times in a row, and I still think on it fondly, but all three endings I got were pretty forgettable.\n\nBut I can see the truth in this in some games. I was going to call Portal out for not matching due to it's crummy final boss, but the \"end\" of Portal could be seen as the end-credits song, which is fantastic. And some other things, like a match in Overwatch, strongly lean on getting a good Peak-End experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, some of my favorite games have piss-poor endings. I was nodding in agreement while reading your post, and then I stopped to think about it, and realized that I didn&amp;#39;t really agree.&lt;/p&gt;\n\n&lt;p&gt;One of my favorites of recent years is Shadow of Mordor, which had an absolute trash of a final boss fight, and even the final mission was disappointing because I was overpowered after having 100%ed the game. I just played through Dishonored three times in a row, and I still think on it fondly, but all three endings I got were pretty forgettable.&lt;/p&gt;\n\n&lt;p&gt;But I can see the truth in this in some games. I was going to call Portal out for not matching due to it&amp;#39;s crummy final boss, but the &amp;quot;end&amp;quot; of Portal could be seen as the end-credits song, which is fantastic. And some other things, like a match in Overwatch, strongly lean on getting a good Peak-End experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeefp1", "score_hidden": true, "stickied": false, "created": 1492504643.0, "created_utc": 1492475843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgeftt2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nawara_Ven", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This makes me feel less like I'm taking crazy pills when I read about people playing 60+ hours of game, but hating the last 10 minutes, and then somehow letting 0.0028% of their game experience colour their overall view of the game.\n\nOf course, now I feel less crazy and more like an emotionless robot that doesn't seize upon the highs and lows in an instant that other humans do. Nuts!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This makes me feel less like I&amp;#39;m taking crazy pills when I read about people playing 60+ hours of game, but hating the last 10 minutes, and then somehow letting 0.0028% of their game experience colour their overall view of the game.&lt;/p&gt;\n\n&lt;p&gt;Of course, now I feel less crazy and more like an emotionless robot that doesn&amp;#39;t seize upon the highs and lows in an instant that other humans do. Nuts!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeftt2", "score_hidden": true, "stickied": false, "created": 1492506364.0, "created_utc": 1492477564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge0i5h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kessra", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I can offer a couple examples: Resident Evil 5 for the Peak-End rule, and The Witcher 3 for an incomplete experience. First, my initial playthrough of Resident Evil 5 was with a sibling, and together we completed the main campaign on launch day, playing well past midnight. After that cooperative euphoria, the game felt very underwhelming and poorly iterative of Resident Evil 4. However, RE5 is still a valid experience based solely on the narrative closing a circle starting with RE1. Chapters 5 and 6 are the most memorable (narrative-wise) because of the \"peak\" appearance of Wesker, complimented by the multi-fight finale. Therefore, it is easy to forget the daylight Chapters 1-4.\n\nThe Witcher 3 has been an incomplete experience for me because I began on the highest difficulty available, and found the combat pacing juxtaposed to the atmosphere surrounding Geralt as a professional monster hunter. The game died on its combat for me as Geralt's professional merit did not translate for every pirouette that connected with fleshy damage sponges. I attempted to restart the adventure at different difficulty settings in the hopes of achieving parity with Geralt's swordplay. Yet, having gone through multiple side quests in the first two zones, I forced myself to stick to the main events on these restarts, and my initial euphoria of jumping into an expansive, real-time RPG dwindled to a point of disinterest. \n\nThe \"best\" games I recognize from my personal catalogue set the foundations of quality I associate with functionality and design. Most of these games slot into a genre of real-time combat, establishing an exclusive glass ceiling for excellence wherein I anticipate new releases to be evolutions of systems for games that are one or two decades their senior. This is a fallacy, as games like The Witcher 3 and Final Fantasy XV have less conceptual origins in common with games like Onimusha or Devil May Cry.\n\nThe pleasant exception to this fallacy is the unexpected discoveries of systems for which I have no reference. By having no reference, these games that are indicative of complete separate genres are capable of affecting stronger ripples in my memory. So, one interpretation I would extend of my experiential memory is that having multiple, possibly foundational experiences in the same reference pool can desensitize the end-user to subsequent \"peaks\"  - games that might have stronger impacts should they not have to compete with earlier \"peaks\" in the same conglomerated space.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can offer a couple examples: Resident Evil 5 for the Peak-End rule, and The Witcher 3 for an incomplete experience. First, my initial playthrough of Resident Evil 5 was with a sibling, and together we completed the main campaign on launch day, playing well past midnight. After that cooperative euphoria, the game felt very underwhelming and poorly iterative of Resident Evil 4. However, RE5 is still a valid experience based solely on the narrative closing a circle starting with RE1. Chapters 5 and 6 are the most memorable (narrative-wise) because of the &amp;quot;peak&amp;quot; appearance of Wesker, complimented by the multi-fight finale. Therefore, it is easy to forget the daylight Chapters 1-4.&lt;/p&gt;\n\n&lt;p&gt;The Witcher 3 has been an incomplete experience for me because I began on the highest difficulty available, and found the combat pacing juxtaposed to the atmosphere surrounding Geralt as a professional monster hunter. The game died on its combat for me as Geralt&amp;#39;s professional merit did not translate for every pirouette that connected with fleshy damage sponges. I attempted to restart the adventure at different difficulty settings in the hopes of achieving parity with Geralt&amp;#39;s swordplay. Yet, having gone through multiple side quests in the first two zones, I forced myself to stick to the main events on these restarts, and my initial euphoria of jumping into an expansive, real-time RPG dwindled to a point of disinterest. &lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;best&amp;quot; games I recognize from my personal catalogue set the foundations of quality I associate with functionality and design. Most of these games slot into a genre of real-time combat, establishing an exclusive glass ceiling for excellence wherein I anticipate new releases to be evolutions of systems for games that are one or two decades their senior. This is a fallacy, as games like The Witcher 3 and Final Fantasy XV have less conceptual origins in common with games like Onimusha or Devil May Cry.&lt;/p&gt;\n\n&lt;p&gt;The pleasant exception to this fallacy is the unexpected discoveries of systems for which I have no reference. By having no reference, these games that are indicative of complete separate genres are capable of affecting stronger ripples in my memory. So, one interpretation I would extend of my experiential memory is that having multiple, possibly foundational experiences in the same reference pool can desensitize the end-user to subsequent &amp;quot;peaks&amp;quot;  - games that might have stronger impacts should they not have to compete with earlier &amp;quot;peaks&amp;quot; in the same conglomerated space.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge0i5h", "score_hidden": true, "stickied": false, "created": 1492487546.0, "created_utc": 1492458746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge6cop", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "superfreexa", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "\n\n\n\n\nIt's a really interesting point actually - I suppose it's because when we finish a game, we judge it based on the most memorable bits eg the most frustrating/painful bit and the ending (since that's the point at which we judge these things). \n\nThat said, I think this idea applies better to games with no clear end-game. The mobas/mmos/diablos etc are perhaps judged more harshly because people stop playing because it isn't fun, rather than it being a natural end. \n\nI want to say that this applies to single player games too, but most of the games more recently have had a more consistent enjoyment level. Grow Home/INSIDE/Hyper Light Drifter and maybe even something like FO4 have had less stand out moments and more general enjoyment spread through the whole game. \n\nSo yeah, I think this principle is really cool, and I'll try to have it in mind when I'm thinking about how much I enjoy games in the future :)\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a really interesting point actually - I suppose it&amp;#39;s because when we finish a game, we judge it based on the most memorable bits eg the most frustrating/painful bit and the ending (since that&amp;#39;s the point at which we judge these things). &lt;/p&gt;\n\n&lt;p&gt;That said, I think this idea applies better to games with no clear end-game. The mobas/mmos/diablos etc are perhaps judged more harshly because people stop playing because it isn&amp;#39;t fun, rather than it being a natural end. &lt;/p&gt;\n\n&lt;p&gt;I want to say that this applies to single player games too, but most of the games more recently have had a more consistent enjoyment level. Grow Home/INSIDE/Hyper Light Drifter and maybe even something like FO4 have had less stand out moments and more general enjoyment spread through the whole game. &lt;/p&gt;\n\n&lt;p&gt;So yeah, I think this principle is really cool, and I&amp;#39;ll try to have it in mind when I&amp;#39;m thinking about how much I enjoy games in the future :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge6cop", "score_hidden": true, "stickied": false, "created": 1492494281.0, "created_utc": 1492465481.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge6h55", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "themattpete", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Excellent post. I had the same exact experience with Fallout 3 and Portal, which I played pretty near to each other. Portal is objectively a superior game, it has fewer bugs, it has more polish, and so on by pretty much every metric. Every minute playing portal was pleasant and interesting, yet I have fewer specific fond memories of it than I do with Fallout 3, in which the quality is inconsistent and the average minute of gameplay is actually pretty dull. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent post. I had the same exact experience with Fallout 3 and Portal, which I played pretty near to each other. Portal is objectively a superior game, it has fewer bugs, it has more polish, and so on by pretty much every metric. Every minute playing portal was pleasant and interesting, yet I have fewer specific fond memories of it than I do with Fallout 3, in which the quality is inconsistent and the average minute of gameplay is actually pretty dull. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge6h55", "score_hidden": true, "stickied": false, "created": 1492494435.0, "created_utc": 1492465635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgegg85", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lubujackson", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This is a very interesting insight. I remember playing Last of Us was 90% tedious walking, ladder finding and straightforward skirmishes but the peak (main character bedridden twist) and end scene kind of make all the rave reviews make sense.\n\nNow on some level this is just good storytelling - the tedious day to day stuff is world-building and gives context to the peak moments.  Games and stories are improved by good dynamics - highs and lows (or lulls in action).  I think a lot of this ties into how we form memories.\n\nA old writer's trick is to take a dramatic scene up to its peak moment and then shift to some dry factual information that would normally be a yawn. Readers will be so engaged trying to soak up the big moment that they will remember whatever you put in this place, and instead of pissing them off it builds more anticipation for the payoff.  So using this technique you can dump a lot of info or backstory without sacrificing pacing.  I imagine this is similar to how we process and remember peak-end pain.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a very interesting insight. I remember playing Last of Us was 90% tedious walking, ladder finding and straightforward skirmishes but the peak (main character bedridden twist) and end scene kind of make all the rave reviews make sense.&lt;/p&gt;\n\n&lt;p&gt;Now on some level this is just good storytelling - the tedious day to day stuff is world-building and gives context to the peak moments.  Games and stories are improved by good dynamics - highs and lows (or lulls in action).  I think a lot of this ties into how we form memories.&lt;/p&gt;\n\n&lt;p&gt;A old writer&amp;#39;s trick is to take a dramatic scene up to its peak moment and then shift to some dry factual information that would normally be a yawn. Readers will be so engaged trying to soak up the big moment that they will remember whatever you put in this place, and instead of pissing them off it builds more anticipation for the payoff.  So using this technique you can dump a lot of info or backstory without sacrificing pacing.  I imagine this is similar to how we process and remember peak-end pain.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgegg85", "score_hidden": true, "stickied": false, "created": 1492507147.0, "created_utc": 1492478347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgekzue", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sleepysirensongs", "parent_id": "t1_dgehp9z", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "No one gives a fuck about the human fucking shitstains who started threatening to rape and kill the developers of a video game just because they didn't get their consequence-free happy ending.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one gives a fuck about the human fucking shitstains who started threatening to rape and kill the developers of a video game just because they didn&amp;#39;t get their consequence-free happy ending.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgekzue", "score_hidden": true, "stickied": false, "created": 1492512624.0, "created_utc": 1492483824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehp9z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoteBlock08", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Interesting pattern, I bet it contributes to the near riot levels of rage when a show or game ends badly too, despite the rest of it being overall high quality. Off the top of my head examples of this would be How I Met Your Mother, Dexter, and the original Mass Effect trilogy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting pattern, I bet it contributes to the near riot levels of rage when a show or game ends badly too, despite the rest of it being overall high quality. Off the top of my head examples of this would be How I Met Your Mother, Dexter, and the original Mass Effect trilogy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgehp9z", "score_hidden": true, "stickied": false, "created": 1492508693.0, "created_utc": 1492479893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgecx3v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarduRusher", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I suppose Bioshock Infinite is a good example of this. The shooting was eh, and the story had some plot holes, but when it was good, it was REALLY GOOD. Also, the ending was really cool and fucked with my mind.\n\nI still remember it as one of my favorite games ever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suppose Bioshock Infinite is a good example of this. The shooting was eh, and the story had some plot holes, but when it was good, it was REALLY GOOD. Also, the ending was really cool and fucked with my mind.&lt;/p&gt;\n\n&lt;p&gt;I still remember it as one of my favorite games ever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgecx3v", "score_hidden": true, "stickied": false, "created": 1492502729.0, "created_utc": 1492473929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgec09o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Quetzal42", "parent_id": "t1_dgdyyd5", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yeah, Ori is dramatically superior to Dragon's Dogma.  No contest.  Ori is absurdly beautiful, has wonderful music, and is challenging but fair and one of the absolute best games I've ever played.\n\nDragon's Dogma doesn't even begin to compare to a Dark Souls game.  It's bloated with horrible quests, has a terrible story, and forces you to use at least one NPC companion which is just a baffling design choice.  In a game like that, I want to explore the world by myself, not be shackled to an NPC that ends up killing all the weaker enemies before I even notice that they are there.  \n\nI'd give Ori a 10 / 10, Dragon's Dogma a 5 / 10.  \n\nI don't agree with the OP's points.  I judge games based on the whole package.  If other people judge it based on the high points, that's on them.  But I'd look down on someone for that and view their opinion as incomplete.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, Ori is dramatically superior to Dragon&amp;#39;s Dogma.  No contest.  Ori is absurdly beautiful, has wonderful music, and is challenging but fair and one of the absolute best games I&amp;#39;ve ever played.&lt;/p&gt;\n\n&lt;p&gt;Dragon&amp;#39;s Dogma doesn&amp;#39;t even begin to compare to a Dark Souls game.  It&amp;#39;s bloated with horrible quests, has a terrible story, and forces you to use at least one NPC companion which is just a baffling design choice.  In a game like that, I want to explore the world by myself, not be shackled to an NPC that ends up killing all the weaker enemies before I even notice that they are there.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d give Ori a 10 / 10, Dragon&amp;#39;s Dogma a 5 / 10.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t agree with the OP&amp;#39;s points.  I judge games based on the whole package.  If other people judge it based on the high points, that&amp;#39;s on them.  But I&amp;#39;d look down on someone for that and view their opinion as incomplete.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgec09o", "score_hidden": true, "stickied": false, "created": 1492501558.0, "created_utc": 1492472758.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyyd5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pigritude", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I broadly agree with all of your points, except for my opinion that *Ori and the Blind Forest* is far superior to *Dragon's Dogma*, and is in fact my favorite single-player game of all time. I recently made a post about it, actually, after finally beating the game on one-life difficulty. That's neither here nor there, though.\n\nI think we see this phenomenon on a massive scale with open-world games. \"Relatively boring filler punctuated by sequences of excellent, fun content\" is practically the definition of the modern open-world genre. They are some of the most successful games around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I broadly agree with all of your points, except for my opinion that &lt;em&gt;Ori and the Blind Forest&lt;/em&gt; is far superior to &lt;em&gt;Dragon&amp;#39;s Dogma&lt;/em&gt;, and is in fact my favorite single-player game of all time. I recently made a post about it, actually, after finally beating the game on one-life difficulty. That&amp;#39;s neither here nor there, though.&lt;/p&gt;\n\n&lt;p&gt;I think we see this phenomenon on a massive scale with open-world games. &amp;quot;Relatively boring filler punctuated by sequences of excellent, fun content&amp;quot; is practically the definition of the modern open-world genre. They are some of the most successful games around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgdyyd5", "score_hidden": true, "stickied": false, "created": 1492485797.0, "created_utc": 1492456997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgei17v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pomguo", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Very interesting way of thinking about it, and I wonder if it factors into those occasional-multiplayers games like **Monster Hunter** or **WoW**.\n\nYou spend hours and hours doing tedious shit like grinding for drops or reputation, so that when you play with your friends or guildmates (these are the peak moments) you can be the best you can be, impress your friends, not let them down, help the team defeat the boss, etc. \n\nPeople seem able to enjoy tediousness and repetition if it's serving those peak moments and making them awesome, even if those peak moments are a tenth of the total play time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very interesting way of thinking about it, and I wonder if it factors into those occasional-multiplayers games like &lt;strong&gt;Monster Hunter&lt;/strong&gt; or &lt;strong&gt;WoW&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;You spend hours and hours doing tedious shit like grinding for drops or reputation, so that when you play with your friends or guildmates (these are the peak moments) you can be the best you can be, impress your friends, not let them down, help the team defeat the boss, etc. &lt;/p&gt;\n\n&lt;p&gt;People seem able to enjoy tediousness and repetition if it&amp;#39;s serving those peak moments and making them awesome, even if those peak moments are a tenth of the total play time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgei17v", "score_hidden": true, "stickied": false, "created": 1492509085.0, "created_utc": 1492480285.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgej2i2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mr_Ivysaur", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Happens a lot with me. Kid Icarus Upraising is one of my favorites games of all time. But the last chapters are such a mess of nonsense and boring stage design that left with a bad taste after it. Same thing happened with Deus Ex HR. \n\nBut I honestly don't remember many boring games with good endings. I usually just give up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happens a lot with me. Kid Icarus Upraising is one of my favorites games of all time. But the last chapters are such a mess of nonsense and boring stage design that left with a bad taste after it. Same thing happened with Deus Ex HR. &lt;/p&gt;\n\n&lt;p&gt;But I honestly don&amp;#39;t remember many boring games with good endings. I usually just give up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgej2i2", "score_hidden": true, "stickied": false, "created": 1492510307.0, "created_utc": 1492481507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgek18z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "derpderp3200", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Consider that in the case of games, it's not a scale between entertainment and no entertainment, but entertainment and boredom/frustration, so the rule cannot really apply, at least not in the way it applies to pain.\n\nIn my case, I only care about \"endings\" when my frustrations/boredom builds up enough to make me drop a title, and the \"peak\" only when I remember something *really* strongly - again, something almost exclusively reserved for major frustration.\n\nI might be atypical(severe depression and anhedonia), but either way, for me my opinion of a game depends on an average over time of how engaged/immersed/entertained it made me, and single high points don't bring my ratings up a bit, and ending never does. Negative points might, but again, not quite as much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider that in the case of games, it&amp;#39;s not a scale between entertainment and no entertainment, but entertainment and boredom/frustration, so the rule cannot really apply, at least not in the way it applies to pain.&lt;/p&gt;\n\n&lt;p&gt;In my case, I only care about &amp;quot;endings&amp;quot; when my frustrations/boredom builds up enough to make me drop a title, and the &amp;quot;peak&amp;quot; only when I remember something &lt;em&gt;really&lt;/em&gt; strongly - again, something almost exclusively reserved for major frustration.&lt;/p&gt;\n\n&lt;p&gt;I might be atypical(severe depression and anhedonia), but either way, for me my opinion of a game depends on an average over time of how engaged/immersed/entertained it made me, and single high points don&amp;#39;t bring my ratings up a bit, and ending never does. Negative points might, but again, not quite as much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgek18z", "score_hidden": true, "stickied": false, "created": 1492511435.0, "created_utc": 1492482635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgemuzy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flight714", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This is a great post, and represents exactly the reason that I subscribed to /r/truegaming.\n\nHowever, I don't believe it's a scientifically sound proposition: I think the Peak-End rule applies only to experiences that are completed in one go, within a few hours (such as a medical procedure, of course).\n\nI don't think it applies to an experience that is cut up in to multiple events over a series of days such as a modern video game.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great post, and represents exactly the reason that I subscribed to &lt;a href=\"/r/truegaming\"&gt;/r/truegaming&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;However, I don&amp;#39;t believe it&amp;#39;s a scientifically sound proposition: I think the Peak-End rule applies only to experiences that are completed in one go, within a few hours (such as a medical procedure, of course).&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think it applies to an experience that is cut up in to multiple events over a series of days such as a modern video game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgemuzy", "score_hidden": true, "stickied": false, "created": 1492515072.0, "created_utc": 1492486272.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgencwm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brain_fuckler", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "This is actually something I was having a discussion with someone about today. We were talking about the Mass Effect games and one of the points I had was that the whole game was pretty good but the ending dominated what everyone thought about the game. It got me thinking about other games that have been soured and saved by their endings. One example I had was Shin Megami Tensei IV: Apocalypse which was not great, but at least enjoyable until the last dungeon completely ruined the experience for me. The ending itself was a giant middle finger, but even then I still was pretty neutral to positive for 90% of the game leading up to that last 10%. But it capped off so poorly that it's impossible to remove just how bad the last couple of hours were from what's otherwise flawed but still pretty enjoyable. The opposite of this is Fire Emblem Fates: Conquest which was on the better end of decent up until an incredible climax. I rate Conquest very highly mainly due to the good impression it sent me off with. \n\nHonestly, whether this applies to someone is based purely on their gaming habits. It doesn't matter for the people who lose interest in games before they finish them. For people like me who tries to complete every game they buy it's something to remember when looking back on games comprehensively. Was this game all bad or was the ending just awful? Was that game really strong the whole way through or did it just pool its interesting moments at the final hour? How much weight should be put in the way a game sends its player off to the credits? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is actually something I was having a discussion with someone about today. We were talking about the Mass Effect games and one of the points I had was that the whole game was pretty good but the ending dominated what everyone thought about the game. It got me thinking about other games that have been soured and saved by their endings. One example I had was Shin Megami Tensei IV: Apocalypse which was not great, but at least enjoyable until the last dungeon completely ruined the experience for me. The ending itself was a giant middle finger, but even then I still was pretty neutral to positive for 90% of the game leading up to that last 10%. But it capped off so poorly that it&amp;#39;s impossible to remove just how bad the last couple of hours were from what&amp;#39;s otherwise flawed but still pretty enjoyable. The opposite of this is Fire Emblem Fates: Conquest which was on the better end of decent up until an incredible climax. I rate Conquest very highly mainly due to the good impression it sent me off with. &lt;/p&gt;\n\n&lt;p&gt;Honestly, whether this applies to someone is based purely on their gaming habits. It doesn&amp;#39;t matter for the people who lose interest in games before they finish them. For people like me who tries to complete every game they buy it&amp;#39;s something to remember when looking back on games comprehensively. Was this game all bad or was the ending just awful? Was that game really strong the whole way through or did it just pool its interesting moments at the final hour? How much weight should be put in the way a game sends its player off to the credits? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgencwm", "score_hidden": true, "stickied": false, "created": 1492515788.0, "created_utc": 1492486988.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dgenupk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PHPH", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "People unfairly hated on Mass Effect 3, I imagine, for this reason. The ending was complete garbage, but the game overall was filled with many high notes that got soured by the last twenty minutes of the game.\n\nIt's too bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People unfairly hated on Mass Effect 3, I imagine, for this reason. The ending was complete garbage, but the game overall was filled with many high notes that got soured by the last twenty minutes of the game.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s too bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgenupk", "score_hidden": true, "stickied": false, "created": 1492516495.0, "created_utc": 1492487695.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65ww7l", "likes": null, "replies": "", "user_reports": [], "id": "dge13bw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Makiau1", "parent_id": "t3_65ww7l", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Anything think Mother 2 and 3 could be counted as Peak-End highs so addicting, you want sooo much more? Because when I beat them, I didn't know what the hell to do with my life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anything think Mother 2 and 3 could be counted as Peak-End highs so addicting, you want sooo much more? Because when I beat them, I didn&amp;#39;t know what the hell to do with my life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge13bw", "score_hidden": true, "stickied": false, "created": 1492488211.0, "created_utc": 1492459411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]