[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "truegaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is a lot of talk on this sub about how games these days are too easy and accessible, and that there needs to be more games like we had back in the day - minimal hand-holding, high degree of challenge etc. Is this a design philosophy you would like to see permeate the industry again? The issue is, would it be special still if it was the new normal? Can we acknowledge that a lot of the challenge in older games came from hardware limitations of the time as opposed to maybe a conscious design choice by developers? Also, with a return to these gameplay designs, how would it affect the industry as a whole? Would we see plummeting sales and declining interest in gaming as a whole if they are not made to be accessible to mainstream and casual gamers? Would this in turn feed into developers&amp;#39; need to make games accessible again, thereby creating a cycle where we go back to major titles going back to easy mode?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "There is a lot of talk on this sub about how games these days are too easy and accessible, and that there needs to be more games like we had back in the day - minimal hand-holding, high degree of challenge etc. Is this a design philosophy you would like to see permeate the industry again? The issue is, would it be special still if it was the new normal? Can we acknowledge that a lot of the challenge in older games came from hardware limitations of the time as opposed to maybe a conscious design choice by developers? Also, with a return to these gameplay designs, how would it affect the industry as a whole? Would we see plummeting sales and declining interest in gaming as a whole if they are not made to be accessible to mainstream and casual gamers? Would this in turn feed into developers' need to make games accessible again, thereby creating a cycle where we go back to major titles going back to easy mode?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65y3db", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "fabrar", "saved": false, "mod_reports": [], "name": "t3_65y3db", "subreddit_name_prefixed": "r/truegaming", "approved_by": null, "over_18": false, "domain": "self.truegaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sgq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/truegaming/comments/65y3db/would_you_like_to_see_a_widespread_return_to_old/", "num_reports": null, "locked": false, "stickied": false, "created": 1492489366.0, "url": "https://www.reddit.com/r/truegaming/comments/65y3db/would_you_like_to_see_a_widespread_return_to_old/", "author_flair_text": null, "quarantine": false, "title": "Would you like to see a widespread return to \"old school\" game design principles and philosophies? More challenging games, less accessible games?", "created_utc": 1492460566.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65y3db", "likes": null, "replies": "", "user_reports": [], "id": "dge6imf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jank_tribal", "parent_id": "t3_65y3db", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "One think I think is interesting in light of this is that one of the biggest recent casual/mainstream hits, Minecraft, got popular during a period where it dumped the player in the middle of nowhere with no indication of how anything works.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One think I think is interesting in light of this is that one of the biggest recent casual/mainstream hits, Minecraft, got popular during a period where it dumped the player in the middle of nowhere with no indication of how anything works.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge6imf", "score_hidden": true, "stickied": false, "created": 1492494484.0, "created_utc": 1492465684.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65y3db", "likes": null, "replies": "", "user_reports": [], "id": "dge3qcz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EdEmKay", "parent_id": "t3_65y3db", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "not at the expense of variety. no matter how trendy the mainstream AAA releases get, there are infinitely more games available to a gamer now at any point, so there'll always be something recent-ish to scratch your itch available on your platform.\n\ni don't think the industry should go in any direction apart from trying to innovate and trying something new. i think not emulating older design ideas is what led to the games that we hold up as old school classics, and i think it's the only way to create more interesting shit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;not at the expense of variety. no matter how trendy the mainstream AAA releases get, there are infinitely more games available to a gamer now at any point, so there&amp;#39;ll always be something recent-ish to scratch your itch available on your platform.&lt;/p&gt;\n\n&lt;p&gt;i don&amp;#39;t think the industry should go in any direction apart from trying to innovate and trying something new. i think not emulating older design ideas is what led to the games that we hold up as old school classics, and i think it&amp;#39;s the only way to create more interesting shit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dge3qcz", "score_hidden": true, "stickied": false, "created": 1492491156.0, "created_utc": 1492462356.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65y3db", "likes": null, "replies": "", "user_reports": [], "id": "dged6es", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarduRusher", "parent_id": "t3_65y3db", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "I think it depends on what the game is. For example, I would want Uncharted to be harder. I'm not playing that game for a challenge, but for the cinematic experience and movie. Like a movie, but I'm in it.\n\nI play the Witcher for the awesome story, the immersion, and choice. It wouldn't be as fun for me if it was difficult. In fact, I rarely play single player games for a challenge anymore. If I want that, I'll play online. I play single player games for the story and immersion.\n\nThat said, some games (namely SoulsBourne types) as good because of the satisfaction you get after beating a challenge, story and immersion are less important. Making these games easy would ruin them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it depends on what the game is. For example, I would want Uncharted to be harder. I&amp;#39;m not playing that game for a challenge, but for the cinematic experience and movie. Like a movie, but I&amp;#39;m in it.&lt;/p&gt;\n\n&lt;p&gt;I play the Witcher for the awesome story, the immersion, and choice. It wouldn&amp;#39;t be as fun for me if it was difficult. In fact, I rarely play single player games for a challenge anymore. If I want that, I&amp;#39;ll play online. I play single player games for the story and immersion.&lt;/p&gt;\n\n&lt;p&gt;That said, some games (namely SoulsBourne types) as good because of the satisfaction you get after beating a challenge, story and immersion are less important. Making these games easy would ruin them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dged6es", "score_hidden": true, "stickied": false, "created": 1492503064.0, "created_utc": 1492474264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65y3db", "likes": null, "replies": "", "user_reports": [], "id": "dgeiute", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mr_Ivysaur", "parent_id": "t3_65y3db", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yes, I would love that.\n\nBut it is not happening. Gaming ia a business, and why make a game that will appeal a parcel of customers instead of almost all of them? \n\nI can enjoy some games such Dark Souls, specific Nintendo titles and indies for a fine tuned difficulty experience, but they will always be niche. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I would love that.&lt;/p&gt;\n\n&lt;p&gt;But it is not happening. Gaming ia a business, and why make a game that will appeal a parcel of customers instead of almost all of them? &lt;/p&gt;\n\n&lt;p&gt;I can enjoy some games such Dark Souls, specific Nintendo titles and indies for a fine tuned difficulty experience, but they will always be niche. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgeiute", "score_hidden": true, "stickied": false, "created": 1492510060.0, "created_utc": 1492481260.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sgq6", "removal_reason": null, "link_id": "t3_65y3db", "likes": null, "replies": "", "user_reports": [], "id": "dgemr9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Katana314", "parent_id": "t3_65y3db", "subreddit_name_prefixed": "r/truegaming", "controversiality": 0, "body": "Yes and no.\n\nThere are good, and shitty ways of doing difficulty and low-hand-holding, and Redditors rarely seem to acknowledge a difference in them.\n\nGTA is a prime example of full handholding. You're almost always chasing an objective marker or staring at a minimap. Dark Souls is an example of no handholding. Past the controls, it tells you nothing - not even by close hints.\n\nZelda: Breath of the Wild is the ONLY game I can think of to offer a happy median, and it has been selling on a AAA level as a result. It has challenges, yes, but the presence of those challenges doesn't gate content or stop people from playing. It avoids holding your hand, yes, but not *one hundred percent* of the time. Some mechanics and features need better explanation, or have severe consequences for not understanding them. They also recognize that ultimately, to help players acclimate to the world and to maintain a good level of challenge, dying shouldn't be very punishing at all.\n\nI've never been convinced one bit that the uber-pro's \"Realistic and consequential one-life battle simulator\" makes for a fun experience, and many jaded gamers don't bother discovering that such challenges often exist as extra modes once a game has been beaten once.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes and no.&lt;/p&gt;\n\n&lt;p&gt;There are good, and shitty ways of doing difficulty and low-hand-holding, and Redditors rarely seem to acknowledge a difference in them.&lt;/p&gt;\n\n&lt;p&gt;GTA is a prime example of full handholding. You&amp;#39;re almost always chasing an objective marker or staring at a minimap. Dark Souls is an example of no handholding. Past the controls, it tells you nothing - not even by close hints.&lt;/p&gt;\n\n&lt;p&gt;Zelda: Breath of the Wild is the ONLY game I can think of to offer a happy median, and it has been selling on a AAA level as a result. It has challenges, yes, but the presence of those challenges doesn&amp;#39;t gate content or stop people from playing. It avoids holding your hand, yes, but not &lt;em&gt;one hundred percent&lt;/em&gt; of the time. Some mechanics and features need better explanation, or have severe consequences for not understanding them. They also recognize that ultimately, to help players acclimate to the world and to maintain a good level of challenge, dying shouldn&amp;#39;t be very punishing at all.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never been convinced one bit that the uber-pro&amp;#39;s &amp;quot;Realistic and consequential one-life battle simulator&amp;quot; makes for a fun experience, and many jaded gamers don&amp;#39;t bother discovering that such challenges often exist as extra modes once a game has been beaten once.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "truegaming", "name": "t1_dgemr9x", "score_hidden": true, "stickied": false, "created": 1492514929.0, "created_utc": 1492486129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]