[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "androidapps", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is going to sound like a very strange request, but yesterday I tried Signal out, and I fell in love with it. But although it&amp;#39;s most well-known for its use as an encryption app, I just realized that it was simultaneously an sms and non-sms messaging app, and I loved that I could keep texting people like before, but would get all the perks of a fancy messaging app if they happened to have Signal too. I also use WhatsApp and Viber and stuff, but I liked that both functionalities were here seamlessly connected.&lt;/p&gt;\n\n&lt;p&gt;My problem with the encryption, though, isn&amp;#39;t with encryption itself (encryption is great!). But because of the sms encryption on the phone, I can no longer use desktop sms interfaces (at least, I assume that&amp;#39;s what causes it). And unfortunately Signal&amp;#39;s Chrome app only works for the Signal messages, but not sms. Sorry for the long and drawn-out way of asking, but any chance anyone knows of a good Android messaging app like that? With both SMS and fancier messaging features seamlessly connected?&lt;/p&gt;\n\n&lt;p&gt;tl;dr I&amp;#39;m looking for a fancy messaging app that utilizes those features when the recipient has the app, and simply sends messages as sms when the recipient does not have it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is going to sound like a very strange request, but yesterday I tried Signal out, and I fell in love with it. But although it's most well-known for its use as an encryption app, I just realized that it was simultaneously an sms and non-sms messaging app, and I loved that I could keep texting people like before, but would get all the perks of a fancy messaging app if they happened to have Signal too. I also use WhatsApp and Viber and stuff, but I liked that both functionalities were here seamlessly connected.\n\nMy problem with the encryption, though, isn't with encryption itself (encryption is great!). But because of the sms encryption on the phone, I can no longer use desktop sms interfaces (at least, I assume that's what causes it). And unfortunately Signal's Chrome app only works for the Signal messages, but not sms. Sorry for the long and drawn-out way of asking, but any chance anyone knows of a good Android messaging app like that? With both SMS and fancier messaging features seamlessly connected?\n\ntl;dr I'm looking for a fancy messaging app that utilizes those features when the recipient has the app, and simply sends messages as sms when the recipient does not have it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64z33a", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "badsalad", "saved": false, "mod_reports": [], "name": "t3_64z33a", "subreddit_name_prefixed": "r/androidapps", "approved_by": null, "over_18": false, "domain": "self.androidapps", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2reen", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/androidapps/comments/64z33a/looking_for_an_app_like_signal_but_without/", "num_reports": null, "locked": false, "stickied": false, "created": 1492041929.0, "url": "https://www.reddit.com/r/androidapps/comments/64z33a/looking_for_an_app_like_signal_but_without/", "author_flair_text": null, "quarantine": false, "title": "Looking for an app like signal.......... but without encryption?", "created_utc": 1492013129.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2reen", "removal_reason": null, "link_id": "t3_64z33a", "likes": null, "replies": "", "user_reports": [], "id": "dg6cedy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ProbablyDylan", "parent_id": "t3_64z33a", "subreddit_name_prefixed": "r/androidapps", "controversiality": 0, "body": "There's an app called invi SMS on the play store, it does SMS and it's own IM with other users of the same app. That, and the developer is really great with feedback", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s an app called invi SMS on the play store, it does SMS and it&amp;#39;s own IM with other users of the same app. That, and the developer is really great with feedback&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "androidapps", "name": "t1_dg6cedy", "score_hidden": false, "stickied": false, "created": 1492051797.0, "created_utc": 1492022997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]