[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "androidapps", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read multiple times that certain music players like PowerAmp or GoneMad Music Player have a better audio engine than the default Android one and that this would result in a better sound than another player like say Shuttle or Timber.&lt;/p&gt;\n\n&lt;p&gt;Is there any truth to this or one of those things that only an audiophile with high-end equipment would be able to notice? Are they referring to the effects these players can add and in that case, is it pointless if you have Viper4Android anyways and can modify the effects via that app?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've read multiple times that certain music players like PowerAmp or GoneMad Music Player have a better audio engine than the default Android one and that this would result in a better sound than another player like say Shuttle or Timber.\n\nIs there any truth to this or one of those things that only an audiophile with high-end equipment would be able to notice? Are they referring to the effects these players can add and in that case, is it pointless if you have Viper4Android anyways and can modify the effects via that app?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "658lan", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 36, "report_reasons": null, "author": "Uzwmsk", "saved": false, "mod_reports": [], "name": "t3_658lan", "subreddit_name_prefixed": "r/androidapps", "approved_by": null, "over_18": false, "domain": "self.androidapps", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2reen", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/androidapps/comments/658lan/certain_music_players_having_a_better_audio/", "num_reports": null, "locked": false, "stickied": false, "created": 1492149255.0, "url": "https://www.reddit.com/r/androidapps/comments/658lan/certain_music_players_having_a_better_audio/", "author_flair_text": null, "quarantine": false, "title": "Certain music players having a better 'Audio Engine\" and is it irrelevant with Viper4Android?", "created_utc": 1492120455.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2reen", "removal_reason": null, "link_id": "t3_658lan", "likes": null, "replies": "", "user_reports": [], "id": "dg8dg1m", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "slackinfux", "parent_id": "t3_658lan", "subreddit_name_prefixed": "r/androidapps", "controversiality": 0, "body": "It is true that players like PowerAmp, for example, do produce better audio, mostly because of better codec support and a better than standard DSP library, plus they have direct hardware support for the improved DAC's found in some higher end Android devices.\n\nNow, if you're listening through a set of cheap earbuds, you are unlikely to be able to hear any difference. On the other hand, if you're listening through a good pair of cans, you can hear the difference. Even more so if you use an external DAC). Personally, I use Onkyo HF Player with the HD codec pack and a Fiio E18 headphone amp/external DAC and it sounds excellent. I rarely even use the EQ function, even though HF Player has a nice 16,384 band FIR equalizer, similar to what Viper offers.\n\nnow Viper4Android is just a DSP app, which receives its input from whatever app your playing from, modifies the signal based on your settings, then outputs the result into the DAC. For the most part, these are all spatializing or equalization effects, along with a compressor/limiter, dynamic range compression and a restoration processor that attempts to create data lost during compression. Personally, if you're using good quality lossless files from a player like PowerAmp, Viper is probably degrading the overall quality of the audio. However, it should make low quality files played on middling hardware sound subjectively better.\n\nMy real point here is...Garbage In, Garbage Out. If you feed something like Viper mediocre audio, it won't magically make music sound like it's coming straight from the master recording playing on a top quality system, but it might make it more pleasing to listen to. I prefer the least amount of DSP possible between the source and my ears, but YMMV.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is true that players like PowerAmp, for example, do produce better audio, mostly because of better codec support and a better than standard DSP library, plus they have direct hardware support for the improved DAC&amp;#39;s found in some higher end Android devices.&lt;/p&gt;\n\n&lt;p&gt;Now, if you&amp;#39;re listening through a set of cheap earbuds, you are unlikely to be able to hear any difference. On the other hand, if you&amp;#39;re listening through a good pair of cans, you can hear the difference. Even more so if you use an external DAC). Personally, I use Onkyo HF Player with the HD codec pack and a Fiio E18 headphone amp/external DAC and it sounds excellent. I rarely even use the EQ function, even though HF Player has a nice 16,384 band FIR equalizer, similar to what Viper offers.&lt;/p&gt;\n\n&lt;p&gt;now Viper4Android is just a DSP app, which receives its input from whatever app your playing from, modifies the signal based on your settings, then outputs the result into the DAC. For the most part, these are all spatializing or equalization effects, along with a compressor/limiter, dynamic range compression and a restoration processor that attempts to create data lost during compression. Personally, if you&amp;#39;re using good quality lossless files from a player like PowerAmp, Viper is probably degrading the overall quality of the audio. However, it should make low quality files played on middling hardware sound subjectively better.&lt;/p&gt;\n\n&lt;p&gt;My real point here is...Garbage In, Garbage Out. If you feed something like Viper mediocre audio, it won&amp;#39;t magically make music sound like it&amp;#39;s coming straight from the master recording playing on a top quality system, but it might make it more pleasing to listen to. I prefer the least amount of DSP possible between the source and my ears, but YMMV.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "androidapps", "name": "t1_dg8dg1m", "score_hidden": false, "stickied": false, "created": 1492153080.0, "created_utc": 1492124280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2reen", "removal_reason": null, "link_id": "t3_658lan", "likes": null, "replies": "", "user_reports": [], "id": "dg8cvu9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sid32", "parent_id": "t3_658lan", "subreddit_name_prefixed": "r/androidapps", "controversiality": 0, "body": "Those apps you listed have a free trial. Put on your fav headphones and listen away. Report back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those apps you listed have a free trial. Put on your fav headphones and listen away. Report back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "androidapps", "name": "t1_dg8cvu9", "score_hidden": false, "stickied": false, "created": 1492152336.0, "created_utc": 1492123536.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2reen", "removal_reason": null, "link_id": "t3_658lan", "likes": null, "replies": "", "user_reports": [], "id": "dg8n2yu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "southsamurai", "parent_id": "t3_658lan", "subreddit_name_prefixed": "r/androidapps", "controversiality": 0, "body": "I don't have any devices that are built with audio as a primary  concern. So I've bounced around various players and mods to get the best I can out of each device.\n\nI don't have headphones that are insanely good, but are better than average. Same with my stereo equipment. Well, my car system is pretty beastly, but not absolute top end.\n\nThe difference between the three apps that I know have built in improvements over the standard Android sdk (poweramp, Gonemad and jet) is noticeable even on borrowed crappy headphones. Poweramp and Gonemad are just slightly better than jet. Enough so that I haven't bothered to use jet in ages.\n\nAdding viper or arise on top of that *can* improve results further if you  get things set up right. For my needs, the extra hassle isn't worth it. It's possible that I just don't have gear good enough (or maybe ears) to really tell, but since I'm fairly average to slightly above average with all my equipment (including my ears), I'd say that's a decent reference point.\n\nI've run the same devices with viper, and just using stock players or apps without custom engines. It's my opinion that if you could only have viper *or* poweramp/Gonemad, you'd be better off with one of the apps. Arise is slightly better than viper because of the greater number of things you can tweak, but not significantly so to my ear.\n\nBoth viper and arise tend to be more time consuming to set up. By the time you've got everything exactly how you want it, you could have installed both players, listened to a full album and into the next. And neither one requires root, so they'll be good on any device.\n\nIf you have a player that serves your needs more than the big two (some apps do handle individual ui or functional features differently enough that they're worth sacrificing audio quality for), then it might not be worth switching if you already have viper. But if you aren't, as are starting fresh on a device, I'd say poweramp or Gonemad is the better option", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any devices that are built with audio as a primary  concern. So I&amp;#39;ve bounced around various players and mods to get the best I can out of each device.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have headphones that are insanely good, but are better than average. Same with my stereo equipment. Well, my car system is pretty beastly, but not absolute top end.&lt;/p&gt;\n\n&lt;p&gt;The difference between the three apps that I know have built in improvements over the standard Android sdk (poweramp, Gonemad and jet) is noticeable even on borrowed crappy headphones. Poweramp and Gonemad are just slightly better than jet. Enough so that I haven&amp;#39;t bothered to use jet in ages.&lt;/p&gt;\n\n&lt;p&gt;Adding viper or arise on top of that &lt;em&gt;can&lt;/em&gt; improve results further if you  get things set up right. For my needs, the extra hassle isn&amp;#39;t worth it. It&amp;#39;s possible that I just don&amp;#39;t have gear good enough (or maybe ears) to really tell, but since I&amp;#39;m fairly average to slightly above average with all my equipment (including my ears), I&amp;#39;d say that&amp;#39;s a decent reference point.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve run the same devices with viper, and just using stock players or apps without custom engines. It&amp;#39;s my opinion that if you could only have viper &lt;em&gt;or&lt;/em&gt; poweramp/Gonemad, you&amp;#39;d be better off with one of the apps. Arise is slightly better than viper because of the greater number of things you can tweak, but not significantly so to my ear.&lt;/p&gt;\n\n&lt;p&gt;Both viper and arise tend to be more time consuming to set up. By the time you&amp;#39;ve got everything exactly how you want it, you could have installed both players, listened to a full album and into the next. And neither one requires root, so they&amp;#39;ll be good on any device.&lt;/p&gt;\n\n&lt;p&gt;If you have a player that serves your needs more than the big two (some apps do handle individual ui or functional features differently enough that they&amp;#39;re worth sacrificing audio quality for), then it might not be worth switching if you already have viper. But if you aren&amp;#39;t, as are starting fresh on a device, I&amp;#39;d say poweramp or Gonemad is the better option&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "androidapps", "name": "t1_dg8n2yu", "score_hidden": false, "stickied": false, "created": 1492166317.0, "created_utc": 1492137517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2reen", "removal_reason": null, "link_id": "t3_658lan", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2reen", "removal_reason": null, "link_id": "t3_658lan", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2reen", "removal_reason": null, "link_id": "t3_658lan", "likes": null, "replies": "", "user_reports": [], "id": "dg8vpqn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MHcharLEE", "parent_id": "t1_dg8srxf", "subreddit_name_prefixed": "r/androidapps", "controversiality": 0, "body": "Fair enough. It's a personal thing I guess, depends on specific hardware, settings, and most importantly preferences. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough. It&amp;#39;s a personal thing I guess, depends on specific hardware, settings, and most importantly preferences. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "androidapps", "name": "t1_dg8vpqn", "score_hidden": false, "stickied": false, "created": 1492182289.0, "created_utc": 1492153489.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8srxf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arsiano", "parent_id": "t1_dg8dokw", "subreddit_name_prefixed": "r/androidapps", "controversiality": 0, "body": "On the flip side, I'm using a-jays 5 and viper makes an incredible difference compared to what I can do on poweramp.  It honestly makes them sound twice as expensive as they are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On the flip side, I&amp;#39;m using a-jays 5 and viper makes an incredible difference compared to what I can do on poweramp.  It honestly makes them sound twice as expensive as they are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "androidapps", "name": "t1_dg8srxf", "score_hidden": false, "stickied": false, "created": 1492175637.0, "created_utc": 1492146837.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dokw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MHcharLEE", "parent_id": "t3_658lan", "subreddit_name_prefixed": "r/androidapps", "controversiality": 0, "body": "I've been using Poweramp for years and I have Viper on my phone right now (included in ROM, didn't bother to install it separately). Poweramp's sound engine is IMO miles ahead of viper. No matter what I did in viper I could never get it to sound as good as Poweramp does. Maybe that's just my taste, maybe it's even a placebo effect. I just know that I prefer Poweramp's sound engine and that I can definitely hear the difference on my a-Jays Three that are by no means audiophile earphones. You can find them on ebay for $30 to $50.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been using Poweramp for years and I have Viper on my phone right now (included in ROM, didn&amp;#39;t bother to install it separately). Poweramp&amp;#39;s sound engine is IMO miles ahead of viper. No matter what I did in viper I could never get it to sound as good as Poweramp does. Maybe that&amp;#39;s just my taste, maybe it&amp;#39;s even a placebo effect. I just know that I prefer Poweramp&amp;#39;s sound engine and that I can definitely hear the difference on my a-Jays Three that are by no means audiophile earphones. You can find them on ebay for $30 to $50.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "androidapps", "name": "t1_dg8dokw", "score_hidden": false, "stickied": false, "created": 1492153395.0, "created_utc": 1492124595.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]