[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64q01v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 62, "report_reasons": null, "author": "frasiera", "saved": false, "mod_reports": [], "name": "t3_64q01v", "subreddit_name_prefixed": "r/TrueReddit", "approved_by": null, "over_18": false, "domain": "theguardian.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qyt6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/TrueReddit/comments/64q01v/confessions_of_a_reluctant_gentrifier/", "num_reports": null, "locked": false, "stickied": false, "created": 1491935086.0, "url": "https://www.theguardian.com/society/2017/apr/11/confessions-gentrification-race-rogers-park-chicago", "author_flair_text": null, "quarantine": false, "title": "Confessions of a reluctant gentrifier", "created_utc": 1491906286.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 39, "visited": false, "subreddit_type": "public", "ups": 62}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4v8g1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "efshoemaker", "parent_id": "t1_dg4m67v", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I might have come off a little too confrontational, but I've lived in Chicago for the past decade and a little over half of that was in Rogers Park, and this article rubbed me the wrong way. \n\nFrom experience, the people asking for change in Rogers Park are almost exclusively drug addicts/homeless/some combination of the two, but her takeaway was that \"they are always black\". Like you noted in Williamsburg, when the makeup of the neighborhood changes the makeup of the panhandlers will change. \n\nShe doesn't explicitly say it, but if she thinks that the money she gives out to people begging on the street counts as a \"tax\" to be paid for her role in pushing out neighborhood's the old residents, the implication is that the money paid is going into the black communities she feels guilty for uprooting. \n\nI don't think it's a malicious connection being made, just an ignorant one, but that's what bothers me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I might have come off a little too confrontational, but I&amp;#39;ve lived in Chicago for the past decade and a little over half of that was in Rogers Park, and this article rubbed me the wrong way. &lt;/p&gt;\n\n&lt;p&gt;From experience, the people asking for change in Rogers Park are almost exclusively drug addicts/homeless/some combination of the two, but her takeaway was that &amp;quot;they are always black&amp;quot;. Like you noted in Williamsburg, when the makeup of the neighborhood changes the makeup of the panhandlers will change. &lt;/p&gt;\n\n&lt;p&gt;She doesn&amp;#39;t explicitly say it, but if she thinks that the money she gives out to people begging on the street counts as a &amp;quot;tax&amp;quot; to be paid for her role in pushing out neighborhood&amp;#39;s the old residents, the implication is that the money paid is going into the black communities she feels guilty for uprooting. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think it&amp;#39;s a malicious connection being made, just an ignorant one, but that&amp;#39;s what bothers me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4v8g1", "score_hidden": false, "stickied": false, "created": 1491971231.0, "created_utc": 1491942431.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4m67v", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Dreidhen", "parent_id": "t1_dg4gl8f", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; The idea that the quarters she gives to pan-handlers count as a \"tax\" to the black community is pretty insulting. Lumping hard working black families into the same basket as homeless people and crack heads is the same kind of stereotyping she's trying to prevent, no?\n\nTo wit, the pertinent excerpt:\n\n&gt;When my landlord said this, I was standing on the sidewalk in front of our building in my bathing suit, still dripping from the lake, and a boy leaving the park asked if I had a quarter. I laughed and told the boy that I don’t typically carry change in my bathing suit, but he remained blank-faced, as uninterested as a toll collector. His request, I suspect, had very little to do with any money I may have had or any money he may have needed. The exchange was intended to be, like so many of my exchanges with my neighbours, a ritual offering.\n\n&gt;When I walk from my apartment to the train I am asked for money by all variety of people – old men and young boys and women with babies. Their manner of request is always different, but they are always black and I am always white. Sometimes I give money and sometimes I do not, but I do not feel good about it either way, and the transaction never fails to be complicated. I do not know whether my neighbours think, as I do, of these quarters and dollars as a kind of tax on my presence here. A tax that, although I resent it, is more than fair. \n\n\"all variety of people\" - explicitly, \"old men and young boys\" - nothing suggests that they're \"homeless people and crack heads\". Neither of those two adjectives show up in her writing - you used them. Anyway, one of the definitions of a tax is an 'added cost' for a service or good. And I do not know if you know what it's like to *always* be singled out for these things (not white btw), she's describing an honest opinion about a series of consistently observed reactions. I'm in NYC, I observe old black men and young black boys hit up soft looking tourists and their ilk all the time for spare change. Call it impromptu solicitation. \"You look like you could spare some change\". The \"tax\" in this situation is something she feels compelled (sometimes) to dispense because she can afford it, and in a sense sees herself as some sort of invasive species, which is quite sad. But I don't think the passage you're referencing suggests she's lumping \"hard working black families into the same basket as homeless people and crack heads\".\n\nAs I get older and things change more yet remain the same, I find it ironic than in my old hood of Williamsburg it's young, healthy-looking white guys now hitting me up for change.\n\nI agree much with your point that the black families well-meaning worriers like Eula (even the name is quite amusingly gentrifying) themselves displaced immigrants who before them there lived, who in turn displaced others, and let's not forget as a nation we're all collectively living on land forcibly taken from natives, who in turn peopled it and wrested it from Wild Nature herself (it was no paradise, and I do not mourn its loss - we conquered conquerors). The idea that the predecessor tribe somehow occupies the moral high-ground in these situations is a simplistic and uninformed notion for bleeding hearts. Humans are tribal, and every bit of land that has people on it was taken from some other entity - be it barren wilderness, animals, or other tribes. I myself spend WAY too much time obsessing over gentrification, mourning the passing of various micro-cultures, (and trying to support them when and where I want), but I will readily admit that rent and real estate transactions are easily the least harmful ways to go about these transferences than any of the older methods Humanity has previously employed. It's not the worst we've done, and some utopian future of free, completely diversified/mixed housing hardly sounds that better, imho. You lose different things both ways, everything's cyclical and in phases, and only collective cultural competence stays those transitions for any period of time (see Asiatowns).", "edited": 1491933610.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The idea that the quarters she gives to pan-handlers count as a &amp;quot;tax&amp;quot; to the black community is pretty insulting. Lumping hard working black families into the same basket as homeless people and crack heads is the same kind of stereotyping she&amp;#39;s trying to prevent, no?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To wit, the pertinent excerpt:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When my landlord said this, I was standing on the sidewalk in front of our building in my bathing suit, still dripping from the lake, and a boy leaving the park asked if I had a quarter. I laughed and told the boy that I don’t typically carry change in my bathing suit, but he remained blank-faced, as uninterested as a toll collector. His request, I suspect, had very little to do with any money I may have had or any money he may have needed. The exchange was intended to be, like so many of my exchanges with my neighbours, a ritual offering.&lt;/p&gt;\n\n&lt;p&gt;When I walk from my apartment to the train I am asked for money by all variety of people – old men and young boys and women with babies. Their manner of request is always different, but they are always black and I am always white. Sometimes I give money and sometimes I do not, but I do not feel good about it either way, and the transaction never fails to be complicated. I do not know whether my neighbours think, as I do, of these quarters and dollars as a kind of tax on my presence here. A tax that, although I resent it, is more than fair. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;all variety of people&amp;quot; - explicitly, &amp;quot;old men and young boys&amp;quot; - nothing suggests that they&amp;#39;re &amp;quot;homeless people and crack heads&amp;quot;. Neither of those two adjectives show up in her writing - you used them. Anyway, one of the definitions of a tax is an &amp;#39;added cost&amp;#39; for a service or good. And I do not know if you know what it&amp;#39;s like to &lt;em&gt;always&lt;/em&gt; be singled out for these things (not white btw), she&amp;#39;s describing an honest opinion about a series of consistently observed reactions. I&amp;#39;m in NYC, I observe old black men and young black boys hit up soft looking tourists and their ilk all the time for spare change. Call it impromptu solicitation. &amp;quot;You look like you could spare some change&amp;quot;. The &amp;quot;tax&amp;quot; in this situation is something she feels compelled (sometimes) to dispense because she can afford it, and in a sense sees herself as some sort of invasive species, which is quite sad. But I don&amp;#39;t think the passage you&amp;#39;re referencing suggests she&amp;#39;s lumping &amp;quot;hard working black families into the same basket as homeless people and crack heads&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;As I get older and things change more yet remain the same, I find it ironic than in my old hood of Williamsburg it&amp;#39;s young, healthy-looking white guys now hitting me up for change.&lt;/p&gt;\n\n&lt;p&gt;I agree much with your point that the black families well-meaning worriers like Eula (even the name is quite amusingly gentrifying) themselves displaced immigrants who before them there lived, who in turn displaced others, and let&amp;#39;s not forget as a nation we&amp;#39;re all collectively living on land forcibly taken from natives, who in turn peopled it and wrested it from Wild Nature herself (it was no paradise, and I do not mourn its loss - we conquered conquerors). The idea that the predecessor tribe somehow occupies the moral high-ground in these situations is a simplistic and uninformed notion for bleeding hearts. Humans are tribal, and every bit of land that has people on it was taken from some other entity - be it barren wilderness, animals, or other tribes. I myself spend WAY too much time obsessing over gentrification, mourning the passing of various micro-cultures, (and trying to support them when and where I want), but I will readily admit that rent and real estate transactions are easily the least harmful ways to go about these transferences than any of the older methods Humanity has previously employed. It&amp;#39;s not the worst we&amp;#39;ve done, and some utopian future of free, completely diversified/mixed housing hardly sounds that better, imho. You lose different things both ways, everything&amp;#39;s cyclical and in phases, and only collective cultural competence stays those transitions for any period of time (see Asiatowns).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4m67v", "score_hidden": false, "stickied": false, "created": 1491961381.0, "created_utc": 1491932581.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gl8f", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "efshoemaker", "parent_id": "t3_64q01v", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "If she moved to Chicago for a job at Northwestern, then she could afford an apartment in Evanston and there was nothing \"reluctant\" about her gentrifying. \n\nShe picked Rogers Park for the same reason all the white liberals do. It's at the sweet spot of affordability, safety, culture, and \"authentic\" city feel. Plus there's a sizable white liberal community with bars and restaurants where they can all hang out together.  \n\nThe thing about that sweet spot, and the whole issue with urban gentrification in general, is that these were never permanent, homogeneous communities. The makeup of neighborhoods in a city like Chicago is constantly evolving and nothing you like will stay exactly the same for very long. The black families she's so worried about displacing are living in the apartments that were full of Jewish, Irish, and German families before the 1950s. \n\nSide note: The idea that the quarters she gives to pan-handlers count as a \"tax\" to the black community is pretty insulting. Lumping hard working black families into the same basket as homeless people and crack heads is the same kind of stereotyping she's trying to prevent, no?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she moved to Chicago for a job at Northwestern, then she could afford an apartment in Evanston and there was nothing &amp;quot;reluctant&amp;quot; about her gentrifying. &lt;/p&gt;\n\n&lt;p&gt;She picked Rogers Park for the same reason all the white liberals do. It&amp;#39;s at the sweet spot of affordability, safety, culture, and &amp;quot;authentic&amp;quot; city feel. Plus there&amp;#39;s a sizable white liberal community with bars and restaurants where they can all hang out together.  &lt;/p&gt;\n\n&lt;p&gt;The thing about that sweet spot, and the whole issue with urban gentrification in general, is that these were never permanent, homogeneous communities. The makeup of neighborhoods in a city like Chicago is constantly evolving and nothing you like will stay exactly the same for very long. The black families she&amp;#39;s so worried about displacing are living in the apartments that were full of Jewish, Irish, and German families before the 1950s. &lt;/p&gt;\n\n&lt;p&gt;Side note: The idea that the quarters she gives to pan-handlers count as a &amp;quot;tax&amp;quot; to the black community is pretty insulting. Lumping hard working black families into the same basket as homeless people and crack heads is the same kind of stereotyping she&amp;#39;s trying to prevent, no?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4gl8f", "score_hidden": false, "stickied": false, "created": 1491955286.0, "created_utc": 1491926486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4uaaq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "surfnsound", "parent_id": "t1_dg4qggp", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;Luxury condos free up older housing stock;\n\nExcept when they replace older housing stock.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Luxury condos free up older housing stock;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except when they replace older housing stock.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4uaaq", "score_hidden": false, "stickied": false, "created": 1491970172.0, "created_utc": 1491941372.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4qy3o", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Dreidhen", "parent_id": "t1_dg4qggp", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Luxury condos don't do that in practice, only theory. They make the real estate/construction industry hungry to convert more conventional space where regular middle (and lower) income people already are into profitable luxury condos. They don't need to buy out the renters, just keep dropping enough $$$,$$$'s until no sane landlord would refuse. \n\n Population can be very much controlled through soft caps and zoning. People don't want to live in shoeboxes either, not in projects old or \"new\". The future isn't a bladerunner or judge dread setpiece, you can still house many millions of people in low rise, leafy areas. The solution is not to provide an overabundance of labor, but instead focus on skilled training, strong worker representation, and livable cities - not merely ones that can house every last person on earth. Educated people with good jobs have small families and desire a moderate amount of space. A sustainable NYC can provide that. One that just wants to cram as many hot bodies into as small area as possible to live in can not. \n\nFrom a schmoe on the ground, we've had tons of giveaways to the consortium I mentioned, with tons more luxury housing, it's barely helped regular people. I speak as a former renter, and a landlord, and a home (an actual home) owner and from my thirty + years of living in NYC.\n\nEDIT: Took a walk up Grand street since the weather's glorious. A block and a half away, I'm gratified to finally see \"normal\" buildings getting built - seems some of the RE Dev's have learned that it's better to have a full five story than an empty twenty, so my slice of local reality seems to bear out my rant. Which is a good thing for the future. ", "edited": 1491944375.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Luxury condos don&amp;#39;t do that in practice, only theory. They make the real estate/construction industry hungry to convert more conventional space where regular middle (and lower) income people already are into profitable luxury condos. They don&amp;#39;t need to buy out the renters, just keep dropping enough $$$,$$$&amp;#39;s until no sane landlord would refuse. &lt;/p&gt;\n\n&lt;p&gt;Population can be very much controlled through soft caps and zoning. People don&amp;#39;t want to live in shoeboxes either, not in projects old or &amp;quot;new&amp;quot;. The future isn&amp;#39;t a bladerunner or judge dread setpiece, you can still house many millions of people in low rise, leafy areas. The solution is not to provide an overabundance of labor, but instead focus on skilled training, strong worker representation, and livable cities - not merely ones that can house every last person on earth. Educated people with good jobs have small families and desire a moderate amount of space. A sustainable NYC can provide that. One that just wants to cram as many hot bodies into as small area as possible to live in can not. &lt;/p&gt;\n\n&lt;p&gt;From a schmoe on the ground, we&amp;#39;ve had tons of giveaways to the consortium I mentioned, with tons more luxury housing, it&amp;#39;s barely helped regular people. I speak as a former renter, and a landlord, and a home (an actual home) owner and from my thirty + years of living in NYC.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Took a walk up Grand street since the weather&amp;#39;s glorious. A block and a half away, I&amp;#39;m gratified to finally see &amp;quot;normal&amp;quot; buildings getting built - seems some of the RE Dev&amp;#39;s have learned that it&amp;#39;s better to have a full five story than an empty twenty, so my slice of local reality seems to bear out my rant. Which is a good thing for the future. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4qy3o", "score_hidden": false, "stickied": false, "created": 1491966558.0, "created_utc": 1491937758.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qggp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Adam_df", "parent_id": "t1_dg4neek", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;  the City doesn't need more people buying luxury condo's\n\nLuxury condos free up older housing stock; the old houses that the buyers had been in don't just fall into the sea.\n\n&gt;I don't believe the City needs to or should be larger than 9 million people\n\nWhen the population increases over whatever arbitrary cap we have, rents rise and gentrification becomes an issue.\n\nIf you answer is, essentially, \"fuck 'em,\" that's fine with me, but others want relief from the ever increasing rent and it's hard to blame them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the City doesn&amp;#39;t need more people buying luxury condo&amp;#39;s&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Luxury condos free up older housing stock; the old houses that the buyers had been in don&amp;#39;t just fall into the sea.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t believe the City needs to or should be larger than 9 million people&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When the population increases over whatever arbitrary cap we have, rents rise and gentrification becomes an issue.&lt;/p&gt;\n\n&lt;p&gt;If you answer is, essentially, &amp;quot;fuck &amp;#39;em,&amp;quot; that&amp;#39;s fine with me, but others want relief from the ever increasing rent and it&amp;#39;s hard to blame them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4qggp", "score_hidden": false, "stickied": false, "created": 1491966040.0, "created_utc": 1491937240.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4neek", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "Dreidhen", "parent_id": "t1_dg48tsw", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "That's a lovely opinion, but maybe consider that the height limitations are there for a reason. [Often times put in by previous administrations \\(Bloomberg\\)](http://www.politico.com/states/new-york/city-hall/story/2014/02/the-quiet-massive-rezoning-of-new-york-078398) who might be argubaly far more well informed about the livability of the City going into future decades than either you or I.\n\nI prefer building up vacant lots and comparable density matching to accommodate sustainable growth while retaining the qualities that make neighborhoods livable and \"human\" scaled (not new concepts). Flipping the old canard about \"if you build it, they will come\", well, when they do stop coming?- **When you stop building (so much)**. A lot of the newer buildings aren't that great in terms of quality construction, and the City doesn't need more people buying luxury condo's. What it needs are middle class families who aren't living cheek to jowl likes sardines, and actually get some private room to breathe, and god forbid, some green space and fresh air. Actually, every new luxury condo that goes up deprives the vast majority of working stiffs of an affordable smaller scaled building that could've been there - six stories instead of twelve, a shared driveway and small front yards instead of something called \"a communal green space\" that looks like a grass square behind a commercial skyscraper.\n\nI don't believe the City needs to or should be larger than 9 million people, accounting for birth rates, death rates, and people who move away.  But then again I still live and work here, so maybe I see things differently than you.  ", "edited": 1491934494.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a lovely opinion, but maybe consider that the height limitations are there for a reason. &lt;a href=\"http://www.politico.com/states/new-york/city-hall/story/2014/02/the-quiet-massive-rezoning-of-new-york-078398\"&gt;Often times put in by previous administrations (Bloomberg)&lt;/a&gt; who might be argubaly far more well informed about the livability of the City going into future decades than either you or I.&lt;/p&gt;\n\n&lt;p&gt;I prefer building up vacant lots and comparable density matching to accommodate sustainable growth while retaining the qualities that make neighborhoods livable and &amp;quot;human&amp;quot; scaled (not new concepts). Flipping the old canard about &amp;quot;if you build it, they will come&amp;quot;, well, when they do stop coming?- &lt;strong&gt;When you stop building (so much)&lt;/strong&gt;. A lot of the newer buildings aren&amp;#39;t that great in terms of quality construction, and the City doesn&amp;#39;t need more people buying luxury condo&amp;#39;s. What it needs are middle class families who aren&amp;#39;t living cheek to jowl likes sardines, and actually get some private room to breathe, and god forbid, some green space and fresh air. Actually, every new luxury condo that goes up deprives the vast majority of working stiffs of an affordable smaller scaled building that could&amp;#39;ve been there - six stories instead of twelve, a shared driveway and small front yards instead of something called &amp;quot;a communal green space&amp;quot; that looks like a grass square behind a commercial skyscraper.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t believe the City needs to or should be larger than 9 million people, accounting for birth rates, death rates, and people who move away.  But then again I still live and work here, so maybe I see things differently than you.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4neek", "score_hidden": false, "stickied": false, "created": 1491962726.0, "created_utc": 1491933926.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48tsw", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "Adam_df", "parent_id": "t1_dg48mwn", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; how do you not partake in gentrification?\n\nThe only non-racist thing for a white person to do, apparently, is to refuse to live around black people. It's for their own good.\n\n&gt;how do you prevent this? Should I not rent a nice apartment? \n\nI think gentrification anxiety is dumb, so my answer is: do whatever you want. \n\n&gt;What are some real solutions?\n\nBuild more housing. When I lived in Brooklyn (a gentrifying part of it), for example, there were limitations on how high people could build. That's dumb. Brooklyn isn't a quaint Swiss village, it's a huge city with serious space constraints and a dire lack of housing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;how do you not partake in gentrification?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The only non-racist thing for a white person to do, apparently, is to refuse to live around black people. It&amp;#39;s for their own good.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;how do you prevent this? Should I not rent a nice apartment? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think gentrification anxiety is dumb, so my answer is: do whatever you want. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What are some real solutions?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Build more housing. When I lived in Brooklyn (a gentrifying part of it), for example, there were limitations on how high people could build. That&amp;#39;s dumb. Brooklyn isn&amp;#39;t a quaint Swiss village, it&amp;#39;s a huge city with serious space constraints and a dire lack of housing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg48tsw", "score_hidden": false, "stickied": false, "created": 1491946040.0, "created_utc": 1491917240.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg53aad", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Hahahahahahai", "parent_id": "t1_dg48mwn", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I mean, in this case, she works at Northwestern but chose to move to the Bushwick of Chicago... she literally went out of her way to do it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, in this case, she works at Northwestern but chose to move to the Bushwick of Chicago... she literally went out of her way to do it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg53aad", "score_hidden": false, "stickied": false, "created": 1491981092.0, "created_utc": 1491952292.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48mwn", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "I_Never_Say_LOL", "parent_id": "t1_dg483v2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I understand your point, but at the same time, how do you not partake in gentrification?  \n\nI don't know if there is a right answer, but how do you prevent this?  Should I not rent a nice apartment?  Should I drive 4 hours to work?  I don't know how to fix it, but real estate and rent control is a very difficult and complex subject.  \n\nI am less concerned with the problem of gentrification now as it is completely out of my personal control; and more concerned about the solutions.  It's difficult to offer and discuss them though, l as any proposal is open to be dissected and derided, either for doing too much or not doing enough.  What are some real solutions?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand your point, but at the same time, how do you not partake in gentrification?  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if there is a right answer, but how do you prevent this?  Should I not rent a nice apartment?  Should I drive 4 hours to work?  I don&amp;#39;t know how to fix it, but real estate and rent control is a very difficult and complex subject.  &lt;/p&gt;\n\n&lt;p&gt;I am less concerned with the problem of gentrification now as it is completely out of my personal control; and more concerned about the solutions.  It&amp;#39;s difficult to offer and discuss them though, l as any proposal is open to be dissected and derided, either for doing too much or not doing enough.  What are some real solutions?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg48mwn", "score_hidden": false, "stickied": false, "created": 1491945771.0, "created_utc": 1491916971.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4gbld", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Varnu", "parent_id": "t1_dg4d5wm", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think the key difference between Texas metros and other more desirable, walkable urban forms is parking minimums. Houston, famously, has \"no zoning\". But they do require over one parking spot *per bedroom* and tons of parking for every business, even ones that should serve walking customers, like a bar.\n\nI think if you have zoning with broad standards--no curb cuts, no drive throughs, parking accommodations decided by demand and use--you end up with Georgetown and Greenwich Village and Lincoln Park. If you require three parking spots for every apartment, you get Houston.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the key difference between Texas metros and other more desirable, walkable urban forms is parking minimums. Houston, famously, has &amp;quot;no zoning&amp;quot;. But they do require over one parking spot &lt;em&gt;per bedroom&lt;/em&gt; and tons of parking for every business, even ones that should serve walking customers, like a bar.&lt;/p&gt;\n\n&lt;p&gt;I think if you have zoning with broad standards--no curb cuts, no drive throughs, parking accommodations decided by demand and use--you end up with Georgetown and Greenwich Village and Lincoln Park. If you require three parking spots for every apartment, you get Houston.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4gbld", "score_hidden": false, "stickied": false, "created": 1491954988.0, "created_utc": 1491926188.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4d5wm", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "ledeuxmagots", "parent_id": "t1_dg48t09", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Sadly, long term lack of regulation / weak zoning leads to places I'd also not want to live. I lived in major metros in Texas for 20 years and no amount of money would convince me to ever go back. \n\nMeanwhile, I'd be willing to pay a very substantial premium to live in SF (which I do), NYC, or DC. \n\nIt's a tricky thing. Where is the ideal medium of enough regulation but not too much? What works for me may not work for others. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sadly, long term lack of regulation / weak zoning leads to places I&amp;#39;d also not want to live. I lived in major metros in Texas for 20 years and no amount of money would convince me to ever go back. &lt;/p&gt;\n\n&lt;p&gt;Meanwhile, I&amp;#39;d be willing to pay a very substantial premium to live in SF (which I do), NYC, or DC. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a tricky thing. Where is the ideal medium of enough regulation but not too much? What works for me may not work for others. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4d5wm", "score_hidden": false, "stickied": false, "created": 1491951463.0, "created_utc": 1491922663.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4w4un", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "surfnsound", "parent_id": "t1_dg4w0ks", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think it's interesting to use the timeline in Google Earth and look at the satellite feeds from the 1970s to today with respect to Houston. From what I've read it's a city that is starting to come into it's own culturally, and maybe we will see some reversals, but the sprawl you can see looking at that progression really deters me from ever wanting to live there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s interesting to use the timeline in Google Earth and look at the satellite feeds from the 1970s to today with respect to Houston. From what I&amp;#39;ve read it&amp;#39;s a city that is starting to come into it&amp;#39;s own culturally, and maybe we will see some reversals, but the sprawl you can see looking at that progression really deters me from ever wanting to live there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4w4un", "score_hidden": false, "stickied": false, "created": 1491972238.0, "created_utc": 1491943438.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4w0ks", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AvianDentures", "parent_id": "t1_dg4uk5o", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "oh of course -- the biggest things affecting those super expensive housing markets (by far) are a very high demand and a limited geographic space. That said, NIMBYism and rent controls have made the problem worse, but like you said, they're not the primary reason the problem exists", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh of course -- the biggest things affecting those super expensive housing markets (by far) are a very high demand and a limited geographic space. That said, NIMBYism and rent controls have made the problem worse, but like you said, they&amp;#39;re not the primary reason the problem exists&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4w0ks", "score_hidden": false, "stickied": false, "created": 1491972109.0, "created_utc": 1491943309.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4uk5o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "surfnsound", "parent_id": "t1_dg48t09", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Dallas, Atlanta, or Houston\n\nThey also are insanely spread out though. NYC's density is almost 8 times hire than Houston's. You can't really compare", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Dallas, Atlanta, or Houston&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They also are insanely spread out though. NYC&amp;#39;s density is almost 8 times hire than Houston&amp;#39;s. You can&amp;#39;t really compare&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4uk5o", "score_hidden": false, "stickied": false, "created": 1491970478.0, "created_utc": 1491941678.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48t09", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "AvianDentures", "parent_id": "t1_dg48n7a", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;The CW among many is that we need to deregulate and let builders build more housing stock.\n\nYeah it's not a total coincidence that relatively unregulated large housing markets like Dallas, Atlanta, or Houston are much more affordable than highly regulated large housing markets (like SF, DC, or NYC).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The CW among many is that we need to deregulate and let builders build more housing stock.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah it&amp;#39;s not a total coincidence that relatively unregulated large housing markets like Dallas, Atlanta, or Houston are much more affordable than highly regulated large housing markets (like SF, DC, or NYC).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg48t09", "score_hidden": false, "stickied": false, "created": 1491946011.0, "created_utc": 1491917211.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48n7a", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "Adam_df", "parent_id": "t1_dg48fxj", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I like to hate-read gentrification articles and discussion threads, so I've seen a lot of responses. A typical response is \"we should all have free housing and the government should pay for it.\" Putting aside the economics of that, the author of that sentiment believes that their guilt is paid for by voting for progressives. (the author of the OP *literally* tries to pay for her sin of being white by handing out quarters and dimes to black people, her \"tax\" for being white. Fucking gross)\n\nSo that's how they get around their guilt: they position themselves as \"good whites,\" not those bad white people that gentrify out of self-interest without at least symbolically supporting the people whom they're displacing.\n\nAs for *actual* alternatives, that's a good question. The CW among many is that we need to deregulate and let builders build more housing stock. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like to hate-read gentrification articles and discussion threads, so I&amp;#39;ve seen a lot of responses. A typical response is &amp;quot;we should all have free housing and the government should pay for it.&amp;quot; Putting aside the economics of that, the author of that sentiment believes that their guilt is paid for by voting for progressives. (the author of the OP &lt;em&gt;literally&lt;/em&gt; tries to pay for her sin of being white by handing out quarters and dimes to black people, her &amp;quot;tax&amp;quot; for being white. Fucking gross)&lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s how they get around their guilt: they position themselves as &amp;quot;good whites,&amp;quot; not those bad white people that gentrify out of self-interest without at least symbolically supporting the people whom they&amp;#39;re displacing.&lt;/p&gt;\n\n&lt;p&gt;As for &lt;em&gt;actual&lt;/em&gt; alternatives, that&amp;#39;s a good question. The CW among many is that we need to deregulate and let builders build more housing stock. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg48n7a", "score_hidden": false, "stickied": false, "created": 1491945782.0, "created_utc": 1491916982.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg5fbom", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Varnu", "parent_id": "t1_dg4on1p", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "It's hard for me to understand what you've linked. Here's a blog post from [Marginal Revolution](http://marginalrevolution.com/marginalrevolution/2016/08/laissez-faire-in-tokyo.html) that I feel is accurate as to what has happened in Tokyo. There's a nearly identical post in the Economist that I've read in the last few months.\n\nThere are a number of Collective Action Problems that manifest in local development issues. There may be developments that broad swaths of nearby residents and politicians provide moderate support to, while very-nearby residents oppose vehemently. The only ones that may be heard are the minority with extreme views. Similarly, there are people who have perverse incentives to increase their own land values to the detriment of the community at large or to the detriment of future residents. Not a month goes by where I'm not at a community meeting saying, \"Blocking this--thus restiricting supply of residences--would be good for my property values, but bad for Chicago and bad for the community I live in. But I would rather have more neighbors and more eyes on the street and more people providing custom to local businesses.\" The vast majority of community input isn't from people like me who want the best for their community, but from cranks and those who somehow infuriatingly believe that restricting the supply of residences will somehow lower the demand for housing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard for me to understand what you&amp;#39;ve linked. Here&amp;#39;s a blog post from &lt;a href=\"http://marginalrevolution.com/marginalrevolution/2016/08/laissez-faire-in-tokyo.html\"&gt;Marginal Revolution&lt;/a&gt; that I feel is accurate as to what has happened in Tokyo. There&amp;#39;s a nearly identical post in the Economist that I&amp;#39;ve read in the last few months.&lt;/p&gt;\n\n&lt;p&gt;There are a number of Collective Action Problems that manifest in local development issues. There may be developments that broad swaths of nearby residents and politicians provide moderate support to, while very-nearby residents oppose vehemently. The only ones that may be heard are the minority with extreme views. Similarly, there are people who have perverse incentives to increase their own land values to the detriment of the community at large or to the detriment of future residents. Not a month goes by where I&amp;#39;m not at a community meeting saying, &amp;quot;Blocking this--thus restiricting supply of residences--would be good for my property values, but bad for Chicago and bad for the community I live in. But I would rather have more neighbors and more eyes on the street and more people providing custom to local businesses.&amp;quot; The vast majority of community input isn&amp;#39;t from people like me who want the best for their community, but from cranks and those who somehow infuriatingly believe that restricting the supply of residences will somehow lower the demand for housing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5fbom", "score_hidden": false, "stickied": false, "created": 1491997477.0, "created_utc": 1491968677.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4on1p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dreidhen", "parent_id": "t1_dg4behp", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Twenty years? [Really?](http://www.kantei.ne.jp/release/PDFs/T201508.pdf) [Not what I'm seeing](https://resources.realestate.co.jp/wp-content/uploads/2015/09/Tokyo-23-Wards-Avg-Rent-Graph.png). Like everything they're subject to numerous factors, and have gone up pretty high, then fallen, then rise, then leveled off. Tokyo is a very different beast from Chicago. There are also a lot of wards in Tokyo where current residents strongly advocate their quality of life not suffer due to rampant over-building, and the City in many cases tries to address and respect that legitimate concern as much as possible. It's not all skyscrapers - look at [Tomigaya](https://encrypted.google.com/search?safe=off&amp;hl=en&amp;biw=1280&amp;bih=611&amp;tbm=isch&amp;sa=1&amp;q=Tomigaya+houses&amp;oq=Tomigaya+houses&amp;gs_l=img.3...7081.7559.0.7687.6.5.0.1.1.0.125.488.3j2.5.0....0...1c.1.64.img..0.2.96...0i24k1.Mx7p42PjvFQ#imgrc=FA1wxdyhhng_EM:), and [outsiders love to tell the people there they need to embrace density even more.](http://marketurbanism.com/2012/06/28/tokyos-surprising-lack-of-density/)\n \nThe pile of sand metaphor is clever, but I wouldn't argue that veto powers from \"hyper local\" (wtf does that mean? I live somewhere all my years, and care passionately about it, I'm \"hyper local\"?) should be stripped.\n\nRather, you have CB meetings, you try to ensure current residents are satisfied, but that their voice isn't the only one that dominates decision-making. For ex here in NYC CB (outside of supremely wealthy enclaves) don't get much say, the City can already do whatever it pleases without regard for current residents. And that leads to a lot of unwelcome changes. **The relentless hype for housing and progress leads to sterile prison-cities with perfunctory parks, no street culture, no real diversity, no grit - just rows of glass pencils and chain-stores.** (Isn't that the criticism leveraged at suburbs!?) Renovating and retro-fitting and in-filling AND preservation do far more good to keep people where they are, while still allowing some influx of newcomers, than simply the raze, raze, raze and rebuild it-higher mentality.", "edited": 1491939196.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Twenty years? &lt;a href=\"http://www.kantei.ne.jp/release/PDFs/T201508.pdf\"&gt;Really?&lt;/a&gt; &lt;a href=\"https://resources.realestate.co.jp/wp-content/uploads/2015/09/Tokyo-23-Wards-Avg-Rent-Graph.png\"&gt;Not what I&amp;#39;m seeing&lt;/a&gt;. Like everything they&amp;#39;re subject to numerous factors, and have gone up pretty high, then fallen, then rise, then leveled off. Tokyo is a very different beast from Chicago. There are also a lot of wards in Tokyo where current residents strongly advocate their quality of life not suffer due to rampant over-building, and the City in many cases tries to address and respect that legitimate concern as much as possible. It&amp;#39;s not all skyscrapers - look at &lt;a href=\"https://encrypted.google.com/search?safe=off&amp;amp;hl=en&amp;amp;biw=1280&amp;amp;bih=611&amp;amp;tbm=isch&amp;amp;sa=1&amp;amp;q=Tomigaya+houses&amp;amp;oq=Tomigaya+houses&amp;amp;gs_l=img.3...7081.7559.0.7687.6.5.0.1.1.0.125.488.3j2.5.0....0...1c.1.64.img..0.2.96...0i24k1.Mx7p42PjvFQ#imgrc=FA1wxdyhhng_EM:\"&gt;Tomigaya&lt;/a&gt;, and &lt;a href=\"http://marketurbanism.com/2012/06/28/tokyos-surprising-lack-of-density/\"&gt;outsiders love to tell the people there they need to embrace density even more.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The pile of sand metaphor is clever, but I wouldn&amp;#39;t argue that veto powers from &amp;quot;hyper local&amp;quot; (wtf does that mean? I live somewhere all my years, and care passionately about it, I&amp;#39;m &amp;quot;hyper local&amp;quot;?) should be stripped.&lt;/p&gt;\n\n&lt;p&gt;Rather, you have CB meetings, you try to ensure current residents are satisfied, but that their voice isn&amp;#39;t the only one that dominates decision-making. For ex here in NYC CB (outside of supremely wealthy enclaves) don&amp;#39;t get much say, the City can already do whatever it pleases without regard for current residents. And that leads to a lot of unwelcome changes. &lt;strong&gt;The relentless hype for housing and progress leads to sterile prison-cities with perfunctory parks, no street culture, no real diversity, no grit - just rows of glass pencils and chain-stores.&lt;/strong&gt; (Isn&amp;#39;t that the criticism leveraged at suburbs!?) Renovating and retro-fitting and in-filling AND preservation do far more good to keep people where they are, while still allowing some influx of newcomers, than simply the raze, raze, raze and rebuild it-higher mentality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4on1p", "score_hidden": false, "stickied": false, "created": 1491964102.0, "created_utc": 1491935302.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4behp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Varnu", "parent_id": "t1_dg48fxj", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Where I live in Chicago, there's a few in-demand neighborhoods near the lake. People want to live there, but groups of entrenched, wealthy homeowners make it difficult to build the high density buildings that would allow demand to be met. So those would-be residents spill over into neighborhoods to the west and north. Then *those* became gentrified and people spread out. I have done this twice. \"I want to live in neighborhood-A, but I can't afford it, so I will move to neighborhood-B, as the next best alternative.\"\n\nIF you think about gentrification as a pile of sand, where you dump more sand on the top and most of it rolls to the edges of the pile, the primary solution is to allow a sufficient supply of residences to be built in areas of high demand at the center of the pile. The way to do this is to make sure zoning and planning decisions are controlled at the city level--or large community area--without strong veto powers from hyper-local residents. \n\nThis has worked in Tokyo. You can basically build whatever you want wherever you want in Tokyo and rents haven't risen in 20 years.", "edited": 1491921578.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where I live in Chicago, there&amp;#39;s a few in-demand neighborhoods near the lake. People want to live there, but groups of entrenched, wealthy homeowners make it difficult to build the high density buildings that would allow demand to be met. So those would-be residents spill over into neighborhoods to the west and north. Then &lt;em&gt;those&lt;/em&gt; became gentrified and people spread out. I have done this twice. &amp;quot;I want to live in neighborhood-A, but I can&amp;#39;t afford it, so I will move to neighborhood-B, as the next best alternative.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;IF you think about gentrification as a pile of sand, where you dump more sand on the top and most of it rolls to the edges of the pile, the primary solution is to allow a sufficient supply of residences to be built in areas of high demand at the center of the pile. The way to do this is to make sure zoning and planning decisions are controlled at the city level--or large community area--without strong veto powers from hyper-local residents. &lt;/p&gt;\n\n&lt;p&gt;This has worked in Tokyo. You can basically build whatever you want wherever you want in Tokyo and rents haven&amp;#39;t risen in 20 years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4behp", "score_hidden": false, "stickied": false, "created": 1491949402.0, "created_utc": 1491920602.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg50n5r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "steauengeglase", "parent_id": "t1_dg48fxj", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Honestly, the most effective thing I have witnessed is rent control for Mom-n-Pop businesses. It could be a new hot spot in a run-down neighborhood or run-down storefront on Main St. USA. \n\nWithout rent control the Mom-n-Pops are essentially punished for their own success while those businesses are too often the stop-gap between a neighborhood going down the toilet and one that escalates too fast (and either prices everyone out or goes into a boom &amp; bust cycle).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, the most effective thing I have witnessed is rent control for Mom-n-Pop businesses. It could be a new hot spot in a run-down neighborhood or run-down storefront on Main St. USA. &lt;/p&gt;\n\n&lt;p&gt;Without rent control the Mom-n-Pops are essentially punished for their own success while those businesses are too often the stop-gap between a neighborhood going down the toilet and one that escalates too fast (and either prices everyone out or goes into a boom &amp;amp; bust cycle).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg50n5r", "score_hidden": false, "stickied": false, "created": 1491977662.0, "created_utc": 1491948862.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48fxj", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "AvianDentures", "parent_id": "t1_dg483v2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;If you think gentrifying is wrong, don't fucking do it.\n\nIn all these articles decrying gentrification, nothing is ever offered up as the alternative.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you think gentrifying is wrong, don&amp;#39;t fucking do it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In all these articles decrying gentrification, nothing is ever offered up as the alternative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg48fxj", "score_hidden": false, "stickied": false, "created": 1491945496.0, "created_utc": 1491916696.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4jqaz", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Tsegen", "parent_id": "t1_dg483v2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "You touch on another issue that's been bothering me for a while now. The idea that self awareness and public confession is ablution. Apparently you can do whatever you like as long as you come out with a sincere monologue about it.\n\n I don't know where it comes from. Perhaps it comes from the influence of celebrity apologies, where the entire point is the spectacle of apology but not the change ( which often cannot be seen)?\n\n\nNo, true sincerity comes from not doing things you think are wrong. Your words dont absolve you, this isn't a movie and you're not a main character having your moment to be sympathetic. Actions matter. ", "edited": 1491930660.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You touch on another issue that&amp;#39;s been bothering me for a while now. The idea that self awareness and public confession is ablution. Apparently you can do whatever you like as long as you come out with a sincere monologue about it.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know where it comes from. Perhaps it comes from the influence of celebrity apologies, where the entire point is the spectacle of apology but not the change ( which often cannot be seen)?&lt;/p&gt;\n\n&lt;p&gt;No, true sincerity comes from not doing things you think are wrong. Your words dont absolve you, this isn&amp;#39;t a movie and you&amp;#39;re not a main character having your moment to be sympathetic. Actions matter. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4jqaz", "score_hidden": false, "stickied": false, "created": 1491958713.0, "created_utc": 1491929913.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg57cf0", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "vtscala", "parent_id": "t1_dg483v2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Having confessed your sins in the Guardian and washed them in the blood of the lamb white guilt, you must say \"Trump and his supporters are racists\" ten times and then you will be clean.\n\nThank you.  The lady's hand-wringing in the article was beyond obnoxious.\n\nAnd your quote is on point.  It's all virtue-signalling; as Sam Hyde put it at Ted, [\"pat yourselves on the back!\"](https://www.youtube.com/watch?v=-yFhR1fKWG0)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Having confessed your sins in the Guardian and washed them in the blood of the lamb white guilt, you must say &amp;quot;Trump and his supporters are racists&amp;quot; ten times and then you will be clean.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Thank you.  The lady&amp;#39;s hand-wringing in the article was beyond obnoxious.&lt;/p&gt;\n\n&lt;p&gt;And your quote is on point.  It&amp;#39;s all virtue-signalling; as Sam Hyde put it at Ted, &lt;a href=\"https://www.youtube.com/watch?v=-yFhR1fKWG0\"&gt;&amp;quot;pat yourselves on the back!&amp;quot;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg57cf0", "score_hidden": false, "stickied": false, "created": 1491986537.0, "created_utc": 1491957737.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4u4f1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "surfnsound", "parent_id": "t1_dg483v2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; On the Internet, white people have taken to acknowledging their own white privilege, and thus their own complicity in white supremacy.\n\nThis is such a bullshit take on it. Recognizing your privilege does not in anyway implicate you as a white supremacist, nor does it mean you are complicit in white supremacy. In fact, the vary idea of white privilege is that it is something that exists without the need for the person benefiting from it to do anything to take advantage of the privilege. That's because, in reality, it is not something which grants benefits, it's more a lack of negative consequences due to your race.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;On the Internet, white people have taken to acknowledging their own white privilege, and thus their own complicity in white supremacy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is such a bullshit take on it. Recognizing your privilege does not in anyway implicate you as a white supremacist, nor does it mean you are complicit in white supremacy. In fact, the vary idea of white privilege is that it is something that exists without the need for the person benefiting from it to do anything to take advantage of the privilege. That&amp;#39;s because, in reality, it is not something which grants benefits, it&amp;#39;s more a lack of negative consequences due to your race.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4u4f1", "score_hidden": false, "stickied": false, "created": 1491969989.0, "created_utc": 1491941189.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4k6g3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jnb64", "parent_id": "t1_dg4jrx6", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;Isn't participating in, and benefiting from, a racist system implicitly supporting that system?\n\nOnly if that participation is knowing. If you realize the system is racist and you're like, \"yeah, sweet -- I wanna keep it this way so I keep benefitting\" that'd be racist.\n\nBut the vast majority of white people either don't realize the system's rigged against the nonwhite, or refuse to believe it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Isn&amp;#39;t participating in, and benefiting from, a racist system implicitly supporting that system?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Only if that participation is knowing. If you realize the system is racist and you&amp;#39;re like, &amp;quot;yeah, sweet -- I wanna keep it this way so I keep benefitting&amp;quot; that&amp;#39;d be racist.&lt;/p&gt;\n\n&lt;p&gt;But the vast majority of white people either don&amp;#39;t realize the system&amp;#39;s rigged against the nonwhite, or refuse to believe it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4k6g3", "score_hidden": false, "stickied": false, "created": 1491959204.0, "created_utc": 1491930404.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jrx6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "mthlmw", "parent_id": "t1_dg4gbud", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Isn't participating in, and benefiting from, a racist system implicitly supporting that system? And wouldn't you call someone who supports a racist system a racist?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Isn&amp;#39;t participating in, and benefiting from, a racist system implicitly supporting that system? And wouldn&amp;#39;t you call someone who supports a racist system a racist?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4jrx6", "score_hidden": false, "stickied": false, "created": 1491958761.0, "created_utc": 1491929961.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gbud", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jnb64", "parent_id": "t1_dg4a71w", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Benefiting from a racist system doesn't make you racist. It makes you privileged.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Benefiting from a racist system doesn&amp;#39;t make you racist. It makes you privileged.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4gbud", "score_hidden": false, "stickied": false, "created": 1491954995.0, "created_utc": 1491926195.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4anxt", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg4a71w", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "Trump is a racist because he says racist things and pushes a racist agenda. You can be white and not go out if your way to fuck people over. Race rations have obviously gotten better in the last 150 years and that's not because \"all white people are racist.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trump is a racist because he says racist things and pushes a racist agenda. You can be white and not go out if your way to fuck people over. Race rations have obviously gotten better in the last 150 years and that&amp;#39;s not because &amp;quot;all white people are racist.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4anxt", "score_hidden": false, "stickied": false, "created": 1491948480.0, "created_utc": 1491919680.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4a71w", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "mthlmw", "parent_id": "t1_dg49da4", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Aren't all white people technically racist anyway, by benefiting from a racist system? Trump is a racist no matter what he does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aren&amp;#39;t all white people technically racist anyway, by benefiting from a racist system? Trump is a racist no matter what he does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4a71w", "score_hidden": false, "stickied": false, "created": 1491947868.0, "created_utc": 1491919068.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49da4", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg49887", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "I just didn't want to see fact get diluted in the snark tea you're brewing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just didn&amp;#39;t want to see fact get diluted in the snark tea you&amp;#39;re brewing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg49da4", "score_hidden": false, "stickied": false, "created": 1491946781.0, "created_utc": 1491917981.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49887", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Adam_df", "parent_id": "t1_dg4955s", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "That wasn't my point at all, but ok. \n\nGlad you got that out of your system.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That wasn&amp;#39;t my point at all, but ok. &lt;/p&gt;\n\n&lt;p&gt;Glad you got that out of your system.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg49887", "score_hidden": false, "stickied": false, "created": 1491946593.0, "created_utc": 1491917793.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4955s", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg483v2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Trump and his supporters *are* racist. That's a fact.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trump and his supporters &lt;em&gt;are&lt;/em&gt; racist. That&amp;#39;s a fact.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4955s", "score_hidden": false, "stickied": false, "created": 1491946473.0, "created_utc": 1491917673.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg483v2", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "Adam_df", "parent_id": "t3_64q01v", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Having confessed your sins in the Guardian and washed them in ~~the blood of the lamb~~ white guilt, you must say \"Trump and his supporters are racists\" ten times and then you will be clean.\n\n[eg:](https://www.washingtonpost.com/posteverything/wp/2016/01/28/when-white-people-admit-white-privilege-theyre-really-just-congratulating-themselves/?utm_term=.533a6603b6e4)\n&gt;There’s a strange, profoundly contemporary form of behavior that says a lot about our continuing problems with race and the deeply anxious, neurotic ways in which we’re confronting those problems: the ritualistic practice of white self-indictment.\n\n&gt;On the Internet, white people have taken to acknowledging their own white privilege, and thus their own complicity in white supremacy. This behavior is undertaken, with eminent sincerity, in an effort to confront the abundant racial inequality in contemporary America. But like so much else in our society, the practice has ultimately worked not to undermine structural racism — the putative aim — but merely to deepen the self-regard of the educated white elite.\n\nThis article is very much a piece with that. If you think gentrifying is wrong, *don't fucking do it.* Instead, the author thinks she can atone by writing an article explaining just how *complex* it is for her to do something in her self-interest that she thinks is wrong.", "edited": 1491916709.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having confessed your sins in the Guardian and washed them in &lt;del&gt;the blood of the lamb&lt;/del&gt; white guilt, you must say &amp;quot;Trump and his supporters are racists&amp;quot; ten times and then you will be clean.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.washingtonpost.com/posteverything/wp/2016/01/28/when-white-people-admit-white-privilege-theyre-really-just-congratulating-themselves/?utm_term=.533a6603b6e4\"&gt;eg:&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There’s a strange, profoundly contemporary form of behavior that says a lot about our continuing problems with race and the deeply anxious, neurotic ways in which we’re confronting those problems: the ritualistic practice of white self-indictment.&lt;/p&gt;\n\n&lt;p&gt;On the Internet, white people have taken to acknowledging their own white privilege, and thus their own complicity in white supremacy. This behavior is undertaken, with eminent sincerity, in an effort to confront the abundant racial inequality in contemporary America. But like so much else in our society, the practice has ultimately worked not to undermine structural racism — the putative aim — but merely to deepen the self-regard of the educated white elite.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This article is very much a piece with that. If you think gentrifying is wrong, &lt;em&gt;don&amp;#39;t fucking do it.&lt;/em&gt; Instead, the author thinks she can atone by writing an article explaining just how &lt;em&gt;complex&lt;/em&gt; it is for her to do something in her self-interest that she thinks is wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg483v2", "score_hidden": false, "stickied": false, "created": 1491944999.0, "created_utc": 1491916199.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4ghp4", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "jnb64", "parent_id": "t1_dg4dcn4", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "That's not gentrification. Gentrification is when white businesses spring up in poor, mostly-nonwhite neighborhoods and don't hire or serve locals. This drives up property values without bringing any money into the local economy, raising rent for people who can't afford it, forcing them out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not gentrification. Gentrification is when white businesses spring up in poor, mostly-nonwhite neighborhoods and don&amp;#39;t hire or serve locals. This drives up property values without bringing any money into the local economy, raising rent for people who can&amp;#39;t afford it, forcing them out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4ghp4", "score_hidden": false, "stickied": false, "created": 1491955176.0, "created_utc": 1491926376.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dcn4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "PotRoastPotato", "parent_id": "t3_64q01v", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "When I graduated and started working, my only way I could possibly own a house was to buy a piece of shit in a gentrifying neighborhood, run up my credit cards to fix it up and refinance. I'm not apologizing for buying and improving a house so that I could live in it. I find it really grating when others do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I graduated and started working, my only way I could possibly own a house was to buy a piece of shit in a gentrifying neighborhood, run up my credit cards to fix it up and refinance. I&amp;#39;m not apologizing for buying and improving a house so that I could live in it. I find it really grating when others do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4dcn4", "score_hidden": false, "stickied": false, "created": 1491951676.0, "created_utc": 1491922876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4gj72", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jnb64", "parent_id": "t3_64q01v", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Well this is just gross. A white person who openly admits participating in gentrification which she openly admits is wrong, wants us to feel sorry for *her*?\n\nJesus.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well this is just gross. A white person who openly admits participating in gentrification which she openly admits is wrong, wants us to feel sorry for &lt;em&gt;her&lt;/em&gt;?&lt;/p&gt;\n\n&lt;p&gt;Jesus.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4gj72", "score_hidden": false, "stickied": false, "created": 1491955224.0, "created_utc": 1491926424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg43hrz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "frasiera", "parent_id": "t3_64q01v", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "**submission statement**  \n\nWhen a white academic moved to one of the most diverse districts of Chicago, her parents worried for her safety. But as pet-groomers replaced local shops, she realised the area’s original residents had more to fear than she did.  \nGentrification processes usually follow similar steps. But the improvement of living conditions of a degraded neighbourhood is not normally intended for its present inhabitants, but for those who have to live there for lack of affordable housing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;submission statement&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;When a white academic moved to one of the most diverse districts of Chicago, her parents worried for her safety. But as pet-groomers replaced local shops, she realised the area’s original residents had more to fear than she did.&lt;br/&gt;\nGentrification processes usually follow similar steps. But the improvement of living conditions of a degraded neighbourhood is not normally intended for its present inhabitants, but for those who have to live there for lack of affordable housing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg43hrz", "score_hidden": false, "stickied": false, "created": 1491935724.0, "created_utc": 1491906924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64q01v", "likes": null, "replies": "", "user_reports": [], "id": "dg4ql4i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sharpcowboy", "parent_id": "t3_64q01v", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "\"Every society is threatened by a nearly infinite amount of dangers, Glassner writes, but societies differ in what they choose to fear. Americans, interestingly, tend to be most preoccupied with those dangers that are among the least likely to cause us harm, while we ignore the problems that are hurting the greatest number of people.\n\nWe suffer from a national confusion between true threats and imagined threats. And our imagined threats, Glassner argues, very often serve to mask true threats. The sensationalism around our “war” on illegal drugs has obscured the fact that legal drugs, the kind that are advertised on television, are more widely abused and cause more deaths. Worse than this, we allow our misplaced, illogical fears to stigmatise our own people. “Fear-mongers,” Glassner writes, “project on to black men precisely what slavery, poverty, educational deprivation, and discrimination have ensured that they do not have – great power and influence.”\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Every society is threatened by a nearly infinite amount of dangers, Glassner writes, but societies differ in what they choose to fear. Americans, interestingly, tend to be most preoccupied with those dangers that are among the least likely to cause us harm, while we ignore the problems that are hurting the greatest number of people.&lt;/p&gt;\n\n&lt;p&gt;We suffer from a national confusion between true threats and imagined threats. And our imagined threats, Glassner argues, very often serve to mask true threats. The sensationalism around our “war” on illegal drugs has obscured the fact that legal drugs, the kind that are advertised on television, are more widely abused and cause more deaths. Worse than this, we allow our misplaced, illogical fears to stigmatise our own people. “Fear-mongers,” Glassner writes, “project on to black men precisely what slavery, poverty, educational deprivation, and discrimination have ensured that they do not have – great power and influence.”&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4ql4i", "score_hidden": false, "stickied": false, "created": 1491966181.0, "created_utc": 1491937381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]