[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64t8a2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 129, "report_reasons": null, "author": "cincilator", "saved": false, "mod_reports": [], "name": "t3_64t8a2", "subreddit_name_prefixed": "r/TrueReddit", "approved_by": null, "over_18": false, "domain": "bloomberg.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qyt6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/TrueReddit/comments/64t8a2/how_middleclass_america_got_fleeced/", "num_reports": null, "locked": false, "stickied": false, "created": 1491968823.0, "url": "https://www.bloomberg.com/view/articles/2017-04-07/how-middle-class-america-got-fleeced", "author_flair_text": null, "quarantine": false, "title": "How Middle-Class America Got Fleeced", "created_utc": 1491940023.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 129}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg63zbe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PM_ME_UR_Definitions", "parent_id": "t1_dg639do", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "This seems like a direct result of having too few choices of who to vote for. If more than 50% of the voting population is for whatever single issues is getting someone elected, why aren't there more people running on that issue?\n\nCorporations don't care about gay marriage or abortion, they just donate to whomever has the best chance of getting elected and will also lower their taxes and regulations. So out of all the candidates who support any single issue all the economically progressive candidates get filtered out, and we get a couple choices that are the most pro-big-business.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This seems like a direct result of having too few choices of who to vote for. If more than 50% of the voting population is for whatever single issues is getting someone elected, why aren&amp;#39;t there more people running on that issue?&lt;/p&gt;\n\n&lt;p&gt;Corporations don&amp;#39;t care about gay marriage or abortion, they just donate to whomever has the best chance of getting elected and will also lower their taxes and regulations. So out of all the candidates who support any single issue all the economically progressive candidates get filtered out, and we get a couple choices that are the most pro-big-business.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg63zbe", "score_hidden": false, "stickied": false, "created": 1492043210.0, "created_utc": 1492014410.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg639do", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TechnoHorse", "parent_id": "t1_dg4vtyh", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; because we're the ones who consistently reelect people who don't care what we want and often pass laws directly against our own best interests.\n\nI think the problem is that a lot of us are single issue voters, especially on social issues. As long as a candidate has the right position on abortion, guns, trans people, gay marriage, flag burning, capital punishment or whatever for the area they live in, their economic positions are near irrelevant. The economy is voodoo to most people. It goes up, it goes down, you can't explain that! Smart people on both sides advocate for opposite things! But social issues, what the wonks say don't matter. No wonk can be the judge of what is morally good. \n\nYou can't pass a law that says \"make the economy good\", but you can pass a law that says \"let gay people marry\" or \"restrict abortions\". Those are results that voters can very clearly connect directly to the actions of their politicians. In an incredibly complex world, it's only inevitable and natural that people resort to voting based on issues they can punish their candidate for. Even a candidate that says \"I want to improve internet infrastructure and make it cheaper\", that's a promise they can't deliver unilaterally (it requires cooperation with businesses and a whole range of local governments), and it's also work that can take years. It's hard for a layman to know if the person truly tried to deliver on their effort, and also difficult to know how effective they were at doing so under the circumstances. And if you're trying to not be a single issue voter, how do you objectively factor that into the rest of their performance as a politician on other economic issues? Meanwhile anyone can propose a bill that says \"ban/allow X\", and if it fails you can just blame the other party, and if it passes all the credit goes to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;because we&amp;#39;re the ones who consistently reelect people who don&amp;#39;t care what we want and often pass laws directly against our own best interests.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think the problem is that a lot of us are single issue voters, especially on social issues. As long as a candidate has the right position on abortion, guns, trans people, gay marriage, flag burning, capital punishment or whatever for the area they live in, their economic positions are near irrelevant. The economy is voodoo to most people. It goes up, it goes down, you can&amp;#39;t explain that! Smart people on both sides advocate for opposite things! But social issues, what the wonks say don&amp;#39;t matter. No wonk can be the judge of what is morally good. &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t pass a law that says &amp;quot;make the economy good&amp;quot;, but you can pass a law that says &amp;quot;let gay people marry&amp;quot; or &amp;quot;restrict abortions&amp;quot;. Those are results that voters can very clearly connect directly to the actions of their politicians. In an incredibly complex world, it&amp;#39;s only inevitable and natural that people resort to voting based on issues they can punish their candidate for. Even a candidate that says &amp;quot;I want to improve internet infrastructure and make it cheaper&amp;quot;, that&amp;#39;s a promise they can&amp;#39;t deliver unilaterally (it requires cooperation with businesses and a whole range of local governments), and it&amp;#39;s also work that can take years. It&amp;#39;s hard for a layman to know if the person truly tried to deliver on their effort, and also difficult to know how effective they were at doing so under the circumstances. And if you&amp;#39;re trying to not be a single issue voter, how do you objectively factor that into the rest of their performance as a politician on other economic issues? Meanwhile anyone can propose a bill that says &amp;quot;ban/allow X&amp;quot;, and if it fails you can just blame the other party, and if it passes all the credit goes to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg639do", "score_hidden": false, "stickied": false, "created": 1492042451.0, "created_utc": 1492013651.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg5vckc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TotesMessenger", "parent_id": "t1_dg4vtyh", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/goodlongposts] [\\/u\\/PM\\_ME\\_UR\\_Definitions responds to: How Middle-Class America Got Fleeced \\[+35\\]](https://np.reddit.com/r/goodlongposts/comments/64y6rb/upm_me_ur_definitions_responds_to_how_middleclass/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bot, &lt;em&gt;bleep&lt;/em&gt;, &lt;em&gt;bloop&lt;/em&gt;. Someone has linked to this thread from another place on reddit:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;[&lt;a href=\"/r/goodlongposts\"&gt;/r/goodlongposts&lt;/a&gt;] &lt;a href=\"https://np.reddit.com/r/goodlongposts/comments/64y6rb/upm_me_ur_definitions_responds_to_how_middleclass/\"&gt;/u/PM_ME_UR_Definitions responds to: How Middle-Class America Got Fleeced [+35]&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;a href=\"#footer\"&gt;&lt;/a&gt;&lt;em&gt;&lt;sup&gt;If you follow any of the above links, please respect the rules of reddit and don&amp;#39;t vote in the other threads.&lt;/sup&gt; &lt;sup&gt;(&lt;a href=\"/r/TotesMessenger\"&gt;Info&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;/&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/message/compose?to=/r/TotesMessenger\"&gt;Contact&lt;/a&gt;)&lt;/sup&gt;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"#bot\"&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5vckc", "score_hidden": false, "stickied": false, "created": 1492033322.0, "created_utc": 1492004522.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vtyh", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "PM_ME_UR_Definitions", "parent_id": "t3_64t8a2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "How did we let ourselves get screwed over by deregulation?\n\nThis is an easy question to answer, it's because the 70% are mostly average americans and [what they want has almost no impact on the laws congress passes](http://pnhp.org/blog/2014/04/21/gilens-and-page-average-citizens-have-little-impact-on-public-policy/). The people who want to restrict municipal broadband are the CEOs and investors of big cable companies and those are the people that our congress represents.\n\nOf course that makes politicians look bad, but it also makes us look stupid because we're the ones who consistently reelect people who don't care what we want and often pass laws directly against our own best interests. Here's an easy test, think of the last few people you voted for in congress, and then think about this:\n\n* Most of us probably can't even remember who we voted for because most people just vote along party lines\n* Also, most of us don't vote most of the time. Turnout during presidential elections years is around 60% which is pretty bad, but during off year elections it's much lower and during primaries it's often in single digits.\n* Look up the person you voted for here: www.opensecrets.org then scroll down on their page to the section titled \"Source of Funds\" and look at the breakdown of Small Individual Contributions (average people), Large Individual Contributions (people who can afford to give $2,700 to multiple campaigns every year or two) and PAC Contributions (special interests and corporations). Most likely the donations from people like you and me are in the single digits, they essentially don't matter.\n\nThe only people giving any substantial money to congress are the very richest people in the country. [40% of all donations to candidates come from the 0.01% richest Americans](https://www.crowdpac.com/blog/the-1-percent-of-the-1-percent), that's the 1% of the 1%. Without that money most candidates couldn't afford to run a campaign, they couldn't hire staff or have rallies or buy commercials. Which means that most of us would've never heard of them because unless a politician is spending a lot of money to get their message out most people won't bother to spend 10 minutes doing research and find out who's running.\n\nAnd even when candidates do spend millions most people still don't vote and when they do vote, they just vote for whoever won their party's primary (which they didn't vote in).\n\nThe richest 1% of this country pays for our elections and they make sure that they're funding the candidates that are going to represent the issues that are important to them. The rest of us do nothing most of the time and hope that honest, hardworking and ethical candidates will somehow manage to get elected even though we ignore them during the entire campaign. I don't think [money buys elections](http://freakonomics.com/2012/01/12/does-money-really-buy-elections-a-new-marketplace-podcast/), but candidates need *some money to run. And if the only people getting enough to run are big business types, that's the only people we'll have to choose from when (if) we show up to vote. Money doesn't buy elections, it's a filter and right now it's keeping out most people.\n\nOne idea for fixing this is public funding of campaigns, but that would require congress to pass a law making it more difficult for them to get reelected by providing public funding to their opponents. It's [incredibly hard to get that kind of legislation passed in the current political climate.](http://www.nytimes.com/2003/06/21/us/massachusetts-legislature-repeals-clean-elections-law.html)\n\nWhich means that if we want politicians to represent us to get elected we can't wait around until a law gets passed forcing us to fund campaigns, we have to just start doing it. If most Americans gave a couple dollars a month on average to candidates running for congress, it would completely transform the political landscape and we'd likely end up with huge turnover in congress over a few election cycles. Most of us aren't rich, but there's a couple hundred million of us, and a few bucks each adds up to a huge amount of money. For the cost of a cup a coffee a month we could enable an entire new generation of politicians that actually want to represent the people who elected them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How did we let ourselves get screwed over by deregulation?&lt;/p&gt;\n\n&lt;p&gt;This is an easy question to answer, it&amp;#39;s because the 70% are mostly average americans and &lt;a href=\"http://pnhp.org/blog/2014/04/21/gilens-and-page-average-citizens-have-little-impact-on-public-policy/\"&gt;what they want has almost no impact on the laws congress passes&lt;/a&gt;. The people who want to restrict municipal broadband are the CEOs and investors of big cable companies and those are the people that our congress represents.&lt;/p&gt;\n\n&lt;p&gt;Of course that makes politicians look bad, but it also makes us look stupid because we&amp;#39;re the ones who consistently reelect people who don&amp;#39;t care what we want and often pass laws directly against our own best interests. Here&amp;#39;s an easy test, think of the last few people you voted for in congress, and then think about this:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Most of us probably can&amp;#39;t even remember who we voted for because most people just vote along party lines&lt;/li&gt;\n&lt;li&gt;Also, most of us don&amp;#39;t vote most of the time. Turnout during presidential elections years is around 60% which is pretty bad, but during off year elections it&amp;#39;s much lower and during primaries it&amp;#39;s often in single digits.&lt;/li&gt;\n&lt;li&gt;Look up the person you voted for here: &lt;a href=\"http://www.opensecrets.org\"&gt;www.opensecrets.org&lt;/a&gt; then scroll down on their page to the section titled &amp;quot;Source of Funds&amp;quot; and look at the breakdown of Small Individual Contributions (average people), Large Individual Contributions (people who can afford to give $2,700 to multiple campaigns every year or two) and PAC Contributions (special interests and corporations). Most likely the donations from people like you and me are in the single digits, they essentially don&amp;#39;t matter.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The only people giving any substantial money to congress are the very richest people in the country. &lt;a href=\"https://www.crowdpac.com/blog/the-1-percent-of-the-1-percent\"&gt;40% of all donations to candidates come from the 0.01% richest Americans&lt;/a&gt;, that&amp;#39;s the 1% of the 1%. Without that money most candidates couldn&amp;#39;t afford to run a campaign, they couldn&amp;#39;t hire staff or have rallies or buy commercials. Which means that most of us would&amp;#39;ve never heard of them because unless a politician is spending a lot of money to get their message out most people won&amp;#39;t bother to spend 10 minutes doing research and find out who&amp;#39;s running.&lt;/p&gt;\n\n&lt;p&gt;And even when candidates do spend millions most people still don&amp;#39;t vote and when they do vote, they just vote for whoever won their party&amp;#39;s primary (which they didn&amp;#39;t vote in).&lt;/p&gt;\n\n&lt;p&gt;The richest 1% of this country pays for our elections and they make sure that they&amp;#39;re funding the candidates that are going to represent the issues that are important to them. The rest of us do nothing most of the time and hope that honest, hardworking and ethical candidates will somehow manage to get elected even though we ignore them during the entire campaign. I don&amp;#39;t think &lt;a href=\"http://freakonomics.com/2012/01/12/does-money-really-buy-elections-a-new-marketplace-podcast/\"&gt;money buys elections&lt;/a&gt;, but candidates need *some money to run. And if the only people getting enough to run are big business types, that&amp;#39;s the only people we&amp;#39;ll have to choose from when (if) we show up to vote. Money doesn&amp;#39;t buy elections, it&amp;#39;s a filter and right now it&amp;#39;s keeping out most people.&lt;/p&gt;\n\n&lt;p&gt;One idea for fixing this is public funding of campaigns, but that would require congress to pass a law making it more difficult for them to get reelected by providing public funding to their opponents. It&amp;#39;s &lt;a href=\"http://www.nytimes.com/2003/06/21/us/massachusetts-legislature-repeals-clean-elections-law.html\"&gt;incredibly hard to get that kind of legislation passed in the current political climate.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Which means that if we want politicians to represent us to get elected we can&amp;#39;t wait around until a law gets passed forcing us to fund campaigns, we have to just start doing it. If most Americans gave a couple dollars a month on average to candidates running for congress, it would completely transform the political landscape and we&amp;#39;d likely end up with huge turnover in congress over a few election cycles. Most of us aren&amp;#39;t rich, but there&amp;#39;s a couple hundred million of us, and a few bucks each adds up to a huge amount of money. For the cost of a cup a coffee a month we could enable an entire new generation of politicians that actually want to represent the people who elected them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4vtyh", "score_hidden": false, "stickied": false, "created": 1491971905.0, "created_utc": 1491943105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg6icha", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lord_Void_of_Evil", "parent_id": "t1_dg5rqwi", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Definitely, I agree. I do recall the article mentioning how people have been led astray by false promises of high return on investment, so perhaps part of the lack of saving has to do with those false hopes in high returns. ( I'm not considering investment in the stock market to be savings, since there is a lot of risk involved. Though I suppose you could make the case for investing in stable indexes being sort of like saving.) Perhaps it could also be an issue with the public education system which does not place much emphasis on teaching personal finance skills, opening people up for making mistakes later in life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely, I agree. I do recall the article mentioning how people have been led astray by false promises of high return on investment, so perhaps part of the lack of saving has to do with those false hopes in high returns. ( I&amp;#39;m not considering investment in the stock market to be savings, since there is a lot of risk involved. Though I suppose you could make the case for investing in stable indexes being sort of like saving.) Perhaps it could also be an issue with the public education system which does not place much emphasis on teaching personal finance skills, opening people up for making mistakes later in life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6icha", "score_hidden": false, "stickied": false, "created": 1492057920.0, "created_utc": 1492029120.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rqwi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "El_Dudereno", "parent_id": "t1_dg5gddq", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "The chart in the article for savings rates is also very telling.  If they are millionaires in waiting, they certainly don't believe the way to achieve that is through saving.  They're living to the max of their means expecting some windfall that never comes.  So, it's not only apathy to public policy, but also personal financial decisions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The chart in the article for savings rates is also very telling.  If they are millionaires in waiting, they certainly don&amp;#39;t believe the way to achieve that is through saving.  They&amp;#39;re living to the max of their means expecting some windfall that never comes.  So, it&amp;#39;s not only apathy to public policy, but also personal financial decisions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5rqwi", "score_hidden": false, "stickied": false, "created": 1492027544.0, "created_utc": 1491998744.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg6nq7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lord_Void_of_Evil", "parent_id": "t1_dg6le07", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "There are certainly many different people with many different opinions and justifications for their viewpoints. \n\nI was not so much talking about entitlement programs, but rather social mobility and policies to prevent excessive wealth aggregation. Of course, there are many ways that things like this can be promoted and none of them are inherently wrong. I was not advocating any particular solutions. \n\nIf you think I am wrong, then what are your views? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are certainly many different people with many different opinions and justifications for their viewpoints. &lt;/p&gt;\n\n&lt;p&gt;I was not so much talking about entitlement programs, but rather social mobility and policies to prevent excessive wealth aggregation. Of course, there are many ways that things like this can be promoted and none of them are inherently wrong. I was not advocating any particular solutions. &lt;/p&gt;\n\n&lt;p&gt;If you think I am wrong, then what are your views? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6nq7i", "score_hidden": false, "stickied": false, "created": 1492064129.0, "created_utc": 1492035329.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6le07", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Law_of_Pizza", "parent_id": "t1_dg5gddq", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;I think the biggest problem with The United States is that most people view themselves as millionaires-in-waiting, and so they will support laws and systems that favor the rich. Many Americans have stopped actively working towards economic/social fairness because they look at everything from the perspective of the wealthy, and envision that they will soon be able to take advantage of those rules  themselves once they become rich. \n\nHow do you people come up with this stuff?\n\nWhat a steaming load.\n\nIs it really so hard for you to imagine that other people simply have different ideas about what is fundamentally fair? A poor person can believe that it's fundamentally wrong to vote themselves benefits at the expense of others - even if it would otherwise benefit them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think the biggest problem with The United States is that most people view themselves as millionaires-in-waiting, and so they will support laws and systems that favor the rich. Many Americans have stopped actively working towards economic/social fairness because they look at everything from the perspective of the wealthy, and envision that they will soon be able to take advantage of those rules  themselves once they become rich. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How do you people come up with this stuff?&lt;/p&gt;\n\n&lt;p&gt;What a steaming load.&lt;/p&gt;\n\n&lt;p&gt;Is it really so hard for you to imagine that other people simply have different ideas about what is fundamentally fair? A poor person can believe that it&amp;#39;s fundamentally wrong to vote themselves benefits at the expense of others - even if it would otherwise benefit them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6le07", "score_hidden": false, "stickied": false, "created": 1492061289.0, "created_utc": 1492032489.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gddq", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Lord_Void_of_Evil", "parent_id": "t3_64t8a2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think the biggest problem with The United States is that most people view themselves as millionaires-in-waiting, and so they will support laws and systems that favor the rich. Many Americans have stopped actively working towards economic/social fairness because they look at everything from the perspective of the wealthy, and envision that they will soon be able to take advantage of those rules  themselves once they become rich. \n\nI think this line is very telling: \"You can’t get back what you never really had.\" It seems to me that the Middle-Class suffers from an excess of optimism which allows people to manipulate them with false promises of a brighter future, guaranteed. This breeds a certain sort of passivity, which is deadly in a globalizing world that requires constant drive in order to stay competitive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the biggest problem with The United States is that most people view themselves as millionaires-in-waiting, and so they will support laws and systems that favor the rich. Many Americans have stopped actively working towards economic/social fairness because they look at everything from the perspective of the wealthy, and envision that they will soon be able to take advantage of those rules  themselves once they become rich. &lt;/p&gt;\n\n&lt;p&gt;I think this line is very telling: &amp;quot;You can’t get back what you never really had.&amp;quot; It seems to me that the Middle-Class suffers from an excess of optimism which allows people to manipulate them with false promises of a brighter future, guaranteed. This breeds a certain sort of passivity, which is deadly in a globalizing world that requires constant drive in order to stay competitive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5gddq", "score_hidden": false, "stickied": false, "created": 1491999179.0, "created_utc": 1491970379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg4taut", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "cincilator", "parent_id": "t3_64t8a2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "**Submission statement**\n\nNoah Smith on factors that impoverished the middle class in America. Part of his answer is that deregulation -- although improving efficiency somehow -- also enabled a lot of grift. Second part is that a lot of prosperity was an illusion as was shown in bubble bursts of 2000 and 2008.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Submission statement&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Noah Smith on factors that impoverished the middle class in America. Part of his answer is that deregulation -- although improving efficiency somehow -- also enabled a lot of grift. Second part is that a lot of prosperity was an illusion as was shown in bubble bursts of 2000 and 2008.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg4taut", "score_hidden": false, "stickied": false, "created": 1491969085.0, "created_utc": 1491940285.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg5tisj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sharpcowboy", "parent_id": "t3_64t8a2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "\" all across the U.S., pension funds are underfunded and will almost certainly have to default on some of their obligations to retirees.\n\nIt wasn’t supposed to turn out this way. Back in the 1980s and 1990s, middle-class Americans looked forward to a future of wealth and leisure. If you were a small business owner, or an engineer, or a lawyer at a small firm, you might not have expected to be rolling in it, but you probably didn’t think things would go so badly awry.\n\nWho’s responsible? Who took your prosperity? \"\n\n\"One partially correct answer is that your prosperity was taken by the very people who promised to ensure and enhance it. The decades from 1980 through 2008 were the age of neoliberalism -- the ideology of the free market. Financial deregulation, tax cuts and a lax attitude toward consumer protection and antitrust were supposed to free the entrepreneurial potential of the American middle class. And to some degree it did -- those decades saw plenty of wealth creation, and the U.S. economy performed a bit better than most rich nations in Europe and East Asia.\n\nBut along with real productivity, the neoliberal age saw plenty of grift and middle-class wealth extraction. In the book, “Phishing for Phools: The Economics of Manipulation and Deception,” Nobel prize-winning economists George Akerlof and Robert Shiller said that all free-market economies are accompanied by some amount of consumer error, simply because sellers are always exploring every possible method of parting people from their money.\n\nWriter Alex Pareene, in a recent article in Fusion, colorfully describes how vendors of all sorts cashed in on enthusiasm for conservative politicians:\n\n[The conservative era] was a fantastic deal for…companies selling newly patented drugs designed to treat the various conditions of old age, authors of dubious investing newsletters, sellers of survival seeds, hawkers of poorly written conservative books, and a whole array of similar con artists and ethically compromised corporations and financial institutions.\n\nBut Pareene’s focus on conservative political appeal is much too narrow. The white middle-class that tended to support leaders like Ronald Reagan, Newt Gingrich and George W. Bush, lost huge percentages of their life’s savings because of excessive fees paid to actively managed mutual funds, financial advisers, stockbrokers, pension fund managers and the like. They also paid 6 percent real estate commissions even as people in most countries paid much less. They rejected the Clintons’ health-care plan in 1993, and ended up paying double what people in other countries pay for comparable treatment. They forked over more and more money in college tuition. They paid higher prices to companies that went on to monopolize markets after spending millions convincing the government to allow their megamergers. The spectacular rise of U.S. wealth inequality shows that trillions of dollars in middle-class assets were shifted up the socio-economic ladder into the hands of a relatively small and fantastically rich upper tier.\n\nEach of these little free-market failures was another slice off of the ham that was the wealth of the American middle class. The people who thought they were going to be the guests of honor at the feast ended up being the main course.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot; all across the U.S., pension funds are underfunded and will almost certainly have to default on some of their obligations to retirees.&lt;/p&gt;\n\n&lt;p&gt;It wasn’t supposed to turn out this way. Back in the 1980s and 1990s, middle-class Americans looked forward to a future of wealth and leisure. If you were a small business owner, or an engineer, or a lawyer at a small firm, you might not have expected to be rolling in it, but you probably didn’t think things would go so badly awry.&lt;/p&gt;\n\n&lt;p&gt;Who’s responsible? Who took your prosperity? &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;One partially correct answer is that your prosperity was taken by the very people who promised to ensure and enhance it. The decades from 1980 through 2008 were the age of neoliberalism -- the ideology of the free market. Financial deregulation, tax cuts and a lax attitude toward consumer protection and antitrust were supposed to free the entrepreneurial potential of the American middle class. And to some degree it did -- those decades saw plenty of wealth creation, and the U.S. economy performed a bit better than most rich nations in Europe and East Asia.&lt;/p&gt;\n\n&lt;p&gt;But along with real productivity, the neoliberal age saw plenty of grift and middle-class wealth extraction. In the book, “Phishing for Phools: The Economics of Manipulation and Deception,” Nobel prize-winning economists George Akerlof and Robert Shiller said that all free-market economies are accompanied by some amount of consumer error, simply because sellers are always exploring every possible method of parting people from their money.&lt;/p&gt;\n\n&lt;p&gt;Writer Alex Pareene, in a recent article in Fusion, colorfully describes how vendors of all sorts cashed in on enthusiasm for conservative politicians:&lt;/p&gt;\n\n&lt;p&gt;[The conservative era] was a fantastic deal for…companies selling newly patented drugs designed to treat the various conditions of old age, authors of dubious investing newsletters, sellers of survival seeds, hawkers of poorly written conservative books, and a whole array of similar con artists and ethically compromised corporations and financial institutions.&lt;/p&gt;\n\n&lt;p&gt;But Pareene’s focus on conservative political appeal is much too narrow. The white middle-class that tended to support leaders like Ronald Reagan, Newt Gingrich and George W. Bush, lost huge percentages of their life’s savings because of excessive fees paid to actively managed mutual funds, financial advisers, stockbrokers, pension fund managers and the like. They also paid 6 percent real estate commissions even as people in most countries paid much less. They rejected the Clintons’ health-care plan in 1993, and ended up paying double what people in other countries pay for comparable treatment. They forked over more and more money in college tuition. They paid higher prices to companies that went on to monopolize markets after spending millions convincing the government to allow their megamergers. The spectacular rise of U.S. wealth inequality shows that trillions of dollars in middle-class assets were shifted up the socio-economic ladder into the hands of a relatively small and fantastically rich upper tier.&lt;/p&gt;\n\n&lt;p&gt;Each of these little free-market failures was another slice off of the ham that was the wealth of the American middle class. The people who thought they were going to be the guests of honor at the feast ended up being the main course.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5tisj", "score_hidden": false, "stickied": false, "created": 1492030648.0, "created_utc": 1492001848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg6529s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrSparks4", "parent_id": "t1_dg5gb6l", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;It's mainly middle-skill, most people are actually working with machine tools and so on and are classed as technicians, not labourers. \n\nIsn't that the same with most jobs? I worked at Walmart and they do have to train you to run their convoluted cashier system. Retail is much the  same where experience in retail will earn you a job much quicker then having never worked in retail. They try to have less turn over in retail because training takes too long to accomplish and is expensive to the companies that fire a lot.\n\nA paralegal or dental assistant is middle skilled. They have to go through education and a much longer on the job training then do guys who put bolts in. But those guys aren't technicians. Technicians required 1-2 years classes and or certification which takes an equally long time to do before on the job training. \n\nGuys just bolting things together have safety requirements which takes up way more time to do compared to retail, but is that really middle skilled?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s mainly middle-skill, most people are actually working with machine tools and so on and are classed as technicians, not labourers. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Isn&amp;#39;t that the same with most jobs? I worked at Walmart and they do have to train you to run their convoluted cashier system. Retail is much the  same where experience in retail will earn you a job much quicker then having never worked in retail. They try to have less turn over in retail because training takes too long to accomplish and is expensive to the companies that fire a lot.&lt;/p&gt;\n\n&lt;p&gt;A paralegal or dental assistant is middle skilled. They have to go through education and a much longer on the job training then do guys who put bolts in. But those guys aren&amp;#39;t technicians. Technicians required 1-2 years classes and or certification which takes an equally long time to do before on the job training. &lt;/p&gt;\n\n&lt;p&gt;Guys just bolting things together have safety requirements which takes up way more time to do compared to retail, but is that really middle skilled?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6529s", "score_hidden": false, "stickied": false, "created": 1492044331.0, "created_utc": 1492015531.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gb6l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "baazaa", "parent_id": "t1_dg5fr5k", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; What is the difference between putting a bolt in a hole on an assembly line for GM in 1970, and putting a box on a shelf for Walmart in 2017? \n\n Unskilled service sector jobs have always existed and always payed terribly. These jobs used to be done almost exclusively by blacks and women though. Now the two labour markets seem to have sort of merged in terms of wages and conditions, which is what one would have expected in the first place. I expect the gap largely existed in the first place due to unionisation, but racial and gender explanations are plausible as well. \n\nI will add a caveat here though, sure there's plenty of low-skilled jobs in manufacturing that pay more than other sectors, but manufacturing has always been much higher skill than many people perceive. It's mainly middle-skill, most people are actually working with machine tools and so on and are classed as  technicians, not labourers. The reason this confusion exists is because these manufacturing jobs took people fresh out of high-school, but they did do a lot of training and the skill-level of work involved was by-and-large greater than other industries who took uneducated workers. \n\nThis level of skill also meant manufacturing workers had more bargaining power, you couldn't replace a striking workforce because your average guy on the streets doesn't know how to operate a machine lathe or a welder. Even today, despite the big declines in manufacturing, there's a skill shortage in the industry. There's no Starbucks skills-shortage because it doesn't require any skills.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What is the difference between putting a bolt in a hole on an assembly line for GM in 1970, and putting a box on a shelf for Walmart in 2017? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Unskilled service sector jobs have always existed and always payed terribly. These jobs used to be done almost exclusively by blacks and women though. Now the two labour markets seem to have sort of merged in terms of wages and conditions, which is what one would have expected in the first place. I expect the gap largely existed in the first place due to unionisation, but racial and gender explanations are plausible as well. &lt;/p&gt;\n\n&lt;p&gt;I will add a caveat here though, sure there&amp;#39;s plenty of low-skilled jobs in manufacturing that pay more than other sectors, but manufacturing has always been much higher skill than many people perceive. It&amp;#39;s mainly middle-skill, most people are actually working with machine tools and so on and are classed as  technicians, not labourers. The reason this confusion exists is because these manufacturing jobs took people fresh out of high-school, but they did do a lot of training and the skill-level of work involved was by-and-large greater than other industries who took uneducated workers. &lt;/p&gt;\n\n&lt;p&gt;This level of skill also meant manufacturing workers had more bargaining power, you couldn&amp;#39;t replace a striking workforce because your average guy on the streets doesn&amp;#39;t know how to operate a machine lathe or a welder. Even today, despite the big declines in manufacturing, there&amp;#39;s a skill shortage in the industry. There&amp;#39;s no Starbucks skills-shortage because it doesn&amp;#39;t require any skills.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5gb6l", "score_hidden": false, "stickied": false, "created": 1491999077.0, "created_utc": 1491970277.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg61goj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dsylecxi", "parent_id": "t1_dg5fr5k", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; One of the largest factors is that low-skilled and unskilled labor jobs no longer pay middle-income wages. \n\nAnd they shouldn't pay middle-income wages. A low-skilled job pays a low-income wage, a middle-skilled job pays a middle-income wage. Those people who had low-skilled jobs and were paid a middle-income wage got lucky and should have invested their gains properly knowing the gravy train was not going to last forever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One of the largest factors is that low-skilled and unskilled labor jobs no longer pay middle-income wages. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And they shouldn&amp;#39;t pay middle-income wages. A low-skilled job pays a low-income wage, a middle-skilled job pays a middle-income wage. Those people who had low-skilled jobs and were paid a middle-income wage got lucky and should have invested their gains properly knowing the gravy train was not going to last forever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg61goj", "score_hidden": false, "stickied": false, "created": 1492040500.0, "created_utc": 1492011700.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fr5k", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "erikd313", "parent_id": "t1_dg56ugy", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "One of the largest factors is that low-skilled and unskilled labor jobs no longer pay middle-income wages. This has less to do with an elimination of the jobs, and more to do with the changing compensation for said jobs. \n\nAn unskilled assembly line job pays far less today than it did 40-50 years ago. And while there may be fewer manufacturing jobs today, there are more service sector jobs now than there were before. \n\nWhat is the difference between putting a bolt in a hole on an assembly line for GM in 1970, and putting a box on a shelf for Walmart in 2017? What is the difference between loading pallets full of electronics onto a truck for GE in 1965, and unloading pallets full of electronics off of a truck for Best Buy in 2017? \n\nThe skill levels required to do the jobs are pretty similar, but the compensation is far lower today. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the largest factors is that low-skilled and unskilled labor jobs no longer pay middle-income wages. This has less to do with an elimination of the jobs, and more to do with the changing compensation for said jobs. &lt;/p&gt;\n\n&lt;p&gt;An unskilled assembly line job pays far less today than it did 40-50 years ago. And while there may be fewer manufacturing jobs today, there are more service sector jobs now than there were before. &lt;/p&gt;\n\n&lt;p&gt;What is the difference between putting a bolt in a hole on an assembly line for GM in 1970, and putting a box on a shelf for Walmart in 2017? What is the difference between loading pallets full of electronics onto a truck for GE in 1965, and unloading pallets full of electronics off of a truck for Best Buy in 2017? &lt;/p&gt;\n\n&lt;p&gt;The skill levels required to do the jobs are pretty similar, but the compensation is far lower today. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5fr5k", "score_hidden": false, "stickied": false, "created": 1491998166.0, "created_utc": 1491969366.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64t8a2", "likes": null, "replies": "", "user_reports": [], "id": "dg5fhpc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "baazaa", "parent_id": "t1_dg5f78y", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "They did use to train people though, I'm asking what's *changed* in the labour market to cause the issues over the last 40 years or so. There's a lot of reasons here, from the fact that employers have adopted a very short-term mindset, to declining mean job tenure which means employers won't recoup training costs, to internet job boards that make HR think they can just recruit the perfect candidate rather than make them, to the fact that employers can rely on skilled migrants instead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They did use to train people though, I&amp;#39;m asking what&amp;#39;s &lt;em&gt;changed&lt;/em&gt; in the labour market to cause the issues over the last 40 years or so. There&amp;#39;s a lot of reasons here, from the fact that employers have adopted a very short-term mindset, to declining mean job tenure which means employers won&amp;#39;t recoup training costs, to internet job boards that make HR think they can just recruit the perfect candidate rather than make them, to the fact that employers can rely on skilled migrants instead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5fhpc", "score_hidden": false, "stickied": false, "created": 1491997746.0, "created_utc": 1491968946.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f78y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "iwannadieonearth", "parent_id": "t1_dg56ugy", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; if high-skill employers refuse to train and hire inexperienced people then invariably you're going to see that part of the workforce decline in number but see big wage rises, which is what we have seen.\n\nIn a global economy there's no incentive to do so. Why should employers care about hiring more workers and America in general when they can hire less workers, pay them more, and get the same results. It's an employer's market and as long as it stays that way there will be zero changes, there's no incentive for any of them to give a shit.\n\nI mean I see this as like when guys complain that they are expected to so all the work in approaching and courting women, always expected to put themselves out there and do the initiating instead of the other way around. Well that's never going to change because women aren't ever going to be in a position where they have to put themselves out there, there's no lack of men approaching them so why would they ever start approaching guys and taking a chance on them? There's no reason to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;if high-skill employers refuse to train and hire inexperienced people then invariably you&amp;#39;re going to see that part of the workforce decline in number but see big wage rises, which is what we have seen.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In a global economy there&amp;#39;s no incentive to do so. Why should employers care about hiring more workers and America in general when they can hire less workers, pay them more, and get the same results. It&amp;#39;s an employer&amp;#39;s market and as long as it stays that way there will be zero changes, there&amp;#39;s no incentive for any of them to give a shit.&lt;/p&gt;\n\n&lt;p&gt;I mean I see this as like when guys complain that they are expected to so all the work in approaching and courting women, always expected to put themselves out there and do the initiating instead of the other way around. Well that&amp;#39;s never going to change because women aren&amp;#39;t ever going to be in a position where they have to put themselves out there, there&amp;#39;s no lack of men approaching them so why would they ever start approaching guys and taking a chance on them? There&amp;#39;s no reason to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5f78y", "score_hidden": false, "stickied": false, "created": 1491997282.0, "created_utc": 1491968482.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56ugy", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "baazaa", "parent_id": "t3_64t8a2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Economists still looking at the trees and missing the forest. The middle-class is disappearing because middle-income jobs are disappearing, and it's not just due to the incomes of jobs changing, but the fact that the middle-skill jobs that were associated with said incomes have gone. \n\nThere's only really a few plausible explanations: China, automation, and/or some catastrophic failure in the education and labour markets. Although all three have probably contributed, I'm surprised more attention isn't directed at the last point, if high-skill employers refuse to train and hire inexperienced people then invariably you're going to see that part of the workforce decline in number but see big wage rises, which is what we have seen.\n\nOn the other-hand, it's very difficult to see deregulation or tax rates changing the skill composition of the labour market. These are easy targets because most people hate them and it means the economy isn't fundamentally broken, you just have to tinker with a few laws and everything would be good again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Economists still looking at the trees and missing the forest. The middle-class is disappearing because middle-income jobs are disappearing, and it&amp;#39;s not just due to the incomes of jobs changing, but the fact that the middle-skill jobs that were associated with said incomes have gone. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s only really a few plausible explanations: China, automation, and/or some catastrophic failure in the education and labour markets. Although all three have probably contributed, I&amp;#39;m surprised more attention isn&amp;#39;t directed at the last point, if high-skill employers refuse to train and hire inexperienced people then invariably you&amp;#39;re going to see that part of the workforce decline in number but see big wage rises, which is what we have seen.&lt;/p&gt;\n\n&lt;p&gt;On the other-hand, it&amp;#39;s very difficult to see deregulation or tax rates changing the skill composition of the labour market. These are easy targets because most people hate them and it means the economy isn&amp;#39;t fundamentally broken, you just have to tinker with a few laws and everything would be good again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg56ugy", "score_hidden": false, "stickied": false, "created": 1491985880.0, "created_utc": 1491957080.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}]