[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64xsbs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 479, "report_reasons": null, "author": "-Eochaidh-", "saved": false, "mod_reports": [], "name": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "approved_by": null, "over_18": false, "domain": "nybooks.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qyt6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/TrueReddit/comments/64xsbs/urfascism_by_umberto_eco/", "num_reports": null, "locked": false, "stickied": false, "created": 1492028418.0, "url": "http://www.nybooks.com/articles/1995/06/22/ur-fascism/", "author_flair_text": null, "quarantine": false, "title": "Ur-Fascism by Umberto Eco", "created_utc": 1491999618.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 116, "visited": false, "subreddit_type": "public", "ups": 479}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6rzgu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TeenageKevin", "parent_id": "t1_dg6on7m", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Great stuff thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great stuff thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6rzgu", "score_hidden": false, "stickied": false, "created": 1492069392.0, "created_utc": 1492040592.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6on7m", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6m3ij", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Regarding ancient traditions, no, I don't think that taking an interest in cultures is inherently fascistic or anything, but I think the problem is the treating these ancient traditions as holy or sacred. I'm from Ireland and my country has had a bit of an unusual relationship with culture, in that our leftist movement is nationalist, grew out of a cultural revival. \n\nPersonally I think there are things we can learn from the ancient culture of Ireland, for example I think there were some quite interesting progressive innovations in the [Brehon Law](https://en.wikipedia.org/wiki/Early_Irish_law) system. All of this was obliterated under English imperialism. I think the problem begins to appear when you have this conflation with taking an interest in and celebrating your culture and turning it into this object of fetish, of conflating it with the nation state, of seeing it as inherently superior rather than unique and so on.\n\nOne of the ways the left could combat the rise of the new right is by reclaiming it's ties to cultural revival. After all around the world many indigenous cultures, even European ones, have suffered in the wake of American cultural hegemony, capitalism and so on. The left has ties to indigenous rights movements, is anticapitalist, can embrace cultural revival without this aggressive, supremacist reification. In some ways some of the the far right is actually anti-culture in this respect as it creates a new identity, the White identity, which consumes all Europe and blots out our nations individual characteristics. \n\nI hope that was coherent enough and answered your question.\n\nAction, or [Praxis](https://en.wikipedia.org/wiki/Praxis_(process\\)) is absolutely necessary in my view, a society is constructed out of actions, and theory's role is to inform these. Too much theory and there is no relationship between an ideology and the world, too little theory and you are acting without considering anything which is in itself dangerous. I believe there is a balance between these two. I don't think devotion is inherently wrong, ones life is ones own to spend. Interestingly Nietzsche was critical of this idea of Slave Morality, that an individual gives himself over to his ideal and does not really flourish in his own right. This, I think, can be applied to Fascism itself. The hero cult, the brave individual totally subsumed into the ideology, the collective, the White Nation, these are all spooks and delusions that disempower individuals to live according to their own Will. I find the Nazi cooption of Nietzsche highly ironic.\n\nI think war absolutely brings out totalitarian traits in any society. It's difficult to avoid, even in Rojava with their commitment to egalitarian, quasi-anarchist society they have to conscript people into the militias at times. This is a shame and yet, without cohesion they could have been destroyed by Daesh. Sometimes there is a compromise made. But these compromises should be viewed as serious sacrifices not to be made lightly. Even in our own countries we enjoy relative freedom, but in the United States during wartime it was not considered inappropriate to send Japanese Americans to concentration camps. In the United Kingdom it was not considered inappropriate to suspend habeas corpus and intern thousands of Irish people during the Troubles. Other countries likely have similar stories. I believe if Rojava were at peace they would probably eliminate even these authoritarian aspects, but, given their geographic location I fear they will not be at peace any time soon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regarding ancient traditions, no, I don&amp;#39;t think that taking an interest in cultures is inherently fascistic or anything, but I think the problem is the treating these ancient traditions as holy or sacred. I&amp;#39;m from Ireland and my country has had a bit of an unusual relationship with culture, in that our leftist movement is nationalist, grew out of a cultural revival. &lt;/p&gt;\n\n&lt;p&gt;Personally I think there are things we can learn from the ancient culture of Ireland, for example I think there were some quite interesting progressive innovations in the &lt;a href=\"https://en.wikipedia.org/wiki/Early_Irish_law\"&gt;Brehon Law&lt;/a&gt; system. All of this was obliterated under English imperialism. I think the problem begins to appear when you have this conflation with taking an interest in and celebrating your culture and turning it into this object of fetish, of conflating it with the nation state, of seeing it as inherently superior rather than unique and so on.&lt;/p&gt;\n\n&lt;p&gt;One of the ways the left could combat the rise of the new right is by reclaiming it&amp;#39;s ties to cultural revival. After all around the world many indigenous cultures, even European ones, have suffered in the wake of American cultural hegemony, capitalism and so on. The left has ties to indigenous rights movements, is anticapitalist, can embrace cultural revival without this aggressive, supremacist reification. In some ways some of the the far right is actually anti-culture in this respect as it creates a new identity, the White identity, which consumes all Europe and blots out our nations individual characteristics. &lt;/p&gt;\n\n&lt;p&gt;I hope that was coherent enough and answered your question.&lt;/p&gt;\n\n&lt;p&gt;Action, or &lt;a href=\"https://en.wikipedia.org/wiki/Praxis_(process)\"&gt;Praxis&lt;/a&gt; is absolutely necessary in my view, a society is constructed out of actions, and theory&amp;#39;s role is to inform these. Too much theory and there is no relationship between an ideology and the world, too little theory and you are acting without considering anything which is in itself dangerous. I believe there is a balance between these two. I don&amp;#39;t think devotion is inherently wrong, ones life is ones own to spend. Interestingly Nietzsche was critical of this idea of Slave Morality, that an individual gives himself over to his ideal and does not really flourish in his own right. This, I think, can be applied to Fascism itself. The hero cult, the brave individual totally subsumed into the ideology, the collective, the White Nation, these are all spooks and delusions that disempower individuals to live according to their own Will. I find the Nazi cooption of Nietzsche highly ironic.&lt;/p&gt;\n\n&lt;p&gt;I think war absolutely brings out totalitarian traits in any society. It&amp;#39;s difficult to avoid, even in Rojava with their commitment to egalitarian, quasi-anarchist society they have to conscript people into the militias at times. This is a shame and yet, without cohesion they could have been destroyed by Daesh. Sometimes there is a compromise made. But these compromises should be viewed as serious sacrifices not to be made lightly. Even in our own countries we enjoy relative freedom, but in the United States during wartime it was not considered inappropriate to send Japanese Americans to concentration camps. In the United Kingdom it was not considered inappropriate to suspend habeas corpus and intern thousands of Irish people during the Troubles. Other countries likely have similar stories. I believe if Rojava were at peace they would probably eliminate even these authoritarian aspects, but, given their geographic location I fear they will not be at peace any time soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6on7m", "score_hidden": false, "stickied": false, "created": 1492065274.0, "created_utc": 1492036474.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m3ij", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TeenageKevin", "parent_id": "t1_dg5sqze", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I had a couple questions if you got the time since you seem pretty knowledgeable on the subject but, do you think that European cultures can find value in ancient traditions that reveal their ancestries relationships with the land without falling into fascism.\n\nDo you see  action, and life as a struggle be seen as valuable concepts or do you see them as inherently fascist, I personally feel that his criticism for these ideas comes out of, at least partially, the nazis appropriating Nietzsche's work.\n\nWhen you were describing how rojava fits into this list I think many of the ways it meets the criteria stem out of how rojava is in a period of war, and fascism being a political philosophy of never ending war it would make sense that nations at war would have fascist traits. I think you said something in this direction. Not really a question more just a statement.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a couple questions if you got the time since you seem pretty knowledgeable on the subject but, do you think that European cultures can find value in ancient traditions that reveal their ancestries relationships with the land without falling into fascism.&lt;/p&gt;\n\n&lt;p&gt;Do you see  action, and life as a struggle be seen as valuable concepts or do you see them as inherently fascist, I personally feel that his criticism for these ideas comes out of, at least partially, the nazis appropriating Nietzsche&amp;#39;s work.&lt;/p&gt;\n\n&lt;p&gt;When you were describing how rojava fits into this list I think many of the ways it meets the criteria stem out of how rojava is in a period of war, and fascism being a political philosophy of never ending war it would make sense that nations at war would have fascist traits. I think you said something in this direction. Not really a question more just a statement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6m3ij", "score_hidden": false, "stickied": false, "created": 1492062131.0, "created_utc": 1492033331.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg7vvgm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lemontreeee", "parent_id": "t1_dg7esk9", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Nope. I remember when the MRAs attempted to overthrow rape protection laws and legalize violence against women, when they were having rallies in defense of their male supremacist goals.  The MRAs DID serve as a precursor group to the rise of larger fascist networks, and much of the secretive, fascist-like organizing MRAs modeled helped build these undercurrent male supremacist movements. After their failing at a public movement, they built networks of infiltration and sabotage, just like any other fascist network. Many MRAs may seem relatively harmless, but the fact that they operate on that edge allows for an easy gateway to fascism - and many of their most vocal have been horrifying. Not to mention their secret communities. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope. I remember when the MRAs attempted to overthrow rape protection laws and legalize violence against women, when they were having rallies in defense of their male supremacist goals.  The MRAs DID serve as a precursor group to the rise of larger fascist networks, and much of the secretive, fascist-like organizing MRAs modeled helped build these undercurrent male supremacist movements. After their failing at a public movement, they built networks of infiltration and sabotage, just like any other fascist network. Many MRAs may seem relatively harmless, but the fact that they operate on that edge allows for an easy gateway to fascism - and many of their most vocal have been horrifying. Not to mention their secret communities. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7vvgm", "score_hidden": false, "stickied": false, "created": 1492132984.0, "created_utc": 1492104184.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7esk9", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Orphic_Thrench", "parent_id": "t1_dg6rn42", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "I'm no fan of MRAs, as they usually seem to be mainly concerned with attacking some strawman version of feminism, but I don't think that warrants being on that list...  Unless you mixed them up with Red Pillers maybe?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m no fan of MRAs, as they usually seem to be mainly concerned with attacking some strawman version of feminism, but I don&amp;#39;t think that warrants being on that list...  Unless you mixed them up with Red Pillers maybe?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7esk9", "score_hidden": false, "stickied": false, "created": 1492110842.0, "created_utc": 1492082042.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rn42", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "lemontreeee", "parent_id": "t1_dg6exif", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "This. I think we all need to come to terms with the fact that the fascists were a half-hibernating beast. They assimilated, worked on subtle campaigns of corporate, religious, ideological fascist side movements, and waited until the world's economy reached the conditions that it could reemerge. Dozens of fascist sects have been created and nurtured over the years, and the chaos of the Trump takeover is simply a balancing act of finalizing power. The monarchists, neo-reactionaries, Truthers, MRAs, KKK, dark enlightment, alt-right, neo-Nazis... all of these have been developing for decades. Now that the world is in a crisis of capitalism worse than the 20s... if not Trump, another dictator. Hence why we must do everything we can to educate others and organize against the coming horrors. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. I think we all need to come to terms with the fact that the fascists were a half-hibernating beast. They assimilated, worked on subtle campaigns of corporate, religious, ideological fascist side movements, and waited until the world&amp;#39;s economy reached the conditions that it could reemerge. Dozens of fascist sects have been created and nurtured over the years, and the chaos of the Trump takeover is simply a balancing act of finalizing power. The monarchists, neo-reactionaries, Truthers, MRAs, KKK, dark enlightment, alt-right, neo-Nazis... all of these have been developing for decades. Now that the world is in a crisis of capitalism worse than the 20s... if not Trump, another dictator. Hence why we must do everything we can to educate others and organize against the coming horrors. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6rn42", "score_hidden": false, "stickied": false, "created": 1492068973.0, "created_utc": 1492040173.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6u1q0", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Moocat87", "parent_id": "t1_dg6exif", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Mango Mussolini was convenient and speaks its language naturally. If it wouldn't have been him it would have been someone else eventually.\n\nNot trying to call you out, and I do think it's funny, but I also think the name-calling is detracting from your point... which I think is a good point that needs to be made and taken seriously.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Mango Mussolini was convenient and speaks its language naturally. If it wouldn&amp;#39;t have been him it would have been someone else eventually.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not trying to call you out, and I do think it&amp;#39;s funny, but I also think the name-calling is detracting from your point... which I think is a good point that needs to be made and taken seriously.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6u1q0", "score_hidden": false, "stickied": false, "created": 1492071956.0, "created_utc": 1492043156.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6exif", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "sbhikes", "parent_id": "t1_dg6e4bo", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Well, if it makes you feel any better, the fascism was already on its way. Mango Mussolini was convenient and speaks its language naturally. If it wouldn't have been him it would have been someone else eventually. The question now is can we fight it and win? Trump is sort of a comedy clown version of fascism and his administration is tainted with all this Russian stuff and criminal money laundering and whatnot. Perhaps he will fall because of that. Do we absolutely have to follow the same path out of fascism (human tragedy and war) that we saw in the 1930s? If Trump falls, will our victory fool us into complacency enough that a more competent and worse leader rises? What exactly does it take for Reason and Truth to triumph in such a situation?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, if it makes you feel any better, the fascism was already on its way. Mango Mussolini was convenient and speaks its language naturally. If it wouldn&amp;#39;t have been him it would have been someone else eventually. The question now is can we fight it and win? Trump is sort of a comedy clown version of fascism and his administration is tainted with all this Russian stuff and criminal money laundering and whatnot. Perhaps he will fall because of that. Do we absolutely have to follow the same path out of fascism (human tragedy and war) that we saw in the 1930s? If Trump falls, will our victory fool us into complacency enough that a more competent and worse leader rises? What exactly does it take for Reason and Truth to triumph in such a situation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6exif", "score_hidden": false, "stickied": false, "created": 1492054420.0, "created_utc": 1492025620.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg786kd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Aqarius90", "parent_id": "t1_dg71emn", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;For example, I can talk about individual liberties and constitutional rights all day long, and they nod in agreement as if I'm stating the obvious. But then they downplay the fact that civil asset forfeiture violates our rights. They say \"cops are good people they need all the tools they can get to fight those criminals.\"\n\n[I think this may be of interest to you.](http://home.cc.umanitoba.ca/%7Ealtemey/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For example, I can talk about individual liberties and constitutional rights all day long, and they nod in agreement as if I&amp;#39;m stating the obvious. But then they downplay the fact that civil asset forfeiture violates our rights. They say &amp;quot;cops are good people they need all the tools they can get to fight those criminals.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"http://home.cc.umanitoba.ca/%7Ealtemey/\"&gt;I think this may be of interest to you.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg786kd", "score_hidden": false, "stickied": false, "created": 1492092234.0, "created_utc": 1492063434.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg9tjle", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beerybeardybear", "parent_id": "t1_dg71emn", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Do your best to educate the children; the rest will never be fixed (or, rather, will be fixed with such a low probability that they'd be a waste of your time, as well as a waste of your air).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do your best to educate the children; the rest will never be fixed (or, rather, will be fixed with such a low probability that they&amp;#39;d be a waste of your time, as well as a waste of your air).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg9tjle", "score_hidden": false, "stickied": false, "created": 1492235859.0, "created_utc": 1492207059.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg79if2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Wisdom_Of_A_Man", "parent_id": "t1_dg75fmo", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Yeah. A lot. I had to stop because a few of them were just too infuriating. I'll regroup and reengage at some point - maybe- but for now I had to detach.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. A lot. I had to stop because a few of them were just too infuriating. I&amp;#39;ll regroup and reengage at some point - maybe- but for now I had to detach.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg79if2", "score_hidden": false, "stickied": false, "created": 1492095514.0, "created_utc": 1492066714.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75fmo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ashara_zavros", "parent_id": "t1_dg71emn", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; how do we convince trump sympathizers that the 'liberal boogeyman' that they believe in so fervently - was in fact a myth? \n\nHave you tried talking to them?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;how do we convince trump sympathizers that the &amp;#39;liberal boogeyman&amp;#39; that they believe in so fervently - was in fact a myth? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Have you tried talking to them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg75fmo", "score_hidden": false, "stickied": false, "created": 1492086974.0, "created_utc": 1492058174.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71emn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Wisdom_Of_A_Man", "parent_id": "t1_dg6qfbd", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I'm struggling with this question: how do we convince trump sympathizers that the 'liberal boogeyman' that they believe in so fervently - was in fact a myth? \n\nExposing the myth is what needs to happen to avert destructive chaos. I have 11 family members who all support trump - STILL- and I don't see them ever seeing their precious liberal conspiracy for what it is: an imaginary monster created by those they get their news from. \n\nI've read Lakoff and understand we need to craft arguments using our own values and language. But my family frustrates me to such a degree that it's hard to boil these values down to talking points that are received with fidelity. \n\nFor example, I can talk about individual liberties and constitutional rights all day long, and they nod in agreement as if I'm stating the obvious. But then they downplay the fact that civil asset forfeiture violates our rights. They say \"cops are good people they need all the tools they can get to fight those criminals.\"\n\nNot that I'm talking to any of them anymore. I'm too fucking angry that these formerly open minded ( or so I thought) people are drawn into this authoritarian fascist rhetoric. They're putting ideology above integrity and party above country. \n\nThe US can fall and another country rise in its place. But the damage this administration is poised to inflict upon our precious earth is unforgivable. \n\nYeah - how do we slay that imaginary monster these people believe in? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m struggling with this question: how do we convince trump sympathizers that the &amp;#39;liberal boogeyman&amp;#39; that they believe in so fervently - was in fact a myth? &lt;/p&gt;\n\n&lt;p&gt;Exposing the myth is what needs to happen to avert destructive chaos. I have 11 family members who all support trump - STILL- and I don&amp;#39;t see them ever seeing their precious liberal conspiracy for what it is: an imaginary monster created by those they get their news from. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read Lakoff and understand we need to craft arguments using our own values and language. But my family frustrates me to such a degree that it&amp;#39;s hard to boil these values down to talking points that are received with fidelity. &lt;/p&gt;\n\n&lt;p&gt;For example, I can talk about individual liberties and constitutional rights all day long, and they nod in agreement as if I&amp;#39;m stating the obvious. But then they downplay the fact that civil asset forfeiture violates our rights. They say &amp;quot;cops are good people they need all the tools they can get to fight those criminals.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Not that I&amp;#39;m talking to any of them anymore. I&amp;#39;m too fucking angry that these formerly open minded ( or so I thought) people are drawn into this authoritarian fascist rhetoric. They&amp;#39;re putting ideology above integrity and party above country. &lt;/p&gt;\n\n&lt;p&gt;The US can fall and another country rise in its place. But the damage this administration is poised to inflict upon our precious earth is unforgivable. &lt;/p&gt;\n\n&lt;p&gt;Yeah - how do we slay that imaginary monster these people believe in? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg71emn", "score_hidden": false, "stickied": false, "created": 1492081058.0, "created_utc": 1492052258.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qfbd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ashara_zavros", "parent_id": "t1_dg6e4bo", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;I'm also a bit afraid that fascism in America is going to be a self-fulfilling prophecy\n\nThat's as much a function of the current weakness and fecklessness of progressive opposition to fascism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m also a bit afraid that fascism in America is going to be a self-fulfilling prophecy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s as much a function of the current weakness and fecklessness of progressive opposition to fascism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qfbd", "score_hidden": false, "stickied": false, "created": 1492067480.0, "created_utc": 1492038680.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e4bo", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "iwannadieonearth", "parent_id": "t1_dg652gf", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I'm slightly conflicted, because we can't shy away from calling a spade a spade, but I'm also a bit afraid that fascism in America is going to be a self-fulfilling prophecy, that people are going to just assume it's here and there's no stopping it since they're being told America is fascist for electing Trump or any variation of that argument.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m slightly conflicted, because we can&amp;#39;t shy away from calling a spade a spade, but I&amp;#39;m also a bit afraid that fascism in America is going to be a self-fulfilling prophecy, that people are going to just assume it&amp;#39;s here and there&amp;#39;s no stopping it since they&amp;#39;re being told America is fascist for electing Trump or any variation of that argument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6e4bo", "score_hidden": false, "stickied": false, "created": 1492053584.0, "created_utc": 1492024784.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6dph4", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "skilless", "parent_id": "t1_dg6a9h8", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Trump barely won and his actions sow discord, not unity\n\nTechnically Hitler didn't even win the last election before he came to power :P ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Trump barely won and his actions sow discord, not unity&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Technically Hitler didn&amp;#39;t even win the last election before he came to power :P &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6dph4", "score_hidden": false, "stickied": false, "created": 1492053160.0, "created_utc": 1492024360.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6fin1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6essf", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Don't be sorry! I just wanted to point that distinction out, you didn't do anything wrong though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be sorry! I just wanted to point that distinction out, you didn&amp;#39;t do anything wrong though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6fin1", "score_hidden": false, "stickied": false, "created": 1492055023.0, "created_utc": 1492026223.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6essf", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg6e7mx", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Yea I'm not attacking anarchism as a political movement. I meant it in the general sense like you said. Sorry.", "edited": 1492030677.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea I&amp;#39;m not attacking anarchism as a political movement. I meant it in the general sense like you said. Sorry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6essf", "score_hidden": false, "stickied": false, "created": 1492054290.0, "created_utc": 1492025490.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e7mx", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6a9h8", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Sorry, I don't mean to derail what you're saying but I'd like to point out the difference between chaos, as in the complete absence of any regulation on behaviour which I think you are describing here, and [anarchy](https://en.wikipedia.org/wiki/Anarchy) or [anarchism](https://en.wikipedia.org/wiki/Anarchism) which has a concept of self-governance by communities, so it is theoretically not the same as chaos, just the absence of a state.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, I don&amp;#39;t mean to derail what you&amp;#39;re saying but I&amp;#39;d like to point out the difference between chaos, as in the complete absence of any regulation on behaviour which I think you are describing here, and &lt;a href=\"https://en.wikipedia.org/wiki/Anarchy\"&gt;anarchy&lt;/a&gt; or &lt;a href=\"https://en.wikipedia.org/wiki/Anarchism\"&gt;anarchism&lt;/a&gt; which has a concept of self-governance by communities, so it is theoretically not the same as chaos, just the absence of a state.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6e7mx", "score_hidden": false, "stickied": false, "created": 1492053682.0, "created_utc": 1492024882.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg7s473", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg7rhnx", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "please tell us more about your experience as an activist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;please tell us more about your experience as an activist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7s473", "score_hidden": false, "stickied": false, "created": 1492128984.0, "created_utc": 1492100184.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7rhnx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "heavenlytoaster", "parent_id": "t1_dg6u0h1", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Love never comes from activism", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Love never comes from activism&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7rhnx", "score_hidden": false, "stickied": false, "created": 1492128322.0, "created_utc": 1492099522.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6u0h1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg6szpk", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I doubt I can offer much consolation, it's a dangerous road we're headed down and I don't blame you for feeling that way. If I choose to put my faith in people, it's only because their capacity to love has always surprised me, despite everything that's wrong and all the horror that humanity has witnessed, we can still find love and compassion in every part of the world. I have faith that we will continue to do so. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I doubt I can offer much consolation, it&amp;#39;s a dangerous road we&amp;#39;re headed down and I don&amp;#39;t blame you for feeling that way. If I choose to put my faith in people, it&amp;#39;s only because their capacity to love has always surprised me, despite everything that&amp;#39;s wrong and all the horror that humanity has witnessed, we can still find love and compassion in every part of the world. I have faith that we will continue to do so. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6u0h1", "score_hidden": false, "stickied": false, "created": 1492071914.0, "created_utc": 1492043114.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6szpk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lemontreeee", "parent_id": "t1_dg6sjup", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Oh yeah, I feel you there. I worry that the amount people are paying attention isn't enough. Looking at fascist and totalitarian assumptions of power from Germnay to Iran to Syria to Mexico to Columbia to... etc, the more I study, the more I see that resistance is defeated via fear, violence, and power - and won via power and violence. I believe fascism will fall, but it's hard to see how it would play out. I am currently hoping our judicial branch combined with constant resistance will slow this ship down, but history is telling. Lawlessness would possibly be the BEST case scenario cuz then people could defend themselves and rebuild community rather than taking on the coming genocide, private prisons, corporate warfare, climate catastrophe, gender war... Keeping me up at night tbh. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yeah, I feel you there. I worry that the amount people are paying attention isn&amp;#39;t enough. Looking at fascist and totalitarian assumptions of power from Germnay to Iran to Syria to Mexico to Columbia to... etc, the more I study, the more I see that resistance is defeated via fear, violence, and power - and won via power and violence. I believe fascism will fall, but it&amp;#39;s hard to see how it would play out. I am currently hoping our judicial branch combined with constant resistance will slow this ship down, but history is telling. Lawlessness would possibly be the BEST case scenario cuz then people could defend themselves and rebuild community rather than taking on the coming genocide, private prisons, corporate warfare, climate catastrophe, gender war... Keeping me up at night tbh. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6szpk", "score_hidden": false, "stickied": false, "created": 1492070651.0, "created_utc": 1492041851.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg9tl2z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beerybeardybear", "parent_id": "t1_dg6sjup", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; The women's march filled me with hope.\n\nMost of them just went home after.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The women&amp;#39;s march filled me with hope.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Most of them just went home after.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg9tl2z", "score_hidden": false, "stickied": false, "created": 1492235913.0, "created_utc": 1492207113.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6sjup", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg6s0vn", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I agree not to underestimate a fascist rise. But I think that's what we're seeing: a huge movement taking this seriously. The women's march filled me with hope. It's was a tremendous show of organized resistance. And yea, I misspoke. Civil war is too strong, more just factional warfare, continuous riots, lawlessness as the establishment loses authenticity. A general breakdown of order and the ability to communicate. I agree that fascism is serious threat and could do some real damage, I just choose to remain optimistic after seeing so many people rise up in response. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree not to underestimate a fascist rise. But I think that&amp;#39;s what we&amp;#39;re seeing: a huge movement taking this seriously. The women&amp;#39;s march filled me with hope. It&amp;#39;s was a tremendous show of organized resistance. And yea, I misspoke. Civil war is too strong, more just factional warfare, continuous riots, lawlessness as the establishment loses authenticity. A general breakdown of order and the ability to communicate. I agree that fascism is serious threat and could do some real damage, I just choose to remain optimistic after seeing so many people rise up in response. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6sjup", "score_hidden": false, "stickied": false, "created": 1492070094.0, "created_utc": 1492041294.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6s0vn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "lemontreeee", "parent_id": "t1_dg6a9h8", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Power can defeat diversity. Pre-Nazi Germany was one of the most progressive, diverse European states of its time, with a slant towards socialism, LGBT rights, women's rights, a huge leftist movement... And yet they solidified power, rounded up all of that diversity, and murdered them. The fascists have no moral code - and WOULD ABSOLUTELY imprison or kill any one of us here for our dissent, let alone our race, gender, sexuality, or ability. We have to be careful not to underestimate them. With the military so nationalistic culturally (and racist, anti-gay, etc),  it's difficult to imagine civil war. But national uprising and resistance? Maybe. \n\nI also wonder if the climate crisis will hit so bad that US fascism can barely handle it since they base their power on oil money.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Power can defeat diversity. Pre-Nazi Germany was one of the most progressive, diverse European states of its time, with a slant towards socialism, LGBT rights, women&amp;#39;s rights, a huge leftist movement... And yet they solidified power, rounded up all of that diversity, and murdered them. The fascists have no moral code - and WOULD ABSOLUTELY imprison or kill any one of us here for our dissent, let alone our race, gender, sexuality, or ability. We have to be careful not to underestimate them. With the military so nationalistic culturally (and racist, anti-gay, etc),  it&amp;#39;s difficult to imagine civil war. But national uprising and resistance? Maybe. &lt;/p&gt;\n\n&lt;p&gt;I also wonder if the climate crisis will hit so bad that US fascism can barely handle it since they base their power on oil money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6s0vn", "score_hidden": false, "stickied": false, "created": 1492069440.0, "created_utc": 1492040640.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6c9yp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sbhikes", "parent_id": "t1_dg6a9h8", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Why not both? It would be Civil War among the proles, and this might satisfy #11 on the list: \"A hero cult where everyone is educated to become a hero, with emphasis on heroic death.\" There are already elements of this that can be seen (maybe not the death part, but the heroic part) on both sides of the aisle. The progressives are on a mission to save Democracy. The anti-progressives are on a mission to destroy the Left.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why not both? It would be Civil War among the proles, and this might satisfy #11 on the list: &amp;quot;A hero cult where everyone is educated to become a hero, with emphasis on heroic death.&amp;quot; There are already elements of this that can be seen (maybe not the death part, but the heroic part) on both sides of the aisle. The progressives are on a mission to save Democracy. The anti-progressives are on a mission to destroy the Left.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6c9yp", "score_hidden": false, "stickied": false, "created": 1492051668.0, "created_utc": 1492022868.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a9h8", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg652gf", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I'm more concerned about a civil war and a emerging anarchy than a take over of fascism. There's too much resistance and too much diversity for America to easily succumb to a total fascism. Trump barely won and his actions sow discord, not unity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m more concerned about a civil war and a emerging anarchy than a take over of fascism. There&amp;#39;s too much resistance and too much diversity for America to easily succumb to a total fascism. Trump barely won and his actions sow discord, not unity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6a9h8", "score_hidden": false, "stickied": false, "created": 1492049613.0, "created_utc": 1492020813.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg652gf", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "sbhikes", "parent_id": "t1_dg5sqze", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "This article was uncanny in describing what is happening. I wonder how this will end? Will we nip it in the bud? Has any proto-fascist regime ever been nipped in the bud? If we succumb, will we ever emerge from it? Is this a 100 year cycle that will repeat over and over? If it can't be nipped, I guess I will die under a fascist regime since it will likely take more decades to emerge from it than I have left in my life.\n\nI have often had premonitions about my life that have come true. One of them has been a pretty strong feeling that I will end up a bag lady living under a bridge. This is looking to be a greater possibility as the current fascist regime coming into place, or at least the Republican regime currently in place, has been creaming their jeans over eliminating all social programs for old people. If they also crater the stock market (or at least hinder my ability to rely on my 401k either by cratering the market or by making the rest of life so expensive that it will never suffice), I will indeed end up on the streets in my old age, which is only 15-20 years away. :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This article was uncanny in describing what is happening. I wonder how this will end? Will we nip it in the bud? Has any proto-fascist regime ever been nipped in the bud? If we succumb, will we ever emerge from it? Is this a 100 year cycle that will repeat over and over? If it can&amp;#39;t be nipped, I guess I will die under a fascist regime since it will likely take more decades to emerge from it than I have left in my life.&lt;/p&gt;\n\n&lt;p&gt;I have often had premonitions about my life that have come true. One of them has been a pretty strong feeling that I will end up a bag lady living under a bridge. This is looking to be a greater possibility as the current fascist regime coming into place, or at least the Republican regime currently in place, has been creaming their jeans over eliminating all social programs for old people. If they also crater the stock market (or at least hinder my ability to rely on my 401k either by cratering the market or by making the rest of life so expensive that it will never suffice), I will indeed end up on the streets in my old age, which is only 15-20 years away. :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg652gf", "score_hidden": false, "stickied": false, "created": 1492044337.0, "created_utc": 1492015537.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg7mdlk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Anon125", "parent_id": "t1_dg7it95", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Very insightful, thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very insightful, thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7mdlk", "score_hidden": false, "stickied": false, "created": 1492122721.0, "created_utc": 1492093921.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7it95", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6yzlb", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think Turkey is in serious danger of becoming a neo-fascist state, they have two powerful right wing factions (Islamists typified by Erdogan, and the nationalist groups who at their most extreme are exemplified by the [Grey Wolves](https://en.wikipedia.org/wiki/Grey_Wolves_(organization\\)), the [Deep State](https://en.wikipedia.org/wiki/Deep_state_in_Turkey) and others, and no serious left. It's pretty troubling, especially for marginalised groups like the Kurds within the country. The government has already taken to blaming the Kurds for attacks without any proof etcetera, it's scary. Then again the Kurds are pretty well armed and not afraid to fight.\n\nI don't know much about the Philiphines, if I'm totally honest, but I'm extremely concerned by their use of death squads and state sanctioning of murder for drug users. \n\nRussia is complex. The ruling ideology is probably best described as a [mafia state](https://en.wikipedia.org/wiki/Mafia_state#Russia). I don't think they have the strong ideological base to their ideas, other than that they want to expand their power by any means possible. The growth of movements like the [Nazbols](https://en.wikipedia.org/wiki/National_Bolshevism) and the ideas of [Aleksandr Dugin](https://en.wikipedia.org/wiki/Aleksandr_Dugin) are very concerning but it's debatable how much influence he really has over the government. I don't think Putin et al. take anticapitalism very seriously at least. I don't think they've advanced to the point of fascism but they are certainly right wing authoritarians, and Russia is probably not going to have any democratic political change while the current administration had power\n\nEconomic planning by the state is a part of fascism for sure but I think for most fascist movements, the anticapitalist, command economy, [yellow socialist](https://en.wikipedia.org/wiki/Yellow_socialism) stuff can often be watered down. Franco's pro-capitalist influence in the Falangist movement, Nazi cooperation with big corporations like Siemens and other such things I think adds weight to this idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Turkey is in serious danger of becoming a neo-fascist state, they have two powerful right wing factions (Islamists typified by Erdogan, and the nationalist groups who at their most extreme are exemplified by the &lt;a href=\"https://en.wikipedia.org/wiki/Grey_Wolves_(organization)\"&gt;Grey Wolves&lt;/a&gt;, the &lt;a href=\"https://en.wikipedia.org/wiki/Deep_state_in_Turkey\"&gt;Deep State&lt;/a&gt; and others, and no serious left. It&amp;#39;s pretty troubling, especially for marginalised groups like the Kurds within the country. The government has already taken to blaming the Kurds for attacks without any proof etcetera, it&amp;#39;s scary. Then again the Kurds are pretty well armed and not afraid to fight.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know much about the Philiphines, if I&amp;#39;m totally honest, but I&amp;#39;m extremely concerned by their use of death squads and state sanctioning of murder for drug users. &lt;/p&gt;\n\n&lt;p&gt;Russia is complex. The ruling ideology is probably best described as a &lt;a href=\"https://en.wikipedia.org/wiki/Mafia_state#Russia\"&gt;mafia state&lt;/a&gt;. I don&amp;#39;t think they have the strong ideological base to their ideas, other than that they want to expand their power by any means possible. The growth of movements like the &lt;a href=\"https://en.wikipedia.org/wiki/National_Bolshevism\"&gt;Nazbols&lt;/a&gt; and the ideas of &lt;a href=\"https://en.wikipedia.org/wiki/Aleksandr_Dugin\"&gt;Aleksandr Dugin&lt;/a&gt; are very concerning but it&amp;#39;s debatable how much influence he really has over the government. I don&amp;#39;t think Putin et al. take anticapitalism very seriously at least. I don&amp;#39;t think they&amp;#39;ve advanced to the point of fascism but they are certainly right wing authoritarians, and Russia is probably not going to have any democratic political change while the current administration had power&lt;/p&gt;\n\n&lt;p&gt;Economic planning by the state is a part of fascism for sure but I think for most fascist movements, the anticapitalist, command economy, &lt;a href=\"https://en.wikipedia.org/wiki/Yellow_socialism\"&gt;yellow socialist&lt;/a&gt; stuff can often be watered down. Franco&amp;#39;s pro-capitalist influence in the Falangist movement, Nazi cooperation with big corporations like Siemens and other such things I think adds weight to this idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7it95", "score_hidden": false, "stickied": false, "created": 1492118164.0, "created_utc": 1492089364.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yzlb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Anon125", "parent_id": "t1_dg5sqze", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "It's a nice comprehensive list, and seems intuitively right, but I'm not knowledgeable enough on the subject to know whether it's actually a good fascism-checklist. To that end, I'd like to veer away from the discussion about the US, like the rest of the discussion, and ask how the list applies to other countries. I'm especially thinking about Turkey, Russia, and the Philippines.\n\nIf those countries all pass a substantial amount of checks, are they all fascist? Or does the list describe general authoritarianism? I do not see economic planning by the state in the list, while that is a major part of fascism.\n\nStill, wikipedia describes fascism as \"authoritarian nationalism\", so I imagine there is a lot of gray area to begin with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a nice comprehensive list, and seems intuitively right, but I&amp;#39;m not knowledgeable enough on the subject to know whether it&amp;#39;s actually a good fascism-checklist. To that end, I&amp;#39;d like to veer away from the discussion about the US, like the rest of the discussion, and ask how the list applies to other countries. I&amp;#39;m especially thinking about Turkey, Russia, and the Philippines.&lt;/p&gt;\n\n&lt;p&gt;If those countries all pass a substantial amount of checks, are they all fascist? Or does the list describe general authoritarianism? I do not see economic planning by the state in the list, while that is a major part of fascism.&lt;/p&gt;\n\n&lt;p&gt;Still, wikipedia describes fascism as &amp;quot;authoritarian nationalism&amp;quot;, so I imagine there is a lot of gray area to begin with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6yzlb", "score_hidden": false, "stickied": false, "created": 1492077994.0, "created_utc": 1492049194.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg74yij", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Allways_Wrong", "parent_id": "t1_dg736lu", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "The U.S.S.R.\n\nThat's a blunt, almost smart-arse answer but it's actually an example of good, leftist intentions gone astray. I hope the parallels to some of the above list are obvious.\n\nMy general argument, or question really, being \"are aspects of fascism innate in all of us?\" It seems almost a built-in defensive mechanism, a paranoia of sorts meant to protect. When it becomes a collective consciousness it becomes what we call fascism. Or so it goes.\n\nJust asking. I've no attachment to the question really. ", "edited": 1492057786.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The U.S.S.R.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a blunt, almost smart-arse answer but it&amp;#39;s actually an example of good, leftist intentions gone astray. I hope the parallels to some of the above list are obvious.&lt;/p&gt;\n\n&lt;p&gt;My general argument, or question really, being &amp;quot;are aspects of fascism innate in all of us?&amp;quot; It seems almost a built-in defensive mechanism, a paranoia of sorts meant to protect. When it becomes a collective consciousness it becomes what we call fascism. Or so it goes.&lt;/p&gt;\n\n&lt;p&gt;Just asking. I&amp;#39;ve no attachment to the question really. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg74yij", "score_hidden": false, "stickied": false, "created": 1492086200.0, "created_utc": 1492057400.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg736lu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wisdom_Of_A_Man", "parent_id": "t1_dg6sdjd", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "What are some examples of the far left resembling the far right - examples you've witnessed yourself and not manufactured outrages such as the 'war on Christmas'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are some examples of the far left resembling the far right - examples you&amp;#39;ve witnessed yourself and not manufactured outrages such as the &amp;#39;war on Christmas&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg736lu", "score_hidden": false, "stickied": false, "created": 1492083525.0, "created_utc": 1492054725.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg8bwgv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6sdjd", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;Hey, do you think fascism is perhaps an innate quality in all of us\n\nHard to tell. I don't know about fascism, but I do think that some of the things that fuel our ability to take on certain dangerous mindsets are fairly ubiquitous. Fear of others, fear of an outgroup for example. These are the kind of questions anthropology can hopefully tell us more about as it's hard to figure out what the 'natural' state of humanity was before the formation of nations, states, economies, industrialisation and so on.\n\n[Quote from Emma Goldman about human nature.](https://www.goodreads.com/quotes/146888-but-what-about-human-nature-can-it-be-changed-and)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Hey, do you think fascism is perhaps an innate quality in all of us&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hard to tell. I don&amp;#39;t know about fascism, but I do think that some of the things that fuel our ability to take on certain dangerous mindsets are fairly ubiquitous. Fear of others, fear of an outgroup for example. These are the kind of questions anthropology can hopefully tell us more about as it&amp;#39;s hard to figure out what the &amp;#39;natural&amp;#39; state of humanity was before the formation of nations, states, economies, industrialisation and so on.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.goodreads.com/quotes/146888-but-what-about-human-nature-can-it-be-changed-and\"&gt;Quote from Emma Goldman about human nature.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg8bwgv", "score_hidden": false, "stickied": false, "created": 1492151037.0, "created_utc": 1492122237.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6sdjd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Allways_Wrong", "parent_id": "t1_dg6co95", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;  Even when someone is very racist or something like that you can even learn things about why they've come to think this way which can better inform your attitudes towards racism.\n\nAbsolutely. If one demands that a racist try and understand other people's plights, and the events beyond their control that brought them there, so that they can have empathy and/or even compassion for them thus ending or reducing their racism, surely we must do the same for racists ourselves? There's no difference; they are like that because of circumstances beyond their control too.\n\nNice commenting by the way. I'll even overlook an \"it's\" and a \"want's\". ; )\n\nHey, do you think fascism is perhaps an innate quality in all of us? Reading through your list I couldn't help but recognise a few of those qualities in myself. And sometimes, often even, the far left will resemble the far right. It is almost as if fascism is a movement borne from some kind of \"protection function\" inherent in all of us. ", "edited": 1492042250.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Even when someone is very racist or something like that you can even learn things about why they&amp;#39;ve come to think this way which can better inform your attitudes towards racism.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely. If one demands that a racist try and understand other people&amp;#39;s plights, and the events beyond their control that brought them there, so that they can have empathy and/or even compassion for them thus ending or reducing their racism, surely we must do the same for racists ourselves? There&amp;#39;s no difference; they are like that because of circumstances beyond their control too.&lt;/p&gt;\n\n&lt;p&gt;Nice commenting by the way. I&amp;#39;ll even overlook an &amp;quot;it&amp;#39;s&amp;quot; and a &amp;quot;want&amp;#39;s&amp;quot;. ; )&lt;/p&gt;\n\n&lt;p&gt;Hey, do you think fascism is perhaps an innate quality in all of us? Reading through your list I couldn&amp;#39;t help but recognise a few of those qualities in myself. And sometimes, often even, the far left will resemble the far right. It is almost as if fascism is a movement borne from some kind of &amp;quot;protection function&amp;quot; inherent in all of us. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6sdjd", "score_hidden": false, "stickied": false, "created": 1492069876.0, "created_utc": 1492041076.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6co95", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6c5xw", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Well, you know, when you're commenting (depends how far along a thread you are) there are also often other people there who might be interested too, so it's not always a waste of time. Plus it is genuinely worthwhile to engage with people with different views sometimes, I've had surprising interactions before by giving people the time of day who I could have ignored or shouted at. Even when someone is very racist or something like that you can even learn things about why they've come to think this way which can better inform your attitudes towards racism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, you know, when you&amp;#39;re commenting (depends how far along a thread you are) there are also often other people there who might be interested too, so it&amp;#39;s not always a waste of time. Plus it is genuinely worthwhile to engage with people with different views sometimes, I&amp;#39;ve had surprising interactions before by giving people the time of day who I could have ignored or shouted at. Even when someone is very racist or something like that you can even learn things about why they&amp;#39;ve come to think this way which can better inform your attitudes towards racism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6co95", "score_hidden": false, "stickied": false, "created": 1492052084.0, "created_utc": 1492023284.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6c5xw", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "gallowstree", "parent_id": "t1_dg6bz5i", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I admire your attempt to give a thorough and good faith reading of that horrifying comment, but I don't think you're going to get much out of this conversation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I admire your attempt to give a thorough and good faith reading of that horrifying comment, but I don&amp;#39;t think you&amp;#39;re going to get much out of this conversation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6c5xw", "score_hidden": false, "stickied": false, "created": 1492051553.0, "created_utc": 1492022753.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6gb4f", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6fndr", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I agree with you and I think that we should do more study on these things, and there are issues of bias against these types of studies being done.\n\nWith that being said, it works both ways. With the issue being avoided we don't have a wealth of good evidence to make the opposite claim either.\n\nAs for point two, it's difficult to make this type of comparison because, say with skin colour, the number of genetic changes that have been observed to make this change are well known and observable, not that large, we can visually measure the phenotype quite well without a lot of confounding factors. Intelligence isn't that simple, we haven't identified genes that are strongly correlated with intelligence differences between populations (check out [this paper](http://people.virginia.edu/~ent3c/papers2/nisbett2012int.pdf) I linked in another comment). When it comes to genetic diversity the human species is actually [quite homogenous](https://en.wikipedia.org/wiki/Human_genetic_variation) due to genetic bottlenecks in our evolution. Note: there are other sources of difference than just straight genomic similarity, so that's something to consider.\n\nThere's actually a [wikipedia page](https://en.wikipedia.org/wiki/Ashkenazi_Jewish_intelligence) about Ashkenazi Jewish intelligence, and actually a good wikipedia page on [the entire topic](https://en.wikipedia.org/wiki/Race_and_intelligence) which summarises what we know quite well, better than I can to be honest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with you and I think that we should do more study on these things, and there are issues of bias against these types of studies being done.&lt;/p&gt;\n\n&lt;p&gt;With that being said, it works both ways. With the issue being avoided we don&amp;#39;t have a wealth of good evidence to make the opposite claim either.&lt;/p&gt;\n\n&lt;p&gt;As for point two, it&amp;#39;s difficult to make this type of comparison because, say with skin colour, the number of genetic changes that have been observed to make this change are well known and observable, not that large, we can visually measure the phenotype quite well without a lot of confounding factors. Intelligence isn&amp;#39;t that simple, we haven&amp;#39;t identified genes that are strongly correlated with intelligence differences between populations (check out &lt;a href=\"http://people.virginia.edu/%7Eent3c/papers2/nisbett2012int.pdf\"&gt;this paper&lt;/a&gt; I linked in another comment). When it comes to genetic diversity the human species is actually &lt;a href=\"https://en.wikipedia.org/wiki/Human_genetic_variation\"&gt;quite homogenous&lt;/a&gt; due to genetic bottlenecks in our evolution. Note: there are other sources of difference than just straight genomic similarity, so that&amp;#39;s something to consider.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s actually a &lt;a href=\"https://en.wikipedia.org/wiki/Ashkenazi_Jewish_intelligence\"&gt;wikipedia page&lt;/a&gt; about Ashkenazi Jewish intelligence, and actually a good wikipedia page on &lt;a href=\"https://en.wikipedia.org/wiki/Race_and_intelligence\"&gt;the entire topic&lt;/a&gt; which summarises what we know quite well, better than I can to be honest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6gb4f", "score_hidden": false, "stickied": false, "created": 1492055823.0, "created_utc": 1492027023.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6p65m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6o9ir", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I read [a paper](https://www.ncbi.nlm.nih.gov/pubmed/23533945) recently that seemed to suggest the driving factor in human differentiation has been pathogens, compared to negligable effects of climate. It is Hindawi tho so, lol.\n\nHere's another [paper](https://www.ncbi.nlm.nih.gov/pubmed/24550294) that suggests that two relatively genetically unrelated populations (European Romanians and Roma people) have developed the same mutations in immune genes after exposure to the black death.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read &lt;a href=\"https://www.ncbi.nlm.nih.gov/pubmed/23533945\"&gt;a paper&lt;/a&gt; recently that seemed to suggest the driving factor in human differentiation has been pathogens, compared to negligable effects of climate. It is Hindawi tho so, lol.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s another &lt;a href=\"https://www.ncbi.nlm.nih.gov/pubmed/24550294\"&gt;paper&lt;/a&gt; that suggests that two relatively genetically unrelated populations (European Romanians and Roma people) have developed the same mutations in immune genes after exposure to the black death.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6p65m", "score_hidden": false, "stickied": false, "created": 1492065914.0, "created_utc": 1492037114.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg710nv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6o9ir", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Food unavailability hasn't led to enormous variations in animal cognition\n\nit caused dogs to evolve from wolves. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Food unavailability hasn&amp;#39;t led to enormous variations in animal cognition&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;it caused dogs to evolve from wolves. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg710nv", "score_hidden": false, "stickied": false, "created": 1492080545.0, "created_utc": 1492051745.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6qme2", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "drdgaf", "parent_id": "t1_dg6o9ir", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Sure and humans didn't evolve thick fur in response to cold environments. We make our adaptations via technology. If circumstances demand new technology and you aren't smart enough to develop it, you die. Moving to new locations required new technology from us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure and humans didn&amp;#39;t evolve thick fur in response to cold environments. We make our adaptations via technology. If circumstances demand new technology and you aren&amp;#39;t smart enough to develop it, you die. Moving to new locations required new technology from us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qme2", "score_hidden": false, "stickied": false, "created": 1492067724.0, "created_utc": 1492038924.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6o9ir", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gallowstree", "parent_id": "t1_dg6n26r", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Food unavailability hasn't led to enormous variations in animal cognition - it just drives behaviors like migration, and physiological changes like hibernation to adapt to hypocaloric environments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Food unavailability hasn&amp;#39;t led to enormous variations in animal cognition - it just drives behaviors like migration, and physiological changes like hibernation to adapt to hypocaloric environments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6o9ir", "score_hidden": false, "stickied": false, "created": 1492064799.0, "created_utc": 1492035999.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg70jez", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6n26r", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "i think more specifically it was the need to hunt larger animals, then as we established civilization our execution of murderers played a huge part.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i think more specifically it was the need to hunt larger animals, then as we established civilization our execution of murderers played a huge part.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg70jez", "score_hidden": false, "stickied": false, "created": 1492079923.0, "created_utc": 1492051123.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg746s7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6sg62", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Besides, that completely misses that many ethnicities argued to be \"less intelligent\" developed in Northern climates\n\nthat's not remotely true, high intelligence in northern climates is a pattern in both europe and asia: http://www.photius.com/rankings/national_iq_scores_country_ranks.html  \n\n&gt;Even then, humans likely did not live in Northern climates long enough to see that kind of development around intelligence. It takes much, much longer  \n\nchanges in intelligence and behavior can happen very quickly. it only took 50 years of selective breeding to turn foxes into doglike pets.   \n\n&gt; and there was very likely a great deal of migration and intermingling amongst humans in our earlier millenia as homo sapiens.   \n\nno, there wasn't and dna records show it. even the vikings who were known for travel left very little dna behind in britain. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Besides, that completely misses that many ethnicities argued to be &amp;quot;less intelligent&amp;quot; developed in Northern climates&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;that&amp;#39;s not remotely true, high intelligence in northern climates is a pattern in both europe and asia: &lt;a href=\"http://www.photius.com/rankings/national_iq_scores_country_ranks.html\"&gt;http://www.photius.com/rankings/national_iq_scores_country_ranks.html&lt;/a&gt;  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Even then, humans likely did not live in Northern climates long enough to see that kind of development around intelligence. It takes much, much longer  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;changes in intelligence and behavior can happen very quickly. it only took 50 years of selective breeding to turn foxes into doglike pets.   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and there was very likely a great deal of migration and intermingling amongst humans in our earlier millenia as homo sapiens.   &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;no, there wasn&amp;#39;t and dna records show it. even the vikings who were known for travel left very little dna behind in britain. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg746s7", "score_hidden": false, "stickied": false, "created": 1492085023.0, "created_utc": 1492056223.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6sg62", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lemontreeee", "parent_id": "t1_dg6n26r", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Hardly. People used simple food storage and hunting. Besides, that completely misses that many ethnicities argued to be \"less intelligent\" developed in Northern climates (remember \"Mongoloid\"?). Even then, humans likely did not live in Northern climates long enough to see that kind of development around intelligence. It takes much, much longer, and there was very likely a great deal of migration and intermingling amongst humans in our earlier millenia as homo sapiens. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hardly. People used simple food storage and hunting. Besides, that completely misses that many ethnicities argued to be &amp;quot;less intelligent&amp;quot; developed in Northern climates (remember &amp;quot;Mongoloid&amp;quot;?). Even then, humans likely did not live in Northern climates long enough to see that kind of development around intelligence. It takes much, much longer, and there was very likely a great deal of migration and intermingling amongst humans in our earlier millenia as homo sapiens. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6sg62", "score_hidden": false, "stickied": false, "created": 1492069966.0, "created_utc": 1492041166.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6n26r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "drdgaf", "parent_id": "t1_dg6m8kh", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Harsh weather. If food is unavailable for a large part of the year, the cognitive challenges are harder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Harsh weather. If food is unavailable for a large part of the year, the cognitive challenges are harder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6n26r", "score_hidden": false, "stickied": false, "created": 1492063287.0, "created_utc": 1492034487.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m8kh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "gallowstree", "parent_id": "t1_dg6fndr", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt;It's very obvious to me that genetic differences would also extend to the brain. To argue that we wouldn't see brain differences between populations seems silly.\n\nJust because we'd expect to see a lot of individual variation in cognitive ability (which we certainly do), it doesn't follow that we'd see significant cognitive ability differences between ethnic groups. There are clear reasons why certain major phenotypic differences developed between ethnic groups, largely as a way to cope with the environment (melanin to protect against the sun, sickle cell trait to protect against malaria, lactase activity as a way to generate Vitamin D in areas of the world with little sunlight). But it's not really obvious to me why only certain ethnic groups would face the cognitive selective pressure that would result in the entire population being smarter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s very obvious to me that genetic differences would also extend to the brain. To argue that we wouldn&amp;#39;t see brain differences between populations seems silly.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just because we&amp;#39;d expect to see a lot of individual variation in cognitive ability (which we certainly do), it doesn&amp;#39;t follow that we&amp;#39;d see significant cognitive ability differences between ethnic groups. There are clear reasons why certain major phenotypic differences developed between ethnic groups, largely as a way to cope with the environment (melanin to protect against the sun, sickle cell trait to protect against malaria, lactase activity as a way to generate Vitamin D in areas of the world with little sunlight). But it&amp;#39;s not really obvious to me why only certain ethnic groups would face the cognitive selective pressure that would result in the entire population being smarter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6m8kh", "score_hidden": false, "stickied": false, "created": 1492062300.0, "created_utc": 1492033500.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fndr", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "drdgaf", "parent_id": "t1_dg6dsfl", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "&gt;As for the IQ stuff, most of the studies that focused on this in the past had very poor methodology or other flaws, the more modern studies don't seem to show the strong evidence that people often claim, and even if they did it's always difficult to control for socioeconomic effects on IQ. \n\n1. What happens to a scientist who produces work that does show an IQ difference? Does he continue to get grant money? Does he get shouted down everytime he tries to talk, like Douglas Murray. Would it be career suicide? \n\n2. Do you believe that somehow every other part of human being is acted upon by natural selection, skin color, bone density, hormone production, blood cells, ratios of muscle fibers---but not the brain that consumes 20% of resting metabolism? This really doesn't seem plausible to me. It's very obvious to me that genetic differences would also extend to the brain. To argue that we wouldn't see brain differences between populations seems silly.\n\n3. How do you explain the above average socioeconomic performance of Jewish populations?  What about Asian immigrants, that arrive with low SES and then quickly surpass the native populations? \n \nEdit, I should add. I'm not black or white. I'm also not a racist. I just think these things are worth investigating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;As for the IQ stuff, most of the studies that focused on this in the past had very poor methodology or other flaws, the more modern studies don&amp;#39;t seem to show the strong evidence that people often claim, and even if they did it&amp;#39;s always difficult to control for socioeconomic effects on IQ. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;What happens to a scientist who produces work that does show an IQ difference? Does he continue to get grant money? Does he get shouted down everytime he tries to talk, like Douglas Murray. Would it be career suicide? &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Do you believe that somehow every other part of human being is acted upon by natural selection, skin color, bone density, hormone production, blood cells, ratios of muscle fibers---but not the brain that consumes 20% of resting metabolism? This really doesn&amp;#39;t seem plausible to me. It&amp;#39;s very obvious to me that genetic differences would also extend to the brain. To argue that we wouldn&amp;#39;t see brain differences between populations seems silly.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;How do you explain the above average socioeconomic performance of Jewish populations?  What about Asian immigrants, that arrive with low SES and then quickly surpass the native populations? &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Edit, I should add. I&amp;#39;m not black or white. I&amp;#39;m also not a racist. I just think these things are worth investigating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6fndr", "score_hidden": false, "stickied": false, "created": 1492055156.0, "created_utc": 1492026356.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6r212", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "diggcanburninhell", "parent_id": "t1_dg6ffuf", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "You're a fucking saint, man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re a fucking saint, man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6r212", "score_hidden": false, "stickied": false, "created": 1492068261.0, "created_utc": 1492039461.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6r5jm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "diggcanburninhell", "parent_id": "t1_dg6j5d3", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Fuck you ignorant piece of shit racebaiting mongoloid. Funny how you couch your racism and insecurity in pseudo-intellectual babble but can't resist letting it slip through in bold ways to really assert your dominance and leave no ambiguity as to your provocative beliefs. How are you not 12 years old? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck you ignorant piece of shit racebaiting mongoloid. Funny how you couch your racism and insecurity in pseudo-intellectual babble but can&amp;#39;t resist letting it slip through in bold ways to really assert your dominance and leave no ambiguity as to your provocative beliefs. How are you not 12 years old? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6r5jm", "score_hidden": false, "stickied": false, "created": 1492068378.0, "created_utc": 1492039578.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6ua8z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SpacedAlien", "parent_id": "t1_dg6j5d3", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Do the world a favor and kill yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do the world a favor and kill yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6ua8z", "score_hidden": false, "stickied": false, "created": 1492072237.0, "created_utc": 1492043437.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6j5d3", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6ffuf", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; But again in your first sentence you're just imposing your opinions on the entire movement. I've already pointed this out twice so I'm not going to address it again.\n\nhere's what jared taylor has to say: https://www.youtube.com/watch?v=CJ3B6L2fUA8  you want to say we're not alt right? okay, whatever. those who don't know their enemy are doomed to fail.  \n\n&gt;I actually had a look at the paper you've cited here and there's been a lot of debate around this, a more comprehensive review has been published since 2012, partly in response to the 2005 paper you posted, I have not read the entire thing yet, obviously, however from the discussion it does not seem that the heritability of IQ is clear at all, particularly check the findings under the heading \"Reconciling IQ Gains and Heritability\".  \n\nfirst few paragraphs read like jewish hogwash. ooh wow dutch male iq went up 20 points in a part of the raven's progressive matrices. that changes everything. we can totally reproduce that in american blacks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But again in your first sentence you&amp;#39;re just imposing your opinions on the entire movement. I&amp;#39;ve already pointed this out twice so I&amp;#39;m not going to address it again.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;here&amp;#39;s what jared taylor has to say: &lt;a href=\"https://www.youtube.com/watch?v=CJ3B6L2fUA8\"&gt;https://www.youtube.com/watch?v=CJ3B6L2fUA8&lt;/a&gt;  you want to say we&amp;#39;re not alt right? okay, whatever. those who don&amp;#39;t know their enemy are doomed to fail.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I actually had a look at the paper you&amp;#39;ve cited here and there&amp;#39;s been a lot of debate around this, a more comprehensive review has been published since 2012, partly in response to the 2005 paper you posted, I have not read the entire thing yet, obviously, however from the discussion it does not seem that the heritability of IQ is clear at all, particularly check the findings under the heading &amp;quot;Reconciling IQ Gains and Heritability&amp;quot;.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;first few paragraphs read like jewish hogwash. ooh wow dutch male iq went up 20 points in a part of the raven&amp;#39;s progressive matrices. that changes everything. we can totally reproduce that in american blacks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6j5d3", "score_hidden": false, "stickied": false, "created": 1492058761.0, "created_utc": 1492029961.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ffuf", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6egxx", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "But again in your first sentence you're just imposing your opinions on the entire movement. I've already pointed this out twice so I'm not going to address it again.\n\nI didn't notice the citation, apologies. However in looking into the book further (I'm not going to read it because it looks pretty long and I have a lot of other books to read at the moment) it looks like the image is somewhat out of context, the general theme of [the book](https://en.wikipedia.org/wiki/The_Color_of_Crime_(1998_book\\)) seems to be the reverse of your position. Like I said earlier using simple crime statistics doesn't reflect the socioeconomic relationship between crime, race and structural factors in society.\n\nI actually had a look at the paper you've cited here and there's been a lot of debate around this, a [more comprehensive review](http://people.virginia.edu/~ent3c/papers2/nisbett2012int.pdf) has been published since 2012, partly in response to the 2005 paper you posted, I have not read the entire thing yet, obviously, however from the discussion it does not seem that the heritability of IQ is clear at all, particularly check the findings under the heading \"Reconciling IQ Gains and Heritability\".\n\nAnyway, given that this conversation has included multiple racist slurs and so on I doubt we can really continue in good faith so I'm going to stop replying now.\n\n\n", "edited": 1492027191.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But again in your first sentence you&amp;#39;re just imposing your opinions on the entire movement. I&amp;#39;ve already pointed this out twice so I&amp;#39;m not going to address it again.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t notice the citation, apologies. However in looking into the book further (I&amp;#39;m not going to read it because it looks pretty long and I have a lot of other books to read at the moment) it looks like the image is somewhat out of context, the general theme of &lt;a href=\"https://en.wikipedia.org/wiki/The_Color_of_Crime_(1998_book)\"&gt;the book&lt;/a&gt; seems to be the reverse of your position. Like I said earlier using simple crime statistics doesn&amp;#39;t reflect the socioeconomic relationship between crime, race and structural factors in society.&lt;/p&gt;\n\n&lt;p&gt;I actually had a look at the paper you&amp;#39;ve cited here and there&amp;#39;s been a lot of debate around this, a &lt;a href=\"http://people.virginia.edu/%7Eent3c/papers2/nisbett2012int.pdf\"&gt;more comprehensive review&lt;/a&gt; has been published since 2012, partly in response to the 2005 paper you posted, I have not read the entire thing yet, obviously, however from the discussion it does not seem that the heritability of IQ is clear at all, particularly check the findings under the heading &amp;quot;Reconciling IQ Gains and Heritability&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Anyway, given that this conversation has included multiple racist slurs and so on I doubt we can really continue in good faith so I&amp;#39;m going to stop replying now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6ffuf", "score_hidden": false, "stickied": false, "created": 1492054943.0, "created_utc": 1492026143.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6egxx", "gilded": 0, "archived": false, "score": -16, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6dsfl", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; But, see, in the first two paragraphs you wrote you're just imposing your idea of what the alt-right stands for onto the entire movement.  \n\nanyone who puts conservative ideals before the white race is a cuck. we have a term specifically for that called \"cuckservative\".   \n\n&gt;Could you actually link the study that image came from or the data so we can evaluate its legitimacy? It doesn't even cite a source.  \n\nit says right at the bottom \"the color of crime\", which is a book. the data that chart comes from is based off of uniform crime report data, if i remember correctly. here is 2015 (most recent year) data so you can get an idea of how much of a problem blacks are: https://ucr.fbi.gov/crime-in-the-u.s/2015/crime-in-the-u.s.-2015/tables/table-43   \n\n&gt;As for the IQ stuff, most of the studies that focused on this in the past had very poor methodology or other flaws, the more modern studies don't seem to show the strong evidence that people often claim, and even if they did it's always difficult to control for socioeconomic effects on IQ.  \n\nno, the evidence is actually very clear that blacks are genetically intellectually inferior: https://www1.udel.edu/educ/gottfredson/30years/Rushton-Jensen30years.pdf", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But, see, in the first two paragraphs you wrote you&amp;#39;re just imposing your idea of what the alt-right stands for onto the entire movement.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;anyone who puts conservative ideals before the white race is a cuck. we have a term specifically for that called &amp;quot;cuckservative&amp;quot;.   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Could you actually link the study that image came from or the data so we can evaluate its legitimacy? It doesn&amp;#39;t even cite a source.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;it says right at the bottom &amp;quot;the color of crime&amp;quot;, which is a book. the data that chart comes from is based off of uniform crime report data, if i remember correctly. here is 2015 (most recent year) data so you can get an idea of how much of a problem blacks are: &lt;a href=\"https://ucr.fbi.gov/crime-in-the-u.s/2015/crime-in-the-u.s.-2015/tables/table-43\"&gt;https://ucr.fbi.gov/crime-in-the-u.s/2015/crime-in-the-u.s.-2015/tables/table-43&lt;/a&gt;   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As for the IQ stuff, most of the studies that focused on this in the past had very poor methodology or other flaws, the more modern studies don&amp;#39;t seem to show the strong evidence that people often claim, and even if they did it&amp;#39;s always difficult to control for socioeconomic effects on IQ.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;no, the evidence is actually very clear that blacks are genetically intellectually inferior: &lt;a href=\"https://www1.udel.edu/educ/gottfredson/30years/Rushton-Jensen30years.pdf\"&gt;https://www1.udel.edu/educ/gottfredson/30years/Rushton-Jensen30years.pdf&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6egxx", "score_hidden": false, "stickied": false, "created": 1492053948.0, "created_utc": 1492025148.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dsfl", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6dcsb", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "But, see, in the first two paragraphs you wrote you're just imposing your idea of what the alt-right stands for onto the entire movement. I have spoken with other people who do not want socialised anything under any circumstances. In fact in contradiction of what you're saying here some in the alt right don't even argue that other races are inferior in any way, simply that they should be segregated to preserve european culture and so on. So it *is* complicated.\n\nCould you actually link the study that image came from or the data so we can evaluate its legitimacy? It doesn't even cite a source.\n\nAs for the IQ stuff, most of the studies that focused on this in the past had very poor methodology or other flaws, the more modern studies don't seem to show the strong evidence that people often claim, and even if they did it's always difficult to control for socioeconomic effects on IQ.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But, see, in the first two paragraphs you wrote you&amp;#39;re just imposing your idea of what the alt-right stands for onto the entire movement. I have spoken with other people who do not want socialised anything under any circumstances. In fact in contradiction of what you&amp;#39;re saying here some in the alt right don&amp;#39;t even argue that other races are inferior in any way, simply that they should be segregated to preserve european culture and so on. So it &lt;em&gt;is&lt;/em&gt; complicated.&lt;/p&gt;\n\n&lt;p&gt;Could you actually link the study that image came from or the data so we can evaluate its legitimacy? It doesn&amp;#39;t even cite a source.&lt;/p&gt;\n\n&lt;p&gt;As for the IQ stuff, most of the studies that focused on this in the past had very poor methodology or other flaws, the more modern studies don&amp;#39;t seem to show the strong evidence that people often claim, and even if they did it&amp;#39;s always difficult to control for socioeconomic effects on IQ.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6dsfl", "score_hidden": false, "stickied": false, "created": 1492053244.0, "created_utc": 1492024444.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dcsb", "gilded": 0, "archived": false, "score": -24, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6bz5i", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Not everyone in the alt right want's socialised welfare or medicine\n\nthat's sensible for the current situation because it's irritating to know you're paying for some ungrateful nigger to be lazy. it's even sensible to make up silly excuses to justify your position just to avoid being called racist.  \n\n&gt;To address some things in your comment, you talk about disincentivising reproduction, which is interesting, did you know populations tend to fall when poverty is reduced, and poverty tends to decrease when birth rates decrease?   \n\nthose happen for complicated reasons that you cannot take advantage of. the alt right considers throwing money at blacks a failed experiment that just causes more problems because it makes more blacks.  \n\n&gt;Likewise you talk about gun crime, but did you know that poverty and violent crime are associated?  \n\nhttp://nationalvanguard.org/wp-content/uploads/2016/02/CrimeRatesExplained.jpg   \n\n&gt;I don't want to create the impression poverty is the only issue that Black people face either, but I'd like to keep this comment short.  \n\npoverty is just the symptom of the real problem of blacks: genetically low IQ. current blacks simply cannot perform at the same capacity as whites because their brains don't function as well. the way to solve this problem is not by paying the dumbest niggers to breed more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Not everyone in the alt right want&amp;#39;s socialised welfare or medicine&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;that&amp;#39;s sensible for the current situation because it&amp;#39;s irritating to know you&amp;#39;re paying for some ungrateful nigger to be lazy. it&amp;#39;s even sensible to make up silly excuses to justify your position just to avoid being called racist.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;To address some things in your comment, you talk about disincentivising reproduction, which is interesting, did you know populations tend to fall when poverty is reduced, and poverty tends to decrease when birth rates decrease?   &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;those happen for complicated reasons that you cannot take advantage of. the alt right considers throwing money at blacks a failed experiment that just causes more problems because it makes more blacks.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Likewise you talk about gun crime, but did you know that poverty and violent crime are associated?  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"http://nationalvanguard.org/wp-content/uploads/2016/02/CrimeRatesExplained.jpg\"&gt;http://nationalvanguard.org/wp-content/uploads/2016/02/CrimeRatesExplained.jpg&lt;/a&gt;   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t want to create the impression poverty is the only issue that Black people face either, but I&amp;#39;d like to keep this comment short.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;poverty is just the symptom of the real problem of blacks: genetically low IQ. current blacks simply cannot perform at the same capacity as whites because their brains don&amp;#39;t function as well. the way to solve this problem is not by paying the dumbest niggers to breed more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6dcsb", "score_hidden": false, "stickied": false, "created": 1492052798.0, "created_utc": 1492023998.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bz5i", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg69l78", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I'm not going to downvote you because I think it's useful to hear this.\n\n*However*, with respect, I think the alt right is more complicated than this. Not everyone in the alt right want's socialised welfare or medicine, some are more marketarian and even verge on anarchocapitalism whilst others are much more authoritarian and advocate for establishing a white ethno-state etc. Do you think authoritarians really want an armed population? So even amongst these three issues you raise I would argue there is no consensus.\n\nThere's actually quite a diversity of  movements within what we describe as the alt-right. And in many ways I think that makes for a pretty nebulous, syncretic and incoherent movement.\n\nTo address some things in your comment, you talk about disincentivising reproduction, which is interesting, did you know populations tend to fall when [poverty is reduced, and poverty tends to decrease when birth rates decrease](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2781831/)? If we assume there is no racist intention behind your desire to reduce the Black birth rate, and you genuinely think this is good for these people, then don't you agree we should be focusing on reducing poverty in the Black community?\n\nLikewise you talk about gun crime, but did you know that [poverty and violent crime are associated?](http://journals.sagepub.com/doi/abs/10.1177/073401689301800203). If you want a reduction in crime then it makes sense to address poverty right?\n\nPeople are also going to claim less welfare if they are not more susceptible to poverty.\n\nPart of that is addressing structural issues that contribute to poverty amongst Black people, and I think that if you're fine with ghettoisation of certain demographics I don't think you're seeing the structural issues that contribute to poverty, which is a shame because I don't see how we can solve these issues without addressing that.\n\nI don't want to create the impression poverty is the only issue that Black people face either, but I'd like to keep this comment short.\n\nAs for forcing them to do white people things I don't know what you mean. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not going to downvote you because I think it&amp;#39;s useful to hear this.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;However&lt;/em&gt;, with respect, I think the alt right is more complicated than this. Not everyone in the alt right want&amp;#39;s socialised welfare or medicine, some are more marketarian and even verge on anarchocapitalism whilst others are much more authoritarian and advocate for establishing a white ethno-state etc. Do you think authoritarians really want an armed population? So even amongst these three issues you raise I would argue there is no consensus.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s actually quite a diversity of  movements within what we describe as the alt-right. And in many ways I think that makes for a pretty nebulous, syncretic and incoherent movement.&lt;/p&gt;\n\n&lt;p&gt;To address some things in your comment, you talk about disincentivising reproduction, which is interesting, did you know populations tend to fall when &lt;a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2781831/\"&gt;poverty is reduced, and poverty tends to decrease when birth rates decrease&lt;/a&gt;? If we assume there is no racist intention behind your desire to reduce the Black birth rate, and you genuinely think this is good for these people, then don&amp;#39;t you agree we should be focusing on reducing poverty in the Black community?&lt;/p&gt;\n\n&lt;p&gt;Likewise you talk about gun crime, but did you know that &lt;a href=\"http://journals.sagepub.com/doi/abs/10.1177/073401689301800203\"&gt;poverty and violent crime are associated?&lt;/a&gt;. If you want a reduction in crime then it makes sense to address poverty right?&lt;/p&gt;\n\n&lt;p&gt;People are also going to claim less welfare if they are not more susceptible to poverty.&lt;/p&gt;\n\n&lt;p&gt;Part of that is addressing structural issues that contribute to poverty amongst Black people, and I think that if you&amp;#39;re fine with ghettoisation of certain demographics I don&amp;#39;t think you&amp;#39;re seeing the structural issues that contribute to poverty, which is a shame because I don&amp;#39;t see how we can solve these issues without addressing that.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to create the impression poverty is the only issue that Black people face either, but I&amp;#39;d like to keep this comment short.&lt;/p&gt;\n\n&lt;p&gt;As for forcing them to do white people things I don&amp;#39;t know what you mean. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6bz5i", "score_hidden": false, "stickied": false, "created": 1492051363.0, "created_utc": 1492022563.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg718sh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "UncleMeat11", "parent_id": "t1_dg6m1pm", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "He's a holocaust denier too. He hits all of the disgusting points.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s a holocaust denier too. He hits all of the disgusting points.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg718sh", "score_hidden": false, "stickied": false, "created": 1492080844.0, "created_utc": 1492052044.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m1pm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SpacedAlien", "parent_id": "t1_dg6bvei", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I have him tagged as Racist Idiot and he never disappoints.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have him tagged as Racist Idiot and he never disappoints.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6m1pm", "score_hidden": false, "stickied": false, "created": 1492062071.0, "created_utc": 1492033271.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bvei", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Lovecrafttrashed", "parent_id": "t1_dg69l78", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Holy shit that comment history. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit that comment history. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6bvei", "score_hidden": false, "stickied": false, "created": 1492051259.0, "created_utc": 1492022459.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6cmfm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Philo_T_Farnsworth", "parent_id": "t1_dg69l78", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; the problem with almost every issue is that we just have too many blacks\n\nWhat a thoughtful and insightful comment.  Please tell me more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the problem with almost every issue is that we just have too many blacks&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What a thoughtful and insightful comment.  Please tell me more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6cmfm", "score_hidden": false, "stickied": false, "created": 1492052033.0, "created_utc": 1492023233.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg71yqo", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Maskirovka", "parent_id": "t1_dg71p98", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "You really one-upped yourself on the crazy with that post. I wasn't expecting that.  The bubble of \"evidence\" that you've put yourself in to back up these claims is astounding. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really one-upped yourself on the crazy with that post. I wasn&amp;#39;t expecting that.  The bubble of &amp;quot;evidence&amp;quot; that you&amp;#39;ve put yourself in to back up these claims is astounding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg71yqo", "score_hidden": false, "stickied": false, "created": 1492081804.0, "created_utc": 1492053004.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71p98", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6qlcv", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "the only intelligent jews are \"ashkenazi\", and they're only intelligent because of the nazi genes. add to that they are immune to affirmative action and that explains a lot of their success. but why does their have to be a master race? why can't we just let them all pursue their own destinies without forcing one specific race to live next to all others?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the only intelligent jews are &amp;quot;ashkenazi&amp;quot;, and they&amp;#39;re only intelligent because of the nazi genes. add to that they are immune to affirmative action and that explains a lot of their success. but why does their have to be a master race? why can&amp;#39;t we just let them all pursue their own destinies without forcing one specific race to live next to all others?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg71p98", "score_hidden": false, "stickied": false, "created": 1492081451.0, "created_utc": 1492052651.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qlcv", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Maskirovka", "parent_id": "t1_dg6le3e", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "As long as we're making ridiculous and thoughtless arguments, let me counter:\n\nBut you said Jews have above average socioeconomic performance in another comment, so they must be the master race because they are the most fit to survive 21st century stressors...their culture doesn't even need a nation or state to propagate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As long as we&amp;#39;re making ridiculous and thoughtless arguments, let me counter:&lt;/p&gt;\n\n&lt;p&gt;But you said Jews have above average socioeconomic performance in another comment, so they must be the master race because they are the most fit to survive 21st century stressors...their culture doesn&amp;#39;t even need a nation or state to propagate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qlcv", "score_hidden": false, "stickied": false, "created": 1492067690.0, "created_utc": 1492038890.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6r3bz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg6le3e", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I like Jews. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like Jews. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6r3bz", "score_hidden": false, "stickied": false, "created": 1492068303.0, "created_utc": 1492039503.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6le3e", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg6d41o", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "tim wise is a jew.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;tim wise is a jew.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6le3e", "score_hidden": false, "stickied": false, "created": 1492061291.0, "created_utc": 1492032491.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6d41o", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "stupid_trump", "parent_id": "t1_dg69l78", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Everything you've said here is grossly mistaken. \n\nhttps://www.youtube.com/watch?v=Zh_yhgbgRkc", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything you&amp;#39;ve said here is grossly mistaken. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=Zh_yhgbgRkc\"&gt;https://www.youtube.com/watch?v=Zh_yhgbgRkc&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6d41o", "score_hidden": false, "stickied": false, "created": 1492052539.0, "created_utc": 1492023739.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69l78", "gilded": 0, "archived": false, "score": -43, "report_reasons": null, "author": "videogameboss", "parent_id": "t1_dg5sqze", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "you make the alt right sound way more complicated than it really is. we want things like gun rights and socialized medicine and welfare. the problem with almost every issue is that we just have too many blacks, who go and do things like commit gun crime and abuse welfare. and blacks are more unhappy than ever so let's stop trying to grow their population and force them to do white people things. repeal affirmative action and disparate impact housing policy, allow self segregation to occur, and disincentivize reproduction. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you make the alt right sound way more complicated than it really is. we want things like gun rights and socialized medicine and welfare. the problem with almost every issue is that we just have too many blacks, who go and do things like commit gun crime and abuse welfare. and blacks are more unhappy than ever so let&amp;#39;s stop trying to grow their population and force them to do white people things. repeal affirmative action and disparate impact housing policy, allow self segregation to occur, and disincentivize reproduction. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg69l78", "score_hidden": false, "stickied": false, "created": 1492048918.0, "created_utc": 1492020118.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -43}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5sqze", "gilded": 0, "archived": false, "score": 116, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "#### Submission statement ####\n\nThis essay has been submitted before, 11 months ago,  but I think in the intervening time circumstances have changed somewhat. With the Trump victory and persistant accusations of fascism, to more blatant neo-fascist ideas emerging out of the alt-right, an overview of what fascism meant in its first wave and what the eternal characteristics of this social phenomenon are seem to still be relevant and worth further discussion.\n\nIn this essay [Umberto Eco](https://en.wikipedia.org/wiki/Umberto_Eco) recalls his childhood experiences under Italian fascism, and, drawing a comparison to Ludwig Wittgenstein's idea of a language game explains how the nebulous nature of Fascism is linked to the apparent continuity between a series of movements which may have or omit different ideological components.\n\nHe gives an account of what he calls 'Ur-Fascism', the Eternal Fascism, or 14 principles which most if not all Fascist movements contain (summarised in my words):\n\n1. Cult of tradition.\n2. Rejection of modernism / enlightenment ideals.\n3.  Irrationalism, or action for actions sake, action being inherently beautiful and symbolic.\n4. Disagreement as treason - the inherent weakness of syncretism as vague and incoherent demands suppression of criticism.\n5. Fear of difference, beginning with fear of an 'intruder', as difference is the spawning point of disagreement.\n6. Appeal to a frustrated middle class suffering from debasement, political humiliation, difficult economic circumstances. He notes how the decline of the traditional proletariat working class shifts the demographic of fascism to the middle.\n7. Obsession with a plot, including both the appeal to xenophobia but also the appeal to an enemy from within, whether it is World Jewry or the concept of a New World Order. \n8. Pushing the idea of the enemies of fascism enjoying some ostentatious wealth or great power, simultaneous with the idea the enemy is weak and can be overcome by force.\n9. Pacifism as trafficking with the enemy.\n10. Popular elitism, where the elite are those who are strong and the plebians are the weak.\n11. A hero cult where everyone is educated to become a hero, with emphasis on heroic death.\n12. Machismo, contempt for women and nonstandard sexual habits.\n13. Selective populism, an appeal to the 'voice of the people' where the people are only a certain demographic. \"Because of its qualitative populism Ur-Fascism must be against “rotten” parliamentary governments.\"\n14. Newspeak, a new sociolect which limits the capability for complex critical reasoning.\n\nBy all means do not take my interpretations as fact as I have only one perspective on this text, however given it's length I thought it would be good to give a brief overview of the content in this way.\n\n\n", "edited": 1492002049.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;h4&gt;Submission statement&lt;/h4&gt;\n\n&lt;p&gt;This essay has been submitted before, 11 months ago,  but I think in the intervening time circumstances have changed somewhat. With the Trump victory and persistant accusations of fascism, to more blatant neo-fascist ideas emerging out of the alt-right, an overview of what fascism meant in its first wave and what the eternal characteristics of this social phenomenon are seem to still be relevant and worth further discussion.&lt;/p&gt;\n\n&lt;p&gt;In this essay &lt;a href=\"https://en.wikipedia.org/wiki/Umberto_Eco\"&gt;Umberto Eco&lt;/a&gt; recalls his childhood experiences under Italian fascism, and, drawing a comparison to Ludwig Wittgenstein&amp;#39;s idea of a language game explains how the nebulous nature of Fascism is linked to the apparent continuity between a series of movements which may have or omit different ideological components.&lt;/p&gt;\n\n&lt;p&gt;He gives an account of what he calls &amp;#39;Ur-Fascism&amp;#39;, the Eternal Fascism, or 14 principles which most if not all Fascist movements contain (summarised in my words):&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Cult of tradition.&lt;/li&gt;\n&lt;li&gt;Rejection of modernism / enlightenment ideals.&lt;/li&gt;\n&lt;li&gt; Irrationalism, or action for actions sake, action being inherently beautiful and symbolic.&lt;/li&gt;\n&lt;li&gt;Disagreement as treason - the inherent weakness of syncretism as vague and incoherent demands suppression of criticism.&lt;/li&gt;\n&lt;li&gt;Fear of difference, beginning with fear of an &amp;#39;intruder&amp;#39;, as difference is the spawning point of disagreement.&lt;/li&gt;\n&lt;li&gt;Appeal to a frustrated middle class suffering from debasement, political humiliation, difficult economic circumstances. He notes how the decline of the traditional proletariat working class shifts the demographic of fascism to the middle.&lt;/li&gt;\n&lt;li&gt;Obsession with a plot, including both the appeal to xenophobia but also the appeal to an enemy from within, whether it is World Jewry or the concept of a New World Order. &lt;/li&gt;\n&lt;li&gt;Pushing the idea of the enemies of fascism enjoying some ostentatious wealth or great power, simultaneous with the idea the enemy is weak and can be overcome by force.&lt;/li&gt;\n&lt;li&gt;Pacifism as trafficking with the enemy.&lt;/li&gt;\n&lt;li&gt;Popular elitism, where the elite are those who are strong and the plebians are the weak.&lt;/li&gt;\n&lt;li&gt;A hero cult where everyone is educated to become a hero, with emphasis on heroic death.&lt;/li&gt;\n&lt;li&gt;Machismo, contempt for women and nonstandard sexual habits.&lt;/li&gt;\n&lt;li&gt;Selective populism, an appeal to the &amp;#39;voice of the people&amp;#39; where the people are only a certain demographic. &amp;quot;Because of its qualitative populism Ur-Fascism must be against “rotten” parliamentary governments.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Newspeak, a new sociolect which limits the capability for complex critical reasoning.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;By all means do not take my interpretations as fact as I have only one perspective on this text, however given it&amp;#39;s length I thought it would be good to give a brief overview of the content in this way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5sqze", "score_hidden": false, "stickied": false, "created": 1492029386.0, "created_utc": 1492000586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 116}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6rkqv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sbhikes", "parent_id": "t1_dg6qm20", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Yes, and the Redpill nonsense is sort of heroic as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, and the Redpill nonsense is sort of heroic as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6rkqv", "score_hidden": false, "stickied": false, "created": 1492068889.0, "created_utc": 1492040089.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qm20", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "lemontreeee", "parent_id": "t1_dg6cgbc", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I feel it's deeply important to add the other ways that people end up with hero-complexes:\n\n1. The military complex and God's soldier rhetoric in the conservative/neo-cons/Tea Party/Truther etc.\n\n2. The heroization of the White Knight/Good Guy narrative that morphs to male supremacist movements in or near alt-right/Neo-reactionaries (incels, PUAs, MRAs) \n\n3. The anti-hero sentiments within the Dark Enlightenment/neo-reactionaries. \n\nThere's also the exportation of hero onto symbols, such as Trump, Bannon, Musk, etc, via which followers build narratives of becoming ultra-righteous for worshipping these figures. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel it&amp;#39;s deeply important to add the other ways that people end up with hero-complexes:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;The military complex and God&amp;#39;s soldier rhetoric in the conservative/neo-cons/Tea Party/Truther etc.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The heroization of the White Knight/Good Guy narrative that morphs to male supremacist movements in or near alt-right/Neo-reactionaries (incels, PUAs, MRAs) &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The anti-hero sentiments within the Dark Enlightenment/neo-reactionaries. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;There&amp;#39;s also the exportation of hero onto symbols, such as Trump, Bannon, Musk, etc, via which followers build narratives of becoming ultra-righteous for worshipping these figures. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qm20", "score_hidden": false, "stickied": false, "created": 1492067714.0, "created_utc": 1492038914.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6speh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bch8", "parent_id": "t1_dg6cgbc", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Not to mention Hollywood is literally a hero story factory and has been pretty much forever. Our culture is completely inundated with hero stories from Hollywood. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to mention Hollywood is literally a hero story factory and has been pretty much forever. Our culture is completely inundated with hero stories from Hollywood. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6speh", "score_hidden": false, "stickied": false, "created": 1492070288.0, "created_utc": 1492041488.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cgbc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sbhikes", "parent_id": "t1_dg642u7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; 11. Everybody is educated to become a hero, with emphasis on a heroic death. Radical Islam is the best example of this one.\n\nA good example from our own culture is the role video games play in this. Kind of a safe-sex means of carrying out heroism. We never even leave our couches to fight and die as virtual heroes, which also leaves the ruling class free to do whatever because we're all at home. Another example is that on the left many feel they are in an existential fight to save Democracy itself while those on the right feel they are in an existential fight to destroy the left.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;ol&gt;\n&lt;li&gt;Everybody is educated to become a hero, with emphasis on a heroic death. Radical Islam is the best example of this one.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A good example from our own culture is the role video games play in this. Kind of a safe-sex means of carrying out heroism. We never even leave our couches to fight and die as virtual heroes, which also leaves the ruling class free to do whatever because we&amp;#39;re all at home. Another example is that on the left many feel they are in an existential fight to save Democracy itself while those on the right feel they are in an existential fight to destroy the left.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6cgbc", "score_hidden": false, "stickied": false, "created": 1492051853.0, "created_utc": 1492023053.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6rb4v", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Akasazh", "parent_id": "t1_dg642u7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Trump and the alt-right have shown 11 out of 14 of these. \n\n\nIn the article Eco does take a lot of time to adress the synecdochal character of fascism, no single one dots all the i's, this adapting and morphing character is exatly why one should stay on guard. (Mind you that whilst yourself might have read that, it is important to stress for the comment readers).\n\n\n\n\n&gt;9. Pacifism is trafficking with the enemy. This is only not evident because we are currently not at war. \n\nI think that the definition of war has changed a fair bit, in a way that resembles doublespeak. The USA hasn't been at war since WO2. Whilst its true that pacifist don't get slandered by the governement, there *is* a tendency towards 'others' to shame them for not supporting the US 'war' effort: \"Who is not with us, is against us\" and \"freedom fries\" when the French didn't support the Iraqi intervention. It is true that that hasn't happened under the Trump administration, but the mechanism is tried and tested.\n\n\n\n&gt; 11. Everybody is educated to become a hero, with emphasis on a heroic death. Radical Islam is the best example of this one. \n\nI think that this box is and has been repeatedly checked (in different 'wars' and against different foes by the poweful propaganda-machine know as Hollywood. To be honest, most of this propaganda has the heroes surviving (and therefore not truly glorifieing sacrifice), but secondary characters often get glorified in this way (jumping on a grenade to save friends, for instance). Whist the hero often lives, arguably most of their actions are borderline suïcidal, in that way glorifying self-endangering heroïsm for the 'greater good'. The hero lives because of his American values, as he is a metaphor for the country. But the reality of 'boots on the ground GI's' is vastly different.\n\n\n\n&gt;13. Selective Populism. \"There is in our future a TV or Internet populism, in which the emotional response of a selected group of citizens can be presented and accepted as the Voice of the People.” \n\n\n\nI respectfully disagree. The American media are the most finely tuned consent and 'news fatigue' machines out there. To the point where comedians like Colbert and Stewart were often the only truely critical voice in the mediasphere. The saving grace is that Trump is so polarizing that he is not in charge of this machine and that dissenting voices are way more prominent then under previous administrations. Mainly as he has a complete disrespect for the media (like not frequenting the correspondents dinner).\n\n\nOne must, however keep in mind that control of the powerful mediasphere in the USA is *not out of reach* for someone like Trump. Whenever that happens, though, things might go pearshaped very. very quickly. Isolationism is a way this can be archieved and I think that the turmoil Trump manages will quite easily change the global, political field, where long-time allies can be coerced to withdraw support leaving America 'to tend to it's own'. \n\n\nTrump is already downplaying America's role as 'keeper of the global peace' and trying to monitize it's contribution towards the UN. It might not be that Trump is the real fascist we need to look out for. He might just be the fall guy for whomever gets to clean up his mess. All the tools are in place, but once he's had his 4 years what will happen?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Trump and the alt-right have shown 11 out of 14 of these. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In the article Eco does take a lot of time to adress the synecdochal character of fascism, no single one dots all the i&amp;#39;s, this adapting and morphing character is exatly why one should stay on guard. (Mind you that whilst yourself might have read that, it is important to stress for the comment readers).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;ol&gt;\n&lt;li&gt;Pacifism is trafficking with the enemy. This is only not evident because we are currently not at war. &lt;/li&gt;\n&lt;/ol&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that the definition of war has changed a fair bit, in a way that resembles doublespeak. The USA hasn&amp;#39;t been at war since WO2. Whilst its true that pacifist don&amp;#39;t get slandered by the governement, there &lt;em&gt;is&lt;/em&gt; a tendency towards &amp;#39;others&amp;#39; to shame them for not supporting the US &amp;#39;war&amp;#39; effort: &amp;quot;Who is not with us, is against us&amp;quot; and &amp;quot;freedom fries&amp;quot; when the French didn&amp;#39;t support the Iraqi intervention. It is true that that hasn&amp;#39;t happened under the Trump administration, but the mechanism is tried and tested.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;ol&gt;\n&lt;li&gt;Everybody is educated to become a hero, with emphasis on a heroic death. Radical Islam is the best example of this one. &lt;/li&gt;\n&lt;/ol&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that this box is and has been repeatedly checked (in different &amp;#39;wars&amp;#39; and against different foes by the poweful propaganda-machine know as Hollywood. To be honest, most of this propaganda has the heroes surviving (and therefore not truly glorifieing sacrifice), but secondary characters often get glorified in this way (jumping on a grenade to save friends, for instance). Whist the hero often lives, arguably most of their actions are borderline suïcidal, in that way glorifying self-endangering heroïsm for the &amp;#39;greater good&amp;#39;. The hero lives because of his American values, as he is a metaphor for the country. But the reality of &amp;#39;boots on the ground GI&amp;#39;s&amp;#39; is vastly different.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;ol&gt;\n&lt;li&gt;Selective Populism. &amp;quot;There is in our future a TV or Internet populism, in which the emotional response of a selected group of citizens can be presented and accepted as the Voice of the People.” &lt;/li&gt;\n&lt;/ol&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I respectfully disagree. The American media are the most finely tuned consent and &amp;#39;news fatigue&amp;#39; machines out there. To the point where comedians like Colbert and Stewart were often the only truely critical voice in the mediasphere. The saving grace is that Trump is so polarizing that he is not in charge of this machine and that dissenting voices are way more prominent then under previous administrations. Mainly as he has a complete disrespect for the media (like not frequenting the correspondents dinner).&lt;/p&gt;\n\n&lt;p&gt;One must, however keep in mind that control of the powerful mediasphere in the USA is &lt;em&gt;not out of reach&lt;/em&gt; for someone like Trump. Whenever that happens, though, things might go pearshaped very. very quickly. Isolationism is a way this can be archieved and I think that the turmoil Trump manages will quite easily change the global, political field, where long-time allies can be coerced to withdraw support leaving America &amp;#39;to tend to it&amp;#39;s own&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;Trump is already downplaying America&amp;#39;s role as &amp;#39;keeper of the global peace&amp;#39; and trying to monitize it&amp;#39;s contribution towards the UN. It might not be that Trump is the real fascist we need to look out for. He might just be the fall guy for whomever gets to clean up his mess. All the tools are in place, but once he&amp;#39;s had his 4 years what will happen?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6rb4v", "score_hidden": false, "stickied": false, "created": 1492068565.0, "created_utc": 1492039765.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6qvuo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lemontreeee", "parent_id": "t1_dg642u7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I want to point out two things: \n\n1. That there IS a cultural fascist ideology around the military in conservative communities. It is highly regarded to go to war for your country and God. \n\n2. Education comes AFTER fascists establish their system. If the fascists in control of the US win, watch this Nationalism around martyrdom rise. Hopefully we won't reach that stage though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to point out two things: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;That there IS a cultural fascist ideology around the military in conservative communities. It is highly regarded to go to war for your country and God. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Education comes AFTER fascists establish their system. If the fascists in control of the US win, watch this Nationalism around martyrdom rise. Hopefully we won&amp;#39;t reach that stage though. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qvuo", "score_hidden": false, "stickied": false, "created": 1492068050.0, "created_utc": 1492039250.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6c0q8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "moonmixer", "parent_id": "t1_dg66rvi", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Frankly, his 80% statement is just about as well-supported as the 50% statement.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Frankly, his 80% statement is just about as well-supported as the 50% statement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6c0q8", "score_hidden": false, "stickied": false, "created": 1492051407.0, "created_utc": 1492022607.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg7oxsj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "p220", "parent_id": "t1_dg75g7b", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Fair point... I agree ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair point... I agree &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7oxsj", "score_hidden": false, "stickied": false, "created": 1492125602.0, "created_utc": 1492096802.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75g7b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "black_dynamite4991", "parent_id": "t1_dg6ufl7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "How can you accurately gauge whether a probabilistic model is correct( or \"horrible\") if your experiment is tested only on one event? \n\nIn other words, since we can only run the election once, there's no way to guarantee 538's model of Trump winning 25% of the time is more accurare than another model that has him winning 40% of the time. \n   ", "edited": 1492058390.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How can you accurately gauge whether a probabilistic model is correct( or &amp;quot;horrible&amp;quot;) if your experiment is tested only on one event? &lt;/p&gt;\n\n&lt;p&gt;In other words, since we can only run the election once, there&amp;#39;s no way to guarantee 538&amp;#39;s model of Trump winning 25% of the time is more accurare than another model that has him winning 40% of the time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg75g7b", "score_hidden": false, "stickied": false, "created": 1492087000.0, "created_utc": 1492058200.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg74p8f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Turniper", "parent_id": "t1_dg6ufl7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Eh, I thought their analysis was pretty fair. Sure, they supported Clinton, but they acknowledged that from about September onwards a Trump win was a reasonable possibility, though less likely.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, I thought their analysis was pretty fair. Sure, they supported Clinton, but they acknowledged that from about September onwards a Trump win was a reasonable possibility, though less likely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg74p8f", "score_hidden": false, "stickied": false, "created": 1492085799.0, "created_utc": 1492056999.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ufl7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "p220", "parent_id": "t1_dg6qsdm", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Yes, they were at the top end of the left-leaning polls, they were not as horribly off as the others. But not by a whole lot. \n\nDownvoting me won't really sway my view of things, but really interested to hear of your opinions, even if i disagree", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, they were at the top end of the left-leaning polls, they were not as horribly off as the others. But not by a whole lot. &lt;/p&gt;\n\n&lt;p&gt;Downvoting me won&amp;#39;t really sway my view of things, but really interested to hear of your opinions, even if i disagree&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6ufl7", "score_hidden": false, "stickied": false, "created": 1492072415.0, "created_utc": 1492043615.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qsdm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Turniper", "parent_id": "t1_dg6qfzw", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "538 was probably one of the most accurate forecasters, they had trump at a 25% chance of victory in the days before the election. Pretty reasonable considering that his win came from unexpectedly strong support in a few swing states and despite a fairly large loss in the popular vote.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;538 was probably one of the most accurate forecasters, they had trump at a 25% chance of victory in the days before the election. Pretty reasonable considering that his win came from unexpectedly strong support in a few swing states and despite a fairly large loss in the popular vote.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qsdm", "score_hidden": false, "stickied": false, "created": 1492067931.0, "created_utc": 1492039131.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg7l3uk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "p220", "parent_id": "t1_dg7aowp", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "True but 538 wasn't naive enough to not consider this aspect (neither were the campaigns presumably)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True but 538 wasn&amp;#39;t naive enough to not consider this aspect (neither were the campaigns presumably)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7l3uk", "score_hidden": false, "stickied": false, "created": 1492121199.0, "created_utc": 1492092399.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7aowp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgmctabnxjs", "parent_id": "t1_dg6qfzw", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Well, Clinton did win the popular vote handily.\n\nIt's the Electoral College vote which cause problems in prediction.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, Clinton did win the popular vote handily.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s the Electoral College vote which cause problems in prediction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7aowp", "score_hidden": false, "stickied": false, "created": 1492098779.0, "created_utc": 1492069979.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg7aqm6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgmctabnxjs", "parent_id": "t1_dg6qfzw", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Below 40% is uncommon just after an election.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Below 40% is uncommon just after an election.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7aqm6", "score_hidden": false, "stickied": false, "created": 1492098920.0, "created_utc": 1492070120.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qfzw", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "p220", "parent_id": "t1_dg6bzev", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "That's the same org who said Clinton would win handily ... also below 40% isn't uncommon ... http://www.gallup.com/poll/113980/gallup-daily-obama-job-approval.aspx", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the same org who said Clinton would win handily ... also below 40% isn&amp;#39;t uncommon ... &lt;a href=\"http://www.gallup.com/poll/113980/gallup-daily-obama-job-approval.aspx\"&gt;http://www.gallup.com/poll/113980/gallup-daily-obama-job-approval.aspx&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qfzw", "score_hidden": false, "stickied": false, "created": 1492067504.0, "created_utc": 1492038704.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bzev", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgmctabnxjs", "parent_id": "t1_dg66rvi", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Well, recently the polls were saying below 40% approval rating.\n\nhttps://projects.fivethirtyeight.com/trump-approval-ratings/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, recently the polls were saying below 40% approval rating.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://projects.fivethirtyeight.com/trump-approval-ratings/\"&gt;https://projects.fivethirtyeight.com/trump-approval-ratings/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6bzev", "score_hidden": false, "stickied": false, "created": 1492051370.0, "created_utc": 1492022570.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66rvi", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "parrotpeople", "parent_id": "t1_dg66ecd", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "You're right, trump is the only politician in history with no passive support /s", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right, trump is the only politician in history with no passive support /s&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg66rvi", "score_hidden": false, "stickied": false, "created": 1492046090.0, "created_utc": 1492017290.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66ecd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sgmctabnxjs", "parent_id": "t1_dg642u7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "&gt; Meanwhile, the other half of the country see him as a gullible fool.\n\nIt's not half, it's 80%.\n\nFewer than 1 in 5 citizens voted Trump, and I think some may have changed their mind since.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Meanwhile, the other half of the country see him as a gullible fool.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not half, it&amp;#39;s 80%.&lt;/p&gt;\n\n&lt;p&gt;Fewer than 1 in 5 citizens voted Trump, and I think some may have changed their mind since.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg66ecd", "score_hidden": false, "stickied": false, "created": 1492045706.0, "created_utc": 1492016906.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg66zbo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "arianeb", "parent_id": "t1_dg64lsi", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Personally, I follow news that continues to follow good journalistic practices, like The New York Times, Washington Post, and The Wall Street Journal. Yes, these are all corporate owned, but their \"news\" is well researched and verified, and their \"opinions\" are clearly marked. \n\nGenerally speaking, almost everyone lives in a news bubble these days, believing what our own bias is telling us to believe. There are two evident types of \"populism\", one of the Trump variety, and one of the Bernie Sanders variety. Neither is dominant, so neither can \"be presented and accepted as the Voice of the People.\" Even though conservatives control all three branches of government, the current low approval ratings and fear of losing control in 2018/2020 is preventing implementation of their full agenda. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I follow news that continues to follow good journalistic practices, like The New York Times, Washington Post, and The Wall Street Journal. Yes, these are all corporate owned, but their &amp;quot;news&amp;quot; is well researched and verified, and their &amp;quot;opinions&amp;quot; are clearly marked. &lt;/p&gt;\n\n&lt;p&gt;Generally speaking, almost everyone lives in a news bubble these days, believing what our own bias is telling us to believe. There are two evident types of &amp;quot;populism&amp;quot;, one of the Trump variety, and one of the Bernie Sanders variety. Neither is dominant, so neither can &amp;quot;be presented and accepted as the Voice of the People.&amp;quot; Even though conservatives control all three branches of government, the current low approval ratings and fear of losing control in 2018/2020 is preventing implementation of their full agenda. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg66zbo", "score_hidden": false, "stickied": false, "created": 1492046300.0, "created_utc": 1492017500.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64lsi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sbhikes", "parent_id": "t1_dg642u7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "I think number 13 is currently in flux. First of all, you have the two poles being Breitbart/Infowars type stuff and the other being what? Mainstream news? PBS? Those have already been described as part of the corporate power, part of a fascist effort to subvert the popular voice. Add on to that you have all this social media where all these voices can speak, but so can various disinformation campaigns as well as paid trolls and bots.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think number 13 is currently in flux. First of all, you have the two poles being Breitbart/Infowars type stuff and the other being what? Mainstream news? PBS? Those have already been described as part of the corporate power, part of a fascist effort to subvert the popular voice. Add on to that you have all this social media where all these voices can speak, but so can various disinformation campaigns as well as paid trolls and bots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg64lsi", "score_hidden": false, "stickied": false, "created": 1492043863.0, "created_utc": 1492015063.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg642u7", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "arianeb", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Trump and the alt-right have shown 11 out of 14 of these. The three they are missing:\n9. Pacifism is trafficking with the enemy. This is only not evident because we are currently not at war. Opposition to Trump's attack on Syria came from both the Right and Left.\n11. Everybody is educated to become a hero, with emphasis on a heroic death. Radical Islam is the best example of this one. Conservative mythology about a \"good guy with a gun\" leans this way but not enough to qualify.\n13. Selective Populism. \"There is in our future a TV or Internet populism, in which the emotional response of a selected group of citizens can be presented and accepted as the Voice of the People.” This is probably the one area that is keeping America from going completely fascist. What we have is a heavily divided country, divided even by what news sources we believe. Trump watches Fox News and reads Breitbart and trusts Alex Jones, and his \"populism\" belongs to those that do, too. Meanwhile, the other half of the country see him as a gullible fool.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trump and the alt-right have shown 11 out of 14 of these. The three they are missing:\n9. Pacifism is trafficking with the enemy. This is only not evident because we are currently not at war. Opposition to Trump&amp;#39;s attack on Syria came from both the Right and Left.\n11. Everybody is educated to become a hero, with emphasis on a heroic death. Radical Islam is the best example of this one. Conservative mythology about a &amp;quot;good guy with a gun&amp;quot; leans this way but not enough to qualify.\n13. Selective Populism. &amp;quot;There is in our future a TV or Internet populism, in which the emotional response of a selected group of citizens can be presented and accepted as the Voice of the People.” This is probably the one area that is keeping America from going completely fascist. What we have is a heavily divided country, divided even by what news sources we believe. Trump watches Fox News and reads Breitbart and trusts Alex Jones, and his &amp;quot;populism&amp;quot; belongs to those that do, too. Meanwhile, the other half of the country see him as a gullible fool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg642u7", "score_hidden": false, "stickied": false, "created": 1492043310.0, "created_utc": 1492014510.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6gvmr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6ghg4", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Anything that helps me avoid doing work ; )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anything that helps me avoid doing work ; )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6gvmr", "score_hidden": false, "stickied": false, "created": 1492056412.0, "created_utc": 1492027612.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ghg4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bluegutsoup", "parent_id": "t1_dg66y3n", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "This is fascinating. Thanks for taking the time to go this in depth, OP. You're the poster this sub needs", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is fascinating. Thanks for taking the time to go this in depth, OP. You&amp;#39;re the poster this sub needs&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6ghg4", "score_hidden": false, "stickied": false, "created": 1492056005.0, "created_utc": 1492027205.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66y3n", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg62m8o", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think all liberal democracies as we know them reject some or all of these points to varying degrees but I think they can also be somewhat lame ducks in how they respond to them as they appear.\n\nI'm showing my biases here likely but I have been paying attention to the territory of Rojava in norther Syria for a few years and I am interested in the ideology of their 'country', if it can be said to be such (there is no formal state to speak of, by design).\nI'm going to run through the 14 points and see how they relate to the Rojava project:\n\n\n1. Cult of tradition - I would say Rojava does not idealise it's tradition. The prominence of feminism and the abolition of Sharia law stand in stark contrast to the area's conservative Islamic and Patriarchal past.\n\n\n2. Rejection of modernism / enlightenment ideals - I would say again, they are against this as they see the [libertarian municipal](https://en.wikipedia.org/wiki/Libertarian_municipalism) ideology as the method to fulfill Enlightenment concepts such as equality, fraternity through collectives and direct democracy and liberty through the absence of a centralised government.\n\n3. Irrationalism - Given that the Rojava paradigm was formed through self-criticism of the perceived failure of Marxism-Leninism, I think the opposite might be true, they are basing their revolution on analysis and theory first, although in some ways their hands are forced when it comes to action simply because they have to fight ISIS.\n\n4. Disagreement as treason - [TEVDEM](https://en.wikipedia.org/wiki/Movement_for_a_Democratic_Society) was designed to be inclusive of other political ideas even whilst the state is formed around the [Communalist](https://en.wikipedia.org/wiki/Communalism) ideal\n\n5. Fear of difference - The [Rojava constitution](https://en.wikipedia.org/wiki/Constitution_of_Rojava) enshrines the multiethnic/multicultural nature of the country,  much like their approach to political diversity.\n\n\n\n5. Appeal to a frustrated middle class suffering from debasement, political humiliation, difficult economic circumstances - Rojava probably doesn't fit the standard model for what imagine a society being based on, what little middle class they have at this point probably isn't doing too well given the war. With that being said, the formation of the economy around cooperative economics may create a different structure from what we are used to in terms of working and middle classes. I think it will take more time to see how this plays out.\n\n6. Obsession with a plot, including both the appeal to xenophobia but also the appeal to an enemy from within, whether it is World Jewry or the concept of a New World Order. - Not sure whether this applies.\n\n7. Pushing the idea of the enemies enjoying some ostentatious wealth or great power, simultaneous with the idea the enemy is weak and can be overcome by force - You could make a tenuous argument that they do this with regard to capitalism but I'm not sure.\n\n8. Pacifism as trafficking with the enemy. - They're arguably guilty of this since there has been some conscription of peasants to fight in the militias against ISIS, however given the existential threat to the South it's difficult to come down on them too hard for this.\n\n9. Popular elitism, where the elite are those who are strong and the plebians are the weak. - Since Rojava is designed with egalitarianism in mind I don't think this applies.\n\n10. A hero cult where everyone is educated to become a hero, with emphasis on heroic death. - They are guilty of this, IMO, those who fall in battle against ISIS are viewed as martyrs etc. but then that is also true in our countries' conflicts to an extent.\n\n11. Machismo, contempt for women and nonstandard sexual habits - I don't know how LGBTQ people are treated in Rojava, but their [approach to feminism](https://www.independent.co.uk/news/world/middle-east/kurdish-woman-building-feminist-democrac-fighting-isis-at-the-same-time-syria-kurdistan-rojava-new-a7487151.html) is unique in the region. \n\n12. Selective populism, an appeal to the 'voice of the people' where the people are only a certain demographic. - Whilst Rojava rejects parliamentary democracy as we know it, I think in some ways the concept of confederation of small, direct democracies offers a less selective approach. It's populist in that direct democracy is valued above representation, but since decisions are made at the grassroots level it doesn't seem to take the same course as say, populism in the United States.\n\n13. Newspeak, a new sociolect which limits the capability for complex critical reasoning. - Within Communalist thought there's definitely been a creation of a new sociolect with a lot of borrowed terms from leftist theory and analysis generally but I don't believe this is designed to limit dissent as much as conceptualise certain ideas.\n\nJust to be clear I don't intend this to be convincing about Rojava, as I don't want to come across as writing a propaganda piece, and as you can probably tell I am sympathetic to the ideas Rojava is founded on, but I do think it is an interesting example of a society that is being built with anti-fascist ideas incorporated into it's structure, which is pretty interesting IMO.", "edited": 1492023800.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think all liberal democracies as we know them reject some or all of these points to varying degrees but I think they can also be somewhat lame ducks in how they respond to them as they appear.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m showing my biases here likely but I have been paying attention to the territory of Rojava in norther Syria for a few years and I am interested in the ideology of their &amp;#39;country&amp;#39;, if it can be said to be such (there is no formal state to speak of, by design).\nI&amp;#39;m going to run through the 14 points and see how they relate to the Rojava project:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Cult of tradition - I would say Rojava does not idealise it&amp;#39;s tradition. The prominence of feminism and the abolition of Sharia law stand in stark contrast to the area&amp;#39;s conservative Islamic and Patriarchal past.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Rejection of modernism / enlightenment ideals - I would say again, they are against this as they see the &lt;a href=\"https://en.wikipedia.org/wiki/Libertarian_municipalism\"&gt;libertarian municipal&lt;/a&gt; ideology as the method to fulfill Enlightenment concepts such as equality, fraternity through collectives and direct democracy and liberty through the absence of a centralised government.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Irrationalism - Given that the Rojava paradigm was formed through self-criticism of the perceived failure of Marxism-Leninism, I think the opposite might be true, they are basing their revolution on analysis and theory first, although in some ways their hands are forced when it comes to action simply because they have to fight ISIS.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Disagreement as treason - &lt;a href=\"https://en.wikipedia.org/wiki/Movement_for_a_Democratic_Society\"&gt;TEVDEM&lt;/a&gt; was designed to be inclusive of other political ideas even whilst the state is formed around the &lt;a href=\"https://en.wikipedia.org/wiki/Communalism\"&gt;Communalist&lt;/a&gt; ideal&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Fear of difference - The &lt;a href=\"https://en.wikipedia.org/wiki/Constitution_of_Rojava\"&gt;Rojava constitution&lt;/a&gt; enshrines the multiethnic/multicultural nature of the country,  much like their approach to political diversity.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Appeal to a frustrated middle class suffering from debasement, political humiliation, difficult economic circumstances - Rojava probably doesn&amp;#39;t fit the standard model for what imagine a society being based on, what little middle class they have at this point probably isn&amp;#39;t doing too well given the war. With that being said, the formation of the economy around cooperative economics may create a different structure from what we are used to in terms of working and middle classes. I think it will take more time to see how this plays out.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Obsession with a plot, including both the appeal to xenophobia but also the appeal to an enemy from within, whether it is World Jewry or the concept of a New World Order. - Not sure whether this applies.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Pushing the idea of the enemies enjoying some ostentatious wealth or great power, simultaneous with the idea the enemy is weak and can be overcome by force - You could make a tenuous argument that they do this with regard to capitalism but I&amp;#39;m not sure.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Pacifism as trafficking with the enemy. - They&amp;#39;re arguably guilty of this since there has been some conscription of peasants to fight in the militias against ISIS, however given the existential threat to the South it&amp;#39;s difficult to come down on them too hard for this.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Popular elitism, where the elite are those who are strong and the plebians are the weak. - Since Rojava is designed with egalitarianism in mind I don&amp;#39;t think this applies.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A hero cult where everyone is educated to become a hero, with emphasis on heroic death. - They are guilty of this, IMO, those who fall in battle against ISIS are viewed as martyrs etc. but then that is also true in our countries&amp;#39; conflicts to an extent.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Machismo, contempt for women and nonstandard sexual habits - I don&amp;#39;t know how LGBTQ people are treated in Rojava, but their &lt;a href=\"https://www.independent.co.uk/news/world/middle-east/kurdish-woman-building-feminist-democrac-fighting-isis-at-the-same-time-syria-kurdistan-rojava-new-a7487151.html\"&gt;approach to feminism&lt;/a&gt; is unique in the region. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Selective populism, an appeal to the &amp;#39;voice of the people&amp;#39; where the people are only a certain demographic. - Whilst Rojava rejects parliamentary democracy as we know it, I think in some ways the concept of confederation of small, direct democracies offers a less selective approach. It&amp;#39;s populist in that direct democracy is valued above representation, but since decisions are made at the grassroots level it doesn&amp;#39;t seem to take the same course as say, populism in the United States.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Newspeak, a new sociolect which limits the capability for complex critical reasoning. - Within Communalist thought there&amp;#39;s definitely been a creation of a new sociolect with a lot of borrowed terms from leftist theory and analysis generally but I don&amp;#39;t believe this is designed to limit dissent as much as conceptualise certain ideas.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Just to be clear I don&amp;#39;t intend this to be convincing about Rojava, as I don&amp;#39;t want to come across as writing a propaganda piece, and as you can probably tell I am sympathetic to the ideas Rojava is founded on, but I do think it is an interesting example of a society that is being built with anti-fascist ideas incorporated into it&amp;#39;s structure, which is pretty interesting IMO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg66y3n", "score_hidden": false, "stickied": false, "created": 1492046266.0, "created_utc": 1492017466.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg67n8c", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "arianeb", "parent_id": "t1_dg62m8o", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Sweden, Norway, Denmark, Canada, Australia, Switzerland, others less so.\nTake Sweden for example. The country is nearly religion free by choice, so they fail #1, they embrace modernism and enlightenment ideals so they fail #2, they are strong on science and technological innovation failing #3. You will likely not see many of the others either in Sweden.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sweden, Norway, Denmark, Canada, Australia, Switzerland, others less so.\nTake Sweden for example. The country is nearly religion free by choice, so they fail #1, they embrace modernism and enlightenment ideals so they fail #2, they are strong on science and technological innovation failing #3. You will likely not see many of the others either in Sweden.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg67n8c", "score_hidden": false, "stickied": false, "created": 1492046960.0, "created_utc": 1492018160.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6c3dx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "moonmixer", "parent_id": "t1_dg62m8o", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think a lot of Western and Northern European countries are harder to draw parallels to, even the US would have been more difficult to draw parallels to 20 years ago.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of Western and Northern European countries are harder to draw parallels to, even the US would have been more difficult to draw parallels to 20 years ago.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6c3dx", "score_hidden": false, "stickied": false, "created": 1492051482.0, "created_utc": 1492022682.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg63tgq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sfw16", "parent_id": "t1_dg62m8o", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Canada? Outside of maybe elitism and selective populism. I'm not Canadian though and don't have the whole picture. Maybe Iceland?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Canada? Outside of maybe elitism and selective populism. I&amp;#39;m not Canadian though and don&amp;#39;t have the whole picture. Maybe Iceland?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg63tgq", "score_hidden": false, "stickied": false, "created": 1492043038.0, "created_utc": 1492014238.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62m8o", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Bahatur", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Drawing parallels to the current environment is easy.\n\nA better question is, are there any administrations or states where drawing parallels is at least difficult? What do they look like?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Drawing parallels to the current environment is easy.&lt;/p&gt;\n\n&lt;p&gt;A better question is, are there any administrations or states where drawing parallels is at least difficult? What do they look like?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg62m8o", "score_hidden": false, "stickied": false, "created": 1492041754.0, "created_utc": 1492012954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6dihr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skilless", "parent_id": "t1_dg6882x", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Keep in mind that \"cult of tradition\" varies from place to place\n\nA fair point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Keep in mind that &amp;quot;cult of tradition&amp;quot; varies from place to place&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A fair point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6dihr", "score_hidden": false, "stickied": false, "created": 1492052963.0, "created_utc": 1492024163.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6882x", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "arianeb", "parent_id": "t1_dg633vk", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Keep in mind that \"cult of tradition\" varies from place to place. Cult of Tradition in America is very Christian oriented, a desire to turn back the clock to the 1950's or 1890's depending on who you ask. This is why Fascism in America will \"Carry a Bible and be wrapped in the flag\".\n\nI basically consider ISIS to be a fascist state, in fact they hit all 14 points. Of course their \"cult of tradition\" is based on Islam.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep in mind that &amp;quot;cult of tradition&amp;quot; varies from place to place. Cult of Tradition in America is very Christian oriented, a desire to turn back the clock to the 1950&amp;#39;s or 1890&amp;#39;s depending on who you ask. This is why Fascism in America will &amp;quot;Carry a Bible and be wrapped in the flag&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I basically consider ISIS to be a fascist state, in fact they hit all 14 points. Of course their &amp;quot;cult of tradition&amp;quot; is based on Islam.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6882x", "score_hidden": false, "stickied": false, "created": 1492047541.0, "created_utc": 1492018741.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg640a6", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg633vk", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think this is a bit reductive, its important to take the Nazi's 'pro-christian' stance in context - whilst you are right, it is true they did adopt Positive Christianity, they were marketing their ideology to a nation that was overwhelmingly Christian, being outright anticlerical would have limited their party's popularity. \n\nBear in mind that the Nazis also wanted to [make agreements with the Catholic Church](https://en.wikipedia.org/wiki/Reichskonkordat) as part of their consolidation of power.\n\nTheres a good [wiki article](https://en.wikipedia.org/wiki/Religion_in_Nazi_Germany) about religion in Nazi Germany, the persecution of Christians, general antichristian sentiment etc.\n\nIt's also worth noting Positive Christianity was a major deviation from Christianity as we know it. The Old Testament was thrown out and the Biblical narrative altered to create a story of struggle against Jews.\n\nI see Hitler's references to god in much the same light as Mussolini's, as mentioned later in the article. Initially anticlerical, god and christianity were appropriated where it was convenient to win people over, as rhetorical devices.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is a bit reductive, its important to take the Nazi&amp;#39;s &amp;#39;pro-christian&amp;#39; stance in context - whilst you are right, it is true they did adopt Positive Christianity, they were marketing their ideology to a nation that was overwhelmingly Christian, being outright anticlerical would have limited their party&amp;#39;s popularity. &lt;/p&gt;\n\n&lt;p&gt;Bear in mind that the Nazis also wanted to &lt;a href=\"https://en.wikipedia.org/wiki/Reichskonkordat\"&gt;make agreements with the Catholic Church&lt;/a&gt; as part of their consolidation of power.&lt;/p&gt;\n\n&lt;p&gt;Theres a good &lt;a href=\"https://en.wikipedia.org/wiki/Religion_in_Nazi_Germany\"&gt;wiki article&lt;/a&gt; about religion in Nazi Germany, the persecution of Christians, general antichristian sentiment etc.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also worth noting Positive Christianity was a major deviation from Christianity as we know it. The Old Testament was thrown out and the Biblical narrative altered to create a story of struggle against Jews.&lt;/p&gt;\n\n&lt;p&gt;I see Hitler&amp;#39;s references to god in much the same light as Mussolini&amp;#39;s, as mentioned later in the article. Initially anticlerical, god and christianity were appropriated where it was convenient to win people over, as rhetorical devices.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg640a6", "score_hidden": false, "stickied": false, "created": 1492043236.0, "created_utc": 1492014436.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6qmc6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hegbork", "parent_id": "t1_dg633vk", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; In the context of an article such as this, which aims to make comparisons to modern politicians\n\nWhere did you find the comparisons to modern politicians? Also, define \"modern\" since this was published 22 years ago. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In the context of an article such as this, which aims to make comparisons to modern politicians&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Where did you find the comparisons to modern politicians? Also, define &amp;quot;modern&amp;quot; since this was published 22 years ago. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6qmc6", "score_hidden": false, "stickied": false, "created": 1492067723.0, "created_utc": 1492038923.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg633vk", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "skilless", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "&gt; Nazism was decidedly anti-Christian and neo-pagan\n\nI'm surprised this idea perseveres despite [Positive Christianity](https://en.wikipedia.org/wiki/Positive_Christianity), Hitler's frequent mentioning of God, and the Nazis following \"the will of the Almighty Creator\". The \"pagan\" conclusion seems to be that despite the rhetoric, the Nazis planned to end religion within the reich if they were victorious.\n\nHowever, that never happened and we can only speculate. In the context of an article such as this, which aims to make comparisons to modern politicians, the true comparison would be vocally _pro_ Christianity and religion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Nazism was decidedly anti-Christian and neo-pagan&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m surprised this idea perseveres despite &lt;a href=\"https://en.wikipedia.org/wiki/Positive_Christianity\"&gt;Positive Christianity&lt;/a&gt;, Hitler&amp;#39;s frequent mentioning of God, and the Nazis following &amp;quot;the will of the Almighty Creator&amp;quot;. The &amp;quot;pagan&amp;quot; conclusion seems to be that despite the rhetoric, the Nazis planned to end religion within the reich if they were victorious.&lt;/p&gt;\n\n&lt;p&gt;However, that never happened and we can only speculate. In the context of an article such as this, which aims to make comparisons to modern politicians, the true comparison would be vocally &lt;em&gt;pro&lt;/em&gt; Christianity and religion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg633vk", "score_hidden": false, "stickied": false, "created": 1492042285.0, "created_utc": 1492013485.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg5x8bn", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Don_John", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Thank you for posting this, this was an excellent read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting this, this was an excellent read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg5x8bn", "score_hidden": false, "stickied": false, "created": 1492035718.0, "created_utc": 1492006918.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg65xbw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "klarth", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I've always found this essay to be a damn near perfect lens for analysis of reactionary thought, and it's amazing how relevant it continues to be. The core ideology of so much of the current diaspora of anti-progressive causes is succinctly described in points 7 and 8 in particular.\n\nSee \"college students are oversensitive snowflakes who cower in the face of adversity\"/\"college students are thugs who don't hesitate to use force to suppress those they disagree with\". Or \"our society's championing of free enterprise means we live in a perfectly fair meritocracy, and therefore wealthy people have accumulated their wealth justly\"/\"financially successful minorities must have somehow gamed the system to achieve their success, and the rules of the meritocracy must be altered to prevent such anticompetitive behaviour\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always found this essay to be a damn near perfect lens for analysis of reactionary thought, and it&amp;#39;s amazing how relevant it continues to be. The core ideology of so much of the current diaspora of anti-progressive causes is succinctly described in points 7 and 8 in particular.&lt;/p&gt;\n\n&lt;p&gt;See &amp;quot;college students are oversensitive snowflakes who cower in the face of adversity&amp;quot;/&amp;quot;college students are thugs who don&amp;#39;t hesitate to use force to suppress those they disagree with&amp;quot;. Or &amp;quot;our society&amp;#39;s championing of free enterprise means we live in a perfectly fair meritocracy, and therefore wealthy people have accumulated their wealth justly&amp;quot;/&amp;quot;financially successful minorities must have somehow gamed the system to achieve their success, and the rules of the meritocracy must be altered to prevent such anticompetitive behaviour&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg65xbw", "score_hidden": false, "stickied": false, "created": 1492045225.0, "created_utc": 1492016425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6gla5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ravia", "parent_id": "t1_dg6gf0c", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I bad at that but I may try.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bad at that but I may try.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6gla5", "score_hidden": false, "stickied": false, "created": 1492056114.0, "created_utc": 1492027314.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gf0c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6g0rf", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "That's interesting, thanks for bringing it to my attention, definitely something to consider. Have you thought of writing anything about it? It seems like it might be worth introducing the idea to a more broad audience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s interesting, thanks for bringing it to my attention, definitely something to consider. Have you thought of writing anything about it? It seems like it might be worth introducing the idea to a more broad audience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6gf0c", "score_hidden": false, "stickied": false, "created": 1492055934.0, "created_utc": 1492027134.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6g0rf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ravia", "parent_id": "t1_dg6e0sv", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Yes. You're calling it \"problem area\". Where is a matter of rhetoric can be explored, as can everything else involved, and how that gets gone over and the terms one establishes is important and affects things. But you're getting the idea, it seems to me. I have a few terms I prefer. But what's interesting and deeply connected to the overall problematic here is that most people actually are not interested in this, even people who oppose someone like Trump or Bush. And that's one of the main problems we deal with today, I think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. You&amp;#39;re calling it &amp;quot;problem area&amp;quot;. Where is a matter of rhetoric can be explored, as can everything else involved, and how that gets gone over and the terms one establishes is important and affects things. But you&amp;#39;re getting the idea, it seems to me. I have a few terms I prefer. But what&amp;#39;s interesting and deeply connected to the overall problematic here is that most people actually are not interested in this, even people who oppose someone like Trump or Bush. And that&amp;#39;s one of the main problems we deal with today, I think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6g0rf", "score_hidden": false, "stickied": false, "created": 1492055533.0, "created_utc": 1492026733.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e0sv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6dlx5", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "So, if I understand you right, first he rhetorically creates a problem area in the public conception and then invents a solution to fit the concept of a problem he has created?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, if I understand you right, first he rhetorically creates a problem area in the public conception and then invents a solution to fit the concept of a problem he has created?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6e0sv", "score_hidden": false, "stickied": false, "created": 1492053482.0, "created_utc": 1492024682.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dlx5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ravia", "parent_id": "t1_dg6dgv3", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "No. And that's part of my point. I'll talk to you about how I think of it, however, as I think it is very much needed concept. Consider Trumps wall. He imposes an arena *within which* the wall operates as the \"big pragmatic solution Pragmatism Man comes up with\", saving the world from those bad hombres. The problem is not just the wall, but that the whole arena is imposed, and then the \"within which\" takes place, and we don't have the conceptual architecture to deal with what is taking place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. And that&amp;#39;s part of my point. I&amp;#39;ll talk to you about how I think of it, however, as I think it is very much needed concept. Consider Trumps wall. He imposes an arena &lt;em&gt;within which&lt;/em&gt; the wall operates as the &amp;quot;big pragmatic solution Pragmatism Man comes up with&amp;quot;, saving the world from those bad hombres. The problem is not just the wall, but that the whole arena is imposed, and then the &amp;quot;within which&amp;quot; takes place, and we don&amp;#39;t have the conceptual architecture to deal with what is taking place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6dlx5", "score_hidden": false, "stickied": false, "created": 1492053063.0, "created_utc": 1492024263.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dgv3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg6bzs8", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Do you know anywhere I could read more about arena imposition? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you know anywhere I could read more about arena imposition? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6dgv3", "score_hidden": false, "stickied": false, "created": 1492052915.0, "created_utc": 1492024115.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bzs8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ravia", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Great stuff, no doubt, but the thing to watch out for is letting it sum up the conditions. For example, a strong factor is what might be called \"arena imposition\", and that's not on this seemingly comprehensive list. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great stuff, no doubt, but the thing to watch out for is letting it sum up the conditions. For example, a strong factor is what might be called &amp;quot;arena imposition&amp;quot;, and that&amp;#39;s not on this seemingly comprehensive list. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6bzs8", "score_hidden": false, "stickied": false, "created": 1492051381.0, "created_utc": 1492022581.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6q4c5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nuotnik", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "[This was on the front page of Hacker News in July 2016, and some decent discussion resulted](https://news.ycombinator.com/item?id=12173823)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://news.ycombinator.com/item?id=12173823\"&gt;This was on the front page of Hacker News in July 2016, and some decent discussion resulted&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6q4c5", "score_hidden": false, "stickied": false, "created": 1492067094.0, "created_utc": 1492038294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6107z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnthraxCat", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "I pretty much have this in my bookmark bar. So useful and clever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I pretty much have this in my bookmark bar. So useful and clever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6107z", "score_hidden": false, "stickied": false, "created": 1492039996.0, "created_utc": 1492011196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_64xsbs", "likes": null, "replies": "", "user_reports": [], "id": "dg6l9kz", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "Doctor_Crumb", "parent_id": "t3_64xsbs", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": " Came here expecting more of Reddit's new racist and fascist apologetics. Not disappointed. \n\nChrist some of you people are fucked up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Came here expecting more of Reddit&amp;#39;s new racist and fascist apologetics. Not disappointed. &lt;/p&gt;\n\n&lt;p&gt;Christ some of you people are fucked up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg6l9kz", "score_hidden": false, "stickied": false, "created": 1492061145.0, "created_utc": 1492032345.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}]