[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "654jr2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 149, "report_reasons": null, "author": "frasiera", "saved": false, "mod_reports": [], "name": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "approved_by": null, "over_18": false, "domain": "theguardian.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qyt6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/TrueReddit/comments/654jr2/who_are_the_new_jihadis_biographies_of_homegrown/", "num_reports": null, "locked": false, "stickied": false, "created": 1492106431.0, "url": "https://www.theguardian.com/news/2017/apr/13/who-are-the-new-jihadis", "author_flair_text": null, "quarantine": false, "title": "Who are the new jihadis? Biographies of ‘homegrown’ European terrorists show they are violent nihilists who adopt Islam, rather than religious fundamentalists who turn to violence", "created_utc": 1492077631.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 28, "visited": false, "subreddit_type": "public", "ups": 149}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dg8s6z7", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "drdgaf", "parent_id": "t1_dg7vkxf", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "So if you're saying we didn't have Muslim youth, we wouldn't have this terrorism issue. I agree. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So if you&amp;#39;re saying we didn&amp;#39;t have Muslim youth, we wouldn&amp;#39;t have this terrorism issue. I agree. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg8s6z7", "score_hidden": false, "stickied": false, "created": 1492174520.0, "created_utc": 1492145720.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vkxf", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "KaliYugaz", "parent_id": "t1_dg7g8pq", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "No, it's precisely the point that the author was making. Most homegrown jihadists are simply former violent nihilists who, one day, experience an \"early 20s crisis\" (often triggered by imprisonment) and get tired of nihilism. Then they search around for a coherent, meaningful ideology that can justify and give direction to their violent desires, which if they are youths from Muslim families generally ends up being radical Islamism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, it&amp;#39;s precisely the point that the author was making. Most homegrown jihadists are simply former violent nihilists who, one day, experience an &amp;quot;early 20s crisis&amp;quot; (often triggered by imprisonment) and get tired of nihilism. Then they search around for a coherent, meaningful ideology that can justify and give direction to their violent desires, which if they are youths from Muslim families generally ends up being radical Islamism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7vkxf", "score_hidden": false, "stickied": false, "created": 1492132672.0, "created_utc": 1492103872.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lwea", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Exoslovakia", "parent_id": "t1_dg88un8", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "I'm not so sure if the liberalization caused the atheism, or if the atheism caused the liberalization.  It may very well be bi-directional in causality.  The Holocaust certainly caused a rise in Jewish atheism for obvious reasons, so liberal interpretations weren't much of a contributor in that case.  \n\nIslam's source material repetitively emphasizes ideas like disbelievers are evil, liars, mischief makers, and deserving of eternal torture in hell.  I'm sure you may be able to find some Muslims with sufficient skill in mental gymnastics to evade internalizing blatant hatred like that, but polls show that significant amounts of Muslims hold extremely backwards and intolerant beliefs.  Islam is particularly problematic as a religion.\n\nYou come across as an apologist for Islam when discounting the oppression and extermination of polytheists from the Arabian peninsula.  Mohammad and his followers were allowed to live in Mecca for years, then he became an increasingly powerful agitator denouncing the gods of the Kaaba which formed the core of Mecca's pilgrimage economy.  Jews also had long lived in Arabia before the rise of Islam, so I doubt that it was such a hostile environment to justify their complete eradication.\n\nThe Quran allows for having sex with your slaves in Sura 23 and the Hadiths go into much further detail on how Mohammad practiced slavery.\n\nLimiting Muslim migration is the most pragmatic policy I see.  In Europe's case particularly, there is little need for Muslim migration as they are mostly unskilled and poorly educated in an economic environment where low skilled human labor is becoming increasingly unnecessary due to the rise of automation.  Europe also has serious youth unemployment problems, which a huge influx of unskilled migrants will only exacerbate.  Trying to fix such a deeply flawed religion will take generations and may not even be successful if recent polls of young British Muslims rising support for Sharia are to be believed.  To bring in so many Muslims really smacks of naivete.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not so sure if the liberalization caused the atheism, or if the atheism caused the liberalization.  It may very well be bi-directional in causality.  The Holocaust certainly caused a rise in Jewish atheism for obvious reasons, so liberal interpretations weren&amp;#39;t much of a contributor in that case.  &lt;/p&gt;\n\n&lt;p&gt;Islam&amp;#39;s source material repetitively emphasizes ideas like disbelievers are evil, liars, mischief makers, and deserving of eternal torture in hell.  I&amp;#39;m sure you may be able to find some Muslims with sufficient skill in mental gymnastics to evade internalizing blatant hatred like that, but polls show that significant amounts of Muslims hold extremely backwards and intolerant beliefs.  Islam is particularly problematic as a religion.&lt;/p&gt;\n\n&lt;p&gt;You come across as an apologist for Islam when discounting the oppression and extermination of polytheists from the Arabian peninsula.  Mohammad and his followers were allowed to live in Mecca for years, then he became an increasingly powerful agitator denouncing the gods of the Kaaba which formed the core of Mecca&amp;#39;s pilgrimage economy.  Jews also had long lived in Arabia before the rise of Islam, so I doubt that it was such a hostile environment to justify their complete eradication.&lt;/p&gt;\n\n&lt;p&gt;The Quran allows for having sex with your slaves in Sura 23 and the Hadiths go into much further detail on how Mohammad practiced slavery.&lt;/p&gt;\n\n&lt;p&gt;Limiting Muslim migration is the most pragmatic policy I see.  In Europe&amp;#39;s case particularly, there is little need for Muslim migration as they are mostly unskilled and poorly educated in an economic environment where low skilled human labor is becoming increasingly unnecessary due to the rise of automation.  Europe also has serious youth unemployment problems, which a huge influx of unskilled migrants will only exacerbate.  Trying to fix such a deeply flawed religion will take generations and may not even be successful if recent polls of young British Muslims rising support for Sharia are to be believed.  To bring in so many Muslims really smacks of naivete.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg8lwea", "score_hidden": false, "stickied": false, "created": 1492164639.0, "created_utc": 1492135839.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88un8", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg86el1", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "But the prevalence of atheism in Judaism is related to the liberalisation of the religion and the increasingly tolerant attitude towards other beliefs or lack thereof that went with that. \n\nWhat you mention about revision ignores the longstanding tradition of scholarly interpretation of the texts. It's difficult to find consensus on many issues across the board in Islam, which makes me extremely sceptical of the narrative being created around certain ideas being a) encoded into the religion and b) that they're held across the board by all muslims as a result.\n\nFraming the way Islam was established as a simple genocide of polytheists doesn't really take into account the historical reality, Islam faced violent opposition at its conception which it overcame through warfare. Slavery was already common in the region, [Islam introduced ideas about slavery that didn't exist before](https://en.wikipedia.org/wiki/Islamic_views_on_slavery) such as making prostitution of slaves illegal and so on. There is no consensus that slavery is acceptable in Islam. You're glossing over a lot of historical reality here.\n\nThe reason Sufis are a small percentage of Muslims is a lot more complicated than how you're explaining it also. Their numbers weren't just restricted because the Quran is not amenable to them. There have been sociopoliticial and geographic factors (such as their opposition to the Turkish and Iranian power structures) that have led to their marginalisation etc.\n\nYou're also not addressing the politically motivated spread of radical ideas in Islam that I brought up.\n\nI really dislike this reductionist view on a complex issue. You say we need to limit the number of Muslims in the west but it's almost like you started from this conclusion then constructed the reasoning to fit it by taking a fairly non-nuanced look at Islam.\n\nI think there are serious issues with the authoritarian, conservative, anti-feminist, right-wing elements in Islam (and many other cultures), but their appearance and prominence is a complex issue we should attempt to actually understand, and to come up with a solution that benefits the world I can't help but think this 'keep the moslems out' attitude is just lazy. ", "edited": 1492118879.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But the prevalence of atheism in Judaism is related to the liberalisation of the religion and the increasingly tolerant attitude towards other beliefs or lack thereof that went with that. &lt;/p&gt;\n\n&lt;p&gt;What you mention about revision ignores the longstanding tradition of scholarly interpretation of the texts. It&amp;#39;s difficult to find consensus on many issues across the board in Islam, which makes me extremely sceptical of the narrative being created around certain ideas being a) encoded into the religion and b) that they&amp;#39;re held across the board by all muslims as a result.&lt;/p&gt;\n\n&lt;p&gt;Framing the way Islam was established as a simple genocide of polytheists doesn&amp;#39;t really take into account the historical reality, Islam faced violent opposition at its conception which it overcame through warfare. Slavery was already common in the region, &lt;a href=\"https://en.wikipedia.org/wiki/Islamic_views_on_slavery\"&gt;Islam introduced ideas about slavery that didn&amp;#39;t exist before&lt;/a&gt; such as making prostitution of slaves illegal and so on. There is no consensus that slavery is acceptable in Islam. You&amp;#39;re glossing over a lot of historical reality here.&lt;/p&gt;\n\n&lt;p&gt;The reason Sufis are a small percentage of Muslims is a lot more complicated than how you&amp;#39;re explaining it also. Their numbers weren&amp;#39;t just restricted because the Quran is not amenable to them. There have been sociopoliticial and geographic factors (such as their opposition to the Turkish and Iranian power structures) that have led to their marginalisation etc.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re also not addressing the politically motivated spread of radical ideas in Islam that I brought up.&lt;/p&gt;\n\n&lt;p&gt;I really dislike this reductionist view on a complex issue. You say we need to limit the number of Muslims in the west but it&amp;#39;s almost like you started from this conclusion then constructed the reasoning to fit it by taking a fairly non-nuanced look at Islam.&lt;/p&gt;\n\n&lt;p&gt;I think there are serious issues with the authoritarian, conservative, anti-feminist, right-wing elements in Islam (and many other cultures), but their appearance and prominence is a complex issue we should attempt to actually understand, and to come up with a solution that benefits the world I can&amp;#39;t help but think this &amp;#39;keep the moslems out&amp;#39; attitude is just lazy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg88un8", "score_hidden": false, "stickied": false, "created": 1492147188.0, "created_utc": 1492118388.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86el1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Exoslovakia", "parent_id": "t1_dg84cc2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Judaism also has some of the highest rates of atheism of any ethno-religious group.  Roughly half of American Jews have doubts about the existence of god.  Many Jews cannot ethically defend the Old Testament or believe in a caring god, especially after the Holocaust.  As a result, few take it seriously and it becomes increasingly 'liberal.'\n\nThe tradition of warfare and the many acts of violence committed by Mohammad make it very difficult for Islam to liberalize.  Mohammad is considered the most ideal man, yet he waged many campaigns of warfare, eliminated nearly all the polytheists from Arabia, took slaves, and gifted sex slaves to his commanders.  Needless to say, this sets a bad example.\n\nThe Quran repeats again and again that it is the final word of god and any revisions are false.  It speaks harshly of possible later prophets and of Muslims who are not devout enough.  This makes reform extremely difficult.  The Quran is also not very amenable to Sufism, with their beliefs contradicting scripture at many points.  As a result, Sufis are a small percentage of Muslims in the world.  \n\nI certainly hope it's possible to liberalize Islam.  But I seriously doubt this project will make meaningful progress in our lifetimes.  Preventing the problem in the first place by limiting the number of Muslims in the western world and encouraging a form of secular humanism / atheism among Muslims who are already here would be my preferred strategy.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Judaism also has some of the highest rates of atheism of any ethno-religious group.  Roughly half of American Jews have doubts about the existence of god.  Many Jews cannot ethically defend the Old Testament or believe in a caring god, especially after the Holocaust.  As a result, few take it seriously and it becomes increasingly &amp;#39;liberal.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;The tradition of warfare and the many acts of violence committed by Mohammad make it very difficult for Islam to liberalize.  Mohammad is considered the most ideal man, yet he waged many campaigns of warfare, eliminated nearly all the polytheists from Arabia, took slaves, and gifted sex slaves to his commanders.  Needless to say, this sets a bad example.&lt;/p&gt;\n\n&lt;p&gt;The Quran repeats again and again that it is the final word of god and any revisions are false.  It speaks harshly of possible later prophets and of Muslims who are not devout enough.  This makes reform extremely difficult.  The Quran is also not very amenable to Sufism, with their beliefs contradicting scripture at many points.  As a result, Sufis are a small percentage of Muslims in the world.  &lt;/p&gt;\n\n&lt;p&gt;I certainly hope it&amp;#39;s possible to liberalize Islam.  But I seriously doubt this project will make meaningful progress in our lifetimes.  Preventing the problem in the first place by limiting the number of Muslims in the western world and encouraging a form of secular humanism / atheism among Muslims who are already here would be my preferred strategy.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg86el1", "score_hidden": false, "stickied": false, "created": 1492144348.0, "created_utc": 1492115548.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84cc2", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg7zv5u", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Yes but this is a common thread in both the Quran and the OT. I'm not sure why people find the idea of liberalisation within a religion to be impossible, it's precisely what happened to Judaism. \n\n&gt;There's a difference between committing suicide because you're sick of life and sacrificing yourself in the wider cause of jihad. The Quran commands Muslims to fight for the faith, and many are expected to die in the process, so suicide missions are not dissimilar.\n\nIn your interpretation, sure, [but this is actually an area Islamic scholars have investigated](https://en.wikipedia.org/wiki/Istishhad#Against_suicide_attacks). The narrative that these ideas are simply encoded in the religion is false. There are differing interpretations of Islam. The mainstream of Islam hasn't accepted the validity of this position. To me it seems likely that given the foundation of Islam took place in a hostile environment, the violence in the tradition is not exactly unexpected. For example the execution of the Jewish prisoners at the [Battle of the Trench](https://en.wikipedia.org/wiki/Battle_of_the_Trench) at Medina was related to their betrayal of the besieged muslims inside the city.\n\nThe relevance of these traditions has, or should, decrease today in a society where they do not need to fight to exist or teach their ideas.\n\n What would be mutually beneficial for us all is if the mainstream of Islam [adopts positions regarding Islamic texts](https://en.wikipedia.org/wiki/Liberal_and_progressive_Muslim_movements) which do not emphasise the parts incompatible with modern society. Again this is the same process that has happened in Judaism. How can this happen if people act like there is only one school of thought? Unless people want to adopt some clash of civilisations narrative this is the only actual pathway to cooperation.\n\nThe most radical, puritanical schools of thought in Islam have been progressively [encouraged and spread by KSA](https://www.nytimes.com/2016/08/26/world/middleeast/saudi-arabia-islam.html?_r=0) throughout the latter half of the 20th century, apparently with the blessing of the West. Now the fruits of this are ripening we're supposed to forget that and just say ok, Islam's just backwards and so on? \n\n&gt; This is why it's easy for Muslims to justify killing civilians or other minority sects like Shias, Sufis, etc\n\nThis seems incoherent to me. First you begin by generalising muslims, then you give examples of other interpretations of Islam. Sufism is an example of a school of Islam with a much less radical approach. Do they only exist when it's convenient or what?\n\n", "edited": 1492113943.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes but this is a common thread in both the Quran and the OT. I&amp;#39;m not sure why people find the idea of liberalisation within a religion to be impossible, it&amp;#39;s precisely what happened to Judaism. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There&amp;#39;s a difference between committing suicide because you&amp;#39;re sick of life and sacrificing yourself in the wider cause of jihad. The Quran commands Muslims to fight for the faith, and many are expected to die in the process, so suicide missions are not dissimilar.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In your interpretation, sure, &lt;a href=\"https://en.wikipedia.org/wiki/Istishhad#Against_suicide_attacks\"&gt;but this is actually an area Islamic scholars have investigated&lt;/a&gt;. The narrative that these ideas are simply encoded in the religion is false. There are differing interpretations of Islam. The mainstream of Islam hasn&amp;#39;t accepted the validity of this position. To me it seems likely that given the foundation of Islam took place in a hostile environment, the violence in the tradition is not exactly unexpected. For example the execution of the Jewish prisoners at the &lt;a href=\"https://en.wikipedia.org/wiki/Battle_of_the_Trench\"&gt;Battle of the Trench&lt;/a&gt; at Medina was related to their betrayal of the besieged muslims inside the city.&lt;/p&gt;\n\n&lt;p&gt;The relevance of these traditions has, or should, decrease today in a society where they do not need to fight to exist or teach their ideas.&lt;/p&gt;\n\n&lt;p&gt;What would be mutually beneficial for us all is if the mainstream of Islam &lt;a href=\"https://en.wikipedia.org/wiki/Liberal_and_progressive_Muslim_movements\"&gt;adopts positions regarding Islamic texts&lt;/a&gt; which do not emphasise the parts incompatible with modern society. Again this is the same process that has happened in Judaism. How can this happen if people act like there is only one school of thought? Unless people want to adopt some clash of civilisations narrative this is the only actual pathway to cooperation.&lt;/p&gt;\n\n&lt;p&gt;The most radical, puritanical schools of thought in Islam have been progressively &lt;a href=\"https://www.nytimes.com/2016/08/26/world/middleeast/saudi-arabia-islam.html?_r=0\"&gt;encouraged and spread by KSA&lt;/a&gt; throughout the latter half of the 20th century, apparently with the blessing of the West. Now the fruits of this are ripening we&amp;#39;re supposed to forget that and just say ok, Islam&amp;#39;s just backwards and so on? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This is why it&amp;#39;s easy for Muslims to justify killing civilians or other minority sects like Shias, Sufis, etc&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This seems incoherent to me. First you begin by generalising muslims, then you give examples of other interpretations of Islam. Sufism is an example of a school of Islam with a much less radical approach. Do they only exist when it&amp;#39;s convenient or what?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg84cc2", "score_hidden": false, "stickied": false, "created": 1492142071.0, "created_utc": 1492113271.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7zv5u", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Exoslovakia", "parent_id": "t1_dg7hgbj", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "There's a difference between committing suicide because you're sick of life and sacrificing yourself in the wider cause of jihad.  The Quran commands Muslims to fight for the faith, and many are expected to die in the process, so suicide missions are not dissimilar.  \n\nIf you're going to refer to the early traditions of Islam, Mohammad led multiple raids on caravans, ordered the killings of entire Jewish villages, took sex slaves, and waged military campaigns until his death.  The Quran is also extremely harsh on hypocrites, Muslims who do not believe the correct things and simply go through the motions.  This is why it's easy for Muslims to justify killing civilians or other minority sects like Shias, Sufis, etc.  ISIS is very much 'going back to their roots' in behaving the way they do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a difference between committing suicide because you&amp;#39;re sick of life and sacrificing yourself in the wider cause of jihad.  The Quran commands Muslims to fight for the faith, and many are expected to die in the process, so suicide missions are not dissimilar.  &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re going to refer to the early traditions of Islam, Mohammad led multiple raids on caravans, ordered the killings of entire Jewish villages, took sex slaves, and waged military campaigns until his death.  The Quran is also extremely harsh on hypocrites, Muslims who do not believe the correct things and simply go through the motions.  This is why it&amp;#39;s easy for Muslims to justify killing civilians or other minority sects like Shias, Sufis, etc.  ISIS is very much &amp;#39;going back to their roots&amp;#39; in behaving the way they do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7zv5u", "score_hidden": false, "stickied": false, "created": 1492137220.0, "created_utc": 1492108420.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7hgbj", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg7gsa5", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I've talked about this before and I'm becoming convinced people who make this counterargument don't understand no true scotsman. The fallacy is predicated on the *a posteriori* redefinition of the category:\n\n&gt;Imagine Hamish McDonald, a Scotsman, sitting down with his Glasgow Morning Herald and seeing an article about how the \"Brighton Sex Maniac Strikes Again\". Hamish is shocked and declares that \"No Scotsman would do such a thing.\" The next day he sits down to read his Glasgow Morning Herald again; and, this time, finds an article about an Aberdeen man whose brutal actions make the Brighton sex maniac seem almost gentlemanly. This fact shows that Hamish was wrong in his opinion, but is he going to admit this? Not likely. This time he says: \"No true Scotsman would do such a thing.\"\n\n\nIf you don't think actions like suicide are compatible with islam *in the first place* then saying these people are not behaving in line with islamic belief is not NTS, because they *are* taking a different stance to the mainstream muslim community, they do break traditions like opposition to suicide. They're arguing that these people cease to meet their a priori definition of what an observant muslim is, because they're going against tenets of the religion.\n\nIn fact ISIS are even breaking traditions within Islamism itself, as it's early leaders like [Qutb](https://en.wikipedia.org/wiki/Sayyid_Qutb) were opposed to attacking civilians, and didn't hold their neo-fascist ideals. They're also breaking with Al Qaeda in their declaration of a caliphate.\n\n\nI have issues with aspects of islam as a conservative ideology, but I think this argument is a rhetorical device used by people who want to amalgamate opposition to terrorism into their wider agenda against muslim people which doesn't make much sense to me. \n\nI don't agree with either position, I think it's false that islamic terrorism is just a phenomenon independent of Islam, but at the same time we can't just gloss over the real divergence between these movements and what we would call 'mainstream' islam and even 'mainstream' islamic terrorism.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve talked about this before and I&amp;#39;m becoming convinced people who make this counterargument don&amp;#39;t understand no true scotsman. The fallacy is predicated on the &lt;em&gt;a posteriori&lt;/em&gt; redefinition of the category:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Imagine Hamish McDonald, a Scotsman, sitting down with his Glasgow Morning Herald and seeing an article about how the &amp;quot;Brighton Sex Maniac Strikes Again&amp;quot;. Hamish is shocked and declares that &amp;quot;No Scotsman would do such a thing.&amp;quot; The next day he sits down to read his Glasgow Morning Herald again; and, this time, finds an article about an Aberdeen man whose brutal actions make the Brighton sex maniac seem almost gentlemanly. This fact shows that Hamish was wrong in his opinion, but is he going to admit this? Not likely. This time he says: &amp;quot;No true Scotsman would do such a thing.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you don&amp;#39;t think actions like suicide are compatible with islam &lt;em&gt;in the first place&lt;/em&gt; then saying these people are not behaving in line with islamic belief is not NTS, because they &lt;em&gt;are&lt;/em&gt; taking a different stance to the mainstream muslim community, they do break traditions like opposition to suicide. They&amp;#39;re arguing that these people cease to meet their a priori definition of what an observant muslim is, because they&amp;#39;re going against tenets of the religion.&lt;/p&gt;\n\n&lt;p&gt;In fact ISIS are even breaking traditions within Islamism itself, as it&amp;#39;s early leaders like &lt;a href=\"https://en.wikipedia.org/wiki/Sayyid_Qutb\"&gt;Qutb&lt;/a&gt; were opposed to attacking civilians, and didn&amp;#39;t hold their neo-fascist ideals. They&amp;#39;re also breaking with Al Qaeda in their declaration of a caliphate.&lt;/p&gt;\n\n&lt;p&gt;I have issues with aspects of islam as a conservative ideology, but I think this argument is a rhetorical device used by people who want to amalgamate opposition to terrorism into their wider agenda against muslim people which doesn&amp;#39;t make much sense to me. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t agree with either position, I think it&amp;#39;s false that islamic terrorism is just a phenomenon independent of Islam, but at the same time we can&amp;#39;t just gloss over the real divergence between these movements and what we would call &amp;#39;mainstream&amp;#39; islam and even &amp;#39;mainstream&amp;#39; islamic terrorism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7hgbj", "score_hidden": false, "stickied": false, "created": 1492116098.0, "created_utc": 1492087298.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7gsa5", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "bplus", "parent_id": "t1_dg7ggdc", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "In that it seems to be part of the broader argument that Islamic terrorists aren't really Islamic. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In that it seems to be part of the broader argument that Islamic terrorists aren&amp;#39;t really Islamic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7gsa5", "score_hidden": false, "stickied": false, "created": 1492114981.0, "created_utc": 1492086181.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ggdc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg7g8pq", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "In what sense is it NTS?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In what sense is it NTS?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7ggdc", "score_hidden": false, "stickied": false, "created": 1492114386.0, "created_utc": 1492085586.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7g8pq", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "bplus", "parent_id": "t1_dg7fztw", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Really good point. A religious fundamentalist terrorist is precisely the opposite of a nihilist. This all just sounds a bit \"no true Scotsman\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really good point. A religious fundamentalist terrorist is precisely the opposite of a nihilist. This all just sounds a bit &amp;quot;no true Scotsman&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7g8pq", "score_hidden": false, "stickied": false, "created": 1492113987.0, "created_utc": 1492085187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dg82awa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "c_Six", "parent_id": "t1_dg7fztw", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I think this is a case of evolving language. By far the most common usage of nihilism I ever see is this - some kind of conglomeration of pessimism, alienation, disassociation with the world, resentment, hopelessness. It's not the technically correct definition. But for one reason or another, I don't know of a better word to describe this concept than 'nihilism'.\n\nThere's a really shitty old punk song I used to love called [Baby I'm a Nihilist](https://www.youtube.com/watch?v=v3KaunDOWoE) that epitomizes exactly what I'm talking about. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is a case of evolving language. By far the most common usage of nihilism I ever see is this - some kind of conglomeration of pessimism, alienation, disassociation with the world, resentment, hopelessness. It&amp;#39;s not the technically correct definition. But for one reason or another, I don&amp;#39;t know of a better word to describe this concept than &amp;#39;nihilism&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a really shitty old punk song I used to love called &lt;a href=\"https://www.youtube.com/watch?v=v3KaunDOWoE\"&gt;Baby I&amp;#39;m a Nihilist&lt;/a&gt; that epitomizes exactly what I&amp;#39;m talking about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg82awa", "score_hidden": false, "stickied": false, "created": 1492139857.0, "created_utc": 1492111057.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fztw", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Wondering what definition of [nihilism](https://en.wikipedia.org/wiki/Nihilism) they're using here. Decent article though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wondering what definition of &lt;a href=\"https://en.wikipedia.org/wiki/Nihilism\"&gt;nihilism&lt;/a&gt; they&amp;#39;re using here. Decent article though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7fztw", "score_hidden": false, "stickied": false, "created": 1492113501.0, "created_utc": 1492084701.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dg7dmn8", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "frasiera", "parent_id": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "**submission statement**  \n   \nThe making of a “homegrown terrorist” follows a nearly identical path.  \n\nAlmost all are “born-again” Muslim, have a history of petty crimes and the group’s membership is always the same: brothers, childhood friends, acquaintances from prison, sometimes from a training camp.   \nThe Muslim community such terrorists are eager to avenge is almost never specified. It is a non-historical and non-spatial reality.  None of the jihadis has campaigned as part of a pro-Palestinian movement or belonged to any sort of association to combat Islamophobia, or even an Islamic NGO. Living in an Islamic society does not interest jihadis: they do not go to the Middle East to live, but to die. That is the paradox: these young radicals are not utopians, they are nihilists.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;submission statement&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;The making of a “homegrown terrorist” follows a nearly identical path.  &lt;/p&gt;\n\n&lt;p&gt;Almost all are “born-again” Muslim, have a history of petty crimes and the group’s membership is always the same: brothers, childhood friends, acquaintances from prison, sometimes from a training camp.&lt;br/&gt;\nThe Muslim community such terrorists are eager to avenge is almost never specified. It is a non-historical and non-spatial reality.  None of the jihadis has campaigned as part of a pro-Palestinian movement or belonged to any sort of association to combat Islamophobia, or even an Islamic NGO. Living in an Islamic society does not interest jihadis: they do not go to the Middle East to live, but to die. That is the paradox: these young radicals are not utopians, they are nihilists.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7dmn8", "score_hidden": false, "stickied": false, "created": 1492107663.0, "created_utc": 1492078863.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dgbb4tb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zxcsd", "parent_id": "t1_dg82tlh", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "not accurate, he's saying that nihilism + islam = terrorism, not that islam doesn't play a role. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;not accurate, he&amp;#39;s saying that nihilism + islam = terrorism, not that islam doesn&amp;#39;t play a role. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dgbb4tb", "score_hidden": false, "stickied": false, "created": 1492325971.0, "created_utc": 1492297171.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dg83vrp", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Exoslovakia", "parent_id": "t1_dg82tlh", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "There's a lot of educated, disaffected youths in the Western world.  And there are lots of ways to become radicalized.  Yet it's by far Muslims who are behaving this way.  Which suggests it has more to do with Islam.\n\nYou also see this pattern of radicalism and violence from Muslims all across the globe, not just in Europe.  Bangladeshis hacking secularists to death.  Boko Haram taking thousands of sex slaves in Nigeria.  Islamists massively popular in Egypt.  Turkey becoming increasingly theocratic and radical.  And if you look at the source material for Islam, it's not difficult to see why they can think these acts are good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a lot of educated, disaffected youths in the Western world.  And there are lots of ways to become radicalized.  Yet it&amp;#39;s by far Muslims who are behaving this way.  Which suggests it has more to do with Islam.&lt;/p&gt;\n\n&lt;p&gt;You also see this pattern of radicalism and violence from Muslims all across the globe, not just in Europe.  Bangladeshis hacking secularists to death.  Boko Haram taking thousands of sex slaves in Nigeria.  Islamists massively popular in Egypt.  Turkey becoming increasingly theocratic and radical.  And if you look at the source material for Islam, it&amp;#39;s not difficult to see why they can think these acts are good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg83vrp", "score_hidden": false, "stickied": false, "created": 1492141572.0, "created_utc": 1492112772.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82tlh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "steauengeglase", "parent_id": "t1_dg80ljh", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "The author's other point is that the left and right's pet reasons (either the systemic effects of western colonialism or \"Islam is a religion of violence\") aren't the real culprits here. It's educated, disaffected youth, hungry for something, who are literally the culprits. \n\nAs the author said, it's the Islamization of Radicalism, not the Radicalization of Islam. Islam just happens to be the convenient common carrier wave. It's not like young Muslims are the only ones carrying out acts of mass violence, it just happens that Muslim youth are the ones who found themselves in the perfect vacuum for this to happen on a global level. \n\nI think the far bigger question to ask is what have young men in the modern world either lost or gained that caused such a void? Why aren't older Muslim men running down people with trucks, bombing trains, and running off to Syria? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The author&amp;#39;s other point is that the left and right&amp;#39;s pet reasons (either the systemic effects of western colonialism or &amp;quot;Islam is a religion of violence&amp;quot;) aren&amp;#39;t the real culprits here. It&amp;#39;s educated, disaffected youth, hungry for something, who are literally the culprits. &lt;/p&gt;\n\n&lt;p&gt;As the author said, it&amp;#39;s the Islamization of Radicalism, not the Radicalization of Islam. Islam just happens to be the convenient common carrier wave. It&amp;#39;s not like young Muslims are the only ones carrying out acts of mass violence, it just happens that Muslim youth are the ones who found themselves in the perfect vacuum for this to happen on a global level. &lt;/p&gt;\n\n&lt;p&gt;I think the far bigger question to ask is what have young men in the modern world either lost or gained that caused such a void? Why aren&amp;#39;t older Muslim men running down people with trucks, bombing trains, and running off to Syria? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg82tlh", "score_hidden": false, "stickied": false, "created": 1492140425.0, "created_utc": 1492111625.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80ljh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Exoslovakia", "parent_id": "t1_dg7xpn2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "Terrorism is overwhelmingly caused by Muslims in today's world.  The author's point seems to suggest Muslims are abnormally affected by anomie more than any other group.  What would be the cause for that?  \n\nI find it hard to discount the fact that this religious ideology is particularly infectious and violent.  Which spreads in large part because of Saudi patronage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Terrorism is overwhelmingly caused by Muslims in today&amp;#39;s world.  The author&amp;#39;s point seems to suggest Muslims are abnormally affected by anomie more than any other group.  What would be the cause for that?  &lt;/p&gt;\n\n&lt;p&gt;I find it hard to discount the fact that this religious ideology is particularly infectious and violent.  Which spreads in large part because of Saudi patronage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg80ljh", "score_hidden": false, "stickied": false, "created": 1492138014.0, "created_utc": 1492109214.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dgbb1e6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zxcsd", "parent_id": "t1_dg7xpn2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "I wonder how true this is for the muslim world, where terrorist is also a big problem.    \n\nMy intuition is that it's not. \n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder how true this is for the muslim world, where terrorist is also a big problem.    &lt;/p&gt;\n\n&lt;p&gt;My intuition is that it&amp;#39;s not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dgbb1e6", "score_hidden": false, "stickied": false, "created": 1492325830.0, "created_utc": 1492297030.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xpn2", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "steauengeglase", "parent_id": "t1_dg7m6m7", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "The author's real point is that Heaven doesn't really matter and neither does colonialism. Those reasons are just superficial means for facilitating the modern jihadi's personal rage, that likely stems from an intense feeling of anomie.\n\n*In Durkheim's view, traditional religions often provided the basis for the shared values which the anomic individual lacks. Furthermore, he argued that the division of labor that had been prevalent in economic life since the Industrial Revolution led individuals to pursue egoistic ends rather than seeking the good of a larger community.*\n\nhttps://en.wikipedia.org/wiki/Anomie", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The author&amp;#39;s real point is that Heaven doesn&amp;#39;t really matter and neither does colonialism. Those reasons are just superficial means for facilitating the modern jihadi&amp;#39;s personal rage, that likely stems from an intense feeling of anomie.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;In Durkheim&amp;#39;s view, traditional religions often provided the basis for the shared values which the anomic individual lacks. Furthermore, he argued that the division of labor that had been prevalent in economic life since the Industrial Revolution led individuals to pursue egoistic ends rather than seeking the good of a larger community.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Anomie\"&gt;https://en.wikipedia.org/wiki/Anomie&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7xpn2", "score_hidden": false, "stickied": false, "created": 1492134939.0, "created_utc": 1492106139.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7m6m7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Daktush", "parent_id": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Anyone surprised? Tell someone that likes violence and thinks nothing matters that he can go to heaven if he kills infidels and you get an explosive combination", "edited": 1492099044.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anyone surprised? Tell someone that likes violence and thinks nothing matters that he can go to heaven if he kills infidels and you get an explosive combination&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7m6m7", "score_hidden": false, "stickied": false, "created": 1492122491.0, "created_utc": 1492093691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dg7xf2i", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TenCrownCoffee", "parent_id": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Either way, shows the crazy power of a belief system. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Either way, shows the crazy power of a belief system. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg7xf2i", "score_hidden": false, "stickied": false, "created": 1492134628.0, "created_utc": 1492105828.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dgb719z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Eochaidh-", "parent_id": "t1_dg9d5qx", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "An ethos of murder is worse than nothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An ethos of murder is worse than nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dgb719z", "score_hidden": false, "stickied": false, "created": 1492320152.0, "created_utc": 1492291352.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9d5qx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Naberius", "parent_id": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Nihilists! Fuck me. I mean, say what you want about the tenets of National Socialism, Dude, at least it's an ethos. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nihilists! Fuck me. I mean, say what you want about the tenets of National Socialism, Dude, at least it&amp;#39;s an ethos. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg9d5qx", "score_hidden": false, "stickied": false, "created": 1492216220.0, "created_utc": 1492187420.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dgbbc40", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zxcsd", "parent_id": "t1_dg8goze", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "Because jihad had a long history before 9/11? (including 9/11).\n\nMaybe there were simply less muslims in europe to commit those acts but anywhere else where muslims traditionally lived it existed long before? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because jihad had a long history before 9/11? (including 9/11).&lt;/p&gt;\n\n&lt;p&gt;Maybe there were simply less muslims in europe to commit those acts but anywhere else where muslims traditionally lived it existed long before? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dgbbc40", "score_hidden": false, "stickied": false, "created": 1492326265.0, "created_utc": 1492297465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8goze", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AkirIkasu", "parent_id": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 0, "body": "While I don't doubt most of the points made in the article, I don't agree with the conclusion. The article seems to talk about these people as ideas rather than as people at times. You can't describe people as \"nihilists\" because if they were, they wouldn't see a point in doing *anything*. I think that giving someone that label is akin to dismissing them, which is really not acceptable when you are trying to sketch their worldview.\n\nThere are a few reasons why I reject the conclusion. One of the largest is that they don't mention anyone specific who didn't come from an Islamic background who converted specifically to join the movement. That's a pretty big piece of missing evidence.\n\nThe number one reason why I disagree is that there is a factor that the author misses. He mentions that these 'new jihadists' start to show up roughly 20 years ago, but ignores the reasoning why that may have changed. And as much as I hate to mention it, it's 9/11. After that (as well as the other acts of Islamic terrorism across the world), large swaths of the population harbored an irrational hate  of all of the people of the middle-east and all things Islam. The reason why these jihadists are from western countries is because that's where all the hate and abuse is coming from. When someone gets treated badly by society, they rebel against it. When society tells someone they are a criminal, they will eventually become a criminal. Why would that be different for a jihadist?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I don&amp;#39;t doubt most of the points made in the article, I don&amp;#39;t agree with the conclusion. The article seems to talk about these people as ideas rather than as people at times. You can&amp;#39;t describe people as &amp;quot;nihilists&amp;quot; because if they were, they wouldn&amp;#39;t see a point in doing &lt;em&gt;anything&lt;/em&gt;. I think that giving someone that label is akin to dismissing them, which is really not acceptable when you are trying to sketch their worldview.&lt;/p&gt;\n\n&lt;p&gt;There are a few reasons why I reject the conclusion. One of the largest is that they don&amp;#39;t mention anyone specific who didn&amp;#39;t come from an Islamic background who converted specifically to join the movement. That&amp;#39;s a pretty big piece of missing evidence.&lt;/p&gt;\n\n&lt;p&gt;The number one reason why I disagree is that there is a factor that the author misses. He mentions that these &amp;#39;new jihadists&amp;#39; start to show up roughly 20 years ago, but ignores the reasoning why that may have changed. And as much as I hate to mention it, it&amp;#39;s 9/11. After that (as well as the other acts of Islamic terrorism across the world), large swaths of the population harbored an irrational hate  of all of the people of the middle-east and all things Islam. The reason why these jihadists are from western countries is because that&amp;#39;s where all the hate and abuse is coming from. When someone gets treated badly by society, they rebel against it. When society tells someone they are a criminal, they will eventually become a criminal. Why would that be different for a jihadist?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg8goze", "score_hidden": false, "stickied": false, "created": 1492157441.0, "created_utc": 1492128641.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qyt6", "removal_reason": null, "link_id": "t3_654jr2", "likes": null, "replies": "", "user_reports": [], "id": "dg8b1je", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "trap_haus", "parent_id": "t3_654jr2", "subreddit_name_prefixed": "r/TrueReddit", "controversiality": 1, "body": "This strikes me as another misleading piece with the clear intent of making sure that Islam remains as faultless as possible in discussing the madness that is currently going on. Crazy people with a fascination w violence are attracted to Islam - does that not say something about the nature of modern Islam itself? Not to mention, this completely ignores the vast majority of violence committed by jihadists that do not directly affect the West. Not all Muslims are violent or prone to violence, that is sure, but that doesn't mean people who are violent or prone to violent contradict anything specific in Islam. There is a serious problem with the religion today, to deny it is a denial of reality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This strikes me as another misleading piece with the clear intent of making sure that Islam remains as faultless as possible in discussing the madness that is currently going on. Crazy people with a fascination w violence are attracted to Islam - does that not say something about the nature of modern Islam itself? Not to mention, this completely ignores the vast majority of violence committed by jihadists that do not directly affect the West. Not all Muslims are violent or prone to violence, that is sure, but that doesn&amp;#39;t mean people who are violent or prone to violent contradict anything specific in Islam. There is a serious problem with the religion today, to deny it is a denial of reality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueReddit", "name": "t1_dg8b1je", "score_hidden": false, "stickied": false, "created": 1492149913.0, "created_utc": 1492121113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]