[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "HIMYM", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been rewatching lately and felt like laying some stuff out. Reply if you want, feel free to add anything or your own rewatch observations.&lt;/p&gt;\n\n&lt;p&gt;In rewatch, I noticed how overt Barney actually was with his love/pining for Robin and how much more forward he was about that than Ted, who figuratively &amp;quot;sulked&amp;quot; around for literal years after he and Robin broke up, waiting for any &amp;quot;in&amp;quot; he thought would win her back.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Barney can sense Ted/Robin&amp;#39;s incompatibility in S2 and mentions it a ton, even though he&amp;#39;s surprised when they do actually break up. Like he didn&amp;#39;t expect them to realise it. More Barney development was needed here.&lt;/li&gt;\n&lt;li&gt;As far back as season one, Barney knew what a good match he and Robin were.&lt;/li&gt;\n&lt;li&gt;Barney cannot view their S3 hookup as meaningless no matter how hard he tries.&lt;/li&gt;\n&lt;li&gt;Barney sees Robin when his life flashes before his eyes after he&amp;#39;s hit by the bus.&lt;/li&gt;\n&lt;li&gt;Post-Robin Ted rushes into marriage with the first serious relationship he finds.&lt;/li&gt;\n&lt;li&gt;Barney admits by 401 that he loves Robin (about 3-4 months after their hook up).&lt;/li&gt;\n&lt;li&gt;Late S4 Robin is not in a good way (Woo girl and naked man) while late S4 Barney is certain he wants Robin (resulting in his taking The Leap for her in the season finale). Robin notes &amp;quot;I am scared of how much I like you&amp;quot; and blurts out &amp;quot;lets get married&amp;quot;! Her reservations come from his womanizing (understandable!) and her low self esteem. Again, more character development for Robin was needed here.&lt;/li&gt;\n&lt;li&gt;Barney and Robin did not want to break up. They were pressured by their friends to date traditionally and it drove them apart. &lt;/li&gt;\n&lt;li&gt;Barney says his jealousy over Don is only about wanting to hook up with Robin again, but he refers to her as &amp;quot;Robin Stinson&amp;quot; and wants to meet Don. &lt;/li&gt;\n&lt;li&gt;Ted, post Stella, is very cold/emotionless with relationships in S5 and is basically the &amp;quot;slides into your DMs&amp;quot; guy by the end of the season, letting Robin move back in (WHY) and almost hooking up with her til she stops it. Like how fucking irresponsible...&lt;/li&gt;\n&lt;li&gt;By the beginning of S6, Barney and Robin&amp;#39;s wedding is on the cards so every current event is shaping that future. Barney experiences serious relationships (Nora and Quinn) but throughout S6 shows visible interest/affection for Robin. Every other episode has a significant Barney and Robin moment. &lt;/li&gt;\n&lt;li&gt;Barney reconnecting with his dad is also littered with all these pining moments for Robin. &lt;/li&gt;\n&lt;li&gt;Kevin helps Robin realise she wants to settle down but she&amp;#39;s still stuck on &amp;quot;safe&amp;quot; options like Kevin (or Ted...). Her initial angry reaction to Barney&amp;#39;s engagement play, followed by her immediate yes, says above all she was looking for solid commitment (which Kevin couldn&amp;#39;t promise) and she NEVER loved Ted (which is why Marshall pushes her to move out and Ted ends the &amp;quot;at 40&amp;quot; promise), get them both out of that unhealthy comfort cycle). The primary reason she got mad when Barney proposed was because it came from the playbook which was typically used for hookups only. She even says &amp;quot;You really think I could kiss you?&amp;quot;. It didn&amp;#39;t even occur that he&amp;#39;d be proposing marriage to HER so, once he did, everything she&amp;#39;d hoped for from Barney fell into place. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;One episode of interest was S4&amp;#39;s Benefits. Originally, with Barney&amp;#39;s heartbreak over Robin and Ted hooking up, I thought it was the perfect episode to illustrate why they&amp;#39;d end up together. But looking back, they turned Robin into a moron for an episode, so she wouldn&amp;#39;t notice Barney&amp;#39;s love like EVERY other character did. The entitlement/audacity from Ted to use sex with Robin as a way to ignore their ongoing incompatibility was kinda gross. That montage where he talks about &amp;quot;jammin&amp;#39; on Scherbatsky&amp;quot; wtf. Barney having to physically destroy things to cope is disturbing outside of the running gag. Overall, it was a weird segue for Robin to have any desire to hook up emotionlessly with Ted, and for Ted to be OK with it as long as it was Sex With Robin (creepy pedestal worship). BUT - he realises his error! He comprehends that Barney has legitimate feelings for Robin and a superficial sex arrangement thrown in his face is tasteless so he stops (also bc they can&amp;#39;t help but blur the line between sex/relationship, hey it&amp;#39;s almost like they&amp;#39;re exes duh). So the writers had the self awareness to end that on a note that respected everyone (aside from Robin&amp;#39;s logic being misplaced for an episode) and yet this is the same team that wrote the heartless finale. I still think there were better ways to show Barney&amp;#39;s ongoing love for Robin that to have Ted and Robin randomly, coldly hook up almost as a joke, and shove it in everyone&amp;#39;s faces. &lt;/p&gt;\n\n&lt;p&gt;Another episode that struck me was one I actually missed when it aired. I had trouble maintaining interest in season 8, Victoria and Klaus killed it for me. I ended up missing Romeward Bound completely, which is at the tail end of the season. I was browsing an old HIMYM forum and someone mentioned a moment of Ted/Barney tension in this episode. Intrigued, I watched it and was quite taken by the scene where Barney puts his foot down and will not even entertain Ted trying to give &amp;quot;best man advice&amp;quot; about Robin:&lt;/p&gt;\n\n&lt;p&gt;(Context is Liddy is a hot woman with a bangin&amp;#39; body who is also Barney and Robin&amp;#39;s wedding planner)&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Barney:&lt;/em&gt; I can&amp;#39;t wait for my wedding day. I mean, there is no way that Liddy is gonna be wearing that coat, right? Right? &amp;quot;Barney Stinson, do you hope she wears something slinky and backless?&amp;quot; &amp;quot;I do.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Ted:&lt;/em&gt; Okay, can I just say something as your best man? Be careful. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Barney:&lt;/em&gt; What do you mean? &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Ted:&lt;/em&gt; You just... you haven&amp;#39;t been acting like a guy who&amp;#39;s about to get married, and I know you think it&amp;#39;s okay because Robin&amp;#39;s so cool, but I&amp;#39;m telling you, she&amp;#39;s not as cool as you think she is. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Barney:&lt;/em&gt; Oh, I see. And you&amp;#39;d know this because you know Robin better than I do. You know what she appreciates better than her own fiancé. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Ted:&lt;/em&gt; I&amp;#39;m just saying, if I was getting married in three weeks... &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Barney:&lt;/em&gt; But you&amp;#39;re not getting married in three weeks, Ted. I am. Robin&amp;#39;s marrying me, not you. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Ted:&lt;/em&gt; You&amp;#39;re right. Not my place. Why don&amp;#39;t I get the next round?&lt;/p&gt;\n\n&lt;p&gt;This moment is profound character development for Barney, and the type that was so painful to see washed away in the series finale. Barney heeded Tracey&amp;#39;s advice when he met her, he took every word she said 200% seriously. He wised up, grew up, became a winner, not a player, and got the girl of his dreams by putting it all on the line. Ted waited around and ran away until his destiny was all but given to him. It took so much, so many &amp;quot;lasts&amp;quot; to get him to let go of the Robin fantasy, to the point of her husband in his face saying &amp;quot;BACK OFF ALREADY&amp;quot; and still...he still pursues this woman...still tracks down that awful locket. Beyond creepy. The catch is, in Romeward Bound, it&amp;#39;s TED who points out the woman&amp;#39;s amazing body to Barney, talks up her hotness and - even after Robin shows approval for the woman&amp;#39;s body too - he still tries to talk down to Barney (about ROBIN, no less). Barney&amp;#39;s stance is reinforced/supported by the writers in the final scene, where he comes home to Robin and they roleplay the same situation with the coat. They found something that works for them without either changing for one another. Ted was out of line because he was judging based on what he doesn&amp;#39;t see.&lt;/p&gt;\n\n&lt;p&gt;This all, to me, leads to the finale&amp;#39;s biggest disservice. Erasing everything that made Robin&amp;#39;s life and personality her own. Barney leaves her inexplicably, Barney finds &amp;quot;real&amp;quot; love with his child, Robin achieves her dream job, but it&amp;#39;s deemed &amp;quot;not enough&amp;quot; to make her truly happy, she pines for Ted once &lt;em&gt;he&amp;#39;s&lt;/em&gt; happy, she moves back to her old apartment (?!?). They forced Robin into regression, they took Barney completely out of her life and about the only thing they kept going with was Ted&amp;#39;s possessiveness over her being his only endgame.&lt;/p&gt;\n\n&lt;p&gt;Now I didn&amp;#39;t expect Ted to be alone for the rest of his days after Tracey, or that he shouldn&amp;#39;t listen to his kids telling him to go for it. That is fine, but the thing that gets me is it renders scenes like Barney in Romeward Bound completely useless. Scenes like Barney getting Ted&amp;#39;s blessing for his engagement (which if you think about it, was Barney going out of his way to get approval he REALLY didn&amp;#39;t need from &lt;em&gt;Ted&lt;/em&gt; of all people, but doing it for the importance of friendship). Scenes like the &amp;quot;pit&amp;quot; where Ted realises he&amp;#39;s only trapping himself. These scenes meant a LOT in first viewing. They brought the show up a notch from average, meaningless sitcom into something of a comedy/drama. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: It&amp;#39;s still a real shame to see the show&amp;#39;s creators so bizarrely regress the story at the last minute, at a complete disservice to the characters they created.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been rewatching lately and felt like laying some stuff out. Reply if you want, feel free to add anything or your own rewatch observations.\n\nIn rewatch, I noticed how overt Barney actually was with his love/pining for Robin and how much more forward he was about that than Ted, who figuratively \"sulked\" around for literal years after he and Robin broke up, waiting for any \"in\" he thought would win her back.\n\n* Barney can sense Ted/Robin's incompatibility in S2 and mentions it a ton, even though he's surprised when they do actually break up. Like he didn't expect them to realise it. More Barney development was needed here.\n* As far back as season one, Barney knew what a good match he and Robin were.\n* Barney cannot view their S3 hookup as meaningless no matter how hard he tries.\n* Barney sees Robin when his life flashes before his eyes after he's hit by the bus.\n* Post-Robin Ted rushes into marriage with the first serious relationship he finds.\n* Barney admits by 401 that he loves Robin (about 3-4 months after their hook up).\n* Late S4 Robin is not in a good way (Woo girl and naked man) while late S4 Barney is certain he wants Robin (resulting in his taking The Leap for her in the season finale). Robin notes \"I am scared of how much I like you\" and blurts out \"lets get married\"! Her reservations come from his womanizing (understandable!) and her low self esteem. Again, more character development for Robin was needed here.\n* Barney and Robin did not want to break up. They were pressured by their friends to date traditionally and it drove them apart. \n* Barney says his jealousy over Don is only about wanting to hook up with Robin again, but he refers to her as \"Robin Stinson\" and wants to meet Don. \n* Ted, post Stella, is very cold/emotionless with relationships in S5 and is basically the \"slides into your DMs\" guy by the end of the season, letting Robin move back in (WHY) and almost hooking up with her til she stops it. Like how fucking irresponsible...\n* By the beginning of S6, Barney and Robin's wedding is on the cards so every current event is shaping that future. Barney experiences serious relationships (Nora and Quinn) but throughout S6 shows visible interest/affection for Robin. Every other episode has a significant Barney and Robin moment. \n* Barney reconnecting with his dad is also littered with all these pining moments for Robin. \n* Kevin helps Robin realise she wants to settle down but she's still stuck on \"safe\" options like Kevin (or Ted...). Her initial angry reaction to Barney's engagement play, followed by her immediate yes, says above all she was looking for solid commitment (which Kevin couldn't promise) and she NEVER loved Ted (which is why Marshall pushes her to move out and Ted ends the \"at 40\" promise), get them both out of that unhealthy comfort cycle). The primary reason she got mad when Barney proposed was because it came from the playbook which was typically used for hookups only. She even says \"You really think I could kiss you?\". It didn't even occur that he'd be proposing marriage to HER so, once he did, everything she'd hoped for from Barney fell into place. \n\nOne episode of interest was S4's Benefits. Originally, with Barney's heartbreak over Robin and Ted hooking up, I thought it was the perfect episode to illustrate why they'd end up together. But looking back, they turned Robin into a moron for an episode, so she wouldn't notice Barney's love like EVERY other character did. The entitlement/audacity from Ted to use sex with Robin as a way to ignore their ongoing incompatibility was kinda gross. That montage where he talks about \"jammin' on Scherbatsky\" wtf. Barney having to physically destroy things to cope is disturbing outside of the running gag. Overall, it was a weird segue for Robin to have any desire to hook up emotionlessly with Ted, and for Ted to be OK with it as long as it was Sex With Robin (creepy pedestal worship). BUT - he realises his error! He comprehends that Barney has legitimate feelings for Robin and a superficial sex arrangement thrown in his face is tasteless so he stops (also bc they can't help but blur the line between sex/relationship, hey it's almost like they're exes duh). So the writers had the self awareness to end that on a note that respected everyone (aside from Robin's logic being misplaced for an episode) and yet this is the same team that wrote the heartless finale. I still think there were better ways to show Barney's ongoing love for Robin that to have Ted and Robin randomly, coldly hook up almost as a joke, and shove it in everyone's faces. \n\nAnother episode that struck me was one I actually missed when it aired. I had trouble maintaining interest in season 8, Victoria and Klaus killed it for me. I ended up missing Romeward Bound completely, which is at the tail end of the season. I was browsing an old HIMYM forum and someone mentioned a moment of Ted/Barney tension in this episode. Intrigued, I watched it and was quite taken by the scene where Barney puts his foot down and will not even entertain Ted trying to give \"best man advice\" about Robin:\n\n(Context is Liddy is a hot woman with a bangin' body who is also Barney and Robin's wedding planner)\n\n*Barney:* I can't wait for my wedding day. I mean, there is no way that Liddy is gonna be wearing that coat, right? Right? \"Barney Stinson, do you hope she wears something slinky and backless?\" \"I do.\" \n\n*Ted:* Okay, can I just say something as your best man? Be careful. \n\n*Barney:* What do you mean? \n\n*Ted:* You just... you haven't been acting like a guy who's about to get married, and I know you think it's okay because Robin's so cool, but I'm telling you, she's not as cool as you think she is. \n\n*Barney:* Oh, I see. And you'd know this because you know Robin better than I do. You know what she appreciates better than her own fiancé. \n\n*Ted:* I'm just saying, if I was getting married in three weeks... \n\n*Barney:* But you're not getting married in three weeks, Ted. I am. Robin's marrying me, not you. \n\n*Ted:* You're right. Not my place. Why don't I get the next round?\n\nThis moment is profound character development for Barney, and the type that was so painful to see washed away in the series finale. Barney heeded Tracey's advice when he met her, he took every word she said 200% seriously. He wised up, grew up, became a winner, not a player, and got the girl of his dreams by putting it all on the line. Ted waited around and ran away until his destiny was all but given to him. It took so much, so many \"lasts\" to get him to let go of the Robin fantasy, to the point of her husband in his face saying \"BACK OFF ALREADY\" and still...he still pursues this woman...still tracks down that awful locket. Beyond creepy. The catch is, in Romeward Bound, it's TED who points out the woman's amazing body to Barney, talks up her hotness and - even after Robin shows approval for the woman's body too - he still tries to talk down to Barney (about ROBIN, no less). Barney's stance is reinforced/supported by the writers in the final scene, where he comes home to Robin and they roleplay the same situation with the coat. They found something that works for them without either changing for one another. Ted was out of line because he was judging based on what he doesn't see.\n\nThis all, to me, leads to the finale's biggest disservice. Erasing everything that made Robin's life and personality her own. Barney leaves her inexplicably, Barney finds \"real\" love with his child, Robin achieves her dream job, but it's deemed \"not enough\" to make her truly happy, she pines for Ted once *he's* happy, she moves back to her old apartment (?!?). They forced Robin into regression, they took Barney completely out of her life and about the only thing they kept going with was Ted's possessiveness over her being his only endgame.\n\nNow I didn't expect Ted to be alone for the rest of his days after Tracey, or that he shouldn't listen to his kids telling him to go for it. That is fine, but the thing that gets me is it renders scenes like Barney in Romeward Bound completely useless. Scenes like Barney getting Ted's blessing for his engagement (which if you think about it, was Barney going out of his way to get approval he REALLY didn't need from *Ted* of all people, but doing it for the importance of friendship). Scenes like the \"pit\" where Ted realises he's only trapping himself. These scenes meant a LOT in first viewing. They brought the show up a notch from average, meaningless sitcom into something of a comedy/drama. \n\nTL;DR: It's still a real shame to see the show's creators so bizarrely regress the story at the last minute, at a complete disservice to the characters they created.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uzgg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 79, "report_reasons": null, "author": "fifthchevron", "saved": false, "mod_reports": [], "name": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "approved_by": null, "over_18": false, "domain": "self.HIMYM", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rcqy", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/HIMYM/comments/65uzgg/some_general_tedrobinbarney_thoughts_from_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492457373.0, "url": "https://www.reddit.com/r/HIMYM/comments/65uzgg/some_general_tedrobinbarney_thoughts_from_my/", "author_flair_text": null, "quarantine": false, "title": "Some general Ted/Robin/Barney thoughts from my current rewatch...", "created_utc": 1492428573.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 54, "visited": false, "subreddit_type": "public", "ups": 79}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdfn9e", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdee2c", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Haha!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdfn9e", "score_hidden": false, "stickied": false, "created": 1492462061.0, "created_utc": 1492433261.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dge483r", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "AFK42", "parent_id": "t1_dge3bx3", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Major Disappointment /salute\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Major Disappointment /salute&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge483r", "score_hidden": false, "stickied": false, "created": 1492491714.0, "created_utc": 1492462914.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dge3bx3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Hercole", "parent_id": "t1_dgdee2c", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Major disappointment. I came here to do that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Major disappointment. I came here to do that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge3bx3", "score_hidden": false, "stickied": false, "created": 1492490711.0, "created_utc": 1492461911.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdee2c", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "MJLD5", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "General Ted (salutes) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;General Ted (salutes) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdee2c", "score_hidden": false, "stickied": false, "created": 1492459530.0, "created_utc": 1492430730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgedzsv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xRIOSxx", "parent_id": "t1_dgdw6so", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "To be fair, Robin actually says \"I'm such a mess. Why do you even like me?\" \n\nHer being a mess wasn't the first thing that came to his mind, it was more of a \"so am I\" answer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair, Robin actually says &amp;quot;I&amp;#39;m such a mess. Why do you even like me?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Her being a mess wasn&amp;#39;t the first thing that came to his mind, it was more of a &amp;quot;so am I&amp;quot; answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgedzsv", "score_hidden": false, "stickied": false, "created": 1492504100.0, "created_utc": 1492475300.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgehl9l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdw6so", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Ted's letter was idealising her though, and skimming over their incompatibility. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ted&amp;#39;s letter was idealising her though, and skimming over their incompatibility. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgehl9l", "score_hidden": false, "stickied": false, "created": 1492508560.0, "created_utc": 1492479760.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdw6so", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Amber_82", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Robin: why do you even like me?\n\nBarney: because you're almost as messed up as I am\n\nIt doesn't bode well that the first thing he thinks of is how messed up she is. I guess misery loves company. \n\nAlso, in Twin Beds when Barney and Ted were fighting over her Ted wrote a Nice letter on how he'll never forget the first time they kissed, her first ILY and when he stole her the blue French horn. He continued by saying he wanted to spend his life with her. Barney stated how horrible him and Robin were and how he just wanted to have sex with her one more time. \n\nBarney thought Robin could fix him and Robin thought she deserved someone like Barney.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Robin: why do you even like me?&lt;/p&gt;\n\n&lt;p&gt;Barney: because you&amp;#39;re almost as messed up as I am&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t bode well that the first thing he thinks of is how messed up she is. I guess misery loves company. &lt;/p&gt;\n\n&lt;p&gt;Also, in Twin Beds when Barney and Ted were fighting over her Ted wrote a Nice letter on how he&amp;#39;ll never forget the first time they kissed, her first ILY and when he stole her the blue French horn. He continued by saying he wanted to spend his life with her. Barney stated how horrible him and Robin were and how he just wanted to have sex with her one more time. &lt;/p&gt;\n\n&lt;p&gt;Barney thought Robin could fix him and Robin thought she deserved someone like Barney.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdw6so", "score_hidden": false, "stickied": false, "created": 1492482658.0, "created_utc": 1492453858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdjheh", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "DaddyCatALSO", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Finally a post about regressing that I can agree with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finally a post about regressing that I can agree with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdjheh", "score_hidden": false, "stickied": false, "created": 1492468043.0, "created_utc": 1492439243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdt3cm", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "sanitysepilogue", "parent_id": "t1_dgdkcpj", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Don't get me wrong, that's Sleazy Stinson tactics, but I think (especially given OP's breakdown and everything we see of Barney trying to deal with growing up) at that point he doesn't understand/know what he's feeling. So, he treats it in the only manner he's become accustomed to", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me wrong, that&amp;#39;s Sleazy Stinson tactics, but I think (especially given OP&amp;#39;s breakdown and everything we see of Barney trying to deal with growing up) at that point he doesn&amp;#39;t understand/know what he&amp;#39;s feeling. So, he treats it in the only manner he&amp;#39;s become accustomed to&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdt3cm", "score_hidden": false, "stickied": false, "created": 1492479232.0, "created_utc": 1492450432.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dge1aiz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "rizzy-rake", "parent_id": "t1_dgdkcpj", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "The Last Page wasn't about manipulating Robin to marry him as much as it was manipulating her to realize her own feelings and what would make her happy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Last Page wasn&amp;#39;t about manipulating Robin to marry him as much as it was manipulating her to realize her own feelings and what would make her happy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge1aiz", "score_hidden": false, "stickied": false, "created": 1492488438.0, "created_utc": 1492459638.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkcpj", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Mark_Zajac", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Back in \"Shelter Island\" we saw Barney circle \"emotionally vulnerable\" and \"get her drunk\" on has white-board, as part of his plan have sex with Robin.  At that point he became despicable to me.    \n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;There is an old adage: \"If you love somebody, set them free.\"  Barney alway seemed intent on possessing Robin.  His proposal scheme was like the recruitment strategy for a cult.  Ted was always setting Robin free.  Back in \"Something Blue\", Robin tearfully pleads for a chance to make it work but Ted gently insists that they must part.  Then, in \"The Front Porch\" he said, \"We still want different things.\"  It was Robin you proposed the \"marry at 40 pact\" -- Ted just accepted.  Ted ordered Robin from the limo in \"The Last Page, Part II\", setting Robin free to take a chance with Barney.  Then, in \"Sunrise\" he let her go again.  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;There's a second part to that saying: \"If they don't come back, it was never meant to be.\" But Robin *did* come back, in her own time.  It *was* meant to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Back in &amp;quot;Shelter Island&amp;quot; we saw Barney circle &amp;quot;emotionally vulnerable&amp;quot; and &amp;quot;get her drunk&amp;quot; on has white-board, as part of his plan have sex with Robin.  At that point he became despicable to me.&lt;br/&gt;\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;There is an old adage: &amp;quot;If you love somebody, set them free.&amp;quot;  Barney alway seemed intent on possessing Robin.  His proposal scheme was like the recruitment strategy for a cult.  Ted was always setting Robin free.  Back in &amp;quot;Something Blue&amp;quot;, Robin tearfully pleads for a chance to make it work but Ted gently insists that they must part.  Then, in &amp;quot;The Front Porch&amp;quot; he said, &amp;quot;We still want different things.&amp;quot;  It was Robin you proposed the &amp;quot;marry at 40 pact&amp;quot; -- Ted just accepted.  Ted ordered Robin from the limo in &amp;quot;The Last Page, Part II&amp;quot;, setting Robin free to take a chance with Barney.  Then, in &amp;quot;Sunrise&amp;quot; he let her go again.&lt;br/&gt;\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;There&amp;#39;s a second part to that saying: &amp;quot;If they don&amp;#39;t come back, it was never meant to be.&amp;quot; But Robin &lt;em&gt;did&lt;/em&gt; come back, in her own time.  It &lt;em&gt;was&lt;/em&gt; meant to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdkcpj", "score_hidden": false, "stickied": false, "created": 1492469192.0, "created_utc": 1492440392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdp2m4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Solo4114", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "See, it's all of the above (plus other things) that makes me believe that the ending we got was not the ONLY ending that could've made sense.  The showrunners spent a lot of time demonstrating how Barney and Robin worked together in ways Ted and Robin did not, as well as demonstrating that Ted's fixation on her was *bad* and actually getting in the way of Ted's life moving forward.  There was ample evidence that Ted would meet Tracy and that he wouldn't get back together with Robin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See, it&amp;#39;s all of the above (plus other things) that makes me believe that the ending we got was not the ONLY ending that could&amp;#39;ve made sense.  The showrunners spent a lot of time demonstrating how Barney and Robin worked together in ways Ted and Robin did not, as well as demonstrating that Ted&amp;#39;s fixation on her was &lt;em&gt;bad&lt;/em&gt; and actually getting in the way of Ted&amp;#39;s life moving forward.  There was ample evidence that Ted would meet Tracy and that he wouldn&amp;#39;t get back together with Robin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdp2m4", "score_hidden": false, "stickied": false, "created": 1492474763.0, "created_utc": 1492445963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgf11oe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Solo4114", "parent_id": "t1_dge9oi1", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Sorry.  I didn't see it.  I saw plenty during the show that suggested they weren't right for each other in a long term romantic relationship.  I saw nothing in the finale to suggest that most of that had changed.  We're just left to assume and fill in the blanks.\n\nIt's fine if someone wants to do that, but my point is that it's equally fine to assume that Ted and Robin date for a few months, then realize they're really just trying to recapture something that was lost over 20 years ago, and split up.  Robin never finds real love again and closes herself off emotionally. Ted gives up on pursuing love and resigns himself to the life of being a widower.  While neither dies alone, they don't die with a partner.\n\nBoth are equally valid interpretations, given what's on screen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry.  I didn&amp;#39;t see it.  I saw plenty during the show that suggested they weren&amp;#39;t right for each other in a long term romantic relationship.  I saw nothing in the finale to suggest that most of that had changed.  We&amp;#39;re just left to assume and fill in the blanks.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s fine if someone wants to do that, but my point is that it&amp;#39;s equally fine to assume that Ted and Robin date for a few months, then realize they&amp;#39;re really just trying to recapture something that was lost over 20 years ago, and split up.  Robin never finds real love again and closes herself off emotionally. Ted gives up on pursuing love and resigns himself to the life of being a widower.  While neither dies alone, they don&amp;#39;t die with a partner.&lt;/p&gt;\n\n&lt;p&gt;Both are equally valid interpretations, given what&amp;#39;s on screen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgf11oe", "score_hidden": false, "stickied": false, "created": 1492547145.0, "created_utc": 1492518345.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge9oi1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "arfonfab", "parent_id": "t1_dgdw270", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "There were lots of clues through the series about how they'd changed - Robin didn't like kids and never dressed up for costume parties, but Aunt Robin loved the kids and dressed up for Halloween, etc, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There were lots of clues through the series about how they&amp;#39;d changed - Robin didn&amp;#39;t like kids and never dressed up for costume parties, but Aunt Robin loved the kids and dressed up for Halloween, etc, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge9oi1", "score_hidden": false, "stickied": false, "created": 1492498539.0, "created_utc": 1492469739.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdw270", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solo4114", "parent_id": "t1_dgdvp60", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Exactly.  It's not that people can't change over time, but rather that we didn't *see* the changes, so all we're left with is the kids saying \"You're clearly in love with each other!\"  A classic example of telling, not showing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly.  It&amp;#39;s not that people can&amp;#39;t change over time, but rather that we didn&amp;#39;t &lt;em&gt;see&lt;/em&gt; the changes, so all we&amp;#39;re left with is the kids saying &amp;quot;You&amp;#39;re clearly in love with each other!&amp;quot;  A classic example of telling, not showing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdw270", "score_hidden": false, "stickied": false, "created": 1492482515.0, "created_utc": 1492453715.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvp60", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kinginthenorthjon", "parent_id": "t1_dgdtdl0", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Yeah i agree partially.They really needed shows us what happened between 2024-2030", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah i agree partially.They really needed shows us what happened between 2024-2030&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdvp60", "score_hidden": false, "stickied": false, "created": 1492482108.0, "created_utc": 1492453308.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtdl0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solo4114", "parent_id": "t1_dgdrkzb", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Yeah, well, they didn't really demonstrate how Robin and Ted changed so that they'd work together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, well, they didn&amp;#39;t really demonstrate how Robin and Ted changed so that they&amp;#39;d work together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdtdl0", "score_hidden": false, "stickied": false, "created": 1492479542.0, "created_utc": 1492450742.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrkzb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kinginthenorthjon", "parent_id": "t1_dgdpuaw", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "And i said people change,robin and barney call nicknames on s9.Robin said he being nice about the orgasm as they only started to dating.Robin know ted is douche,but robin appreciate many of ted's things", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And i said people change,robin and barney call nicknames on s9.Robin said he being nice about the orgasm as they only started to dating.Robin know ted is douche,but robin appreciate many of ted&amp;#39;s things&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdrkzb", "score_hidden": false, "stickied": false, "created": 1492477548.0, "created_utc": 1492448748.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpuaw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solo4114", "parent_id": "t1_dgdnc1z", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "&gt; You're putting things like fake orgasm and robin hating nick names as the reason they won't work??They had small problems and they solved throughtout the way.Before dating ted her dating peroid was 2 weeks,she dated ted for a year(she never dated anyone even for 6 months after that).If they were incompactible they will not date for year(they will fight breakup just like barney and robin) In s09e022 she said she and ted being couple made sense,whereas barney and robin did not.Even she knows she and ted is better match\n\nI think we've debated this before on this sub, but put simply, successfully dating for a year in your mid 20s doesn't demonstrate your long-term compatibility.  The stuff that was mentioned?  All those little things?  Those things matter in a long-term (e.g., \"Rest of your life\") relationship.  A lot.  They're all about *how* you love someone else.  \n\nAnd, from personal experience, that is a *huge* factor in successful marriages -- and an incompatibility in that area is a huge factor in unsuccessful marriages.  Put simply, you and your partner have to basically speak the same \"language.\"  The gestures they make have to be something that you not only understand intellectually, but get instinctively, and you have to be on the same page as them to make it really work.  Over time, those \"little things\" where you're incompatible add up and grind down the love you feel for the other person.  And none of that stuff would surface within a year, because you're still very much in the \"honeymoon phase\" of life.  You're still enjoying the newness and excitement of everything.  You're willing and able to overlook imperfections, because you assume \"Oh, that's not a big deal.  Those are little things.\"  \n\nSome \"little things\" really are inconsequential.  But other stuff, stuff that gets at the core of things like how you communicate your love for another person, those things add up and matter a TON.  And Ted and Robin were just never really on the same page when it came to that stuff.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re putting things like fake orgasm and robin hating nick names as the reason they won&amp;#39;t work??They had small problems and they solved throughtout the way.Before dating ted her dating peroid was 2 weeks,she dated ted for a year(she never dated anyone even for 6 months after that).If they were incompactible they will not date for year(they will fight breakup just like barney and robin) In s09e022 she said she and ted being couple made sense,whereas barney and robin did not.Even she knows she and ted is better match&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think we&amp;#39;ve debated this before on this sub, but put simply, successfully dating for a year in your mid 20s doesn&amp;#39;t demonstrate your long-term compatibility.  The stuff that was mentioned?  All those little things?  Those things matter in a long-term (e.g., &amp;quot;Rest of your life&amp;quot;) relationship.  A lot.  They&amp;#39;re all about &lt;em&gt;how&lt;/em&gt; you love someone else.  &lt;/p&gt;\n\n&lt;p&gt;And, from personal experience, that is a &lt;em&gt;huge&lt;/em&gt; factor in successful marriages -- and an incompatibility in that area is a huge factor in unsuccessful marriages.  Put simply, you and your partner have to basically speak the same &amp;quot;language.&amp;quot;  The gestures they make have to be something that you not only understand intellectually, but get instinctively, and you have to be on the same page as them to make it really work.  Over time, those &amp;quot;little things&amp;quot; where you&amp;#39;re incompatible add up and grind down the love you feel for the other person.  And none of that stuff would surface within a year, because you&amp;#39;re still very much in the &amp;quot;honeymoon phase&amp;quot; of life.  You&amp;#39;re still enjoying the newness and excitement of everything.  You&amp;#39;re willing and able to overlook imperfections, because you assume &amp;quot;Oh, that&amp;#39;s not a big deal.  Those are little things.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;Some &amp;quot;little things&amp;quot; really are inconsequential.  But other stuff, stuff that gets at the core of things like how you communicate your love for another person, those things add up and matter a TON.  And Ted and Robin were just never really on the same page when it came to that stuff.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdpuaw", "score_hidden": false, "stickied": false, "created": 1492475621.0, "created_utc": 1492446821.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgeinn3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdnc1z", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "&gt; You're putting things like fake orgasm and robin hating nick names as the reason they won't work??They had small problems and they solved throughtout the way.Before dating ted her dating peroid was 2 weeks,she dated ted for a year(she never dated anyone even for 6 months after that).If they were incompactible they will not date for year(they will fight breakup just like barney and robin) In s09e022 she said she and ted being couple made sense,whereas barney and robin did not.Even she knows she and ted is better match\n\nYes. Sexual incompatibility is a huge factor in why many relationships don't work. I said the nicknames was a lesser thing but it was used in a montage of things Robin and Ted didn't see eye-to-eye on. I never said Ted and Robin were entirely incompatible, I'm saying they both knew they wanted different things despite their feelings for each other. And the season 9 shit is my problem, it did not match with her established view of them for the rest of the series. They were rewriting shit to make their stupid finale work.\n\n&gt; And they break because of that??,they were free people.The reason they break up is because they were terrible couple.Both of them admitted that that they are a bad couple\n\nThey wouldn't have cheated on their partners and eventually gotten married for three years if they were that terrible. And before you say they got divorced, it was because of Robin's work taking over their lives. \n\n&gt; Barney the one who made the rule,ted followed it completely.And ted was not angry about him hooking with robin,just the way he presented it.Hooking with his ex girl friend and he face the question he tried lure ted(by going to vegas).That's shows why he was worst person the group\n\nTed was absolutely angry about him hooking up with Robin, he said so. He even compared it to hooking up with his mother (which is kinda gross). Barney wanted to go to Vegas to make it up to Ted. Your bias is making this really boring.\n\n&gt; And when did barney asked her out for a actual date.He called her and asked about her period and asked her to come to the restuarant for dinner.And he ends up going with the waiter girl\n\nDo you not understand why things happen? We saw when Barney tried dating normally and being a romantic, the girlfriend dumped him for someone superficial and cruel. So Barney emulated what he thinks a real, successful man is and did the whole womanizing thing because he thought that's what he had to do to be accepted. He repeats over and over again that living like this made him feel broken and empty. And when it came time to actually approach a woman normally, like Robin, he barely knew what to do with himself. They are commitment phobes trying to open up without running away like they usually do.\n\n&gt; You said ted tried to sneek in with robin whenever he gets a chance.In his wedding day he clearly denied robin and also on her wedding day\n\nLMAO talk about scraping the barrel. \"I'll finally stop pursuing you 10 minutes before you or I walk down the aisle...but by the way here's the locket you were looking for, no big deal!\"\n\n&gt; messy,it was an inhuman action from barney.I really hate him for that.And that's one of the reasons i am glad he ended up alone\n\nSorry, why are you so offended by it? As far as I could tell, both were single and Barney wanted to make a go of it, but was being tempted by sexually available women (his old habits). He tried to wait for Robin but slipped back into his old ways and fucked it up. Trashy, sure. Inhuman? Quite the opposite. Have you never met someone who is utterly terrible at relationships?\n\n&gt; So what,like you said robin is no one's property\n\nShe's her own property, he could've said no because it's a mistake to willingly be someone's rebound.\n\n&gt; Either way barney knows she was ted ex-girlfriend(the girl he chased and dated for 1 year) part of the gang.Barney's being a shitty friend here to ted.He knows she is drunk and emotionally vulnerable still he gone for it\n\nActually if you watch the last scene closely, it's pretty obvious Robin is the one who makes the first move. And she was the one who invited him back.\n\n&gt; And dumped him again.The reason robin didn't want to marry ted is not barney(there is well written post about it, i will give you the link)\n\nActually I think Barney is the one who dumped Robin. \n\n&gt; so shelter island,something old(rain scene),atlantic city,last forever,end of aisle will not count.\n\nYou'll have to be more specific.\n\n&gt; So you're saying their incompatibility is the reason why she didn't want ted to marry stella??So what about this\n\nLike I said, jealousy. Robin was used here as a red herring. We were supposed to assume Ted would leave the wedding for Robin. Instead, Stella leaves for her own ex. \n\n&gt; Jealous??Where did she says that.She said she wanted wear it when she marries ted\n\nYou know it's a flashback to season 4 right? Just before Ted marries Stella? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re putting things like fake orgasm and robin hating nick names as the reason they won&amp;#39;t work??They had small problems and they solved throughtout the way.Before dating ted her dating peroid was 2 weeks,she dated ted for a year(she never dated anyone even for 6 months after that).If they were incompactible they will not date for year(they will fight breakup just like barney and robin) In s09e022 she said she and ted being couple made sense,whereas barney and robin did not.Even she knows she and ted is better match&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes. Sexual incompatibility is a huge factor in why many relationships don&amp;#39;t work. I said the nicknames was a lesser thing but it was used in a montage of things Robin and Ted didn&amp;#39;t see eye-to-eye on. I never said Ted and Robin were entirely incompatible, I&amp;#39;m saying they both knew they wanted different things despite their feelings for each other. And the season 9 shit is my problem, it did not match with her established view of them for the rest of the series. They were rewriting shit to make their stupid finale work.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And they break because of that??,they were free people.The reason they break up is because they were terrible couple.Both of them admitted that that they are a bad couple&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They wouldn&amp;#39;t have cheated on their partners and eventually gotten married for three years if they were that terrible. And before you say they got divorced, it was because of Robin&amp;#39;s work taking over their lives. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Barney the one who made the rule,ted followed it completely.And ted was not angry about him hooking with robin,just the way he presented it.Hooking with his ex girl friend and he face the question he tried lure ted(by going to vegas).That&amp;#39;s shows why he was worst person the group&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ted was absolutely angry about him hooking up with Robin, he said so. He even compared it to hooking up with his mother (which is kinda gross). Barney wanted to go to Vegas to make it up to Ted. Your bias is making this really boring.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And when did barney asked her out for a actual date.He called her and asked about her period and asked her to come to the restuarant for dinner.And he ends up going with the waiter girl&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you not understand why things happen? We saw when Barney tried dating normally and being a romantic, the girlfriend dumped him for someone superficial and cruel. So Barney emulated what he thinks a real, successful man is and did the whole womanizing thing because he thought that&amp;#39;s what he had to do to be accepted. He repeats over and over again that living like this made him feel broken and empty. And when it came time to actually approach a woman normally, like Robin, he barely knew what to do with himself. They are commitment phobes trying to open up without running away like they usually do.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You said ted tried to sneek in with robin whenever he gets a chance.In his wedding day he clearly denied robin and also on her wedding day&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;LMAO talk about scraping the barrel. &amp;quot;I&amp;#39;ll finally stop pursuing you 10 minutes before you or I walk down the aisle...but by the way here&amp;#39;s the locket you were looking for, no big deal!&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;messy,it was an inhuman action from barney.I really hate him for that.And that&amp;#39;s one of the reasons i am glad he ended up alone&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry, why are you so offended by it? As far as I could tell, both were single and Barney wanted to make a go of it, but was being tempted by sexually available women (his old habits). He tried to wait for Robin but slipped back into his old ways and fucked it up. Trashy, sure. Inhuman? Quite the opposite. Have you never met someone who is utterly terrible at relationships?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So what,like you said robin is no one&amp;#39;s property&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She&amp;#39;s her own property, he could&amp;#39;ve said no because it&amp;#39;s a mistake to willingly be someone&amp;#39;s rebound.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Either way barney knows she was ted ex-girlfriend(the girl he chased and dated for 1 year) part of the gang.Barney&amp;#39;s being a shitty friend here to ted.He knows she is drunk and emotionally vulnerable still he gone for it&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually if you watch the last scene closely, it&amp;#39;s pretty obvious Robin is the one who makes the first move. And she was the one who invited him back.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And dumped him again.The reason robin didn&amp;#39;t want to marry ted is not barney(there is well written post about it, i will give you the link)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually I think Barney is the one who dumped Robin. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;so shelter island,something old(rain scene),atlantic city,last forever,end of aisle will not count.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ll have to be more specific.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So you&amp;#39;re saying their incompatibility is the reason why she didn&amp;#39;t want ted to marry stella??So what about this&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like I said, jealousy. Robin was used here as a red herring. We were supposed to assume Ted would leave the wedding for Robin. Instead, Stella leaves for her own ex. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Jealous??Where did she says that.She said she wanted wear it when she marries ted&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You know it&amp;#39;s a flashback to season 4 right? Just before Ted marries Stella? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgeinn3", "score_hidden": false, "stickied": false, "created": 1492509828.0, "created_utc": 1492481028.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnc1z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kinginthenorthjon", "parent_id": "t1_dgdj4im", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "&gt; Throughout the series they listed other things that didn't work like Robin not making Ted feel needed, Robin faking orgasms, and smaller things like Robin hating nicknames Ted invented. Plus the whole thing where Ted was ready to settle down way before Robin, and how Robin never wanted kids.\n\nYou're putting things like fake orgasm and robin hating nick names as the reason they won't work??They had small problems and they solved throughtout the way.Before dating ted her dating peroid was 2 weeks,she dated ted for a year(she never dated anyone even for 6 months after that).If they were incompactible they will not date for year(they will fight breakup just like barney and robin)\nIn s09e022 she said she and ted being couple made sense,whereas barney and robin did not.Even she knows she and ted is better match\n\n&gt;&gt;Exactly. They both wanted, and went for, something casual. Then their friends literally forced them to conform to being partners and the fighting started. They were locked in a room for a day because they were nervous about commitment. I know I'm overanalysing a sitcom but it was shitty of Lily (and Marshall) to push coupledom on two people who intensely guarded their feelings\n\nAnd they break because of that??,they were free people.The reason they break up is because they were terrible couple.Both of them admitted that that they are a bad couple\n\n&gt;&gt;Yes but when Robin first says \"This never happened okay?\" he's lying in bed saying \"This never happened...this never happened...\" then can't convince himself to see it that way. And like I said within a few months he realises he's in love with her. The guilt was ridiculous anyway since Ted had broken up with Robin ages ago. Robin is not his property.\n\nBarney the one who made the rule,ted followed it completely.And ted was not angry about him hooking with robin,just the way he presented it.Hooking with his ex girl friend and he face the question   he tried lure ted(by going to vegas).That's shows why he was worst person the group\n\n&gt;&gt;The guilt was ridiculous anyway since Ted had broken up with Robin ages ago. Robin is not his property.\n\nSame can be told for ted and robin hooking up in s5\n\n&gt;&gt;It's been a while since you watched the show, hasn't it? He tried to go on a date with Robin and she didn't see it that way, so he slipped back into his old ways as self preservation (he gives that bimbo speech to Lily then when she leaves he watches Robin on TV).\n\nAnd when did barney asked her out for a actual date.He called her and asked about her period and asked her to come to the restuarant for dinner.And he ends up going with the waiter girl\n\n&gt;&gt;No they don't lol Ted settled for Stella despite barely knowing her. The dude who is supposedly all about finding the perfect girl took the first one who would have him. And got burned for it too btw. He found someone also trying to run away from leftover feelings for an ex\n\nYou said ted tried to sneek in with robin whenever he gets a chance.In his wedding day he clearly denied robin and also on her wedding day\n\n&gt;&gt;The wedding hookup attempt was messy\n\nmessy,it was an inhuman action from barney.I really hate him for that.And that's one of the reasons i am glad he ended up alone\n\n\n&gt;&gt;You really thought perfect week was a good thing? He did that because he was stressing about being fired from his job. He was trying to take his mind off it.\n\nSo he kept a playbook for that.\nYou said ted made the move on robin?? \n\n\n&gt;&gt;As far at the Ted/Robin hook up, future Ted literally says \"[The blonde hair] kept us from doing something we both would've regretted\n\nYeah right girl wrong time\n\n &gt;&gt;He still didn't stop it even if he said they drank a lot, he was still going to do it\n\nSo what,like you said robin is no one's property\n\n&gt;&gt;She invited him back to her place, we don't know how drunk she was, if at all, whether they drank once at her place, and I've already said why the \"bro code\" is both a separate and stupid issue\n\nEither way barney knows she was ted ex-girlfriend(the girl he chased and dated for 1 year) part of the gang.Barney's being a shitty friend here to ted.He knows she is drunk and emotionally vulnerable still he gone for it\n\n&gt;&gt;Yeah...and then she married someone else. Sorry Ted\n\nAnd dumped him again.The reason robin didn't want to marry ted is not barney(there is well written post about it, i will give you the link)\n\n&gt;&gt;Didn't they say that mid break up? Of course they're going to say nice things then. Point is, in season seven, she outright said she did NOT love Ted.\n\nso shelter island,something old(rain scene),atlantic city,last forever,end of aisle will not count.\n\n&gt;&gt;Everyone told Ted not to marry Stella and they were RIGHT. They could all see he was settling for her.\n\nSo you're saying  their incompatibility is the reason why she didn't want ted to marry stella??So what about this\n\nRobin: Watching you marry another woman isn't exactly something\nI was looking forward to.I don't know, I just thought\nif I ever changed my mind about marriage and kids, it was...\nIt was nice to know that you were there\n\nTed:Why are you bringing any of this up?\nThere's nothing between us anymore\n\nRobin:I mean, of course, there is.That kind of stuff just doesn't disappear\nwithout a trace.\n\n&gt;&gt;She was drunk and jealous about the Stella wedding.\n\nJealous??Where did she says that.She said she wanted wear it when she marries ted", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Throughout the series they listed other things that didn&amp;#39;t work like Robin not making Ted feel needed, Robin faking orgasms, and smaller things like Robin hating nicknames Ted invented. Plus the whole thing where Ted was ready to settle down way before Robin, and how Robin never wanted kids.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re putting things like fake orgasm and robin hating nick names as the reason they won&amp;#39;t work??They had small problems and they solved throughtout the way.Before dating ted her dating peroid was 2 weeks,she dated ted for a year(she never dated anyone even for 6 months after that).If they were incompactible they will not date for year(they will fight breakup just like barney and robin)\nIn s09e022 she said she and ted being couple made sense,whereas barney and robin did not.Even she knows she and ted is better match&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Exactly. They both wanted, and went for, something casual. Then their friends literally forced them to conform to being partners and the fighting started. They were locked in a room for a day because they were nervous about commitment. I know I&amp;#39;m overanalysing a sitcom but it was shitty of Lily (and Marshall) to push coupledom on two people who intensely guarded their feelings&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And they break because of that??,they were free people.The reason they break up is because they were terrible couple.Both of them admitted that that they are a bad couple&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Yes but when Robin first says &amp;quot;This never happened okay?&amp;quot; he&amp;#39;s lying in bed saying &amp;quot;This never happened...this never happened...&amp;quot; then can&amp;#39;t convince himself to see it that way. And like I said within a few months he realises he&amp;#39;s in love with her. The guilt was ridiculous anyway since Ted had broken up with Robin ages ago. Robin is not his property.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Barney the one who made the rule,ted followed it completely.And ted was not angry about him hooking with robin,just the way he presented it.Hooking with his ex girl friend and he face the question   he tried lure ted(by going to vegas).That&amp;#39;s shows why he was worst person the group&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;The guilt was ridiculous anyway since Ted had broken up with Robin ages ago. Robin is not his property.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Same can be told for ted and robin hooking up in s5&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s been a while since you watched the show, hasn&amp;#39;t it? He tried to go on a date with Robin and she didn&amp;#39;t see it that way, so he slipped back into his old ways as self preservation (he gives that bimbo speech to Lily then when she leaves he watches Robin on TV).&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And when did barney asked her out for a actual date.He called her and asked about her period and asked her to come to the restuarant for dinner.And he ends up going with the waiter girl&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;No they don&amp;#39;t lol Ted settled for Stella despite barely knowing her. The dude who is supposedly all about finding the perfect girl took the first one who would have him. And got burned for it too btw. He found someone also trying to run away from leftover feelings for an ex&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You said ted tried to sneek in with robin whenever he gets a chance.In his wedding day he clearly denied robin and also on her wedding day&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;The wedding hookup attempt was messy&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;messy,it was an inhuman action from barney.I really hate him for that.And that&amp;#39;s one of the reasons i am glad he ended up alone&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;You really thought perfect week was a good thing? He did that because he was stressing about being fired from his job. He was trying to take his mind off it.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So he kept a playbook for that.\nYou said ted made the move on robin?? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;As far at the Ted/Robin hook up, future Ted literally says &amp;quot;[The blonde hair] kept us from doing something we both would&amp;#39;ve regretted&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah right girl wrong time&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;He still didn&amp;#39;t stop it even if he said they drank a lot, he was still going to do it&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So what,like you said robin is no one&amp;#39;s property&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;She invited him back to her place, we don&amp;#39;t know how drunk she was, if at all, whether they drank once at her place, and I&amp;#39;ve already said why the &amp;quot;bro code&amp;quot; is both a separate and stupid issue&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Either way barney knows she was ted ex-girlfriend(the girl he chased and dated for 1 year) part of the gang.Barney&amp;#39;s being a shitty friend here to ted.He knows she is drunk and emotionally vulnerable still he gone for it&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Yeah...and then she married someone else. Sorry Ted&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And dumped him again.The reason robin didn&amp;#39;t want to marry ted is not barney(there is well written post about it, i will give you the link)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Didn&amp;#39;t they say that mid break up? Of course they&amp;#39;re going to say nice things then. Point is, in season seven, she outright said she did NOT love Ted.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;so shelter island,something old(rain scene),atlantic city,last forever,end of aisle will not count.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Everyone told Ted not to marry Stella and they were RIGHT. They could all see he was settling for her.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So you&amp;#39;re saying  their incompatibility is the reason why she didn&amp;#39;t want ted to marry stella??So what about this&lt;/p&gt;\n\n&lt;p&gt;Robin: Watching you marry another woman isn&amp;#39;t exactly something\nI was looking forward to.I don&amp;#39;t know, I just thought\nif I ever changed my mind about marriage and kids, it was...\nIt was nice to know that you were there&lt;/p&gt;\n\n&lt;p&gt;Ted:Why are you bringing any of this up?\nThere&amp;#39;s nothing between us anymore&lt;/p&gt;\n\n&lt;p&gt;Robin:I mean, of course, there is.That kind of stuff just doesn&amp;#39;t disappear\nwithout a trace.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;She was drunk and jealous about the Stella wedding.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jealous??Where did she says that.She said she wanted wear it when she marries ted&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdnc1z", "score_hidden": false, "stickied": false, "created": 1492472780.0, "created_utc": 1492443980.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdj4im", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdhvcf", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "&gt; Only problem they had was when they tried to move in together.At that time they were not ready,but after that they lived together for 3+ years\n\nThroughout the series they listed other things that didn't work like Robin not making Ted feel needed, Robin faking orgasms, and smaller things like Robin hating nicknames Ted invented. Plus the whole thing where Ted was ready to settle down way before Robin, and how Robin never wanted kids.\n\n&gt; Really?barney said that because he thought she also want something casual.And what happened when they dated,both of them were fighting the whole time.They don't have the most important thing needed in a relation-TRUST\n\nExactly. They both wanted, and went for, something casual. Then their friends literally forced them to conform to being partners and the fighting started. They were *locked in a room* for a day because they were nervous about commitment. I know I'm overanalysing a sitcom but it was shitty of Lily (and Marshall) to push coupledom on two people who intensely guarded their feelings. \n\n&gt; He felt guilty for hooking with robin,why?because of ted(also the bro code)\n\nYes but when Robin first says \"This never happened okay?\" he's lying in bed saying \"This never happened...this never happened...\" then can't convince himself to see it that way. And like I said within a few months he realises he's in love with her. The guilt was ridiculous anyway since Ted had broken up with Robin ages ago. Robin is not his property.\n\n&gt; Yes he fell in love with her.What did he right after that?Again going back to his womanizing ways.And also tried to hookup with robin on ted's wedding,when she was emotionally vulnurable,that's actually disgusting\n\nIt's been a while since you watched the show, hasn't it? He tried to go on a date with Robin and she didn't see it that way, so he slipped back into his old ways as self preservation (he gives that bimbo speech to Lily then when she leaves he watches Robin on TV). When Ted and Robin hook up he's thrown for a loop. The wedding hookup attempt was messy, sure, but like they both openly admit they're bad at relationships in the season finale. \n\n&gt; These two points contradict each other.\n\nNo they don't lol Ted settled for Stella despite barely knowing her. The dude who is supposedly all about finding the perfect girl took the first one who would have him. And got burned for it too btw. He found someone also trying to run away from leftover feelings for an ex. \n\n&gt; Really??They were pathetic together.No relationship taking,the way try to solve a conflict(robin being naked and barney walks out).They don't talk before making plans(s09e07 No Questions Asked).Most importantly they don't understand each other.And the gang tried to break them up because more pathetic day by day(relationship chicken,robin even get annoyned by barney's voice)and they both were stubborn to admit it.Finally they break up without anybody's inteference\n\nYou're missing the point. I'm saying they broke off because they felt forced into that boyfriend/girlfriend role before either were ready. So all that bad stuff happened because they felt pressured to be a certain type of couple. They even put on the appearance of perfection just to appease their friends. Barney even mentions the lack of boundaries they all have in his *proposal to Robin*.\n\n&gt; Because he care for her unlike barney who used their breakup for further enjoyement (perfect week). And which show are you watching??She was the one try to make move on him and he was the one tried to stop it(he react by saying we drink a lot).\n\nYou really thought perfect week was a good thing? He did that because he was stressing about being fired from his job. He was trying to take his mind off it. As far at the Ted/Robin hook up, future Ted literally says \"[The blonde hair] kept us from doing something we both would've regretted\". He still didn't stop it even if he said they drank a lot, he was still going to do it.\n\n&gt; And you failed to mention how barney and robin hooked up.She was under similar situation(and was pretty drunk whereas barney was not) and he hooked up with her knowing she was vulnerable(breaking bro code)\n\nShe invited him back to her place, we don't know how drunk she was, if at all, whether they drank once at her place, and I've already said why the \"bro code\" is both a separate and stupid issue. The writers enabling Ted to be possessive of Robin...probably should've been a hint they would end up together. No other show would want their lead to look so bad by hanging on so long and ending friendships post break up. \n\n&gt; Seriously,you need rewatch the series on again.In atlantic city(s02e08) she says \"i never said never\" when ted ask about her view on marriage.\n\nYeah...and then she married someone else. Sorry Ted!\n\n&gt; \"But if I was going to have someone's babies i'd have your babies\"\n\nDidn't they say that mid break up? Of course they're going to say nice things then. Point is, in season seven, she outright said she did NOT love Ted. \n\n&gt; In s04e05 robin tells ted not to marry stella.\n\n*Everyone* told Ted not to marry Stella and they were RIGHT. They could all see he was settling for her.\n\n&gt; In s08e24 it is clear that robin wanted to marry ted(robin digging up the locket and her confession to lily).\n\nShe was drunk and jealous about the Stella wedding. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Only problem they had was when they tried to move in together.At that time they were not ready,but after that they lived together for 3+ years&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Throughout the series they listed other things that didn&amp;#39;t work like Robin not making Ted feel needed, Robin faking orgasms, and smaller things like Robin hating nicknames Ted invented. Plus the whole thing where Ted was ready to settle down way before Robin, and how Robin never wanted kids.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Really?barney said that because he thought she also want something casual.And what happened when they dated,both of them were fighting the whole time.They don&amp;#39;t have the most important thing needed in a relation-TRUST&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Exactly. They both wanted, and went for, something casual. Then their friends literally forced them to conform to being partners and the fighting started. They were &lt;em&gt;locked in a room&lt;/em&gt; for a day because they were nervous about commitment. I know I&amp;#39;m overanalysing a sitcom but it was shitty of Lily (and Marshall) to push coupledom on two people who intensely guarded their feelings. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He felt guilty for hooking with robin,why?because of ted(also the bro code)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes but when Robin first says &amp;quot;This never happened okay?&amp;quot; he&amp;#39;s lying in bed saying &amp;quot;This never happened...this never happened...&amp;quot; then can&amp;#39;t convince himself to see it that way. And like I said within a few months he realises he&amp;#39;s in love with her. The guilt was ridiculous anyway since Ted had broken up with Robin ages ago. Robin is not his property.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Yes he fell in love with her.What did he right after that?Again going back to his womanizing ways.And also tried to hookup with robin on ted&amp;#39;s wedding,when she was emotionally vulnurable,that&amp;#39;s actually disgusting&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s been a while since you watched the show, hasn&amp;#39;t it? He tried to go on a date with Robin and she didn&amp;#39;t see it that way, so he slipped back into his old ways as self preservation (he gives that bimbo speech to Lily then when she leaves he watches Robin on TV). When Ted and Robin hook up he&amp;#39;s thrown for a loop. The wedding hookup attempt was messy, sure, but like they both openly admit they&amp;#39;re bad at relationships in the season finale. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;These two points contradict each other.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No they don&amp;#39;t lol Ted settled for Stella despite barely knowing her. The dude who is supposedly all about finding the perfect girl took the first one who would have him. And got burned for it too btw. He found someone also trying to run away from leftover feelings for an ex. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Really??They were pathetic together.No relationship taking,the way try to solve a conflict(robin being naked and barney walks out).They don&amp;#39;t talk before making plans(s09e07 No Questions Asked).Most importantly they don&amp;#39;t understand each other.And the gang tried to break them up because more pathetic day by day(relationship chicken,robin even get annoyned by barney&amp;#39;s voice)and they both were stubborn to admit it.Finally they break up without anybody&amp;#39;s inteference&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re missing the point. I&amp;#39;m saying they broke off because they felt forced into that boyfriend/girlfriend role before either were ready. So all that bad stuff happened because they felt pressured to be a certain type of couple. They even put on the appearance of perfection just to appease their friends. Barney even mentions the lack of boundaries they all have in his &lt;em&gt;proposal to Robin&lt;/em&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Because he care for her unlike barney who used their breakup for further enjoyement (perfect week). And which show are you watching??She was the one try to make move on him and he was the one tried to stop it(he react by saying we drink a lot).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You really thought perfect week was a good thing? He did that because he was stressing about being fired from his job. He was trying to take his mind off it. As far at the Ted/Robin hook up, future Ted literally says &amp;quot;[The blonde hair] kept us from doing something we both would&amp;#39;ve regretted&amp;quot;. He still didn&amp;#39;t stop it even if he said they drank a lot, he was still going to do it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And you failed to mention how barney and robin hooked up.She was under similar situation(and was pretty drunk whereas barney was not) and he hooked up with her knowing she was vulnerable(breaking bro code)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She invited him back to her place, we don&amp;#39;t know how drunk she was, if at all, whether they drank once at her place, and I&amp;#39;ve already said why the &amp;quot;bro code&amp;quot; is both a separate and stupid issue. The writers enabling Ted to be possessive of Robin...probably should&amp;#39;ve been a hint they would end up together. No other show would want their lead to look so bad by hanging on so long and ending friendships post break up. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Seriously,you need rewatch the series on again.In atlantic city(s02e08) she says &amp;quot;i never said never&amp;quot; when ted ask about her view on marriage.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah...and then she married someone else. Sorry Ted!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;But if I was going to have someone&amp;#39;s babies i&amp;#39;d have your babies&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Didn&amp;#39;t they say that mid break up? Of course they&amp;#39;re going to say nice things then. Point is, in season seven, she outright said she did NOT love Ted. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In s04e05 robin tells ted not to marry stella.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Everyone&lt;/em&gt; told Ted not to marry Stella and they were RIGHT. They could all see he was settling for her.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In s08e24 it is clear that robin wanted to marry ted(robin digging up the locket and her confession to lily).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She was drunk and jealous about the Stella wedding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdj4im", "score_hidden": false, "stickied": false, "created": 1492467553.0, "created_utc": 1492438753.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhvcf", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "kinginthenorthjon", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Dude you are really showing partiality here.\n\n&gt;&gt;Barney can sense Ted/Robin's incompatibility in S2 and mentions it a ton, even though he's surprised when they do actually break up. Like he didn't expect them to realise it. More Barney development was needed here\n\nOnly problem they had was when they tried to move in together.At that time they were not ready,but after that they lived together for 3+ years\n\n&gt;&gt;As far back as season one, Barney knew what a good match he and Robin were\n\nReally?barney said that because he thought she also want something casual.And what happened when they dated,both of \nthem were fighting the whole time.They don't have the most important thing needed in a relation-TRUST\n\n\n&gt;&gt;Barney cannot view their S3 hookup as meaningless no matter how hard he tries.\n\nHe felt guilty for hooking with robin,why?because of ted(also the bro code)\n\n&gt;&gt;Barney sees Robin when his life flashes before his eyes after he's hit by the bus\n\nYes he fell in love with her.What did he right after that?Again going back to his womanizing ways.And also tried to hookup with robin on ted's wedding,when she was emotionally vulnurable,that's actually disgusting\n\n&gt;&gt;I noticed how overt Barney actually was with his love/pining for Robin and how much more forward he was about that than Ted, who figuratively \"sulked\" around for literal years after he and Robin broke up, waiting for any \"in\" he thought would win her back\n\n&gt;&gt;Post-Robin Ted rushes into marriage with the first serious relationship he finds.\n\nThese two points contradict each other.\n\n&gt;&gt;Late S4 Robin is not in a good way (Woo girl and naked man) while late S4 Barney is certain he wants Robin (resulting in his taking The Leap for her in the season finale). Robin notes \"I am scared of how much I like you\" and blurts out \"lets get married\"! Her reservations come from his womanizing (understandable!) and her low self esteem. Again, more character development for Robin was needed here.\n\nYeah he wants robin and more\n\n&gt;&gt;Barney and Robin did not want to break up. They were pressured by their friends to date traditionally and it drove them apart\n\nReally??They were pathetic together.No relationship taking,the way try to solve a conflict(robin being naked and barney walks out).They don't talk before making plans(s09e07 No Questions Asked).Most importantly they don't understand each other.And the gang tried to break them up because more pathetic day by day(relationship chicken,robin even get annoyned by barney's voice)and they both were stubborn to admit it.Finally they break up without anybody's inteference\n\n&gt;&gt;Barney says his jealousy over Don is only about wanting to hook up with Robin again, but he refers to her as \"Robin Stinson\" and wants to meet Don.\n\nyeah he loves her(maybe)\n\n\n&gt;&gt;Ted, post Stella, is very cold/emotionless with relationships in S5 and is basically the \"slides into your DMs\" guy by the end of the season, letting Robin move back in (WHY) and almost hooking up with her til she stops it. Like how fucking irresponsible...\n\nBecause he care for her unlike barney who used their breakup for further enjoyement (perfect week).\nAnd which show are you watching??She was the one try to make move on him and he was the one tried to stop it(he react by saying we drink a lot).\n\n&gt;&gt;how fucking irresponsible...\n\nAnd you failed to mention how barney and robin hooked up.She was under similar situation(and was pretty drunk whereas barney was not) and he hooked up with her knowing she was vulnerable(breaking bro code)\n\n&gt;&gt;Kevin helps Robin realise she wants to settle down but she's still stuck on \"safe\" options like Kevin (or Ted...). Her initial angry reaction to Barney's engagement play, followed by her immediate yes, says above all she was looking for solid commitment (which Kevin couldn't promise) and she NEVER loved Ted (which is why Marshall pushes her to move out and Ted ends the \"at 40\" promise), get them both out of that unhealthy comfort cycle). The primary reason she got mad when Barney proposed was because it came from the playbook which was typically used for hookups only. She even says \"You really think I could kiss you?\". It didn't even occur that he'd be proposing marriage to HER so, once he did, everything she'd hoped for from Barney fell into place.\n\nSeriously,you need rewatch the series on again.In atlantic city(s02e08) she says \"i never said never\" when ted ask about her view on marriage.In something blue(s02e22) she says \n\n\"But if I was going to have someone's babies i'd have your babies\"\n\nIn s04e05 robin tells ted not to marry stella.In s08e24 it is clear that robin wanted to marry ted(robin digging up the locket and her confession to lily).\n\nSry i didn't read the rest of it\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude you are really showing partiality here.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Barney can sense Ted/Robin&amp;#39;s incompatibility in S2 and mentions it a ton, even though he&amp;#39;s surprised when they do actually break up. Like he didn&amp;#39;t expect them to realise it. More Barney development was needed here&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Only problem they had was when they tried to move in together.At that time they were not ready,but after that they lived together for 3+ years&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;As far back as season one, Barney knew what a good match he and Robin were&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Really?barney said that because he thought she also want something casual.And what happened when they dated,both of \nthem were fighting the whole time.They don&amp;#39;t have the most important thing needed in a relation-TRUST&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Barney cannot view their S3 hookup as meaningless no matter how hard he tries.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He felt guilty for hooking with robin,why?because of ted(also the bro code)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Barney sees Robin when his life flashes before his eyes after he&amp;#39;s hit by the bus&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes he fell in love with her.What did he right after that?Again going back to his womanizing ways.And also tried to hookup with robin on ted&amp;#39;s wedding,when she was emotionally vulnurable,that&amp;#39;s actually disgusting&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;I noticed how overt Barney actually was with his love/pining for Robin and how much more forward he was about that than Ted, who figuratively &amp;quot;sulked&amp;quot; around for literal years after he and Robin broke up, waiting for any &amp;quot;in&amp;quot; he thought would win her back&lt;/p&gt;\n\n&lt;p&gt;Post-Robin Ted rushes into marriage with the first serious relationship he finds.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These two points contradict each other.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Late S4 Robin is not in a good way (Woo girl and naked man) while late S4 Barney is certain he wants Robin (resulting in his taking The Leap for her in the season finale). Robin notes &amp;quot;I am scared of how much I like you&amp;quot; and blurts out &amp;quot;lets get married&amp;quot;! Her reservations come from his womanizing (understandable!) and her low self esteem. Again, more character development for Robin was needed here.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah he wants robin and more&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Barney and Robin did not want to break up. They were pressured by their friends to date traditionally and it drove them apart&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Really??They were pathetic together.No relationship taking,the way try to solve a conflict(robin being naked and barney walks out).They don&amp;#39;t talk before making plans(s09e07 No Questions Asked).Most importantly they don&amp;#39;t understand each other.And the gang tried to break them up because more pathetic day by day(relationship chicken,robin even get annoyned by barney&amp;#39;s voice)and they both were stubborn to admit it.Finally they break up without anybody&amp;#39;s inteference&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Barney says his jealousy over Don is only about wanting to hook up with Robin again, but he refers to her as &amp;quot;Robin Stinson&amp;quot; and wants to meet Don.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;yeah he loves her(maybe)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Ted, post Stella, is very cold/emotionless with relationships in S5 and is basically the &amp;quot;slides into your DMs&amp;quot; guy by the end of the season, letting Robin move back in (WHY) and almost hooking up with her til she stops it. Like how fucking irresponsible...&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because he care for her unlike barney who used their breakup for further enjoyement (perfect week).\nAnd which show are you watching??She was the one try to make move on him and he was the one tried to stop it(he react by saying we drink a lot).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;how fucking irresponsible...&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And you failed to mention how barney and robin hooked up.She was under similar situation(and was pretty drunk whereas barney was not) and he hooked up with her knowing she was vulnerable(breaking bro code)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Kevin helps Robin realise she wants to settle down but she&amp;#39;s still stuck on &amp;quot;safe&amp;quot; options like Kevin (or Ted...). Her initial angry reaction to Barney&amp;#39;s engagement play, followed by her immediate yes, says above all she was looking for solid commitment (which Kevin couldn&amp;#39;t promise) and she NEVER loved Ted (which is why Marshall pushes her to move out and Ted ends the &amp;quot;at 40&amp;quot; promise), get them both out of that unhealthy comfort cycle). The primary reason she got mad when Barney proposed was because it came from the playbook which was typically used for hookups only. She even says &amp;quot;You really think I could kiss you?&amp;quot;. It didn&amp;#39;t even occur that he&amp;#39;d be proposing marriage to HER so, once he did, everything she&amp;#39;d hoped for from Barney fell into place.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Seriously,you need rewatch the series on again.In atlantic city(s02e08) she says &amp;quot;i never said never&amp;quot; when ted ask about her view on marriage.In something blue(s02e22) she says &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But if I was going to have someone&amp;#39;s babies i&amp;#39;d have your babies&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In s04e05 robin tells ted not to marry stella.In s08e24 it is clear that robin wanted to marry ted(robin digging up the locket and her confession to lily).&lt;/p&gt;\n\n&lt;p&gt;Sry i didn&amp;#39;t read the rest of it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdhvcf", "score_hidden": false, "stickied": false, "created": 1492465748.0, "created_utc": 1492436948.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgehpbo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdq3gt", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "See I'd say they were healthy for one another. I don't know if B/R were healthy in the textbook sense. But they were two highly dysfunctional, non-traditional people who had traumatic teen years they needed to recover from. They were good for one another.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See I&amp;#39;d say they were healthy for one another. I don&amp;#39;t know if B/R were healthy in the textbook sense. But they were two highly dysfunctional, non-traditional people who had traumatic teen years they needed to recover from. They were good for one another.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgehpbo", "score_hidden": false, "stickied": false, "created": 1492508695.0, "created_utc": 1492479895.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq3gt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Itsafinelife", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I love all these points you've made! Sometimes I tell people that I think Robin and Barney were soul mates from the beginning and they look at me like I'm crazy and start talking about how cute of a couple Ted and Robin were. Ted and Robin were not a healthy couple. Barney and Robin are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love all these points you&amp;#39;ve made! Sometimes I tell people that I think Robin and Barney were soul mates from the beginning and they look at me like I&amp;#39;m crazy and start talking about how cute of a couple Ted and Robin were. Ted and Robin were not a healthy couple. Barney and Robin are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdq3gt", "score_hidden": false, "stickied": false, "created": 1492475901.0, "created_utc": 1492447101.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgehg0v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dge7udq", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Yep, this was a sad realisation on rewatch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, this was a sad realisation on rewatch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgehg0v", "score_hidden": false, "stickied": false, "created": 1492508391.0, "created_utc": 1492479591.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge7udq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Daxter85", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Instead of analysing like all of you I'm just going to say one thing\n\nRobin's character is so inconsistent throughout the series, this is because she's there to serve the plot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instead of analysing like all of you I&amp;#39;m just going to say one thing&lt;/p&gt;\n\n&lt;p&gt;Robin&amp;#39;s character is so inconsistent throughout the series, this is because she&amp;#39;s there to serve the plot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge7udq", "score_hidden": false, "stickied": false, "created": 1492496148.0, "created_utc": 1492467348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dge2rm8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AvatarTHW", "parent_id": "t1_dgdi4te", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "The Karate Kid theory, friend. Barney is the hero the whole time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Karate Kid theory, friend. Barney is the hero the whole time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge2rm8", "score_hidden": false, "stickied": false, "created": 1492490077.0, "created_utc": 1492461277.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdi4te", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdhv89", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Agreed. I honestly think the writers relied too much on the womanizing jokes when they didn't need to. Barney was an engaging character on his own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. I honestly think the writers relied too much on the womanizing jokes when they didn&amp;#39;t need to. Barney was an engaging character on his own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdi4te", "score_hidden": false, "stickied": false, "created": 1492466146.0, "created_utc": 1492437346.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhv89", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kitten712", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Barney &gt; Ted", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Barney &amp;gt; Ted&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdhv89", "score_hidden": false, "stickied": false, "created": 1492465744.0, "created_utc": 1492436944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dge3ozm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thisnamehasfivewords", "parent_id": "t1_dgdonyi", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "You've really hit the nail on the head for how I feel about Ted. But this is also a huge part of what irritates me about Ted. The fact that he can't let go of his ideals of \"the one\" and just imposes that on Robin over *nine years* and can't let her go because she still fits in this mould he's created in his mind of what the perfect woman for him is just so frustrating. That's why I hate that Ted goes after Robin again at the end, I hate that it's implied she goes along with it, and I hate that Robin and Barney broke up because they really made each other better people when they were together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve really hit the nail on the head for how I feel about Ted. But this is also a huge part of what irritates me about Ted. The fact that he can&amp;#39;t let go of his ideals of &amp;quot;the one&amp;quot; and just imposes that on Robin over &lt;em&gt;nine years&lt;/em&gt; and can&amp;#39;t let her go because she still fits in this mould he&amp;#39;s created in his mind of what the perfect woman for him is just so frustrating. That&amp;#39;s why I hate that Ted goes after Robin again at the end, I hate that it&amp;#39;s implied she goes along with it, and I hate that Robin and Barney broke up because they really made each other better people when they were together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge3ozm", "score_hidden": false, "stickied": false, "created": 1492491114.0, "created_utc": 1492462314.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdppe9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "harambe__lover", "parent_id": "t1_dgdonyi", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I'm on mobile so can't reply to the extent you have but yes, 100% I agree. Ted is in love with the idea of a perfect life, he likes the journey, which is why Tracey was perfect for him. Both hopeless romanticists and he can be as corny as he wants, he likes the chase. \nIn some ways, Ted and Barney are more similar than they seem. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m on mobile so can&amp;#39;t reply to the extent you have but yes, 100% I agree. Ted is in love with the idea of a perfect life, he likes the journey, which is why Tracey was perfect for him. Both hopeless romanticists and he can be as corny as he wants, he likes the chase. \nIn some ways, Ted and Barney are more similar than they seem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdppe9", "score_hidden": false, "stickied": false, "created": 1492475467.0, "created_utc": 1492446667.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdppzm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "harambe__lover", "parent_id": "t1_dgdonyi", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Also, I'd gild that if I had the money ahahaha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, I&amp;#39;d gild that if I had the money ahahaha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdppzm", "score_hidden": false, "stickied": false, "created": 1492475485.0, "created_utc": 1492446685.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgejlh9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdonyi", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Great post, completely agree. \n\nFor me, he really should've had the shit kicked out of him when he lost Victoria again. I felt so bad for her in that moment but I thought that would shake Ted to his core as well. Instead he went into even darker territory with the destructive dating of the 20 year old and Jeanette. \n\nAnd the tragedy of the final scene where he goes to get back with Robin is we don't know Future Ted at all. We know he's matured a great deal and had his best relationship with The One but is he good for going back to Robin? We know she's in a terrible way, is he any better? We just have to assume they were somehow in the right place emotionally. Don't even get me started on how seeing them together again would've probably destroyed Barney.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post, completely agree. &lt;/p&gt;\n\n&lt;p&gt;For me, he really should&amp;#39;ve had the shit kicked out of him when he lost Victoria again. I felt so bad for her in that moment but I thought that would shake Ted to his core as well. Instead he went into even darker territory with the destructive dating of the 20 year old and Jeanette. &lt;/p&gt;\n\n&lt;p&gt;And the tragedy of the final scene where he goes to get back with Robin is we don&amp;#39;t know Future Ted at all. We know he&amp;#39;s matured a great deal and had his best relationship with The One but is he good for going back to Robin? We know she&amp;#39;s in a terrible way, is he any better? We just have to assume they were somehow in the right place emotionally. Don&amp;#39;t even get me started on how seeing them together again would&amp;#39;ve probably destroyed Barney.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgejlh9", "score_hidden": false, "stickied": false, "created": 1492510918.0, "created_utc": 1492482118.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdonyi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Solo4114", "parent_id": "t1_dgdgu4a", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I think Ted's love is...complicated.  It operates on multiple levels, but at the end of the day, it's all a kind of \"love\" that is colored by inexperience, idealism, and fantasy.  That and, to a lesser extent, fear and myopia.  \n\nI would say that, for Ted, a big part of what drives him is that he is in love with the *idea* of his perfect future life, and his ideal woman.  His fixation on Robin comes from two angles.  Well, three.  First, she's really attractive and generally a great person (especially early on).  So, hey, what's not to like?  But second, she comes to represent a potential for the kind of life Ted wants to have.  The problem becomes that, third, he cannot see *past* Robin to what life might look like otherwise, with someone else, and cannot think in an abstract sense, because....she's *right there, dude!*  And he came *so* close with her (in his mind -- in reality, not really).\n\nIt's really, really difficult to see past someone to whom you're *incredibly* attracted -- even if they are objectively wrong for you, or clearly don't feel about you the way you want them to -- especially if they are in your life on any regular basis. It's bad enough to have fixed in your mind the notion that someone is ideal for you because they're as close to your idea of \"perfect\" as you've come (but are, obviously, *not* perfect or else they'd have reciprocated your interest at the same level), but to have them around all the time?  Part of your friends group?  That's torture.  That makes it almost impossible to move on.\n\nSo, that's a big part of Ted's love.  I think for Ted, Robin is less Robin-as-Robin, and more Robin-as-representative-of-Ted's-ideal-woman.  Ted is as fixated on her as he is because he's invested her with all of the qualities of his ideal woman -- regardless of whether she actually has those qualities.  That and Ted (because he can't see past Robin) can't imagine anything outside of Robin, because her presence obscures everything.  So, he can't imagine \"Hey, what would it be like to find someone who has many of her qualities, but who also is affectionate and loving, rather than distant or \"My presence implies my love for you\" or whathaveyou?\"  He can't imagine \"What would it be like to find someone who is into a lot of the same stuff as me, and who appreciates my quirks, but who also is enthusiastic about the idea of having kids?\"  Basically, he's in love mostly with a fantasy version of Robin -- an *idea* of her, rather than Robin herself.  Or at least, the degree to which he's fixated on her is driven (in my opinion) by that extra factor, beyond just who Robin is as a person.\n\n\nI think a ton of Ted's behavior in the show is also driven by his notion that \"This is enough\" and \"I'll take what I can get.\"  For as much of a dreamer as he is, I think he's actually incapable or afraid to dream bigger than that, and take the bigger risk: that there may not actually be anyone \"better\" than Robin, and his quest for his ideal woman is a fruitless one.  It can be scary, if you've built up this notion of what perfection is and devoted a ton of time to pursuing it, to contemplate (A) \"What if I'm wrong?\" or (B) \"What if I never find it?\"  I think part of Ted's pursuit of Robin is based on not wanting to confront those questions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Ted&amp;#39;s love is...complicated.  It operates on multiple levels, but at the end of the day, it&amp;#39;s all a kind of &amp;quot;love&amp;quot; that is colored by inexperience, idealism, and fantasy.  That and, to a lesser extent, fear and myopia.  &lt;/p&gt;\n\n&lt;p&gt;I would say that, for Ted, a big part of what drives him is that he is in love with the &lt;em&gt;idea&lt;/em&gt; of his perfect future life, and his ideal woman.  His fixation on Robin comes from two angles.  Well, three.  First, she&amp;#39;s really attractive and generally a great person (especially early on).  So, hey, what&amp;#39;s not to like?  But second, she comes to represent a potential for the kind of life Ted wants to have.  The problem becomes that, third, he cannot see &lt;em&gt;past&lt;/em&gt; Robin to what life might look like otherwise, with someone else, and cannot think in an abstract sense, because....she&amp;#39;s &lt;em&gt;right there, dude!&lt;/em&gt;  And he came &lt;em&gt;so&lt;/em&gt; close with her (in his mind -- in reality, not really).&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s really, really difficult to see past someone to whom you&amp;#39;re &lt;em&gt;incredibly&lt;/em&gt; attracted -- even if they are objectively wrong for you, or clearly don&amp;#39;t feel about you the way you want them to -- especially if they are in your life on any regular basis. It&amp;#39;s bad enough to have fixed in your mind the notion that someone is ideal for you because they&amp;#39;re as close to your idea of &amp;quot;perfect&amp;quot; as you&amp;#39;ve come (but are, obviously, &lt;em&gt;not&lt;/em&gt; perfect or else they&amp;#39;d have reciprocated your interest at the same level), but to have them around all the time?  Part of your friends group?  That&amp;#39;s torture.  That makes it almost impossible to move on.&lt;/p&gt;\n\n&lt;p&gt;So, that&amp;#39;s a big part of Ted&amp;#39;s love.  I think for Ted, Robin is less Robin-as-Robin, and more Robin-as-representative-of-Ted&amp;#39;s-ideal-woman.  Ted is as fixated on her as he is because he&amp;#39;s invested her with all of the qualities of his ideal woman -- regardless of whether she actually has those qualities.  That and Ted (because he can&amp;#39;t see past Robin) can&amp;#39;t imagine anything outside of Robin, because her presence obscures everything.  So, he can&amp;#39;t imagine &amp;quot;Hey, what would it be like to find someone who has many of her qualities, but who also is affectionate and loving, rather than distant or &amp;quot;My presence implies my love for you&amp;quot; or whathaveyou?&amp;quot;  He can&amp;#39;t imagine &amp;quot;What would it be like to find someone who is into a lot of the same stuff as me, and who appreciates my quirks, but who also is enthusiastic about the idea of having kids?&amp;quot;  Basically, he&amp;#39;s in love mostly with a fantasy version of Robin -- an &lt;em&gt;idea&lt;/em&gt; of her, rather than Robin herself.  Or at least, the degree to which he&amp;#39;s fixated on her is driven (in my opinion) by that extra factor, beyond just who Robin is as a person.&lt;/p&gt;\n\n&lt;p&gt;I think a ton of Ted&amp;#39;s behavior in the show is also driven by his notion that &amp;quot;This is enough&amp;quot; and &amp;quot;I&amp;#39;ll take what I can get.&amp;quot;  For as much of a dreamer as he is, I think he&amp;#39;s actually incapable or afraid to dream bigger than that, and take the bigger risk: that there may not actually be anyone &amp;quot;better&amp;quot; than Robin, and his quest for his ideal woman is a fruitless one.  It can be scary, if you&amp;#39;ve built up this notion of what perfection is and devoted a ton of time to pursuing it, to contemplate (A) &amp;quot;What if I&amp;#39;m wrong?&amp;quot; or (B) &amp;quot;What if I never find it?&amp;quot;  I think part of Ted&amp;#39;s pursuit of Robin is based on not wanting to confront those questions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdonyi", "score_hidden": false, "stickied": false, "created": 1492474302.0, "created_utc": 1492445502.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdkj8y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harambe__lover", "parent_id": "t1_dgdjbw8", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I agree with what you're saying, Barney probably had grown into a good character by the end of the series but I simply did not like him. Just a bad person for me. I liked ted because I could kind of see a bit of him in me (the hopeless romantic)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with what you&amp;#39;re saying, Barney probably had grown into a good character by the end of the series but I simply did not like him. Just a bad person for me. I liked ted because I could kind of see a bit of him in me (the hopeless romantic)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdkj8y", "score_hidden": false, "stickied": false, "created": 1492469424.0, "created_utc": 1492440624.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjbw8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdj1qy", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I just don't find him likeable or compelling this time around. I was invested in his journey back when I thought it was going to end amazingly, I think. The episodes he has with Tracey are his best, the actors fit perfectly and their brief time together was the most admirable Ted ever was. Such a shame it was all given a backseat to Ted/Robin, which barely anyone was actively rooting for by the end of the series.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just don&amp;#39;t find him likeable or compelling this time around. I was invested in his journey back when I thought it was going to end amazingly, I think. The episodes he has with Tracey are his best, the actors fit perfectly and their brief time together was the most admirable Ted ever was. Such a shame it was all given a backseat to Ted/Robin, which barely anyone was actively rooting for by the end of the series.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdjbw8", "score_hidden": false, "stickied": false, "created": 1492467838.0, "created_utc": 1492439038.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdj1qy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harambe__lover", "parent_id": "t1_dgdi7c0", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "For me, yes it's just too much effort given to someone who doesn't love you back, even going to Stella would be stupid.\nBut for Ted? Perfectly in line with his character", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me, yes it&amp;#39;s just too much effort given to someone who doesn&amp;#39;t love you back, even going to Stella would be stupid.\nBut for Ted? Perfectly in line with his character&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdj1qy", "score_hidden": false, "stickied": false, "created": 1492467445.0, "created_utc": 1492438645.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdurmb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kinginthenorthjon", "parent_id": "t1_dgdtnmp", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I am only talking about that scene.For ted his friendship is important. Ted will do the same thing  if any other member is in the same situation.Ted comes to the scene because he knows something was not right(nah it's stupid\").Robin is the one who changed the tone of the scene", "edited": 1492452530.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am only talking about that scene.For ted his friendship is important. Ted will do the same thing  if any other member is in the same situation.Ted comes to the scene because he knows something was not right(nah it&amp;#39;s stupid&amp;quot;).Robin is the one who changed the tone of the scene&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdurmb", "score_hidden": false, "stickied": false, "created": 1492481062.0, "created_utc": 1492452262.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtnmp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Solo4114", "parent_id": "t1_dgdrdmq", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Knowing that Barney was called first isn't the point.  Ted will go if Robin calls because Ted wants to show Robin he's the right guy for her.  Always.  Every time.  Under any circumstances.  That remains true until he finally, for real, no we're really serious this time, no foolin' lets her go in a weird CGI balloon shot.\n\nThe show had several points in its run where they could've let Ted walk away from Robin fully.  Each time, they wound up undoing that down the road, and showing that Ted was still fixated on her.  \n\nTed's go-to move is a big demonstrative gesture of how much he loves another person.  That's what he always does.  He goes big.  I believe he goes big because he's focused on the demonstrative quality of the gesture and its statement *about him.*  It's a way for him to show \"I'm worthy.  I'm the right guy.\"  And that's true with Robin or really anyone where he \"went big.\"  That's different from a big, demonstrative gesture where it doesn't matter what the other person thinks of him, and it's done *purely* to make the other person happy.  \n\nOne version is done from a place of insecurity and a need to \"win someone over.\"  The other is done from a place of security and a simple desire to make the other person happy, regardless of whether it changes their feelings towards you.\n\nI would argue that, until Tracy, Ted never really did the latter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Knowing that Barney was called first isn&amp;#39;t the point.  Ted will go if Robin calls because Ted wants to show Robin he&amp;#39;s the right guy for her.  Always.  Every time.  Under any circumstances.  That remains true until he finally, for real, no we&amp;#39;re really serious this time, no foolin&amp;#39; lets her go in a weird CGI balloon shot.&lt;/p&gt;\n\n&lt;p&gt;The show had several points in its run where they could&amp;#39;ve let Ted walk away from Robin fully.  Each time, they wound up undoing that down the road, and showing that Ted was still fixated on her.  &lt;/p&gt;\n\n&lt;p&gt;Ted&amp;#39;s go-to move is a big demonstrative gesture of how much he loves another person.  That&amp;#39;s what he always does.  He goes big.  I believe he goes big because he&amp;#39;s focused on the demonstrative quality of the gesture and its statement &lt;em&gt;about him.&lt;/em&gt;  It&amp;#39;s a way for him to show &amp;quot;I&amp;#39;m worthy.  I&amp;#39;m the right guy.&amp;quot;  And that&amp;#39;s true with Robin or really anyone where he &amp;quot;went big.&amp;quot;  That&amp;#39;s different from a big, demonstrative gesture where it doesn&amp;#39;t matter what the other person thinks of him, and it&amp;#39;s done &lt;em&gt;purely&lt;/em&gt; to make the other person happy.  &lt;/p&gt;\n\n&lt;p&gt;One version is done from a place of insecurity and a need to &amp;quot;win someone over.&amp;quot;  The other is done from a place of security and a simple desire to make the other person happy, regardless of whether it changes their feelings towards you.&lt;/p&gt;\n\n&lt;p&gt;I would argue that, until Tracy, Ted never really did the latter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdtnmp", "score_hidden": false, "stickied": false, "created": 1492479845.0, "created_utc": 1492451045.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgdwpoq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Amber_82", "parent_id": "t1_dgdrdmq", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "This. And of course Barney blamed Ted for that. Why didn't he talk to Robin about it if their engagement was so solid? Barney should have shown up when she called. All Ted did that whole weekend was push Robin towards Barney.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. And of course Barney blamed Ted for that. Why didn&amp;#39;t he talk to Robin about it if their engagement was so solid? Barney should have shown up when she called. All Ted did that whole weekend was push Robin towards Barney.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdwpoq", "score_hidden": false, "stickied": false, "created": 1492483253.0, "created_utc": 1492454453.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrdmq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kinginthenorthjon", "parent_id": "t1_dgdpfg0", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "sry i disagree.He goes there because he loves her and he will do anything to make her happy.And also ted never known that robin tried  to contact barney until he arrived there.In their conversation ted says marrying barney is the right decision.In that scene ted done nothing to show that he is better than barney.At the end when robin grabs ted's hand,ted breaks it and leave from there..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sry i disagree.He goes there because he loves her and he will do anything to make her happy.And also ted never known that robin tried  to contact barney until he arrived there.In their conversation ted says marrying barney is the right decision.In that scene ted done nothing to show that he is better than barney.At the end when robin grabs ted&amp;#39;s hand,ted breaks it and leave from there..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdrdmq", "score_hidden": false, "stickied": false, "created": 1492477319.0, "created_utc": 1492448519.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpfg0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Solo4114", "parent_id": "t1_dgdnj8f", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Dude.  Come on.  It's inappropriate because it's not just him \"helping out a buddy in a time of need.\" It's driven entirely by Ted's desire to demonstrate to Robin that she should be picking him.  He says (I think in the same episode) that he would open up a vein and bleed out the locket if he could, just to make her happy.  For Ted, it's all about demonstrating that he's right for her (and, implicitly, that Barney isn't).\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude.  Come on.  It&amp;#39;s inappropriate because it&amp;#39;s not just him &amp;quot;helping out a buddy in a time of need.&amp;quot; It&amp;#39;s driven entirely by Ted&amp;#39;s desire to demonstrate to Robin that she should be picking him.  He says (I think in the same episode) that he would open up a vein and bleed out the locket if he could, just to make her happy.  For Ted, it&amp;#39;s all about demonstrating that he&amp;#39;s right for her (and, implicitly, that Barney isn&amp;#39;t).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdpfg0", "score_hidden": false, "stickied": false, "created": 1492475159.0, "created_utc": 1492446359.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgehvta", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdnj8f", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "The problem is there are supposed to be boundaries. You don't go swooping in to save the day then go \"Oh no, look at all these old feelings coming back up!\". Then calling exes to track it down? He was doing this because he *still* even in the lead up to Robin's wedding felt entitled to \"win\" her like a prize. Let's not forget way back in the second episode of the series he compares himself to the kid who gets stuck in the game machine trying to win a prize.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is there are supposed to be boundaries. You don&amp;#39;t go swooping in to save the day then go &amp;quot;Oh no, look at all these old feelings coming back up!&amp;quot;. Then calling exes to track it down? He was doing this because he &lt;em&gt;still&lt;/em&gt; even in the lead up to Robin&amp;#39;s wedding felt entitled to &amp;quot;win&amp;quot; her like a prize. Let&amp;#39;s not forget way back in the second episode of the series he compares himself to the kid who gets stuck in the game machine trying to win a prize.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgehvta", "score_hidden": false, "stickied": false, "created": 1492508902.0, "created_utc": 1492480102.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnj8f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kinginthenorthjon", "parent_id": "t1_dgdi7c0", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "why is that inappropriate??Robin called barney first but he was busy playing lasertag,whereas ted left his interview inorder to help his friend.Also you said robin didn't love ted,so what the problem here??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why is that inappropriate??Robin called barney first but he was busy playing lasertag,whereas ted left his interview inorder to help his friend.Also you said robin didn&amp;#39;t love ted,so what the problem here??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdnj8f", "score_hidden": false, "stickied": false, "created": 1492473012.0, "created_utc": 1492444212.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdi7c0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdgu4a", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "What about the locket shit though? Doesn't that just strike you as way inappropriate?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about the locket shit though? Doesn&amp;#39;t that just strike you as way inappropriate?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdi7c0", "score_hidden": false, "stickied": false, "created": 1492466251.0, "created_utc": 1492437451.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgu4a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "harambe__lover", "parent_id": "t1_dgdgnv0", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Personally I feel that Ted was meant to represent the kind of love that's unconditional, almost Romeo and Juliet-esque and to an extent the soppy love that he has and shows throughout the show ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally I feel that Ted was meant to represent the kind of love that&amp;#39;s unconditional, almost Romeo and Juliet-esque and to an extent the soppy love that he has and shows throughout the show &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdgu4a", "score_hidden": false, "stickied": false, "created": 1492464119.0, "created_utc": 1492435319.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dge52e8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "safarisparkles", "parent_id": "t1_dgdgnv0", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "It comes back around again", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It comes back around again&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dge52e8", "score_hidden": false, "stickied": false, "created": 1492492713.0, "created_utc": 1492463913.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgnv0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgdfroo", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I honestly liked him the first viewing but he's really grossing me out this time around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I honestly liked him the first viewing but he&amp;#39;s really grossing me out this time around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdgnv0", "score_hidden": false, "stickied": false, "created": 1492463845.0, "created_utc": 1492435045.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfroo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harambe__lover", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I'm guessing you're not a fan of Ted?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m guessing you&amp;#39;re not a fan of Ted?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgdfroo", "score_hidden": false, "stickied": false, "created": 1492462291.0, "created_utc": 1492433491.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcqy", "removal_reason": null, "link_id": "t3_65uzgg", "likes": null, "replies": "", "user_reports": [], "id": "dgehbvf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DMCofSourcefed", "parent_id": "t1_dgehb1u", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "It is in my heart ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is in my heart &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgehbvf", "score_hidden": false, "stickied": false, "created": 1492508249.0, "created_utc": 1492479449.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehb1u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fifthchevron", "parent_id": "t1_dgeffix", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "Alternate ending isn't official though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alternate ending isn&amp;#39;t official though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgehb1u", "score_hidden": false, "stickied": false, "created": 1492508223.0, "created_utc": 1492479423.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeffix", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DMCofSourcefed", "parent_id": "t3_65uzgg", "subreddit_name_prefixed": "r/HIMYM", "controversiality": 0, "body": "I'm pretty sure it's hinted in the alternate ending they got back together. At ted's wedding it shows Barney and says \"sometimes things fall apart\" and them cuts to Robin smiling at him and says \"sometimes things come back together\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure it&amp;#39;s hinted in the alternate ending they got back together. At ted&amp;#39;s wedding it shows Barney and says &amp;quot;sometimes things fall apart&amp;quot; and them cuts to Robin smiling at him and says &amp;quot;sometimes things come back together&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HIMYM", "name": "t1_dgeffix", "score_hidden": false, "stickied": false, "created": 1492505874.0, "created_utc": 1492477074.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]