[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Foodforthought", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qke8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "Lightfiend", "saved": false, "mod_reports": [], "name": "t3_64qke8", "subreddit_name_prefixed": "r/Foodforthought", "approved_by": null, "over_18": false, "domain": "aeon.co", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rete", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Foodforthought/comments/64qke8/are_human_rights_anything_more_than_legal/", "num_reports": null, "locked": false, "stickied": false, "created": 1491943282.0, "url": "https://aeon.co/ideas/are-human-rights-anything-more-than-legal-conventions", "author_flair_text": null, "quarantine": false, "title": "Are human rights anything more than legal conventions?", "created_utc": 1491914482.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": "", "user_reports": [], "id": "dg4u1nj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nope_nic_tesla", "parent_id": "t1_dg4tn5o", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "Natural law philosophy predates medieval theology by a few thousand years and isn't necessarily the same as our modern conceptions of human rights. Some people use natural law to argue for harsh restrictions on human rights (indeed this is what many churches do). Thomas Hobbes' Leviathan justifying a strict authoritarian monarchical state for example is rooted in natural law philosophy yet is in conflict with modern ideals of democracy, freedom of speech, etc. \n\n&gt;I'm not saying secular people aren't moral; my point is that they have no philosophical reason to be.\n\nRead Kant, Rawls, Aristotle, Hume, Mill, Rousseau or many other authors on moral philosophy. Very little of it is based upon religion. ", "edited": 1491941357.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Natural law philosophy predates medieval theology by a few thousand years and isn&amp;#39;t necessarily the same as our modern conceptions of human rights. Some people use natural law to argue for harsh restrictions on human rights (indeed this is what many churches do). Thomas Hobbes&amp;#39; Leviathan justifying a strict authoritarian monarchical state for example is rooted in natural law philosophy yet is in conflict with modern ideals of democracy, freedom of speech, etc. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not saying secular people aren&amp;#39;t moral; my point is that they have no philosophical reason to be.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Read Kant, Rawls, Aristotle, Hume, Mill, Rousseau or many other authors on moral philosophy. Very little of it is based upon religion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4u1nj", "score_hidden": false, "stickied": false, "created": 1491969903.0, "created_utc": 1491941103.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tn5o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "revchj", "parent_id": "t1_dg4ms4g", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "My understanding is that it developed out of the Natural Law tradition within medieval theology. I would argue that the Enlightenment was not a radical break from Protestantism but rather an outgrowth from it (and coexists quite happily with it in some quarters; I suspect a Hegelian dialectic is in process, but that's just my own speculation).\n\nI'm not saying secular people aren't moral; my point is that they have no philosophical reason to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My understanding is that it developed out of the Natural Law tradition within medieval theology. I would argue that the Enlightenment was not a radical break from Protestantism but rather an outgrowth from it (and coexists quite happily with it in some quarters; I suspect a Hegelian dialectic is in process, but that&amp;#39;s just my own speculation).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying secular people aren&amp;#39;t moral; my point is that they have no philosophical reason to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4tn5o", "score_hidden": false, "stickied": false, "created": 1491969458.0, "created_utc": 1491940658.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ms4g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nope_nic_tesla", "parent_id": "t1_dg4jlym", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "Christianity isn't the basis of Enlightenment philosophy from which most of our understanding of human rights comes from, your entire premise is nonsense. On the contrary, in many cases Enlightenment ideals were in direct conflict with the churches of the time. Nor does secular thinking mean that there is no such thing as morality. Your claim that human rights were a gift from Christianity is absurd and utterly void of historical knowledge and moral philosophy", "edited": 1491933462.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Christianity isn&amp;#39;t the basis of Enlightenment philosophy from which most of our understanding of human rights comes from, your entire premise is nonsense. On the contrary, in many cases Enlightenment ideals were in direct conflict with the churches of the time. Nor does secular thinking mean that there is no such thing as morality. Your claim that human rights were a gift from Christianity is absurd and utterly void of historical knowledge and moral philosophy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4ms4g", "score_hidden": false, "stickied": false, "created": 1491962049.0, "created_utc": 1491933249.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": "", "user_reports": [], "id": "dg4y9uc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mors_videt", "parent_id": "t1_dg4v8ax", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "Regarding my edit, if something can't be said the way I would want to hear it, it shouldn't be said :) I'm trying hard to remember that when talking to strangers.\n\nInterestingly, you just said a lot of things I agree with. I'm on work, on mobile, so my response will be limited, but I agree that modern thought is informed be Christian principles, that they influence modern secular morality, and that absolute rights require theism.\n\nI'd like to comment that I didn't actually mean that you sound self righteous, I meant that atheists see Christians doing things they think are bad while saying that their philosophy is the definition of goodness. It's the philosophy that seems self righteous. \n\nWhen you're talking to a community that will be outraged at \"your\" for \"you're\" and you're already fighting uphill for supporting Christianity, I recommend that you be very careful to only make defensible statements if your goal is communication, that was my point about the history of philosophy. \n\nAbout morality in general, I think religious views allow a lot of intolerance, given the interpretation, so I don't see actual evidence for any religion promoting what I think of as human rights in general despite the fact that Jesus in the Bible certainly did and Pope Francis seems to. Those guys are great though.\n\nMy preferred take on rights is that we don't need absolute rights at all and I don't think they exist. I do think that humans can agree on rights together, and this is all the word means anyway.\n\nIf you are personally inspired to behave more like Jesus, then I think this is an unqualified good. Whatever causes that inspiration. \n\nJesus told a parable about a father with two sons. The one son told his father he would obey and did not. The other son told his father he would ignore instruction but did the right thing anyway. This sums up my personal view.\n\nCheers to you as well\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regarding my edit, if something can&amp;#39;t be said the way I would want to hear it, it shouldn&amp;#39;t be said :) I&amp;#39;m trying hard to remember that when talking to strangers.&lt;/p&gt;\n\n&lt;p&gt;Interestingly, you just said a lot of things I agree with. I&amp;#39;m on work, on mobile, so my response will be limited, but I agree that modern thought is informed be Christian principles, that they influence modern secular morality, and that absolute rights require theism.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to comment that I didn&amp;#39;t actually mean that you sound self righteous, I meant that atheists see Christians doing things they think are bad while saying that their philosophy is the definition of goodness. It&amp;#39;s the philosophy that seems self righteous. &lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re talking to a community that will be outraged at &amp;quot;your&amp;quot; for &amp;quot;you&amp;#39;re&amp;quot; and you&amp;#39;re already fighting uphill for supporting Christianity, I recommend that you be very careful to only make defensible statements if your goal is communication, that was my point about the history of philosophy. &lt;/p&gt;\n\n&lt;p&gt;About morality in general, I think religious views allow a lot of intolerance, given the interpretation, so I don&amp;#39;t see actual evidence for any religion promoting what I think of as human rights in general despite the fact that Jesus in the Bible certainly did and Pope Francis seems to. Those guys are great though.&lt;/p&gt;\n\n&lt;p&gt;My preferred take on rights is that we don&amp;#39;t need absolute rights at all and I don&amp;#39;t think they exist. I do think that humans can agree on rights together, and this is all the word means anyway.&lt;/p&gt;\n\n&lt;p&gt;If you are personally inspired to behave more like Jesus, then I think this is an unqualified good. Whatever causes that inspiration. &lt;/p&gt;\n\n&lt;p&gt;Jesus told a parable about a father with two sons. The one son told his father he would obey and did not. The other son told his father he would ignore instruction but did the right thing anyway. This sums up my personal view.&lt;/p&gt;\n\n&lt;p&gt;Cheers to you as well&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4y9uc", "score_hidden": false, "stickied": false, "created": 1491974746.0, "created_utc": 1491945946.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4v8ax", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "revchj", "parent_id": "t1_dg4tq8q", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "Thanks for the edit. :) Reddit is not a great place for nuance - it's lacking in both time and beer - but for what it's worth its a useful enough medium to bash ideas around.\n\nI actually totally get how my arguments can be heard as self-righteous posturing, particularly given the sins that can rightfully be laid at the feet of my religion (and the propensity to self righteousness that we admittedly have!). We have a lot to answer for, and for what it's worth we are: my institution is hemorrhaging in most of the English speaking world. \n\nI am somewhat aware of the history of philosophy, though admittedly I'm not as well researched as I'd like to be. I'm certainly aware that discussions of morality predate the Christian conversation and have also emerged independently in non Western cultures and religions.\n\nThat acknowledged, I still think that the post-WW2 discussion of \"human rights\" per se is a product of the West in particular, and is inseparable from the Christian tradition out of which it grew.\n\nI argue this point on Reddit from time to time because I really do see a vacuum at the heart of postmodern moral philosophy - if that's even a thing, which I doubt. :) I'm not really trying to prove that Christianity is the best (though that would be fun); I'm arguing that secular culture needs to replace Christianity with something more like a religion if it's going to hold together as a society, let alone outcompete other models. Also, I have yet to see a proper argument about how a universal moral claim can be made without some sort of theism at its base.\n\nIf we could get past \"atheists are evil\" and \"Christians are superstitious hatemongers\", and our reactivity against those stereotypes, we could engage in those debate constructively. That at least is my hope, even on Reddit. \n\nCheers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the edit. :) Reddit is not a great place for nuance - it&amp;#39;s lacking in both time and beer - but for what it&amp;#39;s worth its a useful enough medium to bash ideas around.&lt;/p&gt;\n\n&lt;p&gt;I actually totally get how my arguments can be heard as self-righteous posturing, particularly given the sins that can rightfully be laid at the feet of my religion (and the propensity to self righteousness that we admittedly have!). We have a lot to answer for, and for what it&amp;#39;s worth we are: my institution is hemorrhaging in most of the English speaking world. &lt;/p&gt;\n\n&lt;p&gt;I am somewhat aware of the history of philosophy, though admittedly I&amp;#39;m not as well researched as I&amp;#39;d like to be. I&amp;#39;m certainly aware that discussions of morality predate the Christian conversation and have also emerged independently in non Western cultures and religions.&lt;/p&gt;\n\n&lt;p&gt;That acknowledged, I still think that the post-WW2 discussion of &amp;quot;human rights&amp;quot; per se is a product of the West in particular, and is inseparable from the Christian tradition out of which it grew.&lt;/p&gt;\n\n&lt;p&gt;I argue this point on Reddit from time to time because I really do see a vacuum at the heart of postmodern moral philosophy - if that&amp;#39;s even a thing, which I doubt. :) I&amp;#39;m not really trying to prove that Christianity is the best (though that would be fun); I&amp;#39;m arguing that secular culture needs to replace Christianity with something more like a religion if it&amp;#39;s going to hold together as a society, let alone outcompete other models. Also, I have yet to see a proper argument about how a universal moral claim can be made without some sort of theism at its base.&lt;/p&gt;\n\n&lt;p&gt;If we could get past &amp;quot;atheists are evil&amp;quot; and &amp;quot;Christians are superstitious hatemongers&amp;quot;, and our reactivity against those stereotypes, we could engage in those debate constructively. That at least is my hope, even on Reddit. &lt;/p&gt;\n\n&lt;p&gt;Cheers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4v8ax", "score_hidden": false, "stickied": false, "created": 1491971226.0, "created_utc": 1491942426.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tq8q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mors_videt", "parent_id": "t1_dg4jlym", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "If you think that a belief in common rights is something the world has because of Christianity, I think you owe it to yourself to learn more about the history of philosophy (just Plato for instance) and non-Christian cultures.\n\nSome Non Christians have a negative view of Christians because they perceive Christians to both be lacking in modern morality (i.e. Gay rights, for one example) and also to be self righteous about this, in the manner that you seem to be expressing.\n\nRespectfully, I think you should know, at a minimum, why some people react negatively to statements like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you think that a belief in common rights is something the world has because of Christianity, I think you owe it to yourself to learn more about the history of philosophy (just Plato for instance) and non-Christian cultures.&lt;/p&gt;\n\n&lt;p&gt;Some Non Christians have a negative view of Christians because they perceive Christians to both be lacking in modern morality (i.e. Gay rights, for one example) and also to be self righteous about this, in the manner that you seem to be expressing.&lt;/p&gt;\n\n&lt;p&gt;Respectfully, I think you should know, at a minimum, why some people react negatively to statements like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4tq8q", "score_hidden": false, "stickied": false, "created": 1491969547.0, "created_utc": 1491940747.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": "", "user_reports": [], "id": "dg4tv1j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "revchj", "parent_id": "t1_dg4m735", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt; And yet people with no belief still logically come to most of the same moral conclusions most of the time.\n\nI agree, but would argue that logic is not the operative process. When we say that a person has a right not to get beaten up on a plane, I do not see a conclusion based on a series of logical propositions.\n\nI would say rather that humans have certain moral instincts; the question is whether they have any ontological validity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And yet people with no belief still logically come to most of the same moral conclusions most of the time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree, but would argue that logic is not the operative process. When we say that a person has a right not to get beaten up on a plane, I do not see a conclusion based on a series of logical propositions.&lt;/p&gt;\n\n&lt;p&gt;I would say rather that humans have certain moral instincts; the question is whether they have any ontological validity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4tv1j", "score_hidden": false, "stickied": false, "created": 1491969696.0, "created_utc": 1491940896.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4m735", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OccupyGravelpit", "parent_id": "t1_dg4jlym", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt; but you can't philosophically justify that idea without some sort of theism or equivalent ontological move.\n\nAnd yet people with no belief still logically come to most of the same moral conclusions most of the time. Some norms have such a long history that they move over into a new category of 'rights'.\n\nIt may be that what we call human rights are basically just rational consensus positions. The consensus changes over time as our self awareness grows. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but you can&amp;#39;t philosophically justify that idea without some sort of theism or equivalent ontological move.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And yet people with no belief still logically come to most of the same moral conclusions most of the time. Some norms have such a long history that they move over into a new category of &amp;#39;rights&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;It may be that what we call human rights are basically just rational consensus positions. The consensus changes over time as our self awareness grows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4m735", "score_hidden": false, "stickied": false, "created": 1491961408.0, "created_utc": 1491932608.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jlym", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "revchj", "parent_id": "t1_dg47rhw", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "This is the point that troubles me most about our postmodern secular society. In tossing out the religious foundation of Western civilization we seem to have assumed that we can keep everything that was built upon that foundation, and I just don't think that's possible.\n\nHuman rights was a gift from Christianity to the world, and it is developed from the theological premise that every human is a \"child of God\". You don't have to be a Christian to appreciate the moral appeal, but you can't philosophically justify that idea without some sort of theism or equivalent ontological move. To say that rights depend on subjective feelings (whose?) or cultural norms is to negate the definition of rights.\n\nTo conclude that there are no human rights is precisely to say that there is no moral authority to whom we can hold each other accountable. This is a valid and even necessary position if theism is rejected. However that consequently means that there is no possibility for moral persuasion except by way of a con. Some would say that religion is precisely such a con, as well as nationalism and other ideologies; but the political implication of that position is that the psychopaths hold all the power: having no empathy, they are not subject to moral con jobs and are free to act entirely in their self interest as per Ayn Rand. Morality - including respect for human rights - is for saps.\n\nSo a society can have legal codes and social norms, but rather than being grounded in some universal Good they are simply the products of political interests. If they do not serve my interest they have no legitimacy and have no claim on my behavior. If the laws, police, justice system and so on exist to serve only the 1%, what's to stop me from looting a store if a riot breaks out after a hockey game if I think I can get away with it?\n\nThis is the challenge for the secular West, IMO. How does it avoid the inevitable collapse when the plebeians realize that we're all being conned and refuse to abide by the con any more? \n\nThis is one of the main reasons I'm sticking with my (particular brand of) Christianity: I much prefer the philosophical problems of my religion to the problems that I just outlined.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the point that troubles me most about our postmodern secular society. In tossing out the religious foundation of Western civilization we seem to have assumed that we can keep everything that was built upon that foundation, and I just don&amp;#39;t think that&amp;#39;s possible.&lt;/p&gt;\n\n&lt;p&gt;Human rights was a gift from Christianity to the world, and it is developed from the theological premise that every human is a &amp;quot;child of God&amp;quot;. You don&amp;#39;t have to be a Christian to appreciate the moral appeal, but you can&amp;#39;t philosophically justify that idea without some sort of theism or equivalent ontological move. To say that rights depend on subjective feelings (whose?) or cultural norms is to negate the definition of rights.&lt;/p&gt;\n\n&lt;p&gt;To conclude that there are no human rights is precisely to say that there is no moral authority to whom we can hold each other accountable. This is a valid and even necessary position if theism is rejected. However that consequently means that there is no possibility for moral persuasion except by way of a con. Some would say that religion is precisely such a con, as well as nationalism and other ideologies; but the political implication of that position is that the psychopaths hold all the power: having no empathy, they are not subject to moral con jobs and are free to act entirely in their self interest as per Ayn Rand. Morality - including respect for human rights - is for saps.&lt;/p&gt;\n\n&lt;p&gt;So a society can have legal codes and social norms, but rather than being grounded in some universal Good they are simply the products of political interests. If they do not serve my interest they have no legitimacy and have no claim on my behavior. If the laws, police, justice system and so on exist to serve only the 1%, what&amp;#39;s to stop me from looting a store if a riot breaks out after a hockey game if I think I can get away with it?&lt;/p&gt;\n\n&lt;p&gt;This is the challenge for the secular West, IMO. How does it avoid the inevitable collapse when the plebeians realize that we&amp;#39;re all being conned and refuse to abide by the con any more? &lt;/p&gt;\n\n&lt;p&gt;This is one of the main reasons I&amp;#39;m sticking with my (particular brand of) Christianity: I much prefer the philosophical problems of my religion to the problems that I just outlined.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4jlym", "score_hidden": false, "stickied": false, "created": 1491958584.0, "created_utc": 1491929784.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_64qke8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6padd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lua_x_ia", "parent_id": "t1_dg6ii48", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt;You suggested that freedom of speech might be something like freedom of legs.\n\nNo, I mentioned the structure of the human body as an example, and then later we got to speech. Sorry you missed that. The point is that we understand what are rights are because of what *we* are. \n\n&gt;And then you fell back on, \"Hobbes says that none of this matters anyway\".\n\nNo, I was responding to the idea that humanism leads to Nazi-ism.\n\n&gt;It's irritating to have been compelled to explain this much to you\n\nIt's irritating to deal with someone who can't read and just mashes all the words in my posts together and tries to respond to them. Especially when that person is an anti-Semite.", "edited": 1492037586.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You suggested that freedom of speech might be something like freedom of legs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, I mentioned the structure of the human body as an example, and then later we got to speech. Sorry you missed that. The point is that we understand what are rights are because of what &lt;em&gt;we&lt;/em&gt; are. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And then you fell back on, &amp;quot;Hobbes says that none of this matters anyway&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, I was responding to the idea that humanism leads to Nazi-ism.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s irritating to have been compelled to explain this much to you&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s irritating to deal with someone who can&amp;#39;t read and just mashes all the words in my posts together and tries to respond to them. Especially when that person is an anti-Semite.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg6padd", "score_hidden": false, "stickied": false, "created": 1492066055.0, "created_utc": 1492037255.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ii48", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSupremeFriend", "parent_id": "t1_dg6f5l5", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt;It's pretty much the same thing I originally argued.\n\nYou suggested that freedom of speech might be something like freedom of legs. And this was in response to someone who already suggested that some rights (specifically, freedom from rape and genocide) are legitimately universal. To go into a discussion about the freedom to have legs after that was completely absurd... And *then* you fell back on, \"Hobbes says that none of this matters anyway\".\n\nSorry, not my kind of discussion. It's irritating to have been compelled to explain this much to you when I seriously doubt that anyone (including and *especially* you) thinks that your insights have been insightful.\n\n(And no, I'm not going to address the other nonsense, as it is clearly an invention made to irritate me).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s pretty much the same thing I originally argued.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You suggested that freedom of speech might be something like freedom of legs. And this was in response to someone who already suggested that some rights (specifically, freedom from rape and genocide) are legitimately universal. To go into a discussion about the freedom to have legs after that was completely absurd... And &lt;em&gt;then&lt;/em&gt; you fell back on, &amp;quot;Hobbes says that none of this matters anyway&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Sorry, not my kind of discussion. It&amp;#39;s irritating to have been compelled to explain this much to you when I seriously doubt that anyone (including and &lt;em&gt;especially&lt;/em&gt; you) thinks that your insights have been insightful.&lt;/p&gt;\n\n&lt;p&gt;(And no, I&amp;#39;m not going to address the other nonsense, as it is clearly an invention made to irritate me).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg6ii48", "score_hidden": false, "stickied": false, "created": 1492058085.0, "created_utc": 1492029285.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6f5l5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lua_x_ia", "parent_id": "t1_dg6f1tv", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt;Seems pretty obvious that appealing to Hobbes' thought is a long stretch from what you originally argued, and it hit me as it distasteful.\n\nIt's pretty much the same thing I originally argued.\n\n&gt;Meanwhile your counterargument is an ad hominem \n\nYour argument was *not* an argument. You merely complained that my post was nonsense.\n\n&gt;you only managed by looking into my comment history.\n\nOk, Nazi.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Seems pretty obvious that appealing to Hobbes&amp;#39; thought is a long stretch from what you originally argued, and it hit me as it distasteful.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s pretty much the same thing I originally argued.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Meanwhile your counterargument is an ad hominem &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your argument was &lt;em&gt;not&lt;/em&gt; an argument. You merely complained that my post was nonsense.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you only managed by looking into my comment history.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ok, Nazi.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg6f5l5", "score_hidden": false, "stickied": false, "created": 1492054648.0, "created_utc": 1492025848.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6f1tv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSupremeFriend", "parent_id": "t1_dg6a2a7", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "Seems pretty obvious that appealing to Hobbes' thought is a long stretch from what you originally argued, and it hit me as it distasteful.\n\nMeanwhile your counterargument is an ad hominem that you only managed by looking into my comment history. You *found* me to be distasteful because you went looking for a way to have your tastes offended; the people here on this subreddit *which is intended for thoughtful argument* did not have that luxury.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seems pretty obvious that appealing to Hobbes&amp;#39; thought is a long stretch from what you originally argued, and it hit me as it distasteful.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile your counterargument is an ad hominem that you only managed by looking into my comment history. You &lt;em&gt;found&lt;/em&gt; me to be distasteful because you went looking for a way to have your tastes offended; the people here on this subreddit &lt;em&gt;which is intended for thoughtful argument&lt;/em&gt; did not have that luxury.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg6f1tv", "score_hidden": false, "stickied": false, "created": 1492054541.0, "created_utc": 1492025741.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a2a7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lua_x_ia", "parent_id": "t1_dg5bhgc", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt;Don't tie an actually thoughtful person like Hobbes into your \"freedom of speech is natural like legs\" nonsense.\n\nWhat a sophisticated counterargument coming from someone who uses syntax like \"(((leftist)))\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Don&amp;#39;t tie an actually thoughtful person like Hobbes into your &amp;quot;freedom of speech is natural like legs&amp;quot; nonsense.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What a sophisticated counterargument coming from someone who uses syntax like &amp;quot;(((leftist)))&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg6a2a7", "score_hidden": false, "stickied": false, "created": 1492049410.0, "created_utc": 1492020610.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5bhgc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheSupremeFriend", "parent_id": "t1_dg55uxf", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "Don't tie an actually thoughtful person like Hobbes into your \"freedom of speech is natural like legs\" nonsense.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t tie an actually thoughtful person like Hobbes into your &amp;quot;freedom of speech is natural like legs&amp;quot; nonsense.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg5bhgc", "score_hidden": false, "stickied": false, "created": 1491991948.0, "created_utc": 1491963148.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg55uxf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lua_x_ia", "parent_id": "t1_dg53abu", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt;you're inherently making the case that these other cultures either aren't properly human or have to be taught to be so\n\nNot really. Just because there is something doesn't mean that you believe there is or should be a means for comparing it to something else. This is a dogmatic lie that gets repeated: sustaining traditions is dangerous (because fascism). But really it's narcissism that is dangerous and which leads to fascism. \n\nWe can simply *not know* whether our system is \"more accurate\" than their system. It may be better in some ways and not in others. All that is necessary for peace is that we value peace. And peace is, as Hobbes notes, one of the most universal values of humanity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you&amp;#39;re inherently making the case that these other cultures either aren&amp;#39;t properly human or have to be taught to be so&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not really. Just because there is something doesn&amp;#39;t mean that you believe there is or should be a means for comparing it to something else. This is a dogmatic lie that gets repeated: sustaining traditions is dangerous (because fascism). But really it&amp;#39;s narcissism that is dangerous and which leads to fascism. &lt;/p&gt;\n\n&lt;p&gt;We can simply &lt;em&gt;not know&lt;/em&gt; whether our system is &amp;quot;more accurate&amp;quot; than their system. It may be better in some ways and not in others. All that is necessary for peace is that we value peace. And peace is, as Hobbes notes, one of the most universal values of humanity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg55uxf", "score_hidden": false, "stickied": false, "created": 1491984571.0, "created_utc": 1491955771.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg53abu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Quouar", "parent_id": "t1_dg4pllu", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "I think it's dangerous to start looking at things like freedom of speech as relating to our inherent humanness in much the same way it's dangerous to look at anything societies do and say it's inherent to human nature. Freedom of speech has, at its core, the value that the individual and their opinions ought to matter more than the society as a whole, which is definitely not inherent to all of humanity (see: Asia, Africa, and Islamic conceptions of rights). By arguing that these rights reflect some sort of inherent humanity, you're inherently making the case that these other cultures either aren't properly human or have to be taught to be so, which to me is very dangerous. It seems more reasonable to say that we have derived this idea that the individual is paramount, and that other societies have come to different conclusions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s dangerous to start looking at things like freedom of speech as relating to our inherent humanness in much the same way it&amp;#39;s dangerous to look at anything societies do and say it&amp;#39;s inherent to human nature. Freedom of speech has, at its core, the value that the individual and their opinions ought to matter more than the society as a whole, which is definitely not inherent to all of humanity (see: Asia, Africa, and Islamic conceptions of rights). By arguing that these rights reflect some sort of inherent humanity, you&amp;#39;re inherently making the case that these other cultures either aren&amp;#39;t properly human or have to be taught to be so, which to me is very dangerous. It seems more reasonable to say that we have derived this idea that the individual is paramount, and that other societies have come to different conclusions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg53abu", "score_hidden": false, "stickied": false, "created": 1491981093.0, "created_utc": 1491952293.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pllu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lua_x_ia", "parent_id": "t1_dg47rhw", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "&gt;There's nothing we are guaranteed by virtue of being human\n\nLegs?\n\nI mean, we think that a person has a right to have two legs. If someone wanted to have a third leg attached you might see some consternation. On the other hand everyone would be mad if the government prevented someone who had lost a leg from getting a leg attached. Thus it seems that our natural right to have two legs is related in some way to the shape of our bodies.\n\nIn a similar way, the values of freedom of speech and movement can be related to the psychology of communication and exploration, as well as our [understanding of what role those values play in our political system](https://www.dartmouth.edu/~milton/reading_room/areopagitica/text.html), which is not a metaphysical commandment but nonetheless is derived from facts about social dynamics that were gleaned by observation. It is about as factual as any other economic or sociological proposition.\n\n&gt;Who are we to say that our idea of rights is necessarily better than theirs?\n\nWho are we to say that anything is better than anything else?\n\nBut a ham sandwich is certainly better than nothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There&amp;#39;s nothing we are guaranteed by virtue of being human&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Legs?&lt;/p&gt;\n\n&lt;p&gt;I mean, we think that a person has a right to have two legs. If someone wanted to have a third leg attached you might see some consternation. On the other hand everyone would be mad if the government prevented someone who had lost a leg from getting a leg attached. Thus it seems that our natural right to have two legs is related in some way to the shape of our bodies.&lt;/p&gt;\n\n&lt;p&gt;In a similar way, the values of freedom of speech and movement can be related to the psychology of communication and exploration, as well as our &lt;a href=\"https://www.dartmouth.edu/%7Emilton/reading_room/areopagitica/text.html\"&gt;understanding of what role those values play in our political system&lt;/a&gt;, which is not a metaphysical commandment but nonetheless is derived from facts about social dynamics that were gleaned by observation. It is about as factual as any other economic or sociological proposition.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Who are we to say that our idea of rights is necessarily better than theirs?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Who are we to say that anything is better than anything else?&lt;/p&gt;\n\n&lt;p&gt;But a ham sandwich is certainly better than nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg4pllu", "score_hidden": false, "stickied": false, "created": 1491965142.0, "created_utc": 1491936342.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47rhw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Quouar", "parent_id": "t3_64qke8", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "I'm actually really disappointed by this article. It barely glances over what's actually a really interesting philosophical and legal question. As it argues, we consider - and have, in western society, considered - human rights to be more or less inherent and something you have by virtue of being born. The problem is, as the article rightly points out, that those rights don't seem to be evenly distributed, so the argument that they are inherent loses some of its potency. Human rights are a tricky proposition, especially since there can be so much politics involved in rights, and especially since so many of what we think of as \"inherent\" rights are grounded in western, Judeo-Christian ideals. Our idea of the individual as the core of rights contradicts a lot of other societies. Who are we to say that our idea of rights is necessarily better than theirs?\n\nTo me, it's more useful to abandon the idea that there are inherent human rights. What there are are norms that we as a human society have more or less agreed on - it's wrong to rape people, genocide is bad, etc. However, the idea that these have any sort of inherency beyond the value we assign them doesn't work. There's nothing we are guaranteed by virtue of being human, so why would rights exist? For that matter, can rights even exist if there's no guarantee of their existence? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m actually really disappointed by this article. It barely glances over what&amp;#39;s actually a really interesting philosophical and legal question. As it argues, we consider - and have, in western society, considered - human rights to be more or less inherent and something you have by virtue of being born. The problem is, as the article rightly points out, that those rights don&amp;#39;t seem to be evenly distributed, so the argument that they are inherent loses some of its potency. Human rights are a tricky proposition, especially since there can be so much politics involved in rights, and especially since so many of what we think of as &amp;quot;inherent&amp;quot; rights are grounded in western, Judeo-Christian ideals. Our idea of the individual as the core of rights contradicts a lot of other societies. Who are we to say that our idea of rights is necessarily better than theirs?&lt;/p&gt;\n\n&lt;p&gt;To me, it&amp;#39;s more useful to abandon the idea that there are inherent human rights. What there are are norms that we as a human society have more or less agreed on - it&amp;#39;s wrong to rape people, genocide is bad, etc. However, the idea that these have any sort of inherency beyond the value we assign them doesn&amp;#39;t work. There&amp;#39;s nothing we are guaranteed by virtue of being human, so why would rights exist? For that matter, can rights even exist if there&amp;#39;s no guarantee of their existence? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dg47rhw", "score_hidden": false, "stickied": false, "created": 1491944462.0, "created_utc": 1491915662.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]