[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Foodforthought", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vteh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "iconicironic", "saved": false, "mod_reports": [], "name": "t3_65vteh", "subreddit_name_prefixed": "r/Foodforthought", "approved_by": null, "over_18": false, "domain": "theguardian.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rete", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Foodforthought/comments/65vteh/is_mental_illness_real/", "num_reports": null, "locked": false, "stickied": false, "created": 1492467612.0, "url": "https://www.theguardian.com/commentisfree/2017/apr/12/is-mental-illness-real-google-answer", "author_flair_text": null, "quarantine": false, "title": "Is mental illness real", "created_utc": 1492438812.0, "distinguished": null, "media": null, "upvote_ratio": 0.58, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_65vteh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rete", "removal_reason": null, "link_id": "t3_65vteh", "likes": null, "replies": "", "user_reports": [], "id": "dgecyij", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mightier_mouse", "parent_id": "t1_dge77tk", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "As someone also diagnosed as depressed, I definitely relate.  When I looked at how depression is diagnosed (as defined by whatever DSM we're on now), it was clear to me that they don't even have a very good definition of depression.  More alarming to me is that there is pathology, no knowledge of the disease existing on the biological or cellular level.\n\nThe whole SSRI craze wasn't even designed to attack a problem that we had studied specifically.  We know that seratonin does certain things in the brain, and **theorized** that depressed people had something wrong with their seratonin levels.  We don't have the diagnostic ability to actually look at people's neurotransmitter levels, so it's really just a shot in the dark.  There's a reason that SSRIs only seem to have a 20-30% success rate, and their success rate tends to be bolstered significantly by simultaneous cognitive behavioral therapy.  It's because the interaction and regulation of all of your neurotransmitters (of which there are many) is a complicated affair that we don't fully understand yet. \n\nI've had more success dealing with my depression outside of the illness mindset.  I instead believe that my depression has stemmed from the environment that I have been in and the way I have approached it.  Sure, I buy that more people may be predisposed to falling into depression than others, but I don't think I'm somehow broken.  Personally I think that with the right habits and support structures, most people who are suffering from depression can find some relief. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone also diagnosed as depressed, I definitely relate.  When I looked at how depression is diagnosed (as defined by whatever DSM we&amp;#39;re on now), it was clear to me that they don&amp;#39;t even have a very good definition of depression.  More alarming to me is that there is pathology, no knowledge of the disease existing on the biological or cellular level.&lt;/p&gt;\n\n&lt;p&gt;The whole SSRI craze wasn&amp;#39;t even designed to attack a problem that we had studied specifically.  We know that seratonin does certain things in the brain, and &lt;strong&gt;theorized&lt;/strong&gt; that depressed people had something wrong with their seratonin levels.  We don&amp;#39;t have the diagnostic ability to actually look at people&amp;#39;s neurotransmitter levels, so it&amp;#39;s really just a shot in the dark.  There&amp;#39;s a reason that SSRIs only seem to have a 20-30% success rate, and their success rate tends to be bolstered significantly by simultaneous cognitive behavioral therapy.  It&amp;#39;s because the interaction and regulation of all of your neurotransmitters (of which there are many) is a complicated affair that we don&amp;#39;t fully understand yet. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had more success dealing with my depression outside of the illness mindset.  I instead believe that my depression has stemmed from the environment that I have been in and the way I have approached it.  Sure, I buy that more people may be predisposed to falling into depression than others, but I don&amp;#39;t think I&amp;#39;m somehow broken.  Personally I think that with the right habits and support structures, most people who are suffering from depression can find some relief. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dgecyij", "score_hidden": false, "stickied": false, "created": 1492502778.0, "created_utc": 1492473978.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge77tk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "-8000_points", "parent_id": "t3_65vteh", "subreddit_name_prefixed": "r/Foodforthought", "controversiality": 0, "body": "Having been diagnosed depressed multiple, multiple times, I have conceptualized this as a lifelong defect within myself, one that I will constantly have to either fight or surrender to.  It makes the prospect of achieving any major thing in life seem impossible, and makes me feel as if I am damaged goods in a relationship.  I have always believed that depression is partially biological, but have begun to question the usefulness of the illness model of depression for my own recovery and ability to be an active, productive person.  \n\nLabeling oneself as depressed limits the number of possible actions and reactions to a situation based on the cognitive label of depressed that the person has subsumed into their identity.  While there may be consistency in clinical behavior guidelines set out by the psychiatric community to define mental illnesses, it is still difficult to legitimize their categorization as illness to being helpful in empowering the individual in question. I've often wondered how much self-fulfilling prophecy there is in calling a person depressed, and instead of packaging a whole array of individual problems into the tidy package of the word \"depressed\" how much more useful it might be to focus on the patient's complaints about their sleep, diffculties with motivation, or aversion to relationships.  No little bow necessary to group the constellation of problems into something conceptually boxed, just solving the problems in question to the best of our ability even if that just means altering perceptions, expectations, and reactions.  \n\nThis idea also doesn't account for the fact that a \"depressed person\" may fall well out of line on several guidelines to diagnosis: they may not show low affect, they may have healthy relationships, and they may not  have low motivation.  How do you account for this difference?  Not through diagnosis, but through treatment of behavior.  \n\nI used depression because that is my go to, but could be substituted for any other low level mental illness.  idk how applicable this might be to schizophrenia or severe bipolar ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having been diagnosed depressed multiple, multiple times, I have conceptualized this as a lifelong defect within myself, one that I will constantly have to either fight or surrender to.  It makes the prospect of achieving any major thing in life seem impossible, and makes me feel as if I am damaged goods in a relationship.  I have always believed that depression is partially biological, but have begun to question the usefulness of the illness model of depression for my own recovery and ability to be an active, productive person.  &lt;/p&gt;\n\n&lt;p&gt;Labeling oneself as depressed limits the number of possible actions and reactions to a situation based on the cognitive label of depressed that the person has subsumed into their identity.  While there may be consistency in clinical behavior guidelines set out by the psychiatric community to define mental illnesses, it is still difficult to legitimize their categorization as illness to being helpful in empowering the individual in question. I&amp;#39;ve often wondered how much self-fulfilling prophecy there is in calling a person depressed, and instead of packaging a whole array of individual problems into the tidy package of the word &amp;quot;depressed&amp;quot; how much more useful it might be to focus on the patient&amp;#39;s complaints about their sleep, diffculties with motivation, or aversion to relationships.  No little bow necessary to group the constellation of problems into something conceptually boxed, just solving the problems in question to the best of our ability even if that just means altering perceptions, expectations, and reactions.  &lt;/p&gt;\n\n&lt;p&gt;This idea also doesn&amp;#39;t account for the fact that a &amp;quot;depressed person&amp;quot; may fall well out of line on several guidelines to diagnosis: they may not show low affect, they may have healthy relationships, and they may not  have low motivation.  How do you account for this difference?  Not through diagnosis, but through treatment of behavior.  &lt;/p&gt;\n\n&lt;p&gt;I used depression because that is my go to, but could be substituted for any other low level mental illness.  idk how applicable this might be to schizophrenia or severe bipolar &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Foodforthought", "name": "t1_dge77tk", "score_hidden": false, "stickied": false, "created": 1492495358.0, "created_utc": 1492466558.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]