[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "pettyrevenge", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;During my sophomore year of college I lived in a 3 story apartment.  In these apartments there were 4 roommates, and there were 12 apartments total in my building.  Each apartment had 2 parking spots assigned to them for 48 people total.  You can imagine what a free for all the other parking spots turned into that were further out in the lot and not assigned to anyone.  However, there were 2 spots that were closest to the building that were reserved for no one.  They were, I&amp;#39;m guessing, there for people to load and unload and make quick trips in and out.  What they were &lt;em&gt;not&lt;/em&gt; for was to be parked in permanently.  &lt;/p&gt;\n\n&lt;p&gt;Fast forward a few months and two guys with motorcycles had claimed one of these spots as their own.  They coordinated their day so that one of them was always parked in that spot, preventing anyone from ever taking their spot from them.  And it was rare that either of them were gone - most of the time both bikes were there.  After a few weeks of this the residents had all grumbled to each other about how their shenanigans were unfair to the rest of us.  After a day or two of thinking I came up with a pretty solid solution.  I took the doors off of my jeep so that I didn&amp;#39;t need to open them and waited for one of the motorcycles to be out when I got home from class.  Finally it happened and I slid in the spot with literally inches between me and the other bike.  &lt;/p&gt;\n\n&lt;p&gt;The other residents were THRILLED that I had parked there.  In order to rub it in, everyone volunteered to give me rides wherever I needed to go for the next three days.  After I finally had to move it, the motorcycle guys got the message and never double parked there again and we all had our open space back.  Felt really good.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "During my sophomore year of college I lived in a 3 story apartment.  In these apartments there were 4 roommates, and there were 12 apartments total in my building.  Each apartment had 2 parking spots assigned to them for 48 people total.  You can imagine what a free for all the other parking spots turned into that were further out in the lot and not assigned to anyone.  However, there were 2 spots that were closest to the building that were reserved for no one.  They were, I'm guessing, there for people to load and unload and make quick trips in and out.  What they were *not* for was to be parked in permanently.  \n\nFast forward a few months and two guys with motorcycles had claimed one of these spots as their own.  They coordinated their day so that one of them was always parked in that spot, preventing anyone from ever taking their spot from them.  And it was rare that either of them were gone - most of the time both bikes were there.  After a few weeks of this the residents had all grumbled to each other about how their shenanigans were unfair to the rest of us.  After a day or two of thinking I came up with a pretty solid solution.  I took the doors off of my jeep so that I didn't need to open them and waited for one of the motorcycles to be out when I got home from class.  Finally it happened and I slid in the spot with literally inches between me and the other bike.  \n\nThe other residents were THRILLED that I had parked there.  In order to rub it in, everyone volunteered to give me rides wherever I needed to go for the next three days.  After I finally had to move it, the motorcycle guys got the message and never double parked there again and we all had our open space back.  Felt really good.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65fyyt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 203, "report_reasons": null, "author": "BreitbartWasMurdered", "saved": false, "mod_reports": [], "name": "t3_65fyyt", "subreddit_name_prefixed": "r/pettyrevenge", "approved_by": null, "over_18": false, "domain": "self.pettyrevenge", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2vg7t", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/pettyrevenge/comments/65fyyt/jeeps_are_pretty_thin_vehicles_and_if_you_have/", "num_reports": null, "locked": false, "stickied": false, "created": 1492241118.0, "url": "https://www.reddit.com/r/pettyrevenge/comments/65fyyt/jeeps_are_pretty_thin_vehicles_and_if_you_have/", "author_flair_text": null, "quarantine": false, "title": "Jeeps are pretty thin vehicles and if you have the doors off, you don't need much room to get out.", "created_utc": 1492212318.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 203}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vg7t", "removal_reason": null, "link_id": "t3_65fyyt", "likes": null, "replies": "", "user_reports": [], "id": "dgapbgu", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "vortish", "parent_id": "t3_65fyyt", "subreddit_name_prefixed": "r/pettyrevenge", "controversiality": 0, "body": "Nice", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pettyrevenge", "name": "t1_dgapbgu", "score_hidden": false, "stickied": false, "created": 1492295623.0, "created_utc": 1492266823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}]