[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "webdev", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Its late. I&amp;#39;ve been dying inside and crying, for a long long, about this:&lt;/strong&gt;\nI need to get this out: 25F, Major in Accounting + Marketing. I just spent 2 years in a job I don&amp;#39;t care about (accounts for a very big logistics company), and studying a major I don&amp;#39;t give a shit about. I gave up on asking for more work, no room for advancement, no up-skill, my natural/social skills are not being put to use etc. Nice colleagues, but all 40+ and they either don&amp;#39;t believe in work-life balance or exercise... or friday work drinks.)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve suppressed my creative side for the past 10 years, due to bad advice from my mother, and my own self-shaming. Fck accounting, I realised that I will never want to pursue a CA/CPA.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Fast forward to now:&lt;/strong&gt; I can&amp;#39;t take my job, and now I shit around on reddit all day. In real life, I would like to be involved in an art/creative process which allows some problem-solving input and dealing with clients.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;I have started getting into baby coding, html/css, since just over 2 months or so ago. I&amp;#39;ve done some baby online stuff like codecedemy etc. Surprisingly, Its really captured my interest, just because of all the stuff that you can do and bring to life. (I used to really think that coding was just boring, now I can see why people do it). Im thinking of applying for a three month full-time bootcamp that costs $4,000 USD plus help in job/internship applications.&lt;/li&gt;\n&lt;li&gt;I should also mention that I wake up at 5/5:30 am to both pursue art and/or code on a daily basis. (Yes, I do like waking up at 5am)&lt;/li&gt;\n&lt;li&gt;I do have money to last me for a while. (Might travel a bit to get my sanity back...)&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Im seriously looking at going into web-development (also supplements my marketing degree), while learning some graphic design/illustration/animation things on the side. Am I going too fast with this? Any advices? Tales of cautions etc? Anyone with similar stories?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit 1:&lt;/strong&gt; Sorry for the language. For everyone doing Accounting, I admire the patience and perseverance you have and I wish you well ~\n&lt;strong&gt;Edit 2:&lt;/strong&gt; Extra Story if Interested. Something thats bugged me the whole time. So my current company does not at all utilise my skills, despite me offering. I&amp;#39;m a jack of all trades, and enjoyed two years working as a barista. We have a very good coffee machine at work, and I&amp;#39;ve offered to make our office (6 people), any type of coffee they wanted every morning, if the company just bought some cleaning materials. I love making coffee. INSTEAD they bought a nespresso machine (no-hate) and depressingly drink shitty black coffee from crappy 3rd party coffee-capsules every morning. &lt;/p&gt;\n\n&lt;p&gt;I am currently caffine-free. I have never been so turned off by coffee. There is 3 year old butter sitting on the shelf, not the fridge. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit 3:&lt;/strong&gt; Holy shit thank you so much guys. I feel like a storm has calmed, and I appreciate all the responses. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Its late. I've been dying inside and crying, for a long long, about this:**\nI need to get this out: 25F, Major in Accounting + Marketing. I just spent 2 years in a job I don't care about (accounts for a very big logistics company), and studying a major I don't give a shit about. I gave up on asking for more work, no room for advancement, no up-skill, my natural/social skills are not being put to use etc. Nice colleagues, but all 40+ and they either don't believe in work-life balance or exercise... or friday work drinks.)\n\nI've suppressed my creative side for the past 10 years, due to bad advice from my mother, and my own self-shaming. Fck accounting, I realised that I will never want to pursue a CA/CPA.\n\n\n**Fast forward to now:** I can't take my job, and now I shit around on reddit all day. In real life, I would like to be involved in an art/creative process which allows some problem-solving input and dealing with clients.\n\n1. I have started getting into baby coding, html/css, since just over 2 months or so ago. I've done some baby online stuff like codecedemy etc. Surprisingly, Its really captured my interest, just because of all the stuff that you can do and bring to life. (I used to really think that coding was just boring, now I can see why people do it). Im thinking of applying for a three month full-time bootcamp that costs $4,000 USD plus help in job/internship applications.\n2. I should also mention that I wake up at 5/5:30 am to both pursue art and/or code on a daily basis. (Yes, I do like waking up at 5am)\n3. I do have money to last me for a while. (Might travel a bit to get my sanity back...)\n\nIm seriously looking at going into web-development (also supplements my marketing degree), while learning some graphic design/illustration/animation things on the side. Am I going too fast with this? Any advices? Tales of cautions etc? Anyone with similar stories?\n\n**Edit 1:** Sorry for the language. For everyone doing Accounting, I admire the patience and perseverance you have and I wish you well ~\n**Edit 2:** Extra Story if Interested. Something thats bugged me the whole time. So my current company does not at all utilise my skills, despite me offering. I'm a jack of all trades, and enjoyed two years working as a barista. We have a very good coffee machine at work, and I've offered to make our office (6 people), any type of coffee they wanted every morning, if the company just bought some cleaning materials. I love making coffee. INSTEAD they bought a nespresso machine (no-hate) and depressingly drink shitty black coffee from crappy 3rd party coffee-capsules every morning. \n\nI am currently caffine-free. I have never been so turned off by coffee. There is 3 year old butter sitting on the shelf, not the fridge. \n\n**Edit 3:** Holy shit thank you so much guys. I feel like a storm has calmed, and I appreciate all the responses. &lt;3", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ozz9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "Spam-The-Ham", "saved": false, "mod_reports": [], "name": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "approved_by": null, "over_18": false, "domain": "self.webdev", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qs0q", "edited": 1492390234.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/webdev/comments/65ozz9/thinking_of_changing_to_webdev_because_fck/", "num_reports": null, "locked": false, "stickied": false, "created": 1492376599.0, "url": "https://www.reddit.com/r/webdev/comments/65ozz9/thinking_of_changing_to_webdev_because_fck/", "author_flair_text": null, "quarantine": false, "title": "Thinking of Changing to Web-dev? (Because F*ck Accounts...Also Dying Inside)", "created_utc": 1492347799.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 34, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgd7p34", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mastermog", "parent_id": "t1_dgcsp0t", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I guess, just to be clear, I am not doubting your hate for your job - your distaste for it is really quite clear. And by no means do I suggest you stay there. \n\nJust wanted to let you know, although webdev is pretty awesome - it can be annoying at times. \n\nIf you only take one thing from my comment above above, is \"take a breath\". At 25, there is nothing lost so far. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess, just to be clear, I am not doubting your hate for your job - your distaste for it is really quite clear. And by no means do I suggest you stay there. &lt;/p&gt;\n\n&lt;p&gt;Just wanted to let you know, although webdev is pretty awesome - it can be annoying at times. &lt;/p&gt;\n\n&lt;p&gt;If you only take one thing from my comment above above, is &amp;quot;take a breath&amp;quot;. At 25, there is nothing lost so far. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd7p34", "score_hidden": false, "stickied": false, "created": 1492439807.0, "created_utc": 1492411007.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsp0t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc3k09", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Oh my God, How have I not watched that episode yet. (Thank you Sir)\n\nSorry, just coming from accounts, I still am in this mindset that a lot of things need to be taught professionally. Thanks for the pros and cons! Yeah just the mesh with the creative side is what got me. \n\nI guess the reason why I don't like my Job is because I barely even have an interest in the main core of the things Im working on. (plus I just know that I'll never want to want to go into tax, audit, etc. etc.) In addition to the actual workplace it self, it just really added up. I just don't see a light at the end of the tunnel. That being said, it is still a very useful skill that I am still glad I have. If I'm lucky I will be able to really utilise one day. \n\n(Btw, thats super cool how you managed to make something in Tokyo. Also stayed there for a while a few years ago, and really wished that I was able to do something like that)\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my God, How have I not watched that episode yet. (Thank you Sir)&lt;/p&gt;\n\n&lt;p&gt;Sorry, just coming from accounts, I still am in this mindset that a lot of things need to be taught professionally. Thanks for the pros and cons! Yeah just the mesh with the creative side is what got me. &lt;/p&gt;\n\n&lt;p&gt;I guess the reason why I don&amp;#39;t like my Job is because I barely even have an interest in the main core of the things Im working on. (plus I just know that I&amp;#39;ll never want to want to go into tax, audit, etc. etc.) In addition to the actual workplace it self, it just really added up. I just don&amp;#39;t see a light at the end of the tunnel. That being said, it is still a very useful skill that I am still glad I have. If I&amp;#39;m lucky I will be able to really utilise one day. &lt;/p&gt;\n\n&lt;p&gt;(Btw, thats super cool how you managed to make something in Tokyo. Also stayed there for a while a few years ago, and really wished that I was able to do something like that)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcsp0t", "score_hidden": false, "stickied": false, "created": 1492416278.0, "created_utc": 1492387478.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3k09", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "mastermog", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Webdev won't be a silverbullet - there are many many people who hate it as much you hate your current role. However, if you are truely doing it because you want to do it, then of course, do it and do it well. \n\nThe one great thing about webdev is all you need is a crappy computer and an internet connection. I don't know much about bootcamps, but they seem overrated to me - they are well after my time. I do subscribe to sites like laracasts, and eggheads are another good one. But meh, as someone who occasional recruits devs, I wouldn't put any more weight into someone who has done a bootcamp vs one who hadn't - I would be looking at their code and portfolio, github, etc - as the giant heads in Rick and Morty say \"show me what you got\". \n\nIt sounds like you need to take a breath, it does sound like you need a change, but before you deep dive into webdev, do take that breath. Take a step back and look at the whole picture. List all possible jobs that you can a) potentially do and b) interest you and do a good ol' fashioned pro's / con's. And be objective as possible. By all means, keep studying webdev while researching jobs - webdev ain't going anywhere (but 15 frontend frameworks will come and go during that time). \n\nIf you want help with your pro's / con's for webdev (others, free feel to add):\n\n* + Flexible if freelancing (easy to work remote too) \n* + Easy to get started. A months worth of study and you could take on basic ma and pa clients\n* + Easy to colab - You can work with a backend dev if that doesn't interest you\n* + Money is good\n* + Easy to be passionate about. Actually very enjoyable\n* + Industry is currently robust (just spent two years living in Tokyo, working entirely remotely as a freelancer)\n* + Soooo many tools (frameworks, editors, bla bla bla). \n* - Soooo many tools.\n* - Networking can blow\n* - Finding clients can be hard\n* - Clients constantly question why you charge that much\n* - Clients asking stupid crap (can you use the logo my niece drew?)\n* - Clients not having trust in your ability. That you are the expert in the relationship\n* - Clients \n* - Chasing down money\n* - Servers crashing at midnight\n* - Servers crashing at 1am, on a Saturday\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Webdev won&amp;#39;t be a silverbullet - there are many many people who hate it as much you hate your current role. However, if you are truely doing it because you want to do it, then of course, do it and do it well. &lt;/p&gt;\n\n&lt;p&gt;The one great thing about webdev is all you need is a crappy computer and an internet connection. I don&amp;#39;t know much about bootcamps, but they seem overrated to me - they are well after my time. I do subscribe to sites like laracasts, and eggheads are another good one. But meh, as someone who occasional recruits devs, I wouldn&amp;#39;t put any more weight into someone who has done a bootcamp vs one who hadn&amp;#39;t - I would be looking at their code and portfolio, github, etc - as the giant heads in Rick and Morty say &amp;quot;show me what you got&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you need to take a breath, it does sound like you need a change, but before you deep dive into webdev, do take that breath. Take a step back and look at the whole picture. List all possible jobs that you can a) potentially do and b) interest you and do a good ol&amp;#39; fashioned pro&amp;#39;s / con&amp;#39;s. And be objective as possible. By all means, keep studying webdev while researching jobs - webdev ain&amp;#39;t going anywhere (but 15 frontend frameworks will come and go during that time). &lt;/p&gt;\n\n&lt;p&gt;If you want help with your pro&amp;#39;s / con&amp;#39;s for webdev (others, free feel to add):&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;+ Flexible if freelancing (easy to work remote too) &lt;/li&gt;\n&lt;li&gt;+ Easy to get started. A months worth of study and you could take on basic ma and pa clients&lt;/li&gt;\n&lt;li&gt;+ Easy to colab - You can work with a backend dev if that doesn&amp;#39;t interest you&lt;/li&gt;\n&lt;li&gt;+ Money is good&lt;/li&gt;\n&lt;li&gt;+ Easy to be passionate about. Actually very enjoyable&lt;/li&gt;\n&lt;li&gt;+ Industry is currently robust (just spent two years living in Tokyo, working entirely remotely as a freelancer)&lt;/li&gt;\n&lt;li&gt;+ Soooo many tools (frameworks, editors, bla bla bla). &lt;/li&gt;\n&lt;li&gt;- Soooo many tools.&lt;/li&gt;\n&lt;li&gt;- Networking can blow&lt;/li&gt;\n&lt;li&gt;- Finding clients can be hard&lt;/li&gt;\n&lt;li&gt;- Clients constantly question why you charge that much&lt;/li&gt;\n&lt;li&gt;- Clients asking stupid crap (can you use the logo my niece drew?)&lt;/li&gt;\n&lt;li&gt;- Clients not having trust in your ability. That you are the expert in the relationship&lt;/li&gt;\n&lt;li&gt;- Clients &lt;/li&gt;\n&lt;li&gt;- Chasing down money&lt;/li&gt;\n&lt;li&gt;- Servers crashing at midnight&lt;/li&gt;\n&lt;li&gt;- Servers crashing at 1am, on a Saturday&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc3k09", "score_hidden": false, "stickied": false, "created": 1492382625.0, "created_utc": 1492353825.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgc16ko", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "multithrowaway", "parent_id": "t1_dgc0j1n", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "This. Learn how a web application is brought to life. Don't get overwhelmed by frameworks, just pick some that will get the job done. Make the front end, back end, and database communicate with each other. But the best way to get better at web dev starting out is to work on real projects with people who know more than you. Go to interviews, tell them the things you said here. Some companies may be looking for more work/college experience, but others will value side projects and the passion you have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. Learn how a web application is brought to life. Don&amp;#39;t get overwhelmed by frameworks, just pick some that will get the job done. Make the front end, back end, and database communicate with each other. But the best way to get better at web dev starting out is to work on real projects with people who know more than you. Go to interviews, tell them the things you said here. Some companies may be looking for more work/college experience, but others will value side projects and the passion you have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc16ko", "score_hidden": false, "stickied": false, "created": 1492378690.0, "created_utc": 1492349890.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgcup4m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc0j1n", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "^Thank you guys so much for sparing a moment. \nI just checked those out ~ \n\nComing from Accounts, this sort of stuff is so wow to me. (Everyone here only talks about the Big 4 and CPA/CA, like theres no deviation for anything). The idea of a portfolio is just so scary but comforting. Theres so many resources online, so yeah I am a bit overwhelmed.\nBut after html/cc/java script, where is a good direction to go from there in your opinion?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;sup&gt;Thank&lt;/sup&gt; you guys so much for sparing a moment. \nI just checked those out ~ &lt;/p&gt;\n\n&lt;p&gt;Coming from Accounts, this sort of stuff is so wow to me. (Everyone here only talks about the Big 4 and CPA/CA, like theres no deviation for anything). The idea of a portfolio is just so scary but comforting. Theres so many resources online, so yeah I am a bit overwhelmed.\nBut after html/cc/java script, where is a good direction to go from there in your opinion?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcup4m", "score_hidden": false, "stickied": false, "created": 1492418983.0, "created_utc": 1492390183.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0j1n", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "IceTimux", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I would say, keep at it learning web dev, once you feel comfortable with HTML, CSS and JS and can build a nice static website that (with feedback) other people think is nice too. I would suggest you pick a framework (Laravel, Ruby on Rails, or any JS framework) and get some backend experience. Build something with a database. Then, apply for any web dev job you want :D. Or start freelancing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say, keep at it learning web dev, once you feel comfortable with HTML, CSS and JS and can build a nice static website that (with feedback) other people think is nice too. I would suggest you pick a framework (Laravel, Ruby on Rails, or any JS framework) and get some backend experience. Build something with a database. Then, apply for any web dev job you want :D. Or start freelancing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc0j1n", "score_hidden": false, "stickied": false, "created": 1492377437.0, "created_utc": 1492348637.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgczn8c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "petedee", "parent_id": "t1_dgcsfbc", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Possibly, it depends on what the camp asks you to do. \n\nFor entry level jobs, most employers will want to see what you can do and a bit of passion for the work. For my first job at a small local code shop I basically followed a lynda.com PHP tutorial and gave them that, it wasn't the most rigorous recruitment process but it got my foot in the door.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Possibly, it depends on what the camp asks you to do. &lt;/p&gt;\n\n&lt;p&gt;For entry level jobs, most employers will want to see what you can do and a bit of passion for the work. For my first job at a small local code shop I basically followed a lynda.com PHP tutorial and gave them that, it wasn&amp;#39;t the most rigorous recruitment process but it got my foot in the door.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgczn8c", "score_hidden": false, "stickied": false, "created": 1492425676.0, "created_utc": 1492396876.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsfbc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc40pi", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Woooaaaahhhhhh This is amazing. Thank you so much &lt;3 Still new to all this so its hard to know where to even look at sometimes.\nCurious, do a lot of bootcamps help in job assistance? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woooaaaahhhhhh This is amazing. Thank you so much &amp;lt;3 Still new to all this so its hard to know where to even look at sometimes.\nCurious, do a lot of bootcamps help in job assistance? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcsfbc", "score_hidden": false, "stickied": false, "created": 1492415904.0, "created_utc": 1492387104.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc40pi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "N3KIO", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Do https://www.freecodecamp.com first before you drop 4k on something you think you might like, becreful what you pay for 95% of the time those codecamp are designed to take your money and teach you outdated content, do your research first", "edited": 1492354857.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do &lt;a href=\"https://www.freecodecamp.com\"&gt;https://www.freecodecamp.com&lt;/a&gt; first before you drop 4k on something you think you might like, becreful what you pay for 95% of the time those codecamp are designed to take your money and teach you outdated content, do your research first&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc40pi", "score_hidden": false, "stickied": false, "created": 1492383330.0, "created_utc": 1492354530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgcsa6d", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc2ehl", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Ahahah Dont get me wrong, I love long blacks/espressos. I just never understood why people at work traded in an expensive, god-send of a machine for something so tasteless. (Despite my repeated offers to make cafe-quality coffee. I used to love starting my shifts at my old workplace with piping hot coffees for everyone &lt;3 ). \n\nI think it just comes back to me working at a place where I don't feel my wants and skills aligning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahahah Dont get me wrong, I love long blacks/espressos. I just never understood why people at work traded in an expensive, god-send of a machine for something so tasteless. (Despite my repeated offers to make cafe-quality coffee. I used to love starting my shifts at my old workplace with piping hot coffees for everyone &amp;lt;3 ). &lt;/p&gt;\n\n&lt;p&gt;I think it just comes back to me working at a place where I don&amp;#39;t feel my wants and skills aligning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcsa6d", "score_hidden": false, "stickied": false, "created": 1492415707.0, "created_utc": 1492386907.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc2ehl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GNU_RIDA", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "&gt;depressingly drink shitty black coffee\n\nThis is a really important part of my web development workflow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;depressingly drink shitty black coffee&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a really important part of my web development workflow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc2ehl", "score_hidden": false, "stickied": false, "created": 1492380827.0, "created_utc": 1492352027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgcwq7b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shinobiwarrior", "parent_id": "t1_dgct08l", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "No problem! There are even meetups of people that are completing the course, so it seems it's a really good starting point :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem! There are even meetups of people that are completing the course, so it seems it&amp;#39;s a really good starting point :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcwq7b", "score_hidden": false, "stickied": false, "created": 1492421609.0, "created_utc": 1492392809.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgct08l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc0jc4", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Oh wow thats super legit. I didn't think that there was stuff like that. Thanks so much for sparing a moment!! C:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh wow thats super legit. I didn&amp;#39;t think that there was stuff like that. Thanks so much for sparing a moment!! C:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgct08l", "score_hidden": false, "stickied": false, "created": 1492416715.0, "created_utc": 1492387915.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0jc4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shinobiwarrior", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Congrats for your strength and your will to be better! \n\nWhat I can recommend, is to have a look at freecodecamp, it gives you a full course (including js), and it also makes you create some sites for charity organizations or things like that. It also has a very nice community willing to help. \n\nAs a disclaimer, I've never use it (yet), but I've got some friends that recommend it. \n\nGood luck on your new path! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats for your strength and your will to be better! &lt;/p&gt;\n\n&lt;p&gt;What I can recommend, is to have a look at freecodecamp, it gives you a full course (including js), and it also makes you create some sites for charity organizations or things like that. It also has a very nice community willing to help. &lt;/p&gt;\n\n&lt;p&gt;As a disclaimer, I&amp;#39;ve never use it (yet), but I&amp;#39;ve got some friends that recommend it. &lt;/p&gt;\n\n&lt;p&gt;Good luck on your new path! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc0jc4", "score_hidden": false, "stickied": false, "created": 1492377452.0, "created_utc": 1492348652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgctcmi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc0u87", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "The thing is, I tried to improve everything else. Then I realised that I was really just lying to myself. \n\nMy job is another part of my life, and I just can't see the light at the end of this. I realised that I have 0 interest in climbing a ladder in this field. \n\nSport, family, friends, and learning art coding are what keeps me going in life. The only thing which causes 80% of my unhappiness is building a career in something i have no interest in, and working for a place that doesn't allow me to grow/develop/utilise my skills.\n\nMost of my job is already automated with Excel VBA/Macros. So I'm literally a desk monkey, staying in the office when everyone is out. Hence why I'm a lurker on reddit and a user of Udemy.\n\nDon't get me wrong, the knowledge I have is extremely useful and I'm glad I have it. I was just never designed to follow such a path. I hope I can use it to supplement other things :)\n\nEdit: I should also reply that my company is not prone to evolving with the times.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is, I tried to improve everything else. Then I realised that I was really just lying to myself. &lt;/p&gt;\n\n&lt;p&gt;My job is another part of my life, and I just can&amp;#39;t see the light at the end of this. I realised that I have 0 interest in climbing a ladder in this field. &lt;/p&gt;\n\n&lt;p&gt;Sport, family, friends, and learning art coding are what keeps me going in life. The only thing which causes 80% of my unhappiness is building a career in something i have no interest in, and working for a place that doesn&amp;#39;t allow me to grow/develop/utilise my skills.&lt;/p&gt;\n\n&lt;p&gt;Most of my job is already automated with Excel VBA/Macros. So I&amp;#39;m literally a desk monkey, staying in the office when everyone is out. Hence why I&amp;#39;m a lurker on reddit and a user of Udemy.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong, the knowledge I have is extremely useful and I&amp;#39;m glad I have it. I was just never designed to follow such a path. I hope I can use it to supplement other things :)&lt;/p&gt;\n\n&lt;p&gt;Edit: I should also reply that my company is not prone to evolving with the times.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgctcmi", "score_hidden": false, "stickied": false, "created": 1492417173.0, "created_utc": 1492388373.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0u87", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "edimaudo", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I don't think web dev would solve your problem.  You should spend more time expanding your social network.  Also find new hobbies that would stimulate you.  If your job is boring it is the best place to see if you can automate your job.  It would show that you know your stuff and can create systems that can do it without you.  You can tap into your marketing degree and sell this solution to your boss or another company.  Just my two cents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think web dev would solve your problem.  You should spend more time expanding your social network.  Also find new hobbies that would stimulate you.  If your job is boring it is the best place to see if you can automate your job.  It would show that you know your stuff and can create systems that can do it without you.  You can tap into your marketing degree and sell this solution to your boss or another company.  Just my two cents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc0u87", "score_hidden": false, "stickied": false, "created": 1492378041.0, "created_utc": 1492349241.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgdi33a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ixalmida", "parent_id": "t1_dgctly9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I didn't come from a financial background but I'm pretty good at math.  Honestly, the math wasn't nearly as hard as optimizing the code for sales incentive calculations.  Every service order, contract and sale had to be iterated over one at a time due to incentive dollar thresholds. In other words, as soon as you hit a dollar threshold, incentive would split into two rates for a particular sale.  If it was a big sale, the split could significantly influence incentives.\n\nTo give you an idea of the volume, some of these salespeople booked thousands of jobs per month and grossed almost a million dollars a year in incentives.  I also had to fit all this data into a filterable, interactive table - not a small feat.  When I first started, the nightly incentive calculations that the previous developer created took 8+ hours each day to run.  By the time I left, I had optimized them down to a few minutes.  Though I consider it one of my greatest accomplishments, I think I would still do it better today than I did then.  That's the nature of the job - there's always room to improve!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t come from a financial background but I&amp;#39;m pretty good at math.  Honestly, the math wasn&amp;#39;t nearly as hard as optimizing the code for sales incentive calculations.  Every service order, contract and sale had to be iterated over one at a time due to incentive dollar thresholds. In other words, as soon as you hit a dollar threshold, incentive would split into two rates for a particular sale.  If it was a big sale, the split could significantly influence incentives.&lt;/p&gt;\n\n&lt;p&gt;To give you an idea of the volume, some of these salespeople booked thousands of jobs per month and grossed almost a million dollars a year in incentives.  I also had to fit all this data into a filterable, interactive table - not a small feat.  When I first started, the nightly incentive calculations that the previous developer created took 8+ hours each day to run.  By the time I left, I had optimized them down to a few minutes.  Though I consider it one of my greatest accomplishments, I think I would still do it better today than I did then.  That&amp;#39;s the nature of the job - there&amp;#39;s always room to improve!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdi33a", "score_hidden": false, "stickied": false, "created": 1492466078.0, "created_utc": 1492437278.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctly9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc195b", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Oh wow. Thanks for explaining that. Its really inspiring that you managed to combine financial reporting with that. How did you start your journey?\n\n(From what you described, at the moment, general seems like the way to go for me. Thanks for explaining that)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh wow. Thanks for explaining that. Its really inspiring that you managed to combine financial reporting with that. How did you start your journey?&lt;/p&gt;\n\n&lt;p&gt;(From what you described, at the moment, general seems like the way to go for me. Thanks for explaining that)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgctly9", "score_hidden": false, "stickied": false, "created": 1492417513.0, "created_utc": 1492388713.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc195b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ixalmida", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "If your work/life/career makes you mostly unhappy (even if there are fleeting moments of happiness), you need to make a change.  What that change is is entirely up to you but it sounds like you've got a grasp on that part.\n\nSounds like you've zeroed in on the secret of webdev - it is very creative and not really that hard to learn. \nWhat CAN be hard to learn are best practices.  That is generally what you learn from a classical CS program, but can be learned from the web if you ask questions along the way.\n\nIf you really do go into webdev, you should choose a path for your career early.  If you decide to specialize, you will be able to command a higher salary but might not have as many opportunities.  If you stay general, you will have more opportunities but probably not as high of a salary.  If you specialize in front end development, you'll find your creative side challenged more.  If you specialize in back-end development, your problem-solving side will be challenged more.  If boredom is your main problem, it might be best just to keep it general.  As long as you go into it knowing what to expect, you'll thrive as a webdev.\n\nI can't recommend or discourage you from a boot camp since I never took one.  I can only say that I began my career at a company who gave me a chance and a few weeks to get up to speed with their web technologies, even though I only knew HTML/CSS and a little Visaul Basic.  In a few weeks, I was upgrading their PHP/Python incentive and financial reporting systems (albeit, with code that I would find laughable today).  Employers like that don't come along often though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your work/life/career makes you mostly unhappy (even if there are fleeting moments of happiness), you need to make a change.  What that change is is entirely up to you but it sounds like you&amp;#39;ve got a grasp on that part.&lt;/p&gt;\n\n&lt;p&gt;Sounds like you&amp;#39;ve zeroed in on the secret of webdev - it is very creative and not really that hard to learn. \nWhat CAN be hard to learn are best practices.  That is generally what you learn from a classical CS program, but can be learned from the web if you ask questions along the way.&lt;/p&gt;\n\n&lt;p&gt;If you really do go into webdev, you should choose a path for your career early.  If you decide to specialize, you will be able to command a higher salary but might not have as many opportunities.  If you stay general, you will have more opportunities but probably not as high of a salary.  If you specialize in front end development, you&amp;#39;ll find your creative side challenged more.  If you specialize in back-end development, your problem-solving side will be challenged more.  If boredom is your main problem, it might be best just to keep it general.  As long as you go into it knowing what to expect, you&amp;#39;ll thrive as a webdev.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t recommend or discourage you from a boot camp since I never took one.  I can only say that I began my career at a company who gave me a chance and a few weeks to get up to speed with their web technologies, even though I only knew HTML/CSS and a little Visaul Basic.  In a few weeks, I was upgrading their PHP/Python incentive and financial reporting systems (albeit, with code that I would find laughable today).  Employers like that don&amp;#39;t come along often though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc195b", "score_hidden": false, "stickied": false, "created": 1492378825.0, "created_utc": 1492350025.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgcu2f9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc256u", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Thanks for taking the time ~\nAhahah yeah Im just a lurker. Have several accounts. \nI guess Im really considering this for a few reasons. Im looking at a different direction to go, one where its okay to be creative yet logical. \n\nIn truth, I was not at all expecting this from even learning baby coding. I can actually see the magic/applications in this, and just learning it opens a whole new world for me.\n\nI don't have a desire to pursue the ~~traditional~~ route of accounting, nor am I interested in it. It is a useful skill and I hope to apply it one day. I wish that i was familiar with other things, but it really all just the usual accounts stuff that I deal with.\n\nThanks for the advice; I feel like most people do recommend self learning. I guess its also just having some sort of security that some of the people here who run them help you get your foot in the door after. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for taking the time ~\nAhahah yeah Im just a lurker. Have several accounts. \nI guess Im really considering this for a few reasons. Im looking at a different direction to go, one where its okay to be creative yet logical. &lt;/p&gt;\n\n&lt;p&gt;In truth, I was not at all expecting this from even learning baby coding. I can actually see the magic/applications in this, and just learning it opens a whole new world for me.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have a desire to pursue the &lt;del&gt;traditional&lt;/del&gt; route of accounting, nor am I interested in it. It is a useful skill and I hope to apply it one day. I wish that i was familiar with other things, but it really all just the usual accounts stuff that I deal with.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the advice; I feel like most people do recommend self learning. I guess its also just having some sort of security that some of the people here who run them help you get your foot in the door after. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcu2f9", "score_hidden": false, "stickied": false, "created": 1492418136.0, "created_utc": 1492389336.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc256u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MWrathDev", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "&gt; I can't take my job, and now I shit around on reddit all day.\n\nInteresting you dont have many points to your account... lurker?\n\n&gt; Am I going too fast with this? Any advices?\n\n&gt; Im thinking of applying for a three month full-time bootcamp that costs $4,000 USD plus help in job/internship applications.\n\nBe careful about bootcamps. Many of them are just about over promising / under delivering. If you want to do this because you think it'll help you get further grounding in this field cool, as long as it's reputable (i.e the content is up to date) it's to your benefit.\n\nIf you're doing this because you think it's a qualification that will help you land a job, i suggest reconsidering.\n\n&gt; Im seriously looking at going into web-development (also supplements my marketing degree), while learning some graphic design/illustration/animation things on the side.\n\nYou are correct in your assumption, marketing / design is a being part of front-end (UI/UX) roles. However something you might've missed, since you have background in accounting you must also be familiar with relational databases. RDBMS are actually what drives some of the more advanced features of online services (logins / auth, user profiles, etc).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I can&amp;#39;t take my job, and now I shit around on reddit all day.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Interesting you dont have many points to your account... lurker?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Am I going too fast with this? Any advices?&lt;/p&gt;\n\n&lt;p&gt;Im thinking of applying for a three month full-time bootcamp that costs $4,000 USD plus help in job/internship applications.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Be careful about bootcamps. Many of them are just about over promising / under delivering. If you want to do this because you think it&amp;#39;ll help you get further grounding in this field cool, as long as it&amp;#39;s reputable (i.e the content is up to date) it&amp;#39;s to your benefit.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re doing this because you think it&amp;#39;s a qualification that will help you land a job, i suggest reconsidering.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Im seriously looking at going into web-development (also supplements my marketing degree), while learning some graphic design/illustration/animation things on the side.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are correct in your assumption, marketing / design is a being part of front-end (UI/UX) roles. However something you might&amp;#39;ve missed, since you have background in accounting you must also be familiar with relational databases. RDBMS are actually what drives some of the more advanced features of online services (logins / auth, user profiles, etc).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc256u", "score_hidden": false, "stickied": false, "created": 1492380398.0, "created_utc": 1492351598.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgd1l6n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trippel", "parent_id": "t1_dgcu79j", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Nope. I began my professional career as a dancer in a modern repertory dance company. After a few years I decided it was no longer a lifestyle that I particularly enjoyed... the demands on mind, body, and soul are too demanding for the payoff.\n\nSo I kinda drifted for a time, met an amazing girlfriend, and produced a few dance shows with her. Each show needed its own marketing website and thus I turned to the one tool I knew which was WordPress and so I thought, \"hrmmm, maybe I could just pump out some WordPress sites and do this freelance.\" From there, I took a coding bootcamp for full-stack JavaScript and eventually landed a job at a small shoe company in Portland, OR you may have heard of.\n\nSurprisingly, it keeps me as creatively engaged as my former career though I'm more in the engineering side of things these days versus writing applications.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope. I began my professional career as a dancer in a modern repertory dance company. After a few years I decided it was no longer a lifestyle that I particularly enjoyed... the demands on mind, body, and soul are too demanding for the payoff.&lt;/p&gt;\n\n&lt;p&gt;So I kinda drifted for a time, met an amazing girlfriend, and produced a few dance shows with her. Each show needed its own marketing website and thus I turned to the one tool I knew which was WordPress and so I thought, &amp;quot;hrmmm, maybe I could just pump out some WordPress sites and do this freelance.&amp;quot; From there, I took a coding bootcamp for full-stack JavaScript and eventually landed a job at a small shoe company in Portland, OR you may have heard of.&lt;/p&gt;\n\n&lt;p&gt;Surprisingly, it keeps me as creatively engaged as my former career though I&amp;#39;m more in the engineering side of things these days versus writing applications.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd1l6n", "score_hidden": false, "stickied": false, "created": 1492428429.0, "created_utc": 1492399629.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu79j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgc5qjm", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Unfortunately Im not! (I had to google where that was. I live at the bottom of the earth ahaha).\n\n&gt; in my experience jumping into this crazy world has been a dream.\n\nI love that last line. My whole reality is in jumbles at the moment, so everything is just crazy to me.\nIf you don't mind, what got you into it? (I assume it wasn't a straight path for you either)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately Im not! (I had to google where that was. I live at the bottom of the earth ahaha).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;in my experience jumping into this crazy world has been a dream.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I love that last line. My whole reality is in jumbles at the moment, so everything is just crazy to me.\nIf you don&amp;#39;t mind, what got you into it? (I assume it wasn&amp;#39;t a straight path for you either)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcu79j", "score_hidden": false, "stickied": false, "created": 1492418321.0, "created_utc": 1492389521.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5qjm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trippel", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "If you happen to be in the Portland area, we should meet up. Otherwise, I have a similar story and I'd say go for it. There will be bumps along the way, expectations that will not be initially met, teeth gnashing, and stack overflows but in my experience jumping into this crazy world has been a dream. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you happen to be in the Portland area, we should meet up. Otherwise, I have a similar story and I&amp;#39;d say go for it. There will be bumps along the way, expectations that will not be initially met, teeth gnashing, and stack overflows but in my experience jumping into this crazy world has been a dream. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgc5qjm", "score_hidden": false, "stickied": false, "created": 1492385782.0, "created_utc": 1492356982.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgcuapy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgcbas4", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Thank you so much for your kind words. Really does make me smile.\n\n \nStarting general, and I hope that one day, I'll know which way to go into :) But yes, front end at the moment seems like the plan.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for your kind words. Really does make me smile.&lt;/p&gt;\n\n&lt;p&gt;Starting general, and I hope that one day, I&amp;#39;ll know which way to go into :) But yes, front end at the moment seems like the plan.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcuapy", "score_hidden": false, "stickied": false, "created": 1492418453.0, "created_utc": 1492389653.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbas4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "abeuscher", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "If you're looking to be creative in the new job, stay on the front end and start looking at design theory as well. If the main question here is whether you are making a viable choice, then the answer is of course. \n\n\nWeb development is more specialized now and continues to move in that direction, so you do need to refine the sort of role you are prepping for in your mind a bit.\n\nMuch luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re looking to be creative in the new job, stay on the front end and start looking at design theory as well. If the main question here is whether you are making a viable choice, then the answer is of course. &lt;/p&gt;\n\n&lt;p&gt;Web development is more specialized now and continues to move in that direction, so you do need to refine the sort of role you are prepping for in your mind a bit.&lt;/p&gt;\n\n&lt;p&gt;Much luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcbas4", "score_hidden": false, "stickied": false, "created": 1492393160.0, "created_utc": 1492364360.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgd6igt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fox_Retardant", "parent_id": "t1_dgcuekq", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Aus or NZ? If you take a look at the blogs for a lot of the people who are known in the industry you'll quickly find that a lot of them don't have a formal education in web development. \n\nHonestly, if any have a formal education at all it is usually comp sci or something similar, and then they moved into web dev, but that's definitely not a path you have to take.\n\nAs fields go, this is probably one of the more meritocratic ones. If you're willing to learn you're stuff then somewhere will employ you, you don't see too many knowledgeable web dev going unemployed. It's also nice in the sense that working for a small company can be as, if not more, rewarding than getting to work for a large company. Certainly not unique to web dev, but a nice touch all the same.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aus or NZ? If you take a look at the blogs for a lot of the people who are known in the industry you&amp;#39;ll quickly find that a lot of them don&amp;#39;t have a formal education in web development. &lt;/p&gt;\n\n&lt;p&gt;Honestly, if any have a formal education at all it is usually comp sci or something similar, and then they moved into web dev, but that&amp;#39;s definitely not a path you have to take.&lt;/p&gt;\n\n&lt;p&gt;As fields go, this is probably one of the more meritocratic ones. If you&amp;#39;re willing to learn you&amp;#39;re stuff then somewhere will employ you, you don&amp;#39;t see too many knowledgeable web dev going unemployed. It&amp;#39;s also nice in the sense that working for a small company can be as, if not more, rewarding than getting to work for a large company. Certainly not unique to web dev, but a nice touch all the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd6igt", "score_hidden": false, "stickied": false, "created": 1492437185.0, "created_utc": 1492408385.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuekq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgcbtcw", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Thank you so much for your insight and story. It really makes me feel calm when I get to read things like that.\n\n(I live at the bottom of the earth, so stories like this is uncommon to come across. I need to get out and meet some inspirational people ahaha.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for your insight and story. It really makes me feel calm when I get to read things like that.&lt;/p&gt;\n\n&lt;p&gt;(I live at the bottom of the earth, so stories like this is uncommon to come across. I need to get out and meet some inspirational people ahaha.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcuekq", "score_hidden": false, "stickied": false, "created": 1492418591.0, "created_utc": 1492389791.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbtcw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fox_Retardant", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "When I finished my degree in a completely unrelated field and started looking for jobs I realised that my heart really wasn't in it, 3 years of studying had made me lose all interest in something I used to be passionate about.\n\nStarted experimenting with a few things, web development and programming was one, and like you, it seemed to stick. Gained some very basic knowledge and was lucky enough to find a company that took me on to learn on the job.\n\nA few years later and I still love the field and enjoy my job. There's always something knew to learn and enough variety that you if you want you can find a specialism that you really love.\n\nI'd recommend taking a free (or cheaper than that route), can help you out with specifics if you want. One of the great things about web development is that there are ton of cheap or free resources, the downside is knowing which ones to trust is difficult as someone with experience, nigh on impossible as a beginner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I finished my degree in a completely unrelated field and started looking for jobs I realised that my heart really wasn&amp;#39;t in it, 3 years of studying had made me lose all interest in something I used to be passionate about.&lt;/p&gt;\n\n&lt;p&gt;Started experimenting with a few things, web development and programming was one, and like you, it seemed to stick. Gained some very basic knowledge and was lucky enough to find a company that took me on to learn on the job.&lt;/p&gt;\n\n&lt;p&gt;A few years later and I still love the field and enjoy my job. There&amp;#39;s always something knew to learn and enough variety that you if you want you can find a specialism that you really love.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d recommend taking a free (or cheaper than that route), can help you out with specifics if you want. One of the great things about web development is that there are ton of cheap or free resources, the downside is knowing which ones to trust is difficult as someone with experience, nigh on impossible as a beginner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcbtcw", "score_hidden": false, "stickied": false, "created": 1492393832.0, "created_utc": 1492365032.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgcukvl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgchqkl", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Thank you &lt;3 its so strange when people use the word freelancer. But yeah, until I posted this, I never really thought of that possibility to supplement accounts with it. (But I think I would like to go in the direction of Front end/design related) \n\nOh my lord. How do you deal? Our mini fridge is stocked with expired beer, port and whisky (5-15 years, a few opened) amongst other things. Theres more expired beer than food. (I threw out a block of expired butter the other day. From Easter last year)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you &amp;lt;3 its so strange when people use the word freelancer. But yeah, until I posted this, I never really thought of that possibility to supplement accounts with it. (But I think I would like to go in the direction of Front end/design related) &lt;/p&gt;\n\n&lt;p&gt;Oh my lord. How do you deal? Our mini fridge is stocked with expired beer, port and whisky (5-15 years, a few opened) amongst other things. Theres more expired beer than food. (I threw out a block of expired butter the other day. From Easter last year)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcukvl", "score_hidden": false, "stickied": false, "created": 1492418824.0, "created_utc": 1492390024.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchqkl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoDownvotesPlease", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I bet with your accounting background you'd be a good freelancer. I don't know if those bootcamps are good value, but if it's 3 months full time you should be able to learn quite a bit.\n\n&gt;There is 3 year old butter sitting on the shelf, not the fridge.\n\nlol. My company's kitchen has a 10 year old can of lobster bisque in one of the cupboards. No idea who brought that in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bet with your accounting background you&amp;#39;d be a good freelancer. I don&amp;#39;t know if those bootcamps are good value, but if it&amp;#39;s 3 months full time you should be able to learn quite a bit.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There is 3 year old butter sitting on the shelf, not the fridge.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;lol. My company&amp;#39;s kitchen has a 10 year old can of lobster bisque in one of the cupboards. No idea who brought that in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgchqkl", "score_hidden": false, "stickied": false, "created": 1492401685.0, "created_utc": 1492372885.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgcun7p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spam-The-Ham", "parent_id": "t1_dgcqzak", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Thank you kind stranger for your words &lt;3 All these comments are making my day.\n\nI never considered that to be an option, but I guess for now I'm keen on going in the front end/design route)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you kind stranger for your words &amp;lt;3 All these comments are making my day.&lt;/p&gt;\n\n&lt;p&gt;I never considered that to be an option, but I guess for now I&amp;#39;m keen on going in the front end/design route)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcun7p", "score_hidden": false, "stickied": false, "created": 1492418908.0, "created_utc": 1492390108.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqzak", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Telexen1", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Don't limit yourself to web development, especially front-end. With your existing expertise, you can be extremely valuable building financial systems in whatever format you want. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t limit yourself to web development, especially front-end. With your existing expertise, you can be extremely valuable building financial systems in whatever format you want. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcqzak", "score_hidden": false, "stickied": false, "created": 1492413965.0, "created_utc": 1492385165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65ozz9", "likes": null, "replies": "", "user_reports": [], "id": "dgdbb2g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ramnes", "parent_id": "t3_65ozz9", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Take a look at the 42 school and the Holberton school. Both are excellent and would help you. \n", "edited": 1492422242.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a look at the 42 school and the Holberton school. Both are excellent and would help you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdbb2g", "score_hidden": false, "stickied": false, "created": 1492450645.0, "created_utc": 1492421845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]