[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "webdev", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Happy Easter to those who celebrate it.&lt;/p&gt;\n\n&lt;p&gt;Let me start by saying that I&amp;#39;ve been fidgeting with website development since age 12. Back then, it seemed so cool and simple. You type a simple HTML document, throw a script and maybe a stylesheet (be it inline or external) on the page, and viola, you&amp;#39;re a genius.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve lost that sort of wonder over the years now, as I approach my 20th birthday in July. I&amp;#39;m going to Full Sail University to get my BS in this field, because I thought I wanted to work in it. But now, I realize it&amp;#39;s extreme hell, at least for front-end.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s getting way too complex to create a web page all of a sudden. This month I&amp;#39;ve been learning React, Polymer, and about to learn Angular after our Easter break. You cannot honestly say that it&amp;#39;s not daunting to learn these 3 things over the span of a single month. I&amp;#39;m submitting assignments without even fully understanding what the heck I just did, or submitting things that don&amp;#39;t even work just so I can get partial credit. I keep good communication with my professor via Slack. The deadlines are just unreal in my opinion. These frameworks should all be taught for a whole month each, not all 3 in a month.&lt;/p&gt;\n\n&lt;p&gt;And then we&amp;#39;re learning package managers and transpilers this month too; something else I&amp;#39;ve never had ANY experience with. This is a huge amount of information to absorb in a month, don&amp;#39;t you think?&lt;/p&gt;\n\n&lt;p&gt;Just why? Why has this field become so complex? Why has it become rocket science? ES6 resembles native code, like C++. Why? It&amp;#39;s like with cloud based operating systems like Chrome OS in conjunction with these new software standards, web development will BECOME computer programming. It&amp;#39;s like the gap between native code VS web code is closing more and more every year. It&amp;#39;s marvelous, sure. I think it&amp;#39;s cool that a little HTML and CSS and JS can make a Chromebook app you can monetize, because I&amp;#39;ve done it. But don&amp;#39;t you think the line needs to be drawn somewhere?&lt;/p&gt;\n\n&lt;p&gt;This is all mostly to vent. I&amp;#39;m just really really saddened that this thing that I once found wonder and happiness and joy in is now becoming something that is so obfuscated that it&amp;#39;s impossible to be a /good/ web developer unless you learn all this crap.&lt;/p&gt;\n\n&lt;p&gt;How does this even pan out in the real world? Do you all seriously know ALL of these package managers, transpilers, and frameworks? If so, you are worth way more than the ~$100k or whatever a year you probably make. This field seems agonizing and painful anymore.&lt;/p&gt;\n\n&lt;p&gt;What hurts the most is that I&amp;#39;m halfway through this degree program at Full Sail. I can&amp;#39;t quit now. Curses for my family making me attend college for something I didn&amp;#39;t even want to do for a career.&lt;/p&gt;\n\n&lt;p&gt;Oh, and I&amp;#39;m also angry at the companies who make these web browsers....If every browser could just support the same APIs, the same CSS styles, etc. etc. etc., there would be no need for certain things. jQuery would have never needed to exist, for example. \nI&amp;#39;m lost for words at this point. I hope you understand some of the feelings I have, and can relate. At least then I&amp;#39;d feel a little better about all this...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Happy Easter to those who celebrate it.\n\nLet me start by saying that I've been fidgeting with website development since age 12. Back then, it seemed so cool and simple. You type a simple HTML document, throw a script and maybe a stylesheet (be it inline or external) on the page, and viola, you're a genius.\n\nI've lost that sort of wonder over the years now, as I approach my 20th birthday in July. I'm going to Full Sail University to get my BS in this field, because I thought I wanted to work in it. But now, I realize it's extreme hell, at least for front-end.\n\nIt's getting way too complex to create a web page all of a sudden. This month I've been learning React, Polymer, and about to learn Angular after our Easter break. You cannot honestly say that it's not daunting to learn these 3 things over the span of a single month. I'm submitting assignments without even fully understanding what the heck I just did, or submitting things that don't even work just so I can get partial credit. I keep good communication with my professor via Slack. The deadlines are just unreal in my opinion. These frameworks should all be taught for a whole month each, not all 3 in a month.\n\nAnd then we're learning package managers and transpilers this month too; something else I've never had ANY experience with. This is a huge amount of information to absorb in a month, don't you think?\n\nJust why? Why has this field become so complex? Why has it become rocket science? ES6 resembles native code, like C++. Why? It's like with cloud based operating systems like Chrome OS in conjunction with these new software standards, web development will BECOME computer programming. It's like the gap between native code VS web code is closing more and more every year. It's marvelous, sure. I think it's cool that a little HTML and CSS and JS can make a Chromebook app you can monetize, because I've done it. But don't you think the line needs to be drawn somewhere?\n\nThis is all mostly to vent. I'm just really really saddened that this thing that I once found wonder and happiness and joy in is now becoming something that is so obfuscated that it's impossible to be a /good/ web developer unless you learn all this crap.\n\nHow does this even pan out in the real world? Do you all seriously know ALL of these package managers, transpilers, and frameworks? If so, you are worth way more than the ~$100k or whatever a year you probably make. This field seems agonizing and painful anymore.\n\nWhat hurts the most is that I'm halfway through this degree program at Full Sail. I can't quit now. Curses for my family making me attend college for something I didn't even want to do for a career.\n\nOh, and I'm also angry at the companies who make these web browsers....If every browser could just support the same APIs, the same CSS styles, etc. etc. etc., there would be no need for certain things. jQuery would have never needed to exist, for example. \nI'm lost for words at this point. I hope you understand some of the feelings I have, and can relate. At least then I'd feel a little better about all this...", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65shzh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Techie97", "saved": false, "mod_reports": [], "name": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "approved_by": null, "over_18": false, "domain": "self.webdev", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qs0q", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/webdev/comments/65shzh/web_developers_of_reddit_tell_me_you_can/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418669.0, "url": "https://www.reddit.com/r/webdev/comments/65shzh/web_developers_of_reddit_tell_me_you_can/", "author_flair_text": null, "quarantine": false, "title": "Web Developers of Reddit: Tell Me You Can Relate/Sympathize", "created_utc": 1492389869.0, "distinguished": null, "media": null, "upvote_ratio": 0.6, "num_comments": 33, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd8znd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Scowlface", "parent_id": "t1_dgcyi7d", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Well the cool thing about ES2015 is that you don't actually have to use any of that syntax.  It's mostly just syntactic sugar over what you can already do.  You can forgo object oriented programming and write functional programming all day long and still get the job done.\n\nLike you, I've been doing this since I was 12 or so, I got into it because I wanted to make a website for my Diablo 2 clan.  Back then it was mostly table based design, styles in the head or inline, and no JavaScript (at least for me).  I didn't go to school or a boot camp, so I guess I lucked out when I got a paid internship and then a full time job shortly after.\n\nI really hate that you feel this way man, and I hope it's just the stress of school getting you down.  Just know that in my experience, it's not anywhere near that bad in the real world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well the cool thing about ES2015 is that you don&amp;#39;t actually have to use any of that syntax.  It&amp;#39;s mostly just syntactic sugar over what you can already do.  You can forgo object oriented programming and write functional programming all day long and still get the job done.&lt;/p&gt;\n\n&lt;p&gt;Like you, I&amp;#39;ve been doing this since I was 12 or so, I got into it because I wanted to make a website for my Diablo 2 clan.  Back then it was mostly table based design, styles in the head or inline, and no JavaScript (at least for me).  I didn&amp;#39;t go to school or a boot camp, so I guess I lucked out when I got a paid internship and then a full time job shortly after.&lt;/p&gt;\n\n&lt;p&gt;I really hate that you feel this way man, and I hope it&amp;#39;s just the stress of school getting you down.  Just know that in my experience, it&amp;#39;s not anywhere near that bad in the real world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd8znd", "score_hidden": false, "stickied": false, "created": 1492442957.0, "created_utc": 1492414157.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgdg9z9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tioo", "parent_id": "t1_dgcyi7d", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Writing todo apps is an exercise to learn the basics of the framework. Front end frameworks are made to solve much larger problems efficiently. That being said, I doubt it's possible to write an efficient todo app in native JS / JQuery in a way that's more straightforward than using a front end framework.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Writing todo apps is an exercise to learn the basics of the framework. Front end frameworks are made to solve much larger problems efficiently. That being said, I doubt it&amp;#39;s possible to write an efficient todo app in native JS / JQuery in a way that&amp;#39;s more straightforward than using a front end framework.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdg9z9", "score_hidden": false, "stickied": false, "created": 1492463182.0, "created_utc": 1492434382.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyi7d", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Techie97", "parent_id": "t1_dgcx1sh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "EcmaScript (JavaScript) version 6 is like writing native code, using classes, inheritance, super(), etc. Basically it's major Object-Oriented-Programming, of which I have very little to no prior experience/knowledge of. Like, if I took a C++ course before this one, I'm sure I'd understand it a bit better.\n\nAnd thank you for agreeing that it's BS. They are simple apps, however, they can take upwards of say oh, 2-3 hours. It's ridiculous though, because though the intro videos are \"optional\", you aren't going to know what you're doing unless you watch them. These intro videos range anywhere from 30 minutes to an hour or more.\n\nNot to mention there's a lot of other \"optional\" videos too...Honestly if you really wanted to learn all 3 of these in a month, and you had the time to watch EVERYTHING, optional or not, you're looking at maybe 6+ hours to create what? ....A simple to-do list app. Wow.", "edited": 1492395707.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;EcmaScript (JavaScript) version 6 is like writing native code, using classes, inheritance, super(), etc. Basically it&amp;#39;s major Object-Oriented-Programming, of which I have very little to no prior experience/knowledge of. Like, if I took a C++ course before this one, I&amp;#39;m sure I&amp;#39;d understand it a bit better.&lt;/p&gt;\n\n&lt;p&gt;And thank you for agreeing that it&amp;#39;s BS. They are simple apps, however, they can take upwards of say oh, 2-3 hours. It&amp;#39;s ridiculous though, because though the intro videos are &amp;quot;optional&amp;quot;, you aren&amp;#39;t going to know what you&amp;#39;re doing unless you watch them. These intro videos range anywhere from 30 minutes to an hour or more.&lt;/p&gt;\n\n&lt;p&gt;Not to mention there&amp;#39;s a lot of other &amp;quot;optional&amp;quot; videos too...Honestly if you really wanted to learn all 3 of these in a month, and you had the time to watch EVERYTHING, optional or not, you&amp;#39;re looking at maybe 6+ hours to create what? ....A simple to-do list app. Wow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcyi7d", "score_hidden": false, "stickied": false, "created": 1492424077.0, "created_utc": 1492395277.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcx1sh", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Seerk", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Having to learn 3 frameworks simultaneously is ridiculous, unless they're really simple to-do style apps and they just want to give you guys a quick overview.\n\nIn the real world, your company usually has a single tech stack that rarely changes.\n\n\n&gt; ES6 resembles native code, like C++.\n\nWhat?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having to learn 3 frameworks simultaneously is ridiculous, unless they&amp;#39;re really simple to-do style apps and they just want to give you guys a quick overview.&lt;/p&gt;\n\n&lt;p&gt;In the real world, your company usually has a single tech stack that rarely changes.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;ES6 resembles native code, like C++.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcx1sh", "score_hidden": false, "stickied": false, "created": 1492422044.0, "created_utc": 1492393244.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd164o", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Soccham", "parent_id": "t1_dgcyrkp", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "This sounds like it's a problem with Full Sail and not with web development. \n\nI don't know of anyone who's ever needed or used Polymer. Teaching you React and Angular at the same time is stupid. They're two different tools that are used for similar functions. I'd say it'd be best to teach you React and build on that with each piece as you understand it more and more. Ex, React, then React + Redux, then React-Router. \n\nThese tools all serve different purposes and most of our jobs are using the right tools for the job + being able to learn and adapt to the newer things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds like it&amp;#39;s a problem with Full Sail and not with web development. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know of anyone who&amp;#39;s ever needed or used Polymer. Teaching you React and Angular at the same time is stupid. They&amp;#39;re two different tools that are used for similar functions. I&amp;#39;d say it&amp;#39;d be best to teach you React and build on that with each piece as you understand it more and more. Ex, React, then React + Redux, then React-Router. &lt;/p&gt;\n\n&lt;p&gt;These tools all serve different purposes and most of our jobs are using the right tools for the job + being able to learn and adapt to the newer things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd164o", "score_hidden": false, "stickied": false, "created": 1492427825.0, "created_utc": 1492399025.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyrkp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Techie97", "parent_id": "t1_dgcxvi8", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I understand what you're saying. However, don't you think this field is becoming just a bit...over-saturated with tools?\n\nI'll meet you halfway and say that yes, Angular, jQuery, Polymer, and React are all nice tools and serve their purposes for people. However, I stand firm that it's BS to make me learn all 4 in a month (I forgot to mention jQuery is also being covered this month, so 4 frameworks total + package managers/transpilers).\n\nI guess my real animosity is towards Full Sail for forcing all this on people at once. I hate this school with a passion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand what you&amp;#39;re saying. However, don&amp;#39;t you think this field is becoming just a bit...over-saturated with tools?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll meet you halfway and say that yes, Angular, jQuery, Polymer, and React are all nice tools and serve their purposes for people. However, I stand firm that it&amp;#39;s BS to make me learn all 4 in a month (I forgot to mention jQuery is also being covered this month, so 4 frameworks total + package managers/transpilers).&lt;/p&gt;\n\n&lt;p&gt;I guess my real animosity is towards Full Sail for forcing all this on people at once. I hate this school with a passion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcyrkp", "score_hidden": false, "stickied": false, "created": 1492424438.0, "created_utc": 1492395638.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxvi8", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "shimshamminheron", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I'm still new to this world, and I can relate that it sometimes feels overwhelming just how much information is out there. But I think you're kind of looking at things ass-backwards. The only reason that there are so many jobs in web development, is because it IS difficult AND demanding AND complicated. You're right. HTML was easy back in the day. That meant that any old hack could throw together a website. A good thing? Maybe, but that also means you're out of a job. Coming into this field now, you have the PRIVILEGE of discovering your own little niche in a burgeoning ecosystem.\n\nTake a step back for a second and appreciate the beauty of the web today. The 90s were an ugly time. Websites looked like crap. Now, they're dynamic, interesting, beautiful. Many people have devoted their careers to developing tools to ALLOW us to make websites that way. Yes, they take some time to learn. But can you stop for a second and realize how awesome that is? Someone made a tool that helps you STYLE content beyond changing the border colors and background image? That's fucking awesome. Someone developed a tool that lets you incorporate ANIMATIONS and INTERACTIVITY? Amazing! Someone made a tool that helps you make sure your webpage doesn't look like shit on a thousand different screen sizes? Incredible!! Websites are so fucking cool today. It's overwhelming, absolutely, but it's also really thrilling.\n\nIt's always frustrating when you are having trouble learning new technologies. People like knowing things. People don't like NOT knowing things. But whenever you are learning a new tool just take a step back to appreciate how awesome it is that someone went to the effort of building that tool for you to use. Sure every tool has its downsides, its weaknesses, yadda yadda yadda. Tools reflect the people that made them. They're imperfect. But they make things a helluva lot easier than things would've been otherwise.\n\nJust remember what you love about what you do and you'll get past the tough times.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m still new to this world, and I can relate that it sometimes feels overwhelming just how much information is out there. But I think you&amp;#39;re kind of looking at things ass-backwards. The only reason that there are so many jobs in web development, is because it IS difficult AND demanding AND complicated. You&amp;#39;re right. HTML was easy back in the day. That meant that any old hack could throw together a website. A good thing? Maybe, but that also means you&amp;#39;re out of a job. Coming into this field now, you have the PRIVILEGE of discovering your own little niche in a burgeoning ecosystem.&lt;/p&gt;\n\n&lt;p&gt;Take a step back for a second and appreciate the beauty of the web today. The 90s were an ugly time. Websites looked like crap. Now, they&amp;#39;re dynamic, interesting, beautiful. Many people have devoted their careers to developing tools to ALLOW us to make websites that way. Yes, they take some time to learn. But can you stop for a second and realize how awesome that is? Someone made a tool that helps you STYLE content beyond changing the border colors and background image? That&amp;#39;s fucking awesome. Someone developed a tool that lets you incorporate ANIMATIONS and INTERACTIVITY? Amazing! Someone made a tool that helps you make sure your webpage doesn&amp;#39;t look like shit on a thousand different screen sizes? Incredible!! Websites are so fucking cool today. It&amp;#39;s overwhelming, absolutely, but it&amp;#39;s also really thrilling.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s always frustrating when you are having trouble learning new technologies. People like knowing things. People don&amp;#39;t like NOT knowing things. But whenever you are learning a new tool just take a step back to appreciate how awesome it is that someone went to the effort of building that tool for you to use. Sure every tool has its downsides, its weaknesses, yadda yadda yadda. Tools reflect the people that made them. They&amp;#39;re imperfect. But they make things a helluva lot easier than things would&amp;#39;ve been otherwise.&lt;/p&gt;\n\n&lt;p&gt;Just remember what you love about what you do and you&amp;#39;ll get past the tough times.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcxvi8", "score_hidden": false, "stickied": false, "created": 1492423196.0, "created_utc": 1492394396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgcz01i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Techie97", "parent_id": "t1_dgcykaz", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Yes, thank you for at least agreeing that it's crazy to do more than one thing at a time.\n\nBy the way, I have no plans of actually pursuing a career in this anymore. I'm actually looking to own my own retail business very soon. I'm actually using jQuery and Materialize (materializecss.com) to create my own customized HTML5 POS and integrate it with Square. I'm also creating my own rewards program, coupon generator, basic inventory management software, and lots more. All from scratch. \n\nI do have great appreciation for how far web development has become. I just feel so pressured to learn every single thing and stay on top of them all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, thank you for at least agreeing that it&amp;#39;s crazy to do more than one thing at a time.&lt;/p&gt;\n\n&lt;p&gt;By the way, I have no plans of actually pursuing a career in this anymore. I&amp;#39;m actually looking to own my own retail business very soon. I&amp;#39;m actually using jQuery and Materialize (materializecss.com) to create my own customized HTML5 POS and integrate it with Square. I&amp;#39;m also creating my own rewards program, coupon generator, basic inventory management software, and lots more. All from scratch. &lt;/p&gt;\n\n&lt;p&gt;I do have great appreciation for how far web development has become. I just feel so pressured to learn every single thing and stay on top of them all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcz01i", "score_hidden": false, "stickied": false, "created": 1492424763.0, "created_utc": 1492395963.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcykaz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "tostilocos", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Software has moved from the desktop to the web, and as such the web now demands a quality of user interaction on par with desktop apps.  This means frontend code is much more complex and as such is more on par with 'real programming'.  \n\nI'd argue that setting up npm with gulp and plugging in React/Angular with your CSS framework of choice is magnitudes faster and more convenient than accomplishing the same bootstrapping using any desktop or mobile IDE.  If it's not, getting your first sets of views and interactions likely is, once you've got the toolset down. \n\nIf you want to be a good, professional frontend developer, you need to learn the toolset.  That's the way the industry is going and guaranteed there will be another wave of things to learn before you're out of uni.  Part of doing this for a living is being really good at learning things so get used to it.\n\nThe one thing I'll tell you is pick either Angular or React to learn or play with first, doing both is nuts.  Doing either one will teach you a lot and the lessons learned in one will aid your learning in the other. Trying to do both is just going to burn you out.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Software has moved from the desktop to the web, and as such the web now demands a quality of user interaction on par with desktop apps.  This means frontend code is much more complex and as such is more on par with &amp;#39;real programming&amp;#39;.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d argue that setting up npm with gulp and plugging in React/Angular with your CSS framework of choice is magnitudes faster and more convenient than accomplishing the same bootstrapping using any desktop or mobile IDE.  If it&amp;#39;s not, getting your first sets of views and interactions likely is, once you&amp;#39;ve got the toolset down. &lt;/p&gt;\n\n&lt;p&gt;If you want to be a good, professional frontend developer, you need to learn the toolset.  That&amp;#39;s the way the industry is going and guaranteed there will be another wave of things to learn before you&amp;#39;re out of uni.  Part of doing this for a living is being really good at learning things so get used to it.&lt;/p&gt;\n\n&lt;p&gt;The one thing I&amp;#39;ll tell you is pick either Angular or React to learn or play with first, doing both is nuts.  Doing either one will teach you a lot and the lessons learned in one will aid your learning in the other. Trying to do both is just going to burn you out.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcykaz", "score_hidden": false, "stickied": false, "created": 1492424157.0, "created_utc": 1492395357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd9j6l", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "philipwhiuk", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Okay...\n\nYou don't always need all the tools.\n\nJust because you can use Redux doesn't mean you have to. Just because you can use React doesn't mean you have to. Just because you can use NPM doesn't mean you have to.\n\nIf tomorrow, for a personal project, i had to produce a form that people could submit stuff in and do some validation, I'd probably just use HTML, CSS and JavaScript. \n\nIf it's at work, then yes we'd probably throw the tooling in. But only because:\n\nA) Standardising makes switch between projects easy. Using the same version of React Bootstrap makes it fast to develop. \n\nWhen a new version comes out we learn how to upgrade once and then simply apply the changes everywhere that's still under active development and use.\n\nB) Converting projects later is a time consuming waste\n\nC) If you already have it setup it's a lot easier just to copy the standard stuff over.\n\nAnd no, i don't know Angular or Polymer. I vaguely know the difference between them and React but I'd have to upskill if i wanted to get a job with them.\n\nAs a company you pick a framework and use it a lot. My last company it was backend Spring Java and JQuery. This time it's Play Framework and React. Maybe the next one will be Node. Maybe not.\n\nYou can't master everything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay...&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t always need all the tools.&lt;/p&gt;\n\n&lt;p&gt;Just because you can use Redux doesn&amp;#39;t mean you have to. Just because you can use React doesn&amp;#39;t mean you have to. Just because you can use NPM doesn&amp;#39;t mean you have to.&lt;/p&gt;\n\n&lt;p&gt;If tomorrow, for a personal project, i had to produce a form that people could submit stuff in and do some validation, I&amp;#39;d probably just use HTML, CSS and JavaScript. &lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s at work, then yes we&amp;#39;d probably throw the tooling in. But only because:&lt;/p&gt;\n\n&lt;p&gt;A) Standardising makes switch between projects easy. Using the same version of React Bootstrap makes it fast to develop. &lt;/p&gt;\n\n&lt;p&gt;When a new version comes out we learn how to upgrade once and then simply apply the changes everywhere that&amp;#39;s still under active development and use.&lt;/p&gt;\n\n&lt;p&gt;B) Converting projects later is a time consuming waste&lt;/p&gt;\n\n&lt;p&gt;C) If you already have it setup it&amp;#39;s a lot easier just to copy the standard stuff over.&lt;/p&gt;\n\n&lt;p&gt;And no, i don&amp;#39;t know Angular or Polymer. I vaguely know the difference between them and React but I&amp;#39;d have to upskill if i wanted to get a job with them.&lt;/p&gt;\n\n&lt;p&gt;As a company you pick a framework and use it a lot. My last company it was backend Spring Java and JQuery. This time it&amp;#39;s Play Framework and React. Maybe the next one will be Node. Maybe not.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t master everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd9j6l", "score_hidden": false, "stickied": false, "created": 1492444583.0, "created_utc": 1492415783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dge0iv4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thebrightmonkey", "parent_id": "t1_dge06fs", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Then I can see why you'd find it tough to get deep into things. It has helped me a lot learning these concepts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then I can see why you&amp;#39;d find it tough to get deep into things. It has helped me a lot learning these concepts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dge0iv4", "score_hidden": false, "stickied": false, "created": 1492487568.0, "created_utc": 1492458768.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge06fs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Techie97", "parent_id": "t1_dgdgn8i", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Nope. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dge06fs", "score_hidden": false, "stickied": false, "created": 1492487183.0, "created_utc": 1492458383.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgn8i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thebrightmonkey", "parent_id": "t1_dgcz7xv", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "&gt; OOP\n\nNo object oriented programming at all? No teachings on encapsulation, inheritance and polymorphism etc?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;OOP&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No object oriented programming at all? No teachings on encapsulation, inheritance and polymorphism etc?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdgn8i", "score_hidden": false, "stickied": false, "created": 1492463815.0, "created_utc": 1492435015.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcz7xv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Techie97", "parent_id": "t1_dgcz22z", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Well, another complaint I have about Full Sail is that they give you a little bit of everything instead of focusing on one thing.\n\nLike for example, this month we are transpiling ES5 -&gt; ES6. ES6 is VERY by-the-book OOP. However, I've literally had no prior classes teaching about OOP. Literally every month of this school I learn like 20+ new things. It makes my brain hurt. &gt;.&gt;", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, another complaint I have about Full Sail is that they give you a little bit of everything instead of focusing on one thing.&lt;/p&gt;\n\n&lt;p&gt;Like for example, this month we are transpiling ES5 -&amp;gt; ES6. ES6 is VERY by-the-book OOP. However, I&amp;#39;ve literally had no prior classes teaching about OOP. Literally every month of this school I learn like 20+ new things. It makes my brain hurt. &amp;gt;.&amp;gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcz7xv", "score_hidden": false, "stickied": false, "created": 1492425071.0, "created_utc": 1492396271.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcz22z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "longooglite", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Web development is going to be programming, software engineering, whatever you want to call it. People are so used to their web browser that it's going to continue in that direction, and we're going to be using web technologies in all other places. Good news is you're well positioned for the future. The bad news is that you don't get to ignore good programming fundamentals, OOP, functional programming, design principles and all the other nerd stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Web development is going to be programming, software engineering, whatever you want to call it. People are so used to their web browser that it&amp;#39;s going to continue in that direction, and we&amp;#39;re going to be using web technologies in all other places. Good news is you&amp;#39;re well positioned for the future. The bad news is that you don&amp;#39;t get to ignore good programming fundamentals, OOP, functional programming, design principles and all the other nerd stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcz22z", "score_hidden": false, "stickied": false, "created": 1492424842.0, "created_utc": 1492396042.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd21zb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mattaugamer", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "&gt; You cannot honestly say that it's not daunting to learn these 3 things over the span of a single month.\n\nHonestly, that's a lot. It's probably too much. But I feel like you might not be expected to learn it to any serious degree. You just couldn't **master** these technologies. \n\n&gt; Just why? Why has this field become so complex? Why has it become rocket science? ES6 resembles native code, like C++. Why?\n\nIt really doesn't. ES6 adds some features to ES5, but it's hardly a huge step. The main thing you're probably referring to is its use of classes. But that is hardly the level of OOP complexity of something like C++, Java or even PHP, with abstract classes, traits, interfaces, generics, etc.\n\nIs it an increase in complexity? Absolutely. But for benefits. ES6 classes are easier to work with and more \"programmery\" than the extending model of ES5.\n\n&gt; How does this even pan out in the real world? Do you all seriously know ALL of these package managers, transpilers, and frameworks?\n\nI think a lot of new developers have a poor understanding of what these technologies are **for**. \n\nLet's be clear. **None of it is necessary.**\n\nHTML. CSS. *Maybe* JavaScript. That's all you need. Seriously. That's it. Pretty much everything you need to make a website. Everything else, from backend languages to builders and transpilers, post-processing, frameworks... they're all... optimisations. Improvements to workflows, to maintainability.\n\nWithout understanding what you're trying to optimise and why you only look at the end complexity and don't see the benefit.\n\nTake package managers as an example. Yeah, there's some complexity to things like NPM. But you have to compare not some sort of arbitrary complexity, but how does it compare to **not** having a package manager? Like... if you don't use a package manager you have to **be** a package manager. Using jQuery, a few plugins, something like moment, maybe a string formatting library... boy I hope they work together. I hope they require the same versions. Oh, is there a new version of moment that fixes a bug? It requires a new version of jQuery? Oh, that doesn't work with one of your plugins...\n\nThis stuff is actually hard. And the more complex your application the more the complex these requirements - and exponentially so. A simple app might well have five requirements, but a complex app 30. And each of them now has interactions with each other, and their own dependencies.\n\nThere's a lot to learn. But there are actual reasons to do these things.\n\nHonestly, I don't enjoy tech and learning and crap. But I **do** enjoy having the tools to solve actual problems. To make things, build things.\n\nThat's very satisfying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You cannot honestly say that it&amp;#39;s not daunting to learn these 3 things over the span of a single month.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Honestly, that&amp;#39;s a lot. It&amp;#39;s probably too much. But I feel like you might not be expected to learn it to any serious degree. You just couldn&amp;#39;t &lt;strong&gt;master&lt;/strong&gt; these technologies. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just why? Why has this field become so complex? Why has it become rocket science? ES6 resembles native code, like C++. Why?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It really doesn&amp;#39;t. ES6 adds some features to ES5, but it&amp;#39;s hardly a huge step. The main thing you&amp;#39;re probably referring to is its use of classes. But that is hardly the level of OOP complexity of something like C++, Java or even PHP, with abstract classes, traits, interfaces, generics, etc.&lt;/p&gt;\n\n&lt;p&gt;Is it an increase in complexity? Absolutely. But for benefits. ES6 classes are easier to work with and more &amp;quot;programmery&amp;quot; than the extending model of ES5.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;How does this even pan out in the real world? Do you all seriously know ALL of these package managers, transpilers, and frameworks?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think a lot of new developers have a poor understanding of what these technologies are &lt;strong&gt;for&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s be clear. &lt;strong&gt;None of it is necessary.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;HTML. CSS. &lt;em&gt;Maybe&lt;/em&gt; JavaScript. That&amp;#39;s all you need. Seriously. That&amp;#39;s it. Pretty much everything you need to make a website. Everything else, from backend languages to builders and transpilers, post-processing, frameworks... they&amp;#39;re all... optimisations. Improvements to workflows, to maintainability.&lt;/p&gt;\n\n&lt;p&gt;Without understanding what you&amp;#39;re trying to optimise and why you only look at the end complexity and don&amp;#39;t see the benefit.&lt;/p&gt;\n\n&lt;p&gt;Take package managers as an example. Yeah, there&amp;#39;s some complexity to things like NPM. But you have to compare not some sort of arbitrary complexity, but how does it compare to &lt;strong&gt;not&lt;/strong&gt; having a package manager? Like... if you don&amp;#39;t use a package manager you have to &lt;strong&gt;be&lt;/strong&gt; a package manager. Using jQuery, a few plugins, something like moment, maybe a string formatting library... boy I hope they work together. I hope they require the same versions. Oh, is there a new version of moment that fixes a bug? It requires a new version of jQuery? Oh, that doesn&amp;#39;t work with one of your plugins...&lt;/p&gt;\n\n&lt;p&gt;This stuff is actually hard. And the more complex your application the more the complex these requirements - and exponentially so. A simple app might well have five requirements, but a complex app 30. And each of them now has interactions with each other, and their own dependencies.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a lot to learn. But there are actual reasons to do these things.&lt;/p&gt;\n\n&lt;p&gt;Honestly, I don&amp;#39;t enjoy tech and learning and crap. But I &lt;strong&gt;do&lt;/strong&gt; enjoy having the tools to solve actual problems. To make things, build things.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s very satisfying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd21zb", "score_hidden": false, "stickied": false, "created": 1492429115.0, "created_utc": 1492400315.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgdgxfg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Tioo", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I understand your frustration. Your instructor is doing a terrible job making you understand why we need front end frameworks in the first place. Instead he/she is focussing on mere quantity.\n\nFrameworks are hard: each of them forces a more or less specific way of doing things. At first it may seem very complex: every framework has its own abstractions and concepts you must wrap your head around. Once you understand these concepts though, it becomes very easy. But this requires a LOT of time. More than month for sure. \n\nClearly, you cannot remotely understand a framework in a month, and it seems your prof is trying to teach 2 or 3 of them. This is ridiculous and a complete waste of time. \n\nFor the real world, mastering one framework is all it takes. If your employer uses another one, from what I have read, they will often let you learn it. As long as you master one framework, the others will be easier to pick up (this is very different than learning 3 of them in a month!). \n\nOverall, it seems that you do not know why frameworks are useful, which is normal. After all they are extremely complicated and require a totally new workflow with transpilers, module bundlers and what not. Compared to a simple HTML &amp; CSS website, it seems overly complicated.\n\nMy suggestion is that you look around the internet for pieces about the usefulness (or lack thereof) of frameworks. Once you understand what need frameworks solve, you will understand why web development tends to look more and more like programming. Try googling \"why do I need react\", or stuff like that. You will find TONS of pieces about it. There are people on both sides of the issue, of course.\n\nOverall, this should have been taught by your prof. There is no point teaching people about frameworks if they do not know why they are useful. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand your frustration. Your instructor is doing a terrible job making you understand why we need front end frameworks in the first place. Instead he/she is focussing on mere quantity.&lt;/p&gt;\n\n&lt;p&gt;Frameworks are hard: each of them forces a more or less specific way of doing things. At first it may seem very complex: every framework has its own abstractions and concepts you must wrap your head around. Once you understand these concepts though, it becomes very easy. But this requires a LOT of time. More than month for sure. &lt;/p&gt;\n\n&lt;p&gt;Clearly, you cannot remotely understand a framework in a month, and it seems your prof is trying to teach 2 or 3 of them. This is ridiculous and a complete waste of time. &lt;/p&gt;\n\n&lt;p&gt;For the real world, mastering one framework is all it takes. If your employer uses another one, from what I have read, they will often let you learn it. As long as you master one framework, the others will be easier to pick up (this is very different than learning 3 of them in a month!). &lt;/p&gt;\n\n&lt;p&gt;Overall, it seems that you do not know why frameworks are useful, which is normal. After all they are extremely complicated and require a totally new workflow with transpilers, module bundlers and what not. Compared to a simple HTML &amp;amp; CSS website, it seems overly complicated.&lt;/p&gt;\n\n&lt;p&gt;My suggestion is that you look around the internet for pieces about the usefulness (or lack thereof) of frameworks. Once you understand what need frameworks solve, you will understand why web development tends to look more and more like programming. Try googling &amp;quot;why do I need react&amp;quot;, or stuff like that. You will find TONS of pieces about it. There are people on both sides of the issue, of course.&lt;/p&gt;\n\n&lt;p&gt;Overall, this should have been taught by your prof. There is no point teaching people about frameworks if they do not know why they are useful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdgxfg", "score_hidden": false, "stickied": false, "created": 1492464267.0, "created_utc": 1492435467.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgcz3vv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Techie97", "parent_id": "t1_dgcxo7r", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I have a strong foundation. jQuery is like second nature to me now, and I'm sure if I wasn't rushed I could get a more intimate understanding of React, Polymer, and Angular too. Although I've tinkered with Angular on W3Schools before. A long time ago. But hopefully it comes back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a strong foundation. jQuery is like second nature to me now, and I&amp;#39;m sure if I wasn&amp;#39;t rushed I could get a more intimate understanding of React, Polymer, and Angular too. Although I&amp;#39;ve tinkered with Angular on W3Schools before. A long time ago. But hopefully it comes back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcz3vv", "score_hidden": false, "stickied": false, "created": 1492424911.0, "created_utc": 1492396111.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxo7r", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Seerk", "parent_id": "t1_dgcx8sf", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Focus should be on vanilla javascript. With a strong js foundation it becomes way easier to learn frameworks and libraries. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Focus should be on vanilla javascript. With a strong js foundation it becomes way easier to learn frameworks and libraries. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcxo7r", "score_hidden": false, "stickied": false, "created": 1492422908.0, "created_utc": 1492394108.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcx8sf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Darkassault2011", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Man, I wish they taught those frameworks more in depth in my college program. I'll be graduating knowing basic HTML5/CSS3 and JS/jQuery with a very VERY limited amount of Angular.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, I wish they taught those frameworks more in depth in my college program. I&amp;#39;ll be graduating knowing basic HTML5/CSS3 and JS/jQuery with a very VERY limited amount of Angular.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgcx8sf", "score_hidden": false, "stickied": false, "created": 1492422308.0, "created_utc": 1492393508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd0x77", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theoneandonlygene", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "It's great that you're learning some of these tools in school. From what I understand few in school are actually learning how to actually write code.\n\nOne of the constants in this business is you have to keep learning, all the time, or become irrelevant. The trick is not to learn react or ng or some specific framework, the game is learning how to learn a framework. Especially when it comes to js.\n\nMy advice is to focus on simplicity: figure out exactly the distinct piece of value you're creating with the one change you're working on, and focus on doing that one change as simply as possible. If you're building out a component in ng2-whatever, for example, don't even think about your routing until the component is done. Build out your component (and tests!!!) until it does only the thing you need it to, commit your change, and then worry about routing.\n\nWhen you get good at solving problems iteratively like this, you'll start to really see how these are all just tools in an arsenal which act differently but still very much the same. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s great that you&amp;#39;re learning some of these tools in school. From what I understand few in school are actually learning how to actually write code.&lt;/p&gt;\n\n&lt;p&gt;One of the constants in this business is you have to keep learning, all the time, or become irrelevant. The trick is not to learn react or ng or some specific framework, the game is learning how to learn a framework. Especially when it comes to js.&lt;/p&gt;\n\n&lt;p&gt;My advice is to focus on simplicity: figure out exactly the distinct piece of value you&amp;#39;re creating with the one change you&amp;#39;re working on, and focus on doing that one change as simply as possible. If you&amp;#39;re building out a component in ng2-whatever, for example, don&amp;#39;t even think about your routing until the component is done. Build out your component (and tests!!!) until it does only the thing you need it to, commit your change, and then worry about routing.&lt;/p&gt;\n\n&lt;p&gt;When you get good at solving problems iteratively like this, you&amp;#39;ll start to really see how these are all just tools in an arsenal which act differently but still very much the same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd0x77", "score_hidden": false, "stickied": false, "created": 1492427466.0, "created_utc": 1492398666.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd53f1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "UmerHasIt", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I agree with there being too many \"tools,\" which is why I only look at what they do and don't \"learn\" them unless I decide what I'm doing should need it. That way I'm not focusing on the specific tool (because tools live and die). \n\nMany have had this sentiment, and I encourage you to read this if you haven't already: https://medium.com/hacker-daily/how-it-feels-to-learn-javascript-in-2016-d3a717dd577f\n\nHonestly, I think it'll clean up in a few years. There always seems to be an \"ebb-and-flow\" sort of thing. Things clean up and are simple, then people want to expand it so much that it becomes the jumbled mess we have right now. After a while, people will think, \"this is insane\" and will come up with a way to streamline it. ", "edited": 1492406564.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with there being too many &amp;quot;tools,&amp;quot; which is why I only look at what they do and don&amp;#39;t &amp;quot;learn&amp;quot; them unless I decide what I&amp;#39;m doing should need it. That way I&amp;#39;m not focusing on the specific tool (because tools live and die). &lt;/p&gt;\n\n&lt;p&gt;Many have had this sentiment, and I encourage you to read this if you haven&amp;#39;t already: &lt;a href=\"https://medium.com/hacker-daily/how-it-feels-to-learn-javascript-in-2016-d3a717dd577f\"&gt;https://medium.com/hacker-daily/how-it-feels-to-learn-javascript-in-2016-d3a717dd577f&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Honestly, I think it&amp;#39;ll clean up in a few years. There always seems to be an &amp;quot;ebb-and-flow&amp;quot; sort of thing. Things clean up and are simple, then people want to expand it so much that it becomes the jumbled mess we have right now. After a while, people will think, &amp;quot;this is insane&amp;quot; and will come up with a way to streamline it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd53f1", "score_hidden": false, "stickied": false, "created": 1492434306.0, "created_utc": 1492405506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd2six", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ottergoose", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Yeah; the flavor of the month frameworks are dandy, and they make for blog posts that'll get clicks, but, for most folks learning six new frameworks a year isn't the reality of what employment actually looks like.\n\nThe industry certainly varies depending on what niche you want to get into, but, there's no shortage of  work out there that doesn't require learning multiple frameworks on a regular basis. It's helpful to keep an eye on things and stay current with basic HTML/CSS developments (responsive images, flex box, being a couple of recent-ish front-end examples) so you can keep up, but that's much less demanding than learning the nuances of each new precompiler, framework, CMS, task runner, version control platform, database, and so on.\n\nFor many companies, building and supporting systems built on different platforms with different tech just isn't sustainable; they'll generally settle on one or two stacks and stick with them for quite a while until something better comes along.\n\nAnd yes, browsers are a hassle, but they also keep the pace of what new things you need to keep up with well regulated - no need to deeply understand something if it's not widely supported.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah; the flavor of the month frameworks are dandy, and they make for blog posts that&amp;#39;ll get clicks, but, for most folks learning six new frameworks a year isn&amp;#39;t the reality of what employment actually looks like.&lt;/p&gt;\n\n&lt;p&gt;The industry certainly varies depending on what niche you want to get into, but, there&amp;#39;s no shortage of  work out there that doesn&amp;#39;t require learning multiple frameworks on a regular basis. It&amp;#39;s helpful to keep an eye on things and stay current with basic HTML/CSS developments (responsive images, flex box, being a couple of recent-ish front-end examples) so you can keep up, but that&amp;#39;s much less demanding than learning the nuances of each new precompiler, framework, CMS, task runner, version control platform, database, and so on.&lt;/p&gt;\n\n&lt;p&gt;For many companies, building and supporting systems built on different platforms with different tech just isn&amp;#39;t sustainable; they&amp;#39;ll generally settle on one or two stacks and stick with them for quite a while until something better comes along.&lt;/p&gt;\n\n&lt;p&gt;And yes, browsers are a hassle, but they also keep the pace of what new things you need to keep up with well regulated - no need to deeply understand something if it&amp;#39;s not widely supported.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd2six", "score_hidden": false, "stickied": false, "created": 1492430266.0, "created_utc": 1492401466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgd2w2m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lakelava", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "It looks like Internet Explorer diverged from Firefox on purpose trying to achieve monopoly, but that is history now. The standard is more respected, but it is hard to make different \"compilers\" to behave exactly the same. The web has a very old API so is natural to find abstractions on top of it. The same thing happened in Windows, only a few people uses win32 api to program for windows, now people use high level tools like .net.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like Internet Explorer diverged from Firefox on purpose trying to achieve monopoly, but that is history now. The standard is more respected, but it is hard to make different &amp;quot;compilers&amp;quot; to behave exactly the same. The web has a very old API so is natural to find abstractions on top of it. The same thing happened in Windows, only a few people uses win32 api to program for windows, now people use high level tools like .net.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd2w2m", "score_hidden": false, "stickied": false, "created": 1492430429.0, "created_utc": 1492401629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgdmioq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lauxman", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Why the hell are you trying to learn so many different frameworks? Stop worrying about padding the \"Skills\" block on your resume and just program. The only person to blame for being overwhelmed by the presence of a vast array of tools to create different solutions is yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why the hell are you trying to learn so many different frameworks? Stop worrying about padding the &amp;quot;Skills&amp;quot; block on your resume and just program. The only person to blame for being overwhelmed by the presence of a vast array of tools to create different solutions is yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdmioq", "score_hidden": false, "stickied": false, "created": 1492471840.0, "created_utc": 1492443040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dge02sa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Techie97", "parent_id": "t1_dgdz606", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "It has to do with EBT... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It has to do with EBT... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dge02sa", "score_hidden": false, "stickied": false, "created": 1492487069.0, "created_utc": 1492458269.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdz606", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ESarey9", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Family making you go to collegefor something you don't like? Dude. Get control of your life. You live it once and are a quarter of the way thru ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Family making you go to collegefor something you don&amp;#39;t like? Dude. Get control of your life. You live it once and are a quarter of the way thru &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdz606", "score_hidden": false, "stickied": false, "created": 1492486043.0, "created_utc": 1492457243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgdh0lr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thebrightmonkey", "parent_id": "t1_dgczfcl", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "&gt; Can I just say how BS it is that Google Chrome is the only browser that's actually READY for the next era in software development?\n\n*You sweet summer child...*\n\nI was building websites in the 90's, and you would probably be short of breath seeing how **bad** compatibility issues and standards were back then. It was an absolute mess, with competing standards, table layouting, hacky fixes and a thousand fallbacks for everything (especially IE support).\n\nToday is the golden age of web development. But it **is** complex, and I follow you in that it is exhausting to learn. My best advice is: Take breaks (maybe two weeks of holiday) - and in those breaks, cool down doing something entirely else, preferably non-digital. :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Can I just say how BS it is that Google Chrome is the only browser that&amp;#39;s actually READY for the next era in software development?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;You sweet summer child...&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I was building websites in the 90&amp;#39;s, and you would probably be short of breath seeing how &lt;strong&gt;bad&lt;/strong&gt; compatibility issues and standards were back then. It was an absolute mess, with competing standards, table layouting, hacky fixes and a thousand fallbacks for everything (especially IE support).&lt;/p&gt;\n\n&lt;p&gt;Today is the golden age of web development. But it &lt;strong&gt;is&lt;/strong&gt; complex, and I follow you in that it is exhausting to learn. My best advice is: Take breaks (maybe two weeks of holiday) - and in those breaks, cool down doing something entirely else, preferably non-digital. :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdh0lr", "score_hidden": false, "stickied": false, "created": 1492464411.0, "created_utc": 1492435611.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgdon33", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneandonlygene", "parent_id": "t1_dgd9lb3", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Full sympathy. the world's just not ready for ES7 yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Full sympathy. the world&amp;#39;s just not ready for ES7 yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdon33", "score_hidden": false, "stickied": false, "created": 1492474274.0, "created_utc": 1492445474.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9lb3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "philipwhiuk", "parent_id": "t1_dgd0knd", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I had to back out changes to use ES7 includes the other day because there was no decent shim for IE 11. That was frustrating :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to back out changes to use ES7 includes the other day because there was no decent shim for IE 11. That was frustrating :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd9lb3", "score_hidden": false, "stickied": false, "created": 1492444768.0, "created_utc": 1492415968.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0knd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theoneandonlygene", "parent_id": "t1_dgczfcl", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Yeah that part's irritating. You have to use something like babel to dumb your es6 down to something other browsers can use. But it's not like this situation is new. I'll never get the years back i spent rewriting everything to work in ie6, for instance. Fwiw it's gotten much easier now with the available tools than it used to be", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah that part&amp;#39;s irritating. You have to use something like babel to dumb your es6 down to something other browsers can use. But it&amp;#39;s not like this situation is new. I&amp;#39;ll never get the years back i spent rewriting everything to work in ie6, for instance. Fwiw it&amp;#39;s gotten much easier now with the available tools than it used to be&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgd0knd", "score_hidden": false, "stickied": false, "created": 1492426960.0, "created_utc": 1492398160.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qs0q", "removal_reason": null, "link_id": "t3_65shzh", "likes": null, "replies": "", "user_reports": [], "id": "dgdaqca", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ranbogmord", "parent_id": "t1_dgczfcl", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "I see your frustration, but the new syntactic sugar allows one to write more maintainable code easier. Having the tooling to do so helps a lot.\n\nAs for the education part, at the rate browser development is progressing right now, ES6 could be used without transpilers within a few years. It makes sense to educate people how to use it right now so they know how to use it when the browsers are ready.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see your frustration, but the new syntactic sugar allows one to write more maintainable code easier. Having the tooling to do so helps a lot.&lt;/p&gt;\n\n&lt;p&gt;As for the education part, at the rate browser development is progressing right now, ES6 could be used without transpilers within a few years. It makes sense to educate people how to use it right now so they know how to use it when the browsers are ready.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgdaqca", "score_hidden": false, "stickied": false, "created": 1492448644.0, "created_utc": 1492419844.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczfcl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Techie97", "parent_id": "t3_65shzh", "subreddit_name_prefixed": "r/webdev", "controversiality": 0, "body": "Can I also just clarify how much I hate web browser vendors?\n\nFrom the looks of it, you guys all probably agree that the web is the direction that software development is headed. The web will be equal to native thanks to platforms like Chrome OS.\n\nCan I just say how BS it is that Google Chrome is the only browser that's actually READY for the next era in software development?\n\nI know I mention browser issues in my main post, but seriously. I just let that sink in:\n\nPeople want to move the web forward and junk, yet, we're literally not ready for it. So why the rush? Why even bother teaching EcmaScript 6 if only one browser supports it? Like what the actual fuck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can I also just clarify how much I hate web browser vendors?&lt;/p&gt;\n\n&lt;p&gt;From the looks of it, you guys all probably agree that the web is the direction that software development is headed. The web will be equal to native thanks to platforms like Chrome OS.&lt;/p&gt;\n\n&lt;p&gt;Can I just say how BS it is that Google Chrome is the only browser that&amp;#39;s actually READY for the next era in software development?&lt;/p&gt;\n\n&lt;p&gt;I know I mention browser issues in my main post, but seriously. I just let that sink in:&lt;/p&gt;\n\n&lt;p&gt;People want to move the web forward and junk, yet, we&amp;#39;re literally not ready for it. So why the rush? Why even bother teaching EcmaScript 6 if only one browser supports it? Like what the actual fuck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "webdev", "name": "t1_dgczfcl", "score_hidden": false, "stickied": false, "created": 1492425360.0, "created_utc": 1492396560.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]