[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "patientgamers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I played this game after seeing the overwhelmingly positive reviews for it. So many people called it a masterpiece it made my head spin. It only made it that much harder to find out that the game not only isn&amp;#39;t a masterpiece, but isn&amp;#39;t that great of a game at all. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s by no means a bad game, I had a nice time with it. The aesthetics were gorgeous and the animations were awesome. The true sense of adventure is there as you traverse from area to area, soaking in the atmosphere. In fact, I think it&amp;#39;s focus on atmosphere was so good, that the rest of the game faltered.&lt;/p&gt;\n\n&lt;p&gt;I feel like this is a movie. Which is fine, I like narrative pieces, but the narrative isn&amp;#39;t very good. The story at face value seems to make sense, but when you start applying certain known facts that you gather from visual storytelling to the overall &amp;#39;writing&amp;#39; and theme, the cohesion starts to fall apart. There isn&amp;#39;t any real storytelling elements at play other than what&amp;#39;s happening in front of you. No dialogue, no text to read, just faceless characters acting out their roles. The hunters vs the hunted in an oppressed world where humans are artificially created to serve their creators. You play the renegade humanoid that&amp;#39;s going to stop that. Without spoiling it at least. There are philosophical elements and ideas that play into this, but not substantially enough to be able to make an impact.&lt;/p&gt;\n\n&lt;p&gt;Reviews say that it expanded upon what Limbo so brilliantly did though that isn&amp;#39;t true. Sure, visually and stylistically it&amp;#39;s superior, but the game has less gameplay elements than Limbo. Fewer puzzle types, easier puzzles, the reusing of puzzles; it&amp;#39;s only a three hour game, and I feel like some parts drag from the lack of variety. They introduce new mechanics, only to throw them out completely ten minutes later. Not to mention, one of the most interesting mechanics is introduced in the last 15 minutes of the game. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s nonstop triggered events with many, many moments designed to look as if you escaped from enemies by the skin of your teeth, when in actuality you just didn&amp;#39;t not hold right and jump at the edge of the cliff. &lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s more of a fun experience than a great game. Though, I&amp;#39;m very critical of it, I still very much enjoyed my experience. It was nice running through it, never really felt frustrated, though I didn&amp;#39;t really feel all that challenged. Just kind of a breeze.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d probably give it a 6/10.&lt;/p&gt;\n\n&lt;p&gt;Buy it if you&amp;#39;re interested, but I&amp;#39;d wait till it&amp;#39;s on sale. &lt;/p&gt;\n\n&lt;p&gt;Or sub to humble monthly. Cause it&amp;#39;s  &lt;a href=\"https://www.humblebundle.com/monthly\"&gt;12 dollars&lt;/a&gt; and paired with Dirt Rally. Which is a very good racing game. ;)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I played this game after seeing the overwhelmingly positive reviews for it. So many people called it a masterpiece it made my head spin. It only made it that much harder to find out that the game not only isn't a masterpiece, but isn't that great of a game at all. \n\nIt's by no means a bad game, I had a nice time with it. The aesthetics were gorgeous and the animations were awesome. The true sense of adventure is there as you traverse from area to area, soaking in the atmosphere. In fact, I think it's focus on atmosphere was so good, that the rest of the game faltered.\n\nI feel like this is a movie. Which is fine, I like narrative pieces, but the narrative isn't very good. The story at face value seems to make sense, but when you start applying certain known facts that you gather from visual storytelling to the overall 'writing' and theme, the cohesion starts to fall apart. There isn't any real storytelling elements at play other than what's happening in front of you. No dialogue, no text to read, just faceless characters acting out their roles. The hunters vs the hunted in an oppressed world where humans are artificially created to serve their creators. You play the renegade humanoid that's going to stop that. Without spoiling it at least. There are philosophical elements and ideas that play into this, but not substantially enough to be able to make an impact.\n\nReviews say that it expanded upon what Limbo so brilliantly did though that isn't true. Sure, visually and stylistically it's superior, but the game has less gameplay elements than Limbo. Fewer puzzle types, easier puzzles, the reusing of puzzles; it's only a three hour game, and I feel like some parts drag from the lack of variety. They introduce new mechanics, only to throw them out completely ten minutes later. Not to mention, one of the most interesting mechanics is introduced in the last 15 minutes of the game. \n\nIt's nonstop triggered events with many, many moments designed to look as if you escaped from enemies by the skin of your teeth, when in actuality you just didn't not hold right and jump at the edge of the cliff. \n\nI think it's more of a fun experience than a great game. Though, I'm very critical of it, I still very much enjoyed my experience. It was nice running through it, never really felt frustrated, though I didn't really feel all that challenged. Just kind of a breeze.\n\nI'd probably give it a 6/10.\n\nBuy it if you're interested, but I'd wait till it's on sale. \n\nOr sub to humble monthly. Cause it's  [12 dollars](https://www.humblebundle.com/monthly) and paired with Dirt Rally. Which is a very good racing game. ;)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64oxxt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "xAntimonyx", "saved": false, "mod_reports": [], "name": "t3_64oxxt", "subreddit_name_prefixed": "r/patientgamers", "approved_by": null, "over_18": false, "domain": "self.patientgamers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t3ad", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/patientgamers/comments/64oxxt/inside_2016_enjoyed_it_but_nowhere_near_lived_up/", "num_reports": null, "locked": false, "stickied": false, "created": 1491916795.0, "url": "https://www.reddit.com/r/patientgamers/comments/64oxxt/inside_2016_enjoyed_it_but_nowhere_near_lived_up/", "author_flair_text": null, "quarantine": false, "title": "Inside (2016): Enjoyed it, but nowhere near lived up to it's hype.", "created_utc": 1491887995.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": "", "user_reports": [], "id": "dg4hfex", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xAntimonyx", "parent_id": "t1_dg4g1h8", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Sorry, added ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, added &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg4hfex", "score_hidden": false, "stickied": false, "created": 1491956209.0, "created_utc": 1491927409.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4g1h8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Slow_Dog", "parent_id": "t1_dg4f8q4", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "You should spoiler that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should spoiler that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg4g1h8", "score_hidden": false, "stickied": false, "created": 1491954685.0, "created_utc": 1491925885.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4f8q4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "xAntimonyx", "parent_id": "t1_dg47i56", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "That was just a theory written by a journalist reviewing the game. [](#s \"The alternate ending was supposed to symbolize unplugging from the Cyber world; resisting the escape and control. I didn't say that was the story. I said that was the story that could be surmised from the ideas presented to you. If it had the ability to control the boy, why didn't it use that ability the whole time it was alive? Why did it wait until it was locked up and effectively put in stasis? Why are you human; so susceptible to dying and the thing you are trying to free near invincible? Why are you the only human, if you are a real human (which signs say you are), are you able to be controlled by this thing? Why are some people okay with the fact that you're killing people in the facility and help you escape while others are trying to trap you?  If dogs can smell fake humanoids, why not have dogs everywhere?\") I didn't just not understand what they were going for. I've read a long list of theories as to what the story was supposed to be. There is no officially released story and all theories are speculative. I think because there was no official story, they were able to do whatever they wanted with the individual pieces. I think it could have been that story, but with the game they made, it doesn't work completely. But that is a nice idea. \n\nSide note edit: this very well may be what they were going for. With some of the ideas presented it certainly pointed in that direction, but they can't just not explain a bunch of important plot devices and just leave it up to interpretation. Especially when these plot devices open up more questions as to how and why the things that are happening are possible. Even in this made up universe. Just because it's the theory that makes the most sense, that doesn't mean it makes complete sense. It's presentation is very convincing that it's a beautifully deep story and maybe it is. But they definitely didn't tell the story in their heads. It's frustrating, not to mention pretentious to think that I didn't enjoy it because I \"didn't understand it\". That I didn't get the key to unlock the epiphany that was the vague ending to the story. It wasn't an epiphany so much as \"oh that's what he's doing.. okay.\" It's like people are giving it the grandest of excuses to be vague because it's artsy, pixar-like presentation. You can tell a great story without dialogue or text. Look at the first 40 minutes of Wall-E. This was just people getting away with not actually explaining anything and leaving it up in the air. ", "edited": 1491928792.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was just a theory written by a journalist reviewing the game. &lt;a href=\"#s\" title=\"The alternate ending was supposed to symbolize unplugging from the Cyber world; resisting the escape and control. I didn&amp;#39;t say that was the story. I said that was the story that could be surmised from the ideas presented to you. If it had the ability to control the boy, why didn&amp;#39;t it use that ability the whole time it was alive? Why did it wait until it was locked up and effectively put in stasis? Why are you human; so susceptible to dying and the thing you are trying to free near invincible? Why are you the only human, if you are a real human (which signs say you are), are you able to be controlled by this thing? Why are some people okay with the fact that you&amp;#39;re killing people in the facility and help you escape while others are trying to trap you?  If dogs can smell fake humanoids, why not have dogs everywhere?\"&gt;&lt;/a&gt; I didn&amp;#39;t just not understand what they were going for. I&amp;#39;ve read a long list of theories as to what the story was supposed to be. There is no officially released story and all theories are speculative. I think because there was no official story, they were able to do whatever they wanted with the individual pieces. I think it could have been that story, but with the game they made, it doesn&amp;#39;t work completely. But that is a nice idea. &lt;/p&gt;\n\n&lt;p&gt;Side note edit: this very well may be what they were going for. With some of the ideas presented it certainly pointed in that direction, but they can&amp;#39;t just not explain a bunch of important plot devices and just leave it up to interpretation. Especially when these plot devices open up more questions as to how and why the things that are happening are possible. Even in this made up universe. Just because it&amp;#39;s the theory that makes the most sense, that doesn&amp;#39;t mean it makes complete sense. It&amp;#39;s presentation is very convincing that it&amp;#39;s a beautifully deep story and maybe it is. But they definitely didn&amp;#39;t tell the story in their heads. It&amp;#39;s frustrating, not to mention pretentious to think that I didn&amp;#39;t enjoy it because I &amp;quot;didn&amp;#39;t understand it&amp;quot;. That I didn&amp;#39;t get the key to unlock the epiphany that was the vague ending to the story. It wasn&amp;#39;t an epiphany so much as &amp;quot;oh that&amp;#39;s what he&amp;#39;s doing.. okay.&amp;quot; It&amp;#39;s like people are giving it the grandest of excuses to be vague because it&amp;#39;s artsy, pixar-like presentation. You can tell a great story without dialogue or text. Look at the first 40 minutes of Wall-E. This was just people getting away with not actually explaining anything and leaving it up in the air. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg4f8q4", "score_hidden": false, "stickied": false, "created": 1491953802.0, "created_utc": 1491925002.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47i56", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FixxxerTV", "parent_id": "t1_dg46ww8", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "[Spoilers](#s \"The creature at the end was in control of the boy, and used the boy to free himself. This was clear. This was the epiphany many people enjoyed.  If you just think it was a renegade boy then I guess you miss the entire premise that the creature was desperately looking for its own freedom.  What is not clear and open to interpretation: are you (the player) the monster? As in, did it go meta?  or alternatively maybe the monster is controlling the player to control the boy? Some people feel the alternate ending helps make sense of things, and most people I talk to had no idea there was an alternate ending.\")", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"#s\" title=\"The creature at the end was in control of the boy, and used the boy to free himself. This was clear. This was the epiphany many people enjoyed.  If you just think it was a renegade boy then I guess you miss the entire premise that the creature was desperately looking for its own freedom.  What is not clear and open to interpretation: are you (the player) the monster? As in, did it go meta?  or alternatively maybe the monster is controlling the player to control the boy? Some people feel the alternate ending helps make sense of things, and most people I talk to had no idea there was an alternate ending.\"&gt;Spoilers&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg47i56", "score_hidden": false, "stickied": false, "created": 1491944049.0, "created_utc": 1491915249.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg46ww8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jbick89", "parent_id": "t1_dg418ql", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "What did you think the story was? I haven't played it since it came out last summer, but from what I can remember, OP's interpretation makes about as much sense as anything else. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What did you think the story was? I haven&amp;#39;t played it since it came out last summer, but from what I can remember, OP&amp;#39;s interpretation makes about as much sense as anything else. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg46ww8", "score_hidden": false, "stickied": false, "created": 1491943108.0, "created_utc": 1491914308.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": "", "user_reports": [], "id": "dg48jsa", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "FixxxerTV", "parent_id": "t1_dg47unj", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "It's all about mystery isnt it?  Was the epiphany of finding the truth worthwhile to you?  \n\nPeople want a payoff to their mystery.  If you dont experience the epiphany then you dont get the payoff and are left with an inferior or disappointing experience.\n\nNothing i say here is black and white of course; there are always exceptions.  Some people who \"got it\" still didnt like it, absolutely.  But from what I've seen people who didnt experience the epiphany usually felt the game was mediocre or worse.  And vice versa.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s all about mystery isnt it?  Was the epiphany of finding the truth worthwhile to you?  &lt;/p&gt;\n\n&lt;p&gt;People want a payoff to their mystery.  If you dont experience the epiphany then you dont get the payoff and are left with an inferior or disappointing experience.&lt;/p&gt;\n\n&lt;p&gt;Nothing i say here is black and white of course; there are always exceptions.  Some people who &amp;quot;got it&amp;quot; still didnt like it, absolutely.  But from what I&amp;#39;ve seen people who didnt experience the epiphany usually felt the game was mediocre or worse.  And vice versa.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg48jsa", "score_hidden": false, "stickied": false, "created": 1491945648.0, "created_utc": 1491916848.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47unj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Slow_Dog", "parent_id": "t1_dg418ql", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "&gt;And understanding what was going on seems to be pretty key to enjoying it.\n\nHuh? At what point did *you* \"understand\" it? Did you enjoy it before you knew what was happening? As you can only possibly \"understand\" it at the end, and then again at the end, it's pretty clear you should be able to enjoy it without understanding it.\n\n\"renegade human\" is fine. I enjoyed the gamer while I was a renegade human, and enjoyed the game when I wasn't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And understanding what was going on seems to be pretty key to enjoying it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Huh? At what point did &lt;em&gt;you&lt;/em&gt; &amp;quot;understand&amp;quot; it? Did you enjoy it before you knew what was happening? As you can only possibly &amp;quot;understand&amp;quot; it at the end, and then again at the end, it&amp;#39;s pretty clear you should be able to enjoy it without understanding it.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;renegade human&amp;quot; is fine. I enjoyed the gamer while I was a renegade human, and enjoyed the game when I wasn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg47unj", "score_hidden": false, "stickied": false, "created": 1491944602.0, "created_utc": 1491915802.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg418ql", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "FixxxerTV", "parent_id": "t3_64oxxt", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Everyone entitled to their opinion. And I hate to be that guy that says you didnt understand it.  But i can say that this comment\n\n&gt; You play the renegade humanoid that's going to stop that. \n\nShows that you didn't understand what was happening with the story. He was no renegade humanoid at all.  And understanding what was going on seems to be pretty key to enjoying it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone entitled to their opinion. And I hate to be that guy that says you didnt understand it.  But i can say that this comment&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You play the renegade humanoid that&amp;#39;s going to stop that. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Shows that you didn&amp;#39;t understand what was happening with the story. He was no renegade humanoid at all.  And understanding what was going on seems to be pretty key to enjoying it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg418ql", "score_hidden": false, "stickied": false, "created": 1491928749.0, "created_utc": 1491899949.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": "", "user_reports": [], "id": "dg462fj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "notHiro", "parent_id": "t1_dg40znn", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "[slight spoilers](#s \"The part in the first third where you're running from the dogs in three or four consecutive sections is the most tense I've been playing a video game since maybe the original Dead Space. Especially the part where you have to maneuver over the fence and pull the boards off the opening. And I love dogs! The parts with the underwater \"thing\" were also incredibly tense, but I was godawful at those so its effectiveness was a bit diminished.\")", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"#s\" title=\"The part in the first third where you&amp;#39;re running from the dogs in three or four consecutive sections is the most tense I&amp;#39;ve been playing a video game since maybe the original Dead Space. Especially the part where you have to maneuver over the fence and pull the boards off the opening. And I love dogs! The parts with the underwater &amp;quot;thing&amp;quot; were also incredibly tense, but I was godawful at those so its effectiveness was a bit diminished.\"&gt;slight spoilers&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg462fj", "score_hidden": false, "stickied": false, "created": 1491941620.0, "created_utc": 1491912820.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg40znn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Slow_Dog", "parent_id": "t3_64oxxt", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "[Pretentiousness Warning]\n\nWhile playing Inside, I experienced: moments of joy, as I  chased chicks through a cornfield; of fear, as dogs pursued me or leaped past my torch; of ominous dread, as the shockwaves from thunderous explosions blasted the bridge I was crossing; of elation at gleeful revenge; and a final contemplative moment of peace.\n\nAnd more besides.\n\nI get that the \"it's not a game\" crowd won't like it. But there are few experiences that provide this emotional variety, and that's where it's brilliance lies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[Pretentiousness Warning]&lt;/p&gt;\n\n&lt;p&gt;While playing Inside, I experienced: moments of joy, as I  chased chicks through a cornfield; of fear, as dogs pursued me or leaped past my torch; of ominous dread, as the shockwaves from thunderous explosions blasted the bridge I was crossing; of elation at gleeful revenge; and a final contemplative moment of peace.&lt;/p&gt;\n\n&lt;p&gt;And more besides.&lt;/p&gt;\n\n&lt;p&gt;I get that the &amp;quot;it&amp;#39;s not a game&amp;quot; crowd won&amp;#39;t like it. But there are few experiences that provide this emotional variety, and that&amp;#39;s where it&amp;#39;s brilliance lies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg40znn", "score_hidden": false, "stickied": false, "created": 1491927974.0, "created_utc": 1491899174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": "", "user_reports": [], "id": "dg9m0lx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheJewbacca", "parent_id": "t1_dg43kxw", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "The levels get more sophisticated as the game progresses and add a lot more fun mechanics to play (the most fun being controlling gravity via button panels)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The levels get more sophisticated as the game progresses and add a lot more fun mechanics to play (the most fun being controlling gravity via button panels)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg9m0lx", "score_hidden": false, "stickied": false, "created": 1492226598.0, "created_utc": 1492197798.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43kxw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "devilsdontsleep", "parent_id": "t3_64oxxt", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I'm having this problem with Limbo. I often enjoy the shallower experiences games can offer. I can absolutely enjoy deeper games but I find it much easier knowing I don't have to pay much attention to what's going on outside of the gameplay. Limbo had such basic mechanics I couldn't enjoy it, played for maybe 40 minutes and never again after that. I try to avoid avoid reviews now but it's almost impossible to avoid at least some chatter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m having this problem with Limbo. I often enjoy the shallower experiences games can offer. I can absolutely enjoy deeper games but I find it much easier knowing I don&amp;#39;t have to pay much attention to what&amp;#39;s going on outside of the gameplay. Limbo had such basic mechanics I couldn&amp;#39;t enjoy it, played for maybe 40 minutes and never again after that. I try to avoid avoid reviews now but it&amp;#39;s almost impossible to avoid at least some chatter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg43kxw", "score_hidden": false, "stickied": false, "created": 1491935963.0, "created_utc": 1491907163.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": "", "user_reports": [], "id": "dg3xp29", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mechdra", "parent_id": "t3_64oxxt", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I'm inclined to agree massively with your review. \"Inside\" is an experience, less a game. Actually, it's less a game than Journey and ABZU. I am actually very impressed by the devs and also disappointed, as some elements of the game is brilliant, and others are, well, scripted. It's a great experience, but only for its atmosphere and different narration, NOT for the game elements :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m inclined to agree massively with your review. &amp;quot;Inside&amp;quot; is an experience, less a game. Actually, it&amp;#39;s less a game than Journey and ABZU. I am actually very impressed by the devs and also disappointed, as some elements of the game is brilliant, and others are, well, scripted. It&amp;#39;s a great experience, but only for its atmosphere and different narration, NOT for the game elements :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg3xp29", "score_hidden": false, "stickied": false, "created": 1491919239.0, "created_utc": 1491890439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": "", "user_reports": [], "id": "dg3zs6r", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "TreuloseTomate", "parent_id": "t3_64oxxt", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "It's one of the most boring and tedious platformers I've played, with lots of trial &amp; error sequences. I quit at the part where you have to climb over a fence back and forth multiple times to escape the hounds. It felt like the game was bullshitting me. Then I watched the ending out of curiosity and was glad I didn't spend more time with it.\n\n[Some guy on youtube seems to agree.](https://www.youtube.com/watch?v=P4UwMDb6Z_c)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s one of the most boring and tedious platformers I&amp;#39;ve played, with lots of trial &amp;amp; error sequences. I quit at the part where you have to climb over a fence back and forth multiple times to escape the hounds. It felt like the game was bullshitting me. Then I watched the ending out of curiosity and was glad I didn&amp;#39;t spend more time with it.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=P4UwMDb6Z_c\"&gt;Some guy on youtube seems to agree.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg3zs6r", "score_hidden": false, "stickied": false, "created": 1491924435.0, "created_utc": 1491895635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64oxxt", "likes": null, "replies": "", "user_reports": [], "id": "dg45oqo", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "camguide2", "parent_id": "t3_64oxxt", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Seeing as it's often compared to LIMBO, I'm not particularly interested in the title myself - after all, I found LIMBO to be boring and monotous with it's slow-paced trial &amp; error gameplay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seeing as it&amp;#39;s often compared to LIMBO, I&amp;#39;m not particularly interested in the title myself - after all, I found LIMBO to be boring and monotous with it&amp;#39;s slow-paced trial &amp;amp; error gameplay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg45oqo", "score_hidden": false, "stickied": false, "created": 1491940890.0, "created_utc": 1491912090.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]