[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "patientgamers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(title and a bit more stuff regarding patient gaming)&lt;/p&gt;\n\n&lt;p&gt;In other words, do you keep track of a game you play before the release and patiently wait before playing, or do you often look up and pick up games you&amp;#39;ve probably only heard of/not known much about that happens to be old?&lt;/p&gt;\n\n&lt;p&gt;For me, I&amp;#39;m a voluntary patient gamer. I keep track of gaming news and I know when games that I want to play are released.&lt;/p&gt;\n\n&lt;p&gt;My waiting time is usually a year a half; it seems most games have unanimous post release development cycle of 1.5 years, for some reason I don&amp;#39;t understand. For example I purchased Age of Decadence which took 12 years to develop, so you can understand why I couldn&amp;#39;t wait any longer, upon the release and its last patch was released last month, precisely 1 year 5.5 months after the initial released date. (and I&amp;#39;m beating myself for not waiting for it before playing)&lt;/p&gt;\n\n&lt;p&gt;I rarely discover a title that I wasn&amp;#39;t aware of and more than half a year old. What&amp;#39;s your case of patient gaming? If you are like me, how do you manage to wait? For me I know 1.5 years is what it takes for a game to be content complete, but it&amp;#39;s often incredibly difficult to wait because naturally I&amp;#39;m more interested in newer games than older ones, and especially because game price isn&amp;#39;t much concern to me.&lt;/p&gt;\n\n&lt;p&gt;Also I sometimes have doubts if waiting then playing a complete game is actually more fun than playing the basegame and DLCs as they get released, because playing GOTY edition could occasionally be overwhelming due to the time investment required. It doesn&amp;#39;t apply to telltale games but for games with large playtime such as The New Vegas I often get tired before playing through the base game and all DLCs although the game was excellent.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(title and a bit more stuff regarding patient gaming)\n\nIn other words, do you keep track of a game you play before the release and patiently wait before playing, or do you often look up and pick up games you've probably only heard of/not known much about that happens to be old?\n\nFor me, I'm a voluntary patient gamer. I keep track of gaming news and I know when games that I want to play are released.\n\nMy waiting time is usually a year a half; it seems most games have unanimous post release development cycle of 1.5 years, for some reason I don't understand. For example I purchased Age of Decadence which took 12 years to develop, so you can understand why I couldn't wait any longer, upon the release and its last patch was released last month, precisely 1 year 5.5 months after the initial released date. (and I'm beating myself for not waiting for it before playing)\n\nI rarely discover a title that I wasn't aware of and more than half a year old. What's your case of patient gaming? If you are like me, how do you manage to wait? For me I know 1.5 years is what it takes for a game to be content complete, but it's often incredibly difficult to wait because naturally I'm more interested in newer games than older ones, and especially because game price isn't much concern to me.\n\nAlso I sometimes have doubts if waiting then playing a complete game is actually more fun than playing the basegame and DLCs as they get released, because playing GOTY edition could occasionally be overwhelming due to the time investment required. It doesn't apply to telltale games but for games with large playtime such as The New Vegas I often get tired before playing through the base game and all DLCs although the game was excellent.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64udxp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "highsis", "saved": false, "mod_reports": [], "name": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "approved_by": null, "over_18": false, "domain": "self.patientgamers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t3ad", "edited": 1491989551.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/patientgamers/comments/64udxp/are_you_a_voluntary_or_involuntary_patient_gamer/", "num_reports": null, "locked": false, "stickied": false, "created": 1491980280.0, "url": "https://www.reddit.com/r/patientgamers/comments/64udxp/are_you_a_voluntary_or_involuntary_patient_gamer/", "author_flair_text": null, "quarantine": false, "title": "Are you a voluntary or involuntary patient gamer?", "created_utc": 1491951480.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5quke", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ProjektTHOR", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Voluntary, because gaming just isn't the hype-y hobby that it used to be. Sometimes I sit and look at my Steam library and then just turn my computer off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Voluntary, because gaming just isn&amp;#39;t the hype-y hobby that it used to be. Sometimes I sit and look at my Steam library and then just turn my computer off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5quke", "score_hidden": false, "stickied": false, "created": 1492025656.0, "created_utc": 1491996856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5lwir", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Sparrow991", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Voluntary. I got back into PC not long ago and I plan on only buying a new game once I finish what I'm currently playing. Working well so far:) there's usually something interesting on sale when I'm in that 'looking for' stage", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Voluntary. I got back into PC not long ago and I plan on only buying a new game once I finish what I&amp;#39;m currently playing. Working well so far:) there&amp;#39;s usually something interesting on sale when I&amp;#39;m in that &amp;#39;looking for&amp;#39; stage&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5lwir", "score_hidden": false, "stickied": false, "created": 1492011162.0, "created_utc": 1491982362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg59eij", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rarelypost", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I don't keep track of new releases at all and just pick up games when they're a few years old and in a bundle usually.  If there's a game on sale and I've heard some good things about it here and there, I'll take a look at it when it's around $5 or less, though with the Humble Monthly I find myself less likely to pick up any single game as they've been adding in some great titles for the $12 a month.\n\nIf I was hearing about a game constantly for 2+ years (pre-release and then after release) and reading about it, I would lose interest over time since playing the actual game is a lot more fun than hearing some random guy's opinions on everything about the game.  I don't like gaming news or streams or let's plays, or anything to do with gaming (besides playing them) as it ruins the feeling of discovery I get when I play a game.  All I'll do is look at the video on the Steam store page for a game or I'll watch a few minutes of gameplay to see if I'd like it.\n\nGaming news sites and streams and all those things aren't really great for a patient gamer unless you don't mind spoilers or seeing everything about the game before you play it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t keep track of new releases at all and just pick up games when they&amp;#39;re a few years old and in a bundle usually.  If there&amp;#39;s a game on sale and I&amp;#39;ve heard some good things about it here and there, I&amp;#39;ll take a look at it when it&amp;#39;s around $5 or less, though with the Humble Monthly I find myself less likely to pick up any single game as they&amp;#39;ve been adding in some great titles for the $12 a month.&lt;/p&gt;\n\n&lt;p&gt;If I was hearing about a game constantly for 2+ years (pre-release and then after release) and reading about it, I would lose interest over time since playing the actual game is a lot more fun than hearing some random guy&amp;#39;s opinions on everything about the game.  I don&amp;#39;t like gaming news or streams or let&amp;#39;s plays, or anything to do with gaming (besides playing them) as it ruins the feeling of discovery I get when I play a game.  All I&amp;#39;ll do is look at the video on the Steam store page for a game or I&amp;#39;ll watch a few minutes of gameplay to see if I&amp;#39;d like it.&lt;/p&gt;\n\n&lt;p&gt;Gaming news sites and streams and all those things aren&amp;#39;t really great for a patient gamer unless you don&amp;#39;t mind spoilers or seeing everything about the game before you play it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg59eij", "score_hidden": false, "stickied": false, "created": 1491989199.0, "created_utc": 1491960399.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5b0hm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Tribe_Called_K-West", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I'm involuntary? Unless a game is in a bundle or 95% off (pretty rare) then I just keep track of it on isthereanydeal.com and wait for the historical low price. I'll remember games names that were hyped up at the time (Rogue Legacy) but my buying methods means I won't see them in my Steam account until many moons have passed. The backlog is way overbooked to become invested in anything 1-2 years old.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m involuntary? Unless a game is in a bundle or 95% off (pretty rare) then I just keep track of it on isthereanydeal.com and wait for the historical low price. I&amp;#39;ll remember games names that were hyped up at the time (Rogue Legacy) but my buying methods means I won&amp;#39;t see them in my Steam account until many moons have passed. The backlog is way overbooked to become invested in anything 1-2 years old.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5b0hm", "score_hidden": false, "stickied": false, "created": 1491991314.0, "created_utc": 1491962514.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg6bl5h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "arijitlive", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Voluntary here. I used to be an impulsive Steam sale buyer. By 2014 December, I have amassed 250+ games in my backlog. I am not an achievement or trading card whore. I just want to enjoy gaming. Seeing these many games, I said to myself, \"enough is enough\".  \n  \nI stopped buying games post 2014 winter sale. I started clearing my backlog. I only bought if the price is really good and that game will not end up in my backlog. In last 2 years, my backlog is now 150 or so.  \n  \nI only buy *Football Manager* at launch, any other game has to wait till drop down to 50% in price even before it goes to my wait-list.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Voluntary here. I used to be an impulsive Steam sale buyer. By 2014 December, I have amassed 250+ games in my backlog. I am not an achievement or trading card whore. I just want to enjoy gaming. Seeing these many games, I said to myself, &amp;quot;enough is enough&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;I stopped buying games post 2014 winter sale. I started clearing my backlog. I only bought if the price is really good and that game will not end up in my backlog. In last 2 years, my backlog is now 150 or so.  &lt;/p&gt;\n\n&lt;p&gt;I only buy &lt;em&gt;Football Manager&lt;/em&gt; at launch, any other game has to wait till drop down to 50% in price even before it goes to my wait-list.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg6bl5h", "score_hidden": false, "stickied": false, "created": 1492050965.0, "created_utc": 1492022165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg786fc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frosty_byter", "parent_id": "t1_dg5neht", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "The backlog is a huge factor for a lot of people's buying choices, I guess. I would like to try Mass Effect: Andromeda and Ghost Recon Wildlands, but I can't justify picking them up when I'm busy playing Mafia 3, and have to finish up Witcher 3, and have 10 other games to start. By the time I finish everything, it'll be Black Friday. Yay, I guess? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The backlog is a huge factor for a lot of people&amp;#39;s buying choices, I guess. I would like to try Mass Effect: Andromeda and Ghost Recon Wildlands, but I can&amp;#39;t justify picking them up when I&amp;#39;m busy playing Mafia 3, and have to finish up Witcher 3, and have 10 other games to start. By the time I finish everything, it&amp;#39;ll be Black Friday. Yay, I guess? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg786fc", "score_hidden": false, "stickied": false, "created": 1492092225.0, "created_utc": 1492063425.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5neht", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bixer25", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Somewhere in between I suppose? \n\nI don't deliberately forbid myself to not buy a new game if I want. If it's something I'm interested in and it's been on my radar for months, I'll buy it early if I want to. \n\nIt just so happens that my gaming backlog is big and there are still so many games from the past few years that I want to buy that I naturally end up not buying 'new' games until they're already at least a year old. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Somewhere in between I suppose? &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t deliberately forbid myself to not buy a new game if I want. If it&amp;#39;s something I&amp;#39;m interested in and it&amp;#39;s been on my radar for months, I&amp;#39;ll buy it early if I want to. &lt;/p&gt;\n\n&lt;p&gt;It just so happens that my gaming backlog is big and there are still so many games from the past few years that I want to buy that I naturally end up not buying &amp;#39;new&amp;#39; games until they&amp;#39;re already at least a year old. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5neht", "score_hidden": false, "stickied": false, "created": 1492015668.0, "created_utc": 1491986868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5nt8q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Quetzal42", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Voluntary.  I can afford new games.  I choose not to buy them, for the most part (I will buy From Software action RPGs and Blizzard games new, typically preordered), but that's because I prefer to play complete, totally patched versions of games.  Also I'd rather save up my money and buy games cheap just because I'm kind of cheap that way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Voluntary.  I can afford new games.  I choose not to buy them, for the most part (I will buy From Software action RPGs and Blizzard games new, typically preordered), but that&amp;#39;s because I prefer to play complete, totally patched versions of games.  Also I&amp;#39;d rather save up my money and buy games cheap just because I&amp;#39;m kind of cheap that way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5nt8q", "score_hidden": false, "stickied": false, "created": 1492016992.0, "created_utc": 1491988192.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5pyvj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "devilsdontsleep", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Absolutely involuntary. I'll monitor maybe 3 or 4 games a year that catch my eye but I tend to just stick games in my Steam wishlist and as and when they go on sale I buy. There's just over 100 games at this point on this list, I buy maybe a couple a month, but add them at a similar rate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely involuntary. I&amp;#39;ll monitor maybe 3 or 4 games a year that catch my eye but I tend to just stick games in my Steam wishlist and as and when they go on sale I buy. There&amp;#39;s just over 100 games at this point on this list, I buy maybe a couple a month, but add them at a similar rate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5pyvj", "score_hidden": false, "stickied": false, "created": 1492023500.0, "created_utc": 1491994700.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5rjd3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kootsiak", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I was involuntarily a member for a long time, because I was gaming on laptops that never cost me more than $350 USD. \n\nNow that I built myself a gaming desktop, I am a patientgamer by choice. I can play every game upon release day but would rather wait until the developers iron out all the \"wrinkles\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was involuntarily a member for a long time, because I was gaming on laptops that never cost me more than $350 USD. &lt;/p&gt;\n\n&lt;p&gt;Now that I built myself a gaming desktop, I am a patientgamer by choice. I can play every game upon release day but would rather wait until the developers iron out all the &amp;quot;wrinkles&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5rjd3", "score_hidden": false, "stickied": false, "created": 1492027117.0, "created_utc": 1491998317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg7ps3k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PunchBeard", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I'm voluntary. But I also consider myself a \"Mostly Patient\" Gamer. Some games (almost always in a favorite series or by a favorite developer) I *do* buy at release. These are usually Elder Scrolls or Fallout titles and little more. I find it easier to wait on game purchases because my primary gaming platform is the PC. And like 99% of PC gamer's I have a catalog of games in the hundreds. So I have *plenty* pf gaming diversions to keep me busy while I patiently wait for a game to \"come of age\" where I'm comfortable making the purchase. My usual wait time is 6 months to a year. Unless the game has a deep discount during a sale.\n\nRecently I've had a hard time keeping up on new releases and previews of upcoming games. I used to get a subscription to Game Informer magazine which was a pretty decent publication that kept me up to date on the gaming scene. I also used to listen to the Game Front podcast. But since I made the switch to full time PC gaming I don't go to Game Stop anymore which means I don't buy very many used games which means I don't belong to the in store \"saver club\" that included a subscription to Game Informer. And the entire Game Front website and podcast had the plug pulled a few years ago. And now that I work for a company that blocks gaming related websites I find it harder to keep up with the scene like I used to. Now I just rely on reddit (which isn't blocked) or PC Gamer's website. And Steam, for all its faults, is pretty good about letting me know about new games I'd be interested in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m voluntary. But I also consider myself a &amp;quot;Mostly Patient&amp;quot; Gamer. Some games (almost always in a favorite series or by a favorite developer) I &lt;em&gt;do&lt;/em&gt; buy at release. These are usually Elder Scrolls or Fallout titles and little more. I find it easier to wait on game purchases because my primary gaming platform is the PC. And like 99% of PC gamer&amp;#39;s I have a catalog of games in the hundreds. So I have &lt;em&gt;plenty&lt;/em&gt; pf gaming diversions to keep me busy while I patiently wait for a game to &amp;quot;come of age&amp;quot; where I&amp;#39;m comfortable making the purchase. My usual wait time is 6 months to a year. Unless the game has a deep discount during a sale.&lt;/p&gt;\n\n&lt;p&gt;Recently I&amp;#39;ve had a hard time keeping up on new releases and previews of upcoming games. I used to get a subscription to Game Informer magazine which was a pretty decent publication that kept me up to date on the gaming scene. I also used to listen to the Game Front podcast. But since I made the switch to full time PC gaming I don&amp;#39;t go to Game Stop anymore which means I don&amp;#39;t buy very many used games which means I don&amp;#39;t belong to the in store &amp;quot;saver club&amp;quot; that included a subscription to Game Informer. And the entire Game Front website and podcast had the plug pulled a few years ago. And now that I work for a company that blocks gaming related websites I find it harder to keep up with the scene like I used to. Now I just rely on reddit (which isn&amp;#39;t blocked) or PC Gamer&amp;#39;s website. And Steam, for all its faults, is pretty good about letting me know about new games I&amp;#39;d be interested in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg7ps3k", "score_hidden": false, "stickied": false, "created": 1492126503.0, "created_utc": 1492097703.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5kdjf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wengerboys", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Voluntary, I impulse buy games all the time, brought Xbox one on launch then I hadn't touched it in years, the final straw was when I started to play Witcher 3 years after buying it on launch day and then realizing I had to DL 20gb update on my slow internet. \n\nSo far I haven't bought any new games in 6 months and probably won't until I clear my backlog which will take years, even then I might just stick with emulators and play classics all the time. Overall I think I am saving and investing thousands but also enjoying games more instead of the hype, I also find patient gamers to be more true gamers and enjoyable people. I only miss playing the FIFA series.\n\nI'm a patient everything these days, I keep a 6-month filter list so if I want to buy something I make sure I have to wait at least 6 months.", "edited": 1491978532.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Voluntary, I impulse buy games all the time, brought Xbox one on launch then I hadn&amp;#39;t touched it in years, the final straw was when I started to play Witcher 3 years after buying it on launch day and then realizing I had to DL 20gb update on my slow internet. &lt;/p&gt;\n\n&lt;p&gt;So far I haven&amp;#39;t bought any new games in 6 months and probably won&amp;#39;t until I clear my backlog which will take years, even then I might just stick with emulators and play classics all the time. Overall I think I am saving and investing thousands but also enjoying games more instead of the hype, I also find patient gamers to be more true gamers and enjoyable people. I only miss playing the FIFA series.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a patient everything these days, I keep a 6-month filter list so if I want to buy something I make sure I have to wait at least 6 months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5kdjf", "score_hidden": false, "stickied": false, "created": 1492007140.0, "created_utc": 1491978340.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5mo02", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mercurser", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I don't really have a fixed system, more like guidelines that I don't mind breaking if circumstances call for it. Generally I aim to buy as few games as possible while making sure that I always have something fun to play. That means I do my research and keep an eye on the games that *really* interest me and I wait for their price to drop at least 50% from release price, wether I wait longer depends on if I have something fun to play now and how much I want it and the state of the game. I conciously limit my own options because I don't want to spend any time wondering what to play or jumping between games too frequently, I found that too many options reduce the enjoyment I get from video games. Backlog is one or two games at most but I try to keep it at zero.\n\nI don't buy games because they are cheap. Of course money matters but time is even more valuable. I consider a game bought that I don't enjoy or don't play to be wasted money, a bad purchase. It doesn't matter how cheap it was. I would rather pay 30$ for one thing I will really enjoy than on 30 I don't care about. I've been approaching game purchases like this for several years and as a result I feel like I have played nothing but awesome games for a very long time. Gaming has never been so satisfying. ", "edited": 1491990345.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really have a fixed system, more like guidelines that I don&amp;#39;t mind breaking if circumstances call for it. Generally I aim to buy as few games as possible while making sure that I always have something fun to play. That means I do my research and keep an eye on the games that &lt;em&gt;really&lt;/em&gt; interest me and I wait for their price to drop at least 50% from release price, wether I wait longer depends on if I have something fun to play now and how much I want it and the state of the game. I conciously limit my own options because I don&amp;#39;t want to spend any time wondering what to play or jumping between games too frequently, I found that too many options reduce the enjoyment I get from video games. Backlog is one or two games at most but I try to keep it at zero.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t buy games because they are cheap. Of course money matters but time is even more valuable. I consider a game bought that I don&amp;#39;t enjoy or don&amp;#39;t play to be wasted money, a bad purchase. It doesn&amp;#39;t matter how cheap it was. I would rather pay 30$ for one thing I will really enjoy than on 30 I don&amp;#39;t care about. I&amp;#39;ve been approaching game purchases like this for several years and as a result I feel like I have played nothing but awesome games for a very long time. Gaming has never been so satisfying. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5mo02", "score_hidden": false, "stickied": false, "created": 1492013384.0, "created_utc": 1491984584.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5rubd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alex2800", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I often keep track of a game when I see the first trailer and keep it on a list. Sometimes I add older games over recommendations but it's quite rare.\n\nI waited 10 years to play FFXV or The Last Guardian so I really couldn't wait any longer but for games like Nier Automata or Uncharted 4, I don't buy them now because :\n\n1) I have a huge backlog\n\n2) I'll wait to find them for 30 bucks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I often keep track of a game when I see the first trailer and keep it on a list. Sometimes I add older games over recommendations but it&amp;#39;s quite rare.&lt;/p&gt;\n\n&lt;p&gt;I waited 10 years to play FFXV or The Last Guardian so I really couldn&amp;#39;t wait any longer but for games like Nier Automata or Uncharted 4, I don&amp;#39;t buy them now because :&lt;/p&gt;\n\n&lt;p&gt;1) I have a huge backlog&lt;/p&gt;\n\n&lt;p&gt;2) I&amp;#39;ll wait to find them for 30 bucks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5rubd", "score_hidden": false, "stickied": false, "created": 1492027733.0, "created_utc": 1491998933.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5rvmr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AmuseDeath", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I don't go by either of those.\n\nMy default right now is to not buy any games. I do this because I would be spending money on product that I do not currently need. It's like having 100 gallons of milk in my house, when my consumption rate is a gallon a week.\n\nI don't buy games because I already have hundreds of games. I am working on beating them all, so the issue is not having a game shortage. If I were to buy a new game, what would happen? It would just sit in my steam collection or in my room until I finally get to it, which is highly unlikely considering the many games I have.\n\nThe only logical reason for me to buy games is if there is some insane deal where a bundle is like 80% off or something. Otherwise, there is no point in buying a game now when I'm probably going to get to it years later. It'll have more fixes and perhaps a deluxe version later as well.\n\nSo this is why I don't get the spending habits of so many gamers. A new game is going to be released and so many immediately preorder it. The reality is that these guys have plenty of games at home to play already and many of those aren't even finished, it's so wasteful.\n\nIf more gamers were to try and complete their games and resist completionist temptation, they would have more money in the long run. But the ironic thing is that these impulse buyers are the ones that arguably support the industry the most with their immediate and expensive purchases.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t go by either of those.&lt;/p&gt;\n\n&lt;p&gt;My default right now is to not buy any games. I do this because I would be spending money on product that I do not currently need. It&amp;#39;s like having 100 gallons of milk in my house, when my consumption rate is a gallon a week.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t buy games because I already have hundreds of games. I am working on beating them all, so the issue is not having a game shortage. If I were to buy a new game, what would happen? It would just sit in my steam collection or in my room until I finally get to it, which is highly unlikely considering the many games I have.&lt;/p&gt;\n\n&lt;p&gt;The only logical reason for me to buy games is if there is some insane deal where a bundle is like 80% off or something. Otherwise, there is no point in buying a game now when I&amp;#39;m probably going to get to it years later. It&amp;#39;ll have more fixes and perhaps a deluxe version later as well.&lt;/p&gt;\n\n&lt;p&gt;So this is why I don&amp;#39;t get the spending habits of so many gamers. A new game is going to be released and so many immediately preorder it. The reality is that these guys have plenty of games at home to play already and many of those aren&amp;#39;t even finished, it&amp;#39;s so wasteful.&lt;/p&gt;\n\n&lt;p&gt;If more gamers were to try and complete their games and resist completionist temptation, they would have more money in the long run. But the ironic thing is that these impulse buyers are the ones that arguably support the industry the most with their immediate and expensive purchases.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5rvmr", "score_hidden": false, "stickied": false, "created": 1492027802.0, "created_utc": 1491999002.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5rxs5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1leggeddog", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Involuntary. Need time + money", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Involuntary. Need time + money&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5rxs5", "score_hidden": false, "stickied": false, "created": 1492027916.0, "created_utc": 1491999116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5sash", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cheeetooos", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I guess I'm voluntarily patient. I follow most new game info by listening to the GiantBomb podcast every week. If something comes highly recommended by these guys, and there is a PC release, then I throw it on my wishlist. I check out r/Gamedeals every few days for any really remarkable deals but ultimately I don't buy much. This is made very easy by the fact that 50%+ of my time gaming is in CSGO or some other competitive shooter or MOBA. I only have limited time to sink into single player titles, so I can pick the best ones and play them when they are fully patched and have dropped in price\n\nI actually just bought a launch title at full price for the first time since Overwatch. I picked up PUBATTLEGROUNDS when it came out on early access. I make an exception for multiplayer games like this simply because they are most fun when you are learning the game along with everyone else. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I&amp;#39;m voluntarily patient. I follow most new game info by listening to the GiantBomb podcast every week. If something comes highly recommended by these guys, and there is a PC release, then I throw it on my wishlist. I check out &lt;a href=\"/r/Gamedeals\"&gt;r/Gamedeals&lt;/a&gt; every few days for any really remarkable deals but ultimately I don&amp;#39;t buy much. This is made very easy by the fact that 50%+ of my time gaming is in CSGO or some other competitive shooter or MOBA. I only have limited time to sink into single player titles, so I can pick the best ones and play them when they are fully patched and have dropped in price&lt;/p&gt;\n\n&lt;p&gt;I actually just bought a launch title at full price for the first time since Overwatch. I picked up PUBATTLEGROUNDS when it came out on early access. I make an exception for multiplayer games like this simply because they are most fun when you are learning the game along with everyone else. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5sash", "score_hidden": false, "stickied": false, "created": 1492028594.0, "created_utc": 1491999794.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg5se8c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bob_Modova", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "A little of both. I keep track for a while waiting for anything like price drops or for a time when I have enough money, but other times I forget about the game until a year later. Then I notice it in a store and buy it.\n\nAlso I've noticed, as you said, an advantage to waiting is that you will know you will get 100% of the game. That's why I still haven't gotten FFXV yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A little of both. I keep track for a while waiting for anything like price drops or for a time when I have enough money, but other times I forget about the game until a year later. Then I notice it in a store and buy it.&lt;/p&gt;\n\n&lt;p&gt;Also I&amp;#39;ve noticed, as you said, an advantage to waiting is that you will know you will get 100% of the game. That&amp;#39;s why I still haven&amp;#39;t gotten FFXV yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg5se8c", "score_hidden": false, "stickied": false, "created": 1492028768.0, "created_utc": 1491999968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg60kzm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "good_one_dickhead", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Little from both columns:  \n\nBetween work and uni I have like 5-6 hours to play games a week. So a 20+ hour game can last me more than a month, and I never really swap between games half way through, I start a game, finish it, then start a new game. So by the time I finish a game, the next game I want to play might have been out for like a year or so. Sometimes I might splurge and get the hot new game (been eyeing off Horizon Zero Dawn right now and I have a gift voucher burning a hole in my pocket), but that's rare, since there's so many good games that are less than half the price of a new release.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Little from both columns:  &lt;/p&gt;\n\n&lt;p&gt;Between work and uni I have like 5-6 hours to play games a week. So a 20+ hour game can last me more than a month, and I never really swap between games half way through, I start a game, finish it, then start a new game. So by the time I finish a game, the next game I want to play might have been out for like a year or so. Sometimes I might splurge and get the hot new game (been eyeing off Horizon Zero Dawn right now and I have a gift voucher burning a hole in my pocket), but that&amp;#39;s rare, since there&amp;#39;s so many good games that are less than half the price of a new release.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg60kzm", "score_hidden": false, "stickied": false, "created": 1492039532.0, "created_utc": 1492010732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg871me", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Moogmaster", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Voluntary here. Maybe multiplayer games are worth jumping in in the beginning so everyone doesn't have 2 years on you. For me its pretty simple: I'd rather get 10 good old games on Steam for 60 bucks than one Xbox One game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Voluntary here. Maybe multiplayer games are worth jumping in in the beginning so everyone doesn&amp;#39;t have 2 years on you. For me its pretty simple: I&amp;#39;d rather get 10 good old games on Steam for 60 bucks than one Xbox One game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg871me", "score_hidden": false, "stickied": false, "created": 1492145080.0, "created_utc": 1492116280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_64udxp", "likes": null, "replies": "", "user_reports": [], "id": "dg8q3cc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chumbawumba99", "parent_id": "t3_64udxp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Half and half. I don't mind waiting for price drops (they seem to happen after only a couple of months), but whether or not I like it, grad student life + family has decided that I can only afford 1 hour on a good night. So I'll probably be playing witcher 3 for a year. Not complaining about that, though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Half and half. I don&amp;#39;t mind waiting for price drops (they seem to happen after only a couple of months), but whether or not I like it, grad student life + family has decided that I can only afford 1 hour on a good night. So I&amp;#39;ll probably be playing witcher 3 for a year. Not complaining about that, though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg8q3cc", "score_hidden": false, "stickied": false, "created": 1492170922.0, "created_utc": 1492142122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]