[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "patientgamers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Between me and my dorm mates next year I&amp;#39;ll have both systems at the ready a mere eleven years after they were released. Deadly Premonition is a game I&amp;#39;d love to get and play obsessively but I&amp;#39;m not sure which version would be less spine-shatteringly buggy. Any tips? Also, any recommendations for good local multiplayer for either system would be much appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Between me and my dorm mates next year I'll have both systems at the ready a mere eleven years after they were released. Deadly Premonition is a game I'd love to get and play obsessively but I'm not sure which version would be less spine-shatteringly buggy. Any tips? Also, any recommendations for good local multiplayer for either system would be much appreciated.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65epsf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "ChewiestBroom", "saved": false, "mod_reports": [], "name": "t3_65epsf", "subreddit_name_prefixed": "r/patientgamers", "approved_by": null, "over_18": false, "domain": "self.patientgamers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t3ad", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/patientgamers/comments/65epsf/deadly_premonition_ps3_or_xbox_360/", "num_reports": null, "locked": false, "stickied": false, "created": 1492227603.0, "url": "https://www.reddit.com/r/patientgamers/comments/65epsf/deadly_premonition_ps3_or_xbox_360/", "author_flair_text": null, "quarantine": false, "title": "Deadly Premonition: PS3 or Xbox 360?", "created_utc": 1492198803.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65epsf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65epsf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65epsf", "likes": null, "replies": "", "user_reports": [], "id": "dga1onn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "X-pert74", "parent_id": "t1_dg9u9o1", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Haha, I might be kind of a big Deadly Premonition fan. I've beaten the game several times at this point, so I know the ins and outs of its design/story pretty well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, I might be kind of a big Deadly Premonition fan. I&amp;#39;ve beaten the game several times at this point, so I know the ins and outs of its design/story pretty well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga1onn", "score_hidden": false, "stickied": false, "created": 1492246696.0, "created_utc": 1492217896.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9u9o1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "yepyoubet", "parent_id": "t1_dg9p7pd", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "This is a far more in-depth answer to the question than I had anticipated when clicking on the thread. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a far more in-depth answer to the question than I had anticipated when clicking on the thread. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg9u9o1", "score_hidden": false, "stickied": false, "created": 1492236812.0, "created_utc": 1492208012.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65epsf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65epsf", "likes": null, "replies": "", "user_reports": [], "id": "dga8k8o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "X-pert74", "parent_id": "t1_dga76sj", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Durante (of Dark Souls fame) did release a DPfix for Deadly Premonition. The most recent version (and the one I used when I played the Steam version, if I recall correctly), is [0.9.5](http://blog.metaclassofnil.com/?p=438). It fixed a couple things like the fact that the Steam version defaults to 720p resolution, but the game was still really unstable for me even with DPfix. I've heard of people coming up with the oddest workarounds for it, like playing the game in Windows 98 compatibility mode, or running it as administrator, or restarting their computer before trying again, etc., but none of them worked for me. There was a persistent issue the entire time where after a certain period of time (usually an hour of gameplay; sometimes a little more if I'm lucky, or less if I'm unlucky), the game gets a run-time error and it crashes, causing me to lose all my progress made since my last save. It is the most horrifically unstable PC port I've ever played. Absolute fucking garbage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Durante (of Dark Souls fame) did release a DPfix for Deadly Premonition. The most recent version (and the one I used when I played the Steam version, if I recall correctly), is &lt;a href=\"http://blog.metaclassofnil.com/?p=438\"&gt;0.9.5&lt;/a&gt;. It fixed a couple things like the fact that the Steam version defaults to 720p resolution, but the game was still really unstable for me even with DPfix. I&amp;#39;ve heard of people coming up with the oddest workarounds for it, like playing the game in Windows 98 compatibility mode, or running it as administrator, or restarting their computer before trying again, etc., but none of them worked for me. There was a persistent issue the entire time where after a certain period of time (usually an hour of gameplay; sometimes a little more if I&amp;#39;m lucky, or less if I&amp;#39;m unlucky), the game gets a run-time error and it crashes, causing me to lose all my progress made since my last save. It is the most horrifically unstable PC port I&amp;#39;ve ever played. Absolute fucking garbage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga8k8o", "score_hidden": false, "stickied": false, "created": 1492256658.0, "created_utc": 1492227858.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga76sj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MiniMinute", "parent_id": "t1_dg9p7pd", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Ah dang, that's really disappointing to learn. I don't have an Xbox, so my only options for playing the game are to buy it on the PS3 or on Steam. It's a shame to learn that they're inferior ports though... are there any mods or anything like that that revert the Director's Cut version to its original form... Or that make the port better in general since you mentioned that it's a horrible port? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah dang, that&amp;#39;s really disappointing to learn. I don&amp;#39;t have an Xbox, so my only options for playing the game are to buy it on the PS3 or on Steam. It&amp;#39;s a shame to learn that they&amp;#39;re inferior ports though... are there any mods or anything like that that revert the Director&amp;#39;s Cut version to its original form... Or that make the port better in general since you mentioned that it&amp;#39;s a horrible port? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga76sj", "score_hidden": false, "stickied": false, "created": 1492254485.0, "created_utc": 1492225685.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9p7pd", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "X-pert74", "parent_id": "t3_65epsf", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I haven't played the PS3 version, but I have played the Steam version (which is based on the PS3 version, so it has the \"Director's Cut\" changes/additions), as well as the 360 version. The Steam version is a horrible port, but that's not really relevant to your question. What is relevant though, is that the Steam/PS3 \"Director's Cut\" add and change certain things, that I personally think detract from the experience. Most notably, the camera/movement is different in the Director's Cut. In the original game you had Resident Evil 4-esque tank controls, but clunkier and stiffer. I personally think the game works fine this way, however (and to its credit, you can at least strafe a little by using the shoulder bumpers). In every version of the game, you can't move while aiming a gun, just like in Resident Evil, though you can move while using a melee weapon. No matter what you do, combat will be clunky, but I think it works better on the 360, at least. Also, the Director's Cut swaps aiming to the right stick, which personally feels bizarre to me, considering you still cannot move and aim either way. The 360 version has aiming controlled by the left stick, just like in Resident Evil 4.\n\nAnother annoyance regarding the Director's Cut's camera, is that the camera does not move during certain special situations. These aren't too significant overall, but there are a couple points where the game suddenly shifts to a fixed-camera perspective, perhaps as a throwback of sorts to classic Resident Evil games. In the Director's Cut, this aspect is removed, and the entire game is controlled from the same perspective. However... this does completely ruin the fun of one particular set of side quests in particular. There are a bunch of side quests you obtain by talking to people throughout the town, and one set in particular involved talking to the lady who co-owns the Milk Barn. She'll ask you to move around boxes in the storage room, and in the original version, the camera shifts to an overhead perspective, like a classic puzzle game of sorts. This works just fine. However, in the Director's Cut, you **still** have the standard third-person camera, which means you never have the entire puzzle viewable at any given time. This makes what was a cute diversion in the original game, a truly frustrating experience.\n\nAlso, the Director's Cut adds some new cutscenes at the beginning/end of each major episode of the game, involving a young girl and an older man. Having played the original game, I personally found these cutscenes to be out of place, and feel that they hamper the game's overall pacing. I think it's best experienced without these cutscenes at all, as they really don't add a whole lot to the game. Maybe they might be worth viewing out of curiosity on Youtube, after having played through it, but I don't recommend playing the game with said cutscenes interspersed within the original story.\n\nOne more thing - the Director's Cut removed the greenish tint that the original game's graphics had, and the game appears \"redder\" overall. This isn't a huge deal either way, but it's worth noting that the game's visual appearance is slightly different in the Director's Cut.\n\nBeyond all of that... Deadly Premonition is not the easiest game to get into. Even if you play the 360 version (which is the best, in my experience), it'll be pretty frustrating. So, I have some non-spoilerish advice to offer you -\n\n- If you play the game on 360, there's no shame in playing on Easy. All the harder difficulties do is that they make enemies more bullet-spongey. That's literally it. If you play on PS3/another platform, the difficulty setting was removed, so the game is always set to Easy.\n\n- Do the side quests. They're very highly recommended, both because they help flesh out the town of Greenvale and its inhabitants, but also because certain sidequests will give you seriously helpful items, including upgrades to your default police car (which change it from a pretty annoying vehicle, to a pretty capable one), a fast-travel walkie talkie, upgrades to your inventory size, and even infinite-ammo guns, amongst other nifty stuff.\n\n- In particular, there's one set of side quests that I highly recommend doing. (I'll be detailing a couple general details, but I'll leave out as much info as possible. I'll still spoiler-tag this however, just in case you might not want to know this). [](#s \"There are some bones that are scattered across the entire map. Be sure to get all of the bones, and turn them in to the person who wants them. When you do that, you'll gain access to an area, which gives you a certain weapon that makes combat against a specific type of enemy later in the game much more manageable.\")\n\n- But, **before** the above step of [](#s \"turning any of the bones in, speak to a person who has a dog, and let the dog take your bones. This will sometimes happen without your intention, but that's okay. You can then go to the dog house and retrieve your bones, along with a special item (which changes depending on exactly how many bones the dog took out of your inventory). This particular questline can be repeated as many times as you want, **prior** to turning the bones in to their original owner. I highly recommend keeping all of the bones in your inventory as you collect them, so that once you have the complete set, you can let the dog steal them, and then get another neat weapon.\") This weapon can't be obtained any other way, and you lose access to it once you turn the [](#s \"bones\") in to the original owner, so that's why I'm telling you about it now.\n\n- You can always reload older chapters at any time, within your current playthrough. You keep your current inventory and upgrades when going back to them, although you can't redo side quests that have already been completed by you during your current playthrough. This is helpful, as certain side quests can only be completed during certain chapters, so if you miss your chance to do a side quest, you can go back to a chapter in which it is available, and do it then. **HOWEVER**, there's one particular time later in the game where I do not recommend doing this. In Episode 5, Chapter 23, you pick up a certain key, which is identical to a key you pick up early on in the game. Since the game keeps track of your inventory when replaying earlier chapters, it is imperative that you **do not go back to replay Episode 1, Chapter 2** while the key from Episode 5, Chapter 23 is in your possession. Doing so will cause the game to use up the key you got in Chapter 23, **and you will lose it permanently**. I lost the key this way during my first playthrough, and ended up having to restart the entire game over again from scratch, which was really upsetting.\n\n- With a couple exceptions, you can **always** miss the deadline for a certain timed event in the story, and it will simply loop over to the next day. The story does change slightly when you do this (your friends who want you present at said time will remark on your lateness), but generally the story is unchanged. So, for chapters in which you're able to free-roam around the city, despite what the timer at the bottom-right might indicate, you generally are able to freely mess around to your liking, and spend as much time as you like finishing up side quests. You can also reload the chapter later on, if you are curious enough to see how it works when played normally. Or play it normally the first time, and reload the chapter later so you can mess around in it then. Whichever one you prefer.\n\nAt any rate, Deadly Premonition is a pretty screwy, buggy game, no matter how you play it. I love Deadly Premonition and consider it one of my favorite games ever, and I will totally admit that it is flawed, even while simultaneously being charming and throught-provoking. However, my hope is that with the above advice, that your experience will be relatively painless, and that you will be able to better enjoy the game thanks to these tips. Either way, regardless of which version of the game you go with, enjoy!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t played the PS3 version, but I have played the Steam version (which is based on the PS3 version, so it has the &amp;quot;Director&amp;#39;s Cut&amp;quot; changes/additions), as well as the 360 version. The Steam version is a horrible port, but that&amp;#39;s not really relevant to your question. What is relevant though, is that the Steam/PS3 &amp;quot;Director&amp;#39;s Cut&amp;quot; add and change certain things, that I personally think detract from the experience. Most notably, the camera/movement is different in the Director&amp;#39;s Cut. In the original game you had Resident Evil 4-esque tank controls, but clunkier and stiffer. I personally think the game works fine this way, however (and to its credit, you can at least strafe a little by using the shoulder bumpers). In every version of the game, you can&amp;#39;t move while aiming a gun, just like in Resident Evil, though you can move while using a melee weapon. No matter what you do, combat will be clunky, but I think it works better on the 360, at least. Also, the Director&amp;#39;s Cut swaps aiming to the right stick, which personally feels bizarre to me, considering you still cannot move and aim either way. The 360 version has aiming controlled by the left stick, just like in Resident Evil 4.&lt;/p&gt;\n\n&lt;p&gt;Another annoyance regarding the Director&amp;#39;s Cut&amp;#39;s camera, is that the camera does not move during certain special situations. These aren&amp;#39;t too significant overall, but there are a couple points where the game suddenly shifts to a fixed-camera perspective, perhaps as a throwback of sorts to classic Resident Evil games. In the Director&amp;#39;s Cut, this aspect is removed, and the entire game is controlled from the same perspective. However... this does completely ruin the fun of one particular set of side quests in particular. There are a bunch of side quests you obtain by talking to people throughout the town, and one set in particular involved talking to the lady who co-owns the Milk Barn. She&amp;#39;ll ask you to move around boxes in the storage room, and in the original version, the camera shifts to an overhead perspective, like a classic puzzle game of sorts. This works just fine. However, in the Director&amp;#39;s Cut, you &lt;strong&gt;still&lt;/strong&gt; have the standard third-person camera, which means you never have the entire puzzle viewable at any given time. This makes what was a cute diversion in the original game, a truly frustrating experience.&lt;/p&gt;\n\n&lt;p&gt;Also, the Director&amp;#39;s Cut adds some new cutscenes at the beginning/end of each major episode of the game, involving a young girl and an older man. Having played the original game, I personally found these cutscenes to be out of place, and feel that they hamper the game&amp;#39;s overall pacing. I think it&amp;#39;s best experienced without these cutscenes at all, as they really don&amp;#39;t add a whole lot to the game. Maybe they might be worth viewing out of curiosity on Youtube, after having played through it, but I don&amp;#39;t recommend playing the game with said cutscenes interspersed within the original story.&lt;/p&gt;\n\n&lt;p&gt;One more thing - the Director&amp;#39;s Cut removed the greenish tint that the original game&amp;#39;s graphics had, and the game appears &amp;quot;redder&amp;quot; overall. This isn&amp;#39;t a huge deal either way, but it&amp;#39;s worth noting that the game&amp;#39;s visual appearance is slightly different in the Director&amp;#39;s Cut.&lt;/p&gt;\n\n&lt;p&gt;Beyond all of that... Deadly Premonition is not the easiest game to get into. Even if you play the 360 version (which is the best, in my experience), it&amp;#39;ll be pretty frustrating. So, I have some non-spoilerish advice to offer you -&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;If you play the game on 360, there&amp;#39;s no shame in playing on Easy. All the harder difficulties do is that they make enemies more bullet-spongey. That&amp;#39;s literally it. If you play on PS3/another platform, the difficulty setting was removed, so the game is always set to Easy.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Do the side quests. They&amp;#39;re very highly recommended, both because they help flesh out the town of Greenvale and its inhabitants, but also because certain sidequests will give you seriously helpful items, including upgrades to your default police car (which change it from a pretty annoying vehicle, to a pretty capable one), a fast-travel walkie talkie, upgrades to your inventory size, and even infinite-ammo guns, amongst other nifty stuff.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In particular, there&amp;#39;s one set of side quests that I highly recommend doing. (I&amp;#39;ll be detailing a couple general details, but I&amp;#39;ll leave out as much info as possible. I&amp;#39;ll still spoiler-tag this however, just in case you might not want to know this). &lt;a href=\"#s\" title=\"There are some bones that are scattered across the entire map. Be sure to get all of the bones, and turn them in to the person who wants them. When you do that, you&amp;#39;ll gain access to an area, which gives you a certain weapon that makes combat against a specific type of enemy later in the game much more manageable.\"&gt;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;But, &lt;strong&gt;before&lt;/strong&gt; the above step of &lt;a href=\"#s\" title=\"turning any of the bones in, speak to a person who has a dog, and let the dog take your bones. This will sometimes happen without your intention, but that&amp;#39;s okay. You can then go to the dog house and retrieve your bones, along with a special item (which changes depending on exactly how many bones the dog took out of your inventory). This particular questline can be repeated as many times as you want, **prior** to turning the bones in to their original owner. I highly recommend keeping all of the bones in your inventory as you collect them, so that once you have the complete set, you can let the dog steal them, and then get another neat weapon.\"&gt;&lt;/a&gt; This weapon can&amp;#39;t be obtained any other way, and you lose access to it once you turn the &lt;a href=\"#s\" title=\"bones\"&gt;&lt;/a&gt; in to the original owner, so that&amp;#39;s why I&amp;#39;m telling you about it now.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You can always reload older chapters at any time, within your current playthrough. You keep your current inventory and upgrades when going back to them, although you can&amp;#39;t redo side quests that have already been completed by you during your current playthrough. This is helpful, as certain side quests can only be completed during certain chapters, so if you miss your chance to do a side quest, you can go back to a chapter in which it is available, and do it then. &lt;strong&gt;HOWEVER&lt;/strong&gt;, there&amp;#39;s one particular time later in the game where I do not recommend doing this. In Episode 5, Chapter 23, you pick up a certain key, which is identical to a key you pick up early on in the game. Since the game keeps track of your inventory when replaying earlier chapters, it is imperative that you &lt;strong&gt;do not go back to replay Episode 1, Chapter 2&lt;/strong&gt; while the key from Episode 5, Chapter 23 is in your possession. Doing so will cause the game to use up the key you got in Chapter 23, &lt;strong&gt;and you will lose it permanently&lt;/strong&gt;. I lost the key this way during my first playthrough, and ended up having to restart the entire game over again from scratch, which was really upsetting.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;With a couple exceptions, you can &lt;strong&gt;always&lt;/strong&gt; miss the deadline for a certain timed event in the story, and it will simply loop over to the next day. The story does change slightly when you do this (your friends who want you present at said time will remark on your lateness), but generally the story is unchanged. So, for chapters in which you&amp;#39;re able to free-roam around the city, despite what the timer at the bottom-right might indicate, you generally are able to freely mess around to your liking, and spend as much time as you like finishing up side quests. You can also reload the chapter later on, if you are curious enough to see how it works when played normally. Or play it normally the first time, and reload the chapter later so you can mess around in it then. Whichever one you prefer.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;At any rate, Deadly Premonition is a pretty screwy, buggy game, no matter how you play it. I love Deadly Premonition and consider it one of my favorite games ever, and I will totally admit that it is flawed, even while simultaneously being charming and throught-provoking. However, my hope is that with the above advice, that your experience will be relatively painless, and that you will be able to better enjoy the game thanks to these tips. Either way, regardless of which version of the game you go with, enjoy!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg9p7pd", "score_hidden": false, "stickied": false, "created": 1492230438.0, "created_utc": 1492201638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65epsf", "likes": null, "replies": "", "user_reports": [], "id": "dg9vgne", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rarelypost", "parent_id": "t3_65epsf", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I played it on the 360 and it was a lot of fun and I didn't notice any real issues with it.  I haven't heard of how it is on the PS3 but I have heard the Steam version wasn't a very good port.  \n\nI'd just get the 360 version, and as for good local multiplayer on the 360, you could get the Gears of War series, Earth Defense Force 2017, Resident Evil 5 and 6, Rayman Legends, Castle Crashers, BattleBlock Theater, and Portal 2.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I played it on the 360 and it was a lot of fun and I didn&amp;#39;t notice any real issues with it.  I haven&amp;#39;t heard of how it is on the PS3 but I have heard the Steam version wasn&amp;#39;t a very good port.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d just get the 360 version, and as for good local multiplayer on the 360, you could get the Gears of War series, Earth Defense Force 2017, Resident Evil 5 and 6, Rayman Legends, Castle Crashers, BattleBlock Theater, and Portal 2.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dg9vgne", "score_hidden": false, "stickied": false, "created": 1492238411.0, "created_utc": 1492209611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65epsf", "likes": null, "replies": "", "user_reports": [], "id": "dgacaw2", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "BabyRager", "parent_id": "t3_65epsf", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "it doesnt matter as long youre not play pc port which is unstable hunk of shit thats even hard to launch without giving you some sort of error.\n\ni played x360 version from start to end doing almost exclusively only plot related stuff, no gamebreaking bugs(if there were any at all) encountered.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it doesnt matter as long youre not play pc port which is unstable hunk of shit thats even hard to launch without giving you some sort of error.&lt;/p&gt;\n\n&lt;p&gt;i played x360 version from start to end doing almost exclusively only plot related stuff, no gamebreaking bugs(if there were any at all) encountered.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgacaw2", "score_hidden": false, "stickied": false, "created": 1492263303.0, "created_utc": 1492234503.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]