[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "patientgamers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Now obviously you&amp;#39;re likely to find non-mainstream gamers on this specific sub. Ones who don&amp;#39;t just play new AAA games and whatever else that generalization entails. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve come to realize, though, that even if you already have some unpopular opinions about games, you may still tend to fall into some traps. For instance, I feel like I&amp;#39;ve sometimes only played a game because of its critical acclaim and I thought that I&amp;#39;d else miss out on something. It&amp;#39;s also easy to feel as though you&amp;#39;re too casual or not really valuing a certain aspect of a game enough. Lastly, there&amp;#39;s obviously the sunk-cost fallacy and games backlog that many people post about on here.&lt;/p&gt;\n\n&lt;p&gt;Personally, I&amp;#39;ve realized a few things - that I personally think are important for me personally (!) - that have made choosing games easier for me:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;graphics are somehow important (or rather: art-style and design)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;if I want an engaging story, I&amp;#39;ll read a book, but games are mostly about game-play (I do like the writing in Witcher 3 and Life is Strange while disliking the gameplay, so there&amp;#39;s some notable exceptions)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;playing a game on easy-mode is often more fun than on hard difficulty - and it will save you time and nerves &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I think the reason I posted this is that I&amp;#39;ve been quite underwhelmed with a lot of generally appraised games. I was playing the Witcher 3 when I thought to myself: apart from some funny dialogue and the scenery, this is mediocre overall. Thinking about it, I&amp;#39;d rate Slime Rancher far higher than TW3. Actually, Slime Rancher might just be one of my favorite games of all time (in this case I don&amp;#39;t regret buying an EA at all).&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard to proclaim that you wouldn&amp;#39;t recommend TW3, Dragen Age, Undertale, the Fallout series and many other fan favorites, while Slime Rancher, CoD, SR4, Orcs Must Die, Minecraft, Cities: Skylines, Borderlands are somewhere on your top list. Or that you think DS1 with its infuriating bonfire placement is inferior to DS3 in almost every way, Sacred is better than Diablo 2, and the most entertaining AoE game is the third entry. &lt;/p&gt;\n\n&lt;p&gt;But realizing that maybe all you want is a cutesy game or an action experience that doesn&amp;#39;t have to be &amp;quot;objectively&amp;quot; solid (looking particularly at CoD, which is a blast even though I agree with all the hate it receives) has improved my game collection.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;This post has gotten a little out of hand. I&amp;#39;m only now realizing that I&amp;#39;ve kind of touched upon a lot of opinions that are stated in the occasional &amp;quot;unpopular opinions&amp;quot; posts, and I&amp;#39;ve addressed quite a few individual games. I myself do enjoy reading y&amp;#39;all&amp;#39;s opinions, and even rants, on here, though. :D&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Now obviously you're likely to find non-mainstream gamers on this specific sub. Ones who don't just play new AAA games and whatever else that generalization entails. \n\nI've come to realize, though, that even if you already have some unpopular opinions about games, you may still tend to fall into some traps. For instance, I feel like I've sometimes only played a game because of its critical acclaim and I thought that I'd else miss out on something. It's also easy to feel as though you're too casual or not really valuing a certain aspect of a game enough. Lastly, there's obviously the sunk-cost fallacy and games backlog that many people post about on here.\n\nPersonally, I've realized a few things - that I personally think are important for me personally (!) - that have made choosing games easier for me:\n\n- graphics are somehow important (or rather: art-style and design)\n\n- if I want an engaging story, I'll read a book, but games are mostly about game-play (I do like the writing in Witcher 3 and Life is Strange while disliking the gameplay, so there's some notable exceptions)\n\n- playing a game on easy-mode is often more fun than on hard difficulty - and it will save you time and nerves \n\n---\n\nI think the reason I posted this is that I've been quite underwhelmed with a lot of generally appraised games. I was playing the Witcher 3 when I thought to myself: apart from some funny dialogue and the scenery, this is mediocre overall. Thinking about it, I'd rate Slime Rancher far higher than TW3. Actually, Slime Rancher might just be one of my favorite games of all time (in this case I don't regret buying an EA at all).\n\nIt's hard to proclaim that you wouldn't recommend TW3, Dragen Age, Undertale, the Fallout series and many other fan favorites, while Slime Rancher, CoD, SR4, Orcs Must Die, Minecraft, Cities: Skylines, Borderlands are somewhere on your top list. Or that you think DS1 with its infuriating bonfire placement is inferior to DS3 in almost every way, Sacred is better than Diablo 2, and the most entertaining AoE game is the third entry. \n\nBut realizing that maybe all you want is a cutesy game or an action experience that doesn't have to be \"objectively\" solid (looking particularly at CoD, which is a blast even though I agree with all the hate it receives) has improved my game collection.\n\n---\n\nThis post has gotten a little out of hand. I'm only now realizing that I've kind of touched upon a lot of opinions that are stated in the occasional \"unpopular opinions\" posts, and I've addressed quite a few individual games. I myself do enjoy reading y'all's opinions, and even rants, on here, though. :D\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gmnb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "Kenqni", "saved": false, "mod_reports": [], "name": "t3_65gmnb", "subreddit_name_prefixed": "r/patientgamers", "approved_by": null, "over_18": false, "domain": "self.patientgamers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t3ad", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/patientgamers/comments/65gmnb/realizing_that_you_shouldnt_follow_the_mainstream/", "num_reports": null, "locked": false, "stickied": false, "created": 1492249508.0, "url": "https://www.reddit.com/r/patientgamers/comments/65gmnb/realizing_that_you_shouldnt_follow_the_mainstream/", "author_flair_text": null, "quarantine": false, "title": "Realizing that you shouldn't follow the mainstream.", "created_utc": 1492220708.0, "distinguished": null, "media": null, "upvote_ratio": 0.64, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": "", "user_reports": [], "id": "dgaa4bu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarkusRobben", "parent_id": "t1_dga7fj6", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "IMO Hotline Miami (2) is more frustrating than DS.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMO Hotline Miami (2) is more frustrating than DS.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgaa4bu", "score_hidden": false, "stickied": false, "created": 1492259273.0, "created_utc": 1492230473.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7fj6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kenqni", "parent_id": "t1_dga6tub", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I can definitely see TW3's appeal in that regard. Being able to differentiate between well-made games that you still don't like and personally enjoyable games is a great perk of reading online discussions. \n\nGetting better at Dark Souls is definitely rewarding. My main gripe about it is that I'm discouraged of going into a boss fight again and experimenting with different strategies because the way up to the fight is often irritating. I'll die and be pumped to try a different weapon next time, but then it hits me that I'll have to go there all the way from the respawn point again. In Hotline Miami, I was consistently in the game flow and was encouraged to try a level again countless times even if I sucked hard at it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can definitely see TW3&amp;#39;s appeal in that regard. Being able to differentiate between well-made games that you still don&amp;#39;t like and personally enjoyable games is a great perk of reading online discussions. &lt;/p&gt;\n\n&lt;p&gt;Getting better at Dark Souls is definitely rewarding. My main gripe about it is that I&amp;#39;m discouraged of going into a boss fight again and experimenting with different strategies because the way up to the fight is often irritating. I&amp;#39;ll die and be pumped to try a different weapon next time, but then it hits me that I&amp;#39;ll have to go there all the way from the respawn point again. In Hotline Miami, I was consistently in the game flow and was encouraged to try a level again countless times even if I sucked hard at it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga7fj6", "score_hidden": false, "stickied": false, "created": 1492254857.0, "created_utc": 1492226057.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6tub", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ETPhoneMyHome", "parent_id": "t3_65gmnb", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "As you know, gaming is incredibly subjective. Nobody will ever have the same tastes as you. I myself am a big fan of challenging games. I typically play on the highest or second highest difficulty. I like having to concentrate and being engaged (most of the time) in games. I absolutely loved TW3 because I was constantly looking in the glossary for monster weaknesses and using my potions to get a slight edge in a fight. Now granted, this can tend to piss me off a little when I get stuck, but sticking with it and beating it makes it so rewarding. It's the reason why Dark Souls is one of my favorite series. I also think story is important. Sure the gameplay is what will keep you coming back but if a story is crap then I just don't care enough in the first place to play. I also almost never purchase new games unless I have seen enough on it that I KNOW I will enjoy it. I completely agree you shouldn't follow the mainstream, normally. And that doesn't just apply to video games. You can almost always find lesser-known items that are better quality for either a lower or a similar price.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As you know, gaming is incredibly subjective. Nobody will ever have the same tastes as you. I myself am a big fan of challenging games. I typically play on the highest or second highest difficulty. I like having to concentrate and being engaged (most of the time) in games. I absolutely loved TW3 because I was constantly looking in the glossary for monster weaknesses and using my potions to get a slight edge in a fight. Now granted, this can tend to piss me off a little when I get stuck, but sticking with it and beating it makes it so rewarding. It&amp;#39;s the reason why Dark Souls is one of my favorite series. I also think story is important. Sure the gameplay is what will keep you coming back but if a story is crap then I just don&amp;#39;t care enough in the first place to play. I also almost never purchase new games unless I have seen enough on it that I KNOW I will enjoy it. I completely agree you shouldn&amp;#39;t follow the mainstream, normally. And that doesn&amp;#39;t just apply to video games. You can almost always find lesser-known items that are better quality for either a lower or a similar price.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga6tub", "score_hidden": false, "stickied": false, "created": 1492253948.0, "created_utc": 1492225148.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": "", "user_reports": [], "id": "dgab5pe", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "AmuseDeath", "parent_id": "t1_dga6xty", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I want to iterate that I like challenge and/or story in games. That means if a game only does one of the two right, that's still fine by me.\n\n**The Walking Dead** really has no gameplay. You just move your character and choose what to say sometimes. It's not hard. But I enjoyed the game a lot and found myself invested in the characters, despite a lack of gameplay.\n\nOn the other hand,**Civilization** games don't really have a story to them. You just start with a country and you just play it out as you make new cities, upgrade technologies and create units. It plays more like a board game if anything. And despite there being a lack of narrative, I enjoy the game for what it is, a city building game.\n\nAnd then you have multiplayer oriented games like **Street Fighter**. There's usually a ridiculous story mode that doesn't make sense. The AI is either really dumb or really cheap. But the multiplayer is the saving grace of the game.\n\nSo as long as a game does one of these 3 elements right, it's golden in my book. If it does more than one, that's fantastic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to iterate that I like challenge and/or story in games. That means if a game only does one of the two right, that&amp;#39;s still fine by me.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Walking Dead&lt;/strong&gt; really has no gameplay. You just move your character and choose what to say sometimes. It&amp;#39;s not hard. But I enjoyed the game a lot and found myself invested in the characters, despite a lack of gameplay.&lt;/p&gt;\n\n&lt;p&gt;On the other hand,&lt;strong&gt;Civilization&lt;/strong&gt; games don&amp;#39;t really have a story to them. You just start with a country and you just play it out as you make new cities, upgrade technologies and create units. It plays more like a board game if anything. And despite there being a lack of narrative, I enjoy the game for what it is, a city building game.&lt;/p&gt;\n\n&lt;p&gt;And then you have multiplayer oriented games like &lt;strong&gt;Street Fighter&lt;/strong&gt;. There&amp;#39;s usually a ridiculous story mode that doesn&amp;#39;t make sense. The AI is either really dumb or really cheap. But the multiplayer is the saving grace of the game.&lt;/p&gt;\n\n&lt;p&gt;So as long as a game does one of these 3 elements right, it&amp;#39;s golden in my book. If it does more than one, that&amp;#39;s fantastic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgab5pe", "score_hidden": false, "stickied": false, "created": 1492261099.0, "created_utc": 1492232299.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": "", "user_reports": [], "id": "dgaki8e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Katana314", "parent_id": "t1_dga6xty", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Even hard difficulty has a lot of subjective tastes to it. I can really enjoy hard games like Ori and the Blind Forest, but I played Dark Souls for an hour or two and felt certain I had wasted my money, because I HATE having a corpse retrieval system in a game that I feel doesn't need it (survival games are often excused)\n\nThis is why with a lot of recent games, I've been skipping the scores and reading the text very closely. There have been recent games with super-high scores that have evoked my \"Another GTA V where no mechanic of the game is actually fun\" radar in the review text.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even hard difficulty has a lot of subjective tastes to it. I can really enjoy hard games like Ori and the Blind Forest, but I played Dark Souls for an hour or two and felt certain I had wasted my money, because I HATE having a corpse retrieval system in a game that I feel doesn&amp;#39;t need it (survival games are often excused)&lt;/p&gt;\n\n&lt;p&gt;This is why with a lot of recent games, I&amp;#39;ve been skipping the scores and reading the text very closely. There have been recent games with super-high scores that have evoked my &amp;quot;Another GTA V where no mechanic of the game is actually fun&amp;quot; radar in the review text.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgaki8e", "score_hidden": false, "stickied": false, "created": 1492286078.0, "created_utc": 1492257278.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6xty", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kenqni", "parent_id": "t1_dga6k4o", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Dark Souls is an interesting one for me as I'm actually very fond of it. I feel like the difficulty is slightly overstated. Part of why I like the third one the best is because the most difficult aspect in DS1 is to not rage-quit when you realize that the bonfires are placed in such a way that it'll literally take you minutes to get to the boss again. But DS is also a game series where I've read up a lot about the story in forums and tried to find clued in the game myself. I think it handles the story well as it's interesting and engaging, but you don't have to sit through cut-scenes and can skip it all in your umpteenth play-through. The Talos Principle handles story in a similar way, in that you have to search for short pieces of well-written, cryptic documents in order to piece the story together. And the further you explore it, the deeper it gets. Those two games happen to also get the game-play and design right. :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dark Souls is an interesting one for me as I&amp;#39;m actually very fond of it. I feel like the difficulty is slightly overstated. Part of why I like the third one the best is because the most difficult aspect in DS1 is to not rage-quit when you realize that the bonfires are placed in such a way that it&amp;#39;ll literally take you minutes to get to the boss again. But DS is also a game series where I&amp;#39;ve read up a lot about the story in forums and tried to find clued in the game myself. I think it handles the story well as it&amp;#39;s interesting and engaging, but you don&amp;#39;t have to sit through cut-scenes and can skip it all in your umpteenth play-through. The Talos Principle handles story in a similar way, in that you have to search for short pieces of well-written, cryptic documents in order to piece the story together. And the further you explore it, the deeper it gets. Those two games happen to also get the game-play and design right. :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga6xty", "score_hidden": false, "stickied": false, "created": 1492254110.0, "created_utc": 1492225310.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6k4o", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "AmuseDeath", "parent_id": "t3_65gmnb", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Reviews are all subjective and aren't correct nor or they false. People just like hearing opinions.\n\nSpeaking of opinions, mine just about contradict yours. I don't care about graphics. I appreciate them, but as long they are functional, it's not a big concern. Story is actually a big deal for me with games. If the story sucks, 90% of my motivation to play is gone. Easy mode for me is boring and I regularly play difficult games like Dark Souls or Alien Isolation.\n\nNot following the mainstream is good advice and applies to just about anything. If you are at work, you may see your coworkers get Starbucks often. It's a far better use of money to brew your own coffee or even take caffeine pills. Mainstream culture is usually one where people are affected by advertising and trends. It's all designed to make you spend money and do what the higher ups want you to do. The smartest people decide for themselves what they want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reviews are all subjective and aren&amp;#39;t correct nor or they false. People just like hearing opinions.&lt;/p&gt;\n\n&lt;p&gt;Speaking of opinions, mine just about contradict yours. I don&amp;#39;t care about graphics. I appreciate them, but as long they are functional, it&amp;#39;s not a big concern. Story is actually a big deal for me with games. If the story sucks, 90% of my motivation to play is gone. Easy mode for me is boring and I regularly play difficult games like Dark Souls or Alien Isolation.&lt;/p&gt;\n\n&lt;p&gt;Not following the mainstream is good advice and applies to just about anything. If you are at work, you may see your coworkers get Starbucks often. It&amp;#39;s a far better use of money to brew your own coffee or even take caffeine pills. Mainstream culture is usually one where people are affected by advertising and trends. It&amp;#39;s all designed to make you spend money and do what the higher ups want you to do. The smartest people decide for themselves what they want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga6k4o", "score_hidden": false, "stickied": false, "created": 1492253561.0, "created_utc": 1492224761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": "", "user_reports": [], "id": "dgaabqb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "adayoff", "parent_id": "t3_65gmnb", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Easy mode is a big one for me lately. I always used to go for normal, and sometimes I still do, but my gaming time is limited these days so I'd much rather make it count rather than replaying the same section over and over.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Easy mode is a big one for me lately. I always used to go for normal, and sometimes I still do, but my gaming time is limited these days so I&amp;#39;d much rather make it count rather than replaying the same section over and over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgaabqb", "score_hidden": false, "stickied": false, "created": 1492259630.0, "created_utc": 1492230830.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": "", "user_reports": [], "id": "dga7w0v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kenqni", "parent_id": "t1_dga7rrp", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Now I wanna know what that niche is. :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now I wanna know what that niche is. :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga7w0v", "score_hidden": false, "stickied": false, "created": 1492255583.0, "created_utc": 1492226783.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7rrp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MiniMinute", "parent_id": "t3_65gmnb", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "First of all, sorry in advance if this is rambling and nonsensical. I've never been all that good at expressing my (overly elaborate opinion), though it definitely is easier to do so by writing it than it is by actually saying it. \n\nPersonally speaking, I hardly need good art style/design or an engaging story to enjoy a game, but it just feels like ... a complete package with both of these elements as well as good gameplay. Heck, I enjoy some visual novels too (though only the critically acclaimed ones and the ones that fall into my super obscure niche... so basically none of them), so I guess gameplay isn't even necessary. It's debatable whether VNs are really games are not, but, yeah, that's beside the point... anyhow, I only care if a game has a bad story if I'm expecting a good story from it. I don't really care about the story in a shooter or in a hack n' slash game; if they do actually have good stories, then, well, that's a pleasant surprise, but I'm definitely not expecting it. If it's an RPG or a VN, then I definitely am expecting good stories and my interest in games like these will be significantly lowered if their stories are awful.\n\nAs for the easy-mode thing, I do enjoy a challenge sometimes, but... not too much of a challenge, I suppose, which is why I usually go for Normal Mode or whatever crazy name they create for Normal Mode in my first playthrough of any particular game.\n\nI would agree with you, though, in that I definitely don't follow the mainstream. That super obscure niche I mentioned before has compelled me to try many games I would not have otherwise tried and which are, frankly, super obscure. I care less about that niche when it comes to games then I do when it comes to other forms of media because of that little thing called gameplay that other forms of media lack, but it still definitely influences my purchasing decisions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, sorry in advance if this is rambling and nonsensical. I&amp;#39;ve never been all that good at expressing my (overly elaborate opinion), though it definitely is easier to do so by writing it than it is by actually saying it. &lt;/p&gt;\n\n&lt;p&gt;Personally speaking, I hardly need good art style/design or an engaging story to enjoy a game, but it just feels like ... a complete package with both of these elements as well as good gameplay. Heck, I enjoy some visual novels too (though only the critically acclaimed ones and the ones that fall into my super obscure niche... so basically none of them), so I guess gameplay isn&amp;#39;t even necessary. It&amp;#39;s debatable whether VNs are really games are not, but, yeah, that&amp;#39;s beside the point... anyhow, I only care if a game has a bad story if I&amp;#39;m expecting a good story from it. I don&amp;#39;t really care about the story in a shooter or in a hack n&amp;#39; slash game; if they do actually have good stories, then, well, that&amp;#39;s a pleasant surprise, but I&amp;#39;m definitely not expecting it. If it&amp;#39;s an RPG or a VN, then I definitely am expecting good stories and my interest in games like these will be significantly lowered if their stories are awful.&lt;/p&gt;\n\n&lt;p&gt;As for the easy-mode thing, I do enjoy a challenge sometimes, but... not too much of a challenge, I suppose, which is why I usually go for Normal Mode or whatever crazy name they create for Normal Mode in my first playthrough of any particular game.&lt;/p&gt;\n\n&lt;p&gt;I would agree with you, though, in that I definitely don&amp;#39;t follow the mainstream. That super obscure niche I mentioned before has compelled me to try many games I would not have otherwise tried and which are, frankly, super obscure. I care less about that niche when it comes to games then I do when it comes to other forms of media because of that little thing called gameplay that other forms of media lack, but it still definitely influences my purchasing decisions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga7rrp", "score_hidden": false, "stickied": false, "created": 1492255391.0, "created_utc": 1492226591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": "", "user_reports": [], "id": "dgag70t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "K-Dave", "parent_id": "t3_65gmnb", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "While I love a bit of a hype when a game is really good, I'm also aware of not getting brainwashed into something. Lately there has been this huge Zelda hype which I succesfully ignored. I got myself the wonderful Fast RMX instead. Another case has been Persona 5. I totally understand what people love about it, but it's not for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I love a bit of a hype when a game is really good, I&amp;#39;m also aware of not getting brainwashed into something. Lately there has been this huge Zelda hype which I succesfully ignored. I got myself the wonderful Fast RMX instead. Another case has been Persona 5. I totally understand what people love about it, but it&amp;#39;s not for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgag70t", "score_hidden": false, "stickied": false, "created": 1492272851.0, "created_utc": 1492244051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65gmnb", "likes": null, "replies": "", "user_reports": [], "id": "dga73ru", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kenqni", "parent_id": "t1_dga6y6f", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Dark Souls is awesome in that regard. After I'd finished the first one, I'd actually gotten interested in learning about the setting and ended up reading through story explanations online. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dark Souls is awesome in that regard. After I&amp;#39;d finished the first one, I&amp;#39;d actually gotten interested in learning about the setting and ended up reading through story explanations online. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga73ru", "score_hidden": false, "stickied": false, "created": 1492254356.0, "created_utc": 1492225556.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6y6f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65gmnb", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dga6y6f", "score_hidden": false, "stickied": false, "created": 1492254125.0, "created_utc": 1492225325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]