[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "patientgamers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a PS3 and haven&amp;#39;t moved up to a new generation of consoles because of money, and also, what has become a shopping spree of games on the cheap.&lt;/p&gt;\n\n&lt;p&gt;I recently got a hold of the Metal Gear Solid HD Collection.  I hadn&amp;#39;t played any of the MGS games besides MGS4.  I was a nintendo kid growing up and missed out on a lot of the great games the playstation world had to offer.  I&amp;#39;m also too young to have experienced the MSX Computer games, and from what I can tell from NES game reviewers, the NES version of these games is just a pass.&lt;/p&gt;\n\n&lt;p&gt;So, let me get started with this experience.  I decided to play through this whole collection in the order they were released, with no internet help to solve any puzzles, as if I was part of the actual time these things came out.  (I admit I broke this rule a few minor times just out of 3 hr frustrations that I needed to end my confusion).&lt;/p&gt;\n\n&lt;p&gt;This is about the first 3 games of this series.  Metal Gear had great puzzles and game mechanics for the time.  In fact, I had no idea games from this era were even capable of such depth.  It openly fucks you on so many occasions, like it&amp;#39;s just laughing at you.  It&amp;#39;s a massive memory game.  Can you remember what just fucked you?&lt;/p&gt;\n\n&lt;p&gt;And out of left field you find what you&amp;#39;ve come to rely on the entire game is no longer available (sort of avoiding spoiler with the crypiticism.) Another AND; How many hours did I need to waste before I realized that punching walls to find a secret carried over out of the room I initially learned that, in order to forward the game?!  Constant &amp;quot;Fuck Me!&amp;quot;, but I loved the punishment.&lt;/p&gt;\n\n&lt;p&gt;MG2: Solid Snake, solves every problem the first game had and expands upon every aspect of the game without massively altering the game mechanics, nor damaging the aspects that left you fucked in the original.  It still doesn&amp;#39;t hold your hand at all.  It doesn&amp;#39;t care about you, and it makes me want to play it again to prove to it that I&amp;#39;m better than &amp;quot;DEER&amp;quot; ranking.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sneezing now?  For fucking ever until I discover where the fuck the goddamn medicine is?  But I don&amp;#39;t have a fucking keycard to get to that fucking place yet?  Nor did I write down what I&amp;#39;ve been told before or even realize how helpful and informative the CODEC can be at times.&lt;/p&gt;\n\n&lt;p&gt;And what the fuck is this TAP-CODE 45 min long discovery of cracking your code? FUCK!&lt;/p&gt;\n\n&lt;p&gt;With these two games first, here&amp;#39;s what I really came to say.  I think, that with these two games in your memory, before playing MG Solid for PS1, you would have been let down via the way the game actually played.&lt;/p&gt;\n\n&lt;p&gt;In many aspects, I already realize that this was the beginning of experimentation in the 3D world, but MG Solid is kinda broken in many aspects.  And, it feels really small in comparison to MG2.  Because of the graphical improvement, sure you&amp;#39;d be impressed, but the fixed cameras, and NON-AIMING of your guns, slow turning, death, death, death, death, fuck, death???&lt;/p&gt;\n\n&lt;p&gt;I got so mad playing this game, and it&amp;#39;s probably because I have already experienced so many games that have improved and set how 3D games are supposed to be played.  I felt like my hand was held a whole lot more, though, I didn&amp;#39;t think the game was necessarily lessor as for how the mechanics of story and puzzles played out.&lt;/p&gt;\n\n&lt;p&gt;And, for the love of fuck, the game was more a battle of how to get my character to do the inputs and commands I was giving him MORE than it was about actually defeating the enemies in the game.&lt;/p&gt;\n\n&lt;p&gt;Remember, I&amp;#39;m not calling this out as being a bad game at all, nor was it not fun, but If you were to consider the two previous Metal Gear games up to that point, I really think some fans might have been let down.&lt;/p&gt;\n\n&lt;p&gt;I just wanted to share my way way late perspective on these titles.  It was amazing and I&amp;#39;ll play them forever and again.  Best shit. Best.&lt;/p&gt;\n\n&lt;p&gt;TL;DR:  I think MG Solid on PS1 doesn&amp;#39;t hold up to the MSX Computer Metal Gear games.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have a PS3 and haven't moved up to a new generation of consoles because of money, and also, what has become a shopping spree of games on the cheap.\n\nI recently got a hold of the Metal Gear Solid HD Collection.  I hadn't played any of the MGS games besides MGS4.  I was a nintendo kid growing up and missed out on a lot of the great games the playstation world had to offer.  I'm also too young to have experienced the MSX Computer games, and from what I can tell from NES game reviewers, the NES version of these games is just a pass.\n\nSo, let me get started with this experience.  I decided to play through this whole collection in the order they were released, with no internet help to solve any puzzles, as if I was part of the actual time these things came out.  (I admit I broke this rule a few minor times just out of 3 hr frustrations that I needed to end my confusion).\n\nThis is about the first 3 games of this series.  Metal Gear had great puzzles and game mechanics for the time.  In fact, I had no idea games from this era were even capable of such depth.  It openly fucks you on so many occasions, like it's just laughing at you.  It's a massive memory game.  Can you remember what just fucked you?\n\nAnd out of left field you find what you've come to rely on the entire game is no longer available (sort of avoiding spoiler with the crypiticism.) Another AND; How many hours did I need to waste before I realized that punching walls to find a secret carried over out of the room I initially learned that, in order to forward the game?!  Constant \"Fuck Me!\", but I loved the punishment.\n\nMG2: Solid Snake, solves every problem the first game had and expands upon every aspect of the game without massively altering the game mechanics, nor damaging the aspects that left you fucked in the original.  It still doesn't hold your hand at all.  It doesn't care about you, and it makes me want to play it again to prove to it that I'm better than \"DEER\" ranking.\n\nI'm sneezing now?  For fucking ever until I discover where the fuck the goddamn medicine is?  But I don't have a fucking keycard to get to that fucking place yet?  Nor did I write down what I've been told before or even realize how helpful and informative the CODEC can be at times.\n\nAnd what the fuck is this TAP-CODE 45 min long discovery of cracking your code? FUCK!\n\nWith these two games first, here's what I really came to say.  I think, that with these two games in your memory, before playing MG Solid for PS1, you would have been let down via the way the game actually played.\n\nIn many aspects, I already realize that this was the beginning of experimentation in the 3D world, but MG Solid is kinda broken in many aspects.  And, it feels really small in comparison to MG2.  Because of the graphical improvement, sure you'd be impressed, but the fixed cameras, and NON-AIMING of your guns, slow turning, death, death, death, death, fuck, death???\n\nI got so mad playing this game, and it's probably because I have already experienced so many games that have improved and set how 3D games are supposed to be played.  I felt like my hand was held a whole lot more, though, I didn't think the game was necessarily lessor as for how the mechanics of story and puzzles played out.\n\nAnd, for the love of fuck, the game was more a battle of how to get my character to do the inputs and commands I was giving him MORE than it was about actually defeating the enemies in the game.\n\nRemember, I'm not calling this out as being a bad game at all, nor was it not fun, but If you were to consider the two previous Metal Gear games up to that point, I really think some fans might have been let down.\n\nI just wanted to share my way way late perspective on these titles.  It was amazing and I'll play them forever and again.  Best shit. Best.\n\nTL;DR:  I think MG Solid on PS1 doesn't hold up to the MSX Computer Metal Gear games.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65h0ri", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "MarklarMusic", "saved": false, "mod_reports": [], "name": "t3_65h0ri", "subreddit_name_prefixed": "r/patientgamers", "approved_by": null, "over_18": false, "domain": "self.patientgamers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t3ad", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/patientgamers/comments/65h0ri/metal_gearmg2solid_snakemg_solid/", "num_reports": null, "locked": false, "stickied": false, "created": 1492254845.0, "url": "https://www.reddit.com/r/patientgamers/comments/65h0ri/metal_gearmg2solid_snakemg_solid/", "author_flair_text": null, "quarantine": false, "title": "Metal Gear/MG2:Solid Snake/MG Solid", "created_utc": 1492226045.0, "distinguished": null, "media": null, "upvote_ratio": 0.71, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65h0ri", "likes": null, "replies": "", "user_reports": [], "id": "dgaj2fl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "machine2Strong", "parent_id": "t3_65h0ri", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I see what you mean. I played MGS:TTS last year as my first game in the series. I don't where I'd be without a walkthrough or without playing on the easiest difficulty. I don't think I ever picked up night vision(or was it thermals?) because the only opportunity early on the game. Had I read a walkthrough earlier. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see what you mean. I played MGS:TTS last year as my first game in the series. I don&amp;#39;t where I&amp;#39;d be without a walkthrough or without playing on the easiest difficulty. I don&amp;#39;t think I ever picked up night vision(or was it thermals?) because the only opportunity early on the game. Had I read a walkthrough earlier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgaj2fl", "score_hidden": false, "stickied": false, "created": 1492281941.0, "created_utc": 1492253141.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65h0ri", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65h0ri", "likes": null, "replies": "", "user_reports": [], "id": "dgarjar", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarklarMusic", "parent_id": "t1_dgaqvzj", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I remember playing my first Xbox game and thinking it looked more real than anything ever.  Blown away.  If I looked at it now, I wouldn't feel that way.\n\nI definitely touched on the part of having experienced so many refined games now, buy even without that, I'd still think the controls were clunking and difficult to master.  The 3D world doesn't play out for point and shoot like the 2D world did.  I died so much because it forces you into situations later on in the game that involved running and gunning.\n\nBeating Metal Gear as a boss was incredibly difficult because of having to make sure my guy was pointing toward the boss before selecting my weapon, otherwise I would turn too slowly to even get a chance to fire.\n\nThe sniper rifle forced me to lay down before getting a chance to find what I was looking for.\n\nI remember many people hating on Resident Evils fixed camera during the time, too.\n\nIt was just a thought, though.  I know most folks loved it, and I loved it too, but streamlined and paired with the MSX games, the experience was completely different and maybe, possibly, could have, upset some people's experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember playing my first Xbox game and thinking it looked more real than anything ever.  Blown away.  If I looked at it now, I wouldn&amp;#39;t feel that way.&lt;/p&gt;\n\n&lt;p&gt;I definitely touched on the part of having experienced so many refined games now, buy even without that, I&amp;#39;d still think the controls were clunking and difficult to master.  The 3D world doesn&amp;#39;t play out for point and shoot like the 2D world did.  I died so much because it forces you into situations later on in the game that involved running and gunning.&lt;/p&gt;\n\n&lt;p&gt;Beating Metal Gear as a boss was incredibly difficult because of having to make sure my guy was pointing toward the boss before selecting my weapon, otherwise I would turn too slowly to even get a chance to fire.&lt;/p&gt;\n\n&lt;p&gt;The sniper rifle forced me to lay down before getting a chance to find what I was looking for.&lt;/p&gt;\n\n&lt;p&gt;I remember many people hating on Resident Evils fixed camera during the time, too.&lt;/p&gt;\n\n&lt;p&gt;It was just a thought, though.  I know most folks loved it, and I loved it too, but streamlined and paired with the MSX games, the experience was completely different and maybe, possibly, could have, upset some people&amp;#39;s experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgarjar", "score_hidden": false, "stickied": false, "created": 1492298908.0, "created_utc": 1492270108.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqvzj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "celestial1", "parent_id": "t3_65h0ri", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "&gt;Remember, I'm not calling this out as being a bad game at all, nor was it not fun, but If you were to consider the two previous Metal Gear games up to that point, I really think some fans might have been let down.\n\nI can't agree with this. You have the knowledge of newer games with much better and refined mechanics. Back them, most 3D real-time games were garbage with the controls and camera (there's a reason why a lot of JRPGs and tactics games from that era have aged well) so MGS 1 was one of the best of it's time.\n\nAlso the presentation and voice acting were light years ahead of their time. The voice acting in particular...games didn't become that good until the PS3/360 era (with some exceptions of course).", "edited": 1492269431.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Remember, I&amp;#39;m not calling this out as being a bad game at all, nor was it not fun, but If you were to consider the two previous Metal Gear games up to that point, I really think some fans might have been let down.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can&amp;#39;t agree with this. You have the knowledge of newer games with much better and refined mechanics. Back them, most 3D real-time games were garbage with the controls and camera (there&amp;#39;s a reason why a lot of JRPGs and tactics games from that era have aged well) so MGS 1 was one of the best of it&amp;#39;s time.&lt;/p&gt;\n\n&lt;p&gt;Also the presentation and voice acting were light years ahead of their time. The voice acting in particular...games didn&amp;#39;t become that good until the PS3/360 era (with some exceptions of course).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgaqvzj", "score_hidden": false, "stickied": false, "created": 1492297985.0, "created_utc": 1492269185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]