[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "patientgamers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was a huge fan of the first Tomb Raider on PS1 but lost interest at Tomb Raider 3- there were lots of people and too few tombs by this point. I went back to the TR reboot and enjoyed that alot so I thought I&amp;#39;d give the ones I&amp;#39;d missed a go. The PS1 titles and PS2 Angel of Darkness were too far gone so I started with Legend on the PS3 Trilogy pack.&lt;/p&gt;\n\n&lt;p&gt;Starting with Lara, it seems the games were imitating the movies. Lots of action sequences and those delightful QTE&amp;#39;s from the PS2 era. Motorbike chases as as well. And Lara herself has fully emerged as a hyper sexy quick witted badass who delivers one liners to her friends via radio comms. I have learnt to hate radio comms in video game narrative, its just annoying. I don&amp;#39;t want people talking at me all day as it is, thats why I&amp;#39;m playing videogames. Lara was, to me anyway, a self sufficient isolated character who felt more at home in the tomb and her mansion than with sidekicks. Now in Legend she is the Jolie clone with dialogue to match. So the character sucks to the point of actually being annoying and cringy. As do the sidekicks who are super scared of everything Lara encounters from heights to yakuza. Perhaps you&amp;#39;re in the wrong profession guys.&lt;/p&gt;\n\n&lt;p&gt;The game looks okay (I&amp;#39;m playing the remastered HD version not the original PS2)The graphics look crisp and clean but a clearly lacking in the detail of the modern systems. The enemies on the other hand look like black blobs as far as I can tell, but henchmen be henchmen I guess so it doesn&amp;#39;t really matter. Environments are nicely done and hold up fairly well. Each stage is a new environment from frozen factories to asian cities and of course jungles. I do miss the feeling of going &amp;#39;deeper&amp;#39; into a single play area but showing off how many locations you could visit seemed to be the style after The Last Revelation. &lt;/p&gt;\n\n&lt;p&gt;Control is an interesting middle point between the laborious one wrong step and your dead PS1 and the press jump + direction to get to the next level. I actually died a few times whilst platforming which didn&amp;#39;t really happen in the most recent TR reboot (haven&amp;#39;t played Rise of the TR yet, trying to get through these old ones first). But the controls are twitchy and definitely not designed for the fine cautious movement that you might want to actually use in a tomb (particularly if there are traps everywhere). The platforming stands up against its modern rivals albeit with the occasional unfortunate death which you can blame on controls or yourself, your choice. &lt;/p&gt;\n\n&lt;p&gt;Puzzles are simple- you just have to remember the limited number of &amp;#39;actions&amp;#39; Lara can perform (grapple, grab/pull, shoot and swing) and you should be good. You also have goggles that can identify &amp;#39;mechanisms&amp;#39; which to be honest you will never need to use as items that can be interacted with are obvious (and shiny!) I didn&amp;#39;t really get stuck on the puzzles for long and whenever a &amp;#39;big&amp;#39; puzzle is encountered the intro camera pans to each of the key elements and tends to explain itself as was the style at the time.&lt;/p&gt;\n\n&lt;p&gt;Combat is extremely PS2 in that it reminded me of GTA:SA. Red target sights lock on to targets and you hold shoot until the target dies or you switch to a different target. You can lob grenades (rarely needed to use) and engage in some close quarters combat and a &amp;#39;bullet time&amp;#39; mode. I haven&amp;#39;t had to use anything other than roll and shoot to dispatch enemies playing on normal - at 55% completion through the game. &lt;/p&gt;\n\n&lt;p&gt;So why am I talking about this game at only 55% complete? Because that&amp;#39;s all I&amp;#39;m going to play. At level 6: England, (the third last level I might add) you grapple cranks to lower cages in a room filled with water and you can encounter a game breaking bug. If you pull the cranks at the wrong time/two quickly the cages will no longer lower. The big issue being that when you enter the room, it appears that these cranks could be central to a puzzle to open a door so I spent 15 or so minutes pulling each of them. They&amp;#39;re actually not part of a puzzle, but part of a boss fight. Which I can&amp;#39;t complete because the bug means some of the cages wont lower and I can&amp;#39;t defeat the boss. So I can restart the level I guess. Restart option in pause menu? Nope. Go back to main screen and choose that level? Nope, can only choose levels you&amp;#39;ve completed. And of course it autosaves overwriting the existing file so no go there. Restart game? Or play one of the 100 other games on my list. Hmmmm\nWell at least I can enjoy Croft Manor. Jump through a wall and disappear whilst viewing a sunset? Okay...I get the message.\nGiven all the potential ways this bug could have been corrected or at least worked around its amazing that the game doesn&amp;#39;t allow any of them. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t have bugs in the first place but if you do:\nDon&amp;#39;t make the puzzle in a way that makes it more likely you&amp;#39;ll encounter the bug.\nAllow people to restart from last checkpoint\nAllow people to restart the level.\nFix it when you put the games on PS3 -you can&amp;#39;t claim you didn&amp;#39;t know about it.\nFix it when you update the Trilogy on PS3 &lt;/p&gt;\n\n&lt;p&gt;I mean, come on...&lt;/p&gt;\n\n&lt;p&gt;At least I was only 2 levels from the end (really short game...) and the story did not have me hooked in the least so I won&amp;#39;t cry myself to sleep over this. Over things perhaps, but not this.&lt;/p&gt;\n\n&lt;p&gt;I will give Anniversary a go as I am curious about how it compares to the PS1 original- I should read a guide to see if there are any bugs but that&amp;#39;s not how I play games. It bugs out, I drop it. Except you Bethesda, because the bugs are assumed. &lt;/p&gt;\n\n&lt;p&gt;Without this crippling bug (which you now know about and can avoid) and given the ability you can on PC just import another save game I&amp;#39;d say TR: Legend is a fun albeit easy and underwhelming experience. If you want to start the Tomb Raider experience this game at least feels playable in a modern sense. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\nI was a huge fan of the first Tomb Raider on PS1 but lost interest at Tomb Raider 3- there were lots of people and too few tombs by this point. I went back to the TR reboot and enjoyed that alot so I thought I'd give the ones I'd missed a go. The PS1 titles and PS2 Angel of Darkness were too far gone so I started with Legend on the PS3 Trilogy pack.\n\nStarting with Lara, it seems the games were imitating the movies. Lots of action sequences and those delightful QTE's from the PS2 era. Motorbike chases as as well. And Lara herself has fully emerged as a hyper sexy quick witted badass who delivers one liners to her friends via radio comms. I have learnt to hate radio comms in video game narrative, its just annoying. I don't want people talking at me all day as it is, thats why I'm playing videogames. Lara was, to me anyway, a self sufficient isolated character who felt more at home in the tomb and her mansion than with sidekicks. Now in Legend she is the Jolie clone with dialogue to match. So the character sucks to the point of actually being annoying and cringy. As do the sidekicks who are super scared of everything Lara encounters from heights to yakuza. Perhaps you're in the wrong profession guys.\n\nThe game looks okay (I'm playing the remastered HD version not the original PS2)The graphics look crisp and clean but a clearly lacking in the detail of the modern systems. The enemies on the other hand look like black blobs as far as I can tell, but henchmen be henchmen I guess so it doesn't really matter. Environments are nicely done and hold up fairly well. Each stage is a new environment from frozen factories to asian cities and of course jungles. I do miss the feeling of going 'deeper' into a single play area but showing off how many locations you could visit seemed to be the style after The Last Revelation. \n\nControl is an interesting middle point between the laborious one wrong step and your dead PS1 and the press jump + direction to get to the next level. I actually died a few times whilst platforming which didn't really happen in the most recent TR reboot (haven't played Rise of the TR yet, trying to get through these old ones first). But the controls are twitchy and definitely not designed for the fine cautious movement that you might want to actually use in a tomb (particularly if there are traps everywhere). The platforming stands up against its modern rivals albeit with the occasional unfortunate death which you can blame on controls or yourself, your choice. \n\nPuzzles are simple- you just have to remember the limited number of 'actions' Lara can perform (grapple, grab/pull, shoot and swing) and you should be good. You also have goggles that can identify 'mechanisms' which to be honest you will never need to use as items that can be interacted with are obvious (and shiny!) I didn't really get stuck on the puzzles for long and whenever a 'big' puzzle is encountered the intro camera pans to each of the key elements and tends to explain itself as was the style at the time.\n\nCombat is extremely PS2 in that it reminded me of GTA:SA. Red target sights lock on to targets and you hold shoot until the target dies or you switch to a different target. You can lob grenades (rarely needed to use) and engage in some close quarters combat and a 'bullet time' mode. I haven't had to use anything other than roll and shoot to dispatch enemies playing on normal - at 55% completion through the game. \n\nSo why am I talking about this game at only 55% complete? Because that's all I'm going to play. At level 6: England, (the third last level I might add) you grapple cranks to lower cages in a room filled with water and you can encounter a game breaking bug. If you pull the cranks at the wrong time/two quickly the cages will no longer lower. The big issue being that when you enter the room, it appears that these cranks could be central to a puzzle to open a door so I spent 15 or so minutes pulling each of them. They're actually not part of a puzzle, but part of a boss fight. Which I can't complete because the bug means some of the cages wont lower and I can't defeat the boss. So I can restart the level I guess. Restart option in pause menu? Nope. Go back to main screen and choose that level? Nope, can only choose levels you've completed. And of course it autosaves overwriting the existing file so no go there. Restart game? Or play one of the 100 other games on my list. Hmmmm\nWell at least I can enjoy Croft Manor. Jump through a wall and disappear whilst viewing a sunset? Okay...I get the message.\nGiven all the potential ways this bug could have been corrected or at least worked around its amazing that the game doesn't allow any of them. \n\nDon't have bugs in the first place but if you do:\nDon't make the puzzle in a way that makes it more likely you'll encounter the bug.\nAllow people to restart from last checkpoint\nAllow people to restart the level.\nFix it when you put the games on PS3 -you can't claim you didn't know about it.\nFix it when you update the Trilogy on PS3 \n\nI mean, come on...\n\nAt least I was only 2 levels from the end (really short game...) and the story did not have me hooked in the least so I won't cry myself to sleep over this. Over things perhaps, but not this.\n\nI will give Anniversary a go as I am curious about how it compares to the PS1 original- I should read a guide to see if there are any bugs but that's not how I play games. It bugs out, I drop it. Except you Bethesda, because the bugs are assumed. \n\nWithout this crippling bug (which you now know about and can avoid) and given the ability you can on PC just import another save game I'd say TR: Legend is a fun albeit easy and underwhelming experience. If you want to start the Tomb Raider experience this game at least feels playable in a modern sense. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ofhk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "RonIsIZe_13", "saved": false, "mod_reports": [], "name": "t3_65ofhk", "subreddit_name_prefixed": "r/patientgamers", "approved_by": null, "over_18": false, "domain": "self.patientgamers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t3ad", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/patientgamers/comments/65ofhk/tomb_raider_legend_tomb_raider_trilogy_ps3_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492365770.0, "url": "https://www.reddit.com/r/patientgamers/comments/65ofhk/tomb_raider_legend_tomb_raider_trilogy_ps3_the/", "author_flair_text": null, "quarantine": false, "title": "Tomb Raider: Legend (Tomb Raider Trilogy PS3) The beginning of 'modern' Tomb Raider", "created_utc": 1492336970.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": "", "user_reports": [], "id": "dgbz6q5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RonIsIZe_13", "parent_id": "t1_dgbxnpx", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Im not sure, you could be right. I,ll replay the previous level and see if it actually allows you to continue. The bug in lv 6 is at the end so at a minimum I'm replaying 25% of an average game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im not sure, you could be right. I,ll replay the previous level and see if it actually allows you to continue. The bug in lv 6 is at the end so at a minimum I&amp;#39;m replaying 25% of an average game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgbz6q5", "score_hidden": false, "stickied": false, "created": 1492374492.0, "created_utc": 1492345692.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxnpx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rarelypost", "parent_id": "t3_65ofhk", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Could you just replay the level before and then come back to the level you got stuck on?  Assuming the game would continue on into the next section and not just kick you back to the level select menu.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could you just replay the level before and then come back to the level you got stuck on?  Assuming the game would continue on into the next section and not just kick you back to the level select menu.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgbxnpx", "score_hidden": false, "stickied": false, "created": 1492370269.0, "created_utc": 1492341469.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": "", "user_reports": [], "id": "dgc13xh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RonIsIZe_13", "parent_id": "t1_dgbzd7k", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I have it on ps one will use emulator on pc or phone. Not sure the phone screen will be big enough ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have it on ps one will use emulator on pc or phone. Not sure the phone screen will be big enough &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgc13xh", "score_hidden": false, "stickied": false, "created": 1492378550.0, "created_utc": 1492349750.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzd7k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "megaapple", "parent_id": "t1_dgbz3oo", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Why? Why not try the PC version on GOG/Steam", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why? Why not try the PC version on GOG/Steam&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgbzd7k", "score_hidden": false, "stickied": false, "created": 1492374924.0, "created_utc": 1492346124.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbz3oo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RonIsIZe_13", "parent_id": "t1_dgbxpw9", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I am emulating TR Revelations- have heard good things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am emulating TR Revelations- have heard good things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgbz3oo", "score_hidden": false, "stickied": false, "created": 1492374288.0, "created_utc": 1492345488.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxpw9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "megaapple", "parent_id": "t3_65ofhk", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Hmm... I've played a lot of old school (TR1-TR5) and Anniversary, and then the reboot. Seems like I could give Legends a pass.\n\nThat said I recommend giving TR : The Last Revelations (TR4) a try for old school Lara, and TR Anniversary for mid-reboot Lara.\n\nAlso, I'm one of the few people who were underwhelmed and slightly disappointed by TR2013. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm... I&amp;#39;ve played a lot of old school (TR1-TR5) and Anniversary, and then the reboot. Seems like I could give Legends a pass.&lt;/p&gt;\n\n&lt;p&gt;That said I recommend giving TR : The Last Revelations (TR4) a try for old school Lara, and TR Anniversary for mid-reboot Lara.&lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;m one of the few people who were underwhelmed and slightly disappointed by TR2013. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgbxpw9", "score_hidden": false, "stickied": false, "created": 1492370459.0, "created_utc": 1492341659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": "", "user_reports": [], "id": "dgc3y4d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Virtuaddict", "parent_id": "t1_dgc2mz0", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "Yeah. I've already bought most of them off eBay. I'm not playing them non-stop back-to-back, but going through in order whenever I feel like jumping into the next one. I played the first one probably about a year ago. It'll be a few more years until I finish the whole series I'm sure hahah (there are A LOT of tr games).  \n\nThe PS1 Raiders certainly aren't for everyone. The controls can be awkward, the movement/gameplay quite slow, and the challenges often unforgiving. You definitely need a lot more patience, compared to most modern games, to enjoy them. I think once you come to grips with their unique design and controls though there's a lot of fascinating adventuring to be had, but only for gamers who have an appreciation for difficulty and exploration. ^[I ^also ^grew ^up ^on ^PS1 ^so ^it's ^easier ^for ^me ^to ^get ^back ^into ^it]", "edited": 1492360080.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. I&amp;#39;ve already bought most of them off eBay. I&amp;#39;m not playing them non-stop back-to-back, but going through in order whenever I feel like jumping into the next one. I played the first one probably about a year ago. It&amp;#39;ll be a few more years until I finish the whole series I&amp;#39;m sure hahah (there are A LOT of tr games).  &lt;/p&gt;\n\n&lt;p&gt;The PS1 Raiders certainly aren&amp;#39;t for everyone. The controls can be awkward, the movement/gameplay quite slow, and the challenges often unforgiving. You definitely need a lot more patience, compared to most modern games, to enjoy them. I think once you come to grips with their unique design and controls though there&amp;#39;s a lot of fascinating adventuring to be had, but only for gamers who have an appreciation for difficulty and exploration. &lt;sup&gt;[I&lt;/sup&gt; &lt;sup&gt;also&lt;/sup&gt; &lt;sup&gt;grew&lt;/sup&gt; &lt;sup&gt;up&lt;/sup&gt; &lt;sup&gt;on&lt;/sup&gt; &lt;sup&gt;PS1&lt;/sup&gt; &lt;sup&gt;so&lt;/sup&gt; &lt;sup&gt;it&amp;#39;s&lt;/sup&gt; &lt;sup&gt;easier&lt;/sup&gt; &lt;sup&gt;for&lt;/sup&gt; &lt;sup&gt;me&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;get&lt;/sup&gt; &lt;sup&gt;back&lt;/sup&gt; &lt;sup&gt;into&lt;/sup&gt; &lt;sup&gt;it]&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgc3y4d", "score_hidden": false, "stickied": false, "created": 1492383222.0, "created_utc": 1492354422.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc2mz0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RonIsIZe_13", "parent_id": "t1_dgc27kl", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I admire the commitment. The ps1 tomb raiders have not aged well in my opinion although ill give revelations a crack. Are you playing through the series?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I admire the commitment. The ps1 tomb raiders have not aged well in my opinion although ill give revelations a crack. Are you playing through the series?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgc2mz0", "score_hidden": false, "stickied": false, "created": 1492381204.0, "created_utc": 1492352404.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc27kl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Virtuaddict", "parent_id": "t3_65ofhk", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I've played TR 1 &amp; 2 so far, and currently playing 3 right now.  \n\nTR 1 &amp; 2 were quite tough but still mostly fun... but my god TR 3 is by far the hardest one yet! I'm not having as much fun with this one. It's clearly way more devious in its design, plus the inability to Save anywhere makes things a real chore sometimes.\n\nI love the style and concept of these games though and plan on continuing to play the series. Really cool games, quite unlike anything else really (at least these early ones). And I'm curious to see how the series evolved.", "edited": 1492357597.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve played TR 1 &amp;amp; 2 so far, and currently playing 3 right now.  &lt;/p&gt;\n\n&lt;p&gt;TR 1 &amp;amp; 2 were quite tough but still mostly fun... but my god TR 3 is by far the hardest one yet! I&amp;#39;m not having as much fun with this one. It&amp;#39;s clearly way more devious in its design, plus the inability to Save anywhere makes things a real chore sometimes.&lt;/p&gt;\n\n&lt;p&gt;I love the style and concept of these games though and plan on continuing to play the series. Really cool games, quite unlike anything else really (at least these early ones). And I&amp;#39;m curious to see how the series evolved.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgc27kl", "score_hidden": false, "stickied": false, "created": 1492380507.0, "created_utc": 1492351707.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65ofhk", "likes": null, "replies": "", "user_reports": [], "id": "dgdat20", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Peacefullifeonafarm", "parent_id": "t3_65ofhk", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "tomb raider underworld is still the best. (for me)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;tomb raider underworld is still the best. (for me)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgdat20", "score_hidden": false, "stickied": false, "created": 1492448910.0, "created_utc": 1492420110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]