[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "patientgamers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m on a bit of a nostalgia trip lately and I started to wonder if anyone else here ever finished or even played Wizardry 4: The Return of Werdna.&lt;/p&gt;\n\n&lt;p&gt;I played it back in the 80&amp;#39;s on the Apple //e and to this day it&amp;#39;s one of the most difficult RPG&amp;#39;s I&amp;#39;ve ever come across. Since it was back before the Internet I only knew a couple of other people who played it and add far as I know they never finished.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm on a bit of a nostalgia trip lately and I started to wonder if anyone else here ever finished or even played Wizardry 4: The Return of Werdna.\n\nI played it back in the 80's on the Apple //e and to this day it's one of the most difficult RPG's I've ever come across. Since it was back before the Internet I only knew a couple of other people who played it and add far as I know they never finished.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65y81n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "Hacksaw999", "saved": false, "mod_reports": [], "name": "t3_65y81n", "subreddit_name_prefixed": "r/patientgamers", "approved_by": null, "over_18": false, "domain": "self.patientgamers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t3ad", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/patientgamers/comments/65y81n/the_return_of_werdna/", "num_reports": null, "locked": false, "stickied": false, "created": 1492490607.0, "url": "https://www.reddit.com/r/patientgamers/comments/65y81n/the_return_of_werdna/", "author_flair_text": null, "quarantine": false, "title": "The Return of Werdna", "created_utc": 1492461807.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65y81n", "likes": null, "replies": "", "user_reports": [], "id": "dge9v6f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CriticalComposer", "parent_id": "t3_65y81n", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "As much as I love Wiz8, the rest of the series is just z bit too arcane for me. There is a lot of preplanning needed in character creation and one small oversight could lead to a 20 hour save game that is nigh impossible to continue with. Wiz8 has some of the same issues but I think the graphical interface helped out with wanting to return to the world for a second (3rd/4th/5th) attempt at finishing it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As much as I love Wiz8, the rest of the series is just z bit too arcane for me. There is a lot of preplanning needed in character creation and one small oversight could lead to a 20 hour save game that is nigh impossible to continue with. Wiz8 has some of the same issues but I think the graphical interface helped out with wanting to return to the world for a second (3rd/4th/5th) attempt at finishing it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dge9v6f", "score_hidden": false, "stickied": false, "created": 1492498779.0, "created_utc": 1492469979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65y81n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65y81n", "likes": null, "replies": "", "user_reports": [], "id": "dgepusv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dougmc", "parent_id": "t1_dgeouvq", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "&gt; And Werdna is a mage, so he has virtually nil HP; if you ever run out of monsters, that's it. He can't even survive one attack.\n\nAnd yet in Wizardry 1 he had a massive number of hit points!  And if he hit you, he'd apply every single possible status effect.  I guess he wasn't just a mage, but a Lich or something?\n\nAnd he had almost 100% magic resistance so spells rarely worked on him, and his AC was good so he was hard to hit.  (Of course, for some reason MABADI ignored magic resistance, and it sucked up all those hit points immediately, so W E R D N A didn't last long if the party fought properly.)\n\nI played 1-3 when they were new.  I remember wanting to play the Return of Werdna after reading about it in a magazine, but never saw it for sale.  It was just a few years ago when I finally discovered it and went to play it.  I didn't spend long with it ... it just didn't seem very good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And Werdna is a mage, so he has virtually nil HP; if you ever run out of monsters, that&amp;#39;s it. He can&amp;#39;t even survive one attack.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And yet in Wizardry 1 he had a massive number of hit points!  And if he hit you, he&amp;#39;d apply every single possible status effect.  I guess he wasn&amp;#39;t just a mage, but a Lich or something?&lt;/p&gt;\n\n&lt;p&gt;And he had almost 100% magic resistance so spells rarely worked on him, and his AC was good so he was hard to hit.  (Of course, for some reason MABADI ignored magic resistance, and it sucked up all those hit points immediately, so W E R D N A didn&amp;#39;t last long if the party fought properly.)&lt;/p&gt;\n\n&lt;p&gt;I played 1-3 when they were new.  I remember wanting to play the Return of Werdna after reading about it in a magazine, but never saw it for sale.  It was just a few years ago when I finally discovered it and went to play it.  I didn&amp;#39;t spend long with it ... it just didn&amp;#39;t seem very good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgepusv", "score_hidden": false, "stickied": false, "created": 1492519543.0, "created_utc": 1492490743.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeouvq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "superfantastic1", "parent_id": "t3_65y81n", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "I saved this post from two years ago. It tells people just how hard the old wizardry titles are. \n\n\"I didn't write this, but the original link is lost somewhere in the archives of the internet.\n\nNone of the RPGs y'all are mentioning are really hard. Yeah, sure NES RPGs were tougher than ones today, but they weren't tough.\n\nYou want to know what was tough? Wizardry was tough. The first three ones were pretty bad. The boss of Wizardry 1, for instance, could do about a hundred damage to your entire party with a single spell, and it's unlikely your mage, cleric or bishop ever got above 60 hp or so, so he'd generally kill half your party in the first round of combat, and the other half next round. Of course, even some of the later random opponents could do that. And then there were the ninjas that could kill your party members automatically on a critical hit. And resurrection only worked sometimes, and often cost you stats. And you only had 8 inventory slots per person, most of which had to be spent on equipment; and even if you had more room, the potions were rare treasures that restored maybe 1-8 HP, and there was no way to restore spells without returning to town. Plus there were the dark zones and the antimagic zones and the spinners and the non-euclidian maps that defied mapping and left you with no way home... And even if you survived all that, you could still die of old age.\n\nBut those first three wizardries were the easy wizardries. It was tough, but you could level up your party and eventually face most of the dangers down. Yeah, sure, a group of ninjas could always ambush you and kill half your party instantly, there was no levelling your way out of that; and random-encounter wizards could kill your entire party very easily if you weren't careful. But you could do something.\n\nWizardry 4 wasn't like that. In Wizardry 4, you get one character, the evil wizard Werdna. You can't level him up normally; instead, you gain 9 levels throughout the game at certain plot points. That's it. No powerlevelling. You don't have a party, either; instead, you can summon monsters to escort you through the dungeon. Some of them have neat abilities, but you can't give them direct orders, ever, so you just have to keep your fingers crossed and hope they do what you want them to. These monsters never level up (though as you advance through your 9 levels of power, you can summon bigger things); and when they die, they're dead. The only way to replace them is to get back to your summoning points, which are few and far apart. And Werdna is a mage, so he has virtually nil HP; if you ever run out of monsters, that's it. He can't even survive one attack.\n\nNow, Werdna, being a mage, does have spells. His magical abilities, once you reach level 9, are awsome beyond comparison. He can cast each level of spells exactly nine times before he runs out and has to recharge at a summoning circle. If he runs out before you reach the circle, that's it; so you have to treat those nine kickass spells like your last skin of water in a desert that goes on for a thousand miles, and probably just has more desert on the other side. That's basically how it works.\n\nOh, and you're up against heroes. Let me tell you about heroes. They don't play fair. They'll take you on six-vs-one without a thought. They have ninjas, of course, who still kill instantly on a critical; they have mages who will cheerfully blast away your entire team in a single attack; they have fighters who get sixteen attacks per round and have enough HP to overflow the register. They have thieves who can hide in combat and steal items that you need to complete the game, in which case you'd better hope that you have a save handy. And when you finally manage to kill them, that scavy-boned cleric in the back row brings them back to life so you can do it again. And, remember, you don't level up through experience in this game, so you don't get anything for any of this.\n\nImagine taking the side of the monsters in a generic random encounter against a party of buffed-up heroes. That's Wizardry 4 for you in a nutshell. But even that is just the beginning. Assume the heroes don't kill you. Assume you manage to avoid running out of spells, your plot-essential items don't get stolen, your monsters stay alive, the enemy ninjas never get critical hits, etc, etc, etc. Fine, all that means is that you get to live long enough to face the puzzles. Wizardry 4 had the hardest riddles any game has ever had. Most of them don't make any sense anyway. Wizardry 4 has mazes that make the unmappable, non-euclidian mazes of Wizardry 1 look like beautifully straight corridors. Wizardry 4 has barrages of questions, any one of which can put the game in an unsolvable state if you get them wrong (without telling you that you've made a mistake, of course.) There's a puzzle that requires you reached the end of the first game to know the solution (without telling you that the solution was at the end of the first game, of course); and that puzzle is right near the end of Wizardry 4, so you could get stuck there after slaving through everything else. And you have to solve all these puzzles while the heroes are killing you.\n\nOh, and in addition to the heroes, you're being chased by the ghost of your old archnemesis Trebor. Trebor is dead, so you can't kill him again through normal means; he just keeps coming back to haunt you. Trebor always knows exactly where you are and chases you through magical means. Also, if Trebor reaches you then you die instantly. Trebor sucks. But by the time you learn about Trebor, you're sort of numb anyway.\n\nWizardry IV is fun, in its own way. Many people think it's the best game in the series. But it is hard. It's hard enough to make grown men cry. It's so hard that nobody has ever been willing to make a remake of it; not even in Japan, where the Wizardry games quite popular, and where they released a new and much easier Wizardry IV (\"Throb Of The Demon's Heart\" IIRC) instead.\n\nYou know the hardest boss you ever faced in any console RPG--the one that really gave you a tough time? The one that actually managed to kill you two or three times, and required a bit of levelling before you could finally bring him down? Well, in his spare time that boss plays Wizardry IV; and he can't get out of the first room.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saved this post from two years ago. It tells people just how hard the old wizardry titles are. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I didn&amp;#39;t write this, but the original link is lost somewhere in the archives of the internet.&lt;/p&gt;\n\n&lt;p&gt;None of the RPGs y&amp;#39;all are mentioning are really hard. Yeah, sure NES RPGs were tougher than ones today, but they weren&amp;#39;t tough.&lt;/p&gt;\n\n&lt;p&gt;You want to know what was tough? Wizardry was tough. The first three ones were pretty bad. The boss of Wizardry 1, for instance, could do about a hundred damage to your entire party with a single spell, and it&amp;#39;s unlikely your mage, cleric or bishop ever got above 60 hp or so, so he&amp;#39;d generally kill half your party in the first round of combat, and the other half next round. Of course, even some of the later random opponents could do that. And then there were the ninjas that could kill your party members automatically on a critical hit. And resurrection only worked sometimes, and often cost you stats. And you only had 8 inventory slots per person, most of which had to be spent on equipment; and even if you had more room, the potions were rare treasures that restored maybe 1-8 HP, and there was no way to restore spells without returning to town. Plus there were the dark zones and the antimagic zones and the spinners and the non-euclidian maps that defied mapping and left you with no way home... And even if you survived all that, you could still die of old age.&lt;/p&gt;\n\n&lt;p&gt;But those first three wizardries were the easy wizardries. It was tough, but you could level up your party and eventually face most of the dangers down. Yeah, sure, a group of ninjas could always ambush you and kill half your party instantly, there was no levelling your way out of that; and random-encounter wizards could kill your entire party very easily if you weren&amp;#39;t careful. But you could do something.&lt;/p&gt;\n\n&lt;p&gt;Wizardry 4 wasn&amp;#39;t like that. In Wizardry 4, you get one character, the evil wizard Werdna. You can&amp;#39;t level him up normally; instead, you gain 9 levels throughout the game at certain plot points. That&amp;#39;s it. No powerlevelling. You don&amp;#39;t have a party, either; instead, you can summon monsters to escort you through the dungeon. Some of them have neat abilities, but you can&amp;#39;t give them direct orders, ever, so you just have to keep your fingers crossed and hope they do what you want them to. These monsters never level up (though as you advance through your 9 levels of power, you can summon bigger things); and when they die, they&amp;#39;re dead. The only way to replace them is to get back to your summoning points, which are few and far apart. And Werdna is a mage, so he has virtually nil HP; if you ever run out of monsters, that&amp;#39;s it. He can&amp;#39;t even survive one attack.&lt;/p&gt;\n\n&lt;p&gt;Now, Werdna, being a mage, does have spells. His magical abilities, once you reach level 9, are awsome beyond comparison. He can cast each level of spells exactly nine times before he runs out and has to recharge at a summoning circle. If he runs out before you reach the circle, that&amp;#39;s it; so you have to treat those nine kickass spells like your last skin of water in a desert that goes on for a thousand miles, and probably just has more desert on the other side. That&amp;#39;s basically how it works.&lt;/p&gt;\n\n&lt;p&gt;Oh, and you&amp;#39;re up against heroes. Let me tell you about heroes. They don&amp;#39;t play fair. They&amp;#39;ll take you on six-vs-one without a thought. They have ninjas, of course, who still kill instantly on a critical; they have mages who will cheerfully blast away your entire team in a single attack; they have fighters who get sixteen attacks per round and have enough HP to overflow the register. They have thieves who can hide in combat and steal items that you need to complete the game, in which case you&amp;#39;d better hope that you have a save handy. And when you finally manage to kill them, that scavy-boned cleric in the back row brings them back to life so you can do it again. And, remember, you don&amp;#39;t level up through experience in this game, so you don&amp;#39;t get anything for any of this.&lt;/p&gt;\n\n&lt;p&gt;Imagine taking the side of the monsters in a generic random encounter against a party of buffed-up heroes. That&amp;#39;s Wizardry 4 for you in a nutshell. But even that is just the beginning. Assume the heroes don&amp;#39;t kill you. Assume you manage to avoid running out of spells, your plot-essential items don&amp;#39;t get stolen, your monsters stay alive, the enemy ninjas never get critical hits, etc, etc, etc. Fine, all that means is that you get to live long enough to face the puzzles. Wizardry 4 had the hardest riddles any game has ever had. Most of them don&amp;#39;t make any sense anyway. Wizardry 4 has mazes that make the unmappable, non-euclidian mazes of Wizardry 1 look like beautifully straight corridors. Wizardry 4 has barrages of questions, any one of which can put the game in an unsolvable state if you get them wrong (without telling you that you&amp;#39;ve made a mistake, of course.) There&amp;#39;s a puzzle that requires you reached the end of the first game to know the solution (without telling you that the solution was at the end of the first game, of course); and that puzzle is right near the end of Wizardry 4, so you could get stuck there after slaving through everything else. And you have to solve all these puzzles while the heroes are killing you.&lt;/p&gt;\n\n&lt;p&gt;Oh, and in addition to the heroes, you&amp;#39;re being chased by the ghost of your old archnemesis Trebor. Trebor is dead, so you can&amp;#39;t kill him again through normal means; he just keeps coming back to haunt you. Trebor always knows exactly where you are and chases you through magical means. Also, if Trebor reaches you then you die instantly. Trebor sucks. But by the time you learn about Trebor, you&amp;#39;re sort of numb anyway.&lt;/p&gt;\n\n&lt;p&gt;Wizardry IV is fun, in its own way. Many people think it&amp;#39;s the best game in the series. But it is hard. It&amp;#39;s hard enough to make grown men cry. It&amp;#39;s so hard that nobody has ever been willing to make a remake of it; not even in Japan, where the Wizardry games quite popular, and where they released a new and much easier Wizardry IV (&amp;quot;Throb Of The Demon&amp;#39;s Heart&amp;quot; IIRC) instead.&lt;/p&gt;\n\n&lt;p&gt;You know the hardest boss you ever faced in any console RPG--the one that really gave you a tough time? The one that actually managed to kill you two or three times, and required a bit of levelling before you could finally bring him down? Well, in his spare time that boss plays Wizardry IV; and he can&amp;#39;t get out of the first room.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgeouvq", "score_hidden": false, "stickied": false, "created": 1492517984.0, "created_utc": 1492489184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3ad", "removal_reason": null, "link_id": "t3_65y81n", "likes": null, "replies": "", "user_reports": [], "id": "dgej88n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tom_Cian", "parent_id": "t3_65y81n", "subreddit_name_prefixed": "r/patientgamers", "controversiality": 0, "body": "[Here's your chance](http://www.virtualapple.org/wizardryivdisk.html).\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.virtualapple.org/wizardryivdisk.html\"&gt;Here&amp;#39;s your chance&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "patientgamers", "name": "t1_dgej88n", "score_hidden": false, "stickied": false, "created": 1492510489.0, "created_utc": 1492481689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]