[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Design", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in 11 grader, I&amp;#39;m behind in credits because I went to a STEM school. Freshmen year I failed physics I never did my homework. Sophomore year I failed all my classes save for engineering which I passed with an A.&lt;/p&gt;\n\n&lt;p&gt;I failed my classes because I hated the students and teachers and their better-than-thou personalities. And I&amp;#39;m also more of a hands-on learner, which is partly why I passed engineering so much better. &lt;/p&gt;\n\n&lt;p&gt;I made up almost all my credits in summer school just fine, and in my new school I&amp;#39;m doing great. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been wanting to get into machining/engineering (prototyping) or UX design. But obviously we have none of those courses in my school. But taking online is an option so I want to know if there are any UX design classes out there. And if there aren&amp;#39;t, I would still like to know how I can start projects to showcase how I work on UX .&lt;/p&gt;\n\n&lt;p&gt;I know that (especially in the world of UX) companies tend to notice that college degrees do not equal wisdom in that subject. So I would like to avoid colleges as a post-secondary education as it takes too much of my time (through having to take unrelated courses and just the overwhelming minimum of 2 years) and too much of my money. &lt;/p&gt;\n\n&lt;p&gt;I already know HTML/CSS/JS profeciently and a bit of Ruby. I also know how to maintain a website, in fact I bought a domain for school projects because it&amp;#39;s super easy to make a website that looks like I put a lot of effort into it when it really only took 30 minutes at most.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m actually more interested in designing physical products than websites, there&amp;#39;s just something alluring about making my own products.&lt;/p&gt;\n\n&lt;p&gt;TL;DR- Are there online courses that offer UX design for highschool credit, and if not where can I go to improve my UX skills? What&amp;#39;s the best path post highschool?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm in 11 grader, I'm behind in credits because I went to a STEM school. Freshmen year I failed physics I never did my homework. Sophomore year I failed all my classes save for engineering which I passed with an A.\n\nI failed my classes because I hated the students and teachers and their better-than-thou personalities. And I'm also more of a hands-on learner, which is partly why I passed engineering so much better. \n\nI made up almost all my credits in summer school just fine, and in my new school I'm doing great. \n\nI've been wanting to get into machining/engineering (prototyping) or UX design. But obviously we have none of those courses in my school. But taking online is an option so I want to know if there are any UX design classes out there. And if there aren't, I would still like to know how I can start projects to showcase how I work on UX .\n\nI know that (especially in the world of UX) companies tend to notice that college degrees do not equal wisdom in that subject. So I would like to avoid colleges as a post-secondary education as it takes too much of my time (through having to take unrelated courses and just the overwhelming minimum of 2 years) and too much of my money. \n\nI already know HTML/CSS/JS profeciently and a bit of Ruby. I also know how to maintain a website, in fact I bought a domain for school projects because it's super easy to make a website that looks like I put a lot of effort into it when it really only took 30 minutes at most.\n\nBut I'm actually more interested in designing physical products than websites, there's just something alluring about making my own products.\n\nTL;DR- Are there online courses that offer UX design for highschool credit, and if not where can I go to improve my UX skills? What's the best path post highschool?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "question", "id": "658qb4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "acorneyes", "saved": false, "mod_reports": [], "name": "t3_658qb4", "subreddit_name_prefixed": "r/Design", "approved_by": null, "over_18": false, "domain": "self.Design", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh78", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Design/comments/658qb4/what_to_do_to_secure_a_job_in_ux_as_a_high_school/", "num_reports": null, "locked": false, "stickied": false, "created": 1492150726.0, "url": "https://www.reddit.com/r/Design/comments/658qb4/what_to_do_to_secure_a_job_in_ux_as_a_high_school/", "author_flair_text": null, "quarantine": false, "title": "What to do to secure a job in UX as a high school student?", "created_utc": 1492121926.0, "distinguished": null, "media": null, "upvote_ratio": 0.6, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh78", "removal_reason": null, "link_id": "t3_658qb4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh78", "removal_reason": null, "link_id": "t3_658qb4", "likes": null, "replies": "", "user_reports": [], "id": "dg9hovj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "orcfull", "parent_id": "t1_dg8dume", "subreddit_name_prefixed": "r/Design", "controversiality": 0, "body": "Please read and reflect on this post OP. \n\nThe way you described your Teachers and peers makes me think you'll really struggle to try go any other route than college. College is humbling, you'll meet people who are way better than you at what you think you're good at and it will do you a world of good. \n\nA key skill in design is communicating, compromising and collaborating. You will not succeed in the world of UX if you don't learn to do that. Where do you learn to do those things? Studying at college. \n\nFor some more specific advice, look into interaction design college courses. It sounds like what you're looking for with a mix of physical digital. If you want to chat about what it's like being an interaction designer, message me. I'm happy to chat. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please read and reflect on this post OP. &lt;/p&gt;\n\n&lt;p&gt;The way you described your Teachers and peers makes me think you&amp;#39;ll really struggle to try go any other route than college. College is humbling, you&amp;#39;ll meet people who are way better than you at what you think you&amp;#39;re good at and it will do you a world of good. &lt;/p&gt;\n\n&lt;p&gt;A key skill in design is communicating, compromising and collaborating. You will not succeed in the world of UX if you don&amp;#39;t learn to do that. Where do you learn to do those things? Studying at college. &lt;/p&gt;\n\n&lt;p&gt;For some more specific advice, look into interaction design college courses. It sounds like what you&amp;#39;re looking for with a mix of physical digital. If you want to chat about what it&amp;#39;s like being an interaction designer, message me. I&amp;#39;m happy to chat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Design", "name": "t1_dg9hovj", "score_hidden": false, "stickied": false, "created": 1492221410.0, "created_utc": 1492192610.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dume", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "time_master", "parent_id": "t3_658qb4", "subreddit_name_prefixed": "r/Design", "controversiality": 0, "body": "Some companies might overlook a prospective employee's lack of formal education if his/her portfolio is truly impressive.\n\nNothing about your post makes me believe your portfolio is at that level. \n\nYour post also makes me think that you'd be difficult to work with: not able to compromise with fellow employees or clients, not able to admit mistakes or take criticism.\n\nIf you truly want to find professional success as a designer, it's clear to me that college will do you a world of good toward that goal. It'll help you be more social, it'll teach you to work on things that you'd rather not be doing, and it'll help you mature. \n\nTo answer your TL;DR:\n\n&gt; Are there online courses that offer UX design for highschool credit?\n\nYou should talk to your HS counselor about that. I believe it's up to your high school (not the institution offering the course) about whether credit will be earned for an outside course.\n\n&gt;  where can I go to improve my UX skills?\n\nCollege is good for this. If you'd rather not, people on this sub recommend Lynda and youtube. You should know, though, that it takes an exceptionally disciplined, highly motivated individual to only utilize online resources in order to become a professional designer.\n\n&gt; What's the best path post highschool?\n\nIt's seriously college. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some companies might overlook a prospective employee&amp;#39;s lack of formal education if his/her portfolio is truly impressive.&lt;/p&gt;\n\n&lt;p&gt;Nothing about your post makes me believe your portfolio is at that level. &lt;/p&gt;\n\n&lt;p&gt;Your post also makes me think that you&amp;#39;d be difficult to work with: not able to compromise with fellow employees or clients, not able to admit mistakes or take criticism.&lt;/p&gt;\n\n&lt;p&gt;If you truly want to find professional success as a designer, it&amp;#39;s clear to me that college will do you a world of good toward that goal. It&amp;#39;ll help you be more social, it&amp;#39;ll teach you to work on things that you&amp;#39;d rather not be doing, and it&amp;#39;ll help you mature. &lt;/p&gt;\n\n&lt;p&gt;To answer your TL;DR:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Are there online courses that offer UX design for highschool credit?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You should talk to your HS counselor about that. I believe it&amp;#39;s up to your high school (not the institution offering the course) about whether credit will be earned for an outside course.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;where can I go to improve my UX skills?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;College is good for this. If you&amp;#39;d rather not, people on this sub recommend Lynda and youtube. You should know, though, that it takes an exceptionally disciplined, highly motivated individual to only utilize online resources in order to become a professional designer.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What&amp;#39;s the best path post highschool?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s seriously college. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Design", "name": "t1_dg8dume", "score_hidden": false, "stickied": false, "created": 1492153621.0, "created_utc": 1492124821.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh78", "removal_reason": null, "link_id": "t3_658qb4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh78", "removal_reason": null, "link_id": "t3_658qb4", "likes": null, "replies": "", "user_reports": [], "id": "dgdewwm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OMFGPALMTREES", "parent_id": "t1_dg8dzxy", "subreddit_name_prefixed": "r/Design", "controversiality": 0, "body": "Industrial designer here, stopped by to say this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Industrial designer here, stopped by to say this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Design", "name": "t1_dgdewwm", "score_hidden": false, "stickied": false, "created": 1492460636.0, "created_utc": 1492431836.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dzxy", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "NJITBrian", "parent_id": "t3_658qb4", "subreddit_name_prefixed": "r/Design", "controversiality": 0, "body": "Hey UX Designer here... \n\n&gt;But I'm actually more interested in designing physical products than websites, there's just something alluring about making my own products.\n\nTo be honest, you probably should look into Industrial Design programs.  They are more about physical product design.  \n\nIf you do want to stay in UX though, look for HCI (Human Computer Interaction) degree programs or do UX Immersive from General Assembly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey UX Designer here... &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But I&amp;#39;m actually more interested in designing physical products than websites, there&amp;#39;s just something alluring about making my own products.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To be honest, you probably should look into Industrial Design programs.  They are more about physical product design.  &lt;/p&gt;\n\n&lt;p&gt;If you do want to stay in UX though, look for HCI (Human Computer Interaction) degree programs or do UX Immersive from General Assembly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Design", "name": "t1_dg8dzxy", "score_hidden": false, "stickied": false, "created": 1492153822.0, "created_utc": 1492125022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh78", "removal_reason": null, "link_id": "t3_658qb4", "likes": null, "replies": "", "user_reports": [], "id": "dg8fpka", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Riimii", "parent_id": "t3_658qb4", "subreddit_name_prefixed": "r/Design", "controversiality": 0, "body": "If you want to design physical products, you will need to go to college. It is virtually unheard of for companies to hire industrial designers or engineers who don't have a college degree in the subject.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you want to design physical products, you will need to go to college. It is virtually unheard of for companies to hire industrial designers or engineers who don&amp;#39;t have a college degree in the subject.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Design", "name": "t1_dg8fpka", "score_hidden": false, "stickied": false, "created": 1492156092.0, "created_utc": 1492127292.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh78", "removal_reason": null, "link_id": "t3_658qb4", "likes": null, "replies": "", "user_reports": [], "id": "dg8tjzp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CX-001", "parent_id": "t3_658qb4", "subreddit_name_prefixed": "r/Design", "controversiality": 0, "body": "The thing a lot of people don't put together is that college - and schooling in general - when done correctly, will teach you how **you** learn. College is just another step in giving you more autonomy, leaving it up to you to fail or succeed at things you've chosen. If you finish you will get more interviews. You will get higher pay than your peers without. And if you did well you might even have a few connections at the end.\n\nA degree will have certain weight when interviewing, but not equal weight across all businesses and locations, as you have surmised. If you choose to go the self-taught route, *don't get stuck on a particular location in your job search*.\n\nBeen watching a lot of my buddies flail around for years because they don't want to get jobs *where they actually exist*. Never stop learning, never stop producing, and search world-wide. That's my advice in this degree-inflated time we live in.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing a lot of people don&amp;#39;t put together is that college - and schooling in general - when done correctly, will teach you how &lt;strong&gt;you&lt;/strong&gt; learn. College is just another step in giving you more autonomy, leaving it up to you to fail or succeed at things you&amp;#39;ve chosen. If you finish you will get more interviews. You will get higher pay than your peers without. And if you did well you might even have a few connections at the end.&lt;/p&gt;\n\n&lt;p&gt;A degree will have certain weight when interviewing, but not equal weight across all businesses and locations, as you have surmised. If you choose to go the self-taught route, &lt;em&gt;don&amp;#39;t get stuck on a particular location in your job search&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Been watching a lot of my buddies flail around for years because they don&amp;#39;t want to get jobs &lt;em&gt;where they actually exist&lt;/em&gt;. Never stop learning, never stop producing, and search world-wide. That&amp;#39;s my advice in this degree-inflated time we live in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Design", "name": "t1_dg8tjzp", "score_hidden": false, "stickied": false, "created": 1492177176.0, "created_utc": 1492148376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh78", "removal_reason": null, "link_id": "t3_658qb4", "likes": null, "replies": "", "user_reports": [], "id": "dg8n7ye", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TobiasOttahal", "parent_id": "t3_658qb4", "subreddit_name_prefixed": "r/Design", "controversiality": 0, "body": "Just remember that UX is about *human behaviour and perception*, which can get into very fuzzy and ambiguous territory. If you become well-versed in that **as well** as the technical aspect of design - you will become a unicorn, and employers will love you.\n\nHowever, in the workplace you will sometimes find that the two may seem like opposites (even though they're not).\n\nI have worked in plenty of places where being a UX designer means constantly having to justify your existence in the face of technical constraints. Engineers who don't have an interest in UX can sometimes get defensive and frustrated with UX-people whom they see as getting in the way of building things.\n\nIf you have a genuine interest in human behaviour, you will succeed. Start with a night course and see if it fits you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just remember that UX is about &lt;em&gt;human behaviour and perception&lt;/em&gt;, which can get into very fuzzy and ambiguous territory. If you become well-versed in that &lt;strong&gt;as well&lt;/strong&gt; as the technical aspect of design - you will become a unicorn, and employers will love you.&lt;/p&gt;\n\n&lt;p&gt;However, in the workplace you will sometimes find that the two may seem like opposites (even though they&amp;#39;re not).&lt;/p&gt;\n\n&lt;p&gt;I have worked in plenty of places where being a UX designer means constantly having to justify your existence in the face of technical constraints. Engineers who don&amp;#39;t have an interest in UX can sometimes get defensive and frustrated with UX-people whom they see as getting in the way of building things.&lt;/p&gt;\n\n&lt;p&gt;If you have a genuine interest in human behaviour, you will succeed. Start with a night course and see if it fits you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Design", "name": "t1_dg8n7ye", "score_hidden": false, "stickied": false, "created": 1492166515.0, "created_utc": 1492137715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]