[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit, &lt;/p&gt;\n\n&lt;p&gt;I am a longtime Reddit user and created this account because I don’t want anyone to find out.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Background&lt;/strong&gt;\nWe met online. We are both college-educated. At the time, he was the definition of a yuppie, and I graduated from a top-ranked liberal arts college but made minimum wage. I went online dating to distract myself from my sorry life. Fast forward a year and half,  &lt;em&gt;we had a monogamous relationship&lt;/em&gt; from the start. We met each other’s families and social circles. Today, I am in grad school with a great summer internship; he remains a yuppie. We had deep discussions on life, values, finances, marriage, and children. He asked what ring I liked a few months ago.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Problem&lt;/strong&gt; \nI discovered tonight that he did not see me attractive in the first three months of dating. At the time, I was his &amp;quot;sexual and social experiment.&amp;quot; Looking back, a part of me always felt I liked him more than he liked me. I have always been more attentive and thoughtful, I called him more, asked how he was doing, initiated marriage discussions.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My emotions&lt;/strong&gt;\nI feel &lt;em&gt;used&lt;/em&gt; and &lt;em&gt;manipulated&lt;/em&gt; he was not into me, but an &lt;em&gt;experiment.&lt;/em&gt; He didn’t find me attractive. I was his sexual and social play thing.  I feel lied and deceived.  I feel disgusted.  My worst fear is that I remain his experiment today. My rationale tells me otherwise.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Seeking advice&lt;/strong&gt;\nShould I sweep this situation under the rug? Confront him? Please advise. Serious comments, only, please.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit&lt;/strong&gt;: Thank you for your comments! It&amp;#39;s always nice to hear from a neutral source. They shed light.  From the gecko of our relationship, he said, I quote, &amp;quot;I&amp;#39;d like to have the relationship run its organic natural course.&amp;quot;  But I feel that genuine feelings of care and &lt;em&gt;love&lt;/em&gt; arose from an unseemly courtship.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi Reddit, \n\nI am a longtime Reddit user and created this account because I don’t want anyone to find out.\n\n**Background**\nWe met online. We are both college-educated. At the time, he was the definition of a yuppie, and I graduated from a top-ranked liberal arts college but made minimum wage. I went online dating to distract myself from my sorry life. Fast forward a year and half,  *we had a monogamous relationship* from the start. We met each other’s families and social circles. Today, I am in grad school with a great summer internship; he remains a yuppie. We had deep discussions on life, values, finances, marriage, and children. He asked what ring I liked a few months ago.\n\n**Problem** \nI discovered tonight that he did not see me attractive in the first three months of dating. At the time, I was his \"sexual and social experiment.\" Looking back, a part of me always felt I liked him more than he liked me. I have always been more attentive and thoughtful, I called him more, asked how he was doing, initiated marriage discussions.\n\n**My emotions**\nI feel *used* and *manipulated* he was not into me, but an *experiment.* He didn’t find me attractive. I was his sexual and social play thing.  I feel lied and deceived.  I feel disgusted.  My worst fear is that I remain his experiment today. My rationale tells me otherwise.\n\n**Seeking advice**\nShould I sweep this situation under the rug? Confront him? Please advise. Serious comments, only, please.\n\n**Edit**: Thank you for your comments! It's always nice to hear from a neutral source. They shed light.  From the gecko of our relationship, he said, I quote, \"I'd like to have the relationship run its organic natural course.\"  But I feel that genuine feelings of care and *love* arose from an unseemly courtship.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vyq7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "castawaylove", "saved": false, "mod_reports": [], "name": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492020661.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/64vyq7/i_27f_discovered_that_my_28m_boyfriend_was/", "num_reports": null, "locked": false, "stickied": false, "created": 1491998846.0, "url": "https://www.reddit.com/r/relationship_advice/comments/64vyq7/i_27f_discovered_that_my_28m_boyfriend_was/", "author_flair_text": null, "quarantine": false, "title": "I [27/f] discovered that my [28/m] boyfriend was unattracted to me in the first three months. We plan on getting married. What can I do?", "created_utc": 1491970046.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg6ajjw", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "castawaylove", "parent_id": "t1_dg5kb5y", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "My relationship is not devoid of love, at least from my end. He was the first to say \"i love you\" if that means anything.  Meanwhile, we are very pragmatic people. I don't think there are red flags as you make them out to be. To me, a marriage has both love and pragmatics of personal finances. I was attracted to his intellectual prowess and confident voice. His humor was a huge bonus. A few months later, I found out his earnings.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My relationship is not devoid of love, at least from my end. He was the first to say &amp;quot;i love you&amp;quot; if that means anything.  Meanwhile, we are very pragmatic people. I don&amp;#39;t think there are red flags as you make them out to be. To me, a marriage has both love and pragmatics of personal finances. I was attracted to his intellectual prowess and confident voice. His humor was a huge bonus. A few months later, I found out his earnings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6ajjw", "score_hidden": false, "stickied": false, "created": 1492049907.0, "created_utc": 1492021107.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5kb5y", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "StrappedDownTight", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You seem overly-focused on status: \"We are both college-educated. At the time, he was the definition of a yuppie, and I graduated from a top-ranked liberal arts college but made minimum wage. I went online dating to distract myself from my sorry life... Today, I am in grad school with a great summer internship; he remains a yuppie.\"\n\nNone of this seems relevant to your problem, so I'd ask why you included it in your post. Are you attracted to him because of his educational/economic status? If so, are you perhaps the one who used him as an experiment? You were unhappy with your life, you went online to find a \"distraction\", and you found someone with more money than you until you got your life together and went to grad school. So many red flags come up here because of all the time you spend talking about these issues instead of love.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem overly-focused on status: &amp;quot;We are both college-educated. At the time, he was the definition of a yuppie, and I graduated from a top-ranked liberal arts college but made minimum wage. I went online dating to distract myself from my sorry life... Today, I am in grad school with a great summer internship; he remains a yuppie.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;None of this seems relevant to your problem, so I&amp;#39;d ask why you included it in your post. Are you attracted to him because of his educational/economic status? If so, are you perhaps the one who used him as an experiment? You were unhappy with your life, you went online to find a &amp;quot;distraction&amp;quot;, and you found someone with more money than you until you got your life together and went to grad school. So many red flags come up here because of all the time you spend talking about these issues instead of love.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5kb5y", "score_hidden": false, "stickied": false, "created": 1492006981.0, "created_utc": 1491978181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5s15k", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "biomech36", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "\"I went online dating to distract myself from my sorry life\".\n\nso he was using you as an experiment and you were using him as a coping mechanism.  if there was any sort of attraction on your part, I would view it as sexual.  guessing man says, you used tinder, which is explicitly known for being a hook-up app.  Now then.  you guys meet, he can fulfill his needs for sex and to have someone by his side during social situations, because being single is so gauche, and you have something that is psychologically telling you that you're wanted by means of physical stimulation brought about by a certain level of intimacy which means something to you, but to much of the male population...not so much.  lot of heterosexual guys, girl says \"strip\", we go for a new speed record.  Now then, fast forward to where we are now, 18 months later.  \"He remains a yuppie\", I cannot express how much I love this term.  It's like the most professional derogatory word on the planet.  I love it.  For the record, do not use the film \"American Psycho\" for your basis on what people do to fit it, however!!  I will say that there are a lot of parts about that relate to \"the yuppie life\".  a constant strive for validation amongst peers by doing the exact same thing they do, but just a tiny bit different.  as well as overly narcissistic extremes.  Tell me, when he proposed, if he did something besides just say \"we should get married\", did he do it around the time friends/colleagues of his were getting married or engaged?  Hm?  Did he ever suggest you change your clothes to better suit how he looks when going out?  Because everything I said, is all true \"yuppie\" behavior.  If those things apply, you are an accessory.  If not, well then you two have developed a pretty nice relationship after fulfilling your own selfish reasons for starting your relationship.  good job. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I went online dating to distract myself from my sorry life&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;so he was using you as an experiment and you were using him as a coping mechanism.  if there was any sort of attraction on your part, I would view it as sexual.  guessing man says, you used tinder, which is explicitly known for being a hook-up app.  Now then.  you guys meet, he can fulfill his needs for sex and to have someone by his side during social situations, because being single is so gauche, and you have something that is psychologically telling you that you&amp;#39;re wanted by means of physical stimulation brought about by a certain level of intimacy which means something to you, but to much of the male population...not so much.  lot of heterosexual guys, girl says &amp;quot;strip&amp;quot;, we go for a new speed record.  Now then, fast forward to where we are now, 18 months later.  &amp;quot;He remains a yuppie&amp;quot;, I cannot express how much I love this term.  It&amp;#39;s like the most professional derogatory word on the planet.  I love it.  For the record, do not use the film &amp;quot;American Psycho&amp;quot; for your basis on what people do to fit it, however!!  I will say that there are a lot of parts about that relate to &amp;quot;the yuppie life&amp;quot;.  a constant strive for validation amongst peers by doing the exact same thing they do, but just a tiny bit different.  as well as overly narcissistic extremes.  Tell me, when he proposed, if he did something besides just say &amp;quot;we should get married&amp;quot;, did he do it around the time friends/colleagues of his were getting married or engaged?  Hm?  Did he ever suggest you change your clothes to better suit how he looks when going out?  Because everything I said, is all true &amp;quot;yuppie&amp;quot; behavior.  If those things apply, you are an accessory.  If not, well then you two have developed a pretty nice relationship after fulfilling your own selfish reasons for starting your relationship.  good job. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5s15k", "score_hidden": false, "stickied": false, "created": 1492028099.0, "created_utc": 1491999299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5mkc5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "8530683641", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "There is no need to confront him but let him know how you feel and hear what he has to say about it. There is possibility that you have assumed worse where it might not be the complete fact so discuss with him and most of the answers you would get from it. If you feel used and manipulated then you should tell him so he can present his side of the story too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no need to confront him but let him know how you feel and hear what he has to say about it. There is possibility that you have assumed worse where it might not be the complete fact so discuss with him and most of the answers you would get from it. If you feel used and manipulated then you should tell him so he can present his side of the story too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5mkc5", "score_hidden": false, "stickied": false, "created": 1492013080.0, "created_utc": 1491984280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5s47p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Steve_Jobs_iGhost", "parent_id": "t1_dg5jsnk", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "As someone who doesn't know how to properly convey how I feel and things, this perfectly describes how my relationship evolved.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who doesn&amp;#39;t know how to properly convey how I feel and things, this perfectly describes how my relationship evolved.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5s47p", "score_hidden": false, "stickied": false, "created": 1492028257.0, "created_utc": 1491999457.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jsnk", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Glewellin", "parent_id": "t1_dg5i28n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If I were feeling generous, I could probably interpet that more as \"I went outside of my comfort zone going for a type I wouldn't normally and was happily surprised with the results.\" That's kind of what it sounds like when translated from foot-in-mouth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I were feeling generous, I could probably interpet that more as &amp;quot;I went outside of my comfort zone going for a type I wouldn&amp;#39;t normally and was happily surprised with the results.&amp;quot; That&amp;#39;s kind of what it sounds like when translated from foot-in-mouth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5jsnk", "score_hidden": false, "stickied": false, "created": 1492005757.0, "created_utc": 1491976957.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5icyb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DONUTGLAZEITFATTY", "parent_id": "t1_dg5i28n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Ooof. That's fucking rough. I'm not sure what to do about it but I've been that \"backup/experiment\" before and I knew I wouldn't be able to trust her or look at her the same again. I tried to continue. She cheated on me. Do with that information what you will", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooof. That&amp;#39;s fucking rough. I&amp;#39;m not sure what to do about it but I&amp;#39;ve been that &amp;quot;backup/experiment&amp;quot; before and I knew I wouldn&amp;#39;t be able to trust her or look at her the same again. I tried to continue. She cheated on me. Do with that information what you will&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5icyb", "score_hidden": false, "stickied": false, "created": 1492002788.0, "created_utc": 1491973988.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5i28n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "castawaylove", "parent_id": "t1_dg5gfw5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He coined the term.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He coined the term.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5i28n", "score_hidden": false, "stickied": false, "created": 1492002223.0, "created_utc": 1491973423.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gfw5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Vendetta5885", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Well, did you coin the term his \"sexual and social experiment\" or did he?\n\nMy instinct is to say, sweep it under the rug if he is attracted to you now, but I think that depends on the answer to the above question.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, did you coin the term his &amp;quot;sexual and social experiment&amp;quot; or did he?&lt;/p&gt;\n\n&lt;p&gt;My instinct is to say, sweep it under the rug if he is attracted to you now, but I think that depends on the answer to the above question.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5gfw5", "score_hidden": false, "stickied": false, "created": 1491999298.0, "created_utc": 1491970498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5tskx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Arcades", "parent_id": "t1_dg5i88s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Why did you snoop?  Communication is essential to a functioning and healthy marriage.  It does not sound like you are ready to be married yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why did you snoop?  Communication is essential to a functioning and healthy marriage.  It does not sound like you are ready to be married yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5tskx", "score_hidden": false, "stickied": false, "created": 1492031073.0, "created_utc": 1492002273.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5ims5", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "pardon_the_mess", "parent_id": "t1_dg5i88s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "What do you think you'll do? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you think you&amp;#39;ll do? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ims5", "score_hidden": false, "stickied": false, "created": 1492003314.0, "created_utc": 1491974514.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5i88s", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "castawaylove", "parent_id": "t1_dg5ght6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": ":-) Thanks- I also wish more people set their post easy to read. \n\nI am not proud to say. I snooped.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:-) Thanks- I also wish more people set their post easy to read. &lt;/p&gt;\n\n&lt;p&gt;I am not proud to say. I snooped.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5i88s", "score_hidden": false, "stickied": false, "created": 1492002547.0, "created_utc": 1491973747.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ght6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pardon_the_mess", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Do you *want* to stay with him? If so, you *have* to have this conversation before getting married, no way around it. How did you discover that you were his \"experiment?\" \n\nPlease, *please* don't stay with him only because you might think you can't do better. Good luck.   \n\n**Edit: By the way, I love how you set up your post. Made it very easy to read and follow. I wish more people did that.**", "edited": 1491971364.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you &lt;em&gt;want&lt;/em&gt; to stay with him? If so, you &lt;em&gt;have&lt;/em&gt; to have this conversation before getting married, no way around it. How did you discover that you were his &amp;quot;experiment?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Please, &lt;em&gt;please&lt;/em&gt; don&amp;#39;t stay with him only because you might think you can&amp;#39;t do better. Good luck.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: By the way, I love how you set up your post. Made it very easy to read and follow. I wish more people did that.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ght6", "score_hidden": false, "stickied": false, "created": 1491999390.0, "created_utc": 1491970590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5nhg1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Deedee1288", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If he likes you now and wants to marry you now, what's the problem?\n\nMost of my long term and serious relationships started out with me not necessarily being attracted to them but then falling love with them over time.  Does it matter what he thought of you in the beginning of the relationship if he wants to be with you now?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he likes you now and wants to marry you now, what&amp;#39;s the problem?&lt;/p&gt;\n\n&lt;p&gt;Most of my long term and serious relationships started out with me not necessarily being attracted to them but then falling love with them over time.  Does it matter what he thought of you in the beginning of the relationship if he wants to be with you now?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5nhg1", "score_hidden": false, "stickied": false, "created": 1492015930.0, "created_utc": 1491987130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5t77u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RubyWooToo", "parent_id": "t1_dg5rz86", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It was an 1980s word meaning \"young urban professional.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was an 1980s word meaning &amp;quot;young urban professional.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5t77u", "score_hidden": false, "stickied": false, "created": 1492030135.0, "created_utc": 1492001335.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rz86", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jamesmichael34", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "What is a yuppie? i think of a guppy every time someone says it. To be honest, relationships shouldn't be based slowly on looks. Looks fade. Sexual wttrsctiveness will go out the window. In some ways, I would argue this makes you guys stronger. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is a yuppie? i think of a guppy every time someone says it. To be honest, relationships shouldn&amp;#39;t be based slowly on looks. Looks fade. Sexual wttrsctiveness will go out the window. In some ways, I would argue this makes you guys stronger. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5rz86", "score_hidden": false, "stickied": false, "created": 1492027996.0, "created_utc": 1491999196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5vgkn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lamamaloca", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "How does he feel now?  You started the relationship for a distraction, he started it as an experiment, that says nothing about the validity of your feelings now.  And if he used you, which I wouldn't agree with, then you used him.  I think your snooping is a bigger issue than his feelings at the very beginning of your relationship. Feelings develop and change over time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does he feel now?  You started the relationship for a distraction, he started it as an experiment, that says nothing about the validity of your feelings now.  And if he used you, which I wouldn&amp;#39;t agree with, then you used him.  I think your snooping is a bigger issue than his feelings at the very beginning of your relationship. Feelings develop and change over time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5vgkn", "score_hidden": false, "stickied": false, "created": 1492033471.0, "created_utc": 1492004671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5xq8q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JellyCream", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I wasn't sure how attracted I was to my wife when we first started dating.  It took me a little while to come around.  I was also considering moving across the country before we started dating and in the early months of our dating.\n\nI decided to put the moving plans on hold to see how things would go with her.   It took me a little while to come around to her, we were vastly different in a lot of areas: she loves sports, is catholic, and is a Republican.   I don't really care about sports, I'm an atheist, and I'd I had to identify politically I'm more liberal. \n\nYou wouldn't think it would work but it does.  We'll be celebrating our third year anniversary in June and have been together for 6 years.   \n\nWhile at first I wasn't sure how I felt about her I now couldn't imagine going through everything we have with anyone else, and I still wouldn't want to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t sure how attracted I was to my wife when we first started dating.  It took me a little while to come around.  I was also considering moving across the country before we started dating and in the early months of our dating.&lt;/p&gt;\n\n&lt;p&gt;I decided to put the moving plans on hold to see how things would go with her.   It took me a little while to come around to her, we were vastly different in a lot of areas: she loves sports, is catholic, and is a Republican.   I don&amp;#39;t really care about sports, I&amp;#39;m an atheist, and I&amp;#39;d I had to identify politically I&amp;#39;m more liberal. &lt;/p&gt;\n\n&lt;p&gt;You wouldn&amp;#39;t think it would work but it does.  We&amp;#39;ll be celebrating our third year anniversary in June and have been together for 6 years.   &lt;/p&gt;\n\n&lt;p&gt;While at first I wasn&amp;#39;t sure how I felt about her I now couldn&amp;#39;t imagine going through everything we have with anyone else, and I still wouldn&amp;#39;t want to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5xq8q", "score_hidden": false, "stickied": false, "created": 1492036307.0, "created_utc": 1492007507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg6hgrq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "justkate2", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Obviously the experiment quote was a bad move on his part, but it's not uncommon for people to feel this way. Analytical people and people who have been burned before (or just some people in general) tend to search for very specific things in a partner. After some time, they may realize that these qualities are too restricting/not as desirable as they initially thought. They \"experiment\" by going outside of their \"type\" and they either decide \"I like this\" or they don't. \n\nMy relationship was like this. In the beginning, I was kind of attracted to my guy, mostly I liked that he's really tall, but it was too easy for me to say that he wasn't the hottest guy I'd been with. But I continued to date him because he wasn't my \"type\" - he's quiet and reserved but a little goofy, where my type was very social and confident - and I wanted to know if the maturity vs \"type\" thing would work out. Ends up my type was not made up of people I wanted to be in long term relationships with. Over time he became more attractive to me because I started to appreciate him more and more. Does he know this? Yes. Did I tell him I wasn't attracted to him and he was an experiment? Hell no. That's a little insensitive. That's like saying \"you should feel so appreciative that I kept you around! Everything worked out!\" Which is crap. \n\nAre you still an experiment? Highly doubtful. If he's admitted to crappy thoughts but wants to marry you, he wants to marry you. But you have to let him know that this really upset you, that you are deeply hurt by it, and that he needs to make it up by not doing shit like that ever again, and by showing you that he loves you, and really does want to be with you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obviously the experiment quote was a bad move on his part, but it&amp;#39;s not uncommon for people to feel this way. Analytical people and people who have been burned before (or just some people in general) tend to search for very specific things in a partner. After some time, they may realize that these qualities are too restricting/not as desirable as they initially thought. They &amp;quot;experiment&amp;quot; by going outside of their &amp;quot;type&amp;quot; and they either decide &amp;quot;I like this&amp;quot; or they don&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;My relationship was like this. In the beginning, I was kind of attracted to my guy, mostly I liked that he&amp;#39;s really tall, but it was too easy for me to say that he wasn&amp;#39;t the hottest guy I&amp;#39;d been with. But I continued to date him because he wasn&amp;#39;t my &amp;quot;type&amp;quot; - he&amp;#39;s quiet and reserved but a little goofy, where my type was very social and confident - and I wanted to know if the maturity vs &amp;quot;type&amp;quot; thing would work out. Ends up my type was not made up of people I wanted to be in long term relationships with. Over time he became more attractive to me because I started to appreciate him more and more. Does he know this? Yes. Did I tell him I wasn&amp;#39;t attracted to him and he was an experiment? Hell no. That&amp;#39;s a little insensitive. That&amp;#39;s like saying &amp;quot;you should feel so appreciative that I kept you around! Everything worked out!&amp;quot; Which is crap. &lt;/p&gt;\n\n&lt;p&gt;Are you still an experiment? Highly doubtful. If he&amp;#39;s admitted to crappy thoughts but wants to marry you, he wants to marry you. But you have to let him know that this really upset you, that you are deeply hurt by it, and that he needs to make it up by not doing shit like that ever again, and by showing you that he loves you, and really does want to be with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6hgrq", "score_hidden": false, "stickied": false, "created": 1492057019.0, "created_utc": 1492028219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5gjzp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "cvega88", "parent_id": "t1_dg5gi1a", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He obviously stuck around and yeah, he chose poor words to describe the first 3 months but that is truly what it is. We all do this subconsciously, we have to qualify someone before committing more time to them ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He obviously stuck around and yeah, he chose poor words to describe the first 3 months but that is truly what it is. We all do this subconsciously, we have to qualify someone before committing more time to them &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5gjzp", "score_hidden": false, "stickied": false, "created": 1491999498.0, "created_utc": 1491970698.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gi1a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cvega88", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think you are being way too over-sensitive and finding ways to justify your emotions. (Which is okay) That said, you should focus on what he feels for you now and where you 2 are headed. The first 3 months of a relationship don't mean anything, if you like or grow to like someone, you keep going. If you dont, you break up.", "edited": 1491970958.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are being way too over-sensitive and finding ways to justify your emotions. (Which is okay) That said, you should focus on what he feels for you now and where you 2 are headed. The first 3 months of a relationship don&amp;#39;t mean anything, if you like or grow to like someone, you keep going. If you dont, you break up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5gi1a", "score_hidden": false, "stickied": false, "created": 1491999401.0, "created_utc": 1491970601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg69ua8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thecardinal74", "parent_id": "t1_dg69hiv", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He, his family, his circle of friends, might have all looked down on people of lower income and liberal beliefs. That's what I mean by an unnecessary bias. \n\nAnd he might have been \"experimenting\" by breaking out of the comfort zone of the same thing everyone else in his social circle was doing.\n\nThen he realized you were wonderful.\n\nI'd recommend having a talk with him. Not a confrontation, just say that you discovered this info and it's really saddened you and you would like to talk it out.\n\nI mean we can speculate all day, but he's the only one with the answer you need", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He, his family, his circle of friends, might have all looked down on people of lower income and liberal beliefs. That&amp;#39;s what I mean by an unnecessary bias. &lt;/p&gt;\n\n&lt;p&gt;And he might have been &amp;quot;experimenting&amp;quot; by breaking out of the comfort zone of the same thing everyone else in his social circle was doing.&lt;/p&gt;\n\n&lt;p&gt;Then he realized you were wonderful.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d recommend having a talk with him. Not a confrontation, just say that you discovered this info and it&amp;#39;s really saddened you and you would like to talk it out.&lt;/p&gt;\n\n&lt;p&gt;I mean we can speculate all day, but he&amp;#39;s the only one with the answer you need&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg69ua8", "score_hidden": false, "stickied": false, "created": 1492049179.0, "created_utc": 1492020379.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69hiv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "castawaylove", "parent_id": "t1_dg5yfrt", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;His experiment showed that he was being &gt;unnecessarily biased to people of other lifestyles.\n\nHe did say he wanted to keep an open mind in the beginning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;His experiment showed that he was being &amp;gt;unnecessarily biased to people of other lifestyles.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He did say he wanted to keep an open mind in the beginning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg69hiv", "score_hidden": false, "stickied": false, "created": 1492048812.0, "created_utc": 1492020012.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yfrt", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Thecardinal74", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "if he's marrying you it's because he looked past your liberalism, lower income, and other factors that would have otherwise turned him off, and saw the real you, and fell in love with you.\n\nHis experiment showed that he was being unnecessarily biased to people of other lifestyles.\n\nIt's not an experiment if he wants to marry you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if he&amp;#39;s marrying you it&amp;#39;s because he looked past your liberalism, lower income, and other factors that would have otherwise turned him off, and saw the real you, and fell in love with you.&lt;/p&gt;\n\n&lt;p&gt;His experiment showed that he was being unnecessarily biased to people of other lifestyles.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not an experiment if he wants to marry you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5yfrt", "score_hidden": false, "stickied": false, "created": 1492037131.0, "created_utc": 1492008331.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5qtr1", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "TomCt", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It would probably have been easy to have told you lies about how he felt about you when you met, at least you have an honest man who can be open with you about these sorts of things. It does not matter how and why you met or what you felt before you got to know each other, he knows you now and loves you. You were both different people back then and it is who you are now that matters.\nAs a bit of background I told my fiancee that I was only interested in being friends with benefits when I first met her 8 years ago, I have been honest with her about why and what it was in her that made me change my mind and suggest a proper relationship - this level of honesty has helped out relationship more than any pretense of 'love at first sight' would have done.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would probably have been easy to have told you lies about how he felt about you when you met, at least you have an honest man who can be open with you about these sorts of things. It does not matter how and why you met or what you felt before you got to know each other, he knows you now and loves you. You were both different people back then and it is who you are now that matters.\nAs a bit of background I told my fiancee that I was only interested in being friends with benefits when I first met her 8 years ago, I have been honest with her about why and what it was in her that made me change my mind and suggest a proper relationship - this level of honesty has helped out relationship more than any pretense of &amp;#39;love at first sight&amp;#39; would have done.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5qtr1", "score_hidden": false, "stickied": false, "created": 1492025605.0, "created_utc": 1491996805.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64vyq7", "likes": null, "replies": "", "user_reports": [], "id": "dg5sbyn", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "KateLDNSE1", "parent_id": "t3_64vyq7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Hmm. Sometimes attraction takes a while to develop. It is quite mean for him to tell you though, and for him to phrase it the way that he did. If you love and trust one another, this shouldn't be that big a deal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm. Sometimes attraction takes a while to develop. It is quite mean for him to tell you though, and for him to phrase it the way that he did. If you love and trust one another, this shouldn&amp;#39;t be that big a deal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5sbyn", "score_hidden": false, "stickied": false, "created": 1492028656.0, "created_utc": 1491999856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]