[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is my first time doing one of these, but I don&amp;#39;t know what else to do. To start this off, I am mentally broken and cannot rationalize a plan for myself and do not know how to move forward.  My SO and I have been dating for a year and it has been absolutely amazing. We have clicked from the beginning and I love her very much. Her and I started having unprotected sex after about 1 month. She had recently had an IUD put in and so pregnancy was not an issue. We had a conversation about this and it seemed like an ample opportunity for her to bring up any concerns she had. Her and I think the same, enjoy a lot of the same activities, and have become best friends over the year. Our relationship progressed much faster than most because her father passed away 2 months into our relationship. On top of that she made a major career shift and other changes in her social life. I have been by her side and aided her through so much! (Including a severe heat stroke.) While going through this I have given her all my love and been completely honest with her about everything. (Sometimes too honest, but honest.) In her defense, it has not been completely one-sided. I have been dealing with depression and other mental obstacles involving my life and career decisions. She has been a support beam for me and my #1 fan. Always encouraging me to follow my passion and do what makes me happy. About 4 months ago, she was going to book a flight to Europe with a friend because tickets were at a great price, but the friend bailed on her. I opted to go with her even though it was not necessarily the wisest financial decision. I saw at is a great life and relationship opportunity. Fast forward to now. We just had our 1 year anniversary and will be flying to Europe at the end of the month. Two nights ago I told her my lower region has been itching since Saturday. This wasn&amp;#39;t the first time I had experienced this feeling, but in the past it was caused by not enough lubrication and there being rubbed down sores, so I wasn&amp;#39;t worried. (Even though this time was slightly different looking and lasting longer than ever before.) Because I knew I was clean and thought I knew she was as well.... Well last night, she sat me down. I thought she was going to make me meditate with her. Until she started to cry. This is when she told me she has genital herpes and has had it for about 6 years. 6 years!!!! At first I was alright. I don&amp;#39;t like to see her cry. We chatted about it a bit. She said she &amp;quot;forgot&amp;quot; she had it because she hadn&amp;#39;t had an outbreak in years. After a short talk we got ready for bed. As I was laying there it started to sink in. It is still sinking in. I feel sad. Angry. Betrayed. Helpless. She has spit out so many excuses and I just don&amp;#39;t want to hear it. I don&amp;#39;t understand how she could do this to me. I love this girl, but I don&amp;#39;t know how to move forward. I am going to get tested soon and see a counselor next week. I don&amp;#39;t know if I still want to go to Europe with her. I can get 90% of my money back because we got flight insurance, but I was really looking forward to this trip. I just cannot be around her right now. We were also planning on moving in together at the end of May... I feel like by not telling me, she took away any control I had. Telling me from the get go at least allows me to make the decision for myself, as an adult, on how I want to move forward. She waited until after she was pretty much sure I had it to tell me. She is not cruel or malicious in any form whatsoever. I never saw this coming. She is one of the most caring and kind hearted people I know. But man I feel like a I got fucked over.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: SO, love of my life, told me after a year she had herpes. Pretty sure I have it now. Travelling together soon. I am a mental mess. Don&amp;#39;t know how to move forward.&lt;/p&gt;\n\n&lt;p&gt;Edit 1: I really appreciate the feedback I am getting. I am fairly introverted and do not have many people to talk to about this. I am also a pretty optimostic and light-hearted, so I am trying to make the best of my current shitty situation. It is good to see people&amp;#39;s opinions from both ends of the spectrum. It helps me realize where my emotions and thoughts fall on it. I would never sue her. That would not make me feel better at all. I am not sure how long it will take me to make this decision. Which is scary with Europe approaching. I was really looking forward to the trip, but now I am unsure whether I want to still go through with it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is my first time doing one of these, but I don't know what else to do. To start this off, I am mentally broken and cannot rationalize a plan for myself and do not know how to move forward.  My SO and I have been dating for a year and it has been absolutely amazing. We have clicked from the beginning and I love her very much. Her and I started having unprotected sex after about 1 month. She had recently had an IUD put in and so pregnancy was not an issue. We had a conversation about this and it seemed like an ample opportunity for her to bring up any concerns she had. Her and I think the same, enjoy a lot of the same activities, and have become best friends over the year. Our relationship progressed much faster than most because her father passed away 2 months into our relationship. On top of that she made a major career shift and other changes in her social life. I have been by her side and aided her through so much! (Including a severe heat stroke.) While going through this I have given her all my love and been completely honest with her about everything. (Sometimes too honest, but honest.) In her defense, it has not been completely one-sided. I have been dealing with depression and other mental obstacles involving my life and career decisions. She has been a support beam for me and my #1 fan. Always encouraging me to follow my passion and do what makes me happy. About 4 months ago, she was going to book a flight to Europe with a friend because tickets were at a great price, but the friend bailed on her. I opted to go with her even though it was not necessarily the wisest financial decision. I saw at is a great life and relationship opportunity. Fast forward to now. We just had our 1 year anniversary and will be flying to Europe at the end of the month. Two nights ago I told her my lower region has been itching since Saturday. This wasn't the first time I had experienced this feeling, but in the past it was caused by not enough lubrication and there being rubbed down sores, so I wasn't worried. (Even though this time was slightly different looking and lasting longer than ever before.) Because I knew I was clean and thought I knew she was as well.... Well last night, she sat me down. I thought she was going to make me meditate with her. Until she started to cry. This is when she told me she has genital herpes and has had it for about 6 years. 6 years!!!! At first I was alright. I don't like to see her cry. We chatted about it a bit. She said she \"forgot\" she had it because she hadn't had an outbreak in years. After a short talk we got ready for bed. As I was laying there it started to sink in. It is still sinking in. I feel sad. Angry. Betrayed. Helpless. She has spit out so many excuses and I just don't want to hear it. I don't understand how she could do this to me. I love this girl, but I don't know how to move forward. I am going to get tested soon and see a counselor next week. I don't know if I still want to go to Europe with her. I can get 90% of my money back because we got flight insurance, but I was really looking forward to this trip. I just cannot be around her right now. We were also planning on moving in together at the end of May... I feel like by not telling me, she took away any control I had. Telling me from the get go at least allows me to make the decision for myself, as an adult, on how I want to move forward. She waited until after she was pretty much sure I had it to tell me. She is not cruel or malicious in any form whatsoever. I never saw this coming. She is one of the most caring and kind hearted people I know. But man I feel like a I got fucked over.\n\nTL;DR: SO, love of my life, told me after a year she had herpes. Pretty sure I have it now. Travelling together soon. I am a mental mess. Don't know how to move forward.\n\nEdit 1: I really appreciate the feedback I am getting. I am fairly introverted and do not have many people to talk to about this. I am also a pretty optimostic and light-hearted, so I am trying to make the best of my current shitty situation. It is good to see people's opinions from both ends of the spectrum. It helps me realize where my emotions and thoughts fall on it. I would never sue her. That would not make me feel better at all. I am not sure how long it will take me to make this decision. Which is scary with Europe approaching. I was really looking forward to the trip, but now I am unsure whether I want to still go through with it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64w7gg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 50, "report_reasons": null, "author": "JFKnower", "saved": false, "mod_reports": [], "name": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492029222.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/64w7gg/so25f_told_me25m_they_have_herpes_3_weeks_before/", "num_reports": null, "locked": false, "stickied": false, "created": 1492002257.0, "url": "https://www.reddit.com/r/relationship_advice/comments/64w7gg/so25f_told_me25m_they_have_herpes_3_weeks_before/", "author_flair_text": null, "quarantine": false, "title": "SO(25f) told me(25m) they have herpes, 3 weeks before we go to Europe and 6 weeks before moving in together. I think I contracted it and don't know what to do. How do I move forward?", "created_utc": 1491973457.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 46, "visited": false, "subreddit_type": "public", "ups": 50}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5lfby", "gilded": 0, "archived": false, "score": 61, "report_reasons": null, "author": "SweetSpringLamb", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "A few days into dating, I wrote my boyfriend a letter and told him that I had herpes. It was very important to me that he knew that so that he could make his own decision on whether or not he wanted to expose himself to it. \n\nAfter he read my letter he wrapped his arms around me and told me it didn't matter. He wanted me anyways. That was 3 years ago. \n\nGiving your partner that information so that they can make their own decision is just the decent thing to do. What your girlfriend did was shifty and wrong. It's not fair of her to have taken that away from you. It's just downright disrespectful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A few days into dating, I wrote my boyfriend a letter and told him that I had herpes. It was very important to me that he knew that so that he could make his own decision on whether or not he wanted to expose himself to it. &lt;/p&gt;\n\n&lt;p&gt;After he read my letter he wrapped his arms around me and told me it didn&amp;#39;t matter. He wanted me anyways. That was 3 years ago. &lt;/p&gt;\n\n&lt;p&gt;Giving your partner that information so that they can make their own decision is just the decent thing to do. What your girlfriend did was shifty and wrong. It&amp;#39;s not fair of her to have taken that away from you. It&amp;#39;s just downright disrespectful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5lfby", "score_hidden": false, "stickied": false, "created": 1492009837.0, "created_utc": 1491981037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 61}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5kzwe", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "datsunblue", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Lying by omission. IMO she had to have remembered that she had genital herpes pretty much everytime that she chose to be intimate with you. It is unfortunate and sure you should think about what is in your best interest at this juncture. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lying by omission. IMO she had to have remembered that she had genital herpes pretty much everytime that she chose to be intimate with you. It is unfortunate and sure you should think about what is in your best interest at this juncture. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5kzwe", "score_hidden": false, "stickied": false, "created": 1492008700.0, "created_utc": 1491979900.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5keeg", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "Diablo165", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'd consider it a breach of trust, and I'd reevaluate my relationship. This person knowingly exposed you to an STD without your knowledge or consent.\n\nFor a year.\n\nThat's actually against the law, some places.\n\nSo...decide if you can trust her. Then decide if you can forgive her. Because if you're harboring resentment over this, your relationship's going to suck.\n\nI dunno what to tell you. A girlfriend from a couple of years ago disclosed it to me after we'd had sex. I didn't appreciate my health being put at risk, and...well, she's an ex.\n\nI got to experience the joy of 4 months of worrying over whether or not I had it (yes, it's a skin condition. And it's also painful, and if this relationship doesn't work out, YOU are now responsible for warning potential partners before sex, which will cost you options) before I came up negative.\n\nSince then, I won't have sex with anyone without clean, recent test results. And STDs are a dealbreaker.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d consider it a breach of trust, and I&amp;#39;d reevaluate my relationship. This person knowingly exposed you to an STD without your knowledge or consent.&lt;/p&gt;\n\n&lt;p&gt;For a year.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s actually against the law, some places.&lt;/p&gt;\n\n&lt;p&gt;So...decide if you can trust her. Then decide if you can forgive her. Because if you&amp;#39;re harboring resentment over this, your relationship&amp;#39;s going to suck.&lt;/p&gt;\n\n&lt;p&gt;I dunno what to tell you. A girlfriend from a couple of years ago disclosed it to me after we&amp;#39;d had sex. I didn&amp;#39;t appreciate my health being put at risk, and...well, she&amp;#39;s an ex.&lt;/p&gt;\n\n&lt;p&gt;I got to experience the joy of 4 months of worrying over whether or not I had it (yes, it&amp;#39;s a skin condition. And it&amp;#39;s also painful, and if this relationship doesn&amp;#39;t work out, YOU are now responsible for warning potential partners before sex, which will cost you options) before I came up negative.&lt;/p&gt;\n\n&lt;p&gt;Since then, I won&amp;#39;t have sex with anyone without clean, recent test results. And STDs are a dealbreaker.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5keeg", "score_hidden": false, "stickied": false, "created": 1492007200.0, "created_utc": 1491978400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5wdfr", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "savvyxxl", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I don't want to sound like an asshole but you dont just forget about these things. Women are very mindful of their body, i would say much more than men. She was probably embarrassed or ashamed and either A. thought because it had been a while that it may never come up again and she'll never have to talk about it or B. she didnt want to tell you and miss out on a relationship in fear that every time she tells someone at the beginning of dating they will immediately up and leave her. Cuz lets be honest in the first couple weeks of getting to know someone if they tell you they have herpes you're prettttty likely to just bail and rightfully so. BUT if you're months in or a year in in your case and in love with the girl you're less like to leave.... She kind of trapped you either way. You may love her and she may be a nice girl but she definitely changed your life and like you said took your control. Whether she remembered or not it was super irresponsible and shitty to do and now you get to pay for it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want to sound like an asshole but you dont just forget about these things. Women are very mindful of their body, i would say much more than men. She was probably embarrassed or ashamed and either A. thought because it had been a while that it may never come up again and she&amp;#39;ll never have to talk about it or B. she didnt want to tell you and miss out on a relationship in fear that every time she tells someone at the beginning of dating they will immediately up and leave her. Cuz lets be honest in the first couple weeks of getting to know someone if they tell you they have herpes you&amp;#39;re prettttty likely to just bail and rightfully so. BUT if you&amp;#39;re months in or a year in in your case and in love with the girl you&amp;#39;re less like to leave.... She kind of trapped you either way. You may love her and she may be a nice girl but she definitely changed your life and like you said took your control. Whether she remembered or not it was super irresponsible and shitty to do and now you get to pay for it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5wdfr", "score_hidden": false, "stickied": false, "created": 1492034660.0, "created_utc": 1492005860.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5mdrn", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "TheSrWrangler", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That's a serious breech of trust. She put you at risk with her eyes open and mouth closed. That is not something to base a relationship on. I would not continue the relationship, if it was me. I'm so sorry this happened to you. Hope you'll be okay - with any luck you could have not gotten this illness. Good luck at the doctors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a serious breech of trust. She put you at risk with her eyes open and mouth closed. That is not something to base a relationship on. I would not continue the relationship, if it was me. I&amp;#39;m so sorry this happened to you. Hope you&amp;#39;ll be okay - with any luck you could have not gotten this illness. Good luck at the doctors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5mdrn", "score_hidden": false, "stickied": false, "created": 1492012540.0, "created_utc": 1491983740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg6ht3w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deimosian", "parent_id": "t1_dg5pay7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;BTW, you might want to post in r/legaladvice. I believe that you can actually sue for someone knowingly passing you an STD nowadays. While I am not in favor of suing folks for the hell of it, this is a situation to where she was negligent and will probably do it again to her next partner/victim.\n\nIn some places it is even an actual crime, not just a civil matter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;BTW, you might want to post in &lt;a href=\"/r/legaladvice\"&gt;r/legaladvice&lt;/a&gt;. I believe that you can actually sue for someone knowingly passing you an STD nowadays. While I am not in favor of suing folks for the hell of it, this is a situation to where she was negligent and will probably do it again to her next partner/victim.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In some places it is even an actual crime, not just a civil matter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6ht3w", "score_hidden": false, "stickied": false, "created": 1492057365.0, "created_utc": 1492028565.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pay7", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "wtfeva", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You don't go raw after a freaking month without being tested, no matter how much you 'love' someone.\n\nShe gave you an incurable STD. She could've told you and you could've remained in a relationship while taking precautions to prevent transmission. That is a huge thing to hide from you and doesn't bode well for the relationship. \n\nIf someone is willing to risk your health and well-being on your behalf without you even knowing (despite how idiotic you were to even bang them unprotected), then they are self-centered narcissists. I mean, obviously you only want to be with them!\n\nBTW, you might want to post in r/legaladvice. I believe that you can actually sue for someone knowingly passing you an STD nowadays. While I am not in favor of suing folks for the hell of it, this is a situation to where she was negligent and will probably do it again to her next partner/victim.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t go raw after a freaking month without being tested, no matter how much you &amp;#39;love&amp;#39; someone.&lt;/p&gt;\n\n&lt;p&gt;She gave you an incurable STD. She could&amp;#39;ve told you and you could&amp;#39;ve remained in a relationship while taking precautions to prevent transmission. That is a huge thing to hide from you and doesn&amp;#39;t bode well for the relationship. &lt;/p&gt;\n\n&lt;p&gt;If someone is willing to risk your health and well-being on your behalf without you even knowing (despite how idiotic you were to even bang them unprotected), then they are self-centered narcissists. I mean, obviously you only want to be with them!&lt;/p&gt;\n\n&lt;p&gt;BTW, you might want to post in &lt;a href=\"/r/legaladvice\"&gt;r/legaladvice&lt;/a&gt;. I believe that you can actually sue for someone knowingly passing you an STD nowadays. While I am not in favor of suing folks for the hell of it, this is a situation to where she was negligent and will probably do it again to her next partner/victim.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5pay7", "score_hidden": false, "stickied": false, "created": 1492021623.0, "created_utc": 1491992823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5y9ip", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SeamlessYellow", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "These kind of people trickle truths all throughout the relationship. This is just the beginning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These kind of people trickle truths all throughout the relationship. This is just the beginning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5y9ip", "score_hidden": false, "stickied": false, "created": 1492036933.0, "created_utc": 1492008133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg621b9", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "ryanknapper", "parent_id": "t1_dg5kmhq", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; It's not the herpes, it's the lying.\n\nIt's also the herpes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s not the herpes, it&amp;#39;s the lying.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s also the herpes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg621b9", "score_hidden": false, "stickied": false, "created": 1492041130.0, "created_utc": 1492012330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5qvzz", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "king-schultz", "parent_id": "t1_dg5kmhq", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It's both, plus a lot more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s both, plus a lot more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5qvzz", "score_hidden": false, "stickied": false, "created": 1492025744.0, "created_utc": 1491996944.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg678dp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Diablo165", "parent_id": "t1_dg5kmhq", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;It's not the herpes, it's the lying.\n&gt;&gt;It's both, plus a lot more\n&gt;&gt;&gt;It's also the herpes.\n\nSo, it's the herpes, the lying, AND a lot more. Also the herpes.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s not the herpes, it&amp;#39;s the lying.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s both, plus a lot more&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s also the herpes.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So, it&amp;#39;s the herpes, the lying, AND a lot more. Also the herpes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg678dp", "score_hidden": false, "stickied": false, "created": 1492046549.0, "created_utc": 1492017749.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5kmhq", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "StrappedDownTight", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It's not the herpes, it's the lying. If I were you, I'd be worried about what else she's kept hidden all this time. What other secrets does she have hidden that she will only disclose once she gets caught? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not the herpes, it&amp;#39;s the lying. If I were you, I&amp;#39;d be worried about what else she&amp;#39;s kept hidden all this time. What other secrets does she have hidden that she will only disclose once she gets caught? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5kmhq", "score_hidden": false, "stickied": false, "created": 1492007757.0, "created_utc": 1491978957.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg6057s", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Nerouin", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Dreadful. Horrible breach of trust. She knowingly exposed you to an incurable disease without your prior knowledge or consent. However much chemistry you two have, however much you enjoy each other, what she did speaks terribly of her character, and I would end this relationship were I in your place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dreadful. Horrible breach of trust. She knowingly exposed you to an incurable disease without your prior knowledge or consent. However much chemistry you two have, however much you enjoy each other, what she did speaks terribly of her character, and I would end this relationship were I in your place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6057s", "score_hidden": false, "stickied": false, "created": 1492039051.0, "created_utc": 1492010251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg61pye", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "stfurtfm", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm really sorry you're in that situation.  It's not really the herpes that worries me, it's what else she could be lying about (including lying by not telling you/omission).\n\nMy wife hid her BPD and depression from me until we were engaged for 9 months, 6 months before we were to get married.  Her brother's girlfriend told me.  Her sister thought we talked about it, even her brother thought I was aware of it.  \n\nI asked why she hid it from me, she said she didn't think it was important, it was from a bad time in her youth, and it was painful for her to recall it.\n\nI thought I could put up with it, even work around it.  I thought I could forgive her, but 8 years later I have found I can't. I still have doubts.\n\nSave yourself the time and worry.  I think you know where I'm going with it...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really sorry you&amp;#39;re in that situation.  It&amp;#39;s not really the herpes that worries me, it&amp;#39;s what else she could be lying about (including lying by not telling you/omission).&lt;/p&gt;\n\n&lt;p&gt;My wife hid her BPD and depression from me until we were engaged for 9 months, 6 months before we were to get married.  Her brother&amp;#39;s girlfriend told me.  Her sister thought we talked about it, even her brother thought I was aware of it.  &lt;/p&gt;\n\n&lt;p&gt;I asked why she hid it from me, she said she didn&amp;#39;t think it was important, it was from a bad time in her youth, and it was painful for her to recall it.&lt;/p&gt;\n\n&lt;p&gt;I thought I could put up with it, even work around it.  I thought I could forgive her, but 8 years later I have found I can&amp;#39;t. I still have doubts.&lt;/p&gt;\n\n&lt;p&gt;Save yourself the time and worry.  I think you know where I&amp;#39;m going with it...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg61pye", "score_hidden": false, "stickied": false, "created": 1492040784.0, "created_utc": 1492011984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg6esg8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xxx123xx1", "parent_id": "t1_dg6djgz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "had symptoms for over 3 years and I'm not of African descent so that's not completely true. Caught it from my S.O. who hadn't had any symptoms in years as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;had symptoms for over 3 years and I&amp;#39;m not of African descent so that&amp;#39;s not completely true. Caught it from my S.O. who hadn&amp;#39;t had any symptoms in years as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6esg8", "score_hidden": false, "stickied": false, "created": 1492054280.0, "created_utc": 1492025480.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg6ewei", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xxx123xx1", "parent_id": "t1_dg6djgz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Also, that wasn't my point. I was talking about that you don't forget you have it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, that wasn&amp;#39;t my point. I was talking about that you don&amp;#39;t forget you have it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6ewei", "score_hidden": false, "stickied": false, "created": 1492054389.0, "created_utc": 1492025589.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6djgz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VivVulpesVulpes", "parent_id": "t1_dg66cbf", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "HPV passes. You most likely don't \"have\" it anymore. 90% of infections are fought off by your body within two years, 70% within one year. If you are of African descent, it may hang on longer, but generally it's gone after 2 years. Mine cleared in a matter of months when I got tested, which my doc said was normal for healthy, young,  white women. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;HPV passes. You most likely don&amp;#39;t &amp;quot;have&amp;quot; it anymore. 90% of infections are fought off by your body within two years, 70% within one year. If you are of African descent, it may hang on longer, but generally it&amp;#39;s gone after 2 years. Mine cleared in a matter of months when I got tested, which my doc said was normal for healthy, young,  white women. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6djgz", "score_hidden": false, "stickied": false, "created": 1492052992.0, "created_utc": 1492024192.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66cbf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "xxx123xx1", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I contracted HPV from my partner, which really doesn't compare to herpes. It has been years since I got it and a long time since I had any symptoms but at no point have I \"forgotten\" that I have it. I never would.\nShe lied about forgetting about it, she just didn't want to tell you. Legally she is responsible to tell you that she has a STD and knew about it and should have told you before engaging in sexual activities.\n\nedited for grammar", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I contracted HPV from my partner, which really doesn&amp;#39;t compare to herpes. It has been years since I got it and a long time since I had any symptoms but at no point have I &amp;quot;forgotten&amp;quot; that I have it. I never would.\nShe lied about forgetting about it, she just didn&amp;#39;t want to tell you. Legally she is responsible to tell you that she has a STD and knew about it and should have told you before engaging in sexual activities.&lt;/p&gt;\n\n&lt;p&gt;edited for grammar&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg66cbf", "score_hidden": false, "stickied": false, "created": 1492045650.0, "created_utc": 1492016850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5n6az", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "justine7179", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think it's a little fucked up to tell you that she has herpes after being together for a year, in my opinion. It seems like you guys have a great relationship though, so I would consider staying on for the long haul, considering my own experience.\n\nMy boyfriend told me one day, and asked if I was ok with it. I knew it wasn't a life ending ordeal, and if I got herpes, so be it. Yeah, I would be upset but herpes (a not so rare skin condition) is really not the end of the world. We ended up having sex a few weeks later and I'm so glad I made the decision to stay with him. \n\nAn STD does not define a person. I'm the happiest I've ever been with this man, and I don't give a fuck that he has herpes. Buuuut he did tell me before we even had sex, and made sure that I was ok with the risk involved. It seems like this woman is a bit selfish with her health affecting people, so I would take a step back and consider if she is right for you. You definitely need to talk this over with her and explain how you feel about the situation. It won't be easy by any means, but you'll have your answer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s a little fucked up to tell you that she has herpes after being together for a year, in my opinion. It seems like you guys have a great relationship though, so I would consider staying on for the long haul, considering my own experience.&lt;/p&gt;\n\n&lt;p&gt;My boyfriend told me one day, and asked if I was ok with it. I knew it wasn&amp;#39;t a life ending ordeal, and if I got herpes, so be it. Yeah, I would be upset but herpes (a not so rare skin condition) is really not the end of the world. We ended up having sex a few weeks later and I&amp;#39;m so glad I made the decision to stay with him. &lt;/p&gt;\n\n&lt;p&gt;An STD does not define a person. I&amp;#39;m the happiest I&amp;#39;ve ever been with this man, and I don&amp;#39;t give a fuck that he has herpes. Buuuut he did tell me before we even had sex, and made sure that I was ok with the risk involved. It seems like this woman is a bit selfish with her health affecting people, so I would take a step back and consider if she is right for you. You definitely need to talk this over with her and explain how you feel about the situation. It won&amp;#39;t be easy by any means, but you&amp;#39;ll have your answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5n6az", "score_hidden": false, "stickied": false, "created": 1492014965.0, "created_utc": 1491986165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5vm5m", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bmwhooligan", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Ask her when she found out she got herpes and does she know who she got it from? This seems like something she should've told you BEFORE you slept together. \n\nI'd stop having sex with her and I wouldn't move in together. Do whatever you can to not move in with her. Maybe back out of the trip too. If this is how she handles a textbook situation, what's going to happen when something serious comes along in life. News flash - she won't be able to handle much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ask her when she found out she got herpes and does she know who she got it from? This seems like something she should&amp;#39;ve told you BEFORE you slept together. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d stop having sex with her and I wouldn&amp;#39;t move in together. Do whatever you can to not move in with her. Maybe back out of the trip too. If this is how she handles a textbook situation, what&amp;#39;s going to happen when something serious comes along in life. News flash - she won&amp;#39;t be able to handle much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5vm5m", "score_hidden": false, "stickied": false, "created": 1492033679.0, "created_utc": 1492004879.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg66jo3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "foamster", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Caring and kind hearted people would be horrified at the thought of spreading herpes to someone they love. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Caring and kind hearted people would be horrified at the thought of spreading herpes to someone they love. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg66jo3", "score_hidden": false, "stickied": false, "created": 1492045860.0, "created_utc": 1492017060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5kj9g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Claclink520", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This is worse than cheating.  She is a selfish person.  There is no recovery from this for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is worse than cheating.  She is a selfish person.  There is no recovery from this for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5kj9g", "score_hidden": false, "stickied": false, "created": 1492007534.0, "created_utc": 1491978734.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg62a2y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ryanknapper", "parent_id": "t1_dg5s6vw", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Hey OP, /u/the_bum_hammer is harsh, and maybe a little rude, but you probably need the smack in the face.  This woman intentionally exposed you to an incurable disease.  If it doesn't work out with her you will have to have this conversation with every sexual partner you ever have, for the rest of your life.\n\nGet to a doctor, get yourself tested every month for a year, and move on from this relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP, &lt;a href=\"/u/the_bum_hammer\"&gt;/u/the_bum_hammer&lt;/a&gt; is harsh, and maybe a little rude, but you probably need the smack in the face.  This woman intentionally exposed you to an incurable disease.  If it doesn&amp;#39;t work out with her you will have to have this conversation with every sexual partner you ever have, for the rest of your life.&lt;/p&gt;\n\n&lt;p&gt;Get to a doctor, get yourself tested every month for a year, and move on from this relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg62a2y", "score_hidden": false, "stickied": false, "created": 1492041393.0, "created_utc": 1492012593.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5tye7", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t1_dg5s6vw", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "No amount of voting me down will make your herpes have less outbreaks.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No amount of voting me down will make your herpes have less outbreaks.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5tye7", "score_hidden": false, "stickied": false, "created": 1492031324.0, "created_utc": 1492002524.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5vdef", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t1_dg5v8nu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Haha!  Down voting is when I get to insult people more, but thank you!  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha!  Down voting is when I get to insult people more, but thank you!  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5vdef", "score_hidden": false, "stickied": false, "created": 1492033352.0, "created_utc": 1492004552.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v8nu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Diablo165", "parent_id": "t1_dg5s6vw", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Fuck the downvoters. I got you, boo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck the downvoters. I got you, boo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5v8nu", "score_hidden": false, "stickied": false, "created": 1492033173.0, "created_utc": 1492004373.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5s6vw", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;This is when she told me she has genital herpes and has had it for about 6 years. 6 years!!!! At first I was alright. I don't like to see her cry\n\nPlaying you like women play most men.  She cried.  You don't like to see your *unicorn* cry.   \"*It's ok, honey.  I love you.  We'll share you herpes together!*\"\n\n&gt;She is not cruel or malicious in any form whatsoever.\n\nNo.  Not at all.  Just waited until you seemingly had herpes to make you aware she had it.  Keep lying to yourself.\n\n&gt;She is one of the most caring and kind hearted people\n\nSo caring, she shares herpes with everyone.  You're probably one of many she has shared it with.\n\n&gt;TL;DR: SO, love of my life, told me after a year she had herpes. Pretty sure I have it now. Travelling together soon. I am a mental mess. Don't know how to move forward.\n\nAnything other than dumping her for this simply shows her she can not only get away with lying and potentially putting your health at risk, but you'll be her little bitch and just take it.\n\nTime to accept fate for what it is.  \n1) Dump the lying bitch.  \n2) Go to your doctor and get an **IgG** test (NOT IgM) and confirm what you have (ask them for HSV1 and HSV2 testing).  \n3) Get on suppressive therapy (valacyclovir).  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This is when she told me she has genital herpes and has had it for about 6 years. 6 years!!!! At first I was alright. I don&amp;#39;t like to see her cry&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Playing you like women play most men.  She cried.  You don&amp;#39;t like to see your &lt;em&gt;unicorn&lt;/em&gt; cry.   &amp;quot;&lt;em&gt;It&amp;#39;s ok, honey.  I love you.  We&amp;#39;ll share you herpes together!&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She is not cruel or malicious in any form whatsoever.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No.  Not at all.  Just waited until you seemingly had herpes to make you aware she had it.  Keep lying to yourself.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She is one of the most caring and kind hearted people&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So caring, she shares herpes with everyone.  You&amp;#39;re probably one of many she has shared it with.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;TL;DR: SO, love of my life, told me after a year she had herpes. Pretty sure I have it now. Travelling together soon. I am a mental mess. Don&amp;#39;t know how to move forward.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Anything other than dumping her for this simply shows her she can not only get away with lying and potentially putting your health at risk, but you&amp;#39;ll be her little bitch and just take it.&lt;/p&gt;\n\n&lt;p&gt;Time to accept fate for what it is.&lt;br/&gt;\n1) Dump the lying bitch.&lt;br/&gt;\n2) Go to your doctor and get an &lt;strong&gt;IgG&lt;/strong&gt; test (NOT IgM) and confirm what you have (ask them for HSV1 and HSV2 testing).&lt;br/&gt;\n3) Get on suppressive therapy (valacyclovir).  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5s6vw", "score_hidden": false, "stickied": false, "created": 1492028394.0, "created_utc": 1491999594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5okhc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "CyberRaver", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She could be covering up a infidelity with this, its a \"convenient\" excuse, you NEVER for get you have the herp", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She could be covering up a infidelity with this, its a &amp;quot;convenient&amp;quot; excuse, you NEVER for get you have the herp&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5okhc", "score_hidden": false, "stickied": false, "created": 1492019381.0, "created_utc": 1491990581.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5irg1", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Skov3n", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm sorry to hear this story. It was definitely bull that she didn't tell you about her std right off the bat. Unfortunately that's what happened though and the best advice I can give is try not to overreact. Herpes is very very manageable, look at it more as a type of skin problem. With proper medication outbreaks can be extremely minimal or non existent for years at a time. The chances of passing it on while taking medication is also very slim. I considered dating someone who had genital herpes once and did a lot of reading as well as speaking to my doctor about it. I did not end up dating them for unrelated reasons. I would find out if you have contracted herpes and if the answer is yes at least you love your partner. The anger will subside. What else can you do though? If you do not have it I would make sure if you are staying with your partner that you make sure the proper medication is being taken. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear this story. It was definitely bull that she didn&amp;#39;t tell you about her std right off the bat. Unfortunately that&amp;#39;s what happened though and the best advice I can give is try not to overreact. Herpes is very very manageable, look at it more as a type of skin problem. With proper medication outbreaks can be extremely minimal or non existent for years at a time. The chances of passing it on while taking medication is also very slim. I considered dating someone who had genital herpes once and did a lot of reading as well as speaking to my doctor about it. I did not end up dating them for unrelated reasons. I would find out if you have contracted herpes and if the answer is yes at least you love your partner. The anger will subside. What else can you do though? If you do not have it I would make sure if you are staying with your partner that you make sure the proper medication is being taken. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5irg1", "score_hidden": false, "stickied": false, "created": 1492003569.0, "created_utc": 1491974769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg6i9jq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Throwayg2016", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Honestly, she knew she had it and knew she had a responsibility to inform you before y'all slept together unprotected. Like everyone is saying it is INCURABLE. Forget about the stigma, it's a painful disease that affects many aspects of your life. The fact that she willingly spread it to you (severe itching is very telling) and waited until your lives were intertwined and you started showing signs.....this tells me transmission was premeditated.\n\nLeave. Explain that you cannot trust her and maybe in the future she will disclose to future partners. If she can lie about something so tantamount to your health and well being what will she lie about in the future?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, she knew she had it and knew she had a responsibility to inform you before y&amp;#39;all slept together unprotected. Like everyone is saying it is INCURABLE. Forget about the stigma, it&amp;#39;s a painful disease that affects many aspects of your life. The fact that she willingly spread it to you (severe itching is very telling) and waited until your lives were intertwined and you started showing signs.....this tells me transmission was premeditated.&lt;/p&gt;\n\n&lt;p&gt;Leave. Explain that you cannot trust her and maybe in the future she will disclose to future partners. If she can lie about something so tantamount to your health and well being what will she lie about in the future?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6i9jq", "score_hidden": false, "stickied": false, "created": 1492057832.0, "created_utc": 1492029032.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg6u7pw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Canuckchick1201", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Wow.  Get to a doctor asap!  This is a huge thing that she fucking kept to herself.  This is a deal breaker.  She took your health and the right to make your own decisions and fucking stomped the shit out of them.  Cancel your flight and use the money to go on your own trip, even if its for a weekend.  Just the fact that this \"caring and kind hearted person\" would actually begin a relationship with someone without telling them this makes one wonder what else she hasn't told you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow.  Get to a doctor asap!  This is a huge thing that she fucking kept to herself.  This is a deal breaker.  She took your health and the right to make your own decisions and fucking stomped the shit out of them.  Cancel your flight and use the money to go on your own trip, even if its for a weekend.  Just the fact that this &amp;quot;caring and kind hearted person&amp;quot; would actually begin a relationship with someone without telling them this makes one wonder what else she hasn&amp;#39;t told you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6u7pw", "score_hidden": false, "stickied": false, "created": 1492072154.0, "created_utc": 1492043354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5q8a7", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "king-schultz", "parent_id": "t1_dg5ojbg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "As I said, completely misses the point. Stop trying to minimize it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As I said, completely misses the point. Stop trying to minimize it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5q8a7", "score_hidden": false, "stickied": false, "created": 1492024188.0, "created_utc": 1491995388.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg6cplt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mswizzle23", "parent_id": "t1_dg5ojbg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah I saw that herpes used to not be stigmatized like it is now, but it's not common knowledge idt which might be why you're getting downvoted. But still, the lying is the bigger problem here, it would be different to being that up if you were just talking about herpes but the betrayal of trust is why op is feeling so hurt. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I saw that herpes used to not be stigmatized like it is now, but it&amp;#39;s not common knowledge idt which might be why you&amp;#39;re getting downvoted. But still, the lying is the bigger problem here, it would be different to being that up if you were just talking about herpes but the betrayal of trust is why op is feeling so hurt. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6cplt", "score_hidden": false, "stickied": false, "created": 1492052123.0, "created_utc": 1492023323.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ojbg", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "duckthedove", "parent_id": "t1_dg5nw4z", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "No, it does. It's mostly the stigma associated with herpes that makes this a problem. I was in the same boat once. Genuinely forgot to tell my new bf about it (about 6 weeks in, and we had had sex, but I had had only one outbreak in my life). I remember when I got it, I felt fucking terrible and disgusting and I was mad at my then-partner, but then I learned that 70-80% of people have the virus, with only 5% of them ever having a breakout. Took me a while to get over it.\n\nIt's like HPV, you don't know you have it, you don't get tested for it, because it only 'matters' if you get a breakout.\n\nFor all you know OP, you could have contracted this with another partner.\n\nThat said, it's completely normal and OK to be mad at her right now. She's probably mad at herself too. Use this opportunity to chalk out how you want your relationship to look from now on: more honesty, more consideration, more whatever. \n\nLet me stress again: it's the stigma that makes this a hard thing to swallow. But herpes is sores in a taboo ridden place and associated with sex. Acknowledge that taboo still rules your thinking and then please move beyond this. It's 2017 ffs.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, it does. It&amp;#39;s mostly the stigma associated with herpes that makes this a problem. I was in the same boat once. Genuinely forgot to tell my new bf about it (about 6 weeks in, and we had had sex, but I had had only one outbreak in my life). I remember when I got it, I felt fucking terrible and disgusting and I was mad at my then-partner, but then I learned that 70-80% of people have the virus, with only 5% of them ever having a breakout. Took me a while to get over it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like HPV, you don&amp;#39;t know you have it, you don&amp;#39;t get tested for it, because it only &amp;#39;matters&amp;#39; if you get a breakout.&lt;/p&gt;\n\n&lt;p&gt;For all you know OP, you could have contracted this with another partner.&lt;/p&gt;\n\n&lt;p&gt;That said, it&amp;#39;s completely normal and OK to be mad at her right now. She&amp;#39;s probably mad at herself too. Use this opportunity to chalk out how you want your relationship to look from now on: more honesty, more consideration, more whatever. &lt;/p&gt;\n\n&lt;p&gt;Let me stress again: it&amp;#39;s the stigma that makes this a hard thing to swallow. But herpes is sores in a taboo ridden place and associated with sex. Acknowledge that taboo still rules your thinking and then please move beyond this. It&amp;#39;s 2017 ffs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ojbg", "score_hidden": false, "stickied": false, "created": 1492019281.0, "created_utc": 1491990481.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nw4z", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "king-schultz", "parent_id": "t1_dg5ilca", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Completely misses the point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Completely misses the point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5nw4z", "score_hidden": false, "stickied": false, "created": 1492017249.0, "created_utc": 1491988449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ilca", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "J973", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "Rude.  Uncalled for, but not the end of the World.   Really a lot of people never even develop symptom for it.   Why do you think you have it?  \n\nThen again,  SOOOO many of my friends and their kids have really nasty knarly cold sores on their mouths.  You know what that is?   It's herpes.   It's an inconvenience, but it is NOT life or death even if you happen to have it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rude.  Uncalled for, but not the end of the World.   Really a lot of people never even develop symptom for it.   Why do you think you have it?  &lt;/p&gt;\n\n&lt;p&gt;Then again,  SOOOO many of my friends and their kids have really nasty knarly cold sores on their mouths.  You know what that is?   It&amp;#39;s herpes.   It&amp;#39;s an inconvenience, but it is NOT life or death even if you happen to have it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ilca", "score_hidden": false, "stickied": false, "created": 1492003236.0, "created_utc": 1491974436.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5yqq1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "murderousbudgie", "parent_id": "t1_dg5ypfr", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "TIL!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TIL!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5yqq1", "score_hidden": false, "stickied": false, "created": 1492037474.0, "created_utc": 1492008674.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg5zsm1", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "pipboylover", "parent_id": "t1_dg5ypfr", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That says that 87 percent of those infected in that age group haven't been clinically diagnosed, not that 87 percent of people in that age group have it, not to mention all people. Reading comprehension is your friend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That says that 87 percent of those infected in that age group haven&amp;#39;t been clinically diagnosed, not that 87 percent of people in that age group have it, not to mention all people. Reading comprehension is your friend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5zsm1", "score_hidden": false, "stickied": false, "created": 1492038662.0, "created_utc": 1492009862.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ypfr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Diablo165", "parent_id": "t1_dg5yfy8", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "As per the [CDC website](https://www.cdc.gov/std/herpes/stdfact-herpes-detailed.htm)\n\n&gt;Most infected persons may be unaware of their infection; in the United States, an estimated 87.4% of 14–49 year olds infected with HSV-2 have never received a clinical diagnosis.\n\nI think a few of us are faultily recalling this stat!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As per the &lt;a href=\"https://www.cdc.gov/std/herpes/stdfact-herpes-detailed.htm\"&gt;CDC website&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Most infected persons may be unaware of their infection; in the United States, an estimated 87.4% of 14–49 year olds infected with HSV-2 have never received a clinical diagnosis.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think a few of us are faultily recalling this stat!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ypfr", "score_hidden": false, "stickied": false, "created": 1492037434.0, "created_utc": 1492008634.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yfy8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "murderousbudgie", "parent_id": "t1_dg5v9ro", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think you're thinking of HPV.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re thinking of HPV.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5yfy8", "score_hidden": false, "stickied": false, "created": 1492037136.0, "created_utc": 1492008336.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v9ro", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Diablo165", "parent_id": "t1_dg5s80k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": " Yeah, I think the estimate is it 87 or so percent of people have asymptomatic herpes, but that's an estimate, because these people haven't been tested, because they don't have symptoms. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I think the estimate is it 87 or so percent of people have asymptomatic herpes, but that&amp;#39;s an estimate, because these people haven&amp;#39;t been tested, because they don&amp;#39;t have symptoms. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5v9ro", "score_hidden": false, "stickied": false, "created": 1492033216.0, "created_utc": 1492004416.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5s80k", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "pipboylover", "parent_id": "t1_dg5rtfg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That's completely untrue. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s completely untrue. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5s80k", "score_hidden": false, "stickied": false, "created": 1492028453.0, "created_utc": 1491999653.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg62zpu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sueca", "parent_id": "t1_dg5rtfg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "According to Wikipedia it's more like 60% of those under 50, but still super high yes. Most will never have a break out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;According to Wikipedia it&amp;#39;s more like 60% of those under 50, but still super high yes. Most will never have a break out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg62zpu", "score_hidden": false, "stickied": false, "created": 1492042160.0, "created_utc": 1492013360.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rtfg", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Dodo967", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "Well, 80-90% of the population have Herpes. 40% of them don't even know because it never breaks out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, 80-90% of the population have Herpes. 40% of them don&amp;#39;t even know because it never breaks out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5rtfg", "score_hidden": false, "stickied": false, "created": 1492027682.0, "created_utc": 1491998882.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w7gg", "likes": null, "replies": "", "user_reports": [], "id": "dg65p3h", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "dfaz173", "parent_id": "t3_64w7gg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Dude, it's just herpes. Calm down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude, it&amp;#39;s just herpes. Calm down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg65p3h", "score_hidden": false, "stickied": false, "created": 1492044994.0, "created_utc": 1492016194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]