[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My fiance and I have been together for 6 years, we started dating when we were 14 &amp;amp; 15 which means we are in our early twenties. He is in the military, and recently got back from an overseas deployment about 6 months ago. When he got home I was fully prepared to give him space, be patient, and understanding if he so needed. But he adjusted really well, and we got along great. He proposed in December 2016, and we already have a wedding date set.&lt;/p&gt;\n\n&lt;p&gt;Lately, though, he&amp;#39;s been demonstrating some qualities that I&amp;#39;m having a hard time looking past. He is under a lot of stress with finishing his education after a huge gap due to deployment. I&amp;#39;ve politely double checked to make sure he&amp;#39;s 100% certain about the wedding date, getting married at this time, etc. and he assures me yes. The issue here is that he gets angry-- but never at me. For the six years i&amp;#39;ve been with him he is extremely patient. But He gets so stressed out and angry at his parents that I&amp;#39;ve witnessed several times he will throw, punch, and slam things. The worst was a few weeks ago when he went to get food from the delivery guy, his mom distracted him, and the delivery guy ran off with a large tip by accident. My fiance came upstairs to where I was and got so angry he threw the food and kicked and threw one of our metal chairs.&lt;/p&gt;\n\n&lt;p&gt;I was abused growing up, so I am uncomfortable around angry, drunk, or violent men. When he lashes out, I get easily shook up and extremely nervous. I was so angry at him for lashing out and breaking the chair I ended up leaving. I was very vocal about my concerns, saying that he didn&amp;#39;t need to act that way around me and I was removing myself from the situation. His reaction only made it worse, because once he realized getting mad at his mom actually upset me he shut me out and didn&amp;#39;t speak. When I left, he texted me and blamed me for not being there for him. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve expressed my concerns about these lashing outs, and he&amp;#39;s assured me time and time again that &amp;quot;I could never make him that angry&amp;quot; and it&amp;#39;s only his parents. I then explained that men who throw chairs and punch walls are time bombs, and it is only a matter of time before he ends up punching me by accident. He was horrified that I thought that, and somewhat offended. &lt;/p&gt;\n\n&lt;p&gt;Our relationship is golden except for this behavior I can&amp;#39;t get over. I find myself walking on eggshells around him ever since. I&amp;#39;m nervous when we go somewhere new- what if he can&amp;#39;t park our huge truck? What if something doesn&amp;#39;t go to plan? Will this upset him? These are huge red flags for me, and each and every time I cringe waiting for him to blow up he actually DOESN&amp;#39;T. He acts like he always is with me, which is patient and very kind.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if it&amp;#39;s just me witnessing his occasion blow ups and attributing it with aspects of my childhood, and thus getting some sort of trigger from the way he&amp;#39;s acting and what I &amp;quot;expect&amp;quot; to happen next. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also not sure if this is some sort of frustration from being away for as long as he was, which was a long time. He was never this radical with anger before he got deployed.&lt;/p&gt;\n\n&lt;p&gt;Advice? &lt;/p&gt;\n\n&lt;p&gt;UPDATE: talked about it briefly with him, and he assures me that he is reacting to frustration with the way his parents act compared to the environment he was used to while being deployed. I asked him to consider counseling, and he wasn&amp;#39;t open to it, but was open to trying to channel his frustration in another way. He again was hurt when I explained it could be a red flag that he may turn his aggression on me in the future, but he responded again with &amp;quot;you could never make me that angry, it&amp;#39;s only my parents who make me act like that.&amp;quot; \nHe wasn&amp;#39;t aware I was still lingering on the moment where he threw the chair, but told me he understands. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My fiance and I have been together for 6 years, we started dating when we were 14 &amp; 15 which means we are in our early twenties. He is in the military, and recently got back from an overseas deployment about 6 months ago. When he got home I was fully prepared to give him space, be patient, and understanding if he so needed. But he adjusted really well, and we got along great. He proposed in December 2016, and we already have a wedding date set.\n\nLately, though, he's been demonstrating some qualities that I'm having a hard time looking past. He is under a lot of stress with finishing his education after a huge gap due to deployment. I've politely double checked to make sure he's 100% certain about the wedding date, getting married at this time, etc. and he assures me yes. The issue here is that he gets angry-- but never at me. For the six years i've been with him he is extremely patient. But He gets so stressed out and angry at his parents that I've witnessed several times he will throw, punch, and slam things. The worst was a few weeks ago when he went to get food from the delivery guy, his mom distracted him, and the delivery guy ran off with a large tip by accident. My fiance came upstairs to where I was and got so angry he threw the food and kicked and threw one of our metal chairs.\n\nI was abused growing up, so I am uncomfortable around angry, drunk, or violent men. When he lashes out, I get easily shook up and extremely nervous. I was so angry at him for lashing out and breaking the chair I ended up leaving. I was very vocal about my concerns, saying that he didn't need to act that way around me and I was removing myself from the situation. His reaction only made it worse, because once he realized getting mad at his mom actually upset me he shut me out and didn't speak. When I left, he texted me and blamed me for not being there for him. \n\nI've expressed my concerns about these lashing outs, and he's assured me time and time again that \"I could never make him that angry\" and it's only his parents. I then explained that men who throw chairs and punch walls are time bombs, and it is only a matter of time before he ends up punching me by accident. He was horrified that I thought that, and somewhat offended. \n\nOur relationship is golden except for this behavior I can't get over. I find myself walking on eggshells around him ever since. I'm nervous when we go somewhere new- what if he can't park our huge truck? What if something doesn't go to plan? Will this upset him? These are huge red flags for me, and each and every time I cringe waiting for him to blow up he actually DOESN'T. He acts like he always is with me, which is patient and very kind.\n\nI'm not sure if it's just me witnessing his occasion blow ups and attributing it with aspects of my childhood, and thus getting some sort of trigger from the way he's acting and what I \"expect\" to happen next. \n\nI'm also not sure if this is some sort of frustration from being away for as long as he was, which was a long time. He was never this radical with anger before he got deployed.\n\nAdvice? \n\nUPDATE: talked about it briefly with him, and he assures me that he is reacting to frustration with the way his parents act compared to the environment he was used to while being deployed. I asked him to consider counseling, and he wasn't open to it, but was open to trying to channel his frustration in another way. He again was hurt when I explained it could be a red flag that he may turn his aggression on me in the future, but he responded again with \"you could never make me that angry, it's only my parents who make me act like that.\" \nHe wasn't aware I was still lingering on the moment where he threw the chair, but told me he understands. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64w9ed", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "Tmb_321", "saved": false, "mod_reports": [], "name": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492016676.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/64w9ed/a_side_to_my_21f_fiance_22m_im_not_liking/", "num_reports": null, "locked": false, "stickied": false, "created": 1492003064.0, "url": "https://www.reddit.com/r/relationship_advice/comments/64w9ed/a_side_to_my_21f_fiance_22m_im_not_liking/", "author_flair_text": null, "quarantine": false, "title": "A side to my [21/F] fiance [22/M] I'm not liking...", "created_utc": 1491974264.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 41, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5rx3d", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "buggerlugseng", "parent_id": "t1_dg5mmas", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Have to wholeheartedly agree, I'm ex army(U.K.) and I have my moments of anger as much as the next one but you have to learn to cope and channel that anger, the advice I got was running, basically keep running until you feel like stopping, it has helped me a lot but a few of my friends have sought professional help and it has helped them cope day to day and has made them less volatile. We're all scared to ask for help as it's deemed weak but people are there to listen and support you. My only advice to OP would be to broach the subject of help, get things from welfare services to show it's not a weakness but above all do not belittle him when you bring it up as this can have an adverse affect.  Good luck OP just remember that it's extreme circumstances that have made him like this and he just needs help finding a way to cope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have to wholeheartedly agree, I&amp;#39;m ex army(U.K.) and I have my moments of anger as much as the next one but you have to learn to cope and channel that anger, the advice I got was running, basically keep running until you feel like stopping, it has helped me a lot but a few of my friends have sought professional help and it has helped them cope day to day and has made them less volatile. We&amp;#39;re all scared to ask for help as it&amp;#39;s deemed weak but people are there to listen and support you. My only advice to OP would be to broach the subject of help, get things from welfare services to show it&amp;#39;s not a weakness but above all do not belittle him when you bring it up as this can have an adverse affect.  Good luck OP just remember that it&amp;#39;s extreme circumstances that have made him like this and he just needs help finding a way to cope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5rx3d", "score_hidden": false, "stickied": false, "created": 1492027881.0, "created_utc": 1491999081.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5wjyd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5whk8", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Ok thank you !", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok thank you !&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5wjyd", "score_hidden": false, "stickied": false, "created": 1492034890.0, "created_utc": 1492006090.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5whk8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "babystripper", "parent_id": "t1_dg5wdch", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He can still use the services. A chaplain, different family readiness centers, mental health clinic", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He can still use the services. A chaplain, different family readiness centers, mental health clinic&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5whk8", "score_hidden": false, "stickied": false, "created": 1492034804.0, "created_utc": 1492006004.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wdch", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5wak0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He was deployed while reservist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He was deployed while reservist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5wdch", "score_hidden": false, "stickied": false, "created": 1492034657.0, "created_utc": 1492005857.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wak0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "babystripper", "parent_id": "t1_dg5vx21", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "No it should be through active duty military. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No it should be through active duty military. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5wak0", "score_hidden": false, "stickied": false, "created": 1492034559.0, "created_utc": 1492005759.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg68jkm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tigalicious", "parent_id": "t1_dg5vx21", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Have you considered contacting them yourself to express your concern? It's easy to sit in a shrink's office and say \"nope, no anger issues at all\", but that doesn't mean that he's actually okay. And PTSD symptoms can start surfacing *years* later than you'd think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered contacting them yourself to express your concern? It&amp;#39;s easy to sit in a shrink&amp;#39;s office and say &amp;quot;nope, no anger issues at all&amp;quot;, but that doesn&amp;#39;t mean that he&amp;#39;s actually okay. And PTSD symptoms can start surfacing &lt;em&gt;years&lt;/em&gt; later than you&amp;#39;d think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg68jkm", "score_hidden": false, "stickied": false, "created": 1492047861.0, "created_utc": 1492019061.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vx21", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5mmas", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It would be through the VA right? He had several evaluations during the 2 weeks before coming home, and was found to be fine. Not saying he is fine, but if military doesn't think he has some sort of PTSD how do we move forward from there? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would be through the VA right? He had several evaluations during the 2 weeks before coming home, and was found to be fine. Not saying he is fine, but if military doesn&amp;#39;t think he has some sort of PTSD how do we move forward from there? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5vx21", "score_hidden": false, "stickied": false, "created": 1492034073.0, "created_utc": 1492005273.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mmas", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "babystripper", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm in the military and I know for a fact that all five branches have services he can use to get help with whatever demons he is holding onto. I would recommend talking to him and getting him to use them. Yes the militarys a scary place and changes you. But I think if someone was doing this and refuses to get help, I couldn't be there any more for my own safety", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the military and I know for a fact that all five branches have services he can use to get help with whatever demons he is holding onto. I would recommend talking to him and getting him to use them. Yes the militarys a scary place and changes you. But I think if someone was doing this and refuses to get help, I couldn&amp;#39;t be there any more for my own safety&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5mmas", "score_hidden": false, "stickied": false, "created": 1492013240.0, "created_utc": 1491984440.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5octd", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "purlandcrystal", "parent_id": "t1_dg5j14h", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It will always be a stressful time.\n\nSeriously. There will always be something. Wedding, pregnancies, children. A job move, or a lay-off. Sickness. Bereavement. Hopefully not all at once, but there will literally never be a time in your life together where *no aspect* of your shared life is stressful.\n\nHow he treats you under stress isn't a temporary blip. It's how he treats you for real.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It will always be a stressful time.&lt;/p&gt;\n\n&lt;p&gt;Seriously. There will always be something. Wedding, pregnancies, children. A job move, or a lay-off. Sickness. Bereavement. Hopefully not all at once, but there will literally never be a time in your life together where &lt;em&gt;no aspect&lt;/em&gt; of your shared life is stressful.&lt;/p&gt;\n\n&lt;p&gt;How he treats you under stress isn&amp;#39;t a temporary blip. It&amp;#39;s how he treats you for real.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5octd", "score_hidden": false, "stickied": false, "created": 1492018707.0, "created_utc": 1491989907.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5j14h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5ixue", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "No, he's just under a lot of stress right now. Which isn't a excuse, but it's a time in our life where we are trying to merge as a family and make a big move to a different state. I already told him straight up it's only a matter of time before he hits me or hits me with something. He has never demonstrated such a desire, and is still very sweet and loving. Our relationship is fine, but his behavior scares me should it evolve into something more. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, he&amp;#39;s just under a lot of stress right now. Which isn&amp;#39;t a excuse, but it&amp;#39;s a time in our life where we are trying to merge as a family and make a big move to a different state. I already told him straight up it&amp;#39;s only a matter of time before he hits me or hits me with something. He has never demonstrated such a desire, and is still very sweet and loving. Our relationship is fine, but his behavior scares me should it evolve into something more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5j14h", "score_hidden": false, "stickied": false, "created": 1492004116.0, "created_utc": 1491975316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ixue", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Skov3n", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I've never been in an abusive relationship but I've had friends who have and this is how it always begins. This sounds like a severe anger issue I would be very wary of. Have you noticed any other changes in his demeanor? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never been in an abusive relationship but I&amp;#39;ve had friends who have and this is how it always begins. This sounds like a severe anger issue I would be very wary of. Have you noticed any other changes in his demeanor? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ixue", "score_hidden": false, "stickied": false, "created": 1492003934.0, "created_utc": 1491975134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5k2nr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Traeyze", "parent_id": "t1_dg5jgdj", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "There is no doubt he will be ashamed of himself, but that alone won't prompt change, clearly. He also doesn't have the right to simply say that you don't have to be scared, he has to put his money where his mouth is and seek earnest change and for that therapy is integral. If he resists that he is saying that what he is doing is okay and if you aren't okay with that then this is a marriage that will not work, simple as that and as you are now an adult these are the sorts of life decisions you have to start making.\n\nThe counselling could work  but I worry he will be too prideful to open up around you and his defence mechanism is to shift the blame onto others and he may say and do things he doesn't mean in the process. You already know that when upset he does things he isn't fully in control of or proud of, he might get desperate and say some spiteful stuff. Therapy alone is 'safer' and a good therapist will be able to open up someone like that pretty easily.\n\nAnd that last bit is why you have to take this seriously. I know it has been a long time, I know how tempting it is to rationalise it all but now that you are aware of it you'll find it hard to ever drop your guard unless you get some reassurance. I hope for the both of you he takes those steps, it might even help you make some peace with the past, to know that things can get better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no doubt he will be ashamed of himself, but that alone won&amp;#39;t prompt change, clearly. He also doesn&amp;#39;t have the right to simply say that you don&amp;#39;t have to be scared, he has to put his money where his mouth is and seek earnest change and for that therapy is integral. If he resists that he is saying that what he is doing is okay and if you aren&amp;#39;t okay with that then this is a marriage that will not work, simple as that and as you are now an adult these are the sorts of life decisions you have to start making.&lt;/p&gt;\n\n&lt;p&gt;The counselling could work  but I worry he will be too prideful to open up around you and his defence mechanism is to shift the blame onto others and he may say and do things he doesn&amp;#39;t mean in the process. You already know that when upset he does things he isn&amp;#39;t fully in control of or proud of, he might get desperate and say some spiteful stuff. Therapy alone is &amp;#39;safer&amp;#39; and a good therapist will be able to open up someone like that pretty easily.&lt;/p&gt;\n\n&lt;p&gt;And that last bit is why you have to take this seriously. I know it has been a long time, I know how tempting it is to rationalise it all but now that you are aware of it you&amp;#39;ll find it hard to ever drop your guard unless you get some reassurance. I hope for the both of you he takes those steps, it might even help you make some peace with the past, to know that things can get better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5k2nr", "score_hidden": false, "stickied": false, "created": 1492006419.0, "created_utc": 1491977619.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jgdj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5j9t8", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you so much. He does experience a lot of \"guilt\" and I tend to make light of the situation in fear I'll only make it worse to make a \"big deal\". I confessed I was nervous around him now, and he didn't know what to make of me saying that other than to say \"Don't be. Please.\" He does have a lot of issues with his parents, and I do think therapy would be good for him  I just don't know how to start approaching it. \n\nI've wondered about pre-marital counseling and whether it could help with this or not, because getting married is committing to a lifetime of stressful situations together which I don't want him lashing out for.\n\nThe day he threw the chair I had told him \"I grew up around family punching windows and hitting each other. I don't need a husband who does the same thing!\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. He does experience a lot of &amp;quot;guilt&amp;quot; and I tend to make light of the situation in fear I&amp;#39;ll only make it worse to make a &amp;quot;big deal&amp;quot;. I confessed I was nervous around him now, and he didn&amp;#39;t know what to make of me saying that other than to say &amp;quot;Don&amp;#39;t be. Please.&amp;quot; He does have a lot of issues with his parents, and I do think therapy would be good for him  I just don&amp;#39;t know how to start approaching it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve wondered about pre-marital counseling and whether it could help with this or not, because getting married is committing to a lifetime of stressful situations together which I don&amp;#39;t want him lashing out for.&lt;/p&gt;\n\n&lt;p&gt;The day he threw the chair I had told him &amp;quot;I grew up around family punching windows and hitting each other. I don&amp;#39;t need a husband who does the same thing!&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5jgdj", "score_hidden": false, "stickied": false, "created": 1492004999.0, "created_utc": 1491976199.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5j9t8", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Traeyze", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;...who throw chairs and punch walls are time bombs\n\nAbsolutely. There is no way he can assure it won't eventually transfer onto you and you absolutely have a right to be concerned. At the very least having to be near a person who is that content to act like that is tiring, upsetting and nerve wrecking... he should not be willing to act that way. Imagine if you had kids and you had to explain to them why every family reunion ended in their dad acting like a petulant gorilla.\n\nIt is clear his parents are the source of a lot of frustration for him but he can't be content with not dealing with that. He clearly needs therapy, there is never a time kicking food around could be considered a healthy expression of frustration and this sort of thing tends to escalate long before it alleviates and while direct stress is what is making it manifest now the liklihood that it comes up again later is pretty high.  \n\nOn top of that he constantly throws it back in your face which shows you he is [perhaps unconsciously] avoiding confronting the issue. That is a big concern because that will generate a lot of resentment in him, something that really will prompt things to get worse. \n\nHe needs to deal with it and him getting petty and spiteful anytime you suggest it is a huge concern. Don't let stress or the fact it is fine otherwise take away from the gravity of a man who throws these scary tantrums, especially as you had a childhood where you knew exactly what it was like to be around people like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;...who throw chairs and punch walls are time bombs&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely. There is no way he can assure it won&amp;#39;t eventually transfer onto you and you absolutely have a right to be concerned. At the very least having to be near a person who is that content to act like that is tiring, upsetting and nerve wrecking... he should not be willing to act that way. Imagine if you had kids and you had to explain to them why every family reunion ended in their dad acting like a petulant gorilla.&lt;/p&gt;\n\n&lt;p&gt;It is clear his parents are the source of a lot of frustration for him but he can&amp;#39;t be content with not dealing with that. He clearly needs therapy, there is never a time kicking food around could be considered a healthy expression of frustration and this sort of thing tends to escalate long before it alleviates and while direct stress is what is making it manifest now the liklihood that it comes up again later is pretty high.  &lt;/p&gt;\n\n&lt;p&gt;On top of that he constantly throws it back in your face which shows you he is [perhaps unconsciously] avoiding confronting the issue. That is a big concern because that will generate a lot of resentment in him, something that really will prompt things to get worse. &lt;/p&gt;\n\n&lt;p&gt;He needs to deal with it and him getting petty and spiteful anytime you suggest it is a huge concern. Don&amp;#39;t let stress or the fact it is fine otherwise take away from the gravity of a man who throws these scary tantrums, especially as you had a childhood where you knew exactly what it was like to be around people like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5j9t8", "score_hidden": false, "stickied": false, "created": 1492004613.0, "created_utc": 1491975813.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5j5vr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5j4x9", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you I appreciate it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you I appreciate it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5j5vr", "score_hidden": false, "stickied": false, "created": 1492004392.0, "created_utc": 1491975592.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5j4x9", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Skov3n", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If you feel fearful you should remove yourself from the situation. I wouldn't want something bad to happen. It's tough for sure. If I was in your shoes I suppose I'd probably just let the stress subside and see if the behavior continues. I wish you all the best.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you feel fearful you should remove yourself from the situation. I wouldn&amp;#39;t want something bad to happen. It&amp;#39;s tough for sure. If I was in your shoes I suppose I&amp;#39;d probably just let the stress subside and see if the behavior continues. I wish you all the best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5j4x9", "score_hidden": false, "stickied": false, "created": 1492004337.0, "created_utc": 1491975537.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5u9mm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5tog2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Hi, thank you! . I do know why he is angry at his parents, I'm not assuming or projecting anything onto him but merely being cautious. I don't particularly feel unsafe, but I am concerned that it could get worse as time &amp; life goes on and he's faced with more adversity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, thank you! . I do know why he is angry at his parents, I&amp;#39;m not assuming or projecting anything onto him but merely being cautious. I don&amp;#39;t particularly feel unsafe, but I am concerned that it could get worse as time &amp;amp; life goes on and he&amp;#39;s faced with more adversity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5u9mm", "score_hidden": false, "stickied": false, "created": 1492031795.0, "created_utc": 1492002995.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tog2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hachikid", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Sounds like PTSD. The good news is that doesn't mean someone is permanently broken or any of that nonsense. He's most likely just dealing with some habits from the desert that work in a military setting but don't translate well to regular life.\n\nHowever, it's very important that you don't treat him with kid gloves and project that the deployment has turned him into a \"ticking time bomb.\" While it could have shortened his temper, you still need to treat him like an equally dynamic human just like the rest of us on the planet. \n\nI'm in the military, and I see people projecting a lot of stuff on me that's not there, and it's frustrating, to say the least. It's like when people find out what you do for a living that everything changes. It's important to not look at him \"before deployment\" and \"after deployment\" as if he turned I to some kind of monster. He's still the same fiance that you got engaged to, and he still respects you. Find out what about his parents is bothering him instead of possibly believing that he just randomly gets mad at his parents for no reason and assuming that he'll do the same to you one day.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like PTSD. The good news is that doesn&amp;#39;t mean someone is permanently broken or any of that nonsense. He&amp;#39;s most likely just dealing with some habits from the desert that work in a military setting but don&amp;#39;t translate well to regular life.&lt;/p&gt;\n\n&lt;p&gt;However, it&amp;#39;s very important that you don&amp;#39;t treat him with kid gloves and project that the deployment has turned him into a &amp;quot;ticking time bomb.&amp;quot; While it could have shortened his temper, you still need to treat him like an equally dynamic human just like the rest of us on the planet. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in the military, and I see people projecting a lot of stuff on me that&amp;#39;s not there, and it&amp;#39;s frustrating, to say the least. It&amp;#39;s like when people find out what you do for a living that everything changes. It&amp;#39;s important to not look at him &amp;quot;before deployment&amp;quot; and &amp;quot;after deployment&amp;quot; as if he turned I to some kind of monster. He&amp;#39;s still the same fiance that you got engaged to, and he still respects you. Find out what about his parents is bothering him instead of possibly believing that he just randomly gets mad at his parents for no reason and assuming that he&amp;#39;ll do the same to you one day.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5tog2", "score_hidden": false, "stickied": false, "created": 1492030892.0, "created_utc": 1492002092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5vdht", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "emphaticduck", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Your fiance reminds me too much of my ex, including the chair throwing. When he would get angry, he would punch walls and kick things (splintered a kitchen cabinet door in the middle). His parents would trigger his temper a lot of times. But I felt safe because he always directed the violence at inanimate objects and never at me... Until one day he did. I ended up fleeing our home and I called the police because I didn't feel safe returning. Hope you consider delaying your wedding till his anger management is addressed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your fiance reminds me too much of my ex, including the chair throwing. When he would get angry, he would punch walls and kick things (splintered a kitchen cabinet door in the middle). His parents would trigger his temper a lot of times. But I felt safe because he always directed the violence at inanimate objects and never at me... Until one day he did. I ended up fleeing our home and I called the police because I didn&amp;#39;t feel safe returning. Hope you consider delaying your wedding till his anger management is addressed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5vdht", "score_hidden": false, "stickied": false, "created": 1492033356.0, "created_utc": 1492004556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5s89u", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DeadGuy940", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It is called PTSD and either his parents are the cause or they are just his primary trigger.  Get him some help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is called PTSD and either his parents are the cause or they are just his primary trigger.  Get him some help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5s89u", "score_hidden": false, "stickied": false, "created": 1492028467.0, "created_utc": 1491999667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5u4ua", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5ms0i", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5u4ua", "score_hidden": false, "stickied": false, "created": 1492031601.0, "created_utc": 1492002801.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ms0i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8530683641", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I would say it would be better if he sees the therapist to understand the pattern of his behavior and if you wish then you can accompany him to encourage him. However, do not project that he has some mental illness but make sure that you tell him that it happens with many men and he just needs to understand why he does it sometimes. Tell him that you want to strengthen the relationship and that is why you want this issue to be addressed professionally. You are right if he does not do anything to fix it then you should be ready to be punched by him.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say it would be better if he sees the therapist to understand the pattern of his behavior and if you wish then you can accompany him to encourage him. However, do not project that he has some mental illness but make sure that you tell him that it happens with many men and he just needs to understand why he does it sometimes. Tell him that you want to strengthen the relationship and that is why you want this issue to be addressed professionally. You are right if he does not do anything to fix it then you should be ready to be punched by him.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ms0i", "score_hidden": false, "stickied": false, "created": 1492013732.0, "created_utc": 1491984932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5p98j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ItsOnlyMe2017", "parent_id": "t1_dg5p56m", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "PS - when you sit down to talk about it (don't do it in the car or during an activity, do it when it's you and him facing each other with no distractions), don't let him brush it off, or get up saying \"not this again\". Ask him to give you 10 minutes of his time to really listen to you and engage with you because this is bothering you and you need to get it sorted out. You don't want to be that wife who has to live with this for 50 years with him saying \"you knew what I was like  before you married me\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PS - when you sit down to talk about it (don&amp;#39;t do it in the car or during an activity, do it when it&amp;#39;s you and him facing each other with no distractions), don&amp;#39;t let him brush it off, or get up saying &amp;quot;not this again&amp;quot;. Ask him to give you 10 minutes of his time to really listen to you and engage with you because this is bothering you and you need to get it sorted out. You don&amp;#39;t want to be that wife who has to live with this for 50 years with him saying &amp;quot;you knew what I was like  before you married me&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5p98j", "score_hidden": false, "stickied": false, "created": 1492021486.0, "created_utc": 1491992686.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5p56m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ItsOnlyMe2017", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I have been in an abusive relationship in the past and got out of it 10 years ago - but to this day if I am around shouting/drunk/unpredictable men I feel very very uncomfortable and get ready to duck. \nI think you need to address it asap - he claims that he would never get that angry with you and is offended that you think he would - so sit down with him and explain how it makes you feel. He will either rein it in or get help to save your relationship. If you explain that you are scared shitless of that behavior due to your past (I am guessing he knows about that) then he will do his best to calm down. Maybe he can get an outlet for that like a hanging punchbag in the garage or seek professional advice on controlling it. I appreciate that military personnel have to deal with lots of shit that we civvies only ever see in films but if you communicate to him how you are feeling, then he is equipped to manage the situation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been in an abusive relationship in the past and got out of it 10 years ago - but to this day if I am around shouting/drunk/unpredictable men I feel very very uncomfortable and get ready to duck. \nI think you need to address it asap - he claims that he would never get that angry with you and is offended that you think he would - so sit down with him and explain how it makes you feel. He will either rein it in or get help to save your relationship. If you explain that you are scared shitless of that behavior due to your past (I am guessing he knows about that) then he will do his best to calm down. Maybe he can get an outlet for that like a hanging punchbag in the garage or seek professional advice on controlling it. I appreciate that military personnel have to deal with lots of shit that we civvies only ever see in films but if you communicate to him how you are feeling, then he is equipped to manage the situation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5p56m", "score_hidden": false, "stickied": false, "created": 1492021147.0, "created_utc": 1491992347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5ygdg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5ybbs", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thanks for your input.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your input.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ygdg", "score_hidden": false, "stickied": false, "created": 1492037150.0, "created_utc": 1492008350.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ybbs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "goatismycopilot", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Do not marry this man. He lives with his parents and gets mad at them. Do you really think if you get married he is going to magically save his anger for them?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not marry this man. He lives with his parents and gets mad at them. Do you really think if you get married he is going to magically save his anger for them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ybbs", "score_hidden": false, "stickied": false, "created": 1492036991.0, "created_utc": 1492008191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg6a24x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg69feu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you very much. This was really helpful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much. This was really helpful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6a24x", "score_hidden": false, "stickied": false, "created": 1492049406.0, "created_utc": 1492020606.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69feu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "justkate2", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah, he needs mental health services. He may think he's fine because it's \"just his parents\", but his reaction to his parents is something that terrifies YOU. He can't keep the two situations separate and claim everything is okay, because you being forced to watch him explode is putting a lot of stress on you. You shouldn't have to feel startled and afraid because he won't make an appointment to talk to someone. \n\nI have a lot of pent up anger regarding my parents. They were not the best parents growing up, they were abusive many times. I luckily don't have to deal with my father much anymore but I still have to see my mom all the time. She makes me feel powerless and weak, and LOTS of therapy has made me realize that. She tricks me, twists truths, does things I've specifically asked her not to. I am a small disabled woman so getting physically angry is not a real concern, but I throw my phone all the time and sometimes other small things within my reach. Lots of therapy has made me realize this sucks, but I still feel this incredible burst of anger. So instead of getting mad wherever, I go into another room, stomp my feet, throw balled up shirts at the wall, and then go talk to my fiancé. Is it a good fix? No. But it's miles ahead of where I used to be, which was letting something my mother did affect several days of my life and make me an ass to deal with. But I take mine into the other room. My anger is my problem. I haven't yet learned how to deal with my mother. But I'm not making my fiancé watch me get that angry. It's not his fault, he doesn't need to see that. \n\nI think when you talk to him again you really need to drive it home that he cannot possibly separate the two groups of people (his parents and you) because his problems with his parents are causing YOU distress and scaring you. If he tries to say \"I would never get angry like that with you!\" Again, tell him that you might believe that, but even if he never once got angry like that with you, you having to suffer the effects of his violent outbursts is just as bad. What if his physical anger resulted - even by accident - in physical harm to you? He can't guarantee he can control physics. He kicks something with you around and it hits you? That's not okay. \n\nHe's hurting you, emotionally, and he won't admit it. Tell him you refuse to let him hurt you like that. That you love him and want him to feel his best, and you want to work together, and that means finding a way to end these outbursts so that you aren't feeling afraid of him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, he needs mental health services. He may think he&amp;#39;s fine because it&amp;#39;s &amp;quot;just his parents&amp;quot;, but his reaction to his parents is something that terrifies YOU. He can&amp;#39;t keep the two situations separate and claim everything is okay, because you being forced to watch him explode is putting a lot of stress on you. You shouldn&amp;#39;t have to feel startled and afraid because he won&amp;#39;t make an appointment to talk to someone. &lt;/p&gt;\n\n&lt;p&gt;I have a lot of pent up anger regarding my parents. They were not the best parents growing up, they were abusive many times. I luckily don&amp;#39;t have to deal with my father much anymore but I still have to see my mom all the time. She makes me feel powerless and weak, and LOTS of therapy has made me realize that. She tricks me, twists truths, does things I&amp;#39;ve specifically asked her not to. I am a small disabled woman so getting physically angry is not a real concern, but I throw my phone all the time and sometimes other small things within my reach. Lots of therapy has made me realize this sucks, but I still feel this incredible burst of anger. So instead of getting mad wherever, I go into another room, stomp my feet, throw balled up shirts at the wall, and then go talk to my fiancé. Is it a good fix? No. But it&amp;#39;s miles ahead of where I used to be, which was letting something my mother did affect several days of my life and make me an ass to deal with. But I take mine into the other room. My anger is my problem. I haven&amp;#39;t yet learned how to deal with my mother. But I&amp;#39;m not making my fiancé watch me get that angry. It&amp;#39;s not his fault, he doesn&amp;#39;t need to see that. &lt;/p&gt;\n\n&lt;p&gt;I think when you talk to him again you really need to drive it home that he cannot possibly separate the two groups of people (his parents and you) because his problems with his parents are causing YOU distress and scaring you. If he tries to say &amp;quot;I would never get angry like that with you!&amp;quot; Again, tell him that you might believe that, but even if he never once got angry like that with you, you having to suffer the effects of his violent outbursts is just as bad. What if his physical anger resulted - even by accident - in physical harm to you? He can&amp;#39;t guarantee he can control physics. He kicks something with you around and it hits you? That&amp;#39;s not okay. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s hurting you, emotionally, and he won&amp;#39;t admit it. Tell him you refuse to let him hurt you like that. That you love him and want him to feel his best, and you want to work together, and that means finding a way to end these outbursts so that you aren&amp;#39;t feeling afraid of him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg69feu", "score_hidden": false, "stickied": false, "created": 1492048751.0, "created_utc": 1492019951.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5ld3m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ima-kitty", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "tell him if he wants to be with you then he needs to learn better coping mechanisms bc it will just get worse bc you let him get away with it. idk what he experienced over there. so many come back mentally scarred. he needs help if he wants you. don't hurt him by enabling him to have shitty coping skills.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;tell him if he wants to be with you then he needs to learn better coping mechanisms bc it will just get worse bc you let him get away with it. idk what he experienced over there. so many come back mentally scarred. he needs help if he wants you. don&amp;#39;t hurt him by enabling him to have shitty coping skills.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ld3m", "score_hidden": false, "stickied": false, "created": 1492009668.0, "created_utc": 1491980868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg6mpg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tips43", "parent_id": "t1_dg6mix7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Maybe you could tell him it's making you feel bad. I can understand you because my dad was violent with my mum. If my husband is screaming  when he is watching a football match, I can still have shivers on my back. And he is not violent. It's just something that our mind can not accept. I am glad he is talking about it. It's the first step to admit it. With your love and support he will sort it out.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you could tell him it&amp;#39;s making you feel bad. I can understand you because my dad was violent with my mum. If my husband is screaming  when he is watching a football match, I can still have shivers on my back. And he is not violent. It&amp;#39;s just something that our mind can not accept. I am glad he is talking about it. It&amp;#39;s the first step to admit it. With your love and support he will sort it out.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6mpg9", "score_hidden": false, "stickied": false, "created": 1492062865.0, "created_utc": 1492034065.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mix7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5ud69", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you, the good thing is we are both willing to discuss it and he is open to talking about it. He doesn't \"deny\" it, simply has trouble understanding how anger at someone else could come back and upset me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, the good thing is we are both willing to discuss it and he is open to talking about it. He doesn&amp;#39;t &amp;quot;deny&amp;quot; it, simply has trouble understanding how anger at someone else could come back and upset me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6mix7", "score_hidden": false, "stickied": false, "created": 1492062643.0, "created_utc": 1492033843.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ud69", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tips43", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You don't need to feel bad that you are in this situation. It's very good that you ask yourself all this questions before you make the big step. I think he may have a problem because he was away, he is under a lot of stress and he doesn't know how to handle things.\n\nYou should talk with him and tell him that you are worried. Not only for you, but you are also worried for him. It's not healthy for him to react like this.\nIf he can get some help and learn how to deal with stress, I am sure he will be better.\n\nIt's your call but you have to try and help him. If not you will feel sorry for him and also for you. With no closure you can not move forward.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t need to feel bad that you are in this situation. It&amp;#39;s very good that you ask yourself all this questions before you make the big step. I think he may have a problem because he was away, he is under a lot of stress and he doesn&amp;#39;t know how to handle things.&lt;/p&gt;\n\n&lt;p&gt;You should talk with him and tell him that you are worried. Not only for you, but you are also worried for him. It&amp;#39;s not healthy for him to react like this.\nIf he can get some help and learn how to deal with stress, I am sure he will be better.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s your call but you have to try and help him. If not you will feel sorry for him and also for you. With no closure you can not move forward.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ud69", "score_hidden": false, "stickied": false, "created": 1492031941.0, "created_utc": 1492003141.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5x0d4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "parecon", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Advice? Run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Advice? Run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5x0d4", "score_hidden": false, "stickied": false, "created": 1492035452.0, "created_utc": 1492006652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg5x70u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg5x3g5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thanks. That's scary ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. That&amp;#39;s scary &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5x70u", "score_hidden": false, "stickied": false, "created": 1492035675.0, "created_utc": 1492006875.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x3g5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LawHawkling", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "My ex said that until one day he was angry with me and took a hammer to the toolbox on his truck and dented it. \n\nI'm not sure what you should do, but do listen to your gut", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My ex said that until one day he was angry with me and took a hammer to the toolbox on his truck and dented it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what you should do, but do listen to your gut&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5x3g5", "score_hidden": false, "stickied": false, "created": 1492035557.0, "created_utc": 1492006757.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg656ai", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_goodzilla_", "parent_id": "t1_dg64rx1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I really urge you to reconsider.\n\nWhile not morally wrong or necessarily permanent, the way he's acting is **very** problematic. Besides potentially (though unlikely) being the start of abuse, it really upsets you. As it should.\n\n&gt;I have been with him for a long time\n\nThis isn't a good reason to marry someone.\n\n&gt;I'm willing to work through this with him.\n\nThat's awesome. But it isn't contingent on being married.\n\nIt's very conceivable that this will *never get better*. It could get between him and his education and his career. It's very common for people with PTSD to develop drinking problems. He's likely to yell at you a lot and be unable to reliably do his share of childcare. Do you want that to be the rest of your life? Why?\n\nIf it's a good idea to marry him now, it'll be a good idea to marry him in 2 years. It benefits neither of you to get married now, and you'd be taking a **huge** risk.\n\nSeriously, just wait.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really urge you to reconsider.&lt;/p&gt;\n\n&lt;p&gt;While not morally wrong or necessarily permanent, the way he&amp;#39;s acting is &lt;strong&gt;very&lt;/strong&gt; problematic. Besides potentially (though unlikely) being the start of abuse, it really upsets you. As it should.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I have been with him for a long time&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This isn&amp;#39;t a good reason to marry someone.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m willing to work through this with him.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s awesome. But it isn&amp;#39;t contingent on being married.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s very conceivable that this will &lt;em&gt;never get better&lt;/em&gt;. It could get between him and his education and his career. It&amp;#39;s very common for people with PTSD to develop drinking problems. He&amp;#39;s likely to yell at you a lot and be unable to reliably do his share of childcare. Do you want that to be the rest of your life? Why?&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s a good idea to marry him now, it&amp;#39;ll be a good idea to marry him in 2 years. It benefits neither of you to get married now, and you&amp;#39;d be taking a &lt;strong&gt;huge&lt;/strong&gt; risk.&lt;/p&gt;\n\n&lt;p&gt;Seriously, just wait.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg656ai", "score_hidden": false, "stickied": false, "created": 1492044449.0, "created_utc": 1492015649.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64rx1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg62lht", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Neither of us are interested in cancelling, and I don't see him as not being a husband that I \"need\". I have been with him for a long time, and I'm willing to work through this with him. We are relocating very far away from his parents next year. Our wedding is 18 months away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Neither of us are interested in cancelling, and I don&amp;#39;t see him as not being a husband that I &amp;quot;need&amp;quot;. I have been with him for a long time, and I&amp;#39;m willing to work through this with him. We are relocating very far away from his parents next year. Our wedding is 18 months away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg64rx1", "score_hidden": false, "stickied": false, "created": 1492044036.0, "created_utc": 1492015236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62lht", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_goodzilla_", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This sounds like PTSD.\n\nThis is very fixable, but now is NOT the time to get married. You guys are SO young. Your futures are uncertain. He's not ready to be the husband you need.\n\nBe honest with him and cancel the wedding.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds like PTSD.&lt;/p&gt;\n\n&lt;p&gt;This is very fixable, but now is NOT the time to get married. You guys are SO young. Your futures are uncertain. He&amp;#39;s not ready to be the husband you need.&lt;/p&gt;\n\n&lt;p&gt;Be honest with him and cancel the wedding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg62lht", "score_hidden": false, "stickied": false, "created": 1492041732.0, "created_utc": 1492012932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg65tjj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thanks for your suggestion. I'm going to politely look at other alternatives to fix this, goodzilla", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your suggestion. I&amp;#39;m going to politely look at other alternatives to fix this, goodzilla&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg65tjj", "score_hidden": false, "stickied": false, "created": 1492045119.0, "created_utc": 1492016319.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64w9ed", "likes": null, "replies": "", "user_reports": [], "id": "dg6mkxn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tmb_321", "parent_id": "t1_dg6kaoa", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Not marrying anyone for another 18 months. Working on fixing this issue in the meantime.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not marrying anyone for another 18 months. Working on fixing this issue in the meantime.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6mkxn", "score_hidden": false, "stickied": false, "created": 1492062710.0, "created_utc": 1492033910.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kaoa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "switch_bitch", "parent_id": "t3_64w9ed", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; make me act like that.\n\ndoesn't take responsibility for his behaviour\n\nPostpone the wedding till this is sorted to your satisfaction. Don't marry him yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;make me act like that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;doesn&amp;#39;t take responsibility for his behaviour&lt;/p&gt;\n\n&lt;p&gt;Postpone the wedding till this is sorted to your satisfaction. Don&amp;#39;t marry him yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6kaoa", "score_hidden": false, "stickied": false, "created": 1492060023.0, "created_utc": 1492031223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]