[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the long one! I&amp;#39;m 21f and he&amp;#39;s 24m. We met off of an online dating app and on our first date  we had an amazing/instant connection, we met up almost every single day since our first date, there were never any doubts about our feelings for one another. We said I love you within the first 3 weeks because we just knew. 2 years later we&amp;#39;re still together and have been living together for the past year. \nCertain aspects of our relationship are amazing - he&amp;#39;s my best friend, we have the same sense of humour, have the same things in common (gaming/movies/outdoor activities), even though we spend so much time together we never seem to get sick of each other. Elements of our personality just click really well.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve been planning on moving over east together because he used to live there and loves it. I don&amp;#39;t have a strong opinion about moving but I have been questioning the relationship in general and whether it might be a mistake.\nIn terms if issues in the relationship there&amp;#39;s two bothering me:- \n1. He&amp;#39;s not affectionate or romantic in anyway. I always feel like I put in effort to make him feel special (make him lunches, buy him treats/special things just because, spice things up in the bedroom, tell he looks good/handsome randomly). I never get any of this in return. We&amp;#39;ve spoken about this in the past and he&amp;#39;s tried a little bit to improve -I.e tell me I look good when I get dressed up but overall there&amp;#39;s not been much change and I rarely get affection/romance from him at all. This issue isn&amp;#39;t a major one; though once in a blue moon it does make me feel like I might be &amp;quot;missing out&amp;quot; when it comes to affection. Which does plant a seed of doubt. \n2. The Biggest issue in the relationship is his flirty/outgoing personality. When he&amp;#39;s intoxicated he&amp;#39;s very hands on with everyone but sometimes he has crossed the line with his behaviour or actions towards women. He&amp;#39;s never physically cheated (as in kissed/sexual touched a woman) but he has gotten too friendly/hands-on for my liking (overly hugging, putting arm round women we just met in our social circles). I understand he can be like this in general to both genders but I&amp;#39;ve spoken to him and told him I&amp;#39;d appreciate him being a bit more respectful and I don&amp;#39;t find it enjoyable to see him getting so hands on with other women. He&amp;#39;s assured me there&amp;#39;s no intention behind his behaviour, I&amp;#39;m the only one he wants, etc. but it has shaken my trust in him a little. It makes me question if he behaves like that while I&amp;#39;m around is he even worse when I&amp;#39;m not present? Or is that just how he is and he&amp;#39;s honest in his intentions? \nTrust and faithfulness are extremely important to me and his occasional behaviour has really shaken my feelings about our relationship. &lt;/p&gt;\n\n&lt;p&gt;Do you think these two issues are something we can work around? He&amp;#39;s told me he wants to grow and change for the better after a big fight we had a month ago. I want to believe him but there&amp;#39;s not a lot of time to make a decision as our moving date is in 3 months. \nI&amp;#39;m terrified about making a massive mistake. I don&amp;#39;t want to leave my friends/family/connections here for a man who might not be right/the one for me. \nOn the other hand I also don&amp;#39;t know how rare our relationship is, is it hard to find a real genuine connection like this with another human being? I don&amp;#39;t want to throw away what we have and never find another person I click with like I do him. I&amp;#39;m worried I have unrealistic expectations towards relationships, and it would be silly to end a relationship because of two issues. &lt;/p&gt;\n\n&lt;p&gt;In this position what would you do? Would you move over with you partner? Or call things off?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m extremely conflicted so I would deeply appreciate any advice at all. Thank you :) xx &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry for the long one! I'm 21f and he's 24m. We met off of an online dating app and on our first date  we had an amazing/instant connection, we met up almost every single day since our first date, there were never any doubts about our feelings for one another. We said I love you within the first 3 weeks because we just knew. 2 years later we're still together and have been living together for the past year. \nCertain aspects of our relationship are amazing - he's my best friend, we have the same sense of humour, have the same things in common (gaming/movies/outdoor activities), even though we spend so much time together we never seem to get sick of each other. Elements of our personality just click really well.\n\nWe've been planning on moving over east together because he used to live there and loves it. I don't have a strong opinion about moving but I have been questioning the relationship in general and whether it might be a mistake.\nIn terms if issues in the relationship there's two bothering me:- \n1. He's not affectionate or romantic in anyway. I always feel like I put in effort to make him feel special (make him lunches, buy him treats/special things just because, spice things up in the bedroom, tell he looks good/handsome randomly). I never get any of this in return. We've spoken about this in the past and he's tried a little bit to improve -I.e tell me I look good when I get dressed up but overall there's not been much change and I rarely get affection/romance from him at all. This issue isn't a major one; though once in a blue moon it does make me feel like I might be \"missing out\" when it comes to affection. Which does plant a seed of doubt. \n2. The Biggest issue in the relationship is his flirty/outgoing personality. When he's intoxicated he's very hands on with everyone but sometimes he has crossed the line with his behaviour or actions towards women. He's never physically cheated (as in kissed/sexual touched a woman) but he has gotten too friendly/hands-on for my liking (overly hugging, putting arm round women we just met in our social circles). I understand he can be like this in general to both genders but I've spoken to him and told him I'd appreciate him being a bit more respectful and I don't find it enjoyable to see him getting so hands on with other women. He's assured me there's no intention behind his behaviour, I'm the only one he wants, etc. but it has shaken my trust in him a little. It makes me question if he behaves like that while I'm around is he even worse when I'm not present? Or is that just how he is and he's honest in his intentions? \nTrust and faithfulness are extremely important to me and his occasional behaviour has really shaken my feelings about our relationship. \n\nDo you think these two issues are something we can work around? He's told me he wants to grow and change for the better after a big fight we had a month ago. I want to believe him but there's not a lot of time to make a decision as our moving date is in 3 months. \nI'm terrified about making a massive mistake. I don't want to leave my friends/family/connections here for a man who might not be right/the one for me. \nOn the other hand I also don't know how rare our relationship is, is it hard to find a real genuine connection like this with another human being? I don't want to throw away what we have and never find another person I click with like I do him. I'm worried I have unrealistic expectations towards relationships, and it would be silly to end a relationship because of two issues. \n\nIn this position what would you do? Would you move over with you partner? Or call things off?\n\nI'm extremely conflicted so I would deeply appreciate any advice at all. Thank you :) xx ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wjp7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "corgilover225", "saved": false, "mod_reports": [], "name": "t3_64wjp7", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/64wjp7/deeply_conflicted_about_staying_in_relationship/", "num_reports": null, "locked": false, "stickied": false, "created": 1492007788.0, "url": "https://www.reddit.com/r/relationship_advice/comments/64wjp7/deeply_conflicted_about_staying_in_relationship/", "author_flair_text": null, "quarantine": false, "title": "Deeply conflicted about staying in relationship, don't want to make a massive mistake.", "created_utc": 1491978988.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": "", "user_reports": [], "id": "dg7f8b9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "corgilover225", "parent_id": "t1_dg792qs", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah that scenario in general kinda left a poor taste in my mouth, I guess considering it was only a few weeks ago it's still a little bit raw. \nI'm graduating my degree in June (will be an RN) so I'll be looking for a graduate program - which lasts for 1-2 years. Think that's his urgency to move as if I get one here that means he'll be stuck here for another year or so until I finish it. He really dislikes this state and wants to move back east. \nI think you're right though about delaying the move though if it's possible, think I need more time to reflect on the relationship.\n\nI agree we're both young, I'm in no way rushing to get married or have kids, or anything like that - that's wayyyyy down the line for me. I guess I'm just fearful of making a mistake I regret. With it being my first time in long term relationship I guess I don't entirely know what doubts are normal in a relationship and what are red flags! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah that scenario in general kinda left a poor taste in my mouth, I guess considering it was only a few weeks ago it&amp;#39;s still a little bit raw. \nI&amp;#39;m graduating my degree in June (will be an RN) so I&amp;#39;ll be looking for a graduate program - which lasts for 1-2 years. Think that&amp;#39;s his urgency to move as if I get one here that means he&amp;#39;ll be stuck here for another year or so until I finish it. He really dislikes this state and wants to move back east. \nI think you&amp;#39;re right though about delaying the move though if it&amp;#39;s possible, think I need more time to reflect on the relationship.&lt;/p&gt;\n\n&lt;p&gt;I agree we&amp;#39;re both young, I&amp;#39;m in no way rushing to get married or have kids, or anything like that - that&amp;#39;s wayyyyy down the line for me. I guess I&amp;#39;m just fearful of making a mistake I regret. With it being my first time in long term relationship I guess I don&amp;#39;t entirely know what doubts are normal in a relationship and what are red flags! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7f8b9", "score_hidden": false, "stickied": false, "created": 1492111868.0, "created_utc": 1492083068.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg792qs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "i_cast_spells", "parent_id": "t1_dg76xlz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You know, the more details and context you give, the more negative they become... I wonder if that says something. In any case, this is clearly casting a huge doubt on your mind; will the move require you to find new jobs? Schools? You said he's moving \"because he liked it there.\" So there doesn't seem to be a sense of urgency. Why not talk about delaying it so you have more time to think about the relationship?\n\nAlso, you met him when you were 19 - I'm in no way saying that you can't find the one at that age, but it's still on the early side. No need to hurry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, the more details and context you give, the more negative they become... I wonder if that says something. In any case, this is clearly casting a huge doubt on your mind; will the move require you to find new jobs? Schools? You said he&amp;#39;s moving &amp;quot;because he liked it there.&amp;quot; So there doesn&amp;#39;t seem to be a sense of urgency. Why not talk about delaying it so you have more time to think about the relationship?&lt;/p&gt;\n\n&lt;p&gt;Also, you met him when you were 19 - I&amp;#39;m in no way saying that you can&amp;#39;t find the one at that age, but it&amp;#39;s still on the early side. No need to hurry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg792qs", "score_hidden": false, "stickied": false, "created": 1492094390.0, "created_utc": 1492065590.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76xlz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "corgilover225", "parent_id": "t1_dg66ahe", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah I have no issue with hugging or putting arms round shoulders/etc. that's normal and ok. But I felt like the body touching while she was heavily flirting with him really crossed a line in terms of boundaries and respect. \n\nTo be honest his last 3 year long relationship failed for this exact reason. She dumped him because his behaviour towards other women wasn't ok at times. I think he'll have a hard time finding any person whose ok with that to be honest. If the roles were reversed and I was putting my hands and getting overly friendly with men I know for a fact that he wouldn't be ok with it. \n\nThat big fight we had was me pretty much going \"That's really disrespectful in my eyes, I don't think we can be together if you think that kind of behaviour is ok\". I told him if I'm not what he wants in life or he's still in that \"I want to sleep around with slags\" phase then we should definitely split.\nHis response was telling me he knew what he did crossed the line, and he was apologetic about it. Told me he had no intention behind his actions though he says he doesn't really remember much due to how drunk he was. Then he admits if the roles were reversed then the situation would have been a lot worse because he would have lost it with me (which I think speaks volumes). He told me he's going to cut down on drinking and wants to grow up a bit. That he doesn't want to sleep with random girls because that kind of sex means nothing to him. \n\nI'm trying to trust him and give him the benefit of the doubt when he says he wants to change for the better but I can't help but be a bit fearful that he's playing me for the fool or we simply aren't compatible - especially with the notion of moving different states is involved too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I have no issue with hugging or putting arms round shoulders/etc. that&amp;#39;s normal and ok. But I felt like the body touching while she was heavily flirting with him really crossed a line in terms of boundaries and respect. &lt;/p&gt;\n\n&lt;p&gt;To be honest his last 3 year long relationship failed for this exact reason. She dumped him because his behaviour towards other women wasn&amp;#39;t ok at times. I think he&amp;#39;ll have a hard time finding any person whose ok with that to be honest. If the roles were reversed and I was putting my hands and getting overly friendly with men I know for a fact that he wouldn&amp;#39;t be ok with it. &lt;/p&gt;\n\n&lt;p&gt;That big fight we had was me pretty much going &amp;quot;That&amp;#39;s really disrespectful in my eyes, I don&amp;#39;t think we can be together if you think that kind of behaviour is ok&amp;quot;. I told him if I&amp;#39;m not what he wants in life or he&amp;#39;s still in that &amp;quot;I want to sleep around with slags&amp;quot; phase then we should definitely split.\nHis response was telling me he knew what he did crossed the line, and he was apologetic about it. Told me he had no intention behind his actions though he says he doesn&amp;#39;t really remember much due to how drunk he was. Then he admits if the roles were reversed then the situation would have been a lot worse because he would have lost it with me (which I think speaks volumes). He told me he&amp;#39;s going to cut down on drinking and wants to grow up a bit. That he doesn&amp;#39;t want to sleep with random girls because that kind of sex means nothing to him. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m trying to trust him and give him the benefit of the doubt when he says he wants to change for the better but I can&amp;#39;t help but be a bit fearful that he&amp;#39;s playing me for the fool or we simply aren&amp;#39;t compatible - especially with the notion of moving different states is involved too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg76xlz", "score_hidden": false, "stickied": false, "created": 1492089569.0, "created_utc": 1492060769.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66ahe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "i_cast_spells", "parent_id": "t1_dg64c9j", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think hugging is pretty normal, at least in  Western societies. But when you said that he put his hands on the woman's waist and back while she was obviously flirting with him, my opinion moved a bit towards the not-okay side, especially because you said youve already talked to him about these things. Again, that's just an opinion of an internet stranger who doesn't know what you're like day in and day out. :)\n\nIf he didn't mean anything by it and yet you're not happy with it, that just means you two aren't compatible. It doesn't mean one of you has to be wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think hugging is pretty normal, at least in  Western societies. But when you said that he put his hands on the woman&amp;#39;s waist and back while she was obviously flirting with him, my opinion moved a bit towards the not-okay side, especially because you said youve already talked to him about these things. Again, that&amp;#39;s just an opinion of an internet stranger who doesn&amp;#39;t know what you&amp;#39;re like day in and day out. :)&lt;/p&gt;\n\n&lt;p&gt;If he didn&amp;#39;t mean anything by it and yet you&amp;#39;re not happy with it, that just means you two aren&amp;#39;t compatible. It doesn&amp;#39;t mean one of you has to be wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg66ahe", "score_hidden": false, "stickied": false, "created": 1492045597.0, "created_utc": 1492016797.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64c9j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "corgilover225", "parent_id": "t1_dg602o9", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "When someone is heavily flirting with you and your response is putting your hands on their body and encouraging their behaviour - how is that not being disrespectful to your relationship?\n\n&gt;too jittery about something in the real world is not a big deal\n\nDid I say what happened was a life shattering event for any one who experienced it? No. \nDid I say I personally found it disrespectful to the relationship and it kinda broke my trust in him? Yes. \nPersonally trust and faithfulness is a big deal to me. I don't want to be with someone I can't genuinely trust, it just seems like a hollow relationship to me. \n\nI've never wanted to be the kind of person who only lives in one place their entire lives, moving states is an exciting concept for me. However I don't want to move somewhere specifically for the wrong reasons and I don't want to drag my entire life over there if I'm not 100% sure about the relationship as a whole. ", "edited": 1492015227.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When someone is heavily flirting with you and your response is putting your hands on their body and encouraging their behaviour - how is that not being disrespectful to your relationship?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;too jittery about something in the real world is not a big deal&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Did I say what happened was a life shattering event for any one who experienced it? No. \nDid I say I personally found it disrespectful to the relationship and it kinda broke my trust in him? Yes. \nPersonally trust and faithfulness is a big deal to me. I don&amp;#39;t want to be with someone I can&amp;#39;t genuinely trust, it just seems like a hollow relationship to me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never wanted to be the kind of person who only lives in one place their entire lives, moving states is an exciting concept for me. However I don&amp;#39;t want to move somewhere specifically for the wrong reasons and I don&amp;#39;t want to drag my entire life over there if I&amp;#39;m not 100% sure about the relationship as a whole. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg64c9j", "score_hidden": false, "stickied": false, "created": 1492043584.0, "created_utc": 1492014784.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg602o9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "killertofue", "parent_id": "t1_dg5ytji", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Tbh... You sound a little too jittery about something that in the real world is not a big deal. Putting your hand on someones waist =/= going to cheat on you, and its barely disrespectful. I dunno, but.. I think you're making a bigger deal out of a small issue when the big issue is you're scared to move away from home with him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tbh... You sound a little too jittery about something that in the real world is not a big deal. Putting your hand on someones waist =/= going to cheat on you, and its barely disrespectful. I dunno, but.. I think you&amp;#39;re making a bigger deal out of a small issue when the big issue is you&amp;#39;re scared to move away from home with him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg602o9", "score_hidden": false, "stickied": false, "created": 1492038973.0, "created_utc": 1492010173.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ytji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "corgilover225", "parent_id": "t1_dg5tonh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah normally he's not too bad in regards to how handsy he is (just like the examples I mentioned of hugging/etc - which I don't mind as he's like that with everyone). However a month ago he crossed the line majorly (hence the big fight) putting his hands on another woman's waist and back - she was really into and flirting with him which is why the scenario was not ok. Doing that was very disrespectful in my eyes and made me almost call off the relationship. It's really what's causing me to question the foundations of our relationship as a whole to be honest. \nYou're right though, I guess ultimately only I know what I'm happy with. Think largely because this is the first time I've been in love I'm just a bit uncertain about if what we have is hard to come by and something to fight for or not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah normally he&amp;#39;s not too bad in regards to how handsy he is (just like the examples I mentioned of hugging/etc - which I don&amp;#39;t mind as he&amp;#39;s like that with everyone). However a month ago he crossed the line majorly (hence the big fight) putting his hands on another woman&amp;#39;s waist and back - she was really into and flirting with him which is why the scenario was not ok. Doing that was very disrespectful in my eyes and made me almost call off the relationship. It&amp;#39;s really what&amp;#39;s causing me to question the foundations of our relationship as a whole to be honest. \nYou&amp;#39;re right though, I guess ultimately only I know what I&amp;#39;m happy with. Think largely because this is the first time I&amp;#39;ve been in love I&amp;#39;m just a bit uncertain about if what we have is hard to come by and something to fight for or not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ytji", "score_hidden": false, "stickied": false, "created": 1492037563.0, "created_utc": 1492008763.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tonh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "i_cast_spells", "parent_id": "t3_64wjp7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Personally, the two issues you listed do not seem to be red flags or anything. We obviously don't know how handsy he gets or just how un-romantic he is. Ultimately, it's up to you to decide whether or not you can be happy with him long term - even lifetime - if he does not change in those aspects.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, the two issues you listed do not seem to be red flags or anything. We obviously don&amp;#39;t know how handsy he gets or just how un-romantic he is. Ultimately, it&amp;#39;s up to you to decide whether or not you can be happy with him long term - even lifetime - if he does not change in those aspects.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5tonh", "score_hidden": false, "stickied": false, "created": 1492030901.0, "created_utc": 1492002101.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": "", "user_reports": [], "id": "dg5ydfy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "corgilover225", "parent_id": "t1_dg5nfsi", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Ah ok, I understand what you mean by that now, thank you. Interesting to hear that you see yourself a lot in my current partner, I'll try and take from that. \n\nYeah I have mixed feeling about the \"frisky\" thing haha I get what you mean but I personally don't feel like I should have to throw myself at him so he's not getting too full on with other women. I think that's just something the two of us need to work on to grow as a couple :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah ok, I understand what you mean by that now, thank you. Interesting to hear that you see yourself a lot in my current partner, I&amp;#39;ll try and take from that. &lt;/p&gt;\n\n&lt;p&gt;Yeah I have mixed feeling about the &amp;quot;frisky&amp;quot; thing haha I get what you mean but I personally don&amp;#39;t feel like I should have to throw myself at him so he&amp;#39;s not getting too full on with other women. I think that&amp;#39;s just something the two of us need to work on to grow as a couple :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5ydfy", "score_hidden": false, "stickied": false, "created": 1492037058.0, "created_utc": 1492008258.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nfsi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "killertofue", "parent_id": "t1_dg5nbns", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I haven't changed at all actually. Changing implies there was a problem, and simply put, there wasn't. Being inexperienced is not inherently a negative. If anything it only makes the results of growing together that much stronger and sweeter. \n\nMy ex used to say the saaaaaame thing about me. She would call me handsome and I'd grunt and fart and forget: \"hey, this beautiful human being loves me and is trying to tell me and show me that.. I should reciprocate because I feel the same way!!\" It takes some time and effort but once learned its like riding a bike. \n\nLike I said if your guy is anything at all like me - and he sounds almost exactly like me - he really cherishes and adores you but just doesn't know how to accurately portray it. He probably feels frustrated and bumbling. Give it time! \n\nAs for the frisky nature, like I said. Just insert yourself and you'll be the recipient of all his hugs and affection. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t changed at all actually. Changing implies there was a problem, and simply put, there wasn&amp;#39;t. Being inexperienced is not inherently a negative. If anything it only makes the results of growing together that much stronger and sweeter. &lt;/p&gt;\n\n&lt;p&gt;My ex used to say the saaaaaame thing about me. She would call me handsome and I&amp;#39;d grunt and fart and forget: &amp;quot;hey, this beautiful human being loves me and is trying to tell me and show me that.. I should reciprocate because I feel the same way!!&amp;quot; It takes some time and effort but once learned its like riding a bike. &lt;/p&gt;\n\n&lt;p&gt;Like I said if your guy is anything at all like me - and he sounds almost exactly like me - he really cherishes and adores you but just doesn&amp;#39;t know how to accurately portray it. He probably feels frustrated and bumbling. Give it time! &lt;/p&gt;\n\n&lt;p&gt;As for the frisky nature, like I said. Just insert yourself and you&amp;#39;ll be the recipient of all his hugs and affection. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5nfsi", "score_hidden": false, "stickied": false, "created": 1492015782.0, "created_utc": 1491986982.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nbns", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "corgilover225", "parent_id": "t1_dg5mz0q", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you for your perspective on the whole matter, much appreciated :)\nYeah I try not to be too hard on the romance thing because I know a lot of guys struggle with that in general and I shouldn't take it personally haha but thank you for the advice on the book, will look into it. I don't expect to be wooed 24/7 but something nice every once in a while would be lovely \n\nYou said you kinda see yourself in what I described of him. Would you say you've changed over the years? \n\nThank you again. This is my first serious relationship and the first time I've ever been in love. It's nice to know you consider what we have as rare. Think I'll definitely try and see if we can work through the little issues before thinking twice about what we have. Cheers ! :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your perspective on the whole matter, much appreciated :)\nYeah I try not to be too hard on the romance thing because I know a lot of guys struggle with that in general and I shouldn&amp;#39;t take it personally haha but thank you for the advice on the book, will look into it. I don&amp;#39;t expect to be wooed 24/7 but something nice every once in a while would be lovely &lt;/p&gt;\n\n&lt;p&gt;You said you kinda see yourself in what I described of him. Would you say you&amp;#39;ve changed over the years? &lt;/p&gt;\n\n&lt;p&gt;Thank you again. This is my first serious relationship and the first time I&amp;#39;ve ever been in love. It&amp;#39;s nice to know you consider what we have as rare. Think I&amp;#39;ll definitely try and see if we can work through the little issues before thinking twice about what we have. Cheers ! :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5nbns", "score_hidden": false, "stickied": false, "created": 1492015424.0, "created_utc": 1491986624.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mz0q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "killertofue", "parent_id": "t3_64wjp7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "In no way am I making an assumption here but this dude sounds like me when I was around his age and if thats the truth heres the deal:\n\nHe is so stupid into you that every action he makes towards you he does on eggshells. He doesn't quite understand the whole affection/romance thing either, to which I would seriously suggest a book like 1001 Ways to be Romantic. Tell him that as a woman its just a little something you NEED for him to add to his personality, cause its true. We guys are thoughtless and all too often non-empathetic. We just dont get it and a good read like that would help.\n\nDon't mind his actions when he's imbibed. If anything, you should see that hes happy. But if you're that worried, when he gets all drunky, position yourself close by and soak up allllll the p.d.a. \n\nEdit: imo; you guys have something good. Spending everyday with your s.o. and not getting sick of them is rare. Make him study some romance tips, come enoy the east coast together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In no way am I making an assumption here but this dude sounds like me when I was around his age and if thats the truth heres the deal:&lt;/p&gt;\n\n&lt;p&gt;He is so stupid into you that every action he makes towards you he does on eggshells. He doesn&amp;#39;t quite understand the whole affection/romance thing either, to which I would seriously suggest a book like 1001 Ways to be Romantic. Tell him that as a woman its just a little something you NEED for him to add to his personality, cause its true. We guys are thoughtless and all too often non-empathetic. We just dont get it and a good read like that would help.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t mind his actions when he&amp;#39;s imbibed. If anything, you should see that hes happy. But if you&amp;#39;re that worried, when he gets all drunky, position yourself close by and soak up allllll the p.d.a. &lt;/p&gt;\n\n&lt;p&gt;Edit: imo; you guys have something good. Spending everyday with your s.o. and not getting sick of them is rare. Make him study some romance tips, come enoy the east coast together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5mz0q", "score_hidden": false, "stickied": false, "created": 1492014335.0, "created_utc": 1491985535.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_64wjp7", "likes": null, "replies": "", "user_reports": [], "id": "dg64ik7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "corgilover225", "parent_id": "t1_dg5z57c", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you for taking the time to reply. That's an interesting perspective I never thought of and after thinking about it his father isn't a very affectionate man so you could really be into something with that. Definitely will try and slowly work through things with him in that regard :) thanks again! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for taking the time to reply. That&amp;#39;s an interesting perspective I never thought of and after thinking about it his father isn&amp;#39;t a very affectionate man so you could really be into something with that. Definitely will try and slowly work through things with him in that regard :) thanks again! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg64ik7", "score_hidden": false, "stickied": false, "created": 1492043766.0, "created_utc": 1492014966.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5z57c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "savvyxxl", "parent_id": "t3_64wjp7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He may have come a family (specifically a father) that did not really show affection. My grandpa was like that with my dad and now my dad never hugs me or tells me he loves or anything like that. I know he does but he just doesnt say it because thats how he was raised. Its sadly not uncommon with men to be raised without affection. What ends up happening is when they get drunk they no longer think about it and can let loose and its all this pent up loving affection pouring out. Again my dads the same way hes very loving when hes drunk.... That all being said this is really not a deal breaker and shouldnt be for you, its something you need to work on with him showing him affection and working with him on it. Its not gonna happen overnight and you need to accept that. Imagine if every day people told you that hugging was bad, you would grow up not wanting to hug anyone. Thats kind of how it is for some people, they may not vocalize it but they make the kid feel like certain signs of affection are wrong or not manly. Men are also taught not to cry or show emotion and that ends up causing issues in relationships as well. Be patient and understanding with him ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He may have come a family (specifically a father) that did not really show affection. My grandpa was like that with my dad and now my dad never hugs me or tells me he loves or anything like that. I know he does but he just doesnt say it because thats how he was raised. Its sadly not uncommon with men to be raised without affection. What ends up happening is when they get drunk they no longer think about it and can let loose and its all this pent up loving affection pouring out. Again my dads the same way hes very loving when hes drunk.... That all being said this is really not a deal breaker and shouldnt be for you, its something you need to work on with him showing him affection and working with him on it. Its not gonna happen overnight and you need to accept that. Imagine if every day people told you that hugging was bad, you would grow up not wanting to hug anyone. Thats kind of how it is for some people, they may not vocalize it but they make the kid feel like certain signs of affection are wrong or not manly. Men are also taught not to cry or show emotion and that ends up causing issues in relationships as well. Be patient and understanding with him &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg5z57c", "score_hidden": false, "stickied": false, "created": 1492037930.0, "created_utc": 1492009130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]