[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone,&lt;/p&gt;\n\n&lt;p&gt;I really appreciate you taking a moment to help me out here. My bf and I have had three very rocky years. The first was filled with each of us doing very thoughtful and sweet things for one another, moving in together and spending a lot of family time together. But, behind closed doors we also had a lot of drunk arguments and even one-day break ups/makeups. By year two, we slowed down drinking (I stopped drinking altogether), and became an extremely well functioning-team that runs a great home. I felt that I was falling more and more in love with him, his family, and so happy that I could picture the rest of our lives together. However, towards the end of year 2 we had a serious fight (with cops involved) and faced a very serious break up. My bf became depressed and stopped doing all the &amp;quot;little sweet things&amp;quot;, I also found out he had online dating profiles and was talking to other women. I felt that our entire future was ripped away, and had a hard time re-building things with him, but we endured it. &lt;/p&gt;\n\n&lt;p&gt;A few months later we seemed to be back on track and he was being sweet, thoughtful and funny, but I confronted him because I had a lingering, unsettling fear from our previous, harsh fight: should we be together if we&amp;#39;re unsure about us ever even marrying? The conversation steered into discussing our different styles of confrontation (I am and he&amp;#39;s not), personal attacks (I cry too much, I TALK too much), and sexuality (I want too much). After this discussion, we broke up and I left. It was really hard and I was so overwhelmed with finding a place to stay, or a place to put my things. So, I decided to go see him one last time &amp;quot;to make sure&amp;quot;. Well, he wasn&amp;#39;t sure, and I was happy to try us out again. But now, at year 3, is the first time that I don&amp;#39;t feel that I am in love with him. I do love him though! He does ALL of the small things (no joke!), we have a great sense of humor and so many inside jokes, and I love, love, love his family! I wonder often if I will ever find someone that I click with as much as him? &lt;/p&gt;\n\n&lt;p&gt;Now, I feel that I have a new &amp;quot;carefree attitude&amp;quot; and am going to be me and not hold back. However, even though I feel that my wall never quite came down and I have a mentality that I will endure this if it drives us together or apart, I still do the small things for him and am affectionate because I love him. By the same token, I can hardly bring myself to make sexual advances anymore because I just don&amp;#39;t feel it...and he used to never want to do anything with me, but now he tries. He used to shut me down harshly in the past, and now I fear shutting him down.  It&amp;#39;s like he has suddenly had an epiphany that he doesn&amp;#39;t want to lose me, and is going out of his way to do things for me. I don&amp;#39;t take advantage of it, but I feel guilty that I am continuing the relationship with this inside of me. It really makes me wonder because I think he is total great husband material, and if it would be best for me to try and forgive him for his harsh words and actions towards me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read so many articles that say &amp;quot;marriage is unlike the movies&amp;quot;, but doesn&amp;#39;t it mean to still be in love with your partner? I think it&amp;#39;s possible for us (or me) to fall back in love with him, but I wonder if it&amp;#39;s best? Would I be settling? Or is this just how it goes? I think that most of our friends and family expect us to marry and want us to, (hell, I think we do too) but I find it hard to commit to the idea now because so often, when we argue, he wants to break it off. I don&amp;#39;t know how he feels about it because the last time we spoke, we broke up! This time, he seems to be fully committed to us though. We&amp;#39;ve even discussed moving to the East Coast so that I can advance my career and he can return to be near friends. But this concerns me because I wonder if it would mean we ride this out longer until we break up again, or I almost fear that he or I are going to try to make it work at all costs, until one day, ten years down the line. &lt;/p&gt;\n\n&lt;p&gt;Sometimes I think the best thing to do would be for me to sit down and talk to him about it, but I fear it would lead to another argument where he wants to break up...and then we do this all over again. He truly is a great man, that will be a wonderful husband, but I wonder if we&amp;#39;re not a good fit or we just need to stick it out. Please help, what should I do?&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading!! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everyone,\n\nI really appreciate you taking a moment to help me out here. My bf and I have had three very rocky years. The first was filled with each of us doing very thoughtful and sweet things for one another, moving in together and spending a lot of family time together. But, behind closed doors we also had a lot of drunk arguments and even one-day break ups/makeups. By year two, we slowed down drinking (I stopped drinking altogether), and became an extremely well functioning-team that runs a great home. I felt that I was falling more and more in love with him, his family, and so happy that I could picture the rest of our lives together. However, towards the end of year 2 we had a serious fight (with cops involved) and faced a very serious break up. My bf became depressed and stopped doing all the \"little sweet things\", I also found out he had online dating profiles and was talking to other women. I felt that our entire future was ripped away, and had a hard time re-building things with him, but we endured it. \n\n\nA few months later we seemed to be back on track and he was being sweet, thoughtful and funny, but I confronted him because I had a lingering, unsettling fear from our previous, harsh fight: should we be together if we're unsure about us ever even marrying? The conversation steered into discussing our different styles of confrontation (I am and he's not), personal attacks (I cry too much, I TALK too much), and sexuality (I want too much). After this discussion, we broke up and I left. It was really hard and I was so overwhelmed with finding a place to stay, or a place to put my things. So, I decided to go see him one last time \"to make sure\". Well, he wasn't sure, and I was happy to try us out again. But now, at year 3, is the first time that I don't feel that I am in love with him. I do love him though! He does ALL of the small things (no joke!), we have a great sense of humor and so many inside jokes, and I love, love, love his family! I wonder often if I will ever find someone that I click with as much as him? \n\n\nNow, I feel that I have a new \"carefree attitude\" and am going to be me and not hold back. However, even though I feel that my wall never quite came down and I have a mentality that I will endure this if it drives us together or apart, I still do the small things for him and am affectionate because I love him. By the same token, I can hardly bring myself to make sexual advances anymore because I just don't feel it...and he used to never want to do anything with me, but now he tries. He used to shut me down harshly in the past, and now I fear shutting him down.  It's like he has suddenly had an epiphany that he doesn't want to lose me, and is going out of his way to do things for me. I don't take advantage of it, but I feel guilty that I am continuing the relationship with this inside of me. It really makes me wonder because I think he is total great husband material, and if it would be best for me to try and forgive him for his harsh words and actions towards me. \n\n\nI've read so many articles that say \"marriage is unlike the movies\", but doesn't it mean to still be in love with your partner? I think it's possible for us (or me) to fall back in love with him, but I wonder if it's best? Would I be settling? Or is this just how it goes? I think that most of our friends and family expect us to marry and want us to, (hell, I think we do too) but I find it hard to commit to the idea now because so often, when we argue, he wants to break it off. I don't know how he feels about it because the last time we spoke, we broke up! This time, he seems to be fully committed to us though. We've even discussed moving to the East Coast so that I can advance my career and he can return to be near friends. But this concerns me because I wonder if it would mean we ride this out longer until we break up again, or I almost fear that he or I are going to try to make it work at all costs, until one day, ten years down the line. \n\nSometimes I think the best thing to do would be for me to sit down and talk to him about it, but I fear it would lead to another argument where he wants to break up...and then we do this all over again. He truly is a great man, that will be a wonderful husband, but I wonder if we're not a good fit or we just need to stick it out. Please help, what should I do?\n\nThanks for reading!! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6500q0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "shenannigator", "saved": false, "mod_reports": [], "name": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492023460.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/6500q0/i_28f_love_my_boyfriend_30m_of_3_years_but_dont/", "num_reports": null, "locked": false, "stickied": false, "created": 1492050595.0, "url": "https://www.reddit.com/r/relationship_advice/comments/6500q0/i_28f_love_my_boyfriend_30m_of_3_years_but_dont/", "author_flair_text": null, "quarantine": false, "title": "I [28f] love my boyfriend [30m] of 3 years, but don't see myself marrying him. Is it okay to stay together or should we break up?", "created_utc": 1492021795.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 28, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg7k3mt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Daemon42", "parent_id": "t1_dg6yqe6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Life never is black and white.  People think there is a \"I just know\" thing about marriage - truth is even if you do feel that way, it's likely that you are ignorant to things that would make you pause.\n\nYou have honest reasons to doubt if this is the person you'd want to marry - that doesn't mean you have to just suicide this relationship - spend time looking at it and communicating with him about these things and stuff will work out (either together or parting ways, but you both will do so under the light of reason).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life never is black and white.  People think there is a &amp;quot;I just know&amp;quot; thing about marriage - truth is even if you do feel that way, it&amp;#39;s likely that you are ignorant to things that would make you pause.&lt;/p&gt;\n\n&lt;p&gt;You have honest reasons to doubt if this is the person you&amp;#39;d want to marry - that doesn&amp;#39;t mean you have to just suicide this relationship - spend time looking at it and communicating with him about these things and stuff will work out (either together or parting ways, but you both will do so under the light of reason).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7k3mt", "score_hidden": false, "stickied": false, "created": 1492119910.0, "created_utc": 1492091110.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yqe6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6p3d8", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "It's not so black and white -- we both want to marry one day (possibly each other), but we're both unsure that we are the best for each other, given all our fallouts. So, I am trying to figure out if we are wasting each other's time, leading each other on by almost inching around the next big fight, or if in the end we'll find a way to make it work. I know I used to feel that 100% this was who I wanted to marry, but I feel like he's broken my heart (when he breaks up with me) so many times that it's hard to feel that same energy that I used to have. Meanwhile, I think he senses it, and still we're both trying to make it work. But we're still not tackling our issues, so we need to figure something out for the best of both of us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not so black and white -- we both want to marry one day (possibly each other), but we&amp;#39;re both unsure that we are the best for each other, given all our fallouts. So, I am trying to figure out if we are wasting each other&amp;#39;s time, leading each other on by almost inching around the next big fight, or if in the end we&amp;#39;ll find a way to make it work. I know I used to feel that 100% this was who I wanted to marry, but I feel like he&amp;#39;s broken my heart (when he breaks up with me) so many times that it&amp;#39;s hard to feel that same energy that I used to have. Meanwhile, I think he senses it, and still we&amp;#39;re both trying to make it work. But we&amp;#39;re still not tackling our issues, so we need to figure something out for the best of both of us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6yqe6", "score_hidden": false, "stickied": false, "created": 1492077670.0, "created_utc": 1492048870.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6p3d8", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ghostinthechell", "parent_id": "t1_dg6jp8h", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If you're not going to marry him and he wants marriage, you need to let him go find someone who will. Healing from your breakup will take time, and if you know you're not in it for marriage and he is, you're wasting his time and leading him on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re not going to marry him and he wants marriage, you need to let him go find someone who will. Healing from your breakup will take time, and if you know you&amp;#39;re not in it for marriage and he is, you&amp;#39;re wasting his time and leading him on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6p3d8", "score_hidden": false, "stickied": false, "created": 1492065820.0, "created_utc": 1492037020.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6yyy7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6s8eu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Okay, I think I somewhat got it. But consider that he's the love of my life, too. I fucking adore him, too. That's why this whole thing is so difficult. And I know he feels the same way I do, but where in the past I've wanted to try to make it work and always thought it could, he hasn't. And little by little, his feeling has spilled over to me. Now what? We're both two sweet, but sad little puppies in love.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I think I somewhat got it. But consider that he&amp;#39;s the love of my life, too. I fucking adore him, too. That&amp;#39;s why this whole thing is so difficult. And I know he feels the same way I do, but where in the past I&amp;#39;ve wanted to try to make it work and always thought it could, he hasn&amp;#39;t. And little by little, his feeling has spilled over to me. Now what? We&amp;#39;re both two sweet, but sad little puppies in love.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6yyy7", "score_hidden": false, "stickied": false, "created": 1492077971.0, "created_utc": 1492049171.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6s8eu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nevercomindown", "parent_id": "t1_dg6jp8h", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "&gt;If I may, what do you mean by \"let the poor guy heal already\"? Just wondering... \n\n1. He's a poor guy because you've been with him for 3 years, and you're literally the love of his life. He absolutely adores you. A little fucking golden retriever. Have you ever seen a golden retriever?\n\n2. Let him heal already. The equivalent of you breaking up with him is like dropping a little golden retriever off a 15 story building. Very little chance for survival, he will be broken inside and out, internally bleeding, and will be pretty damn close to death.\n\nOk I'm not trying to get ahead of myself but damn, think about the fucking puppy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If I may, what do you mean by &amp;quot;let the poor guy heal already&amp;quot;? Just wondering... &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;He&amp;#39;s a poor guy because you&amp;#39;ve been with him for 3 years, and you&amp;#39;re literally the love of his life. He absolutely adores you. A little fucking golden retriever. Have you ever seen a golden retriever?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Let him heal already. The equivalent of you breaking up with him is like dropping a little golden retriever off a 15 story building. Very little chance for survival, he will be broken inside and out, internally bleeding, and will be pretty damn close to death.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Ok I&amp;#39;m not trying to get ahead of myself but damn, think about the fucking puppy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6s8eu", "score_hidden": false, "stickied": false, "created": 1492069698.0, "created_utc": 1492040898.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jp8h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6c423", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "If I may, what do you mean by \"let the poor guy heal already\"? Just wondering...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I may, what do you mean by &amp;quot;let the poor guy heal already&amp;quot;? Just wondering...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6jp8h", "score_hidden": false, "stickied": false, "created": 1492059352.0, "created_utc": 1492030552.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6c423", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "nevercomindown", "parent_id": "t1_dg6bpad", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah just cut it off. If you can't even fucking marry the guy just break up and let the poor guy heal already.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah just cut it off. If you can&amp;#39;t even fucking marry the guy just break up and let the poor guy heal already.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6c423", "score_hidden": false, "stickied": false, "created": 1492051500.0, "created_utc": 1492022700.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bpad", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "bringbackDiogenes", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Like the username.  Anyway marriage isn't all Disney movies and ice cream.  It's about being in it together, and complementing each other's weaknesses, and mutual respect.\n\nIf all that seems too much work, and if the reasons you break up didn't get solved/fixed/changed for the better, usually it's not good advice to tell someone to try it again.  If you resent him, you will only resent him further as time goes on.", "edited": 1492022818.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like the username.  Anyway marriage isn&amp;#39;t all Disney movies and ice cream.  It&amp;#39;s about being in it together, and complementing each other&amp;#39;s weaknesses, and mutual respect.&lt;/p&gt;\n\n&lt;p&gt;If all that seems too much work, and if the reasons you break up didn&amp;#39;t get solved/fixed/changed for the better, usually it&amp;#39;s not good advice to tell someone to try it again.  If you resent him, you will only resent him further as time goes on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6bpad", "score_hidden": false, "stickied": false, "created": 1492051083.0, "created_utc": 1492022283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6gh1k", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6clut", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Not avoiding confrontation seems to be a recurring issue in our relationships, which then leads to big, explosive arguments. We've only now established how to fight fair or have a healthy argument, but it's still a work in progress. The problem that I have is that entire arguments can seem fair and healthy, but so often they end with him breaking things off, which is entirely unfair and unhealthy. I think you're right though and the best way for me to apply your advice would be to practice arguing in small doses instead of bottling things up. Perhaps this could be away to reduce the big arguments, and lessen the likelihood that he responds in such a manner. After all, my absolute fear would be that I marry him because we're a great pair most of the time, but a single argument would cause a quick, ugly divorce. Thank you for writing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not avoiding confrontation seems to be a recurring issue in our relationships, which then leads to big, explosive arguments. We&amp;#39;ve only now established how to fight fair or have a healthy argument, but it&amp;#39;s still a work in progress. The problem that I have is that entire arguments can seem fair and healthy, but so often they end with him breaking things off, which is entirely unfair and unhealthy. I think you&amp;#39;re right though and the best way for me to apply your advice would be to practice arguing in small doses instead of bottling things up. Perhaps this could be away to reduce the big arguments, and lessen the likelihood that he responds in such a manner. After all, my absolute fear would be that I marry him because we&amp;#39;re a great pair most of the time, but a single argument would cause a quick, ugly divorce. Thank you for writing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6gh1k", "score_hidden": false, "stickied": false, "created": 1492055993.0, "created_utc": 1492027193.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6clut", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "The-Ham-Bummer", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You must become able to argue and not break off. If you don't you will divorce at the first argument. Then it is better to break it off now. I suggest practicing arguing, that is, not avoid confrontation. BUT if confrontation turned violent once, you risk too much and it is not worth it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You must become able to argue and not break off. If you don&amp;#39;t you will divorce at the first argument. Then it is better to break it off now. I suggest practicing arguing, that is, not avoid confrontation. BUT if confrontation turned violent once, you risk too much and it is not worth it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6clut", "score_hidden": false, "stickied": false, "created": 1492052016.0, "created_utc": 1492023216.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6ykog", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "spotH3D", "parent_id": "t1_dg6hbjs", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You are on the right path.\n\nI encourage you to be a little more selfish in your life, it's not a bad thing to be.  Push the envelope a bit.\n\nAs for big dreams, you have to get started on them or risk never starting.\n\nFinal bit, it is ok for 2 people to realize they aren't right for each other and to end a relationship, that is healthy and normal.\n\nStaying together no matter what isn't.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are on the right path.&lt;/p&gt;\n\n&lt;p&gt;I encourage you to be a little more selfish in your life, it&amp;#39;s not a bad thing to be.  Push the envelope a bit.&lt;/p&gt;\n\n&lt;p&gt;As for big dreams, you have to get started on them or risk never starting.&lt;/p&gt;\n\n&lt;p&gt;Final bit, it is ok for 2 people to realize they aren&amp;#39;t right for each other and to end a relationship, that is healthy and normal.&lt;/p&gt;\n\n&lt;p&gt;Staying together no matter what isn&amp;#39;t.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6ykog", "score_hidden": false, "stickied": false, "created": 1492077468.0, "created_utc": 1492048668.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hbjs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6cmom", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This really hit me spot on. I do consider my SO and I passing the time right now, and that concerns me because we both wish to one day get married and have children. Whether or not it's with each other, we're not sure. We have openly discussed that we could have what it takes, but our arguments tell otherwise, so we seem to not talk about it altogether. All in all, you are right that this is not a great strategy, at least if we truly want to get married and have kids.\n\nI also appreciate you pointing out that avoiding conflict is a personal flaw because that tells me that it's something important that I should work on, especially if I don't want a life of mediocrity. I didn't write it in my post, but I do sometimes I feel like I'm just living day by day, yet I dream big dreams of passion. Don't know why I didn't consider it before, but simply working on my confrontation could pull me out of my ways. I think that many of you are encouraging me to push the envelope and I will. In saying that I feel a bit of guilt because I don't want to be selfish when it comes to thinking of my partner, but at the same time I need to consider my heart and happiness. I think that my bf needs to work on his confrontation too though, and thus far it's been something that he has resisted. I'm a strong believer in not changing somebody, but your words make me realize that it's also important to grow with somebody, especially when you consider growing old with them, or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This really hit me spot on. I do consider my SO and I passing the time right now, and that concerns me because we both wish to one day get married and have children. Whether or not it&amp;#39;s with each other, we&amp;#39;re not sure. We have openly discussed that we could have what it takes, but our arguments tell otherwise, so we seem to not talk about it altogether. All in all, you are right that this is not a great strategy, at least if we truly want to get married and have kids.&lt;/p&gt;\n\n&lt;p&gt;I also appreciate you pointing out that avoiding conflict is a personal flaw because that tells me that it&amp;#39;s something important that I should work on, especially if I don&amp;#39;t want a life of mediocrity. I didn&amp;#39;t write it in my post, but I do sometimes I feel like I&amp;#39;m just living day by day, yet I dream big dreams of passion. Don&amp;#39;t know why I didn&amp;#39;t consider it before, but simply working on my confrontation could pull me out of my ways. I think that many of you are encouraging me to push the envelope and I will. In saying that I feel a bit of guilt because I don&amp;#39;t want to be selfish when it comes to thinking of my partner, but at the same time I need to consider my heart and happiness. I think that my bf needs to work on his confrontation too though, and thus far it&amp;#39;s been something that he has resisted. I&amp;#39;m a strong believer in not changing somebody, but your words make me realize that it&amp;#39;s also important to grow with somebody, especially when you consider growing old with them, or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6hbjs", "score_hidden": false, "stickied": false, "created": 1492056867.0, "created_utc": 1492028067.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cmom", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "spotH3D", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If getting married or being with a great partner for a long period of time is important to you, just passing the time with a SO you know will not last is a terrible strategy.  \n\nIt is strange to me that you are describing more than one problem that in your shoes I would come to grips via immediate confrontation.  But you are avoiding the possibility of any conflict.  I'm referring to the sexual stuff and your fear of talking about the problems you see.\n\nThat points to an alarming personality flaw in yourself, one that can lead to an unfulfilled life as you take the path of least resistance into a rut of numbing mediocrity.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If getting married or being with a great partner for a long period of time is important to you, just passing the time with a SO you know will not last is a terrible strategy.  &lt;/p&gt;\n\n&lt;p&gt;It is strange to me that you are describing more than one problem that in your shoes I would come to grips via immediate confrontation.  But you are avoiding the possibility of any conflict.  I&amp;#39;m referring to the sexual stuff and your fear of talking about the problems you see.&lt;/p&gt;\n\n&lt;p&gt;That points to an alarming personality flaw in yourself, one that can lead to an unfulfilled life as you take the path of least resistance into a rut of numbing mediocrity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6cmom", "score_hidden": false, "stickied": false, "created": 1492052039.0, "created_utc": 1492023239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6js88", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Raidicus", "parent_id": "t1_dg6jjyz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I understand. I've been there.\n\nI just think that things don't sound healthy. \n\nIf things getting physical isn't a sign of that, I don't know that anything will be.\n\nJust remember, there is always another option. You are not stuck together. You have to want it, and so does he. In the scheme of things, it sort of sounds like he is the one unwilling to work on his issues. But you are the one who seems to escalate fights with hysterics and anger.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand. I&amp;#39;ve been there.&lt;/p&gt;\n\n&lt;p&gt;I just think that things don&amp;#39;t sound healthy. &lt;/p&gt;\n\n&lt;p&gt;If things getting physical isn&amp;#39;t a sign of that, I don&amp;#39;t know that anything will be.&lt;/p&gt;\n\n&lt;p&gt;Just remember, there is always another option. You are not stuck together. You have to want it, and so does he. In the scheme of things, it sort of sounds like he is the one unwilling to work on his issues. But you are the one who seems to escalate fights with hysterics and anger.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6js88", "score_hidden": false, "stickied": false, "created": 1492059444.0, "created_utc": 1492030644.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jjyz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6iht2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I can provide more details, but even online, it's embarrassing for me:\nWe'd been out with friends, and he'd been doing some drinking. I felt disrespected that he'd openly chose to talk about his ex gf and her occupation as an exotic dancer (perhaps this could hint at my over-sensitivity). I didn't say anything while we were out, but I started to cry and babble about how it made me feel once we got home. He told me that he didn't want to get into it, and tried to go out for a smoke. When I wouldn't move, he grabbed me and shoved me against the wall, and pushed me down to the floor. I cried a lot, and then got up and yelled at him to leave. It was a loud, crazy night. Our poor neighbors. When he wouldn't leave, I called the police. We slept in separate beds for a week because we had reached a whole new toll, but soon talked it out -- our insecurities, anger, and other issues. \n\nAnd yes, I have had history of an abusive relationship, so I think this triggered a lot of anger, bad memories, and caused me to feel resentful towards him.\n\nAnd I think that I can be overly sensitive, I'm a worrier and anxious. But, I do feel that he drives me up the wall and leaves me out to dry because when we make up, we just make up. We hug it out, we thank each other for our positive doings, but we don't really go right out and say \"I'm still angry with you about this...\"\n\nAs silly as it sounds, I think that the main reason that I am so dedicated to the relationship is because we are best of friends that really work well together on a day to day basis; we are both thoughtful, have similar philosophies about life and the same values; plus, we both really appreciate each other and the good qualities we have and we lift each other up. It's when conflict arises that all of these things go to shred. And each time it's hard to regain. I am starting to feel the same way -- that we are two extremely volatile people and should consider finding more stable partners. But it's just hard to picture my life without him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can provide more details, but even online, it&amp;#39;s embarrassing for me:\nWe&amp;#39;d been out with friends, and he&amp;#39;d been doing some drinking. I felt disrespected that he&amp;#39;d openly chose to talk about his ex gf and her occupation as an exotic dancer (perhaps this could hint at my over-sensitivity). I didn&amp;#39;t say anything while we were out, but I started to cry and babble about how it made me feel once we got home. He told me that he didn&amp;#39;t want to get into it, and tried to go out for a smoke. When I wouldn&amp;#39;t move, he grabbed me and shoved me against the wall, and pushed me down to the floor. I cried a lot, and then got up and yelled at him to leave. It was a loud, crazy night. Our poor neighbors. When he wouldn&amp;#39;t leave, I called the police. We slept in separate beds for a week because we had reached a whole new toll, but soon talked it out -- our insecurities, anger, and other issues. &lt;/p&gt;\n\n&lt;p&gt;And yes, I have had history of an abusive relationship, so I think this triggered a lot of anger, bad memories, and caused me to feel resentful towards him.&lt;/p&gt;\n\n&lt;p&gt;And I think that I can be overly sensitive, I&amp;#39;m a worrier and anxious. But, I do feel that he drives me up the wall and leaves me out to dry because when we make up, we just make up. We hug it out, we thank each other for our positive doings, but we don&amp;#39;t really go right out and say &amp;quot;I&amp;#39;m still angry with you about this...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;As silly as it sounds, I think that the main reason that I am so dedicated to the relationship is because we are best of friends that really work well together on a day to day basis; we are both thoughtful, have similar philosophies about life and the same values; plus, we both really appreciate each other and the good qualities we have and we lift each other up. It&amp;#39;s when conflict arises that all of these things go to shred. And each time it&amp;#39;s hard to regain. I am starting to feel the same way -- that we are two extremely volatile people and should consider finding more stable partners. But it&amp;#39;s just hard to picture my life without him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6jjyz", "score_hidden": false, "stickied": false, "created": 1492059196.0, "created_utc": 1492030396.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6iht2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Raidicus", "parent_id": "t1_dg6hys9", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;That particular fight that we had with cops involved was a night when I kept nagging at him and he got physically firm with me. \n\nI see. Glad you went into detail here. Have you have a history with abusive relationships?\n\n&gt;he now seems bitter that I always have an issue with something and he says he has no issues with anything\n\nIt's hard to tell in such a dysfunctional relationship whether or not one person is in the right or in the wrong. I will say that typically this type of denial of your feelings/upset shows that he is either driving you up the wall and then avoiding taking responsibility for his actions - or you are overly-sensitive. Only a therapist can suss that one out.\n\nIs there any reason you are so dedicated to this relatoinship which sounds very much so on the rocks? Perhaps you are two extremely volatile people who should consider finding more stable partners?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That particular fight that we had with cops involved was a night when I kept nagging at him and he got physically firm with me. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I see. Glad you went into detail here. Have you have a history with abusive relationships?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;he now seems bitter that I always have an issue with something and he says he has no issues with anything&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s hard to tell in such a dysfunctional relationship whether or not one person is in the right or in the wrong. I will say that typically this type of denial of your feelings/upset shows that he is either driving you up the wall and then avoiding taking responsibility for his actions - or you are overly-sensitive. Only a therapist can suss that one out.&lt;/p&gt;\n\n&lt;p&gt;Is there any reason you are so dedicated to this relatoinship which sounds very much so on the rocks? Perhaps you are two extremely volatile people who should consider finding more stable partners?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6iht2", "score_hidden": false, "stickied": false, "created": 1492058075.0, "created_utc": 1492029275.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hys9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6disz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You know, I think we both have moments where we feel committed to one another, but deep down inside we're unsure. Going back to what I mentioned about \"movies and marriage\", it seems to me that these feelings of uncertainty could be normal. I think that how we have fought in the past, however, is not normal, and is unhealthy. That particular fight that we had with cops involved was a night when I kept nagging at him and he got physically firm with me. It only occurred once, but I grew furious and called the police. Charges were never made and he's never suggested any violent behavior towards me since then. But it was a difficult time because I think we both played a role in provoking each other. Since then, we are cordial and don't yell at each other. I think before that I would nag and he would yell. I actually took some time to do some therapy because I had difficulty giving him space and would \"nag\" quite often when confronting him. My therapist helped me work on techniques to reduce my anxiety when an argument was occurring, while he took a breather. Now, I kind of look forward to when he takes a breather. But where we used to argue about how we both handled arguments differently (I want to talk it out and he doesn't), he now seems bitter that I always have an issue with something and he says he has no issues with anything. I don't think he means this literally because that's ridiculous, but all in all, I think he points to the fact that I am emotional and he is not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, I think we both have moments where we feel committed to one another, but deep down inside we&amp;#39;re unsure. Going back to what I mentioned about &amp;quot;movies and marriage&amp;quot;, it seems to me that these feelings of uncertainty could be normal. I think that how we have fought in the past, however, is not normal, and is unhealthy. That particular fight that we had with cops involved was a night when I kept nagging at him and he got physically firm with me. It only occurred once, but I grew furious and called the police. Charges were never made and he&amp;#39;s never suggested any violent behavior towards me since then. But it was a difficult time because I think we both played a role in provoking each other. Since then, we are cordial and don&amp;#39;t yell at each other. I think before that I would nag and he would yell. I actually took some time to do some therapy because I had difficulty giving him space and would &amp;quot;nag&amp;quot; quite often when confronting him. My therapist helped me work on techniques to reduce my anxiety when an argument was occurring, while he took a breather. Now, I kind of look forward to when he takes a breather. But where we used to argue about how we both handled arguments differently (I want to talk it out and he doesn&amp;#39;t), he now seems bitter that I always have an issue with something and he says he has no issues with anything. I don&amp;#39;t think he means this literally because that&amp;#39;s ridiculous, but all in all, I think he points to the fact that I am emotional and he is not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6hys9", "score_hidden": false, "stickied": false, "created": 1492057521.0, "created_utc": 1492028721.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6disz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Raidicus", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Obviously you can work through things, but only if you are both committed. It doesn't sound like he is given his erratic behavior. What the fight about where police had to get involved? That seems pretty crucial to understanding the current dynamic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obviously you can work through things, but only if you are both committed. It doesn&amp;#39;t sound like he is given his erratic behavior. What the fight about where police had to get involved? That seems pretty crucial to understanding the current dynamic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6disz", "score_hidden": false, "stickied": false, "created": 1492052973.0, "created_utc": 1492024173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6jnui", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6ibik", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm sure you know all too well that your words mean a lot to me! Thank you so much! I wish you peace and happiness! And I hope that we both come out of this as stronger individuals! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure you know all too well that your words mean a lot to me! Thank you so much! I wish you peace and happiness! And I hope that we both come out of this as stronger individuals! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6jnui", "score_hidden": false, "stickied": false, "created": 1492059312.0, "created_utc": 1492030512.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ibik", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kisaki84", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I feel like I've just read my own problems with my life/relationship. I'm sorry I don't have anything to add, because if I think about it too much, I'll start questioning every issue I have at the same time, and I'm not ready to do that again at the moment. \n\nI will be following your post and hope that people who help you also help me. I guess I really just wanted to let you know that you're not alone in how you feel about a relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like I&amp;#39;ve just read my own problems with my life/relationship. I&amp;#39;m sorry I don&amp;#39;t have anything to add, because if I think about it too much, I&amp;#39;ll start questioning every issue I have at the same time, and I&amp;#39;m not ready to do that again at the moment. &lt;/p&gt;\n\n&lt;p&gt;I will be following your post and hope that people who help you also help me. I guess I really just wanted to let you know that you&amp;#39;re not alone in how you feel about a relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6ibik", "score_hidden": false, "stickied": false, "created": 1492057891.0, "created_utc": 1492029091.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6de34", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Form1040", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Move on if you do not see marrying him. \n\nYour ovaries are not getting any younger. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Move on if you do not see marrying him. &lt;/p&gt;\n\n&lt;p&gt;Your ovaries are not getting any younger. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6de34", "score_hidden": false, "stickied": false, "created": 1492052836.0, "created_utc": 1492024036.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6pjwn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; Sometimes I think the best thing to do would be for me to sit down and talk to him about it, but I fear it would lead to another argument where he wants to break up...and then we do this all over agai\n\nSounds like you have both alot of good an alot of bad in your relationship, but shitty communication. Really appalling infact! Also the breakdown of your sexual relations is always going to affect how close you feel ..\n\nWhat I would say is since this is last chance saloon is give yourself a timeframe say 3-6 months to try and reconnect, it really is possible to rekindle. Ask him to see a couples counsellor or relationship oriented therapist just for a few sessions to see if it helps. \n\nTry get your sex life back on track at least 1 night a week for a proper date then sex, 2 bottles of wine and whatever food gets you in the mood and whatever fantasy you guys discuss beforehand. Get him to focus on you one week then the next week you try to blow his tiny guy brain!\n\nFinally talk about all this but tell him beforehand you want a calm discussion and if he flips you walk away and leave for the night. \n\nTalk &gt; counselling &gt; dates/sex &gt; if no improvement then you will know you gave it your best", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Sometimes I think the best thing to do would be for me to sit down and talk to him about it, but I fear it would lead to another argument where he wants to break up...and then we do this all over agai&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sounds like you have both alot of good an alot of bad in your relationship, but shitty communication. Really appalling infact! Also the breakdown of your sexual relations is always going to affect how close you feel ..&lt;/p&gt;\n\n&lt;p&gt;What I would say is since this is last chance saloon is give yourself a timeframe say 3-6 months to try and reconnect, it really is possible to rekindle. Ask him to see a couples counsellor or relationship oriented therapist just for a few sessions to see if it helps. &lt;/p&gt;\n\n&lt;p&gt;Try get your sex life back on track at least 1 night a week for a proper date then sex, 2 bottles of wine and whatever food gets you in the mood and whatever fantasy you guys discuss beforehand. Get him to focus on you one week then the next week you try to blow his tiny guy brain!&lt;/p&gt;\n\n&lt;p&gt;Finally talk about all this but tell him beforehand you want a calm discussion and if he flips you walk away and leave for the night. &lt;/p&gt;\n\n&lt;p&gt;Talk &amp;gt; counselling &amp;gt; dates/sex &amp;gt; if no improvement then you will know you gave it your best&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6pjwn", "score_hidden": false, "stickied": false, "created": 1492066382.0, "created_utc": 1492037582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6rbrw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SlumsToMills", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I want to let you know i have the same feelings with my gf. I know marriage isnt suppose to be all its cracked up to be or how they show it in the movies. However my lady and I can get into arguments and it can get intense but we in the end really love each other, get along and have a unique connection that i feel like would be hard to find. \n\nA few months ago, we broke up and dated other people for about 1-2 months and even had sex with other people but i knew personally that i didnt connect as well with them. She told me the same that she did not connect to the other guys that well either so we got back together and it felt new and refreshed. I think part of the problem is that she is 22 and i am 28.\n\nI just wanted to let you know that youre not the only one dealing with these questions and that I as a guy understand what youre feeling and dont really know what i should do about it so i am kind of just enjoying it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to let you know i have the same feelings with my gf. I know marriage isnt suppose to be all its cracked up to be or how they show it in the movies. However my lady and I can get into arguments and it can get intense but we in the end really love each other, get along and have a unique connection that i feel like would be hard to find. &lt;/p&gt;\n\n&lt;p&gt;A few months ago, we broke up and dated other people for about 1-2 months and even had sex with other people but i knew personally that i didnt connect as well with them. She told me the same that she did not connect to the other guys that well either so we got back together and it felt new and refreshed. I think part of the problem is that she is 22 and i am 28.&lt;/p&gt;\n\n&lt;p&gt;I just wanted to let you know that youre not the only one dealing with these questions and that I as a guy understand what youre feeling and dont really know what i should do about it so i am kind of just enjoying it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6rbrw", "score_hidden": false, "stickied": false, "created": 1492068587.0, "created_utc": 1492039787.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6zvx9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cyancynic", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Why are you wasting your life on this?\n\nIf this isn't going anywhere - that's what you are doing - wasting time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why are you wasting your life on this?&lt;/p&gt;\n\n&lt;p&gt;If this isn&amp;#39;t going anywhere - that&amp;#39;s what you are doing - wasting time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6zvx9", "score_hidden": false, "stickied": false, "created": 1492079102.0, "created_utc": 1492050302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg7gagc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "udolipixiegal", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It's okay to stay together. Heck guys do this shit all the mofo time. Stay with gals for over 3 years  and I find few, especially other males, tell the guy to 'break up and let the poor woman heal already'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s okay to stay together. Heck guys do this shit all the mofo time. Stay with gals for over 3 years  and I find few, especially other males, tell the guy to &amp;#39;break up and let the poor woman heal already&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7gagc", "score_hidden": false, "stickied": false, "created": 1492114079.0, "created_utc": 1492085279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_6500q0", "likes": null, "replies": "", "user_reports": [], "id": "dg6q2f2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Daemon42", "parent_id": "t1_dg6iqwf", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Hope it works for you!!  Good luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hope it works for you!!  Good luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6q2f2", "score_hidden": false, "stickied": false, "created": 1492067026.0, "created_utc": 1492038226.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6iqwf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shenannigator", "parent_id": "t1_dg6cgr1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you for your long response. I am absolutely going to take you up on your advice to perform some brainstorming activities. (FYI I did not consider line breaks in my post, but have since added them in!) \n\nI like the idea of pinpointing specifics, I think it will be good for me and for him. I think my main concern with this is how he will react because it's not that he doesn't show concern or care, but that he walks away because he is not ready to face things or he doesn't see things the way I do. However, you are correct: I need to realize that \"this great guy to marry\" is someone I can't have an honest conversation with, and I need to learn to do so. Forget the movies, I just want to be able to speak my mind aloud. I will surely provide you with an update of how this brainstorming works out. Thanks  again", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your long response. I am absolutely going to take you up on your advice to perform some brainstorming activities. (FYI I did not consider line breaks in my post, but have since added them in!) &lt;/p&gt;\n\n&lt;p&gt;I like the idea of pinpointing specifics, I think it will be good for me and for him. I think my main concern with this is how he will react because it&amp;#39;s not that he doesn&amp;#39;t show concern or care, but that he walks away because he is not ready to face things or he doesn&amp;#39;t see things the way I do. However, you are correct: I need to realize that &amp;quot;this great guy to marry&amp;quot; is someone I can&amp;#39;t have an honest conversation with, and I need to learn to do so. Forget the movies, I just want to be able to speak my mind aloud. I will surely provide you with an update of how this brainstorming works out. Thanks  again&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6iqwf", "score_hidden": false, "stickied": false, "created": 1492058339.0, "created_utc": 1492029539.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cgr1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Daemon42", "parent_id": "t3_6500q0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Aside: This is difficult to read - try injecting a few line breaks in there to make it have a few more paragraphs maybe?  Text walls... suck :)\n\nYou have the \"fear this is the best I'll find\" going on - screw that.  You can apply as much awesome as you need to in your life.  No you won't break up with him and then in a week.. or a few months, be dating something better - but that you have lingering doubts is a good indication (for you) that you are missing some key things.  Figure out what those things are and that will help.\n\nI wouldn't stay in a relationship just for the family.  While it's great you get along with them, those are just the peeps you see on special occasions - not daily.\n\nHave you ever tried \"brainstorming\"  you know where you write out something in a little bubble... then write things that you think of when you read what you wrote down... attaching them to the bubble... do that but start with things you hate/love about your BF.  See what type of thoughts it generates for you.  Then take a look at stuff you really dislike.  Are those things you would be comfortable with longer term? \n\nSolution to the dislikes is to communicate those to your BF, as positive as you can spin it.  See what his response might be.  For example the \"he is quick to end things\" would be a problem for me.  Say: \n\n&gt; when we get into a fight, it feels like you are quick to say 'it's over'.  That bothers me for us longer term.  Is that just an expression you like to use when mad, or are those times where you really were willing to just walk away from us?\n\nIf that isn't something you feel comfortable bringing up, try smaller - but realize this \"great guy to marry\" is someone you can't have an honest conversation with either.\n\nYou say several times he's a great guy and would make a wonderful husband - figure out what about him (specifically) is giving you hangups and see how he responds to you communicating that with him.  If he balks or shows no interest in your concerns - that should be telling for you there too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aside: This is difficult to read - try injecting a few line breaks in there to make it have a few more paragraphs maybe?  Text walls... suck :)&lt;/p&gt;\n\n&lt;p&gt;You have the &amp;quot;fear this is the best I&amp;#39;ll find&amp;quot; going on - screw that.  You can apply as much awesome as you need to in your life.  No you won&amp;#39;t break up with him and then in a week.. or a few months, be dating something better - but that you have lingering doubts is a good indication (for you) that you are missing some key things.  Figure out what those things are and that will help.&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t stay in a relationship just for the family.  While it&amp;#39;s great you get along with them, those are just the peeps you see on special occasions - not daily.&lt;/p&gt;\n\n&lt;p&gt;Have you ever tried &amp;quot;brainstorming&amp;quot;  you know where you write out something in a little bubble... then write things that you think of when you read what you wrote down... attaching them to the bubble... do that but start with things you hate/love about your BF.  See what type of thoughts it generates for you.  Then take a look at stuff you really dislike.  Are those things you would be comfortable with longer term? &lt;/p&gt;\n\n&lt;p&gt;Solution to the dislikes is to communicate those to your BF, as positive as you can spin it.  See what his response might be.  For example the &amp;quot;he is quick to end things&amp;quot; would be a problem for me.  Say: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;when we get into a fight, it feels like you are quick to say &amp;#39;it&amp;#39;s over&amp;#39;.  That bothers me for us longer term.  Is that just an expression you like to use when mad, or are those times where you really were willing to just walk away from us?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If that isn&amp;#39;t something you feel comfortable bringing up, try smaller - but realize this &amp;quot;great guy to marry&amp;quot; is someone you can&amp;#39;t have an honest conversation with either.&lt;/p&gt;\n\n&lt;p&gt;You say several times he&amp;#39;s a great guy and would make a wonderful husband - figure out what about him (specifically) is giving you hangups and see how he responds to you communicating that with him.  If he balks or shows no interest in your concerns - that should be telling for you there too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg6cgr1", "score_hidden": false, "stickied": false, "created": 1492051866.0, "created_utc": 1492023066.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]