[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, it&amp;#39;s the age old trap of &amp;quot;I&amp;#39;m gaining weight&amp;quot; &amp;quot;do you think I&amp;#39;m fat?&amp;quot; etc...&lt;/p&gt;\n\n&lt;p&gt;My gf isn&amp;#39;t a petite person, but she isn&amp;#39;t fat in my book, id say she has an average body type. Truthfully she did gain a bit of weight since I met her because of the &amp;quot;freshman 15&amp;quot;, then working at a cupcake shop over the summer, and we got busy this semester that we don&amp;#39;t go to the gym. She is constantly complaining and asking me if she&amp;#39;s fat. TBH, I don&amp;#39;t think k she is fat, she has gained some weight but I don&amp;#39;t think it&amp;#39;s fat.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s been telling me that she doesn&amp;#39;t feel comfortable with the way that her body looks. Mainly she complains about the little tummy pudge and that her arms got bigger. When she asks I tell her that I don&amp;#39;t think she&amp;#39;s fat and that she is beautiful.&lt;/p&gt;\n\n&lt;p&gt;Sometimes she comes over and talks about her stomach hurts, and I ask why. She tells me all the stuff she ate in one meal and it&amp;#39;s like 4 servings! Then she gets upset when I say that her stomach is hurting because she ate 3 hamburgers and spaghetti in 1 sitting. I try and tell her that she needs to portion meals properly.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do, because I don&amp;#39;t want to seem shallow saying anything about weight gain when she asks me, even though she notices it herself. Recently she is trying to diet, but it&amp;#39;s more of starving herself instead of eating healthy. She says she isn&amp;#39;t drinking soda anymore, so that&amp;#39;s a start. And she wasn&amp;#39;t going to eat junk food but after 2 days she &amp;quot;broke&amp;quot; and ate potato chips because she didn&amp;#39;t have anything else.&lt;/p&gt;\n\n&lt;p&gt;What do I do? Do I tell her that I think she has gained weight? I&amp;#39;ve noticed that I have gained 5-10 lbs too. I tell her that I want to train to run a marathon, starting with 5ks and working my way up. And I invite her with me. She seems down to do it. I&amp;#39;ve kept up a decent body shape because of avoiding junk food and exercising even though I haven&amp;#39;t worked out in a month and a half.&lt;/p&gt;\n\n&lt;p&gt;I hate to tell her because she gets depressed, as one would. But I don&amp;#39;t want it to get out of control because heart disease runs in her family and my grandma died due to weight related problems...&lt;/p&gt;\n\n&lt;p&gt;Edit: I should note that when she eats like crazy, she doesn&amp;#39;t do that a lot, but she has done it a few times.&lt;/p&gt;\n\n&lt;p&gt;Being in college and I&amp;#39;m live in a fraternity, we don&amp;#39;t eat meals together because I have a chef at my house. So I don&amp;#39;t control what she eats, and she doesn&amp;#39;t control what I eat.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, it's the age old trap of \"I'm gaining weight\" \"do you think I'm fat?\" etc...\n\nMy gf isn't a petite person, but she isn't fat in my book, id say she has an average body type. Truthfully she did gain a bit of weight since I met her because of the \"freshman 15\", then working at a cupcake shop over the summer, and we got busy this semester that we don't go to the gym. She is constantly complaining and asking me if she's fat. TBH, I don't think k she is fat, she has gained some weight but I don't think it's fat.\n\nShe's been telling me that she doesn't feel comfortable with the way that her body looks. Mainly she complains about the little tummy pudge and that her arms got bigger. When she asks I tell her that I don't think she's fat and that she is beautiful.\n\nSometimes she comes over and talks about her stomach hurts, and I ask why. She tells me all the stuff she ate in one meal and it's like 4 servings! Then she gets upset when I say that her stomach is hurting because she ate 3 hamburgers and spaghetti in 1 sitting. I try and tell her that she needs to portion meals properly.\n\nI don't know what to do, because I don't want to seem shallow saying anything about weight gain when she asks me, even though she notices it herself. Recently she is trying to diet, but it's more of starving herself instead of eating healthy. She says she isn't drinking soda anymore, so that's a start. And she wasn't going to eat junk food but after 2 days she \"broke\" and ate potato chips because she didn't have anything else.\n\nWhat do I do? Do I tell her that I think she has gained weight? I've noticed that I have gained 5-10 lbs too. I tell her that I want to train to run a marathon, starting with 5ks and working my way up. And I invite her with me. She seems down to do it. I've kept up a decent body shape because of avoiding junk food and exercising even though I haven't worked out in a month and a half.\n\nI hate to tell her because she gets depressed, as one would. But I don't want it to get out of control because heart disease runs in her family and my grandma died due to weight related problems...\n\n\n\n\nEdit: I should note that when she eats like crazy, she doesn't do that a lot, but she has done it a few times.\n\nBeing in college and I'm live in a fraternity, we don't eat meals together because I have a chef at my house. So I don't control what she eats, and she doesn't control what I eat.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "656y7n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "gfquestthrowaway", "saved": false, "mod_reports": [], "name": "t3_656y7n", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492105635.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/656y7n/my_gf20f_constantly_complains_to_mem22_about/", "num_reports": null, "locked": false, "stickied": false, "created": 1492133458.0, "url": "https://www.reddit.com/r/relationship_advice/comments/656y7n/my_gf20f_constantly_complains_to_mem22_about/", "author_flair_text": null, "quarantine": false, "title": "My gf[20/f] constantly complains to me[m/22] about weight...", "created_utc": 1492104658.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg7wzu6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "betamaleorderbride", "parent_id": "t3_656y7n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Tell her that if she isn't going to do anything to fix the problem you're not going to listen to her bitch about it.  You don't fall on the ground then sit there complaining that you can't reach the kitchen counter and the floor is hard and the tile is cold GET OFF THE FUCKING FLOOR THEN.\n\nYou're enabling this bullshit by listening.  And you're gaining weight too because she's not going to eat healthy with you, so you're eating worse too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell her that if she isn&amp;#39;t going to do anything to fix the problem you&amp;#39;re not going to listen to her bitch about it.  You don&amp;#39;t fall on the ground then sit there complaining that you can&amp;#39;t reach the kitchen counter and the floor is hard and the tile is cold GET OFF THE FUCKING FLOOR THEN.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re enabling this bullshit by listening.  And you&amp;#39;re gaining weight too because she&amp;#39;s not going to eat healthy with you, so you&amp;#39;re eating worse too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7wzu6", "score_hidden": false, "stickied": false, "created": 1492134177.0, "created_utc": 1492105377.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg81t7r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "morganlafaye", "parent_id": "t3_656y7n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think it might be time for you to address this head-on, and by head-on I do *not* mean telling her she's fat. \n\nHere's some background on me: I am a 26y/o woman who just became concerned that I was getting flabby (I'm 5'2\" and weigh about 120 so not concerned about fat, as much as I'm concerned about being flabby). I broached the subject with my LT boyfriend, saying \"I feel flabby, have you noticed?\" Now, we have an agreement that if either of us starts to actually get fat we'll tell the other person, that being said we're both pretty thin so I have zero clue if we'd have the balls to actually tell each other, but it's a nice thought. He said \"no, honestly you look exactly the same if not better than two years ago.\" The next day I was talking about how flabby I was getting, how I thought I saw the start of love handles, how I couldn't focus last time we banged because I was on top and kept seeing how flabby my belly is. He looked shocked. HOWEVER, he knows me well enough to know a few key things\n\n1) Working out makes me feel more beautiful, even if it's the placebo effect.\n\n2) My mood and energy level is directly impacted by my getting exercise.\n\n3)  I can really go down the self-hate rabbit hole if I let myself.\n\nThis is what he said to me that super duper worked: \"I really don't like hearing you talk about yourself this way, if ANYONE else ever said these things about you I'd be enraged, I'd defend you. But hearing you saying these things, it's difficult, I can't get mad at you, but I don't like hearing you insult yourself like this. I want you to do what you need to do to make yourself feel better, to feel beautiful. You *should* exercise, just like I should because we'll be healthier and I can help encourage you if you'd like, but ultimately it's up to you. I'm here for you, and again, I think you look wonderful, but I don't like hearing this self deprecation.\" \n\nI started working out the next day.\n\nAs far as your situation goes, I'd recommend some variation of what my boyfriend said. I'd include portion control into that conversation, adding that though you find her gorgeous, you agree that she should make more conscious of portion control/ cutting out junk food most of the time *now* rather than when she's older and has to worry about the heart issues that run in her family. Encourage her, but be firm in letting her know that you don't want to hear her insulting herself all the time. This is not your responsibility, you can be encouraging, but ultimately if she doesn't put in the effort to get healthy, while you are, that's a foundational lack of compatibility that you need to be aware of.\n\nSide note: don't try and get her to run a 5k, it may be too daunting for her and will actually set her back in working out. Encourage some light activities like walks (maybe with you!), some basic weights, stuff like 10minute abs, stuff she can do on her own terms with her own schedule.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it might be time for you to address this head-on, and by head-on I do &lt;em&gt;not&lt;/em&gt; mean telling her she&amp;#39;s fat. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s some background on me: I am a 26y/o woman who just became concerned that I was getting flabby (I&amp;#39;m 5&amp;#39;2&amp;quot; and weigh about 120 so not concerned about fat, as much as I&amp;#39;m concerned about being flabby). I broached the subject with my LT boyfriend, saying &amp;quot;I feel flabby, have you noticed?&amp;quot; Now, we have an agreement that if either of us starts to actually get fat we&amp;#39;ll tell the other person, that being said we&amp;#39;re both pretty thin so I have zero clue if we&amp;#39;d have the balls to actually tell each other, but it&amp;#39;s a nice thought. He said &amp;quot;no, honestly you look exactly the same if not better than two years ago.&amp;quot; The next day I was talking about how flabby I was getting, how I thought I saw the start of love handles, how I couldn&amp;#39;t focus last time we banged because I was on top and kept seeing how flabby my belly is. He looked shocked. HOWEVER, he knows me well enough to know a few key things&lt;/p&gt;\n\n&lt;p&gt;1) Working out makes me feel more beautiful, even if it&amp;#39;s the placebo effect.&lt;/p&gt;\n\n&lt;p&gt;2) My mood and energy level is directly impacted by my getting exercise.&lt;/p&gt;\n\n&lt;p&gt;3)  I can really go down the self-hate rabbit hole if I let myself.&lt;/p&gt;\n\n&lt;p&gt;This is what he said to me that super duper worked: &amp;quot;I really don&amp;#39;t like hearing you talk about yourself this way, if ANYONE else ever said these things about you I&amp;#39;d be enraged, I&amp;#39;d defend you. But hearing you saying these things, it&amp;#39;s difficult, I can&amp;#39;t get mad at you, but I don&amp;#39;t like hearing you insult yourself like this. I want you to do what you need to do to make yourself feel better, to feel beautiful. You &lt;em&gt;should&lt;/em&gt; exercise, just like I should because we&amp;#39;ll be healthier and I can help encourage you if you&amp;#39;d like, but ultimately it&amp;#39;s up to you. I&amp;#39;m here for you, and again, I think you look wonderful, but I don&amp;#39;t like hearing this self deprecation.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I started working out the next day.&lt;/p&gt;\n\n&lt;p&gt;As far as your situation goes, I&amp;#39;d recommend some variation of what my boyfriend said. I&amp;#39;d include portion control into that conversation, adding that though you find her gorgeous, you agree that she should make more conscious of portion control/ cutting out junk food most of the time &lt;em&gt;now&lt;/em&gt; rather than when she&amp;#39;s older and has to worry about the heart issues that run in her family. Encourage her, but be firm in letting her know that you don&amp;#39;t want to hear her insulting herself all the time. This is not your responsibility, you can be encouraging, but ultimately if she doesn&amp;#39;t put in the effort to get healthy, while you are, that&amp;#39;s a foundational lack of compatibility that you need to be aware of.&lt;/p&gt;\n\n&lt;p&gt;Side note: don&amp;#39;t try and get her to run a 5k, it may be too daunting for her and will actually set her back in working out. Encourage some light activities like walks (maybe with you!), some basic weights, stuff like 10minute abs, stuff she can do on her own terms with her own schedule.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg81t7r", "score_hidden": false, "stickied": false, "created": 1492139330.0, "created_utc": 1492110530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg8wxoy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VeganLGBTCrossfitter", "parent_id": "t1_dg82n6j", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Sorry to hear. Focus on learning and growth. Be a better you.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to hear. Focus on learning and growth. Be a better you.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg8wxoy", "score_hidden": false, "stickied": false, "created": 1492185746.0, "created_utc": 1492156946.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82n6j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "omietrice", "parent_id": "t1_dg7xt3i", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "damn dude this is on point i dealt with this shit for a year..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;damn dude this is on point i dealt with this shit for a year..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg82n6j", "score_hidden": false, "stickied": false, "created": 1492140231.0, "created_utc": 1492111431.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xt3i", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "VeganLGBTCrossfitter", "parent_id": "t3_656y7n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You're too young to deal with this shit and you're in college. Dump her and move on. \n\nShe's insecure and has no self control. Eventually the complaining will shift from simple complaints to outright resentment. In the interim, I would imagine an added 20 pounds. What she's trying to do is get you to treat her negatively so she can have your opinions match her negative self-image. It's not about fixing herself, it's about having external messages match her internal messages. If she wanted to have self control then she'd have it. Nobody can give you self control. If she wanted to go to the gym then she would go. Nobody can make you want to exercise. \n\n22 is not the time of your life where you run around playing personality doctor trying to fix the one true love of your life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re too young to deal with this shit and you&amp;#39;re in college. Dump her and move on. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s insecure and has no self control. Eventually the complaining will shift from simple complaints to outright resentment. In the interim, I would imagine an added 20 pounds. What she&amp;#39;s trying to do is get you to treat her negatively so she can have your opinions match her negative self-image. It&amp;#39;s not about fixing herself, it&amp;#39;s about having external messages match her internal messages. If she wanted to have self control then she&amp;#39;d have it. Nobody can give you self control. If she wanted to go to the gym then she would go. Nobody can make you want to exercise. &lt;/p&gt;\n\n&lt;p&gt;22 is not the time of your life where you run around playing personality doctor trying to fix the one true love of your life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7xt3i", "score_hidden": false, "stickied": false, "created": 1492135038.0, "created_utc": 1492106238.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg89xrc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reenuhh", "parent_id": "t1_dg89rhm", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If the burgers are from Culver's and it's my moms spaghetti. Yes. Typically I only eat a ton of food in one sitting if i'm on my period but still. It's possible that she's average looking and can eat a lot. Some people have a super fast metabolism. I have tried SO HARD to gain weight by eating and it just doesn't work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the burgers are from Culver&amp;#39;s and it&amp;#39;s my moms spaghetti. Yes. Typically I only eat a ton of food in one sitting if i&amp;#39;m on my period but still. It&amp;#39;s possible that she&amp;#39;s average looking and can eat a lot. Some people have a super fast metabolism. I have tried SO HARD to gain weight by eating and it just doesn&amp;#39;t work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg89xrc", "score_hidden": false, "stickied": false, "created": 1492148521.0, "created_utc": 1492119721.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg8cj4q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bonobosaurus", "parent_id": "t1_dg89rhm", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I have two friends that could do that, one male, one female. Neither of them are even slightly overweight. So unfair.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have two friends that could do that, one male, one female. Neither of them are even slightly overweight. So unfair.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg8cj4q", "score_hidden": false, "stickied": false, "created": 1492151871.0, "created_utc": 1492123071.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg89rhm", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "omghi2posers", "parent_id": "t1_dg89q2n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Can you eat 3 burgers and spaghetti in a single meal?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you eat 3 burgers and spaghetti in a single meal?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg89rhm", "score_hidden": false, "stickied": false, "created": 1492148308.0, "created_utc": 1492119508.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg89q2n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "reenuhh", "parent_id": "t1_dg7wj1n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Okay, i'm 4'9 and weigh maybe 90 pounds soaking wet, I have days where I can eat like shit and i'm not fat or obese. I look fit and healthy. I'm just fucking short as hell and eat like garbage. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, i&amp;#39;m 4&amp;#39;9 and weigh maybe 90 pounds soaking wet, I have days where I can eat like shit and i&amp;#39;m not fat or obese. I look fit and healthy. I&amp;#39;m just fucking short as hell and eat like garbage. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg89q2n", "score_hidden": false, "stickied": false, "created": 1492148257.0, "created_utc": 1492119457.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg7y5qy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "omghi2posers", "parent_id": "t1_dg7xkxc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Absolutely.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7y5qy", "score_hidden": false, "stickied": false, "created": 1492135411.0, "created_utc": 1492106611.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xkxc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gfquestthrowaway", "parent_id": "t1_dg7x9d9", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "All I know is it seems like a lot for even me to eat and I'm 6'1\" 190lbs", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All I know is it seems like a lot for even me to eat and I&amp;#39;m 6&amp;#39;1&amp;quot; 190lbs&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7xkxc", "score_hidden": false, "stickied": false, "created": 1492134799.0, "created_utc": 1492105999.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7x9d9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "omghi2posers", "parent_id": "t1_dg7x37n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That would be a fine size. I suspect she must be quite a bit heavier if she is packing down 3 burgers and spaghetti. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That would be a fine size. I suspect she must be quite a bit heavier if she is packing down 3 burgers and spaghetti. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7x9d9", "score_hidden": false, "stickied": false, "created": 1492134460.0, "created_utc": 1492105660.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg7x49i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ConvertsToMetric", "parent_id": "t1_dg7x37n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "[^(**Mouseover** or **click** to view the metric conversion for this comment)](http://fiddle.jshell.net/ConvertsToMetric/xhk4y5h5/show/light/?5'10\"%20=%201.77%20m%0A \"5'10\" = 1.77 m\nPost feedback in /r/ToMetric\")", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://fiddle.jshell.net/ConvertsToMetric/xhk4y5h5/show/light/?5&amp;#x27;10%22%20=%201.77%20m%0A\" title=\"5&amp;#39;10&amp;quot; = 1.77 m\nPost feedback in /r/ToMetric\"&gt;&lt;sup&gt;&lt;strong&gt;Mouseover&lt;/strong&gt; or &lt;strong&gt;click&lt;/strong&gt; to view the metric conversion for this comment&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7x49i", "score_hidden": false, "stickied": false, "created": 1492134311.0, "created_utc": 1492105511.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7x37n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gfquestthrowaway", "parent_id": "t1_dg7wj1n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She's like 5'10\" and 160 ish don't know numbers.\nAnd I guess the food is an exaggeration. But I can tell you it's way more than 1 serving for a person her size.\n\nEdit: or maybe she used to be 160... I can't remember", "edited": 1492105729.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s like 5&amp;#39;10&amp;quot; and 160 ish don&amp;#39;t know numbers.\nAnd I guess the food is an exaggeration. But I can tell you it&amp;#39;s way more than 1 serving for a person her size.&lt;/p&gt;\n\n&lt;p&gt;Edit: or maybe she used to be 160... I can&amp;#39;t remember&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7x37n", "score_hidden": false, "stickied": false, "created": 1492134279.0, "created_utc": 1492105479.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7wj1n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "omghi2posers", "parent_id": "t3_656y7n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; she has an average body type\n\n...\n\n&gt; she ate 3 hamburgers and spaghetti in 1 sitting.\n\nNo chance. She needs help if she is eating like this. Like medical help. I'm sure she is not only fat but obese. (Tell us her height and weight and we can easily tell you if she is obese) You may not be able to help her, but don't enable her either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she has an average body type&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;she ate 3 hamburgers and spaghetti in 1 sitting.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No chance. She needs help if she is eating like this. Like medical help. I&amp;#39;m sure she is not only fat but obese. (Tell us her height and weight and we can easily tell you if she is obese) You may not be able to help her, but don&amp;#39;t enable her either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7wj1n", "score_hidden": false, "stickied": false, "created": 1492133680.0, "created_utc": 1492104880.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg7widt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lerk409", "parent_id": "t3_656y7n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Offer to work out and diet with her.  That's about all you can do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Offer to work out and diet with her.  That&amp;#39;s about all you can do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7widt", "score_hidden": false, "stickied": false, "created": 1492133661.0, "created_utc": 1492104861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_656y7n", "likes": null, "replies": "", "user_reports": [], "id": "dg7x4wn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mytummyaches", "parent_id": "t3_656y7n", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Careful with the marathon training.  \n\nYou need a lot of energy to run a marathon, which means you're going eat a LOT to replace the energy you burn.  \n\nSo after you're done with the training, you need to cut back your food intake or you'll gain weight very fast.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Careful with the marathon training.  &lt;/p&gt;\n\n&lt;p&gt;You need a lot of energy to run a marathon, which means you&amp;#39;re going eat a LOT to replace the energy you burn.  &lt;/p&gt;\n\n&lt;p&gt;So after you&amp;#39;re done with the training, you need to cut back your food intake or you&amp;#39;ll gain weight very fast.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg7x4wn", "score_hidden": false, "stickied": false, "created": 1492134330.0, "created_utc": 1492105530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]