[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My mother was with her ex-husband for 20 years. In that time he treated me like I was in the way, lied about me to my mother and almost ruined our relationship, and there was a 2-3 year period where, while it wasn&amp;#39;t said flat out, it was made clear I wasn&amp;#39;t welcome on their property. I just kind of let it go, I figured I was an adult and as log as she was happy she had a right to her relationship and if it fell apart she&amp;#39;d finally believe me. &lt;/p&gt;\n\n&lt;p&gt;Well it fell apart, or exploded. He retired cop ex-husband is currently being investigated for selling drugs. My mother would was clueless, she&amp;#39;s never even smoked a cigarette so she&amp;#39;d never recognize drug behavior or paraphernalia (yes shes that naive) other things she admits she turned a blind eye to. &lt;/p&gt;\n\n&lt;p&gt;When everything came out she admitted I was right that he was a piece of shit. But after months of dealing with her I realize I&amp;#39;m still mad. She believed him when he lied about me, she let him talk shit about me to the neighbors, she let him keep me from visiting her. She risked our relationship for that asshole and she can&amp;#39;t take it back. We own a business that my fiancee helps run and they butt heads a lot over nothing amd her attitude can be unbearable, it&amp;#39;s pushing us away from the business. I can&amp;#39;t even bother to fight with her anymore because I just get to where I wanna start pulling out shit from 10-15 years ago and throw it in her face.&lt;/p&gt;\n\n&lt;p&gt;I know she&amp;#39;s still struggling with the abuse and brainwashing her ex-husband did. She&amp;#39;s a classic codependent and she&amp;#39;s fragile right now. I also know throwing shit in her face that she can&amp;#39;t change might just hurt her and serve no other purpose. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve (fiancee and I) have already decided to sell the business hopefully before our relationship with my mother is ruined. I don&amp;#39;t know what to do with the resentment I have for her. How do I forgive her without her even acknowledging it? She has refused therapy because she things she&amp;#39;s better, meanwhile I wanna scream at her for putting me last all these years. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My mother was with her ex-husband for 20 years. In that time he treated me like I was in the way, lied about me to my mother and almost ruined our relationship, and there was a 2-3 year period where, while it wasn't said flat out, it was made clear I wasn't welcome on their property. I just kind of let it go, I figured I was an adult and as log as she was happy she had a right to her relationship and if it fell apart she'd finally believe me. \n\nWell it fell apart, or exploded. He retired cop ex-husband is currently being investigated for selling drugs. My mother would was clueless, she's never even smoked a cigarette so she'd never recognize drug behavior or paraphernalia (yes shes that naive) other things she admits she turned a blind eye to. \n\nWhen everything came out she admitted I was right that he was a piece of shit. But after months of dealing with her I realize I'm still mad. She believed him when he lied about me, she let him talk shit about me to the neighbors, she let him keep me from visiting her. She risked our relationship for that asshole and she can't take it back. We own a business that my fiancee helps run and they butt heads a lot over nothing amd her attitude can be unbearable, it's pushing us away from the business. I can't even bother to fight with her anymore because I just get to where I wanna start pulling out shit from 10-15 years ago and throw it in her face.\n\nI know she's still struggling with the abuse and brainwashing her ex-husband did. She's a classic codependent and she's fragile right now. I also know throwing shit in her face that she can't change might just hurt her and serve no other purpose. \n\nWe've (fiancee and I) have already decided to sell the business hopefully before our relationship with my mother is ruined. I don't know what to do with the resentment I have for her. How do I forgive her without her even acknowledging it? She has refused therapy because she things she's better, meanwhile I wanna scream at her for putting me last all these years. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65bck1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "throwawaytoday9898", "saved": false, "mod_reports": [], "name": "t3_65bck1", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65bck1/my_mother_70f_is_recovering_from_a_bad_marriage/", "num_reports": null, "locked": false, "stickied": false, "created": 1492186216.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65bck1/my_mother_70f_is_recovering_from_a_bad_marriage/", "author_flair_text": null, "quarantine": false, "title": "My mother (70f) is recovering from a bad marriage and I'm (early 30sf) trying to help her and realize I'm holding a lot of resentment. How do i cope without hurting her more?", "created_utc": 1492157416.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65bck1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65bck1", "likes": null, "replies": "", "user_reports": [], "id": "dg8xl4r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwawaytoday9898", "parent_id": "t1_dg8x9yj", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I don't know that she even realizes there's anything to make amends for. We basically maintained what from the outside would have appeared to be a normal relationship. Took vacations together, talked everyday. This was all basically because I decided that I would just ignore him. When I would visit her I wouldn't talk to him aside from a hi. I feel like she thinks it's all in the passed. But I'm realizing that while I love her and value our relationship. I'm so bitter. Despite his behavior she's been very supportive of me and helped me whenever I asked. It was almost like he just didn't exist in my world after our last blow out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know that she even realizes there&amp;#39;s anything to make amends for. We basically maintained what from the outside would have appeared to be a normal relationship. Took vacations together, talked everyday. This was all basically because I decided that I would just ignore him. When I would visit her I wouldn&amp;#39;t talk to him aside from a hi. I feel like she thinks it&amp;#39;s all in the passed. But I&amp;#39;m realizing that while I love her and value our relationship. I&amp;#39;m so bitter. Despite his behavior she&amp;#39;s been very supportive of me and helped me whenever I asked. It was almost like he just didn&amp;#39;t exist in my world after our last blow out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg8xl4r", "score_hidden": false, "stickied": false, "created": 1492187793.0, "created_utc": 1492158993.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8x9yj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "wtfeva", "parent_id": "t3_65bck1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Why do you have to forgive her?\n\nHas she tried to make amends?\n\nDefinitely sell the biz as that's an unneeded obligation to have to try to communicate with her.\n\nAs far as the rest? She chose him over you long ago and went along with the mistreatment; participated in it even. She doesn't just get to do a 'take backsy' just because she finally left his ass (or got left). If she wants to fix things, then it is really on her to at least TRY to make-up for the shit that she put you through.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you have to forgive her?&lt;/p&gt;\n\n&lt;p&gt;Has she tried to make amends?&lt;/p&gt;\n\n&lt;p&gt;Definitely sell the biz as that&amp;#39;s an unneeded obligation to have to try to communicate with her.&lt;/p&gt;\n\n&lt;p&gt;As far as the rest? She chose him over you long ago and went along with the mistreatment; participated in it even. She doesn&amp;#39;t just get to do a &amp;#39;take backsy&amp;#39; just because she finally left his ass (or got left). If she wants to fix things, then it is really on her to at least TRY to make-up for the shit that she put you through.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg8x9yj", "score_hidden": false, "stickied": false, "created": 1492186792.0, "created_utc": 1492157992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65bck1", "likes": null, "replies": "", "user_reports": [], "id": "dg913jz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sugamonkey", "parent_id": "t3_65bck1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Therapy for yourself and her, maybe together also.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Therapy for yourself and her, maybe together also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg913jz", "score_hidden": false, "stickied": false, "created": 1492198683.0, "created_utc": 1492169883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65bck1", "likes": null, "replies": "", "user_reports": [], "id": "dg92y9o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Miliean1", "parent_id": "t3_65bck1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Talk to her about it, but frame it in a way that allows her to take the blame but not feel blamed.\n\nApproach her and say \"There's something we need to talk about.  I know you are coming to a lot of realizations about X and the ways he acted that were negative.  There's something that I need to get off my chest.  I don't want you to feel worse about this situation than you already do, but it's important that I say my peace here because it's interfering with my mental health.\n\nI'm really bitter about how X treated me and how you sided with him.  You believed him when he lied about me, you let him talk shit about me to the neighbors, and you let him keep me from visiting. You risked our relationship for that asshole and you can't just take it back or pretend it never happened. \n\nI know you now realize this was a mistake, and again I don't want to make you feel worse.  But for me, it's something I think about often, it's not in the past it's in the now.  I love you and want to move forward with our relationship in a positive way, to work on rebuilding things.  But I can't do that with this bitterness in my heart.  I wanted to bring it out into the open so that we can both know what's going on with this situation.  I love you and am working on getting over these problems, but there was some damage done all those years, and we need to work on fixing it together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to her about it, but frame it in a way that allows her to take the blame but not feel blamed.&lt;/p&gt;\n\n&lt;p&gt;Approach her and say &amp;quot;There&amp;#39;s something we need to talk about.  I know you are coming to a lot of realizations about X and the ways he acted that were negative.  There&amp;#39;s something that I need to get off my chest.  I don&amp;#39;t want you to feel worse about this situation than you already do, but it&amp;#39;s important that I say my peace here because it&amp;#39;s interfering with my mental health.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really bitter about how X treated me and how you sided with him.  You believed him when he lied about me, you let him talk shit about me to the neighbors, and you let him keep me from visiting. You risked our relationship for that asshole and you can&amp;#39;t just take it back or pretend it never happened. &lt;/p&gt;\n\n&lt;p&gt;I know you now realize this was a mistake, and again I don&amp;#39;t want to make you feel worse.  But for me, it&amp;#39;s something I think about often, it&amp;#39;s not in the past it&amp;#39;s in the now.  I love you and want to move forward with our relationship in a positive way, to work on rebuilding things.  But I can&amp;#39;t do that with this bitterness in my heart.  I wanted to bring it out into the open so that we can both know what&amp;#39;s going on with this situation.  I love you and am working on getting over these problems, but there was some damage done all those years, and we need to work on fixing it together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg92y9o", "score_hidden": false, "stickied": false, "created": 1492202671.0, "created_utc": 1492173871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65bck1", "likes": null, "replies": "", "user_reports": [], "id": "dg9h2p5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SeamlessYellow", "parent_id": "t3_65bck1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Don't forgive people who don't even bother being sorry. They will only hurt you again and waste your energy.\n\nForgive her for yourself but be smart enough to realize she will always put her partners interests before yours. \n\nDon't sell the business, just keep distance from your mom. She is the toxic factor her. It doesn't sound like she respects you at all.\n   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t forgive people who don&amp;#39;t even bother being sorry. They will only hurt you again and waste your energy.&lt;/p&gt;\n\n&lt;p&gt;Forgive her for yourself but be smart enough to realize she will always put her partners interests before yours. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t sell the business, just keep distance from your mom. She is the toxic factor her. It doesn&amp;#39;t sound like she respects you at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dg9h2p5", "score_hidden": false, "stickied": false, "created": 1492220695.0, "created_utc": 1492191895.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]