[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in a relationship with my girlfriend for going on three years now.  I really do care about her, but I am beginning to get tired of the relationship.  I&amp;#39;m a total pushover when it comes to her, and thus, I feel like she takes advantage of me.  We work opposite shifts, (she works 7a-3p, and I work 3p-11p) so we don&amp;#39;t tend to see each other often during the week.  We&amp;#39;re both off on weekends, however, and EVERY weekend must be devoted to her.  If I want to go out with friends on a Saturday night, she guilt trips me into cancelling plans (&amp;quot;Saturdays are supposed to be MY day.&amp;quot; &amp;quot;I never see you.&amp;quot; &amp;quot;Do you not want me around?&amp;quot;) and then promptly claims she&amp;#39;s tired and doesnt want to do anything and goes to bed at 9pm.  I haven&amp;#39;t done anything on my own in months, and she often tries to get me to neglect my parents and siblings.  She would drop everything if her parents or siblings needed her, but when I want to go watch one of my sibling&amp;#39;s sporting events or catch a ball game with my dad, she complains and begs me to cancel.  I usually give in, but if I refuse, she insists on coming along, and then complains the entire time and uses it as ammo the next time I want to do anything.  This isn&amp;#39;t my only complaint about the relationship, but it&amp;#39;s a major part and I&amp;#39;m getting tired of it.  If I bring it up and try to talk to her about it, she spins the conversation to make everything my fault, and end up guilt tripping me into apologizing, even though all I wanted was to have a civil discussion about how I feel and shouldn&amp;#39;t feel like I&amp;#39;ve done anything wrong.  It&amp;#39;s super emotionally draining.  I&amp;#39;ve tried to break it off before, but every time I have, she ends up crying and begging and pleading for me to come back, promising that things will change, but they never do. We currently live with her parents, and I&amp;#39;m trying to figure out the best way/time/place to break it off, but don&amp;#39;t know how.  I&amp;#39;m afraid that the ensuing fallout of begging, tears, and guilt tripping will convince me to stay even though I&amp;#39;ve been unhappy for a while.  I can&amp;#39;t picture spending the rest of my life with her due to these things, and am at the point that I feel like I&amp;#39;m wasting both her time and mine by dragging this relationship out.  Any help or advice would be appreciated.&lt;/p&gt;\n\n&lt;p&gt;TL;DR:  Am living with my girlfriend in her parent&amp;#39;s house, and want out due to the emotional drain of her possessiveness.  Don&amp;#39;t know how to end things civilly without getting guilt tripped into staying.&lt;/p&gt;\n\n&lt;p&gt;Sorry for any formatting issues or text wall.  Am on mobile and am new to reddit posting.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been in a relationship with my girlfriend for going on three years now.  I really do care about her, but I am beginning to get tired of the relationship.  I'm a total pushover when it comes to her, and thus, I feel like she takes advantage of me.  We work opposite shifts, (she works 7a-3p, and I work 3p-11p) so we don't tend to see each other often during the week.  We're both off on weekends, however, and EVERY weekend must be devoted to her.  If I want to go out with friends on a Saturday night, she guilt trips me into cancelling plans (\"Saturdays are supposed to be MY day.\" \"I never see you.\" \"Do you not want me around?\") and then promptly claims she's tired and doesnt want to do anything and goes to bed at 9pm.  I haven't done anything on my own in months, and she often tries to get me to neglect my parents and siblings.  She would drop everything if her parents or siblings needed her, but when I want to go watch one of my sibling's sporting events or catch a ball game with my dad, she complains and begs me to cancel.  I usually give in, but if I refuse, she insists on coming along, and then complains the entire time and uses it as ammo the next time I want to do anything.  This isn't my only complaint about the relationship, but it's a major part and I'm getting tired of it.  If I bring it up and try to talk to her about it, she spins the conversation to make everything my fault, and end up guilt tripping me into apologizing, even though all I wanted was to have a civil discussion about how I feel and shouldn't feel like I've done anything wrong.  It's super emotionally draining.  I've tried to break it off before, but every time I have, she ends up crying and begging and pleading for me to come back, promising that things will change, but they never do. We currently live with her parents, and I'm trying to figure out the best way/time/place to break it off, but don't know how.  I'm afraid that the ensuing fallout of begging, tears, and guilt tripping will convince me to stay even though I've been unhappy for a while.  I can't picture spending the rest of my life with her due to these things, and am at the point that I feel like I'm wasting both her time and mine by dragging this relationship out.  Any help or advice would be appreciated.\n\nTL;DR:  Am living with my girlfriend in her parent's house, and want out due to the emotional drain of her possessiveness.  Don't know how to end things civilly without getting guilt tripped into staying.\n\nSorry for any formatting issues or text wall.  Am on mobile and am new to reddit posting.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gsce", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "PyssDribbletts", "saved": false, "mod_reports": [], "name": "t3_65gsce", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65gsce/i_25m_want_to_break_it_off_with_my_girlfriend_23f/", "num_reports": null, "locked": false, "stickied": false, "created": 1492251546.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65gsce/i_25m_want_to_break_it_off_with_my_girlfriend_23f/", "author_flair_text": null, "quarantine": false, "title": "I [25/m] want to break it off with my girlfriend [23/f], but I don't know how.", "created_utc": 1492222746.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65gsce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65gsce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65gsce", "likes": null, "replies": "", "user_reports": [], "id": "dga66fw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "omghi2posers", "parent_id": "t1_dga60t1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Move your stuff first if you can. Then just be honest and firm. This isn't working for me. I need to go and we can't be together ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Move your stuff first if you can. Then just be honest and firm. This isn&amp;#39;t working for me. I need to go and we can&amp;#39;t be together &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dga66fw", "score_hidden": false, "stickied": false, "created": 1492253012.0, "created_utc": 1492224212.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dga60t1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PyssDribbletts", "parent_id": "t1_dga577d", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I've got a friend I can crash with. I've already talked to him about it. My problem is I don't know how to tell her I'm moving out without going through the mental manipulation that she is so good at. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve got a friend I can crash with. I&amp;#39;ve already talked to him about it. My problem is I don&amp;#39;t know how to tell her I&amp;#39;m moving out without going through the mental manipulation that she is so good at. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dga60t1", "score_hidden": false, "stickied": false, "created": 1492252789.0, "created_utc": 1492223989.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga577d", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "omghi2posers", "parent_id": "t3_65gsce", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Find a place and move out dude. Crash with a friend or whatever if you need to. Rip off the bandaid and don't live with a girlfriends parents again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find a place and move out dude. Crash with a friend or whatever if you need to. Rip off the bandaid and don&amp;#39;t live with a girlfriends parents again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dga577d", "score_hidden": false, "stickied": false, "created": 1492251612.0, "created_utc": 1492222812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65gsce", "likes": null, "replies": "", "user_reports": [], "id": "dgacuxq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Deedesai", "parent_id": "t3_65gsce", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah take a day off work or something and move your things before you tell her. After having everything set, tell her everything she did to you and how unhappy you are. Be very firm about it. Be selfish for once. If she tries to guilt trip you, start thinking about all the negative things she has done. All the points you mentioned here so it might help you stay firm to your decision. Tell her that this is not going to improve at all ever and you have given her enough chances. Tell her you don't love her at all anymore. Be harsh, it's okay. Even if she cries and begs and even if threatens to kill her self, please don't fall for any of it because she's a manipulative and controlling bitch. You deserve a better life. \n\nCut her off from everywhere. Block her number, her parents number, her friends everyone she might use to get you back. Block her and her friends and family from all the social media. Do not leave any place for her to reach you. If she has your parents and friends numbers and all, ask them to do the same. Just ignore her. This shouldn't be hard for you after what she made you go through. \n\nAlso do not tell her where you are going and if she finds it out somehow, ask the watchman or whatever you have to never let her inside. Threaten her that you will call the cops pr something (you don't actually have to call them). \nAll these steps may look a but too much but trust me you need to do all this because she's too smart and she knows she can manipulate you. So as long as she can't talk to you, she won't be able to manipulate you.\nShe will try everything to get you back but please DO NOT go back ever!!!", "edited": 1492236021.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah take a day off work or something and move your things before you tell her. After having everything set, tell her everything she did to you and how unhappy you are. Be very firm about it. Be selfish for once. If she tries to guilt trip you, start thinking about all the negative things she has done. All the points you mentioned here so it might help you stay firm to your decision. Tell her that this is not going to improve at all ever and you have given her enough chances. Tell her you don&amp;#39;t love her at all anymore. Be harsh, it&amp;#39;s okay. Even if she cries and begs and even if threatens to kill her self, please don&amp;#39;t fall for any of it because she&amp;#39;s a manipulative and controlling bitch. You deserve a better life. &lt;/p&gt;\n\n&lt;p&gt;Cut her off from everywhere. Block her number, her parents number, her friends everyone she might use to get you back. Block her and her friends and family from all the social media. Do not leave any place for her to reach you. If she has your parents and friends numbers and all, ask them to do the same. Just ignore her. This shouldn&amp;#39;t be hard for you after what she made you go through. &lt;/p&gt;\n\n&lt;p&gt;Also do not tell her where you are going and if she finds it out somehow, ask the watchman or whatever you have to never let her inside. Threaten her that you will call the cops pr something (you don&amp;#39;t actually have to call them). \nAll these steps may look a but too much but trust me you need to do all this because she&amp;#39;s too smart and she knows she can manipulate you. So as long as she can&amp;#39;t talk to you, she won&amp;#39;t be able to manipulate you.\nShe will try everything to get you back but please DO NOT go back ever!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgacuxq", "score_hidden": false, "stickied": false, "created": 1492264504.0, "created_utc": 1492235704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65gsce", "likes": null, "replies": "", "user_reports": [], "id": "dgacvgz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "8530683641", "parent_id": "t3_65gsce", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "The best way is the direct way no matter how much difficult it is so gather some courage to end this relationship and tell her everything why you want end this relationship. You have to be prepared for the drama as that is something come up when you let her know but you should stay firm on your decision to end the relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best way is the direct way no matter how much difficult it is so gather some courage to end this relationship and tell her everything why you want end this relationship. You have to be prepared for the drama as that is something come up when you let her know but you should stay firm on your decision to end the relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgacvgz", "score_hidden": false, "stickied": false, "created": 1492264535.0, "created_utc": 1492235735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65gsce", "likes": null, "replies": "", "user_reports": [], "id": "dgahrbj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ChildfreePersonified", "parent_id": "t3_65gsce", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She's not really crying though.  My grandmother had a term for this... \"crocodile tears\". When I was a kid and didn't get my way I would cry and beg and plead.  My grandmother always saw through it.  \"Stop the waterworks,  crocodile tears don't work on me\". Know that she's not crying from being hurt... she's crying because she's not getting her way and the tears have worked in the past.  Same reason I cry when I get pulled over by a cop... I'm not really THAT upset about getting a ticket,  but 80% of the time crying gets me out of a ticket.  Keep reminding yourself... she's crying to manipulate me.  She's not really upset. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s not really crying though.  My grandmother had a term for this... &amp;quot;crocodile tears&amp;quot;. When I was a kid and didn&amp;#39;t get my way I would cry and beg and plead.  My grandmother always saw through it.  &amp;quot;Stop the waterworks,  crocodile tears don&amp;#39;t work on me&amp;quot;. Know that she&amp;#39;s not crying from being hurt... she&amp;#39;s crying because she&amp;#39;s not getting her way and the tears have worked in the past.  Same reason I cry when I get pulled over by a cop... I&amp;#39;m not really THAT upset about getting a ticket,  but 80% of the time crying gets me out of a ticket.  Keep reminding yourself... she&amp;#39;s crying to manipulate me.  She&amp;#39;s not really upset. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgahrbj", "score_hidden": false, "stickied": false, "created": 1492277740.0, "created_utc": 1492248940.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]