[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;[Update] I talked it over with my mom, and explained why I was upset. She apologised, I apologised, it&amp;#39;s all good. Thanks to everyone who replied; your perspectives were invaluable and really did help a lot.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Hi, &lt;a href=\"/r/relationship_advice\"&gt;/r/relationship_advice&lt;/a&gt;,&lt;/p&gt;\n\n&lt;p&gt;I could use some impartial advice on this one. I lost my dog this week, and I can&amp;#39;t tell if what I&amp;#39;m feeling is just a result of my grief, or if it&amp;#39;s legit.&lt;/p&gt;\n\n&lt;p&gt;I was in a meeting at work on Tuesday morning when I received a text from my mother, telling me that our dog(&amp;#39;A&amp;#39;) was very ill and had been taken to the Vet. Two hours later, she told me in another text that A had been put to sleep at the Vet&amp;#39;s recommendation, because she had suffered a stroke. I was so upset that I had to leave the office for the afternoon, and return once I had composed myself. It was just so sudden. I mean, obviously I knew it was going to happen soon; we got A when I was 15, so I more or less grew up with her. But she had been strong and perfectly fine when I last saw her 3 weeks ago.&lt;/p&gt;\n\n&lt;p&gt;Shortly after I found out that A was dead, I read my sister&amp;#39;s dramatic FB post about her. The whole thing struck me as attention-seeking, because she was never particularly kind to A and didn&amp;#39;t spend a great deal of time with her; my sister left home shortly after we got A, whereas I was late to leave home.&lt;/p&gt;\n\n&lt;p&gt;When I asked my mother when A had the stroke, she told me via text &amp;#39;late last(Monday) night&amp;#39;, so I assumed that my parents only found that A was ill on Tuesday morning.&lt;/p&gt;\n\n&lt;p&gt;I arrived home yesterday(Friday) afternoon and we talked about what happened. A suffered the stroke in the early evening on Monday, which is when the appointment at the Vet was made. She had lost control of the lower half of her body and could only crawl, and was shaking. My sister arrived at my parents&amp;#39; on Tuesday morning, and she and my dad took A to the Vet&amp;#39;s, where the decision was made to euthanise her. Before they departed, they obviously expected that A wouldn&amp;#39;t return; they all said their goodbyes - my parents, my sister and my sister&amp;#39;s kids. After A was taken to the Vet and mom texted me is the first I heard of A even being unwell. An hour later she was dead.&lt;/p&gt;\n\n&lt;p&gt;Then, according to my mother, my sister went to post about A on Facebook. It was then that my family realised that I hadn&amp;#39;t been told. So my sister told everyone we know that my childhood dog was dead an hour before any of my family thought to tell me. My family knew that A was seriously unwell from roughly 7pm on Monday night. I live away from home now, but only by an hour or so. If I had been told, there would have been more than enough time for me to make it home Monday night and arrange to work from home on Tuesday so I could say goodbye to A. Instead, I&amp;#39;m the only one who didn&amp;#39;t get to see her and say my farewells.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been grieving for A all week. I knew that dog for half of my entire life, and I loved her. I was with her nearly every single day of her life. &lt;/p&gt;\n\n&lt;p&gt;I was literally the last person to know that anything was even wrong with A. I was denied the chance to see her one last time, when I could easily have done so if I had known what was going on in time. The entire world knew before I did. On top of all that, it was my sister with A in her last moments when it should have been me - when A had a serious illness three years back, it was me in the Vet&amp;#39;s room with her, and it was me who nursed her back to health afterwards.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m home for the Easter weekend, but I&amp;#39;m really beginning to feel like I don&amp;#39;t want to be. The house is so empty and sad without A, and I&amp;#39;m just so hurt and upset by my exclusion from everything that I just want to return to my apartment and be alone. I know that my family are hurting over A&amp;#39;s loss, but I don&amp;#39;t know if I can pretend that I&amp;#39;m not hurt by their thoughtlessness, on top of my own grief.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: Telling me that my dog of 14 years was dying seems to have been an afterthought to my family. I was the last to know, and I wasn&amp;#39;t offered the chance to say goodbye. Am I right to be angry with them?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**[Update] I talked it over with my mom, and explained why I was upset. She apologised, I apologised, it's all good. Thanks to everyone who replied; your perspectives were invaluable and really did help a lot.**\n\nHi, /r/relationship_advice,\n\nI could use some impartial advice on this one. I lost my dog this week, and I can't tell if what I'm feeling is just a result of my grief, or if it's legit.\n\nI was in a meeting at work on Tuesday morning when I received a text from my mother, telling me that our dog('A') was very ill and had been taken to the Vet. Two hours later, she told me in another text that A had been put to sleep at the Vet's recommendation, because she had suffered a stroke. I was so upset that I had to leave the office for the afternoon, and return once I had composed myself. It was just so sudden. I mean, obviously I knew it was going to happen soon; we got A when I was 15, so I more or less grew up with her. But she had been strong and perfectly fine when I last saw her 3 weeks ago.\n\nShortly after I found out that A was dead, I read my sister's dramatic FB post about her. The whole thing struck me as attention-seeking, because she was never particularly kind to A and didn't spend a great deal of time with her; my sister left home shortly after we got A, whereas I was late to leave home.\n\nWhen I asked my mother when A had the stroke, she told me via text 'late last(Monday) night', so I assumed that my parents only found that A was ill on Tuesday morning.\n\nI arrived home yesterday(Friday) afternoon and we talked about what happened. A suffered the stroke in the early evening on Monday, which is when the appointment at the Vet was made. She had lost control of the lower half of her body and could only crawl, and was shaking. My sister arrived at my parents' on Tuesday morning, and she and my dad took A to the Vet's, where the decision was made to euthanise her. Before they departed, they obviously expected that A wouldn't return; they all said their goodbyes - my parents, my sister and my sister's kids. After A was taken to the Vet and mom texted me is the first I heard of A even being unwell. An hour later she was dead.\n\nThen, according to my mother, my sister went to post about A on Facebook. It was then that my family realised that I hadn't been told. So my sister told everyone we know that my childhood dog was dead an hour before any of my family thought to tell me. My family knew that A was seriously unwell from roughly 7pm on Monday night. I live away from home now, but only by an hour or so. If I had been told, there would have been more than enough time for me to make it home Monday night and arrange to work from home on Tuesday so I could say goodbye to A. Instead, I'm the only one who didn't get to see her and say my farewells.\n\nI've been grieving for A all week. I knew that dog for half of my entire life, and I loved her. I was with her nearly every single day of her life. \n\nI was literally the last person to know that anything was even wrong with A. I was denied the chance to see her one last time, when I could easily have done so if I had known what was going on in time. The entire world knew before I did. On top of all that, it was my sister with A in her last moments when it should have been me - when A had a serious illness three years back, it was me in the Vet's room with her, and it was me who nursed her back to health afterwards.\n\nI'm home for the Easter weekend, but I'm really beginning to feel like I don't want to be. The house is so empty and sad without A, and I'm just so hurt and upset by my exclusion from everything that I just want to return to my apartment and be alone. I know that my family are hurting over A's loss, but I don't know if I can pretend that I'm not hurt by their thoughtlessness, on top of my own grief.\n\n\n**TL;DR: Telling me that my dog of 14 years was dying seems to have been an afterthought to my family. I was the last to know, and I wasn't offered the chance to say goodbye. Am I right to be angry with them?**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65jw6s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Lethaliin", "saved": false, "mod_reports": [], "name": "t3_65jw6s", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492377133.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65jw6s/i_29f_was_the_last_to_find_out_that_my_dog_was/", "num_reports": null, "locked": false, "stickied": false, "created": 1492301923.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65jw6s/i_29f_was_the_last_to_find_out_that_my_dog_was/", "author_flair_text": null, "quarantine": false, "title": "I [29F] was the last to find out that my dog was dead. Am I right to be upset with my family?", "created_utc": 1492273123.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": "", "user_reports": [], "id": "dgayg03", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "StrappedDownTight", "parent_id": "t1_dgaxasz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You asked if you were right to be angry with them. Now you claim it was all unintentional on their part. So you've answered your own question. If it was unintentional, you have absolutely no right to be angry with them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You asked if you were right to be angry with them. Now you claim it was all unintentional on their part. So you&amp;#39;ve answered your own question. If it was unintentional, you have absolutely no right to be angry with them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgayg03", "score_hidden": false, "stickied": false, "created": 1492308449.0, "created_utc": 1492279649.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxasz", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Lethaliin", "parent_id": "t1_dgawhds", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "As I said in my post, I left home late and I was with my dog for almost every day of her life. That includes nursing her back to health after serious illness, and being there for her old age.\n\nNowhere in my post do I accuse my parents of intentionally excluding me (nor would I ever). There's no doubt in my mind that this was all unintentional. But that wasn't the question I asked.\n\nThank you for your reply, regardless.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As I said in my post, I left home late and I was with my dog for almost every day of her life. That includes nursing her back to health after serious illness, and being there for her old age.&lt;/p&gt;\n\n&lt;p&gt;Nowhere in my post do I accuse my parents of intentionally excluding me (nor would I ever). There&amp;#39;s no doubt in my mind that this was all unintentional. But that wasn&amp;#39;t the question I asked.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your reply, regardless.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgaxasz", "score_hidden": false, "stickied": false, "created": 1492306909.0, "created_utc": 1492278109.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawhds", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "StrappedDownTight", "parent_id": "t3_65jw6s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It's difficult to grow up and leave home because we leave so much behind. And yet we still do it because we must find our own way in the world. It sounds like you are grieving the loss of your childhood as much as the loss of your dog. \n\nYour parents were the ones still taking care of that dog day in and day out as it got old and declined. They're they ones who dealt with its final illness and death. Perhaps they didn't make the clearest decisions in the moment. They were sad, too. For you to accuse them of intentionally excluding you and trying to hurt you is ridiculous and selfish. \n\nWe give up many things when we leave home, and one of them is sharing in the day-to-day goings on of our parents' household. Instead of focusing on your own hurt feelings and lashing out at others because you feel sad, thank your parents for taking such good care of your family pet for all those years and even after you left home. Grieve together the loss of an important part of your shared family life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s difficult to grow up and leave home because we leave so much behind. And yet we still do it because we must find our own way in the world. It sounds like you are grieving the loss of your childhood as much as the loss of your dog. &lt;/p&gt;\n\n&lt;p&gt;Your parents were the ones still taking care of that dog day in and day out as it got old and declined. They&amp;#39;re they ones who dealt with its final illness and death. Perhaps they didn&amp;#39;t make the clearest decisions in the moment. They were sad, too. For you to accuse them of intentionally excluding you and trying to hurt you is ridiculous and selfish. &lt;/p&gt;\n\n&lt;p&gt;We give up many things when we leave home, and one of them is sharing in the day-to-day goings on of our parents&amp;#39; household. Instead of focusing on your own hurt feelings and lashing out at others because you feel sad, thank your parents for taking such good care of your family pet for all those years and even after you left home. Grieve together the loss of an important part of your shared family life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgawhds", "score_hidden": false, "stickied": false, "created": 1492305799.0, "created_utc": 1492276999.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": "", "user_reports": [], "id": "dgb3wcv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lethaliin", "parent_id": "t1_dgb3mpn", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This really helps, thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This really helps, thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb3wcv", "score_hidden": false, "stickied": false, "created": 1492315844.0, "created_utc": 1492287044.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3mpn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "redditlady999", "parent_id": "t3_65jw6s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm sorry for your loss. I think it is going to take a while to truly get through the raw feelings of grief, complicated by the feeling of being slighted at that important vet meeting. \n\nWe just had our cat euthanized. Even though a cat does not  interact as noisily as a dog does, our bedroom seems really empty and quiet without her. Maybe the best place for you to be is in your apartment and alone. So many reminders of her at your parents' house.\n\nYour family let you know that A was seriously unwell on Tuesday morning, followed quickly (1 hour) by the news that the vet euthanized A. \n\nHad they called you, telling you only that A was seriously unwell, you would have traveled  the one hour it took - on Monday night - to be there at the vet meeting. But what if your family had hopes that despite how things looked, A would get better?  They have their grief to deal with now (kids especially can feel the pain of losing an animal, without any 'rational' buffers that come with maturity)\n\nMy husband reminded me that our remaining cat - they had to kept apart, so he didn't come anywhere near her 'territory' - had gone to the vet with serious symptoms  a few years ago and my husband  expected the vet to euthanize that cat. The cat is alive and kicking today - apparently looking like he was at death's door didn't really mean he was there. My husband may have said his goodbyes to the cat at that time but I didn't - I thought the vet could do something, and the vet did! You always hope, and sometimes you're right to have hope. \n\nI'm sorry you lost A. It makes it worse to blame your family for anything - they did what they could. They were there, they had their own feelings to process. They had a hard task to deal with, one they didn't want to handle, I'm sure. \n\nThe last time we had a sick cat who had to be euthanized, we spent an ungodly amount of money at an animal hospital trying to let other vets try to save her. The entire process was so painful - for the cat, and for us - that it affected the way we dealt with our current cat's illness. There are opportunities for blame and bad feelings everywhere in such situations but they don't serve anyone or any good purpose. It really can make a terrible situation so much worse.\n\n", "edited": 1492287017.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry for your loss. I think it is going to take a while to truly get through the raw feelings of grief, complicated by the feeling of being slighted at that important vet meeting. &lt;/p&gt;\n\n&lt;p&gt;We just had our cat euthanized. Even though a cat does not  interact as noisily as a dog does, our bedroom seems really empty and quiet without her. Maybe the best place for you to be is in your apartment and alone. So many reminders of her at your parents&amp;#39; house.&lt;/p&gt;\n\n&lt;p&gt;Your family let you know that A was seriously unwell on Tuesday morning, followed quickly (1 hour) by the news that the vet euthanized A. &lt;/p&gt;\n\n&lt;p&gt;Had they called you, telling you only that A was seriously unwell, you would have traveled  the one hour it took - on Monday night - to be there at the vet meeting. But what if your family had hopes that despite how things looked, A would get better?  They have their grief to deal with now (kids especially can feel the pain of losing an animal, without any &amp;#39;rational&amp;#39; buffers that come with maturity)&lt;/p&gt;\n\n&lt;p&gt;My husband reminded me that our remaining cat - they had to kept apart, so he didn&amp;#39;t come anywhere near her &amp;#39;territory&amp;#39; - had gone to the vet with serious symptoms  a few years ago and my husband  expected the vet to euthanize that cat. The cat is alive and kicking today - apparently looking like he was at death&amp;#39;s door didn&amp;#39;t really mean he was there. My husband may have said his goodbyes to the cat at that time but I didn&amp;#39;t - I thought the vet could do something, and the vet did! You always hope, and sometimes you&amp;#39;re right to have hope. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you lost A. It makes it worse to blame your family for anything - they did what they could. They were there, they had their own feelings to process. They had a hard task to deal with, one they didn&amp;#39;t want to handle, I&amp;#39;m sure. &lt;/p&gt;\n\n&lt;p&gt;The last time we had a sick cat who had to be euthanized, we spent an ungodly amount of money at an animal hospital trying to let other vets try to save her. The entire process was so painful - for the cat, and for us - that it affected the way we dealt with our current cat&amp;#39;s illness. There are opportunities for blame and bad feelings everywhere in such situations but they don&amp;#39;t serve anyone or any good purpose. It really can make a terrible situation so much worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb3mpn", "score_hidden": false, "stickied": false, "created": 1492315471.0, "created_utc": 1492286671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": "", "user_reports": [], "id": "dgbdto6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ronald_Dillons", "parent_id": "t3_65jw6s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Not really. It seemed like they believed someone else in the family would do so, a bystander effect. It's not like they told you a week later.\n\nHonestly, I would've told you after you were off work so it wouldn't disrupt you in such an inopportune way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really. It seemed like they believed someone else in the family would do so, a bystander effect. It&amp;#39;s not like they told you a week later.&lt;/p&gt;\n\n&lt;p&gt;Honestly, I would&amp;#39;ve told you after you were off work so it wouldn&amp;#39;t disrupt you in such an inopportune way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbdto6", "score_hidden": false, "stickied": false, "created": 1492329762.0, "created_utc": 1492300962.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": "", "user_reports": [], "id": "dgaxvir", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kindernut", "parent_id": "t3_65jw6s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Please yell at your sister for me. Yeah in all seriousness, I would be upset too. They should have told you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please yell at your sister for me. Yeah in all seriousness, I would be upset too. They should have told you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgaxvir", "score_hidden": false, "stickied": false, "created": 1492307691.0, "created_utc": 1492278891.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65jw6s", "likes": null, "replies": "", "user_reports": [], "id": "dgaxbem", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lethaliin", "parent_id": "t1_dgaua4h", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you for your reply, I'll think on it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your reply, I&amp;#39;ll think on it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgaxbem", "score_hidden": false, "stickied": false, "created": 1492306931.0, "created_utc": 1492278131.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaua4h", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t3_65jw6s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "You should be upset is the short answer, not one of them told you nearly quickly enough. \n\nThe only reasonable excuse they could possibly have is they were upset and not thinking straight but none thought to tell you? Be angry they were selfish and that dog was your family\n\nBut don't leave home you need to have this out with them and yell at them and be upset and grieve, don't bottle this up . I wasn't there when one of my cats died and it still bothers me years later, your reaction is normal just don;t let it sour things with yuor family or turn into a grudge, they need to seriously apologize", "edited": 1492274240.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should be upset is the short answer, not one of them told you nearly quickly enough. &lt;/p&gt;\n\n&lt;p&gt;The only reasonable excuse they could possibly have is they were upset and not thinking straight but none thought to tell you? Be angry they were selfish and that dog was your family&lt;/p&gt;\n\n&lt;p&gt;But don&amp;#39;t leave home you need to have this out with them and yell at them and be upset and grieve, don&amp;#39;t bottle this up . I wasn&amp;#39;t there when one of my cats died and it still bothers me years later, your reaction is normal just don;t let it sour things with yuor family or turn into a grudge, they need to seriously apologize&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgaua4h", "score_hidden": false, "stickied": false, "created": 1492302747.0, "created_utc": 1492273947.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]