[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure how to start, probably at the fact me and my girlfriend have been together for 3 years in a long distance relationship. We would see eachother every month or so and I would do everything for her. She didnt like getting the train down to me on her own, so I would get the train to her just so she didnt have to do the journey alone. She never wanted when she was with me, took her out for meals, shopping, everything she wanted I got her. Washed her sick bucket when she was ill (gross I know) and generally just made sure she knew she meant everything to me. I supported her through everything. Last time I seen here was roughly 5 weeks. (I&amp;#39;v always had trust issues which will come into it shortly)&lt;/p&gt;\n\n&lt;p&gt;Up until 4 days ago I thought everything was perfectly fine and thought she was the best thing I ever had in my life. We had a disagreement and she very easily broke up with me for something small, I thought I would give her a bit of space and we would sort it out. I text her and asked if she wanted to speak to which she said not really. then blocked my number. I had a look at her instagram to see if she posted anything to let on how she was feeling when I seen something that made my guts turn. It was a picture of her and another lad kissing, tagged with &amp;#39;last night was lit&amp;#39;. Dated 2 weeks ago. Check the date against my messaged with her, that night she &amp;#39;went to bed&amp;#39; at 9pm. Bearing in mind she always told me she had never been drunk in her life because she didn&amp;#39;t want me to not trust her, even though she is the only person I have ever trusted 100% with anything as she just wasn&amp;#39;t the person to do this. Another photo of her, with the same person and 2 other guys, outside the emirates, tagged with &amp;#39;Great stadium, thanks to (gf) (lad1) (lad2) for keeping me company. Then her comment : &amp;#39;I wasnt even that drunk ;)&amp;#39; to which he replied &amp;#39;Yeah yeah ;)&amp;#39;. Check the dates again, the night she told me she was stopping at her female friends house.&lt;/p&gt;\n\n&lt;p&gt;I messaged her on facebook, just wanting answers as to who and how long its been going on. I thought maybe after 3 years I deserved to know the truth? Apparantly not, because I got blocked with no reply. I&amp;#39;m broken. I put my everything into this person and genuinely believed I would spend the rest of my life with her. Our relationship was great, hardly any arguments, we always had something to do and we had great times when we was together. I feel like the whole relationship has been a lie, I dont know what to believe from her and dont even know if when we was together last time she was texting someone else the whole time. All I wanted was answers and she cant even give me them, its like I meant nothing to her and she doesnt give a shit. I&amp;#39;m in a shit place, I started drinking just to numb the thoughts, I havnt slept properly in 3 days or eaten in two.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do. I cant get the thoughts out of my head of her with somebody else, and although she hurt me like nobody else I keep praying that maybe she will text or call, although I know it&amp;#39;s not going to happen. Im both angry and hurt at the same time, and all I feel is that I&amp;#39;ll never find anyone as good as her. Is the cheating my fault? How do I even begin to get over her?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not sure how to start, probably at the fact me and my girlfriend have been together for 3 years in a long distance relationship. We would see eachother every month or so and I would do everything for her. She didnt like getting the train down to me on her own, so I would get the train to her just so she didnt have to do the journey alone. She never wanted when she was with me, took her out for meals, shopping, everything she wanted I got her. Washed her sick bucket when she was ill (gross I know) and generally just made sure she knew she meant everything to me. I supported her through everything. Last time I seen here was roughly 5 weeks. (I'v always had trust issues which will come into it shortly)\n\nUp until 4 days ago I thought everything was perfectly fine and thought she was the best thing I ever had in my life. We had a disagreement and she very easily broke up with me for something small, I thought I would give her a bit of space and we would sort it out. I text her and asked if she wanted to speak to which she said not really. then blocked my number. I had a look at her instagram to see if she posted anything to let on how she was feeling when I seen something that made my guts turn. It was a picture of her and another lad kissing, tagged with 'last night was lit'. Dated 2 weeks ago. Check the date against my messaged with her, that night she 'went to bed' at 9pm. Bearing in mind she always told me she had never been drunk in her life because she didn't want me to not trust her, even though she is the only person I have ever trusted 100% with anything as she just wasn't the person to do this. Another photo of her, with the same person and 2 other guys, outside the emirates, tagged with 'Great stadium, thanks to (gf) (lad1) (lad2) for keeping me company. Then her comment : 'I wasnt even that drunk ;)' to which he replied 'Yeah yeah ;)'. Check the dates again, the night she told me she was stopping at her female friends house.\n\nI messaged her on facebook, just wanting answers as to who and how long its been going on. I thought maybe after 3 years I deserved to know the truth? Apparantly not, because I got blocked with no reply. I'm broken. I put my everything into this person and genuinely believed I would spend the rest of my life with her. Our relationship was great, hardly any arguments, we always had something to do and we had great times when we was together. I feel like the whole relationship has been a lie, I dont know what to believe from her and dont even know if when we was together last time she was texting someone else the whole time. All I wanted was answers and she cant even give me them, its like I meant nothing to her and she doesnt give a shit. I'm in a shit place, I started drinking just to numb the thoughts, I havnt slept properly in 3 days or eaten in two.\n\nI don't know what to do. I cant get the thoughts out of my head of her with somebody else, and although she hurt me like nobody else I keep praying that maybe she will text or call, although I know it's not going to happen. Im both angry and hurt at the same time, and all I feel is that I'll never find anyone as good as her. Is the cheating my fault? How do I even begin to get over her?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kbh7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "TamboFCB", "saved": false, "mod_reports": [], "name": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65kbh7/21mhow_do_i_get_over_a_cheating_ex18f/", "num_reports": null, "locked": false, "stickied": false, "created": 1492306581.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65kbh7/21mhow_do_i_get_over_a_cheating_ex18f/", "author_flair_text": null, "quarantine": false, "title": "[21/m]How do I get over a cheating ex?(18/f)", "created_utc": 1492277781.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgayh3y", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "KevWill", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Step 1, block her on everything.  Then you don't need to fret about her contacting you, because she can't.  Step 2, She's a disgusting person to treat you like that.  You don't want to be with her.  Sure you miss her, but that will fade.  You aren't in the wrong here, she is.  Step 3, no more long distance relationships.  This is what happens.  Step 4, you need to take note when you are in a one sided relationship and have the balls to end it when you see it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Step 1, block her on everything.  Then you don&amp;#39;t need to fret about her contacting you, because she can&amp;#39;t.  Step 2, She&amp;#39;s a disgusting person to treat you like that.  You don&amp;#39;t want to be with her.  Sure you miss her, but that will fade.  You aren&amp;#39;t in the wrong here, she is.  Step 3, no more long distance relationships.  This is what happens.  Step 4, you need to take note when you are in a one sided relationship and have the balls to end it when you see it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgayh3y", "score_hidden": false, "stickied": false, "created": 1492308491.0, "created_utc": 1492279691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgayzyf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Form1040", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It happens with young women. Sorry. \n\nNever talk to her again. And make SURE your friends know what she did, so she cannot make you the bad guy. Very important. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It happens with young women. Sorry. &lt;/p&gt;\n\n&lt;p&gt;Never talk to her again. And make SURE your friends know what she did, so she cannot make you the bad guy. Very important. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgayzyf", "score_hidden": false, "stickied": false, "created": 1492309205.0, "created_utc": 1492280405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgazdha", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Cheating whore move on, unrepentant and a liar and no respect for you. Time to start deleting her messages and pictures and unload on social media at her, all very therapeutic\n\n&gt; I dont know what to believe from her and dont even know if when we was together last time she was texting someone else the whole time. All I wanted was answers and she cant even give me them, its like I meant nothing to her and she doesnt give a shit\n\nYou will get no answers, likely she has been cheating a while and wanted you to find out.\n\nGo make yourself some food and force it down or you will become lethargic and pathetic. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cheating whore move on, unrepentant and a liar and no respect for you. Time to start deleting her messages and pictures and unload on social media at her, all very therapeutic&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I dont know what to believe from her and dont even know if when we was together last time she was texting someone else the whole time. All I wanted was answers and she cant even give me them, its like I meant nothing to her and she doesnt give a shit&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You will get no answers, likely she has been cheating a while and wanted you to find out.&lt;/p&gt;\n\n&lt;p&gt;Go make yourself some food and force it down or you will become lethargic and pathetic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgazdha", "score_hidden": false, "stickied": false, "created": 1492309735.0, "created_utc": 1492280935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgaxmha", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Too much fluff. Find your self-esteem, self-respect, and balls. You don't want this girl contacting you again and, if she does, it's probably to get you to \"man up\" and share HSV2 with her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Too much fluff. Find your self-esteem, self-respect, and balls. You don&amp;#39;t want this girl contacting you again and, if she does, it&amp;#39;s probably to get you to &amp;quot;man up&amp;quot; and share HSV2 with her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgaxmha", "score_hidden": false, "stickied": false, "created": 1492307345.0, "created_utc": 1492278545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgaxull", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tabdab", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She's a piece of shit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s a piece of shit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgaxull", "score_hidden": false, "stickied": false, "created": 1492307654.0, "created_utc": 1492278854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgb5489", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kindernut", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She's not a very good person for doing it in that way. Block her and don't take her back when she comes running back to you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s not a very good person for doing it in that way. Block her and don&amp;#39;t take her back when she comes running back to you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb5489", "score_hidden": false, "stickied": false, "created": 1492317504.0, "created_utc": 1492288704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgb6y0s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Teddy3412", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "As others have said remove everything you have on her. Bye bye gone. Also date someone who you only see what appears to be once a month. Also if your doing all these things and being a genuinely nice person but aren't receiving the same in return then your being taken advantage of. I was in this position on numerous occasions and then I met my current GF who goes out of her way for me just like I do for her. It's reliving in way when you finally have a fair and even relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As others have said remove everything you have on her. Bye bye gone. Also date someone who you only see what appears to be once a month. Also if your doing all these things and being a genuinely nice person but aren&amp;#39;t receiving the same in return then your being taken advantage of. I was in this position on numerous occasions and then I met my current GF who goes out of her way for me just like I do for her. It&amp;#39;s reliving in way when you finally have a fair and even relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb6y0s", "score_hidden": false, "stickied": false, "created": 1492320027.0, "created_utc": 1492291227.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgbdu3f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Scarecrow1779", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That sucks really bad. I've been there myself. It might not feel like it, but she's doing the best thing for you right now. See it as admitting guilt. I would just assume the worst for now and (as others have said) not contact her. Closure is a lie we tell ourselves as an excuse to see them again. No matter what she could tell you, it would still leave you feeling just as empty and hurt, if not worse. This goes for following her or her friends on Instagram, too. \n\nIf you're anything like I was, you're going to be angry for quite a while, and it's going to haunt your every thought. You need to accept that you are angry and grieving, but it's also important to go to your support network. Hang out and talk with friends, go out and do things, play through a new video game. Once you've gotten all your work done for the day, DO SOMETHING. Don't just sit in your room thinking about it, letting it consume you. Sometimes, you'll be doing things just for the distraction, but that's ok. No matter what, you're still going to be thinking about it more than you want to.\n\nEventually, though, the pain will start to dull. Once you get to the point of being able to not think about it 24/7 and can calmly tell a stranger what happened without getting too emotional about it, it's time to reinforce on yourself the fact that this was not something that all girls will do to you. This were the selfish acts of a single individual, and do not represent the actions of all women.\n\nAs far as the \"Nobody will ever be as good as her\" line of thinking.... i definitely suffered from that train of thought in the past. I know telling you that it's not true won't make you think about it any less, but you WILL find somebody better. When you are in a relationship, it's VERY difficult to see its flaws. It's so easy to be wrapped up in the love that you tell yourself that this is perfect. However, as you stay away from your ex and, those flaws will start becoming visible to you. Seeing these flaws and understanding how parts of your personalities caused difficulties in your relationship is how you come to accept that maybe you never could have worked out. Even more importantly, this is also how you learn to pick future partners that you are more compatible with. \n\nThe fact that you found out about her infidelity is going to make this time of grieving more intense because of the jealousy and anger, but it's also going to make it much easier to move on than if you had been left completely in the dark on why she left. Now you know. Now you have these negative emotions that will make it easier to break those bonds that make it so hard to live without her. \n\nAs somebody who has cheated, i can tell you it's not your fault. Cheating happens one of two ways. Either the cheater purposefully sets out to do it, or they become trapped by a chain of bad decisions and self-deception and end up with strong feelings for multiple people. Either way, it is ultimately HER DECISIONS that led to the cheating, no matter what the circumstances of the relationship were.\n\nYou've got a rough time ahead of you, but so long as you don't isolate yourself from your friends and don't blame all women for this one person's actions, you WILL get over this and WILL find someone better. Good Luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sucks really bad. I&amp;#39;ve been there myself. It might not feel like it, but she&amp;#39;s doing the best thing for you right now. See it as admitting guilt. I would just assume the worst for now and (as others have said) not contact her. Closure is a lie we tell ourselves as an excuse to see them again. No matter what she could tell you, it would still leave you feeling just as empty and hurt, if not worse. This goes for following her or her friends on Instagram, too. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re anything like I was, you&amp;#39;re going to be angry for quite a while, and it&amp;#39;s going to haunt your every thought. You need to accept that you are angry and grieving, but it&amp;#39;s also important to go to your support network. Hang out and talk with friends, go out and do things, play through a new video game. Once you&amp;#39;ve gotten all your work done for the day, DO SOMETHING. Don&amp;#39;t just sit in your room thinking about it, letting it consume you. Sometimes, you&amp;#39;ll be doing things just for the distraction, but that&amp;#39;s ok. No matter what, you&amp;#39;re still going to be thinking about it more than you want to.&lt;/p&gt;\n\n&lt;p&gt;Eventually, though, the pain will start to dull. Once you get to the point of being able to not think about it 24/7 and can calmly tell a stranger what happened without getting too emotional about it, it&amp;#39;s time to reinforce on yourself the fact that this was not something that all girls will do to you. This were the selfish acts of a single individual, and do not represent the actions of all women.&lt;/p&gt;\n\n&lt;p&gt;As far as the &amp;quot;Nobody will ever be as good as her&amp;quot; line of thinking.... i definitely suffered from that train of thought in the past. I know telling you that it&amp;#39;s not true won&amp;#39;t make you think about it any less, but you WILL find somebody better. When you are in a relationship, it&amp;#39;s VERY difficult to see its flaws. It&amp;#39;s so easy to be wrapped up in the love that you tell yourself that this is perfect. However, as you stay away from your ex and, those flaws will start becoming visible to you. Seeing these flaws and understanding how parts of your personalities caused difficulties in your relationship is how you come to accept that maybe you never could have worked out. Even more importantly, this is also how you learn to pick future partners that you are more compatible with. &lt;/p&gt;\n\n&lt;p&gt;The fact that you found out about her infidelity is going to make this time of grieving more intense because of the jealousy and anger, but it&amp;#39;s also going to make it much easier to move on than if you had been left completely in the dark on why she left. Now you know. Now you have these negative emotions that will make it easier to break those bonds that make it so hard to live without her. &lt;/p&gt;\n\n&lt;p&gt;As somebody who has cheated, i can tell you it&amp;#39;s not your fault. Cheating happens one of two ways. Either the cheater purposefully sets out to do it, or they become trapped by a chain of bad decisions and self-deception and end up with strong feelings for multiple people. Either way, it is ultimately HER DECISIONS that led to the cheating, no matter what the circumstances of the relationship were.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve got a rough time ahead of you, but so long as you don&amp;#39;t isolate yourself from your friends and don&amp;#39;t blame all women for this one person&amp;#39;s actions, you WILL get over this and WILL find someone better. Good Luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbdu3f", "score_hidden": false, "stickied": false, "created": 1492329778.0, "created_utc": 1492300978.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgbp7j3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scratchingcats", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Cheating is always the cheater's fault. Plenty of amazing women out there who won't cheat on you, so please stay away from her. Delete her off everything and absolutely do not contact her. It will be hard for a few weeks, but it will be worst and linger if you continue to look for her or search her online. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cheating is always the cheater&amp;#39;s fault. Plenty of amazing women out there who won&amp;#39;t cheat on you, so please stay away from her. Delete her off everything and absolutely do not contact her. It will be hard for a few weeks, but it will be worst and linger if you continue to look for her or search her online. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbp7j3", "score_hidden": false, "stickied": false, "created": 1492346983.0, "created_utc": 1492318183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kbh7", "likes": null, "replies": "", "user_reports": [], "id": "dgbq7lx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "littlebluealien1", "parent_id": "t3_65kbh7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "There's nothing you can actually do about getting her to provide closure because if she doesn't want to, she won't. Maybe she's embarrassed or doesn't want to because it'll make her realize how much of a shitty person she is and she's too emotionally immature and pathetic to face herself. \n\nWhat you can do is block her on everything, that way you'll never expect anything from her. Then, keep living your life, keep doing other things, it'll be hard but maybe a good thing is that you were long distance so it's not like you saw her everyday, although I understand how not having her there to talk and just knowing it's over will be just as hard to deal with, but don't let this ruin you, your self worth, or your life. People can be shitty, life can be shitty, and this just happened to be both for you. But there's more to life and it's amazing as it is fucking shitty. Learn from this, grow from this. You will be okay. It's going to be okay. \n\nTake care of yourself. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s nothing you can actually do about getting her to provide closure because if she doesn&amp;#39;t want to, she won&amp;#39;t. Maybe she&amp;#39;s embarrassed or doesn&amp;#39;t want to because it&amp;#39;ll make her realize how much of a shitty person she is and she&amp;#39;s too emotionally immature and pathetic to face herself. &lt;/p&gt;\n\n&lt;p&gt;What you can do is block her on everything, that way you&amp;#39;ll never expect anything from her. Then, keep living your life, keep doing other things, it&amp;#39;ll be hard but maybe a good thing is that you were long distance so it&amp;#39;s not like you saw her everyday, although I understand how not having her there to talk and just knowing it&amp;#39;s over will be just as hard to deal with, but don&amp;#39;t let this ruin you, your self worth, or your life. People can be shitty, life can be shitty, and this just happened to be both for you. But there&amp;#39;s more to life and it&amp;#39;s amazing as it is fucking shitty. Learn from this, grow from this. You will be okay. It&amp;#39;s going to be okay. &lt;/p&gt;\n\n&lt;p&gt;Take care of yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbq7lx", "score_hidden": false, "stickied": false, "created": 1492348822.0, "created_utc": 1492320022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]