[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Me, recently divorced, with kids.  Have an acquaintance through work that over the last 5 months has developed into..... something.  But what?&lt;/p&gt;\n\n&lt;p&gt;He was married for 8 years has been divorced for 8.   Has had a couple of relationships since, the longest one being for 2 years and that has been over for a couple of years.  Wife left him and it devastated him.  He describes himself as being broken and feeling like he isn&amp;#39;t capable of fully loving ever again for fear of being devastated again.  He said he is not looking for a relationship and he&amp;#39;s been open and honest from the start.&lt;/p&gt;\n\n&lt;p&gt;We have become incredibly close; he says I&amp;#39;m his best friend.  He says he has given me more of his heart than he thought he had left.  Says he feels more for me than he thought was possible.  Feels more for me than he did the woman he was with for 2 years.  We have insane sexual chemistry and we actually didn&amp;#39;t become physical until just a couple of weeks ago.  We had been sexting and having mutual masturbation sessions via text the whole time but nothing physical outside of a hug until recently.  Sex is ridiculously amazing for both... he said he couldn&amp;#39;t believe how natural it felt the first time.  Asks me about my day, every day.  I was having a bad day at work last week and he set his alarm so he could wake up to come give me a hug for crying out loud.  Says he doesn&amp;#39;t know if he isn&amp;#39;t letting himself fall completely in love or if it just isn&amp;#39;t possible.  &lt;/p&gt;\n\n&lt;p&gt;But now, he says he feels confused.  I asked him if he wants to take a break and he says no.  He says walking away isn&amp;#39;t an option.  I am fairly certain there is no one else because if he isn&amp;#39;t working he has his kids.  We text multiple times throughout the day, every day.  &lt;/p&gt;\n\n&lt;p&gt;Any insight into this confusion?  The only thing that has been negative is he keeps saying &amp;quot;I don&amp;#39;t know what we are&amp;quot;.  Maybe I am somehow making him feel pressured without realizing it?&lt;/p&gt;\n\n&lt;p&gt;Tl;dr:  amazing guy that over the last 5 months has become my best friend is feeling confused but doesn&amp;#39;t want to take a break.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Me, recently divorced, with kids.  Have an acquaintance through work that over the last 5 months has developed into..... something.  But what?\n\nHe was married for 8 years has been divorced for 8.   Has had a couple of relationships since, the longest one being for 2 years and that has been over for a couple of years.  Wife left him and it devastated him.  He describes himself as being broken and feeling like he isn't capable of fully loving ever again for fear of being devastated again.  He said he is not looking for a relationship and he's been open and honest from the start.\n\nWe have become incredibly close; he says I'm his best friend.  He says he has given me more of his heart than he thought he had left.  Says he feels more for me than he thought was possible.  Feels more for me than he did the woman he was with for 2 years.  We have insane sexual chemistry and we actually didn't become physical until just a couple of weeks ago.  We had been sexting and having mutual masturbation sessions via text the whole time but nothing physical outside of a hug until recently.  Sex is ridiculously amazing for both... he said he couldn't believe how natural it felt the first time.  Asks me about my day, every day.  I was having a bad day at work last week and he set his alarm so he could wake up to come give me a hug for crying out loud.  Says he doesn't know if he isn't letting himself fall completely in love or if it just isn't possible.  \n\nBut now, he says he feels confused.  I asked him if he wants to take a break and he says no.  He says walking away isn't an option.  I am fairly certain there is no one else because if he isn't working he has his kids.  We text multiple times throughout the day, every day.  \n\nAny insight into this confusion?  The only thing that has been negative is he keeps saying \"I don't know what we are\".  Maybe I am somehow making him feel pressured without realizing it?\n\nTl;dr:  amazing guy that over the last 5 months has become my best friend is feeling confused but doesn't want to take a break.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kfwa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "sasha0801", "saved": false, "mod_reports": [], "name": "t3_65kfwa", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65kfwa/me_38f_and_him_40m_neither_looking_for_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492307923.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65kfwa/me_38f_and_him_40m_neither_looking_for_a/", "author_flair_text": null, "quarantine": false, "title": "Me [38F] and him [40M] neither looking for a relationship but seem to be in one", "created_utc": 1492279123.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kfwa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65kfwa", "likes": null, "replies": "", "user_reports": [], "id": "dgb0c0o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "FlamingShitShow", "parent_id": "t1_dgayhqc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It's obvious, fear of failure. Our culture needs to re-think the whole relationship thing. We ARE a very social species....look at how social media has blossomed into a culture changing entity. Yet we fear failure even tho we are driven by nature to be partners and companions. Social media connects millions upon millions of people on the daily. But it's also distancing ourselves from each other. We get on there to \"socialize\" but  we also snipe, attack, bully and degrade each other. \n\nI say this bc it represents exactly the two opposing forces that drive relationships: people want to be together, but when they do, very often unpleasant things happen. People get hurt, upset, and go into self defense mode. That's where the OP's guy is. Driven to want to be with someone pleasing to him (bc OP obviously iS) ) but past experience tells His brain not to go there. Sooooo, he just goes there and then denies labeling it as the thing he thinks he doesn't want, even tho he DOES.\n\nMother Nature is not wrong. She sets things up for success. We are human beings so we have what animals don't have: reasoning to temper our biological drives. We aren't living in caves and trying to populate the earth anymore to keep a species going. Partnerships to have kids and raise a family are merely one choice, out of many, including staying single. But the truth is partnerships and companion ships, when done right, make life satisfying. It is part of who we are and when it is not fulfilled, there is a terrible emptiness that is NOT normal. But as with all things human, we have free will. And IMO, for the most part our  evolving self centered nature has put us on a path of \"what can you do for me\", instead of  \"what can I do for you\". In relationships you have to be willing to make your partner as important as you are to yourself and the union needs extreme focus by both parties. Most people don't really realize that. We go day to day pulled and spliced up by work and jobs and paying bills and well, everything else. If we are honest, most people don't even think much about their partner on a daily basis after the honeymoon phase closes out.\n\nIf I were the OP, I would tell him you aren't asking for a label on this relationship, I'd ask him to simply tell you how he feels about you. One can easily see they are already friends and lovers. But to be honest, if he can't say it, I'm not sure you are on the same page. We have all been hurt but he can't live in that past hurt and let it spill over into everything in the future that has promise. He needs to put on his big boy pants and be real.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s obvious, fear of failure. Our culture needs to re-think the whole relationship thing. We ARE a very social species....look at how social media has blossomed into a culture changing entity. Yet we fear failure even tho we are driven by nature to be partners and companions. Social media connects millions upon millions of people on the daily. But it&amp;#39;s also distancing ourselves from each other. We get on there to &amp;quot;socialize&amp;quot; but  we also snipe, attack, bully and degrade each other. &lt;/p&gt;\n\n&lt;p&gt;I say this bc it represents exactly the two opposing forces that drive relationships: people want to be together, but when they do, very often unpleasant things happen. People get hurt, upset, and go into self defense mode. That&amp;#39;s where the OP&amp;#39;s guy is. Driven to want to be with someone pleasing to him (bc OP obviously iS) ) but past experience tells His brain not to go there. Sooooo, he just goes there and then denies labeling it as the thing he thinks he doesn&amp;#39;t want, even tho he DOES.&lt;/p&gt;\n\n&lt;p&gt;Mother Nature is not wrong. She sets things up for success. We are human beings so we have what animals don&amp;#39;t have: reasoning to temper our biological drives. We aren&amp;#39;t living in caves and trying to populate the earth anymore to keep a species going. Partnerships to have kids and raise a family are merely one choice, out of many, including staying single. But the truth is partnerships and companion ships, when done right, make life satisfying. It is part of who we are and when it is not fulfilled, there is a terrible emptiness that is NOT normal. But as with all things human, we have free will. And IMO, for the most part our  evolving self centered nature has put us on a path of &amp;quot;what can you do for me&amp;quot;, instead of  &amp;quot;what can I do for you&amp;quot;. In relationships you have to be willing to make your partner as important as you are to yourself and the union needs extreme focus by both parties. Most people don&amp;#39;t really realize that. We go day to day pulled and spliced up by work and jobs and paying bills and well, everything else. If we are honest, most people don&amp;#39;t even think much about their partner on a daily basis after the honeymoon phase closes out.&lt;/p&gt;\n\n&lt;p&gt;If I were the OP, I would tell him you aren&amp;#39;t asking for a label on this relationship, I&amp;#39;d ask him to simply tell you how he feels about you. One can easily see they are already friends and lovers. But to be honest, if he can&amp;#39;t say it, I&amp;#39;m not sure you are on the same page. We have all been hurt but he can&amp;#39;t live in that past hurt and let it spill over into everything in the future that has promise. He needs to put on his big boy pants and be real.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb0c0o", "score_hidden": false, "stickied": false, "created": 1492311059.0, "created_utc": 1492282259.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayhqc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "dane-talker", "parent_id": "t3_65kfwa", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "What stop (both of you) to take the ride and see where it ends? Sounds like a good kick-off!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What stop (both of you) to take the ride and see where it ends? Sounds like a good kick-off!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgayhqc", "score_hidden": false, "stickied": false, "created": 1492308513.0, "created_utc": 1492279713.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]