[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(We&amp;#39;ve been married 2 years, together for 8yrs. No kids (ever.). No money problems.) &lt;/p&gt;\n\n&lt;p&gt;My husband is a very busy person. He works 2 jobs (because he wants to, not because he needs to.) and is finishing his Master&amp;#39;s degree. I absolutely understand that he is busy and that it is his first priority right now. I don&amp;#39;t yell at him for working late nights or staying up late on his computer doing his homework... I feel like I am very fair about supporting him and stuff. But he&amp;#39;s the total opposite with me. I work at a creative company and I don&amp;#39;t make a ton of money. It&amp;#39;s a very relaxed job and it doesn&amp;#39;t stress me out, so I haven&amp;#39;t really thought about looking for higher paying, stressful jobs. My husband says it&amp;#39;s disappointing that I don&amp;#39;t have higher aspirations for a career. He also likes to point out ALL the damn time about me not finishing college. If I had a dollar for every time he&amp;#39;s said, &amp;quot;well if you finished your degree.....&amp;quot; I&amp;#39;d have all the dollars. I was going to school for a while, but I dropped out for a bit because my anxiety and depression were off the walls and I didn&amp;#39;t want to flunk out of classes. I didn&amp;#39;t go back because I&amp;#39;m afraid to take out loans. I was able to get grants before we were married, but now I don&amp;#39;t qualify because our combined income is &amp;quot;too much.&amp;quot; Plus, I don&amp;#39;t know what the fuck I want to do with my life yet. Great for him that he figured it out early, but fuck me if I don&amp;#39;t know yet. &lt;/p&gt;\n\n&lt;p&gt;I feel so unappreciated in anything I do. Before he had these great paying jobs, he was the broke one. I had a very large savings. His credit was awful. He had no savings. He was very bad with money. I helped him so much. I co-signed on his car and lent him a 5k downpayment. (which he is paying back now) I bought our house all by myself (before we were married.) because my credit was better. I lent him money to start up some businesses he had because I fucking believe in him and wanted to support him without him having to take out a crazy high interest loan. I got &amp;#39;thank yous&amp;#39; of course. He&amp;#39;s not a monster. But lately he just forgets that I help do anything. He just gets frustrated with me or goes on about his other female co-workers (who are programmers) who are married but went to school and do this and that and run a business and that I sit at home and do nothing.&lt;/p&gt;\n\n&lt;p&gt;I just feel so worthless. And honestly, I&amp;#39;m fucking lonely. I don&amp;#39;t have any close friends to keep busy with because the ones I had are all parents now and I&amp;#39;m not part of that loop (and I never want to be.) or my other friends are doing their own thing. I try to tell him these things. I try to tell him that it&amp;#39;s unfair of him to talk to me like that when all I do is support him, but it just kinda flies over his head and I&amp;#39;m the one who gets in trouble and I get accused of being overdramatic and grumpy. That all makes me want to do nothing at all. I just want to hide in a hole and wither away when he says things like that. Why should I even try?&lt;/p&gt;\n\n&lt;p&gt;The other thing that bothers me is when he does have free time he wants to do more projects instead of do something with me. I can&amp;#39;t even tell you the last time we went on a date. &lt;/p&gt;\n\n&lt;p&gt;I feel so worthless. I feel like I&amp;#39;m a placeholder. I don&amp;#39;t feel like a wife. I don&amp;#39;t even feel like a person lately. I&amp;#39;m going to therapy again this week. So maybe I can get more answers there. But I just don&amp;#39;t know how to make him understand how he&amp;#39;s making me feel. He always just turns it the other way around saying I don&amp;#39;t understand how busy he is. &lt;/p&gt;\n\n&lt;p&gt;I do. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(We've been married 2 years, together for 8yrs. No kids (ever.). No money problems.) \n\nMy husband is a very busy person. He works 2 jobs (because he wants to, not because he needs to.) and is finishing his Master's degree. I absolutely understand that he is busy and that it is his first priority right now. I don't yell at him for working late nights or staying up late on his computer doing his homework... I feel like I am very fair about supporting him and stuff. But he's the total opposite with me. I work at a creative company and I don't make a ton of money. It's a very relaxed job and it doesn't stress me out, so I haven't really thought about looking for higher paying, stressful jobs. My husband says it's disappointing that I don't have higher aspirations for a career. He also likes to point out ALL the damn time about me not finishing college. If I had a dollar for every time he's said, \"well if you finished your degree.....\" I'd have all the dollars. I was going to school for a while, but I dropped out for a bit because my anxiety and depression were off the walls and I didn't want to flunk out of classes. I didn't go back because I'm afraid to take out loans. I was able to get grants before we were married, but now I don't qualify because our combined income is \"too much.\" Plus, I don't know what the fuck I want to do with my life yet. Great for him that he figured it out early, but fuck me if I don't know yet. \n\nI feel so unappreciated in anything I do. Before he had these great paying jobs, he was the broke one. I had a very large savings. His credit was awful. He had no savings. He was very bad with money. I helped him so much. I co-signed on his car and lent him a 5k downpayment. (which he is paying back now) I bought our house all by myself (before we were married.) because my credit was better. I lent him money to start up some businesses he had because I fucking believe in him and wanted to support him without him having to take out a crazy high interest loan. I got 'thank yous' of course. He's not a monster. But lately he just forgets that I help do anything. He just gets frustrated with me or goes on about his other female co-workers (who are programmers) who are married but went to school and do this and that and run a business and that I sit at home and do nothing.\n\nI just feel so worthless. And honestly, I'm fucking lonely. I don't have any close friends to keep busy with because the ones I had are all parents now and I'm not part of that loop (and I never want to be.) or my other friends are doing their own thing. I try to tell him these things. I try to tell him that it's unfair of him to talk to me like that when all I do is support him, but it just kinda flies over his head and I'm the one who gets in trouble and I get accused of being overdramatic and grumpy. That all makes me want to do nothing at all. I just want to hide in a hole and wither away when he says things like that. Why should I even try?\n\nThe other thing that bothers me is when he does have free time he wants to do more projects instead of do something with me. I can't even tell you the last time we went on a date. \n\nI feel so worthless. I feel like I'm a placeholder. I don't feel like a wife. I don't even feel like a person lately. I'm going to therapy again this week. So maybe I can get more answers there. But I just don't know how to make him understand how he's making me feel. He always just turns it the other way around saying I don't understand how busy he is. \n\nI do. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65l55p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "whybother1111", "saved": false, "mod_reports": [], "name": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65l55p/my_husband_28m_makes_me_27f_feel_like_i_do/", "num_reports": null, "locked": false, "stickied": false, "created": 1492315777.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65l55p/my_husband_28m_makes_me_27f_feel_like_i_do/", "author_flair_text": null, "quarantine": false, "title": "My husband (28/m) makes me (27/f) feel like I do nothing with my life.", "created_utc": 1492286977.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgb7lfs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mikeshims", "parent_id": "t1_dgb4uto", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Perhaps you can try to bring him with you to see your therapist so that there's a mediator to discuss these concerns of yours. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps you can try to bring him with you to see your therapist so that there&amp;#39;s a mediator to discuss these concerns of yours. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb7lfs", "score_hidden": false, "stickied": false, "created": 1492320920.0, "created_utc": 1492292120.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4uto", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Down_To_My_Last_Fuck", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You should consider whether your depression/anxiety is amplifying the overall stress in the relationship. It seems your man is neglecting you a bit. However, he seems to have found some ambition after having to rely on you earlier this is a positive thing. \n\nHe has goals he is working towards. Once he attains his degree he should be able to free up some time but then again he may take that right into the big world and make a good living for himself and his family.\n\nYou are young. there is time. speak to your therapist and be sure that your other issues aren't making this one bigger then it needs to be and hopefully you will be much happier soon.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should consider whether your depression/anxiety is amplifying the overall stress in the relationship. It seems your man is neglecting you a bit. However, he seems to have found some ambition after having to rely on you earlier this is a positive thing. &lt;/p&gt;\n\n&lt;p&gt;He has goals he is working towards. Once he attains his degree he should be able to free up some time but then again he may take that right into the big world and make a good living for himself and his family.&lt;/p&gt;\n\n&lt;p&gt;You are young. there is time. speak to your therapist and be sure that your other issues aren&amp;#39;t making this one bigger then it needs to be and hopefully you will be much happier soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb4uto", "score_hidden": false, "stickied": false, "created": 1492317148.0, "created_utc": 1492288348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgbke0f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "redditlady999", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He works two jobs AND studies for a master's? The guy must have nerves of steel. Somewhere under all that activity, he may be worried that things will fall apart if one piece of the structure fails. It could be grades, or one of the jobs, and suddenly it's all off balance and he's scrambling. \n\nOr - he could be loading up on all this stuff just to make himself feel more secure. He may not even have time for friends and he's gotten used to that. He's got himself into a situation where he has plenty of acquaintances so he doesn't need friends, and he's too busy to want more than that. \n\nHe sounds like a person who got religion and can't even remember what it was like to be a nonbeliever. \n\nYou can eventually meet people who don't have kids and you will be less lonely when you have those people to hang out with. But that means getting out of the house and looking - most people seek people who share their interests. When you talk to your therapist, you could discuss what your interests are and see how you might have a good chance of meeting people who share those. Kids won't be part of those interests, I'm sure! You might be more relaxed with those friends and have some thoughts about what you want to do with your life when you see what others do with theirs.\n\nGood for you that you'll be seeing a therapist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He works two jobs AND studies for a master&amp;#39;s? The guy must have nerves of steel. Somewhere under all that activity, he may be worried that things will fall apart if one piece of the structure fails. It could be grades, or one of the jobs, and suddenly it&amp;#39;s all off balance and he&amp;#39;s scrambling. &lt;/p&gt;\n\n&lt;p&gt;Or - he could be loading up on all this stuff just to make himself feel more secure. He may not even have time for friends and he&amp;#39;s gotten used to that. He&amp;#39;s got himself into a situation where he has plenty of acquaintances so he doesn&amp;#39;t need friends, and he&amp;#39;s too busy to want more than that. &lt;/p&gt;\n\n&lt;p&gt;He sounds like a person who got religion and can&amp;#39;t even remember what it was like to be a nonbeliever. &lt;/p&gt;\n\n&lt;p&gt;You can eventually meet people who don&amp;#39;t have kids and you will be less lonely when you have those people to hang out with. But that means getting out of the house and looking - most people seek people who share their interests. When you talk to your therapist, you could discuss what your interests are and see how you might have a good chance of meeting people who share those. Kids won&amp;#39;t be part of those interests, I&amp;#39;m sure! You might be more relaxed with those friends and have some thoughts about what you want to do with your life when you see what others do with theirs.&lt;/p&gt;\n\n&lt;p&gt;Good for you that you&amp;#39;ll be seeing a therapist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbke0f", "score_hidden": false, "stickied": false, "created": 1492339290.0, "created_utc": 1492310490.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgbqm9f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Soylent_Green_Food", "parent_id": "t1_dgbo2kr", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I sure hope you are right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sure hope you are right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbqm9f", "score_hidden": false, "stickied": false, "created": 1492349605.0, "created_utc": 1492320805.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbo2kr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgbkw2y", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It sounds like he is trying to push her for improvement though, maybe the way she did for him at the beginning. I think if I was in this situation, I would try to improve our communication and try to improve my own mood and self-confidence to be a better partner. It's Unfortunate how all these expectations on each other as partners is hardly ever discussed, and if they are people forget that things change. Hopefully, they can figure a compromise. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like he is trying to push her for improvement though, maybe the way she did for him at the beginning. I think if I was in this situation, I would try to improve our communication and try to improve my own mood and self-confidence to be a better partner. It&amp;#39;s Unfortunate how all these expectations on each other as partners is hardly ever discussed, and if they are people forget that things change. Hopefully, they can figure a compromise. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbo2kr", "score_hidden": false, "stickied": false, "created": 1492344986.0, "created_utc": 1492316186.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbkw2y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Soylent_Green_Food", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I wonder what he is going to do when he finishes his masters and he meets other eligible women that he deems to be more like him.  I am scared for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder what he is going to do when he finishes his masters and he meets other eligible women that he deems to be more like him.  I am scared for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbkw2y", "score_hidden": false, "stickied": false, "created": 1492340014.0, "created_utc": 1492311214.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgb4chz", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lindyp0p", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "So you have two options here in my opinion the way he is belittling you, your accomplishments and your contributions to the marriage is utterly and completely unacceptable.  It sounds like something that either you need to go to couples counseling over so you can have a mediator or,  you can split up kick him out of your house and find someone who appreciates all that you have to offer.  If he doesn't want to understand how you feel then there's no way for you to force it.  If he doesn't appreciate you there's no way to make him.  Why is he comparing you to women he works with?   It sounds like the constant criticism is trashing your self esteem and it's borderline emotional abuse, you don't deserve this.  If he is unwilling to change, and be less critical and more supportive of your career choices,  then there's nothing you can do to make him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you have two options here in my opinion the way he is belittling you, your accomplishments and your contributions to the marriage is utterly and completely unacceptable.  It sounds like something that either you need to go to couples counseling over so you can have a mediator or,  you can split up kick him out of your house and find someone who appreciates all that you have to offer.  If he doesn&amp;#39;t want to understand how you feel then there&amp;#39;s no way for you to force it.  If he doesn&amp;#39;t appreciate you there&amp;#39;s no way to make him.  Why is he comparing you to women he works with?   It sounds like the constant criticism is trashing your self esteem and it&amp;#39;s borderline emotional abuse, you don&amp;#39;t deserve this.  If he is unwilling to change, and be less critical and more supportive of your career choices,  then there&amp;#39;s nothing you can do to make him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb4chz", "score_hidden": false, "stickied": false, "created": 1492316453.0, "created_utc": 1492287653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgbc54m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "annek22", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Its really shitty he's forgetting the help you provided when he needed it.  I would not take kindly to those remarks.  The roles have reversed in your relationship.  Maybe he thought you were more driven back then.  Im not sure how this can be fixed without you telling him how his comments make you feel and he stops making them but may still think whatever.  Maybe you should look into what you want to do, if that's what you want and aren't just doing it to appease him.  Not all higher paying jobs are stressful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its really shitty he&amp;#39;s forgetting the help you provided when he needed it.  I would not take kindly to those remarks.  The roles have reversed in your relationship.  Maybe he thought you were more driven back then.  Im not sure how this can be fixed without you telling him how his comments make you feel and he stops making them but may still think whatever.  Maybe you should look into what you want to do, if that&amp;#39;s what you want and aren&amp;#39;t just doing it to appease him.  Not all higher paying jobs are stressful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbc54m", "score_hidden": false, "stickied": false, "created": 1492327435.0, "created_utc": 1492298635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgb4oyu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blayzednconfused", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm too exhausted for any real advice, but this is such a common issue here. It's hard, but why put up with a partner who isn't supportive if you are in a relationship for the long term? I've learned (the hard way) people rarely change and you for sure can't be the catalyst for that change. It has to come from within. He sounds mentally abusive, or at the very least not supportive. You have to decide if it's worth suppressing that desire for a supportive partner or not. :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m too exhausted for any real advice, but this is such a common issue here. It&amp;#39;s hard, but why put up with a partner who isn&amp;#39;t supportive if you are in a relationship for the long term? I&amp;#39;ve learned (the hard way) people rarely change and you for sure can&amp;#39;t be the catalyst for that change. It has to come from within. He sounds mentally abusive, or at the very least not supportive. You have to decide if it&amp;#39;s worth suppressing that desire for a supportive partner or not. :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgb4oyu", "score_hidden": false, "stickied": false, "created": 1492316929.0, "created_utc": 1492288129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgbnucl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scratchingcats", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Well, maybe you feel comfortable with your combined income, but he aspires to more things and feels you stopped putting your part. It sounds like you have been supportive so I can understand your frustration, but idk maybe you guys need to discuss your goals like in the near and far future. You clearly have worked towards helping him and making your marriage work, and I'm sure he knows that, just may be taking it for granted. And I can't make those assumptions, but I'll throw some possibilities anyways, but maybe your lack of other engagements makes you have little to talk about and he doesn't feel challenged or excited to go out and have conversations with you? Maybe he finds you watching tv at home everytime he gets there and feels like you are taking the easy road? maybe he expects some classic-wifey stuff, nice meals since he worked all day? (doesn't sound like that, sounds more like he wants you to be more ambitious). Honestly, no better way to know why he works so much and why he doesn't spend as much time with you by asking him and explaining him how his actions make you feel.\n\nOn another note, I'm guessing he would be willing to give you/lend you the money for school if you were to go back, so maybe consider that if your only hesitation is getting loans.\n\nFinally, part of marriage is growing together, and that doesn't just mean growing old. It means discovering new passions, working towards common and personal goals, and maybe you just a bit too comfortable and he is trying to push you.  That being said, he should respect your work and maybe you just need to explain where you plan on going with this line of work so he can understand you better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, maybe you feel comfortable with your combined income, but he aspires to more things and feels you stopped putting your part. It sounds like you have been supportive so I can understand your frustration, but idk maybe you guys need to discuss your goals like in the near and far future. You clearly have worked towards helping him and making your marriage work, and I&amp;#39;m sure he knows that, just may be taking it for granted. And I can&amp;#39;t make those assumptions, but I&amp;#39;ll throw some possibilities anyways, but maybe your lack of other engagements makes you have little to talk about and he doesn&amp;#39;t feel challenged or excited to go out and have conversations with you? Maybe he finds you watching tv at home everytime he gets there and feels like you are taking the easy road? maybe he expects some classic-wifey stuff, nice meals since he worked all day? (doesn&amp;#39;t sound like that, sounds more like he wants you to be more ambitious). Honestly, no better way to know why he works so much and why he doesn&amp;#39;t spend as much time with you by asking him and explaining him how his actions make you feel.&lt;/p&gt;\n\n&lt;p&gt;On another note, I&amp;#39;m guessing he would be willing to give you/lend you the money for school if you were to go back, so maybe consider that if your only hesitation is getting loans.&lt;/p&gt;\n\n&lt;p&gt;Finally, part of marriage is growing together, and that doesn&amp;#39;t just mean growing old. It means discovering new passions, working towards common and personal goals, and maybe you just a bit too comfortable and he is trying to push you.  That being said, he should respect your work and maybe you just need to explain where you plan on going with this line of work so he can understand you better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbnucl", "score_hidden": false, "stickied": false, "created": 1492344594.0, "created_utc": 1492315794.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgbonfv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Momnipotence", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Hon, he can't \"make\" you feel that way all by himself. If you felt completely confident about you and your life, nothing he did, thought, or said would make any difference, you'd still feel fine. You feel insecure because of your own feelings about what you're (not) doing with your life, and you're blaming him for feelings you have that he has no control over or responsibility for.\n\nThat said, how he talks to you doesn't sound good on its own merit. I'd get counseling or get out (easier said than done, I know, but he doesn't sound loving, accepting or supportive. If he's so frustrated and keeps comparing you to other people, and you're so lonely and unhappy, what are you still doing there?", "edited": 1492317374.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hon, he can&amp;#39;t &amp;quot;make&amp;quot; you feel that way all by himself. If you felt completely confident about you and your life, nothing he did, thought, or said would make any difference, you&amp;#39;d still feel fine. You feel insecure because of your own feelings about what you&amp;#39;re (not) doing with your life, and you&amp;#39;re blaming him for feelings you have that he has no control over or responsibility for.&lt;/p&gt;\n\n&lt;p&gt;That said, how he talks to you doesn&amp;#39;t sound good on its own merit. I&amp;#39;d get counseling or get out (easier said than done, I know, but he doesn&amp;#39;t sound loving, accepting or supportive. If he&amp;#39;s so frustrated and keeps comparing you to other people, and you&amp;#39;re so lonely and unhappy, what are you still doing there?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbonfv", "score_hidden": false, "stickied": false, "created": 1492345989.0, "created_utc": 1492317189.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65l55p", "likes": null, "replies": "", "user_reports": [], "id": "dgbvg62", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HoodwinkingGnome", "parent_id": "t3_65l55p", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think you need to go to therapy. I t ounds like there has been a level of emotional abuse here. I'm sorry. You deserve better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you need to go to therapy. I t ounds like there has been a level of emotional abuse here. I&amp;#39;m sorry. You deserve better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbvg62", "score_hidden": false, "stickied": false, "created": 1492362744.0, "created_utc": 1492333944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]