[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just want some general advice if I should text her before she leaves and any thoughts you may have.\nI have this girl, 4 months ago she told me she had a huge thing on me and that shes had it for 2 years now. Never wanting to act on it till it bubbled to the surface, I was ecstatic because I felt the same way about her. We use to work together but now I&amp;#39;m at the parent company and she works for a subsidiary the company owns, Our work doesn&amp;#39;t overlap  but we sometimes meet after work and hang out. Even going for dinner occasionally. Well she just discovered her grandmother is sick, shes taking some time off to go back home. I had just come clean about my strong feelings about her, and she said she had feels the same way but their not as strong. Right now I&amp;#39;m working on a big project and my thoughts about why she hasn&amp;#39;t responded to any of my texts is plaguing me. Last time we spoke She told me she was super stressed about everything going on because she can only take a week off.  She said when she comes back, we will talk about us  and get on the same page before anything more happens between us, but since then I haven&amp;#39;t from heard from her.  I wanted to text her farewell on her trip and hope everything works out but my sister is telling me its a bad idea, telling me that I shouldn&amp;#39;t text her( I always start the conversation).  I should wait and see if she responds before she leaves. Her flight leaves about the same time I have meeting with my bosses So if i don&amp;#39;t do it before I miss my chance. I also have reason to suspect her ex boyfriend came in the picture within the last week. EDIT : We were at a coffee shop after a workout I asked her if she was okay she was lagging behind me on the run, she told me yeah she just couldn&amp;#39;t help checking me out On tuesday. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just want some general advice if I should text her before she leaves and any thoughts you may have.\nI have this girl, 4 months ago she told me she had a huge thing on me and that shes had it for 2 years now. Never wanting to act on it till it bubbled to the surface, I was ecstatic because I felt the same way about her. We use to work together but now I'm at the parent company and she works for a subsidiary the company owns, Our work doesn't overlap  but we sometimes meet after work and hang out. Even going for dinner occasionally. Well she just discovered her grandmother is sick, shes taking some time off to go back home. I had just come clean about my strong feelings about her, and she said she had feels the same way but their not as strong. Right now I'm working on a big project and my thoughts about why she hasn't responded to any of my texts is plaguing me. Last time we spoke She told me she was super stressed about everything going on because she can only take a week off.  She said when she comes back, we will talk about us  and get on the same page before anything more happens between us, but since then I haven't from heard from her.  I wanted to text her farewell on her trip and hope everything works out but my sister is telling me its a bad idea, telling me that I shouldn't text her( I always start the conversation).  I should wait and see if she responds before she leaves. Her flight leaves about the same time I have meeting with my bosses So if i don't do it before I miss my chance. I also have reason to suspect her ex boyfriend came in the picture within the last week. EDIT : We were at a coffee shop after a workout I asked her if she was okay she was lagging behind me on the run, she told me yeah she just couldn't help checking me out On tuesday. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65lfxx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "SalientAffection", "saved": false, "mod_reports": [], "name": "t3_65lfxx", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492292796.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65lfxx/cant_stop_overthinking_m27_f22/", "num_reports": null, "locked": false, "stickied": false, "created": 1492319258.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65lfxx/cant_stop_overthinking_m27_f22/", "author_flair_text": null, "quarantine": false, "title": "Cant stop overthinking M27 F22", "created_utc": 1492290458.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65lfxx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65lfxx", "likes": null, "replies": "", "user_reports": [], "id": "dgck20s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SalientAffection", "parent_id": "t1_dgbeah5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Well here is an update she sorta reached out on snapchat,I asked a question through it and wasn't responded too, i'm letting it go for now if she gives me something more concrete ill say something", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well here is an update she sorta reached out on snapchat,I asked a question through it and wasn&amp;#39;t responded too, i&amp;#39;m letting it go for now if she gives me something more concrete ill say something&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgck20s", "score_hidden": false, "stickied": false, "created": 1492404666.0, "created_utc": 1492375866.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbeah5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MonteLukast", "parent_id": "t3_65lfxx", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Your sister's right.  Give the girl a break.  She's stressed.  Let her take care of her grandmother and all her other business.  You might've scared her off a little when you told her about your strong feelings.  You can't do anything about her ex, so don't even worry about him.  He's an ex for a reason. \n\nJust play it cool and be supportive and let her come to you.  ", "edited": 1492302036.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your sister&amp;#39;s right.  Give the girl a break.  She&amp;#39;s stressed.  Let her take care of her grandmother and all her other business.  You might&amp;#39;ve scared her off a little when you told her about your strong feelings.  You can&amp;#39;t do anything about her ex, so don&amp;#39;t even worry about him.  He&amp;#39;s an ex for a reason. &lt;/p&gt;\n\n&lt;p&gt;Just play it cool and be supportive and let her come to you.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbeah5", "score_hidden": false, "stickied": false, "created": 1492330432.0, "created_utc": 1492301632.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]