[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,&lt;/p&gt;\n\n&lt;p&gt;I am writing this post because I need advice from people who have been in similar situations. I am a 25-year old latina female dating a man from India (born and raised there) &amp;amp; we have been dating for almost 1.5 years now. He is not religious, but his parents are. And of course, he is soon becoming of marriageable age (which means his parents are going to want him to marry a nice Indian vegetarian girl that pleases them). &lt;/p&gt;\n\n&lt;p&gt;My parents know of him, have known since the beginning, have met him, and they are cool with him. Even though they don&amp;#39;t speak English &amp;amp; he doesn&amp;#39;t speak Spanish, they want him over again just to see him and they always ask how he is doing!. Now, to the problem: his parents don&amp;#39;t know about me and when they do, he and I are afraid of their reactions (which I know won&amp;#39;t be a positive one). He is planning on telling his parents this November and this secret relationship that both of us have been in has drained me a lot emotionally. &lt;/p&gt;\n\n&lt;p&gt;Most of our arguments stem from the fact that I feel left out of his life since:\n1) he refers to me as a friend to his friends (only 2 of his friends really know about me) \n2) because of the secrecy, I can&amp;#39;t post nice pics of us on vacation &amp;amp; having fun in general (I don&amp;#39;t put my whole life of social media, but 1 or 2 pics once in a while is fine in my opinion). &lt;/p&gt;\n\n&lt;p&gt;I have told him about how this secret relationship is starting to drain me out and is making me feel like I am not good enough for him (let&amp;#39;s be honest, in his parents&amp;#39; view, I won&amp;#39;t be good enough). He reassures me that that&amp;#39;s not the case and that he is also suffering inside because he wishes his parents were more open. &lt;/p&gt;\n\n&lt;p&gt;I do not want to lose him and I want to be there by his side supporting him when he does tell his parents. However, I myself feel like I can&amp;#39;t hold on any longer. Part of me wants to live my life by my rules and not care about other people&amp;#39;s judgements. At the same time, because of how his parents are, we simply can&amp;#39;t just tell them like that... He will have to tell them face to face and give them time to recover. &lt;/p&gt;\n\n&lt;p&gt;But while we wait for that, what can I do to still live my life and not feel like someone that has to be so hidden in his life?&lt;/p&gt;\n\n&lt;p&gt;Thank you. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi,\n\nI am writing this post because I need advice from people who have been in similar situations. I am a 25-year old latina female dating a man from India (born and raised there) &amp; we have been dating for almost 1.5 years now. He is not religious, but his parents are. And of course, he is soon becoming of marriageable age (which means his parents are going to want him to marry a nice Indian vegetarian girl that pleases them). \n\nMy parents know of him, have known since the beginning, have met him, and they are cool with him. Even though they don't speak English &amp; he doesn't speak Spanish, they want him over again just to see him and they always ask how he is doing!. Now, to the problem: his parents don't know about me and when they do, he and I are afraid of their reactions (which I know won't be a positive one). He is planning on telling his parents this November and this secret relationship that both of us have been in has drained me a lot emotionally. \n\nMost of our arguments stem from the fact that I feel left out of his life since:\n1) he refers to me as a friend to his friends (only 2 of his friends really know about me) \n2) because of the secrecy, I can't post nice pics of us on vacation &amp; having fun in general (I don't put my whole life of social media, but 1 or 2 pics once in a while is fine in my opinion). \n\nI have told him about how this secret relationship is starting to drain me out and is making me feel like I am not good enough for him (let's be honest, in his parents' view, I won't be good enough). He reassures me that that's not the case and that he is also suffering inside because he wishes his parents were more open. \n\nI do not want to lose him and I want to be there by his side supporting him when he does tell his parents. However, I myself feel like I can't hold on any longer. Part of me wants to live my life by my rules and not care about other people's judgements. At the same time, because of how his parents are, we simply can't just tell them like that... He will have to tell them face to face and give them time to recover. \n\nBut while we wait for that, what can I do to still live my life and not feel like someone that has to be so hidden in his life?\n\nThank you. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65masu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 36, "report_reasons": null, "author": "mercedes91", "saved": false, "mod_reports": [], "name": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65masu/im_a_latina_25f_dating_an_indian_guy_25m_in_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492329807.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65masu/im_a_latina_25f_dating_an_indian_guy_25m_in_a/", "author_flair_text": null, "quarantine": false, "title": "I'm a latina [25/f] dating an Indian guy [25/m] in a secret relationship that is draining me emotionally - how to lift spirits and keep relationship healthy?", "created_utc": 1492301007.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 42, "visited": false, "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgclq0k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheJCR", "parent_id": "t1_dgcfryt", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Well this changes everything. I had no idea they don't live in America, but rather, back in India. If this is the case, then you have the upper hand and this can work if you and your bf work together. Your parents are cool with this gig so that's a plus. I agree with your mom; do yourself a favor and DO NOT go to that country lmao. Feel free to Skype, Facetime, etc. his parents but do not step foot in their country. Set up a Discord chat or something but don't meet them in person. This is because they'll have the upper-hand. Stay in America, and make them come to you. If your bf ever suggests going to India, make up some bs excuse and avoid going there.\n\n\nOn the plus side, there is a small chance that his parents will accept you, but if I were you, I wouldn't hold my breathe. Since your bf is born and raised there, chances are his parents are backwards as heck. Fear not, because this can actually work only if your bf grows a pair and puts his foot down. If he does this and tells his parents that this is what he wants, chances are they will learn to accept you and eventually love you. But you need to confront him on this and make sure he can hold his own against them. From what I gather, your bf is educated, financially stable, and independant. I can't think of a reason why he needs to raise his hand and ask for permission for getting a glass of water. \n\n\nOn the other hand, if he turns out to be a complete wuss, then his parents will either force him to end it with you, or they'll accept it, but you might end up being their puppet. However, since they don't live anywhere near you, you can sleep comfortably knowing that your freedom won't be compromised anytime soon, but a lot of decisions ur bf will make will be greatly influenced by his backwards parents. Keep in mind that a lot of relationships end due the pressure from the parents. So unless he grows a pair, be prepared\nto fight over the tiniest things ever.\n\n\nTo be fair, unless he actually tells them about you, we can't accurately predict what will happen next. Everything you've read from myself and other redditors is pure speculation, so take it with a grain of salt. Actions speak louder than words; so judge your potential in-laws based on that.\n\n\nGood luck OP. May the force be with you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well this changes everything. I had no idea they don&amp;#39;t live in America, but rather, back in India. If this is the case, then you have the upper hand and this can work if you and your bf work together. Your parents are cool with this gig so that&amp;#39;s a plus. I agree with your mom; do yourself a favor and DO NOT go to that country lmao. Feel free to Skype, Facetime, etc. his parents but do not step foot in their country. Set up a Discord chat or something but don&amp;#39;t meet them in person. This is because they&amp;#39;ll have the upper-hand. Stay in America, and make them come to you. If your bf ever suggests going to India, make up some bs excuse and avoid going there.&lt;/p&gt;\n\n&lt;p&gt;On the plus side, there is a small chance that his parents will accept you, but if I were you, I wouldn&amp;#39;t hold my breathe. Since your bf is born and raised there, chances are his parents are backwards as heck. Fear not, because this can actually work only if your bf grows a pair and puts his foot down. If he does this and tells his parents that this is what he wants, chances are they will learn to accept you and eventually love you. But you need to confront him on this and make sure he can hold his own against them. From what I gather, your bf is educated, financially stable, and independant. I can&amp;#39;t think of a reason why he needs to raise his hand and ask for permission for getting a glass of water. &lt;/p&gt;\n\n&lt;p&gt;On the other hand, if he turns out to be a complete wuss, then his parents will either force him to end it with you, or they&amp;#39;ll accept it, but you might end up being their puppet. However, since they don&amp;#39;t live anywhere near you, you can sleep comfortably knowing that your freedom won&amp;#39;t be compromised anytime soon, but a lot of decisions ur bf will make will be greatly influenced by his backwards parents. Keep in mind that a lot of relationships end due the pressure from the parents. So unless he grows a pair, be prepared\nto fight over the tiniest things ever.&lt;/p&gt;\n\n&lt;p&gt;To be fair, unless he actually tells them about you, we can&amp;#39;t accurately predict what will happen next. Everything you&amp;#39;ve read from myself and other redditors is pure speculation, so take it with a grain of salt. Actions speak louder than words; so judge your potential in-laws based on that.&lt;/p&gt;\n\n&lt;p&gt;Good luck OP. May the force be with you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgclq0k", "score_hidden": false, "stickied": false, "created": 1492406847.0, "created_utc": 1492378047.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfryt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mercedes91", "parent_id": "t1_dgbqmvt", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thanks for the advice both of you! Sometimes, I do wondering what will happen AFTER he tells them. And let's say they are oK with it after some months and want him and I to marry, am I going to become their puppet? Luckily, they live in India so it's not like I will see them every day. \n\nAnd yes, the culture in India is very backwards. I actually have a friend (she's Indian) who is engaged to this man (who's also Indian) and they are both professionals in their career and are in their mid 20s and her parents still don't agree with him even though he is also from India and is very successful financially. He's also a very nice guy. \n\nI don't understand why that country is like that but lately I am hearing a lot about young Indians (both in the US &amp; in India) having secret relationships because they're afraid of their parents and society. \n\nI tell him that his parents are going to hate me and he says no, that if anything they will hate him for keeping this a secret for so long AND the obvious one I am not even from the same country. But I do not want them to hate him. He's independent, makes his own money, has his own car, and is doing well. He came here to the US to do his masters degree and graduated and all, so if anything they should be proud and supportive of him! \n\nMy parents are oK with this relationship but my mom does NOT want me visiting that country. My parents are very supportive and they tell me that if his parents want to see me, they should come here to the US. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the advice both of you! Sometimes, I do wondering what will happen AFTER he tells them. And let&amp;#39;s say they are oK with it after some months and want him and I to marry, am I going to become their puppet? Luckily, they live in India so it&amp;#39;s not like I will see them every day. &lt;/p&gt;\n\n&lt;p&gt;And yes, the culture in India is very backwards. I actually have a friend (she&amp;#39;s Indian) who is engaged to this man (who&amp;#39;s also Indian) and they are both professionals in their career and are in their mid 20s and her parents still don&amp;#39;t agree with him even though he is also from India and is very successful financially. He&amp;#39;s also a very nice guy. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t understand why that country is like that but lately I am hearing a lot about young Indians (both in the US &amp;amp; in India) having secret relationships because they&amp;#39;re afraid of their parents and society. &lt;/p&gt;\n\n&lt;p&gt;I tell him that his parents are going to hate me and he says no, that if anything they will hate him for keeping this a secret for so long AND the obvious one I am not even from the same country. But I do not want them to hate him. He&amp;#39;s independent, makes his own money, has his own car, and is doing well. He came here to the US to do his masters degree and graduated and all, so if anything they should be proud and supportive of him! &lt;/p&gt;\n\n&lt;p&gt;My parents are oK with this relationship but my mom does NOT want me visiting that country. My parents are very supportive and they tell me that if his parents want to see me, they should come here to the US. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcfryt", "score_hidden": false, "stickied": false, "created": 1492399120.0, "created_utc": 1492370320.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqmvt", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "TheJCR", "parent_id": "t1_dgbjtlm", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "/u/Mirimara is 100% correct (sadly). The culture in India is extremely backwards and I guarantee you will have tons of problems if you decide to get married. \n\n\nIf your bf really is scared of his parents then you need to leave as fast as you can, because in essence, you aren't marrying him, you're marrying his parents. The final say will always be theirs and not his, and never yours. Not only will this affect you, but your future kids as well. \n\n\nUnless your bf magically grows a pair and can confidently tell his parents, \"no\", then I'm afraid you are out of luck. Sorry for the harsh advice but this is reality. Just like /u/Mirimara, I'm also from that area and everything /u/Mirimara has said is 100% correct.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/Mirimara\"&gt;/u/Mirimara&lt;/a&gt; is 100% correct (sadly). The culture in India is extremely backwards and I guarantee you will have tons of problems if you decide to get married. &lt;/p&gt;\n\n&lt;p&gt;If your bf really is scared of his parents then you need to leave as fast as you can, because in essence, you aren&amp;#39;t marrying him, you&amp;#39;re marrying his parents. The final say will always be theirs and not his, and never yours. Not only will this affect you, but your future kids as well. &lt;/p&gt;\n\n&lt;p&gt;Unless your bf magically grows a pair and can confidently tell his parents, &amp;quot;no&amp;quot;, then I&amp;#39;m afraid you are out of luck. Sorry for the harsh advice but this is reality. Just like &lt;a href=\"/u/Mirimara\"&gt;/u/Mirimara&lt;/a&gt;, I&amp;#39;m also from that area and everything &lt;a href=\"/u/Mirimara\"&gt;/u/Mirimara&lt;/a&gt; has said is 100% correct.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbqmvt", "score_hidden": false, "stickied": false, "created": 1492349640.0, "created_utc": 1492320840.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjtlm", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Mirimara", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Hun, being from that region my best advice will be to leave. A man who is so scared of his family, will never stand up for you even when he tells them about you. Considering his family doesn't like you to begin with, your life will be a constant battle with a very nasty old woman who will bark at you every chance she gets, and a very scared husband who will never stand up and tell her to back off. All this love talk is nice and dandy till the big M happens. After that you become property. So do yourself and your future babies a favor and walk away slowly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hun, being from that region my best advice will be to leave. A man who is so scared of his family, will never stand up for you even when he tells them about you. Considering his family doesn&amp;#39;t like you to begin with, your life will be a constant battle with a very nasty old woman who will bark at you every chance she gets, and a very scared husband who will never stand up and tell her to back off. All this love talk is nice and dandy till the big M happens. After that you become property. So do yourself and your future babies a favor and walk away slowly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbjtlm", "score_hidden": false, "stickied": false, "created": 1492338452.0, "created_utc": 1492309652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcm9go", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hookahnights", "parent_id": "t1_dgcltfb", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It sucks how someone can just deceive you for so long. 😩\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sucks how someone can just deceive you for so long. 😩&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcm9go", "score_hidden": false, "stickied": false, "created": 1492407561.0, "created_utc": 1492378761.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcltfb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "goldishblue", "parent_id": "t1_dgcjaom", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Same story. \n\nThey're \"moderate\" while in college and then if they don't need a green card it's back to being devout and wanting a good wife. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same story. &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re &amp;quot;moderate&amp;quot; while in college and then if they don&amp;#39;t need a green card it&amp;#39;s back to being devout and wanting a good wife. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcltfb", "score_hidden": false, "stickied": false, "created": 1492406972.0, "created_utc": 1492378172.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjaom", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hookahnights", "parent_id": "t1_dgcivh9", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "My sister has a Saudi Arabian boyfriend and has been with him for over six years now. She keeps asking him to commit but he doesn't want to. I think he's just using her until he gets done with school and has to leave. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sister has a Saudi Arabian boyfriend and has been with him for over six years now. She keeps asking him to commit but he doesn&amp;#39;t want to. I think he&amp;#39;s just using her until he gets done with school and has to leave. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjaom", "score_hidden": false, "stickied": false, "created": 1492403693.0, "created_utc": 1492374893.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcivh9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "goldishblue", "parent_id": "t1_dgchuyb", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Opposite with me, they hated him for reasons I later found, but I was too in love to hear their advice.\n\nMeh, it's better we're not with them.\n\nA friend of mine went to Europe and got herself one. She's not allowed to do a bunch of stuff now. Just hope she doesn't have a kid with him before they divorce, don't see this lasting too much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Opposite with me, they hated him for reasons I later found, but I was too in love to hear their advice.&lt;/p&gt;\n\n&lt;p&gt;Meh, it&amp;#39;s better we&amp;#39;re not with them.&lt;/p&gt;\n\n&lt;p&gt;A friend of mine went to Europe and got herself one. She&amp;#39;s not allowed to do a bunch of stuff now. Just hope she doesn&amp;#39;t have a kid with him before they divorce, don&amp;#39;t see this lasting too much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcivh9", "score_hidden": false, "stickied": false, "created": 1492403136.0, "created_utc": 1492374336.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchuyb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hookahnights", "parent_id": "t1_dgcgho0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It fucking sucks too cause my parents really liked him and he ended up being everything I thought he wasn't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It fucking sucks too cause my parents really liked him and he ended up being everything I thought he wasn&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgchuyb", "score_hidden": false, "stickied": false, "created": 1492401841.0, "created_utc": 1492373041.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcgho0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "goldishblue", "parent_id": "t1_dgcg0ba", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Should we start a club? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Should we start a club? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcgho0", "score_hidden": false, "stickied": false, "created": 1492400055.0, "created_utc": 1492371255.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcg0ba", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hookahnights", "parent_id": "t1_dgc6cu1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Lmao yeah my Arab ex took my virginity too. 4 years wasted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lmao yeah my Arab ex took my virginity too. 4 years wasted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcg0ba", "score_hidden": false, "stickied": false, "created": 1492399428.0, "created_utc": 1492370628.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6cu1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "goldishblue", "parent_id": "t1_dgbxdcl", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "They specifically target us I think.\n\nI know another Latina girl that even got pregnant by an Arab and he denied the kid because he needed to marry a virgin Muslim girl. Kid is his spitting image but he's over there now happily married to his Muslim girl, pretending he was a virgin too. Praying 5x a day. \n\nMy Arab ex took my virginity and then left me because I wasn't a virgin. Hypocrites.", "edited": 1492358724.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They specifically target us I think.&lt;/p&gt;\n\n&lt;p&gt;I know another Latina girl that even got pregnant by an Arab and he denied the kid because he needed to marry a virgin Muslim girl. Kid is his spitting image but he&amp;#39;s over there now happily married to his Muslim girl, pretending he was a virgin too. Praying 5x a day. &lt;/p&gt;\n\n&lt;p&gt;My Arab ex took my virginity and then left me because I wasn&amp;#39;t a virgin. Hypocrites.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc6cu1", "score_hidden": false, "stickied": false, "created": 1492386627.0, "created_utc": 1492357827.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxdcl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hookahnights", "parent_id": "t1_dgbl0rs", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Latina and spent 4 years with an Arab. Same happened to me. 😔", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Latina and spent 4 years with an Arab. Same happened to me. 😔&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbxdcl", "score_hidden": false, "stickied": false, "created": 1492369349.0, "created_utc": 1492340549.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbl0rs", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "goldishblue", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Watch out. I've been there before, Latina too, Indian as well. Turns out he was *married.* that was a waste of a year for me.\n\nHappened a second time again, this time with an Arab. Same difference because they want their son to marry a good woman of theirs. This was a waste of 4 years for me. \n\nBoth times they just wanted sex from me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Watch out. I&amp;#39;ve been there before, Latina too, Indian as well. Turns out he was &lt;em&gt;married.&lt;/em&gt; that was a waste of a year for me.&lt;/p&gt;\n\n&lt;p&gt;Happened a second time again, this time with an Arab. Same difference because they want their son to marry a good woman of theirs. This was a waste of 4 years for me. &lt;/p&gt;\n\n&lt;p&gt;Both times they just wanted sex from me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbl0rs", "score_hidden": false, "stickied": false, "created": 1492340202.0, "created_utc": 1492311402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgcu0iy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Freedom528", "parent_id": "t1_dgcg433", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It's a shitty situation for both you and him. I hope it all works out for both of you ((hugs)).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a shitty situation for both you and him. I hope it all works out for both of you ((hugs)).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcu0iy", "score_hidden": false, "stickied": false, "created": 1492418064.0, "created_utc": 1492389264.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcg433", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mercedes91", "parent_id": "t1_dgbhlwa", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah my bf is living between 2 worlds like you said, and I feel bad for him. When we argue and he tells me that he can't do this because \"so and so may know about us\", I tell him to just tell his parents so he can end his own misery and stop lying to everyone. I know he is suffering from this too. I was OK with it being a secret for up to a year (even though it sucked a lot of the times haha) mostly because during that year, I was more focused on getting my career settled, switching to a better job, &amp; paying off my student loans. Now that I have all of those things pretty much completed and feel like life is just running past me and I am still stuck in this secret relationship, I want us to be more open to more people. He actually has an uncle who dated a non-Indian for 3 years &amp; I have told my bf to speak with that uncle first at least so he can get some advice from him. \n\nMy bf has done a lot for me and I know he does love me....I am just afraid that his love for me won't be strong enough by the time he tells his parents. I'm afraid that he will come back from India and tell me something like \"I couldn't tell them\" or \"My mom made me get engaged with some random Indian girl\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah my bf is living between 2 worlds like you said, and I feel bad for him. When we argue and he tells me that he can&amp;#39;t do this because &amp;quot;so and so may know about us&amp;quot;, I tell him to just tell his parents so he can end his own misery and stop lying to everyone. I know he is suffering from this too. I was OK with it being a secret for up to a year (even though it sucked a lot of the times haha) mostly because during that year, I was more focused on getting my career settled, switching to a better job, &amp;amp; paying off my student loans. Now that I have all of those things pretty much completed and feel like life is just running past me and I am still stuck in this secret relationship, I want us to be more open to more people. He actually has an uncle who dated a non-Indian for 3 years &amp;amp; I have told my bf to speak with that uncle first at least so he can get some advice from him. &lt;/p&gt;\n\n&lt;p&gt;My bf has done a lot for me and I know he does love me....I am just afraid that his love for me won&amp;#39;t be strong enough by the time he tells his parents. I&amp;#39;m afraid that he will come back from India and tell me something like &amp;quot;I couldn&amp;#39;t tell them&amp;quot; or &amp;quot;My mom made me get engaged with some random Indian girl&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcg433", "score_hidden": false, "stickied": false, "created": 1492399568.0, "created_utc": 1492370768.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbhlwa", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Freedom528", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I watched a Netflix documentary on this exact subject. Nice Indian guy dating a non-Indian girl, feels immense pressure from parents, breaks up with amazing girlfriend to pursue traditional Indian marriage. I've witnessed Indian friends go through academic pressure from their family and wasn't aware of the marriage pressures as well - I mean, holy shit, it's fucking intense. Your poor boyfriend is caught between 2 worlds - he loves his family and wants to please them, yet feels compelled to live his own life. \n\nYou have a lot of soul searching ahead of you. Are you ready to stay in the background for an unknown amount of time? What's your limit? You and your boyfriend need to have a frank conversation soon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I watched a Netflix documentary on this exact subject. Nice Indian guy dating a non-Indian girl, feels immense pressure from parents, breaks up with amazing girlfriend to pursue traditional Indian marriage. I&amp;#39;ve witnessed Indian friends go through academic pressure from their family and wasn&amp;#39;t aware of the marriage pressures as well - I mean, holy shit, it&amp;#39;s fucking intense. Your poor boyfriend is caught between 2 worlds - he loves his family and wants to please them, yet feels compelled to live his own life. &lt;/p&gt;\n\n&lt;p&gt;You have a lot of soul searching ahead of you. Are you ready to stay in the background for an unknown amount of time? What&amp;#39;s your limit? You and your boyfriend need to have a frank conversation soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbhlwa", "score_hidden": false, "stickied": false, "created": 1492335198.0, "created_utc": 1492306398.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbl2gh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "goldishblue", "parent_id": "t1_dgbhsjc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I've been there before, I'd tell myself if I could go back in time to not waste my time. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been there before, I&amp;#39;d tell myself if I could go back in time to not waste my time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbl2gh", "score_hidden": false, "stickied": false, "created": 1492340274.0, "created_utc": 1492311474.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbhsjc", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "reenuhh", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm worried for you. Only because I have a feeling he will have to choose between you and his parents. They're not going to approve of you. So it's either you or them. Who do you think he would choose? I'm asking this because he's kept you a secret this long. Only two of his friends know. I mean, you could still have posted pictures of you two on social media. Never had to say he's your boyfriend.. I just don't think this is going to end well. As much as you love him, i'm not sure he loves you as much. He's kept you in the dark for too long. Heck he shouldn't have kept you in the dark at all. You deserve someone whose proud of you. Proud to have you as a gf regardless of race. I could never bring myself to date someone who has to hide me. That's a miserable and sad life. I hope you're able to accept if he does choose his parents over you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m worried for you. Only because I have a feeling he will have to choose between you and his parents. They&amp;#39;re not going to approve of you. So it&amp;#39;s either you or them. Who do you think he would choose? I&amp;#39;m asking this because he&amp;#39;s kept you a secret this long. Only two of his friends know. I mean, you could still have posted pictures of you two on social media. Never had to say he&amp;#39;s your boyfriend.. I just don&amp;#39;t think this is going to end well. As much as you love him, i&amp;#39;m not sure he loves you as much. He&amp;#39;s kept you in the dark for too long. Heck he shouldn&amp;#39;t have kept you in the dark at all. You deserve someone whose proud of you. Proud to have you as a gf regardless of race. I could never bring myself to date someone who has to hide me. That&amp;#39;s a miserable and sad life. I hope you&amp;#39;re able to accept if he does choose his parents over you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbhsjc", "score_hidden": false, "stickied": false, "created": 1492335458.0, "created_utc": 1492306658.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbpgoy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gettingBetter101", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If you are in a relationship for 1.5 years that you or your partner can't share with the closest people in your life, then you should really question what a relationship is to you both. \n\nI was in a relationship for 4 years and I was scared to tell my parents. Why? Because we as well are immigrants, and immigrant parents always want you to marry or date someone from the same country of origin. Not because they don't like other cultures, but because its hard for them to connect with people of other cultures. \n\nAt first you don't want to tell them because you aren't sure this person is someone serious. Then by the time you are committed, you get stuck on the \"how do I tell the parents?\". There is no other way, you just have to man up and tell them. \n\nReactions are the worst. We as humans are programmed to fear negative reactions, and most of us avoid them. There is some like me, who tries to micromanage everything to make sure there is no negative emotions. Well no matter when you tell them, they will react. So why not just rip the bandaid off.\n\nTo be honest with you. If you are looking to eventually get married, to him or someone else, by not confronting this you are waisting your time. You will be in the relationship 4 years, and then his parents might not approve and he'd leave you. \n\nFinally you are worth more than that. Secret long term relationships are a very stupid idea. I believe, when you are in a long term relationship you should be willing to share every aspect of your lives together. 1.5 years is a long time to hide a significant part from each other, and  from the rest of the people who are significant in your life.  This bothers you for a legitimate reason, and right now you are just setting yourself up for pain and failure. \n\n\nIn short: Just get it over with and stop waisting time. His families opinion will have a big impact no matter when it happens, now or November.  ", "edited": 1492318975.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are in a relationship for 1.5 years that you or your partner can&amp;#39;t share with the closest people in your life, then you should really question what a relationship is to you both. &lt;/p&gt;\n\n&lt;p&gt;I was in a relationship for 4 years and I was scared to tell my parents. Why? Because we as well are immigrants, and immigrant parents always want you to marry or date someone from the same country of origin. Not because they don&amp;#39;t like other cultures, but because its hard for them to connect with people of other cultures. &lt;/p&gt;\n\n&lt;p&gt;At first you don&amp;#39;t want to tell them because you aren&amp;#39;t sure this person is someone serious. Then by the time you are committed, you get stuck on the &amp;quot;how do I tell the parents?&amp;quot;. There is no other way, you just have to man up and tell them. &lt;/p&gt;\n\n&lt;p&gt;Reactions are the worst. We as humans are programmed to fear negative reactions, and most of us avoid them. There is some like me, who tries to micromanage everything to make sure there is no negative emotions. Well no matter when you tell them, they will react. So why not just rip the bandaid off.&lt;/p&gt;\n\n&lt;p&gt;To be honest with you. If you are looking to eventually get married, to him or someone else, by not confronting this you are waisting your time. You will be in the relationship 4 years, and then his parents might not approve and he&amp;#39;d leave you. &lt;/p&gt;\n\n&lt;p&gt;Finally you are worth more than that. Secret long term relationships are a very stupid idea. I believe, when you are in a long term relationship you should be willing to share every aspect of your lives together. 1.5 years is a long time to hide a significant part from each other, and  from the rest of the people who are significant in your life.  This bothers you for a legitimate reason, and right now you are just setting yourself up for pain and failure. &lt;/p&gt;\n\n&lt;p&gt;In short: Just get it over with and stop waisting time. His families opinion will have a big impact no matter when it happens, now or November.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbpgoy", "score_hidden": false, "stickied": false, "created": 1492347457.0, "created_utc": 1492318657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbglwg", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "littlehappymonster", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He is a coward who is willing to let you suffer to avoid a confrontation with his parents. What will happen in November to make that the best time to tell them? Are they suddenly going to become more open around then? It's been a year and half already and he wants you to wait over another 6 months, for what? He is either proud that you are his girlfriend or he isn't.\n\nThis is your life. Be with someone who wants to shout his love for your from the rooftops. You deserve so much more than to be a dirty secret.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is a coward who is willing to let you suffer to avoid a confrontation with his parents. What will happen in November to make that the best time to tell them? Are they suddenly going to become more open around then? It&amp;#39;s been a year and half already and he wants you to wait over another 6 months, for what? He is either proud that you are his girlfriend or he isn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;This is your life. Be with someone who wants to shout his love for your from the rooftops. You deserve so much more than to be a dirty secret.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbglwg", "score_hidden": false, "stickied": false, "created": 1492333738.0, "created_utc": 1492304938.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbreio", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "reflux212", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm an Indian dude. Here is my line of thought. \n\nCheck once very clearly with him by asking him and then use your experience to gauge his answer, question is \"How serious are you about me, how far are you willing to go\"\n\nThere are two kinds of Indian kids: \nThe first kind are the meek and indecisive \nSecond are the fighters \n\nIf he is serious about you:\n\nIf he is the fighter kind (meaning he speaks his mind... Usually thinks independently from his parents and expresses his discomforts immediately and clearly) you both will be together. \n\nIf he is the meek kind and loves you seriously be prepared for a long fight that he will have with his parents till theyre convinced. \n\nEither ways he will be with you. \n\nStart by first demanding to be public about the relationship with friends and on Facebook... If he refuses leave him. It's not serious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an Indian dude. Here is my line of thought. &lt;/p&gt;\n\n&lt;p&gt;Check once very clearly with him by asking him and then use your experience to gauge his answer, question is &amp;quot;How serious are you about me, how far are you willing to go&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;There are two kinds of Indian kids: \nThe first kind are the meek and indecisive \nSecond are the fighters &lt;/p&gt;\n\n&lt;p&gt;If he is serious about you:&lt;/p&gt;\n\n&lt;p&gt;If he is the fighter kind (meaning he speaks his mind... Usually thinks independently from his parents and expresses his discomforts immediately and clearly) you both will be together. &lt;/p&gt;\n\n&lt;p&gt;If he is the meek kind and loves you seriously be prepared for a long fight that he will have with his parents till theyre convinced. &lt;/p&gt;\n\n&lt;p&gt;Either ways he will be with you. &lt;/p&gt;\n\n&lt;p&gt;Start by first demanding to be public about the relationship with friends and on Facebook... If he refuses leave him. It&amp;#39;s not serious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbreio", "score_hidden": false, "stickied": false, "created": 1492351309.0, "created_utc": 1492322509.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgboxys", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "8530683641", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I am an Indian so I can understand that his parents are not going to take such news positively and their reactions would be definitely negative up to the level he may leave you so be prepared for that. I am not scaring you but I know the Indian mentality very well. However, if he loves you then I am sure he will stand by you and no matter how much his parents pressurize him to leave you, he would not. \n\nI do not think that waiting to disclose such matter to his parents would be beneficially so it would be better if he tells his parents about your relationship as soon as possible. There is no need to disclose such matter to his parents face to face as he could do it over the phone too. He needs to take a firm step and needs to let his parents know that he is not going to leave you in any case so with time his parents may accept you. He has a difficult task to perform so better to do it ASAP.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am an Indian so I can understand that his parents are not going to take such news positively and their reactions would be definitely negative up to the level he may leave you so be prepared for that. I am not scaring you but I know the Indian mentality very well. However, if he loves you then I am sure he will stand by you and no matter how much his parents pressurize him to leave you, he would not. &lt;/p&gt;\n\n&lt;p&gt;I do not think that waiting to disclose such matter to his parents would be beneficially so it would be better if he tells his parents about your relationship as soon as possible. There is no need to disclose such matter to his parents face to face as he could do it over the phone too. He needs to take a firm step and needs to let his parents know that he is not going to leave you in any case so with time his parents may accept you. He has a difficult task to perform so better to do it ASAP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgboxys", "score_hidden": false, "stickied": false, "created": 1492346503.0, "created_utc": 1492317703.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgcgk0o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Momnipotence", "parent_id": "t1_dgcfm0y", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I do know about people making things up based on deciding what someone else's behavior would mean if the observer were doing it, because it's a basic psychological principle called projecting. Despite your latest assumption that the extent of my experience as a therapist is giving advice to friends, I happen to have a BA in psychology, a Master's in counseling, and decades of experience in the field. I'm also a pretty self-aware human being, meaning that I'm aware I project just like everybody else because it's a completely normal, human thing to do; and when I do become aware that I'm doing it, I am careful to step back and examine my assumption instead of instantly assuming it's true. \n\nJust because it would mean one thing if *you* were doing it doesn't mean it absolutely must mean that if someone else is.  We can't truly know what someone's true feelings or motivations are unless we ask, and even then they have to be self-aware enough, articulate enough, and honest enough to tell us. Anything else we add to the story is strictly that -- a story, something fictional.\n\nAll of my experience in the field and in years of marriage have taught me not to presume to be a mind reader.", "edited": 1492374287.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do know about people making things up based on deciding what someone else&amp;#39;s behavior would mean if the observer were doing it, because it&amp;#39;s a basic psychological principle called projecting. Despite your latest assumption that the extent of my experience as a therapist is giving advice to friends, I happen to have a BA in psychology, a Master&amp;#39;s in counseling, and decades of experience in the field. I&amp;#39;m also a pretty self-aware human being, meaning that I&amp;#39;m aware I project just like everybody else because it&amp;#39;s a completely normal, human thing to do; and when I do become aware that I&amp;#39;m doing it, I am careful to step back and examine my assumption instead of instantly assuming it&amp;#39;s true. &lt;/p&gt;\n\n&lt;p&gt;Just because it would mean one thing if &lt;em&gt;you&lt;/em&gt; were doing it doesn&amp;#39;t mean it absolutely must mean that if someone else is.  We can&amp;#39;t truly know what someone&amp;#39;s true feelings or motivations are unless we ask, and even then they have to be self-aware enough, articulate enough, and honest enough to tell us. Anything else we add to the story is strictly that -- a story, something fictional.&lt;/p&gt;\n\n&lt;p&gt;All of my experience in the field and in years of marriage have taught me not to presume to be a mind reader.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcgk0o", "score_hidden": false, "stickied": false, "created": 1492400141.0, "created_utc": 1492371341.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfm0y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lindyp0p", "parent_id": "t1_dgcd5tf", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If you are unwilling to tell your family and friends about your significant other and decide instead to hide them like they don't exist you have no buisiness being in a relationship.  It's called being an adult and based on your immature comments I do not for one second you have any sort of therapy experience, giving your best friend advice...that doesn't make you a therapist.  Grow up learn what it means to be in a relationship and realize that hiding your SO for over a year means you have no intentions of taking that relationship anywhere.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are unwilling to tell your family and friends about your significant other and decide instead to hide them like they don&amp;#39;t exist you have no buisiness being in a relationship.  It&amp;#39;s called being an adult and based on your immature comments I do not for one second you have any sort of therapy experience, giving your best friend advice...that doesn&amp;#39;t make you a therapist.  Grow up learn what it means to be in a relationship and realize that hiding your SO for over a year means you have no intentions of taking that relationship anywhere.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcfm0y", "score_hidden": false, "stickied": false, "created": 1492398905.0, "created_utc": 1492370105.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd5tf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Momnipotence", "parent_id": "t1_dgc7pc1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You have no way to know that's the truth, you're completely making it up. Not everything the little voice in our heads say is the truth, and it's really important to learn to be able to make that distinction.\n\nPeople have all kinds of complicated, *valid* reasons for not being able to tell everything about their lives to their friends and parents. Must be nice to live in that easy, perfect little world, but that just isn't real life for a lot of people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have no way to know that&amp;#39;s the truth, you&amp;#39;re completely making it up. Not everything the little voice in our heads say is the truth, and it&amp;#39;s really important to learn to be able to make that distinction.&lt;/p&gt;\n\n&lt;p&gt;People have all kinds of complicated, &lt;em&gt;valid&lt;/em&gt; reasons for not being able to tell everything about their lives to their friends and parents. Must be nice to live in that easy, perfect little world, but that just isn&amp;#39;t real life for a lot of people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcd5tf", "score_hidden": false, "stickied": false, "created": 1492395623.0, "created_utc": 1492366823.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7pc1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lindyp0p", "parent_id": "t1_dgc4tv5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If you are serious about a relationship with someone and plan on getting married in the future you tell your parent's and friends.  He has done neither she is a place holder till his parents set him up with someone more appropriate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are serious about a relationship with someone and plan on getting married in the future you tell your parent&amp;#39;s and friends.  He has done neither she is a place holder till his parents set him up with someone more appropriate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc7pc1", "score_hidden": false, "stickied": false, "created": 1492388447.0, "created_utc": 1492359647.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4tv5", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Momnipotence", "parent_id": "t1_dgbvjpr", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I was a therapist so I can see multiple points of view here. Gay people hide from their parents who they're dating when they know their very religious parents will be really upset, and sometimes that's out of respect for their parents' belief system. (Sometimes it's only from fear of the reaction, but sometimes it's out of respect for them because they know their parents would be upset, and they don't want to feel like the cause of it, they want to spare them that.) To me this is the same thing. You can hide things from people you respect *because* you respect them.\n\n(And if you check my previous comment, I never said anything about him being respectful of *her* in all of this, I don't think he is.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was a therapist so I can see multiple points of view here. Gay people hide from their parents who they&amp;#39;re dating when they know their very religious parents will be really upset, and sometimes that&amp;#39;s out of respect for their parents&amp;#39; belief system. (Sometimes it&amp;#39;s only from fear of the reaction, but sometimes it&amp;#39;s out of respect for them because they know their parents would be upset, and they don&amp;#39;t want to feel like the cause of it, they want to spare them that.) To me this is the same thing. You can hide things from people you respect &lt;em&gt;because&lt;/em&gt; you respect them.&lt;/p&gt;\n\n&lt;p&gt;(And if you check my previous comment, I never said anything about him being respectful of &lt;em&gt;her&lt;/em&gt; in all of this, I don&amp;#39;t think he is.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4tv5", "score_hidden": false, "stickied": false, "created": 1492384525.0, "created_utc": 1492355725.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvjpr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lindyp0p", "parent_id": "t1_dgbodpg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He's not being respectful of her or his parents however he's hiding her.  A year and a half is way to long to hide a girl if you are serious about her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s not being respectful of her or his parents however he&amp;#39;s hiding her.  A year and a half is way to long to hide a girl if you are serious about her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbvjpr", "score_hidden": false, "stickied": false, "created": 1492363085.0, "created_utc": 1492334285.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbodpg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Momnipotence", "parent_id": "t1_dgbg82m", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He can be serious about her *and* still want to be respectful of his parents and not piss them off. It's called ambivalence. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He can be serious about her &lt;em&gt;and&lt;/em&gt; still want to be respectful of his parents and not piss them off. It&amp;#39;s called ambivalence. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbodpg", "score_hidden": false, "stickied": false, "created": 1492345524.0, "created_utc": 1492316724.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbg82m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lindyp0p", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "If he was serious about you his parents would know especially after a year and a half. As well as his friends the fact that he's keeping you hidden would leave me to believe you are a fling nothing more till his parents find a suitable match.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he was serious about you his parents would know especially after a year and a half. As well as his friends the fact that he&amp;#39;s keeping you hidden would leave me to believe you are a fling nothing more till his parents find a suitable match.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbg82m", "score_hidden": false, "stickied": false, "created": 1492333215.0, "created_utc": 1492304415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbndcc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "scratchingcats", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He is a 25 yo man, he needs to make a decision. Either he breaks things off with you and obeys his parents OR he tells them and asks them to respect his decision. He seems like he is too afraid to even try anything. The biggest red flag I see is him not telling even his friends, that is weird. I've been in a similar situation, unless he works to keep you in his life, sooner or later this will not work out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is a 25 yo man, he needs to make a decision. Either he breaks things off with you and obeys his parents OR he tells them and asks them to respect his decision. He seems like he is too afraid to even try anything. The biggest red flag I see is him not telling even his friends, that is weird. I&amp;#39;ve been in a similar situation, unless he works to keep you in his life, sooner or later this will not work out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbndcc", "score_hidden": false, "stickied": false, "created": 1492343813.0, "created_utc": 1492315013.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbou8t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "amperturelabs", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "My wife is Indian and eventually we became serious enough that she \"ran away\" rather than continue to hide it. Her family didn't talk to her for about 4-6 months and then eventually the thought of us living together unmarried was worse than my existing so they offered to \"get us married\". \n\nWe have been together 10 years now and I'm closer to her family than my own. It will be hard, but it will be ok. You just have to realize that if he isn't ready to marry you than his family won't know you exist. Indian kids don't really date publicly, because marriage means everything to their parents.\n\nIt's odd and makes no sense, but it is what it is. On another note, our kids are cute as hell compare. It's an awesome mix.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife is Indian and eventually we became serious enough that she &amp;quot;ran away&amp;quot; rather than continue to hide it. Her family didn&amp;#39;t talk to her for about 4-6 months and then eventually the thought of us living together unmarried was worse than my existing so they offered to &amp;quot;get us married&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;We have been together 10 years now and I&amp;#39;m closer to her family than my own. It will be hard, but it will be ok. You just have to realize that if he isn&amp;#39;t ready to marry you than his family won&amp;#39;t know you exist. Indian kids don&amp;#39;t really date publicly, because marriage means everything to their parents.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s odd and makes no sense, but it is what it is. On another note, our kids are cute as hell compare. It&amp;#39;s an awesome mix.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbou8t", "score_hidden": false, "stickied": false, "created": 1492346315.0, "created_utc": 1492317515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbqrzc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheJCR", "parent_id": "t1_dgbp3uc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Realist advice I've read in this thread. Follow this OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Realist advice I&amp;#39;ve read in this thread. Follow this OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbqrzc", "score_hidden": false, "stickied": false, "created": 1492349937.0, "created_utc": 1492321137.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbp3uc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Relationships_shit", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Tell him to become a man and start dictating his own life, if he's financially independent then there's nothing that his parents can do and they will quickly come round when they realise he's serious and there losing out on the prospect of grandchildren ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell him to become a man and start dictating his own life, if he&amp;#39;s financially independent then there&amp;#39;s nothing that his parents can do and they will quickly come round when they realise he&amp;#39;s serious and there losing out on the prospect of grandchildren &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbp3uc", "score_hidden": false, "stickied": false, "created": 1492346798.0, "created_utc": 1492317998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgcvwm6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Soccerappeal99", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He may seem like the sweetest guy on earth but if he doesn't introduce you to his circle. You are best to move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He may seem like the sweetest guy on earth but if he doesn&amp;#39;t introduce you to his circle. You are best to move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcvwm6", "score_hidden": false, "stickied": false, "created": 1492420567.0, "created_utc": 1492391767.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbmwxy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theCovertoit", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He needs to present you to his parents. If he can't do this then it's never going to happen and things are going to end badly. confront the problem. Even if his parents don't like it, you will be better off trying to get their approval than hiding your relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He needs to present you to his parents. If he can&amp;#39;t do this then it&amp;#39;s never going to happen and things are going to end badly. confront the problem. Even if his parents don&amp;#39;t like it, you will be better off trying to get their approval than hiding your relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbmwxy", "score_hidden": false, "stickied": false, "created": 1492343076.0, "created_utc": 1492314276.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbp633", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thisifreedom", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I don't know why Indian men do this. Scared of their parents, it's their lives and not their parents. I'm Indian as well but was raised in Cananda. I straight up would tell me parents if I was going to marry a non Indian girl. If he really loves you he wouldn't care what his parents think and just marry you. His parents I'm sure will come to accept this later on if you guys do end up getting married. Just tell him that it's his life and he has to choose for him self. Don't let him waste your time if he's not sure what to do cause it may just not work out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know why Indian men do this. Scared of their parents, it&amp;#39;s their lives and not their parents. I&amp;#39;m Indian as well but was raised in Cananda. I straight up would tell me parents if I was going to marry a non Indian girl. If he really loves you he wouldn&amp;#39;t care what his parents think and just marry you. His parents I&amp;#39;m sure will come to accept this later on if you guys do end up getting married. Just tell him that it&amp;#39;s his life and he has to choose for him self. Don&amp;#39;t let him waste your time if he&amp;#39;s not sure what to do cause it may just not work out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbp633", "score_hidden": false, "stickied": false, "created": 1492346912.0, "created_utc": 1492318112.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65masu", "likes": null, "replies": "", "user_reports": [], "id": "dgbpvnj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iHeartCow", "parent_id": "t3_65masu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He's a grown man, he doesn't have to listen and do everything mommy and daddy tells him. Keeping someone hidden for that long is just ridiculous especially when you're in a serious relationship. It's one thing hiding you from his family, but his friends also?  That's a red flag within itself that this isn't going to end well. \n\nI would've been left a long time ago if someone I'm dating feels they have to keep me a secret. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s a grown man, he doesn&amp;#39;t have to listen and do everything mommy and daddy tells him. Keeping someone hidden for that long is just ridiculous especially when you&amp;#39;re in a serious relationship. It&amp;#39;s one thing hiding you from his family, but his friends also?  That&amp;#39;s a red flag within itself that this isn&amp;#39;t going to end well. &lt;/p&gt;\n\n&lt;p&gt;I would&amp;#39;ve been left a long time ago if someone I&amp;#39;m dating feels they have to keep me a secret. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbpvnj", "score_hidden": false, "stickied": false, "created": 1492348215.0, "created_utc": 1492319415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]