[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Thanks to all of you for reading and responding to my two previous posts about the guy who yelled at me over stupid stuff, talked in circles, put me on eggshells and drank too much. We were both 47 and the relationship started off amazing and didn&amp;#39;t even get to 3 months. &lt;/p&gt;\n\n&lt;p&gt;I finally dumped him 2 weeks ago, 2 weeks after my last post. I watched very carefully. He continued to put me down at every opportunity and if I called him on it he would say he was just joking and I was being over sensitive.&lt;/p&gt;\n\n&lt;p&gt;The weekend I ended it, I had made him and his boys a wonderful meal and cleaned his entire sticky kitchen. His only response; I could have cooked the stuffed peppers on higher heat. I helped his son rake the front yard for 2 hours. All I heard repeatedly was that we didn&amp;#39;t put the rakes back in the right spot. Then the next day we binged a couple of shows, and he wanted me to sit close, later on he complained I have to touch him too much. That was it. I brought up his regular lack of thanks, the hot/cold and constant dual messages. (I don&amp;#39;t share enough, I talk too much, etc). I said &amp;quot;I&amp;#39;ve never dated someone who saw so many negatives in me&amp;quot;, then I calmly got my stuff and left. &lt;/p&gt;\n\n&lt;p&gt;I realize now after observing the situation for a couple of weeks; he&amp;#39;s an alcoholic and a narcissist. Neither of which I have experience with. When he was drinking his words were exaggerated both + and - . Yes, idealized and devalued. And as time went on it was more the latter. I got hooked on all the positive words (love bombing) and would take the negatives to heart and feel bad about myself (he then called me insecure). I couldn&amp;#39;t figure out why I didn&amp;#39;t measure up to this perfect sought-after guy. He&amp;#39;d frequently tell me how good looking he was and how great his life was. He had very few friends, like 2 and they were from high school, and he talked bad about them too. People didn&amp;#39;t like being around him. His neighbors thought he was arrogant and judgmental. (They wanted only me to come over for their bonfires, ha). He complained about people in general, it&amp;#39;s like he took pleasure in seeing the bad/stupid in people.  Another thing I have no experience with and I&amp;#39;m not judging, he would masterbate to pornography 4-5 times a week. Is that what men just do? I&amp;#39;ve not had a guy tell me all about it before. &lt;/p&gt;\n\n&lt;p&gt;He would drink 5-8-10 beers then switch to straight whiskey. How can a person think clearly with that much alcohol in their system? And when he chose not to drink for a day or two, he&amp;#39;d be crabby, quiet, awkward and occassionally shitty. When he would really tie one on, the next day he was a thundercloud. But of course this was all normal, he was not an alcoholic, he didn&amp;#39;t &amp;#39;have&amp;#39; to drink. &lt;/p&gt;\n\n&lt;p&gt;Even when I enjoyed spending time with him (we usually did fun things) I would be nervous and wonder when I would do something wrong. I spent a lot of mental energy trying to be perfect. He didn&amp;#39;t go out of his way much for me (wouldn&amp;#39;t even get my overnight bag out of my car) and complained about me a lot. I genuinely feel bad for saying negative things about him and I feel sorry for him now. I was raised to and spent my life looking at the positives in people. &lt;/p&gt;\n\n&lt;p&gt;So why am I here now? You all said before this wasn&amp;#39;t a good relationship or a good person. Now that I ended it; I&amp;#39;m in that sad, confused, second-guessing place that&amp;#39;s a little lonely. Does anyone have experience kicking someone to the curb because they were a narcissist and/or alcoholic? And do you still believe you did the right thing?&lt;/p&gt;\n\n&lt;p&gt;Thanks much everyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Thanks to all of you for reading and responding to my two previous posts about the guy who yelled at me over stupid stuff, talked in circles, put me on eggshells and drank too much. We were both 47 and the relationship started off amazing and didn't even get to 3 months. \n\nI finally dumped him 2 weeks ago, 2 weeks after my last post. I watched very carefully. He continued to put me down at every opportunity and if I called him on it he would say he was just joking and I was being over sensitive.\n\nThe weekend I ended it, I had made him and his boys a wonderful meal and cleaned his entire sticky kitchen. His only response; I could have cooked the stuffed peppers on higher heat. I helped his son rake the front yard for 2 hours. All I heard repeatedly was that we didn't put the rakes back in the right spot. Then the next day we binged a couple of shows, and he wanted me to sit close, later on he complained I have to touch him too much. That was it. I brought up his regular lack of thanks, the hot/cold and constant dual messages. (I don't share enough, I talk too much, etc). I said \"I've never dated someone who saw so many negatives in me\", then I calmly got my stuff and left. \n\nI realize now after observing the situation for a couple of weeks; he's an alcoholic and a narcissist. Neither of which I have experience with. When he was drinking his words were exaggerated both + and - . Yes, idealized and devalued. And as time went on it was more the latter. I got hooked on all the positive words (love bombing) and would take the negatives to heart and feel bad about myself (he then called me insecure). I couldn't figure out why I didn't measure up to this perfect sought-after guy. He'd frequently tell me how good looking he was and how great his life was. He had very few friends, like 2 and they were from high school, and he talked bad about them too. People didn't like being around him. His neighbors thought he was arrogant and judgmental. (They wanted only me to come over for their bonfires, ha). He complained about people in general, it's like he took pleasure in seeing the bad/stupid in people.  Another thing I have no experience with and I'm not judging, he would masterbate to pornography 4-5 times a week. Is that what men just do? I've not had a guy tell me all about it before. \n\nHe would drink 5-8-10 beers then switch to straight whiskey. How can a person think clearly with that much alcohol in their system? And when he chose not to drink for a day or two, he'd be crabby, quiet, awkward and occassionally shitty. When he would really tie one on, the next day he was a thundercloud. But of course this was all normal, he was not an alcoholic, he didn't 'have' to drink. \n\nEven when I enjoyed spending time with him (we usually did fun things) I would be nervous and wonder when I would do something wrong. I spent a lot of mental energy trying to be perfect. He didn't go out of his way much for me (wouldn't even get my overnight bag out of my car) and complained about me a lot. I genuinely feel bad for saying negative things about him and I feel sorry for him now. I was raised to and spent my life looking at the positives in people. \n\nSo why am I here now? You all said before this wasn't a good relationship or a good person. Now that I ended it; I'm in that sad, confused, second-guessing place that's a little lonely. Does anyone have experience kicking someone to the curb because they were a narcissist and/or alcoholic? And do you still believe you did the right thing?\n\nThanks much everyone.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65mna5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "Stella1027", "saved": false, "mod_reports": [], "name": "t3_65mna5", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492306387.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65mna5/dumped_the_guy_who_dumbfounded_me_progress_update/", "num_reports": null, "locked": false, "stickied": false, "created": 1492334359.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65mna5/dumped_the_guy_who_dumbfounded_me_progress_update/", "author_flair_text": null, "quarantine": false, "title": "Dumped the guy who dumbfounded me - progress update", "created_utc": 1492305559.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65mna5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65mna5", "likes": null, "replies": "", "user_reports": [], "id": "dgbj8hh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Stella1027", "parent_id": "t1_dgbinfy", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you for saying so. I still miss him and it hurts. The second guessing hopefully will calm down. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for saying so. I still miss him and it hurts. The second guessing hopefully will calm down. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbj8hh", "score_hidden": false, "stickied": false, "created": 1492337585.0, "created_utc": 1492308785.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbinfy", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "sugamonkey", "parent_id": "t3_65mna5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Good for you for leaving, you did the right thing.  You should be proud of yourself for having the courage and self worth to get out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good for you for leaving, you did the right thing.  You should be proud of yourself for having the courage and self worth to get out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbinfy", "score_hidden": false, "stickied": false, "created": 1492336719.0, "created_utc": 1492307919.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65mna5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65mna5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65mna5", "likes": null, "replies": "", "user_reports": [], "id": "dgbq5zz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TexasNorthWest", "parent_id": "t1_dgbpwnr", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Well remember what you would tell your friend when you are hurting. Reread what you wrote when you think you miss him or question if you made the right choice. \n\nSounds like you missed the fun times but not him specifically. 😊", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well remember what you would tell your friend when you are hurting. Reread what you wrote when you think you miss him or question if you made the right choice. &lt;/p&gt;\n\n&lt;p&gt;Sounds like you missed the fun times but not him specifically. 😊&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbq5zz", "score_hidden": false, "stickied": false, "created": 1492348738.0, "created_utc": 1492319938.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpwnr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stella1027", "parent_id": "t1_dgbp1x2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you Texas.  I would advise a good friend to run away fast. He has always blamed any of our tiffs or conflicts on me \"being in my head too much\" or me being insecure, overly sensitive, etc. He refused to hear me or have a constructive conversation, it was always all me. I was wrong. \n\nHe called me his girlfriend after the 2nd date. He stopped wooing me after 4 weeks. We stopped going out on dates then too. Just hung out at his house, had fires, watched tv. (No sex, he has an STD he's being treated for) so it wasn't to get me in bed, it was just laziness. I drove to his house each week an hour away. \n\nWe did a lot of fun things together, even though it was his decisions on what, when and where, and his mood controlled everything. I'm sure I could meet a nice man with a motorcycle, fishing boat and bonfire pit. ;)\n\nI haven't heard from him, I'm already nothing to him. I guess that hurts, but consider the source.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you Texas.  I would advise a good friend to run away fast. He has always blamed any of our tiffs or conflicts on me &amp;quot;being in my head too much&amp;quot; or me being insecure, overly sensitive, etc. He refused to hear me or have a constructive conversation, it was always all me. I was wrong. &lt;/p&gt;\n\n&lt;p&gt;He called me his girlfriend after the 2nd date. He stopped wooing me after 4 weeks. We stopped going out on dates then too. Just hung out at his house, had fires, watched tv. (No sex, he has an STD he&amp;#39;s being treated for) so it wasn&amp;#39;t to get me in bed, it was just laziness. I drove to his house each week an hour away. &lt;/p&gt;\n\n&lt;p&gt;We did a lot of fun things together, even though it was his decisions on what, when and where, and his mood controlled everything. I&amp;#39;m sure I could meet a nice man with a motorcycle, fishing boat and bonfire pit. ;)&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t heard from him, I&amp;#39;m already nothing to him. I guess that hurts, but consider the source.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbpwnr", "score_hidden": false, "stickied": false, "created": 1492348260.0, "created_utc": 1492319460.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbp1x2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TexasNorthWest", "parent_id": "t3_65mna5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think by taking off your rose coloured glasses and just observing his behaviour was a step in the right direction. Read over what you wrote again and picture a close friend or relative telling you what their BF said or did. How would you advise them?\n\nRemember this is how he behaves *now* when he is no longer trying to woo you. He thinks he has you hooked and that you won't leave. He may try love bombing you again to get you to come back, but you don't deserve to be a human punching bag. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think by taking off your rose coloured glasses and just observing his behaviour was a step in the right direction. Read over what you wrote again and picture a close friend or relative telling you what their BF said or did. How would you advise them?&lt;/p&gt;\n\n&lt;p&gt;Remember this is how he behaves &lt;em&gt;now&lt;/em&gt; when he is no longer trying to woo you. He thinks he has you hooked and that you won&amp;#39;t leave. He may try love bombing you again to get you to come back, but you don&amp;#39;t deserve to be a human punching bag. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbp1x2", "score_hidden": false, "stickied": false, "created": 1492346699.0, "created_utc": 1492317899.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65mna5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65mna5", "likes": null, "replies": "", "user_reports": [], "id": "dgc5y8u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stella1027", "parent_id": "t1_dgc3z5d", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thanks Reasoning. \n\nHe was in great lean shape. 6'1 and 190#.  After a big drinking night he'd be a thundercloud the next day. He claimed he didn't need to drink and would go a day or two without drinking. But those weren't fun days. \n\nWhen he was drinking he used to say all these wonderful things to me. Then I'd question the next day if he meant it. He always said he doesn't say things he doesn't mean. Unfortunately I believed him. Then when it was more negative about me, I believed that too. Of course this made me insecure, which he pointed out too. He thought he was so funny, but it was just put downs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks Reasoning. &lt;/p&gt;\n\n&lt;p&gt;He was in great lean shape. 6&amp;#39;1 and 190#.  After a big drinking night he&amp;#39;d be a thundercloud the next day. He claimed he didn&amp;#39;t need to drink and would go a day or two without drinking. But those weren&amp;#39;t fun days. &lt;/p&gt;\n\n&lt;p&gt;When he was drinking he used to say all these wonderful things to me. Then I&amp;#39;d question the next day if he meant it. He always said he doesn&amp;#39;t say things he doesn&amp;#39;t mean. Unfortunately I believed him. Then when it was more negative about me, I believed that too. Of course this made me insecure, which he pointed out too. He thought he was so funny, but it was just put downs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc5y8u", "score_hidden": false, "stickied": false, "created": 1492386073.0, "created_utc": 1492357273.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3z5d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ReasoningButToErr", "parent_id": "t3_65mna5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Obviously you will love yourself soon for leaving this asshole when you find someone who isn't an abusive alcoholic.\n\nHe drinks beer before whiskey?! What!? That's insane--will easily make me barf for many hours. As the saying goes:  \"Liquor before beer--youre in the clear. Beer before liquor--never been sicker.\" I cannot be the only one here who knows that rhyme. Also, up to ten beers and then who knows how much whiskey?! That is scary heavy alcoholism that is so bad for his health, especially if he doesn't weight a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obviously you will love yourself soon for leaving this asshole when you find someone who isn&amp;#39;t an abusive alcoholic.&lt;/p&gt;\n\n&lt;p&gt;He drinks beer before whiskey?! What!? That&amp;#39;s insane--will easily make me barf for many hours. As the saying goes:  &amp;quot;Liquor before beer--youre in the clear. Beer before liquor--never been sicker.&amp;quot; I cannot be the only one here who knows that rhyme. Also, up to ten beers and then who knows how much whiskey?! That is scary heavy alcoholism that is so bad for his health, especially if he doesn&amp;#39;t weight a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc3z5d", "score_hidden": false, "stickied": false, "created": 1492383264.0, "created_utc": 1492354464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]