[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At what point do you realize you&amp;#39;ve fallen in love? Is it when you find your mind always wandering to that person? Is it when you feel your heart melting when you see them smile? How do you know you&amp;#39;re in love? How do you decide that that person is the one for you? I guess that&amp;#39;s the easy part. You just know. Falling in love is spontaneous, fast and easy. It happens all at once. Falling out of love, on the other hand, is a slow and painful torture. It happens a little everyday until you start wondering what happened. What was it that set you off? What could have happened differently? Who gave up first? Do they feel the same way?&lt;/p&gt;\n\n&lt;p&gt;Remember having a crush on someone and you would anxiously wonder if they felt the same way about you? How did that turn into dread that the person you once loved might&amp;#39;ve fallen out of love with you too? Do you still love them? How do you know? Sometimes there&amp;#39;s a clear end to a relationship, like if your partner cheats on you or dies in a car accident or something. But when both of you just sort of start half-assing your conversations, not really caring about each other&amp;#39;s feelings anymore, it&amp;#39;s not clear who&amp;#39;s at fault, it&amp;#39;s not clear where the end is. Maybe you&amp;#39;re just in a rut, maybe your relationship will recover. When you start feeling so distant from someone who you once held so close in your heart, what do you do? How do you tell someone who loves you they&amp;#39;re hurting you? That there&amp;#39;s no particular thing they did, you just slowly started feeling this way?&lt;/p&gt;\n\n&lt;p&gt;Falling out of love sucks, but at least that means you were once actually in love. That&amp;#39;s something to cherish.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "At what point do you realize you've fallen in love? Is it when you find your mind always wandering to that person? Is it when you feel your heart melting when you see them smile? How do you know you're in love? How do you decide that that person is the one for you? I guess that's the easy part. You just know. Falling in love is spontaneous, fast and easy. It happens all at once. Falling out of love, on the other hand, is a slow and painful torture. It happens a little everyday until you start wondering what happened. What was it that set you off? What could have happened differently? Who gave up first? Do they feel the same way?\n\nRemember having a crush on someone and you would anxiously wonder if they felt the same way about you? How did that turn into dread that the person you once loved might've fallen out of love with you too? Do you still love them? How do you know? Sometimes there's a clear end to a relationship, like if your partner cheats on you or dies in a car accident or something. But when both of you just sort of start half-assing your conversations, not really caring about each other's feelings anymore, it's not clear who's at fault, it's not clear where the end is. Maybe you're just in a rut, maybe your relationship will recover. When you start feeling so distant from someone who you once held so close in your heart, what do you do? How do you tell someone who loves you they're hurting you? That there's no particular thing they did, you just slowly started feeling this way?\n\nFalling out of love sucks, but at least that means you were once actually in love. That's something to cherish.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65nzyd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 36, "report_reasons": null, "author": "RedVelvetAir", "saved": false, "mod_reports": [], "name": "t3_65nzyd", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65nzyd/how_did_you_deal_with_falling_out_of_love/", "num_reports": null, "locked": false, "stickied": false, "created": 1492356055.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65nzyd/how_did_you_deal_with_falling_out_of_love/", "author_flair_text": null, "quarantine": false, "title": "How did you deal with falling out of love?", "created_utc": 1492327255.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": "", "user_reports": [], "id": "dgc9ifl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rhodysailor", "parent_id": "t1_dgc0vml", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This. This is the part a lot of people don't understand. I'm still not over a (partially) mutual breakup from a year and a half ago. It's hard stuff", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. This is the part a lot of people don&amp;#39;t understand. I&amp;#39;m still not over a (partially) mutual breakup from a year and a half ago. It&amp;#39;s hard stuff&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9ifl", "score_hidden": false, "stickied": false, "created": 1492390797.0, "created_utc": 1492361997.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0vml", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "hellofriend44", "parent_id": "t1_dgbv898", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "The same thing happened to me with a girl I dated for a year and a half. I broke it off which was one of the hardest things I've ever done and I'll never forget the look she gave me when I dropped her off at her parents house. Sadness, confusion, love, for about ten seconds.. no ones ever looked at me like that and I still think about it four years later and get sad. She blocked me all everything so I'll never be able to contact her again but I agree that it's harder to break up than get dumped because you always carry around the regret and anxiety. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same thing happened to me with a girl I dated for a year and a half. I broke it off which was one of the hardest things I&amp;#39;ve ever done and I&amp;#39;ll never forget the look she gave me when I dropped her off at her parents house. Sadness, confusion, love, for about ten seconds.. no ones ever looked at me like that and I still think about it four years later and get sad. She blocked me all everything so I&amp;#39;ll never be able to contact her again but I agree that it&amp;#39;s harder to break up than get dumped because you always carry around the regret and anxiety. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc0vml", "score_hidden": false, "stickied": false, "created": 1492378114.0, "created_utc": 1492349314.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbv898", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "_uncontaminated", "parent_id": "t3_65nzyd", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I literally just got out of a relationship like this about a month and a half ago. We dated a total of 10 months but I'd say around month 5 I started doubting the relationship. I didn't feel the love that I had once felt. She didn't really do anything. She didn't betray my trust. She is a good and loving person. But for me, our personalities, our interests, everything about us almost just started to seem incompatible. For us, i think it had to do with us rushing into our relationship, without fully getting to know one another. I stayed in the relationship 5 months longer than I wanted to, because I did care about her. There was a part of me that wanted to make it work. But the other part of me felt that it was already over. I still remember the day I left. (I had moved to her home state to be with her) The hurt in her eyes right before I got in my car. I will never forget that look. I've laid in my bed with tears streaming down my face thinking about it. On multiple occasions. I love her as a human being, and as a friend. But I was no longer in love with her. And it would have been unfair of me to waste anymore of not only her time, but mine as well. It sucks. But these are the things that we deal with in life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I literally just got out of a relationship like this about a month and a half ago. We dated a total of 10 months but I&amp;#39;d say around month 5 I started doubting the relationship. I didn&amp;#39;t feel the love that I had once felt. She didn&amp;#39;t really do anything. She didn&amp;#39;t betray my trust. She is a good and loving person. But for me, our personalities, our interests, everything about us almost just started to seem incompatible. For us, i think it had to do with us rushing into our relationship, without fully getting to know one another. I stayed in the relationship 5 months longer than I wanted to, because I did care about her. There was a part of me that wanted to make it work. But the other part of me felt that it was already over. I still remember the day I left. (I had moved to her home state to be with her) The hurt in her eyes right before I got in my car. I will never forget that look. I&amp;#39;ve laid in my bed with tears streaming down my face thinking about it. On multiple occasions. I love her as a human being, and as a friend. But I was no longer in love with her. And it would have been unfair of me to waste anymore of not only her time, but mine as well. It sucks. But these are the things that we deal with in life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbv898", "score_hidden": false, "stickied": false, "created": 1492362003.0, "created_utc": 1492333203.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": "", "user_reports": [], "id": "dgc92oc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "dubochek", "parent_id": "t1_dgc3l4i", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Whenever I think about being friends with an ex this [video](https://www.youtube.com/watch?v=uTuDks4ogs0) pops up in my mind. \n\n**TL;DR** The rejecting party tries to not feel like a monster though still feels guilt. The rejected can't move on with their life. The best option is to quietly let go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whenever I think about being friends with an ex this &lt;a href=\"https://www.youtube.com/watch?v=uTuDks4ogs0\"&gt;video&lt;/a&gt; pops up in my mind. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; The rejecting party tries to not feel like a monster though still feels guilt. The rejected can&amp;#39;t move on with their life. The best option is to quietly let go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc92oc", "score_hidden": false, "stickied": false, "created": 1492390257.0, "created_utc": 1492361457.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3l4i", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Altnob", "parent_id": "t3_65nzyd", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Love is easy for me. I find value in the smallest things a person can offer. To me, falling in love is like building up your character. It's all trial and error but every time it doesn't work out, you come out more experienced. I take all those small things I value and add them to myself. \n\nWhen a relationship ends, it's always really hard for me. I become a different person for a period of time. I'm not like some people who can just reset when it's officially done. I need time to collect my thoughts and truly cherish what I gained. \n\nI always try to keep in contact with people I've dated. I dated them for a reason and those reasons still exist beyond the label. For me, falling out of love means attempting to reset the relationship to the previous state before it ever became official, but with the knowledge that this person is someone I want in my life. I look at the end of a relationship with optimism in knowing that once this all blows over, I'll have another person in my life that I respect and trust.\n\nThis is of course, only true if the person didn't harm me in any way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Love is easy for me. I find value in the smallest things a person can offer. To me, falling in love is like building up your character. It&amp;#39;s all trial and error but every time it doesn&amp;#39;t work out, you come out more experienced. I take all those small things I value and add them to myself. &lt;/p&gt;\n\n&lt;p&gt;When a relationship ends, it&amp;#39;s always really hard for me. I become a different person for a period of time. I&amp;#39;m not like some people who can just reset when it&amp;#39;s officially done. I need time to collect my thoughts and truly cherish what I gained. &lt;/p&gt;\n\n&lt;p&gt;I always try to keep in contact with people I&amp;#39;ve dated. I dated them for a reason and those reasons still exist beyond the label. For me, falling out of love means attempting to reset the relationship to the previous state before it ever became official, but with the knowledge that this person is someone I want in my life. I look at the end of a relationship with optimism in knowing that once this all blows over, I&amp;#39;ll have another person in my life that I respect and trust.&lt;/p&gt;\n\n&lt;p&gt;This is of course, only true if the person didn&amp;#39;t harm me in any way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc3l4i", "score_hidden": false, "stickied": false, "created": 1492382671.0, "created_utc": 1492353871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": "", "user_reports": [], "id": "dgc41jw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bunnyvskitten", "parent_id": "t1_dgbxozc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You're right.  In many ways it's harder to be the one that leaves if you're not a sociopath.  At least the 'broken hearted' can see the cause and effect of it all which is what our brains really strive to sort out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right.  In many ways it&amp;#39;s harder to be the one that leaves if you&amp;#39;re not a sociopath.  At least the &amp;#39;broken hearted&amp;#39; can see the cause and effect of it all which is what our brains really strive to sort out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc41jw", "score_hidden": false, "stickied": false, "created": 1492383365.0, "created_utc": 1492354565.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxozc", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "dubochek", "parent_id": "t3_65nzyd", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "4 month ago I finished my relationship with a guy I've been together with for 4 years. I just realized that I don't love him anymore, that I've been forcing myself to be nice and caring with him, to have sex with him.\n\nI decided that we need to take a break for a couple of month first so I could clear my thoughts and understand how I feel. That is a good first step if you're unsure what to do. It gives you a chance to miss another person or on the contrary to realize that you don't need him that much. What is exactly what happened in my case. Warning: if you decide to go this way, be prepared that first ~2 weeks of the break are going to be a nightmare of self-doubt, a constant fluctuation of \"Please, I love him/her, let me go back\" and \"Wait, there was a reason I took this break\". It's better to have somebody by your side who could support you morally. It's going to be tough.\n\nLeaving was extremely hard partly because he did nothing wrong - he was a nice and caring guy who loved me probably a little more than I deserved. I still feel kind of broken inside. I feel guilt, I feel like I betrayed him after I promised I'd always be there for him. After I left, my world broke down completely and I totally realize that I did it with my own hands. I feel lonelier than I ever felt.\n\nOn the contrary, I totally understand that it was the right thing to do. It wouldn't have gotten better. It would only grow worse with time. We would continue to torture each other - he'd suffer because I don't love him enough, and I'd suffer because of the guilt of me not loving him enough. As far as I can see, leaving was the best solution though I still have difficulties getting myself together since then.\n\nP.S. People usually think that being the one that's being left in a relationship is worse. Well, clearly they've never been on the other side. Because leaving somebody puts a great responsibility on you for your decision and its impact on another person's life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;4 month ago I finished my relationship with a guy I&amp;#39;ve been together with for 4 years. I just realized that I don&amp;#39;t love him anymore, that I&amp;#39;ve been forcing myself to be nice and caring with him, to have sex with him.&lt;/p&gt;\n\n&lt;p&gt;I decided that we need to take a break for a couple of month first so I could clear my thoughts and understand how I feel. That is a good first step if you&amp;#39;re unsure what to do. It gives you a chance to miss another person or on the contrary to realize that you don&amp;#39;t need him that much. What is exactly what happened in my case. Warning: if you decide to go this way, be prepared that first ~2 weeks of the break are going to be a nightmare of self-doubt, a constant fluctuation of &amp;quot;Please, I love him/her, let me go back&amp;quot; and &amp;quot;Wait, there was a reason I took this break&amp;quot;. It&amp;#39;s better to have somebody by your side who could support you morally. It&amp;#39;s going to be tough.&lt;/p&gt;\n\n&lt;p&gt;Leaving was extremely hard partly because he did nothing wrong - he was a nice and caring guy who loved me probably a little more than I deserved. I still feel kind of broken inside. I feel guilt, I feel like I betrayed him after I promised I&amp;#39;d always be there for him. After I left, my world broke down completely and I totally realize that I did it with my own hands. I feel lonelier than I ever felt.&lt;/p&gt;\n\n&lt;p&gt;On the contrary, I totally understand that it was the right thing to do. It wouldn&amp;#39;t have gotten better. It would only grow worse with time. We would continue to torture each other - he&amp;#39;d suffer because I don&amp;#39;t love him enough, and I&amp;#39;d suffer because of the guilt of me not loving him enough. As far as I can see, leaving was the best solution though I still have difficulties getting myself together since then.&lt;/p&gt;\n\n&lt;p&gt;P.S. People usually think that being the one that&amp;#39;s being left in a relationship is worse. Well, clearly they&amp;#39;ve never been on the other side. Because leaving somebody puts a great responsibility on you for your decision and its impact on another person&amp;#39;s life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgbxozc", "score_hidden": false, "stickied": false, "created": 1492370381.0, "created_utc": 1492341581.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": "", "user_reports": [], "id": "dgc4zxx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "throwawayWells", "parent_id": "t3_65nzyd", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I like to think about this in two ways.  First, love is a feeling that naturally develops over the course of a relationship.  Second, love is also a choice.  Once it is there it can wither and die if you don't put effort into it.  If you think love is this magical thing that you have no control over then you will fall out of love.\r\n\r\nThe bigger question you must ask yourself in a relationship should not be about \"falling out of love\" but rather \"do I want to love this person.\". That's a big question that requires deep introspection and generally is a two way street,both parties must be making an active choice to love the other person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like to think about this in two ways.  First, love is a feeling that naturally develops over the course of a relationship.  Second, love is also a choice.  Once it is there it can wither and die if you don&amp;#39;t put effort into it.  If you think love is this magical thing that you have no control over then you will fall out of love.&lt;/p&gt;\n\n&lt;p&gt;The bigger question you must ask yourself in a relationship should not be about &amp;quot;falling out of love&amp;quot; but rather &amp;quot;do I want to love this person.&amp;quot;. That&amp;#39;s a big question that requires deep introspection and generally is a two way street,both parties must be making an active choice to love the other person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4zxx", "score_hidden": false, "stickied": false, "created": 1492384757.0, "created_utc": 1492355957.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": "", "user_reports": [], "id": "dgc3n3n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LittleLissy", "parent_id": "t3_65nzyd", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "For me,  it was liberating. I was with someone that I loved desperately. When we first started dating,  he was wonderful. After a couple of years, he stopped caring or showing affection. I tried so hard for another year to get him to treat me like he once did. When I finally decided I deserved better,  it was the most amazing feeling. \n\nHe acted so distraught when I told him I was done, told me he planned to marry me. I found out after the fact that he had been cheating on me that entire last year. \n\nIt's been an amazing year without the stress of trying to force him to love me and myself to love him. If you're out of love,  you have to let go. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me,  it was liberating. I was with someone that I loved desperately. When we first started dating,  he was wonderful. After a couple of years, he stopped caring or showing affection. I tried so hard for another year to get him to treat me like he once did. When I finally decided I deserved better,  it was the most amazing feeling. &lt;/p&gt;\n\n&lt;p&gt;He acted so distraught when I told him I was done, told me he planned to marry me. I found out after the fact that he had been cheating on me that entire last year. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been an amazing year without the stress of trying to force him to love me and myself to love him. If you&amp;#39;re out of love,  you have to let go. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc3n3n", "score_hidden": false, "stickied": false, "created": 1492382756.0, "created_utc": 1492353956.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65nzyd", "likes": null, "replies": "", "user_reports": [], "id": "dgc4qph", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "vomsin", "parent_id": "t3_65nzyd", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I got out of a relationship in January.  I was dating a girl from my class, which lasted about 1 year and 3 months. \nIn the beginning it was amazing, I loved her, I felt like we really connected. But at some point last summer I started feeling that I didn't love the girl as much as I used to. I think we rushed into the relationship, so we didn't get to know each other really well. So the more I got to knew her the more distant I was. But still I tried for the rest of the year to be with her and fall in love again so we could be as happy again.\nBut during the Christmas vacation I just really felt like it was time to break up. I didn't miss her at all and didn't want to see her at all, so in January I explained everything and told her it wasn't her fault. \nIt was for the best and I'm happy I did it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got out of a relationship in January.  I was dating a girl from my class, which lasted about 1 year and 3 months. \nIn the beginning it was amazing, I loved her, I felt like we really connected. But at some point last summer I started feeling that I didn&amp;#39;t love the girl as much as I used to. I think we rushed into the relationship, so we didn&amp;#39;t get to know each other really well. So the more I got to knew her the more distant I was. But still I tried for the rest of the year to be with her and fall in love again so we could be as happy again.\nBut during the Christmas vacation I just really felt like it was time to break up. I didn&amp;#39;t miss her at all and didn&amp;#39;t want to see her at all, so in January I explained everything and told her it wasn&amp;#39;t her fault. \nIt was for the best and I&amp;#39;m happy I did it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4qph", "score_hidden": false, "stickied": false, "created": 1492384402.0, "created_utc": 1492355602.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]