[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in a panic. I know I&amp;#39;m going to blow it today and I need help or I may never see my daughter F/21 again. This is a long story, mostly because I&amp;#39;m desperate and am scared shitless for my daughter. I&amp;#39;ll try to keep it short &lt;/p&gt;\n\n&lt;p&gt;I had my daughter at 15. Her dad chose to walk the other way, and has never bothered to acknowledge her. She has the biggest heart for people who have had struggles in life and has always been the kid to make other kids feel like they had a place in the world. She would volunteer at nursing homes to spread her love and help the younger kids in after school programs to keep them off the street. She had tons of friends from here, in the cities around us and from many dance camps she attended throughout high school years. I never had a problem with her except for normal teenage attitudes and pushing limits that kids do. &lt;/p&gt;\n\n&lt;p&gt;After graduation, she met this guy and started to hang out with him. This guy came out of nowhere. I immediately saw her distancing herself from her friends, I used to have a houseful of teenage girls every Friday and Saturday night for years. All of the sudden, it&amp;#39;s just him and her. I&amp;#39;d question her about it and was told everyone was busy doing their own things, then it was certain girls didn&amp;#39;t like her new boyfriend and then it was he didn&amp;#39;t like them. She said he felt bad they didn&amp;#39;t like him and he played it off as the same. I knew differently. I can see right through this piece of shit. &lt;/p&gt;\n\n&lt;p&gt;Two months later, he&amp;#39;s found sleeping in my daughter room. I had never allowed that before, but realized she going to be a freshman in college I needed to give her space and she&amp;#39;s going to do it anyway. It wasn&amp;#39;t like she hadn&amp;#39;t had a relationship before but not like this. So I said nothing and talked to her in private later on in the day. Her attitude shocked me. She immediately said I was judging him and have forgotten how she came about and I needed to get to know him because he really made her happy. I guess I never seen the happy part. What I seen is, my daughter stopped hanging out with the best friends she had since 3rd grade, she stopped going by my parents place to see my father, my father was very important in her life, they never went a day without having ice cream since she was 5. she stopped going to the gym to dance, she stopped going to the nursing home to see her nannies, she stopped dressing in certain clothing, stayed in her room all day with him, most of all, she stopped smiling. &lt;/p&gt;\n\n&lt;p&gt;Throughout the last 3 years, I&amp;#39;ve lost my daughter. We&amp;#39;ve always had an amazing relationship with very open and honest communication because I didn&amp;#39;t have that with my parents and I think it would have saved a lot of problems. He&amp;#39;s managed to have her move out, quit school to work to pay their bills, loosing 3 scholarships and having to pay them back. He&amp;#39;s had her trade her new  car in for one he liked and put a loan on it, in her and his name. Have a baby with her, she&amp;#39;s not seen her friends in over 2 years, they have all had enough of the way he treats her. She has no care or concern for her hair or makeup. , no self respect and no respect for anyone other than him. Shes wore out, as if she&amp;#39;s 80 years old and done with life. She&amp;#39;s become very distant, I&amp;#39;ve heard several stories of him hitting her, which she denies. Hes disrespectful to me and her step father in every sense. Example. We&amp;#39;re at my niece wedding, a guy was talking about screwing some chic he barely knew and he pops up and says my daughter can &amp;quot;suck dick like a champ and does it on command &amp;quot; said he has the bitch trained and seriously called her over, snapped his fingers and told her get on her knees for daddy! All in front of my extremely catholic father. I&amp;#39;m not even sure my dad knew what he was saying. But my brothers did, and her step father did. They took him outside to &amp;quot; talk&amp;quot; to him and he didn&amp;#39;t see anything wrong with this. My daughter was horribly embarrassed. The next day, my brother offered her to go home with him for a break, ok he didn&amp;#39;t offer, he said she was going. I prayed all night she&amp;#39;d go and she did. I thought then, she was going to be ok. &lt;/p&gt;\n\n&lt;p&gt;Then it began. He was calling her, calling my entire family, saying he&amp;#39;s miserable without her, He was calling my phone all hours of the night, crying, bla bla bla shit. He loved her, and he was going to hurt himself without her. I don&amp;#39;t fall for that shit. Her dad did that crap and I can&amp;#39;t stand it. My sister is a dr, so I helped him out and had him placed in emergency custody for threatening suicide. Big mistake. My daughter came back and was livid. For a month I didn&amp;#39;t see her. It was hell. I Learned my lesson and started to just accept and support her anyway I can regardless if the asshole is there or not. He controlled everything. She works, I stopped working to stay home with my grandson because I need to know he&amp;#39;s ok. They&amp;#39;ve had CPS calls for domestic violence. Our state doesn&amp;#39;t mess around with it and will remove children on a rumor to protect them. He doesn&amp;#39;t work, he drives her car around, screwing other girls and she pays for it. He takes the car payment and uses it so she&amp;#39;ll loose the car. I&amp;#39;ve bailed it out 5 times and that was it. I had to stop enabling her. She lost her car. Then the baby got sick, and of course he was at home without a car and the baby ended up in the hospital with rsv. His O2 was 69%. And it was my fault. Couldn&amp;#39;t be because he smokes in the same room as the baby and the baby has respiratory issues. He refused to let me see him, because I let my daughter loose her car. His mother is just as bad, her son is a great father, my daughter is a bad mom and they threaten her all the time, have her convinced theyll take the baby because she&amp;#39;s gone all the time. She works 60 hours a week. Not a chance in hell we&amp;#39;d let that happen. &lt;/p&gt;\n\n&lt;p&gt;My daughter gets no assistance from the state, she has to work. She doesn&amp;#39;t get help because she has trust funds from both my grandparents and my father. She can&amp;#39;t access these until she&amp;#39;s 25. He refused to pay a dime for the birth, or anything. We paid. I know that&amp;#39;s what he&amp;#39;s waiting for, when my father died, he left her quite a bit of money outside of the trust to help with emergencies in case something happened. She wisely spent it on a mobile home, and the rest for her lot rent for the next two years. He has told everyone he owns her and he  can do whatever he wants and she pays him to do it. He posts terrible stuff on Facebook about my family. Saying we think we&amp;#39;re too good for him, there love wins and we&amp;#39;ll never see her or the baby again. He&amp;#39;s convinced her that we&amp;#39;ll never be happy with who she picks because we feel &amp;quot; no one is good enough for our princess.&amp;quot; Never have we ever referred to her as that, He says this because my father was wealthy, and he likes to say we think we are better than anyone. Let&amp;#39;s not forget, I had a child with a 3 time felon at age 15, my family accepted him, loved him but he chose to go. She&amp;#39;s had a job since she could work l it&amp;#39;s called learning responsibility. He&amp;#39;s never had to. &lt;/p&gt;\n\n&lt;p&gt;Last night, I received a call from the bar from a girl I didn&amp;#39;t know. We own the bar and our number is right by the phone for employees to call. It&amp;#39;s a small bar where everyone knows everyone. She told me everyone in the bar was concerned for my daughter, they wanted to make sure she wasn&amp;#39;t going home with him. After that I received 3 more calls from the doorman and bartender saying they were worried. Apparently he was drunk, telling everyone in the bar that my daughter was &amp;quot;his pussy&amp;quot; he owns it ect. I can&amp;#39;t even type the disgusting things that he said. An old friend of hers was in town, he&amp;#39;s gay and the sweetest guy in the world. They&amp;#39;ve been friends since 4 th grade and he apparently hugged my daughter and a fight ensued. He broke out his two front teeth and threw him down on the ground and was thrown out of the bar. The cops weren&amp;#39;t called because no one wants more stress for my daughter, and the boys at the door caused some damage to his face and also didn&amp;#39;t want to go to jail. She messaged me said they fought and she&amp;#39;s staying at her friends house because he won&amp;#39;t let her back in HER  house or get HER  car, and I&amp;#39;m to keep the baby. She&amp;#39;d see me in the morning. An hour later that piece of shit called me, telling me my daughter is a whore, she&amp;#39;s a drunk and has slept with half the town, and he&amp;#39;s coming to get his son. I told him calmly as \nI always do that I knew nothing,  the baby was asleep,  they&amp;#39;d be fine and work it out in the morning because he&amp;#39;d be sober and he&amp;#39;s to go to sleep. Messages continued for 2 hours of hate/love and he was sorry. His last message said he&amp;#39;d see me tommaro for easter with his family!! Meaning us! You have no idea the things I wanted to say. I&amp;#39;m livid! I know he&amp;#39;s talking to her and convinced her to go home. Again! &lt;/p&gt;\n\n&lt;p&gt;Now today we start over again. I know he&amp;#39;ll be coming with her, he&amp;#39;ll be smiling as if he&amp;#39;s a king, he&amp;#39;s conquered again. he&amp;#39;ll act like he&amp;#39;s the best dad in the world and he&amp;#39;ll treat my daughter like a dog. Ordering her around as if he&amp;#39;s entitled. I can&amp;#39;t do this anymore, watching your child cater to a creep is devastating. I know my daughter needs me to stay strong. She needs me to be here no matter what and I have been. My whole family has been. Time and time again. I&amp;#39;ve actually been extremely nice and full of fake support for him and he eats it up. It&amp;#39;s the worst feeling in the world knowing some egotistical fuck is hurting your child and there&amp;#39;s not a damn thing you can do about it. I am not a violent person, I don&amp;#39;t judge anyone, But there comes a time where this can&amp;#39;t happen anymore. I&amp;#39;m not far from paying to have this fuck taken out. My heart literally breaks for her, for my grandson. I hate thinking that little boy is watching his mommy get hit, or hearing his daddy call his mommy disgusting names. I hate the fact that he calls her such horrible names, throws shit at her, hits the dogs, breaks the doors and she hangs her head!  What the fuck is wrong with him! I hear the sirens and start praying it&amp;#39;s not her and have to wait for her to call. We can&amp;#39;t message her because he gets the messages. She wasn&amp;#39;t raised with any of that. In fact quite the opposite. I sit and read about domestic violence everyday, trying to find any kind of answers. I can&amp;#39;t help but think its because her dad never cared. I don&amp;#39;t know. Today Is easter, of course he spent all the money on beer and weed, so my grandson won&amp;#39;t have easter if it&amp;#39;s not here. My brothers won&amp;#39;t come, they can&amp;#39;t refrain from beating his ass. My sisters won&amp;#39;t come because they don&amp;#39;t want their daughters seeing it and thinking it is ok. How the hell do I do this? My husband is at his breaking point. He&amp;#39;s extremely calm and has intervened when he needed too, but this isn&amp;#39;t going to go well. He&amp;#39;s angry, he&amp;#39;s raised her since she was 4. To her he&amp;#39;s her dad, and her person she goes to for grounding. He has the ability to calm any situation, but he&amp;#39;s completely had it and said he&amp;#39;d be beating his ass the minute he comes through our door after putting his hands on our child. Yes he&amp;#39;s mad. How does one shake the hand of the devil who hurts the one you love the most. I would die a thousand times for her happiness, I&amp;#39;d commit a million felonies for her to feel safe. I&amp;#39;m just praying that doesn&amp;#39;t become a reality anytime soon. I know there&amp;#39;s many women that have suffered from domestic violence, and it&amp;#39;s one of the hardest things to go through. How did any of their mothers cope? I&amp;#39;m scared shitless for my daughter, she&amp;#39;s not a baby anymore, but she&amp;#39;s my baby and always will be. I have become a hateful person, praying this guy dies, that&amp;#39;s not ok. I have thoughts of doing bad bad things to him and knowing people snap, that scares me. Any advice is greatly appreciated.&lt;/p&gt;\n\n&lt;p&gt;I know it has to be her choice, she has to be the one to go, she&amp;#39;s horribly embarrassed, but still will end up going back. It&amp;#39;s like he&amp;#39;s has something over her. There&amp;#39;s nothing we can&amp;#39;t handle for her. I fear the state will step in and take my grandson. In our state, they rarely give the kids to family. It&amp;#39;s one of the worst states to actually get kids back. She loves her son, she&amp;#39;s a good mom, just not right now, she&amp;#39;s placing him in an environment that will hurt him. I can&amp;#39;t do a damn thing about it. All I can do, is count the hours down, sit by the phone, waiting for it to ring or wait for a message from her. Then I know we made it through that last amount of hours since I heard from her.  Please help me make it through today, because that little boy depends on me, he should be able to find the Easter eggs as any other child his age. She needs me, and he&amp;#39;ll be on to anything that&amp;#39;s off in my attitude. He&amp;#39;ll sense that we are against him and that puts her at risk. I&amp;#39;m finding it easier to get rid of him in very wrong ways, and I know I&amp;#39;d gladly do prison time for my daughters safety, and to end this chaos and pain for my family. That can&amp;#39;t be the ending especially today &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm in a panic. I know I'm going to blow it today and I need help or I may never see my daughter F/21 again. This is a long story, mostly because I'm desperate and am scared shitless for my daughter. I'll try to keep it short \n\nI had my daughter at 15. Her dad chose to walk the other way, and has never bothered to acknowledge her. She has the biggest heart for people who have had struggles in life and has always been the kid to make other kids feel like they had a place in the world. She would volunteer at nursing homes to spread her love and help the younger kids in after school programs to keep them off the street. She had tons of friends from here, in the cities around us and from many dance camps she attended throughout high school years. I never had a problem with her except for normal teenage attitudes and pushing limits that kids do. \n\nAfter graduation, she met this guy and started to hang out with him. This guy came out of nowhere. I immediately saw her distancing herself from her friends, I used to have a houseful of teenage girls every Friday and Saturday night for years. All of the sudden, it's just him and her. I'd question her about it and was told everyone was busy doing their own things, then it was certain girls didn't like her new boyfriend and then it was he didn't like them. She said he felt bad they didn't like him and he played it off as the same. I knew differently. I can see right through this piece of shit. \n\nTwo months later, he's found sleeping in my daughter room. I had never allowed that before, but realized she going to be a freshman in college I needed to give her space and she's going to do it anyway. It wasn't like she hadn't had a relationship before but not like this. So I said nothing and talked to her in private later on in the day. Her attitude shocked me. She immediately said I was judging him and have forgotten how she came about and I needed to get to know him because he really made her happy. I guess I never seen the happy part. What I seen is, my daughter stopped hanging out with the best friends she had since 3rd grade, she stopped going by my parents place to see my father, my father was very important in her life, they never went a day without having ice cream since she was 5. she stopped going to the gym to dance, she stopped going to the nursing home to see her nannies, she stopped dressing in certain clothing, stayed in her room all day with him, most of all, she stopped smiling. \n\nThroughout the last 3 years, I've lost my daughter. We've always had an amazing relationship with very open and honest communication because I didn't have that with my parents and I think it would have saved a lot of problems. He's managed to have her move out, quit school to work to pay their bills, loosing 3 scholarships and having to pay them back. He's had her trade her new  car in for one he liked and put a loan on it, in her and his name. Have a baby with her, she's not seen her friends in over 2 years, they have all had enough of the way he treats her. She has no care or concern for her hair or makeup. , no self respect and no respect for anyone other than him. Shes wore out, as if she's 80 years old and done with life. She's become very distant, I've heard several stories of him hitting her, which she denies. Hes disrespectful to me and her step father in every sense. Example. We're at my niece wedding, a guy was talking about screwing some chic he barely knew and he pops up and says my daughter can \"suck dick like a champ and does it on command \" said he has the bitch trained and seriously called her over, snapped his fingers and told her get on her knees for daddy! All in front of my extremely catholic father. I'm not even sure my dad knew what he was saying. But my brothers did, and her step father did. They took him outside to \" talk\" to him and he didn't see anything wrong with this. My daughter was horribly embarrassed. The next day, my brother offered her to go home with him for a break, ok he didn't offer, he said she was going. I prayed all night she'd go and she did. I thought then, she was going to be ok. \n\nThen it began. He was calling her, calling my entire family, saying he's miserable without her, He was calling my phone all hours of the night, crying, bla bla bla shit. He loved her, and he was going to hurt himself without her. I don't fall for that shit. Her dad did that crap and I can't stand it. My sister is a dr, so I helped him out and had him placed in emergency custody for threatening suicide. Big mistake. My daughter came back and was livid. For a month I didn't see her. It was hell. I Learned my lesson and started to just accept and support her anyway I can regardless if the asshole is there or not. He controlled everything. She works, I stopped working to stay home with my grandson because I need to know he's ok. They've had CPS calls for domestic violence. Our state doesn't mess around with it and will remove children on a rumor to protect them. He doesn't work, he drives her car around, screwing other girls and she pays for it. He takes the car payment and uses it so she'll loose the car. I've bailed it out 5 times and that was it. I had to stop enabling her. She lost her car. Then the baby got sick, and of course he was at home without a car and the baby ended up in the hospital with rsv. His O2 was 69%. And it was my fault. Couldn't be because he smokes in the same room as the baby and the baby has respiratory issues. He refused to let me see him, because I let my daughter loose her car. His mother is just as bad, her son is a great father, my daughter is a bad mom and they threaten her all the time, have her convinced theyll take the baby because she's gone all the time. She works 60 hours a week. Not a chance in hell we'd let that happen. \n\nMy daughter gets no assistance from the state, she has to work. She doesn't get help because she has trust funds from both my grandparents and my father. She can't access these until she's 25. He refused to pay a dime for the birth, or anything. We paid. I know that's what he's waiting for, when my father died, he left her quite a bit of money outside of the trust to help with emergencies in case something happened. She wisely spent it on a mobile home, and the rest for her lot rent for the next two years. He has told everyone he owns her and he  can do whatever he wants and she pays him to do it. He posts terrible stuff on Facebook about my family. Saying we think we're too good for him, there love wins and we'll never see her or the baby again. He's convinced her that we'll never be happy with who she picks because we feel \" no one is good enough for our princess.\" Never have we ever referred to her as that, He says this because my father was wealthy, and he likes to say we think we are better than anyone. Let's not forget, I had a child with a 3 time felon at age 15, my family accepted him, loved him but he chose to go. She's had a job since she could work l it's called learning responsibility. He's never had to. \n\nLast night, I received a call from the bar from a girl I didn't know. We own the bar and our number is right by the phone for employees to call. It's a small bar where everyone knows everyone. She told me everyone in the bar was concerned for my daughter, they wanted to make sure she wasn't going home with him. After that I received 3 more calls from the doorman and bartender saying they were worried. Apparently he was drunk, telling everyone in the bar that my daughter was \"his pussy\" he owns it ect. I can't even type the disgusting things that he said. An old friend of hers was in town, he's gay and the sweetest guy in the world. They've been friends since 4 th grade and he apparently hugged my daughter and a fight ensued. He broke out his two front teeth and threw him down on the ground and was thrown out of the bar. The cops weren't called because no one wants more stress for my daughter, and the boys at the door caused some damage to his face and also didn't want to go to jail. She messaged me said they fought and she's staying at her friends house because he won't let her back in HER  house or get HER  car, and I'm to keep the baby. She'd see me in the morning. An hour later that piece of shit called me, telling me my daughter is a whore, she's a drunk and has slept with half the town, and he's coming to get his son. I told him calmly as \nI always do that I knew nothing,  the baby was asleep,  they'd be fine and work it out in the morning because he'd be sober and he's to go to sleep. Messages continued for 2 hours of hate/love and he was sorry. His last message said he'd see me tommaro for easter with his family!! Meaning us! You have no idea the things I wanted to say. I'm livid! I know he's talking to her and convinced her to go home. Again! \n\nNow today we start over again. I know he'll be coming with her, he'll be smiling as if he's a king, he's conquered again. he'll act like he's the best dad in the world and he'll treat my daughter like a dog. Ordering her around as if he's entitled. I can't do this anymore, watching your child cater to a creep is devastating. I know my daughter needs me to stay strong. She needs me to be here no matter what and I have been. My whole family has been. Time and time again. I've actually been extremely nice and full of fake support for him and he eats it up. It's the worst feeling in the world knowing some egotistical fuck is hurting your child and there's not a damn thing you can do about it. I am not a violent person, I don't judge anyone, But there comes a time where this can't happen anymore. I'm not far from paying to have this fuck taken out. My heart literally breaks for her, for my grandson. I hate thinking that little boy is watching his mommy get hit, or hearing his daddy call his mommy disgusting names. I hate the fact that he calls her such horrible names, throws shit at her, hits the dogs, breaks the doors and she hangs her head!  What the fuck is wrong with him! I hear the sirens and start praying it's not her and have to wait for her to call. We can't message her because he gets the messages. She wasn't raised with any of that. In fact quite the opposite. I sit and read about domestic violence everyday, trying to find any kind of answers. I can't help but think its because her dad never cared. I don't know. Today Is easter, of course he spent all the money on beer and weed, so my grandson won't have easter if it's not here. My brothers won't come, they can't refrain from beating his ass. My sisters won't come because they don't want their daughters seeing it and thinking it is ok. How the hell do I do this? My husband is at his breaking point. He's extremely calm and has intervened when he needed too, but this isn't going to go well. He's angry, he's raised her since she was 4. To her he's her dad, and her person she goes to for grounding. He has the ability to calm any situation, but he's completely had it and said he'd be beating his ass the minute he comes through our door after putting his hands on our child. Yes he's mad. How does one shake the hand of the devil who hurts the one you love the most. I would die a thousand times for her happiness, I'd commit a million felonies for her to feel safe. I'm just praying that doesn't become a reality anytime soon. I know there's many women that have suffered from domestic violence, and it's one of the hardest things to go through. How did any of their mothers cope? I'm scared shitless for my daughter, she's not a baby anymore, but she's my baby and always will be. I have become a hateful person, praying this guy dies, that's not ok. I have thoughts of doing bad bad things to him and knowing people snap, that scares me. Any advice is greatly appreciated.\n\nI know it has to be her choice, she has to be the one to go, she's horribly embarrassed, but still will end up going back. It's like he's has something over her. There's nothing we can't handle for her. I fear the state will step in and take my grandson. In our state, they rarely give the kids to family. It's one of the worst states to actually get kids back. She loves her son, she's a good mom, just not right now, she's placing him in an environment that will hurt him. I can't do a damn thing about it. All I can do, is count the hours down, sit by the phone, waiting for it to ring or wait for a message from her. Then I know we made it through that last amount of hours since I heard from her.  Please help me make it through today, because that little boy depends on me, he should be able to find the Easter eggs as any other child his age. She needs me, and he'll be on to anything that's off in my attitude. He'll sense that we are against him and that puts her at risk. I'm finding it easier to get rid of him in very wrong ways, and I know I'd gladly do prison time for my daughters safety, and to end this chaos and pain for my family. That can't be the ending especially today \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pazz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 381, "report_reasons": null, "author": "panickedmess33", "saved": false, "mod_reports": [], "name": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65pazz/how_do_i_f36_get_through_today_without_going_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492381004.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65pazz/how_do_i_f36_get_through_today_without_going_to/", "author_flair_text": null, "quarantine": false, "title": "How do I F/36 get through today without going to jail for giving my daughters F/21 boyfriend m/24 the same respect he's given her?", "created_utc": 1492352204.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 157, "visited": false, "subreddit_type": "public", "ups": 381}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdfvcu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgd362h", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "From what I understand the child can be removed for domestic violence. If you were placing your child in a situation where they are being exposed to anything around the domestic violence you can be charged, and have your kids removed until you find a safe  situation for them. Basically they're saying that if your being beat in front of your kids or anything like that you are abusing your children. This is a new thing, I haven't heard of it before. I just know in my state I've heard a lot about it just recently. I do know it's real because I know a girl that did end up having her children removed until she could provide a stable secure home for her child. I believe that they went and talked to the child at school. But they also had years of documentation of abuse and fights. So I'm not sure that we fall into that category. I think that it's going to depend on someone's opinion if it's bad or not. I do know that I was told that there's no evidence of him hitting her and they can't just do something because somebody have heard something. Which I understand. You have so many people calling into CPS that are hateful wanting to hurt someone that's not really doing anything and also lying about it taking up cps time and energy. Kind a like fake domestic calls you got girls that are saying that this guy beat them because they're mad and it really affects the girls who are really being abused. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what I understand the child can be removed for domestic violence. If you were placing your child in a situation where they are being exposed to anything around the domestic violence you can be charged, and have your kids removed until you find a safe  situation for them. Basically they&amp;#39;re saying that if your being beat in front of your kids or anything like that you are abusing your children. This is a new thing, I haven&amp;#39;t heard of it before. I just know in my state I&amp;#39;ve heard a lot about it just recently. I do know it&amp;#39;s real because I know a girl that did end up having her children removed until she could provide a stable secure home for her child. I believe that they went and talked to the child at school. But they also had years of documentation of abuse and fights. So I&amp;#39;m not sure that we fall into that category. I think that it&amp;#39;s going to depend on someone&amp;#39;s opinion if it&amp;#39;s bad or not. I do know that I was told that there&amp;#39;s no evidence of him hitting her and they can&amp;#39;t just do something because somebody have heard something. Which I understand. You have so many people calling into CPS that are hateful wanting to hurt someone that&amp;#39;s not really doing anything and also lying about it taking up cps time and energy. Kind a like fake domestic calls you got girls that are saying that this guy beat them because they&amp;#39;re mad and it really affects the girls who are really being abused. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdfvcu", "score_hidden": false, "stickied": false, "created": 1492462472.0, "created_utc": 1492433672.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd362h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mrspuff", "parent_id": "t1_dgc591q", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Definitely consult an expert. I am under the impression that a child will not be removed from a home unless he is being physically abused. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely consult an expert. I am under the impression that a child will not be removed from a home unless he is being physically abused. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd362h", "score_hidden": false, "stickied": false, "created": 1492430886.0, "created_utc": 1492402086.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc591q", "gilded": 0, "archived": false, "score": 61, "report_reasons": null, "author": "60sgal", "parent_id": "t1_dgc4l0s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I know it must be heartbreaking to watch your daughter break down to this point. But you're right- she will never leave of her own accord. Another poster made a good point- perhaps after losing her son she will feel less trapped and be more open to leaving? Your daughter has been the victim of abuse for years and feels like she's worthless, if I had to guess. Getting her some therapy after she breaks free would be really helpful. You also may want to consult a lawyer who specializes in family law (particularly grandparents trying to get custody) and ask them what they think your best bet is. Sadly, this isn't that uncommon. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it must be heartbreaking to watch your daughter break down to this point. But you&amp;#39;re right- she will never leave of her own accord. Another poster made a good point- perhaps after losing her son she will feel less trapped and be more open to leaving? Your daughter has been the victim of abuse for years and feels like she&amp;#39;s worthless, if I had to guess. Getting her some therapy after she breaks free would be really helpful. You also may want to consult a lawyer who specializes in family law (particularly grandparents trying to get custody) and ask them what they think your best bet is. Sadly, this isn&amp;#39;t that uncommon. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc591q", "score_hidden": false, "stickied": false, "created": 1492385112.0, "created_utc": 1492356312.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 61}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc9ah2", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgc4l0s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;  it's hard to pick up the phone and say that my daughter doesn't keep her son safe.\n\nYes, that sounds completely heart-breaking, but keep one thing clear: BOTH your daughter and your grandkid are in real danger, and while your daughter is choosing to not act and protect herself, the baby is unable to save self. You are right and if she doesn't speak up, you can't help her, but you can still help your grandkid. I think maybe then she will realize the seriousness of what is happening and finally leave him and fight for her rights as a mom down the road. I know you feel doing any of this will put her at greater risk, but seriously she is already not safe, she is already at high risk of being seriously hurt by this guy no matter what. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s hard to pick up the phone and say that my daughter doesn&amp;#39;t keep her son safe.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, that sounds completely heart-breaking, but keep one thing clear: BOTH your daughter and your grandkid are in real danger, and while your daughter is choosing to not act and protect herself, the baby is unable to save self. You are right and if she doesn&amp;#39;t speak up, you can&amp;#39;t help her, but you can still help your grandkid. I think maybe then she will realize the seriousness of what is happening and finally leave him and fight for her rights as a mom down the road. I know you feel doing any of this will put her at greater risk, but seriously she is already not safe, she is already at high risk of being seriously hurt by this guy no matter what. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9ah2", "score_hidden": false, "stickied": false, "created": 1492390520.0, "created_utc": 1492361720.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcc3n7", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Rivka333", "parent_id": "t1_dgc4l0s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; I know I have to protect my grandson.\n\nThis has to be your priority. \n\nYour daughter has made her own choices, and as horrible as her choices are, it's not possible for you to move her away from them. You're already there for her, and she knows it, but as she is refusing to let herself be helped, there's nothing you can do for her.\n\nYour grandson is a baby who has chosen none of this. And you might still be able to help him. And,therefore his safety is your priority. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I know I have to protect my grandson.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This has to be your priority. &lt;/p&gt;\n\n&lt;p&gt;Your daughter has made her own choices, and as horrible as her choices are, it&amp;#39;s not possible for you to move her away from them. You&amp;#39;re already there for her, and she knows it, but as she is refusing to let herself be helped, there&amp;#39;s nothing you can do for her.&lt;/p&gt;\n\n&lt;p&gt;Your grandson is a baby who has chosen none of this. And you might still be able to help him. And,therefore his safety is your priority. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcc3n7", "score_hidden": false, "stickied": false, "created": 1492394206.0, "created_utc": 1492365406.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdg2i7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgcxa6w", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She agreed with us last night to let us keep him. Now we are trying to figure out if he has any rights to him. Because they are not married and he is not on the lease over there however he has established residency by getting mail there. She is willing to sign temporary guardianship and until she gets him out of her life. She is aware of what is going on but has to apparently do it right. I do have more faith today than  I have in a long time. My grandson had been staying with us for the last two weeks because of her work schedule traveling and such and it was easier for him to just stay all night then to bring him at 4:30 in the morning. So he has been here the last two weeks and previously since he's been born he has been here at least three nights a week and every other weekend for the whole weekend. He doesn't like to care for his Son until someone tries to say he doesn't. She has not told him that she has agreed for him to stay here and won't until we have some type of security he can stay right now he's thinking she has to work and she's going to be gone more than 24 hours. So it's natural that he would stay with us. Thank you for your comments,  advice  and kind thoughts. It's really appreciated ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She agreed with us last night to let us keep him. Now we are trying to figure out if he has any rights to him. Because they are not married and he is not on the lease over there however he has established residency by getting mail there. She is willing to sign temporary guardianship and until she gets him out of her life. She is aware of what is going on but has to apparently do it right. I do have more faith today than  I have in a long time. My grandson had been staying with us for the last two weeks because of her work schedule traveling and such and it was easier for him to just stay all night then to bring him at 4:30 in the morning. So he has been here the last two weeks and previously since he&amp;#39;s been born he has been here at least three nights a week and every other weekend for the whole weekend. He doesn&amp;#39;t like to care for his Son until someone tries to say he doesn&amp;#39;t. She has not told him that she has agreed for him to stay here and won&amp;#39;t until we have some type of security he can stay right now he&amp;#39;s thinking she has to work and she&amp;#39;s going to be gone more than 24 hours. So it&amp;#39;s natural that he would stay with us. Thank you for your comments,  advice  and kind thoughts. It&amp;#39;s really appreciated &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdg2i7", "score_hidden": false, "stickied": false, "created": 1492462822.0, "created_utc": 1492434022.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxa6w", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Logical_Lefty", "parent_id": "t1_dgctizl", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This. You could have saved a ton of money from the car repossessions if you had sunk it into a PI. Of course hindsight is 20-20. \n\nIn relation to other posters and someone who is in the psychology field and friends with many social workers: that grandkid has to be priority. Your daughter has unfortunately, and consistently chosen this path. She doesn't deserve what she's getting, with that said, if you choose to stick your head in a bees nest 20 times over, expect a sting or 500.\n\nI'm sorry that you have to experience such an awful set of circumstances, I have seen relatively similar things happen in my family, but they weren't my children. I cannot imagine what it must feel like to have made similar mistakes, try to save your daughter from making the same ones, only to see her repeat it all.\n\nI send my best wishes to you and your family (I'm sorry they unfortunately don't actually fix anything), and please get that grandchild out of there as step 1A.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. You could have saved a ton of money from the car repossessions if you had sunk it into a PI. Of course hindsight is 20-20. &lt;/p&gt;\n\n&lt;p&gt;In relation to other posters and someone who is in the psychology field and friends with many social workers: that grandkid has to be priority. Your daughter has unfortunately, and consistently chosen this path. She doesn&amp;#39;t deserve what she&amp;#39;s getting, with that said, if you choose to stick your head in a bees nest 20 times over, expect a sting or 500.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that you have to experience such an awful set of circumstances, I have seen relatively similar things happen in my family, but they weren&amp;#39;t my children. I cannot imagine what it must feel like to have made similar mistakes, try to save your daughter from making the same ones, only to see her repeat it all.&lt;/p&gt;\n\n&lt;p&gt;I send my best wishes to you and your family (I&amp;#39;m sorry they unfortunately don&amp;#39;t actually fix anything), and please get that grandchild out of there as step 1A.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcxa6w", "score_hidden": false, "stickied": false, "created": 1492422361.0, "created_utc": 1492393561.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdcimx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yelbesed", "parent_id": "t1_dgctizl", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes. There is not any other way out of this. Except he will come out of prison with full of vengeful wishes and maybe actions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. There is not any other way out of this. Except he will come out of prison with full of vengeful wishes and maybe actions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdcimx", "score_hidden": false, "stickied": false, "created": 1492454630.0, "created_utc": 1492425830.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctizl", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "CallMeDoc24", "parent_id": "t1_dgc4l0s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I don't know the process too well, but it might be worth finding a private investigator and gathering enough evidence to bring him to court/press criminal charges.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know the process too well, but it might be worth finding a private investigator and gathering enough evidence to bring him to court/press criminal charges.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgctizl", "score_hidden": false, "stickied": false, "created": 1492417405.0, "created_utc": 1492388605.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdl900", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LadyRikka", "parent_id": "t1_dgc4l0s", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; she will stick up for him and act like nothing happened.\n\nI'm not a lawyer, but I was under the impression that in a criminal case like assault, where he's beating her up, they don't need her testimony to put him away. Of course, if she testifies that he's hurting her, the case will be easier, but if other people witness him abusing her, it won't matter if she sticks up for him, since they have other evidence and witnesses. The state is the one to press charges, not her. Again, I'm not a lawyer, but it might be worth looking into. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she will stick up for him and act like nothing happened.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not a lawyer, but I was under the impression that in a criminal case like assault, where he&amp;#39;s beating her up, they don&amp;#39;t need her testimony to put him away. Of course, if she testifies that he&amp;#39;s hurting her, the case will be easier, but if other people witness him abusing her, it won&amp;#39;t matter if she sticks up for him, since they have other evidence and witnesses. The state is the one to press charges, not her. Again, I&amp;#39;m not a lawyer, but it might be worth looking into. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdl900", "score_hidden": false, "stickied": false, "created": 1492470318.0, "created_utc": 1492441518.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4l0s", "gilded": 0, "archived": false, "score": 65, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc44r3", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes, this is our plan. However we fear that calling the police she will stick up for him and act like nothing happened. She could come to our house and have a blackeye and we know what happened but she'll make something up. She's an adult and she can choose to stay there. although it's devastating me, I know I have to protect my grandson. In doing so I'm going to have to turn my daughter in. Next to having her lose her car it's hard. it's hard to pick up the phone and say that my daughter doesn't keep her son safe. Because I take the chance that she will never leave and I take the chance that he will kill her because of me. He will blame me and take it out on her, because they would lose their son. And I don't know if that's pushing her more in the dirt or not. I have my grandson quite a bit. I have him more now than I ever have. And you're right it's absolutely disgusting that anybody would talk to anybody that way. It's hard to admit that my daughter let's it happen. But ignoring it hasn't done any help either. Thank you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, this is our plan. However we fear that calling the police she will stick up for him and act like nothing happened. She could come to our house and have a blackeye and we know what happened but she&amp;#39;ll make something up. She&amp;#39;s an adult and she can choose to stay there. although it&amp;#39;s devastating me, I know I have to protect my grandson. In doing so I&amp;#39;m going to have to turn my daughter in. Next to having her lose her car it&amp;#39;s hard. it&amp;#39;s hard to pick up the phone and say that my daughter doesn&amp;#39;t keep her son safe. Because I take the chance that she will never leave and I take the chance that he will kill her because of me. He will blame me and take it out on her, because they would lose their son. And I don&amp;#39;t know if that&amp;#39;s pushing her more in the dirt or not. I have my grandson quite a bit. I have him more now than I ever have. And you&amp;#39;re right it&amp;#39;s absolutely disgusting that anybody would talk to anybody that way. It&amp;#39;s hard to admit that my daughter let&amp;#39;s it happen. But ignoring it hasn&amp;#39;t done any help either. Thank you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4l0s", "score_hidden": false, "stickied": false, "created": 1492384171.0, "created_utc": 1492355371.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 65}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc9432", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgc44r3", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Great point. Once arrested, you have a few days at least to try to talk to her, to come up with a plan and file for divorce and to have  safe place for them. Also, make sure you record all these incidents, when you finally make it to ask for custody or to put him in jail or when he finally divorces his ass, you need proof of what he's done, witnesses, pictures, text messages. ", "edited": 1492362106.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great point. Once arrested, you have a few days at least to try to talk to her, to come up with a plan and file for divorce and to have  safe place for them. Also, make sure you record all these incidents, when you finally make it to ask for custody or to put him in jail or when he finally divorces his ass, you need proof of what he&amp;#39;s done, witnesses, pictures, text messages. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9432", "score_hidden": false, "stickied": false, "created": 1492390308.0, "created_utc": 1492361508.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdw3ad", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stopbngcrazy", "parent_id": "t1_dgdga38", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Play fair and play honest, it's the only way you can truly win. Let the Lord handle the rest. I'm so happy that she signed the papers. Are you getting official counsel? That's the best way to go and keep praying. God speed and good luck. GBY.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Play fair and play honest, it&amp;#39;s the only way you can truly win. Let the Lord handle the rest. I&amp;#39;m so happy that she signed the papers. Are you getting official counsel? That&amp;#39;s the best way to go and keep praying. God speed and good luck. GBY.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdw3ad", "score_hidden": false, "stickied": false, "created": 1492482550.0, "created_utc": 1492453750.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdga38", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgcgehu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She agreed to sign temporary guardianship with us last night, he doesn't know and we're just trying to find the laws right now on if he has any claim to my grandson without going to court. It  used to be the mother had custody automatically and the father had to petition the court for visitation . He did not want to be named on the birth certificate it because in case she had to go for child support at anytime  , he didn't think he wanted to pay it. She said that she did put his name on it though. There are some dirty tricks we could play saying we didn't know for sure if he was the dad just to buy time but I'm not for certain that something we want to do yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She agreed to sign temporary guardianship with us last night, he doesn&amp;#39;t know and we&amp;#39;re just trying to find the laws right now on if he has any claim to my grandson without going to court. It  used to be the mother had custody automatically and the father had to petition the court for visitation . He did not want to be named on the birth certificate it because in case she had to go for child support at anytime  , he didn&amp;#39;t think he wanted to pay it. She said that she did put his name on it though. There are some dirty tricks we could play saying we didn&amp;#39;t know for sure if he was the dad just to buy time but I&amp;#39;m not for certain that something we want to do yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdga38", "score_hidden": false, "stickied": false, "created": 1492463187.0, "created_utc": 1492434387.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcgehu", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "stopbngcrazy", "parent_id": "t1_dgc8c14", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Remember I said to file for temporary custody which means legal channels, you cannot do it any other way or you will end up being in jail which was  what you were trying to avoid by posting on here in the first place. \n\nSeek legal counsel first thing tomorrow morning and remember file for temporary custody, this way might be easier. Again pray on all the steps you are about to take. No one can give you better advice than the Lord himself.\n\n Again good luck and Happy Easter and Resurrection day.", "edited": 1492373000.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember I said to file for temporary custody which means legal channels, you cannot do it any other way or you will end up being in jail which was  what you were trying to avoid by posting on here in the first place. &lt;/p&gt;\n\n&lt;p&gt;Seek legal counsel first thing tomorrow morning and remember file for temporary custody, this way might be easier. Again pray on all the steps you are about to take. No one can give you better advice than the Lord himself.&lt;/p&gt;\n\n&lt;p&gt;Again good luck and Happy Easter and Resurrection day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcgehu", "score_hidden": false, "stickied": false, "created": 1492399940.0, "created_utc": 1492371140.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcxc65", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Logical_Lefty", "parent_id": "t1_dgc8c14", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You have made an incredibly hard, and important choice here. Stay strong. You're doing the right thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have made an incredibly hard, and important choice here. Stay strong. You&amp;#39;re doing the right thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcxc65", "score_hidden": false, "stickied": false, "created": 1492422440.0, "created_utc": 1492393640.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8c14", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc79ou", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes we've decided that our grandson isn't going home today. It's hard, but if she can't put him first, we have too. Thank you ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes we&amp;#39;ve decided that our grandson isn&amp;#39;t going home today. It&amp;#39;s hard, but if she can&amp;#39;t put him first, we have too. Thank you &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8c14", "score_hidden": false, "stickied": false, "created": 1492389287.0, "created_utc": 1492360487.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc79ou", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "stopbngcrazy", "parent_id": "t1_dgc44r3", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Do not kill this man. Do not also pay to have this man beaten up. I would not enable your daughter anymore either. I would keep calling the police every time he commits an offense.  She's got to live with her choices and lastly and most importantly I would pray and pray every single day until your daughter either leaves this man or she gets this man the psychological help he needs. \n\nI would also pray on the issue of perhaps filing for temporary custody of the child and I mean literally pray on this specific issue because this sounds like a powder keg waiting to go off as well as to keep continuously praying on this situation every day until a good solution has been produced. God Bless and good luck.", "edited": 1492364957.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not kill this man. Do not also pay to have this man beaten up. I would not enable your daughter anymore either. I would keep calling the police every time he commits an offense.  She&amp;#39;s got to live with her choices and lastly and most importantly I would pray and pray every single day until your daughter either leaves this man or she gets this man the psychological help he needs. &lt;/p&gt;\n\n&lt;p&gt;I would also pray on the issue of perhaps filing for temporary custody of the child and I mean literally pray on this specific issue because this sounds like a powder keg waiting to go off as well as to keep continuously praying on this situation every day until a good solution has been produced. God Bless and good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc79ou", "score_hidden": false, "stickied": false, "created": 1492387864.0, "created_utc": 1492359064.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc44r3", "gilded": 0, "archived": false, "score": 289, "report_reasons": null, "author": "60sgal", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This is honestly awful. Reading how he treats her made me sick and I can only imagine how you feel as her mom. Whatever you do, please don't kill him. He's not worth it. Next time he hits her or does something at the bar, call the police. Your best bet is getting him arrested and having him serve the jail time he deserves. Then; with him out of the picture perhaps your daughter will improve. You may want to try to petition for custody of your grandson as well. That's a terrible environment for a child to grow up in. I wish you the best of luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is honestly awful. Reading how he treats her made me sick and I can only imagine how you feel as her mom. Whatever you do, please don&amp;#39;t kill him. He&amp;#39;s not worth it. Next time he hits her or does something at the bar, call the police. Your best bet is getting him arrested and having him serve the jail time he deserves. Then; with him out of the picture perhaps your daughter will improve. You may want to try to petition for custody of your grandson as well. That&amp;#39;s a terrible environment for a child to grow up in. I wish you the best of luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc44r3", "score_hidden": false, "stickied": false, "created": 1492383499.0, "created_utc": 1492354699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 289}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc5kg3", "gilded": 0, "archived": false, "score": 77, "report_reasons": null, "author": "_goodzilla_", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm so, so sorry.\n\nYou're right that you can't protect your daughter.\n\nBut the law *can*. This is why laws exist. Once this idiot is in jail, she'll have the space she needs to get him out of her brain.\n\nAt the absolute least, you can protect your grandson.\n\nSee if her friend will testify about getting his teeth knocked out. Maybe the concerned callers from the bar will testify that they know he's beating her. Hell, just tell CPS that there's abuse in the home, and that dad let his kid get sick, and then, at least, he'll be safe.\n\nI'm not at all sure how this works, but maybe CPS can mandate that she gets some counseling. This situation is **so** out of control. She needs a professional, whose judgement doesn't matter to her, to help get back on track.\n\nAn alternative (which I'm not sure I recommend): maybe you can hold some kind of intervention. You, your husband, her friends, and the people who were worried about her at the bar can confront her and let her know that this ISN'T okay. She doesn't deserve anything like this. She's endangering her son. She can find happiness and stability without him. Maybe someone from CPS could come with you. Or someone from a battered women's shelter.\n\nAgain, I couldn't be more sorry. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so, so sorry.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right that you can&amp;#39;t protect your daughter.&lt;/p&gt;\n\n&lt;p&gt;But the law &lt;em&gt;can&lt;/em&gt;. This is why laws exist. Once this idiot is in jail, she&amp;#39;ll have the space she needs to get him out of her brain.&lt;/p&gt;\n\n&lt;p&gt;At the absolute least, you can protect your grandson.&lt;/p&gt;\n\n&lt;p&gt;See if her friend will testify about getting his teeth knocked out. Maybe the concerned callers from the bar will testify that they know he&amp;#39;s beating her. Hell, just tell CPS that there&amp;#39;s abuse in the home, and that dad let his kid get sick, and then, at least, he&amp;#39;ll be safe.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not at all sure how this works, but maybe CPS can mandate that she gets some counseling. This situation is &lt;strong&gt;so&lt;/strong&gt; out of control. She needs a professional, whose judgement doesn&amp;#39;t matter to her, to help get back on track.&lt;/p&gt;\n\n&lt;p&gt;An alternative (which I&amp;#39;m not sure I recommend): maybe you can hold some kind of intervention. You, your husband, her friends, and the people who were worried about her at the bar can confront her and let her know that this ISN&amp;#39;T okay. She doesn&amp;#39;t deserve anything like this. She&amp;#39;s endangering her son. She can find happiness and stability without him. Maybe someone from CPS could come with you. Or someone from a battered women&amp;#39;s shelter.&lt;/p&gt;\n\n&lt;p&gt;Again, I couldn&amp;#39;t be more sorry. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc5kg3", "score_hidden": false, "stickied": false, "created": 1492385549.0, "created_utc": 1492356749.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 77}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdgg56", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgd1u5y", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes and this is what we're trying to avoid there are a lot of senseless act actions taken by CPS and I just don't want to take a chance that that's going to happen to us. It does happen a lot some kids are removed for no reason other kids aren't removed you have caseworkers that are biased and help certain individuals still do things and you can't take a chance that somebody might or might not do it right. I think that the add more fuel to the fire than needed.  We are certainly not trying to add that. He doesn't care if he's with us or not being with us he can follow my daughter anywhere he has more time to do that and has more time to know what she's doing other than changing his child or feeding him that takes time away from his focus on my daughter. She knows it's bad she agreed to let stay here and sign temporary guardianship until she can provide a safe environment she said to me that it takes time and she has to plan it extremely carefully because he is a ticking time bomb. At least she knows that. I know one of her concerns is they live in the same house and he's establish residency and sometimes the police don't get there in time and sometimes the police don't Think it's serious enough and people really get hurt but I understand their reservations in situations to. It's just a hard situation anyway you look at it. He will get out one day and if he doesn't become fixated on someone else is obsession with my daughter won't stop. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes and this is what we&amp;#39;re trying to avoid there are a lot of senseless act actions taken by CPS and I just don&amp;#39;t want to take a chance that that&amp;#39;s going to happen to us. It does happen a lot some kids are removed for no reason other kids aren&amp;#39;t removed you have caseworkers that are biased and help certain individuals still do things and you can&amp;#39;t take a chance that somebody might or might not do it right. I think that the add more fuel to the fire than needed.  We are certainly not trying to add that. He doesn&amp;#39;t care if he&amp;#39;s with us or not being with us he can follow my daughter anywhere he has more time to do that and has more time to know what she&amp;#39;s doing other than changing his child or feeding him that takes time away from his focus on my daughter. She knows it&amp;#39;s bad she agreed to let stay here and sign temporary guardianship until she can provide a safe environment she said to me that it takes time and she has to plan it extremely carefully because he is a ticking time bomb. At least she knows that. I know one of her concerns is they live in the same house and he&amp;#39;s establish residency and sometimes the police don&amp;#39;t get there in time and sometimes the police don&amp;#39;t Think it&amp;#39;s serious enough and people really get hurt but I understand their reservations in situations to. It&amp;#39;s just a hard situation anyway you look at it. He will get out one day and if he doesn&amp;#39;t become fixated on someone else is obsession with my daughter won&amp;#39;t stop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgg56", "score_hidden": false, "stickied": false, "created": 1492463480.0, "created_utc": 1492434680.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1u5y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Drcoulter", "parent_id": "t1_dgcu0di", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Good points.  However, dad doesn't seem to care if child is in his care or not.   Maybe his selfish, irresponsible side will see some benefit to all the sudden  free time he gets if child suddenly lives full time with grandma.   I've been burned by CPS.  As a teacher, I've seen how often reports get nowhere.  Repeated reports.  Bad stuff.  Just not bad enough, I guess.  Also, CPS caseworker lied about checking back on kiddo.  Never happened.  That caseworker simply got fired and case was never reopened.   A new complaint would need to be filed.   Just endless crap, honestly.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good points.  However, dad doesn&amp;#39;t seem to care if child is in his care or not.   Maybe his selfish, irresponsible side will see some benefit to all the sudden  free time he gets if child suddenly lives full time with grandma.   I&amp;#39;ve been burned by CPS.  As a teacher, I&amp;#39;ve seen how often reports get nowhere.  Repeated reports.  Bad stuff.  Just not bad enough, I guess.  Also, CPS caseworker lied about checking back on kiddo.  Never happened.  That caseworker simply got fired and case was never reopened.   A new complaint would need to be filed.   Just endless crap, honestly.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd1u5y", "score_hidden": false, "stickied": false, "created": 1492428790.0, "created_utc": 1492399990.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu0di", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cioncaragodeo", "parent_id": "t1_dgctpbz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Both parents would have to sign over rights for OP to legally take custody. I highly doubt dad would let such a major control point go easily. And yes, CPS is underworked, but a paper trail is necessary to start anything. The fact OP and others aren't reporting this to anyone is going to make it that much harder when something does happen. If dad had been arrested for injuring the friend at the bar, the police would have legal proof of his violence documented, making any CPS case stronger. There might need to be 50 calls placed before anything happens officially, but each and every one of those calls builds a case.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Both parents would have to sign over rights for OP to legally take custody. I highly doubt dad would let such a major control point go easily. And yes, CPS is underworked, but a paper trail is necessary to start anything. The fact OP and others aren&amp;#39;t reporting this to anyone is going to make it that much harder when something does happen. If dad had been arrested for injuring the friend at the bar, the police would have legal proof of his violence documented, making any CPS case stronger. There might need to be 50 calls placed before anything happens officially, but each and every one of those calls builds a case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcu0di", "score_hidden": false, "stickied": false, "created": 1492418058.0, "created_utc": 1492389258.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctpbz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Drcoulter", "parent_id": "t1_dgcd3gm", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Sadly, CPS really does very little.  The workers are understaffed and underpaid.   It's a revolving door of young people, mostly, and they quickly become disheartened by realizing they make such a small dent in so many sad families.  To remove a child from a home is a HUGE undertaking and honestly, almost requires an absurd amount of pathetically illegal behavior on the part of the parent.  If the mother won't corroborate the abusive behavior, then it's just hearsay and nothing really happens.  Sucks.  I think getting the mother to agree to signing over her rights to the child and into temporary custody of the grandparents is the safer bet.  I realize that doesn't rescue mom from her situation, but she is an adult.  Grandchild isn't and needs to be intervened upon.   \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sadly, CPS really does very little.  The workers are understaffed and underpaid.   It&amp;#39;s a revolving door of young people, mostly, and they quickly become disheartened by realizing they make such a small dent in so many sad families.  To remove a child from a home is a HUGE undertaking and honestly, almost requires an absurd amount of pathetically illegal behavior on the part of the parent.  If the mother won&amp;#39;t corroborate the abusive behavior, then it&amp;#39;s just hearsay and nothing really happens.  Sucks.  I think getting the mother to agree to signing over her rights to the child and into temporary custody of the grandparents is the safer bet.  I realize that doesn&amp;#39;t rescue mom from her situation, but she is an adult.  Grandchild isn&amp;#39;t and needs to be intervened upon.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgctpbz", "score_hidden": false, "stickied": false, "created": 1492417637.0, "created_utc": 1492388837.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd3gm", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "cioncaragodeo", "parent_id": "t1_dgcbn4k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This. If he shows up and says I'm taking the kid, and daughter doesn't disagree (which is likely come that point) then they can have OP arrested for kidnapping. OP, call CPS. Start getting them both in trouble. When he fucks up, get him arrested, especially when it's against people who aren't her. CPS is more than likely to let the child live with you, they want families - especially the members that are good people - to remain in the child's life. Family placement is easier than foster care. They're also going to be people who have seen this scenario time and time again, and I've seen judges state that one parent could have custody back IF the abusive parent was removed from the household. It could be the wake up call she needs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. If he shows up and says I&amp;#39;m taking the kid, and daughter doesn&amp;#39;t disagree (which is likely come that point) then they can have OP arrested for kidnapping. OP, call CPS. Start getting them both in trouble. When he fucks up, get him arrested, especially when it&amp;#39;s against people who aren&amp;#39;t her. CPS is more than likely to let the child live with you, they want families - especially the members that are good people - to remain in the child&amp;#39;s life. Family placement is easier than foster care. They&amp;#39;re also going to be people who have seen this scenario time and time again, and I&amp;#39;ve seen judges state that one parent could have custody back IF the abusive parent was removed from the household. It could be the wake up call she needs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcd3gm", "score_hidden": false, "stickied": false, "created": 1492395534.0, "created_utc": 1492366734.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcjod8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgcbn4k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thankfully they are not married they are just living together. And because there is nothing documented and anytime the police did come both of them would deny any altercation. It is not illegal to yell and scream at you girlfriend, or to throw shit around the house,  it is wrong.  You can get your children taken if you do it in front of your children and you don't protect them from the yelling and emotional abuse. I think the state laws are completely screwed up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thankfully they are not married they are just living together. And because there is nothing documented and anytime the police did come both of them would deny any altercation. It is not illegal to yell and scream at you girlfriend, or to throw shit around the house,  it is wrong.  You can get your children taken if you do it in front of your children and you don&amp;#39;t protect them from the yelling and emotional abuse. I think the state laws are completely screwed up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjod8", "score_hidden": false, "stickied": false, "created": 1492404183.0, "created_utc": 1492375383.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbn4k", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "chamcd", "parent_id": "t1_dgc80fa", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Is her husband coming? That could escalate and get very violent if you say you are keeping their son and not allowing him to leave with his parents. And if he isn't going to be there, imagine what he might do to her coming home without their son. Would he come after you and your husband? You need to make sure you are protected.\n\nRight now they do have custody and they could turn it around on you and get you in trouble. My advice... Do it legally. Call CPS for now, call the cops and get an welfare check for the short term. Long term get a lawyer and work on getting full custody. It could backfire if you try and do it without custody or the law behind you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is her husband coming? That could escalate and get very violent if you say you are keeping their son and not allowing him to leave with his parents. And if he isn&amp;#39;t going to be there, imagine what he might do to her coming home without their son. Would he come after you and your husband? You need to make sure you are protected.&lt;/p&gt;\n\n&lt;p&gt;Right now they do have custody and they could turn it around on you and get you in trouble. My advice... Do it legally. Call CPS for now, call the cops and get an welfare check for the short term. Long term get a lawyer and work on getting full custody. It could backfire if you try and do it without custody or the law behind you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcbn4k", "score_hidden": false, "stickied": false, "created": 1492393607.0, "created_utc": 1492364807.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc80fa", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc74pa", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes today we've agreed that we are telling her that he is not leaving our home and if we have to file for custody we will. I do not believe that she will fight us on that because she knows we will and we will win. I'm just hoping that she decides to come too. thank you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes today we&amp;#39;ve agreed that we are telling her that he is not leaving our home and if we have to file for custody we will. I do not believe that she will fight us on that because she knows we will and we will win. I&amp;#39;m just hoping that she decides to come too. thank you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc80fa", "score_hidden": false, "stickied": false, "created": 1492388861.0, "created_utc": 1492360061.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc74pa", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "thebabes2", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Your daughter....I don't know what can be done for her until she's ready to recognize the abuse, but you have to get that child away from him AND her.  She cannot safely or responsibly parent him right now.  Get a lawyer and see what you can do to get custody of the baby.  I don't know how any of that works, but O2 sats in the 60s is scary.  If the child is sick and dad smokes around him he could cause immense harm.  Protect your grandson.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your daughter....I don&amp;#39;t know what can be done for her until she&amp;#39;s ready to recognize the abuse, but you have to get that child away from him AND her.  She cannot safely or responsibly parent him right now.  Get a lawyer and see what you can do to get custody of the baby.  I don&amp;#39;t know how any of that works, but O2 sats in the 60s is scary.  If the child is sick and dad smokes around him he could cause immense harm.  Protect your grandson.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc74pa", "score_hidden": false, "stickied": false, "created": 1492387682.0, "created_utc": 1492358882.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc9h5g", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "ScionOfSekhmet", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "To add to the great advice here, start keeping a log of everything that happens with proof (screen shots of texts), pictures of her signs of physical abuse. Start calling the cops whenever you can. They may not do anything, but you will be able to gather the paper trail of evidence toward getting a restraining order against him and custody of your grand baby. I'm sure there is a way, so look into recording calls he may make to you. Just check your state's recording laws as to whether you need one vs two party consent for recording. \n\nTalk to a lawyer that doesn't know your family or the dickhead so that you can get an objective point of view on the best way to proceed. \n\nI second the notion of reporting through CPS and petition the courts for custody of your grandson. Collect the evidence always. If you don't, it is their word vs yours. \n\nLastly, I can only imagine the insane amounts of rage you are feeling right now, but do NOT act upon them either directly or indirectly. If you want a chance of saving your grandson, any ties toward retaliatory behavior might\nresult in your grandson being place in CPS custody with a stranger. \n\nAs for your daughter, that is much more difficult. Continue to empower her with words. Make sure she has numbers to local women's shelters. Hell, it may be worth contacting women's shelters Yourself to see what advice they have in dealing with these situations. \n\nTLDR: Hang in there, collect your trail of evidence, call the cops and file reports or petition for a restraining order, talk to a lawyer, talk to a women's shelter for advice, save your grandson, but do NOT sink to the level of his behavior. \n\nLastly, actions speak louder than words. Make sure you carry through on your promise of keeping your grandson if she doesn't leave. If not, they become idle threats and you lose your influence. \n\nMuch love. ❤\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add to the great advice here, start keeping a log of everything that happens with proof (screen shots of texts), pictures of her signs of physical abuse. Start calling the cops whenever you can. They may not do anything, but you will be able to gather the paper trail of evidence toward getting a restraining order against him and custody of your grand baby. I&amp;#39;m sure there is a way, so look into recording calls he may make to you. Just check your state&amp;#39;s recording laws as to whether you need one vs two party consent for recording. &lt;/p&gt;\n\n&lt;p&gt;Talk to a lawyer that doesn&amp;#39;t know your family or the dickhead so that you can get an objective point of view on the best way to proceed. &lt;/p&gt;\n\n&lt;p&gt;I second the notion of reporting through CPS and petition the courts for custody of your grandson. Collect the evidence always. If you don&amp;#39;t, it is their word vs yours. &lt;/p&gt;\n\n&lt;p&gt;Lastly, I can only imagine the insane amounts of rage you are feeling right now, but do NOT act upon them either directly or indirectly. If you want a chance of saving your grandson, any ties toward retaliatory behavior might\nresult in your grandson being place in CPS custody with a stranger. &lt;/p&gt;\n\n&lt;p&gt;As for your daughter, that is much more difficult. Continue to empower her with words. Make sure she has numbers to local women&amp;#39;s shelters. Hell, it may be worth contacting women&amp;#39;s shelters Yourself to see what advice they have in dealing with these situations. &lt;/p&gt;\n\n&lt;p&gt;TLDR: Hang in there, collect your trail of evidence, call the cops and file reports or petition for a restraining order, talk to a lawyer, talk to a women&amp;#39;s shelter for advice, save your grandson, but do NOT sink to the level of his behavior. &lt;/p&gt;\n\n&lt;p&gt;Lastly, actions speak louder than words. Make sure you carry through on your promise of keeping your grandson if she doesn&amp;#39;t leave. If not, they become idle threats and you lose your influence. &lt;/p&gt;\n\n&lt;p&gt;Much love. ❤&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9h5g", "score_hidden": false, "stickied": false, "created": 1492390754.0, "created_utc": 1492361954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcjtry", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgcekk6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "We thought about that one too and we know she doesn't have any money because he takes it, her balance in her account is 0. She doesn't get paid until next week so this would be the perfect time. We are hoping that because it was a domestic situation that the judge will issue a no contact order. If they break that no contact order, either one of them, they go to jail because it's the judge saying they have to stay away from each other. Either way she still not taking him home even if there's a no contact order.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We thought about that one too and we know she doesn&amp;#39;t have any money because he takes it, her balance in her account is 0. She doesn&amp;#39;t get paid until next week so this would be the perfect time. We are hoping that because it was a domestic situation that the judge will issue a no contact order. If they break that no contact order, either one of them, they go to jail because it&amp;#39;s the judge saying they have to stay away from each other. Either way she still not taking him home even if there&amp;#39;s a no contact order.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjtry", "score_hidden": false, "stickied": false, "created": 1492404375.0, "created_utc": 1492375575.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcekk6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "bittersweetdromedary", "parent_id": "t1_dgcehx0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm glad you're doing something to help put him in jail! I hope to God that she doesn't bail him out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad you&amp;#39;re doing something to help put him in jail! I hope to God that she doesn&amp;#39;t bail him out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcekk6", "score_hidden": false, "stickied": false, "created": 1492397526.0, "created_utc": 1492368726.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcehx0", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgcctvk", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes you are right. She didn't beg him to not from what I understand because week own the bar, is that they didn't want anymore trouble for her. We will be speaking with him this evening and asking him to because that only helps us. I think she's waiting for something like that to happen.  She doesn't think clearly, everything he says she is confused about.  We will be getting our video of the incident this afternoon from the bar, and we also can file charges and orders to keep him from returning there. That will be done immediately. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes you are right. She didn&amp;#39;t beg him to not from what I understand because week own the bar, is that they didn&amp;#39;t want anymore trouble for her. We will be speaking with him this evening and asking him to because that only helps us. I think she&amp;#39;s waiting for something like that to happen.  She doesn&amp;#39;t think clearly, everything he says she is confused about.  We will be getting our video of the incident this afternoon from the bar, and we also can file charges and orders to keep him from returning there. That will be done immediately. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcehx0", "score_hidden": false, "stickied": false, "created": 1492397426.0, "created_utc": 1492368626.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcctvk", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "bittersweetdromedary", "parent_id": "t1_dgcamcs", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Talking to the friend and asking him to press charges might actually be a good idea. The daughter probably begged him not to, but she obviously doesn't know what's for the best in any situation. The guy who got his teeth knocked out deserves to have his medical bills paid for him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talking to the friend and asking him to press charges might actually be a good idea. The daughter probably begged him not to, but she obviously doesn&amp;#39;t know what&amp;#39;s for the best in any situation. The guy who got his teeth knocked out deserves to have his medical bills paid for him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcctvk", "score_hidden": false, "stickied": false, "created": 1492395177.0, "created_utc": 1492366377.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcamcs", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Dada2fish", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "The guy who's teeth he knocked out, is he pressing charges? If not, why not? Because he's your daughter's friend? So what? You said everyone at the bar didn't want to call the police because it would cause your daughter stress. So what? She needs to hit rock bottom with this asshole. He needs to be in jail. You say he abuses her in front of the baby? Domestic assault in the presence of a minor could land him many years in prison. He needs to get caught doing something so there will be a record showing he's not a stable dad and then he could be sent away for awhile unable to manipulate your daughter. Get him out of the picture somehow. Do not give your daughter any money or pay any bills or enable them in any way. Does he take drugs? Drive drunk? Anything else illegal? Maybe hire a private investigator to track him a possibly record him doing something illegal. Dunno...just a suggestion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The guy who&amp;#39;s teeth he knocked out, is he pressing charges? If not, why not? Because he&amp;#39;s your daughter&amp;#39;s friend? So what? You said everyone at the bar didn&amp;#39;t want to call the police because it would cause your daughter stress. So what? She needs to hit rock bottom with this asshole. He needs to be in jail. You say he abuses her in front of the baby? Domestic assault in the presence of a minor could land him many years in prison. He needs to get caught doing something so there will be a record showing he&amp;#39;s not a stable dad and then he could be sent away for awhile unable to manipulate your daughter. Get him out of the picture somehow. Do not give your daughter any money or pay any bills or enable them in any way. Does he take drugs? Drive drunk? Anything else illegal? Maybe hire a private investigator to track him a possibly record him doing something illegal. Dunno...just a suggestion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcamcs", "score_hidden": false, "stickied": false, "created": 1492392257.0, "created_utc": 1492363457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc4swu", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "lostcollegehuman303", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Don't kill him, it's not worth your life being lost, but the minute he fucks up, the minute he does something illegal. Call the cops. Get on this stupid little boy who thinks he's a man berating your daughter. Work with your daughter, cause if he beats her now he's gonna eventually kill her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t kill him, it&amp;#39;s not worth your life being lost, but the minute he fucks up, the minute he does something illegal. Call the cops. Get on this stupid little boy who thinks he&amp;#39;s a man berating your daughter. Work with your daughter, cause if he beats her now he&amp;#39;s gonna eventually kill her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4swu", "score_hidden": false, "stickied": false, "created": 1492384488.0, "created_utc": 1492355688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc6qvc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "homeskillybiscuit", "parent_id": "t1_dgc6irh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm so glad to hear that. You are a very strong lady and I wish the best for your family! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so glad to hear that. You are a very strong lady and I wish the best for your family! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc6qvc", "score_hidden": false, "stickied": false, "created": 1492387150.0, "created_utc": 1492358350.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdapgv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "whatsthefussallabout", "parent_id": "t1_dgc6irh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Please let us know what happens! I hope its the wake up call she needs and if not at least ur grandson will be safe x", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please let us know what happens! I hope its the wake up call she needs and if not at least ur grandson will be safe x&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdapgv", "score_hidden": false, "stickied": false, "created": 1492448560.0, "created_utc": 1492419760.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6irh", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc5h6g", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes I agree, 100%  that I am enabling her. I have had a really hard time with this because I know the minute I walk away she's giving up because I'm the only support she has. She may not tell me what he does, but I can see in her eyes every time she comes. I know that she's not being a good mother and it's my job to go in and make sure that he is taken care of. I think we are going to give her the ultimatum that he stays with us and if she fights that,  I would go to court, to get custody. The fear I have is when I do that he will hurt her worse because of my actions.  \n\nBut definitely we are making her know that if she doesn't leave today we are going to keep my grandson. He's not going anywhere. Thank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I agree, 100%  that I am enabling her. I have had a really hard time with this because I know the minute I walk away she&amp;#39;s giving up because I&amp;#39;m the only support she has. She may not tell me what he does, but I can see in her eyes every time she comes. I know that she&amp;#39;s not being a good mother and it&amp;#39;s my job to go in and make sure that he is taken care of. I think we are going to give her the ultimatum that he stays with us and if she fights that,  I would go to court, to get custody. The fear I have is when I do that he will hurt her worse because of my actions.  &lt;/p&gt;\n\n&lt;p&gt;But definitely we are making her know that if she doesn&amp;#39;t leave today we are going to keep my grandson. He&amp;#39;s not going anywhere. Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc6irh", "score_hidden": false, "stickied": false, "created": 1492386848.0, "created_utc": 1492358048.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5h6g", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "homeskillybiscuit", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I am so sorry that this is happening to your family.  It's awful and definitely understandable that you would want to hurt him after everything he's put your daughter and grandson through. \n\nBut tough love, (and feel free to ignore my advice, just thought I should put it out there) you are enabling her.  Yes, ultimately it is her choice but if she makes it then she has to live with it.  Playing nice is just giving him power because he knows you won't do anything about it.  Put your foot down and tell her that you can't stand to see her being treated like this and if she chooses to stay with him that you can't help her anymore. \n\nAlso please think of your grandson. I know you love your daughter, and it's terrible that she's being manipulated this way, but if she's allowing him to be raised in that environment she is not a fit mother. There might be a way to sue for custody of the child, which might get your daughter to come to her senses and just come home. Either way, something to look into. \n\nShe's made her choice, but that little boy doesn't have the option to so please consider him first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry that this is happening to your family.  It&amp;#39;s awful and definitely understandable that you would want to hurt him after everything he&amp;#39;s put your daughter and grandson through. &lt;/p&gt;\n\n&lt;p&gt;But tough love, (and feel free to ignore my advice, just thought I should put it out there) you are enabling her.  Yes, ultimately it is her choice but if she makes it then she has to live with it.  Playing nice is just giving him power because he knows you won&amp;#39;t do anything about it.  Put your foot down and tell her that you can&amp;#39;t stand to see her being treated like this and if she chooses to stay with him that you can&amp;#39;t help her anymore. &lt;/p&gt;\n\n&lt;p&gt;Also please think of your grandson. I know you love your daughter, and it&amp;#39;s terrible that she&amp;#39;s being manipulated this way, but if she&amp;#39;s allowing him to be raised in that environment she is not a fit mother. There might be a way to sue for custody of the child, which might get your daughter to come to her senses and just come home. Either way, something to look into. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s made her choice, but that little boy doesn&amp;#39;t have the option to so please consider him first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc5h6g", "score_hidden": false, "stickied": false, "created": 1492385423.0, "created_utc": 1492356623.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc605k", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Doug_Step", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Get someone male you know to approach your daughter at the bar when they are together, sounds like this guy will pick a fight, get him to take a punch, have the bouncer step in, get the cunt jail time.  \nNot the nicest thought, but it sounds desperate", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get someone male you know to approach your daughter at the bar when they are together, sounds like this guy will pick a fight, get him to take a punch, have the bouncer step in, get the cunt jail time.&lt;br/&gt;\nNot the nicest thought, but it sounds desperate&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc605k", "score_hidden": false, "stickied": false, "created": 1492386146.0, "created_utc": 1492357346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcvj0e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgcv508", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I have been thinking of this. She has only had one boyfriend previously to him. She knows that I had a complicated teenage years and got pregnant with her, and I'm really open with her about that, but that's me and her. Not her dad and not others, she'd be one to do anything to make sure that something embarrassing or hurtful was known by others. He hates her having any friends. Anyone that takes the attention off him, or she pays attention to, regardless what it is, he's mad, either walking around acting tough talking shit, or whining like a baby. He's so obvious, and the fact that he doesn't care that he is, is terrifying. Most these guys do it in private, and act like their girlfriend is crazy but he just does it. All except hit her. Everything that's degrading except put his hands on her . ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been thinking of this. She has only had one boyfriend previously to him. She knows that I had a complicated teenage years and got pregnant with her, and I&amp;#39;m really open with her about that, but that&amp;#39;s me and her. Not her dad and not others, she&amp;#39;d be one to do anything to make sure that something embarrassing or hurtful was known by others. He hates her having any friends. Anyone that takes the attention off him, or she pays attention to, regardless what it is, he&amp;#39;s mad, either walking around acting tough talking shit, or whining like a baby. He&amp;#39;s so obvious, and the fact that he doesn&amp;#39;t care that he is, is terrifying. Most these guys do it in private, and act like their girlfriend is crazy but he just does it. All except hit her. Everything that&amp;#39;s degrading except put his hands on her . &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcvj0e", "score_hidden": false, "stickied": false, "created": 1492420076.0, "created_utc": 1492391276.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv508", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "oywiththepoodle", "parent_id": "t1_dgc892r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I am wondering what he has on her. Pictures or videos maybe that have her convinced no one will forgive her or love her if they come out.\n\n\nYou can't make her leave him but you can make she she knows no matter what horrific shit she did for whatever reason, you will never stop loving her. Victims of human trafficking have reported fear of going home because they believe the things they have been forced to do make them unloveable. Maybe she is afraid like that. I hope he goes to prison and you get your daughter back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am wondering what he has on her. Pictures or videos maybe that have her convinced no one will forgive her or love her if they come out.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t make her leave him but you can make she she knows no matter what horrific shit she did for whatever reason, you will never stop loving her. Victims of human trafficking have reported fear of going home because they believe the things they have been forced to do make them unloveable. Maybe she is afraid like that. I hope he goes to prison and you get your daughter back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcv508", "score_hidden": false, "stickied": false, "created": 1492419571.0, "created_utc": 1492390771.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc892r", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I agree and I know that I have enabled her. It is not easy actually it's the hardest thing that I've ever had to do. But you're right he has to come first and she's not being a good parent. We have kept him for the last couple weeks and he usually is with us on the weekends and during the week he stays a couple nights and I have him all day until 7 pm. Hes  usually  over there two nights a week, but this just can't happen anymore. He's not leaving today. If we have to call police, we are doing that. Thank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree and I know that I have enabled her. It is not easy actually it&amp;#39;s the hardest thing that I&amp;#39;ve ever had to do. But you&amp;#39;re right he has to come first and she&amp;#39;s not being a good parent. We have kept him for the last couple weeks and he usually is with us on the weekends and during the week he stays a couple nights and I have him all day until 7 pm. Hes  usually  over there two nights a week, but this just can&amp;#39;t happen anymore. He&amp;#39;s not leaving today. If we have to call police, we are doing that. Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc892r", "score_hidden": false, "stickied": false, "created": 1492389176.0, "created_utc": 1492360376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc8fmx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "christopher33445", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Please update us on what happens. I hope the best for you and your family ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please update us on what happens. I hope the best for you and your family &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8fmx", "score_hidden": false, "stickied": false, "created": 1492389419.0, "created_utc": 1492360619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd8kce", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheMadTemplar", "parent_id": "t1_dgc8f7q", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It depends on the state you're in, some are better than others. In MN when CPS was called repeatedly about a specific household, an investigation would be launched. It was prone to manipulation unfortunately, particularly if the parents knew the CPS people. But my extended family called CPS on my parents 4 times while I was growing up, and they launched an investigation twice into my parents because of the repeated calls. Unfortunately, my mom had us all scared so bad of the foster system none of the kids ever told of the abuse during the interviews. \n\nI digress. CPS is legally obligated to check in if complaints are made, and if you can personally talk to an agent face to face you stand a good chance at getting someone to go visit that week. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It depends on the state you&amp;#39;re in, some are better than others. In MN when CPS was called repeatedly about a specific household, an investigation would be launched. It was prone to manipulation unfortunately, particularly if the parents knew the CPS people. But my extended family called CPS on my parents 4 times while I was growing up, and they launched an investigation twice into my parents because of the repeated calls. Unfortunately, my mom had us all scared so bad of the foster system none of the kids ever told of the abuse during the interviews. &lt;/p&gt;\n\n&lt;p&gt;I digress. CPS is legally obligated to check in if complaints are made, and if you can personally talk to an agent face to face you stand a good chance at getting someone to go visit that week. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd8kce", "score_hidden": false, "stickied": false, "created": 1492441819.0, "created_utc": 1492413019.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8f7q", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That is hard because CPS doesn't get involved in less there's document of abuse. If the cops are called they both deny it. It's hard because there's a lot of parents that don't like the father of their grandchildren. There are a lot of calls that are called in that aren't true. Everything has to be documented. And it's not as easy as people think when you get CPS involved ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is hard because CPS doesn&amp;#39;t get involved in less there&amp;#39;s document of abuse. If the cops are called they both deny it. It&amp;#39;s hard because there&amp;#39;s a lot of parents that don&amp;#39;t like the father of their grandchildren. There are a lot of calls that are called in that aren&amp;#39;t true. Everything has to be documented. And it&amp;#39;s not as easy as people think when you get CPS involved &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8f7q", "score_hidden": false, "stickied": false, "created": 1492389403.0, "created_utc": 1492360603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdy6yo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anidealistmind", "parent_id": "t1_dgdgjex", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I don't think you did wrong in posting here. I'm glad my point of view was helpful. Before I was in that relationship I always thought to myself \"why do those women stay?!?\" I found out the hard way exactly how it happens. It took me years to finally understand the emotional abuse that was done along with the physical. Love and support your daughter, she is confused and scared. She is lying to everyone, including herself. Once she starts to accept the truth of her situation, she will be able to get away from this clearly disturbed individual. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you did wrong in posting here. I&amp;#39;m glad my point of view was helpful. Before I was in that relationship I always thought to myself &amp;quot;why do those women stay?!?&amp;quot; I found out the hard way exactly how it happens. It took me years to finally understand the emotional abuse that was done along with the physical. Love and support your daughter, she is confused and scared. She is lying to everyone, including herself. Once she starts to accept the truth of her situation, she will be able to get away from this clearly disturbed individual. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdy6yo", "score_hidden": false, "stickied": false, "created": 1492484929.0, "created_utc": 1492456129.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgjex", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgcnav7", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you so much for this this is probably the one comment I needed the most. This is an eye opening experience and I think I was wrong and posting it here but I did get some good advice and understanding.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for this this is probably the one comment I needed the most. This is an eye opening experience and I think I was wrong and posting it here but I did get some good advice and understanding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgjex", "score_hidden": false, "stickied": false, "created": 1492463634.0, "created_utc": 1492434834.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnav7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "anidealistmind", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'd just like to offer a point of view from abused daughter standpoint, you never know what to look for in an abusive relationship until after one. It takes a lot of courage, smarts, and encouragement to finally understand that you, yes smart you, somehow got into an abusive relationship. It doesn't start out him hitting you, first he distances you from everyone you love, as OP already noted. Then the psychological abuse starts, gaslighting is a common technique that makes the victim doubt their very own reality or point of view. Op, your daughter truly believes this is her fault, somehow the reason he treats her this way is due to her actions. It's not sane, it's the only reason why she stays when she is hit or treated like a dog. These are the wounds that will need to be addressed later on down the road once she is finally away. The only way for her to get free at this point is to somehow get through to her that she IS in an abusive relationship, she needs to accept that first. I'm so sorry you're having to go through this, it's not easy for you or her. Hopefully she sees the reality of her situation, don't be afraid to call domestic abuse help centers for advice or just release.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d just like to offer a point of view from abused daughter standpoint, you never know what to look for in an abusive relationship until after one. It takes a lot of courage, smarts, and encouragement to finally understand that you, yes smart you, somehow got into an abusive relationship. It doesn&amp;#39;t start out him hitting you, first he distances you from everyone you love, as OP already noted. Then the psychological abuse starts, gaslighting is a common technique that makes the victim doubt their very own reality or point of view. Op, your daughter truly believes this is her fault, somehow the reason he treats her this way is due to her actions. It&amp;#39;s not sane, it&amp;#39;s the only reason why she stays when she is hit or treated like a dog. These are the wounds that will need to be addressed later on down the road once she is finally away. The only way for her to get free at this point is to somehow get through to her that she IS in an abusive relationship, she needs to accept that first. I&amp;#39;m so sorry you&amp;#39;re having to go through this, it&amp;#39;s not easy for you or her. Hopefully she sees the reality of her situation, don&amp;#39;t be afraid to call domestic abuse help centers for advice or just release.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcnav7", "score_hidden": false, "stickied": false, "created": 1492408938.0, "created_utc": 1492380138.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc9tw4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Funny, as I'm sitting here and the piece of shit is across the room acting as if he's the greatest gift to mankind. I was thinking of what if anything I can put in his food to make him disappear. Bad thoughts! Bad thoughts! But made me laugh! Ty I needed that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Funny, as I&amp;#39;m sitting here and the piece of shit is across the room acting as if he&amp;#39;s the greatest gift to mankind. I was thinking of what if anything I can put in his food to make him disappear. Bad thoughts! Bad thoughts! But made me laugh! Ty I needed that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9tw4", "score_hidden": false, "stickied": false, "created": 1492391213.0, "created_utc": 1492362413.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd79ag", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AdrenalineEmily", "parent_id": "t1_dgd18uy", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I noticed the daughter has had a step dad - perhaps the other kids are step-kids? \n\nEdit\nI read the other thread and it does seem to imply they are all her bio-kids. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I noticed the daughter has had a step dad - perhaps the other kids are step-kids? &lt;/p&gt;\n\n&lt;p&gt;Edit\nI read the other thread and it does seem to imply they are all her bio-kids. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd79ag", "score_hidden": false, "stickied": false, "created": 1492438824.0, "created_utc": 1492410024.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd18uy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thebookiread", "parent_id": "t1_dgce6fk", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "In previous comments in another thread you said you have 3 kids, 22, 18, and 17. \n\nhttps://www.reddit.com/r/Anxiety/comments/60wp9d/does_anybody_else_plan_on_never_having_kids/dfaxu8u/", "edited": 1492399705.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In previous comments in another thread you said you have 3 kids, 22, 18, and 17. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/Anxiety/comments/60wp9d/does_anybody_else_plan_on_never_having_kids/dfaxu8u/\"&gt;https://www.reddit.com/r/Anxiety/comments/60wp9d/does_anybody_else_plan_on_never_having_kids/dfaxu8u/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd18uy", "score_hidden": false, "stickied": false, "created": 1492427937.0, "created_utc": 1492399137.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce6fk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She's an only child. When I had her I hemorrhaged real bad and had a full hysterectomy. \nMy brothers have took after him twice. Once at the wedding, he didn't learn. The second time my brother got him, he called the cops and my brother went to jail. We posted bond. They lowered the charges, but still has an assault on his record. \n\nIve thought about the camera idea. I have keys to the house, but it's illegal to do it and they couldn't use the videos as they would be obtained illegally. He's extremely smart in knowing what he can and can't do. Master manipulator and he's a real good liar. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s an only child. When I had her I hemorrhaged real bad and had a full hysterectomy. \nMy brothers have took after him twice. Once at the wedding, he didn&amp;#39;t learn. The second time my brother got him, he called the cops and my brother went to jail. We posted bond. They lowered the charges, but still has an assault on his record. &lt;/p&gt;\n\n&lt;p&gt;Ive thought about the camera idea. I have keys to the house, but it&amp;#39;s illegal to do it and they couldn&amp;#39;t use the videos as they would be obtained illegally. He&amp;#39;s extremely smart in knowing what he can and can&amp;#39;t do. Master manipulator and he&amp;#39;s a real good liar. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgce6fk", "score_hidden": false, "stickied": false, "created": 1492396992.0, "created_utc": 1492368192.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc8j1u", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc6cdw", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If she wasn't an adult this would be legal. Unfortunately the police will tell us, to stay away if she asks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she wasn&amp;#39;t an adult this would be legal. Unfortunately the police will tell us, to stay away if she asks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8j1u", "score_hidden": false, "stickied": false, "created": 1492389543.0, "created_utc": 1492360743.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6cdw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "katorulestheworld", "parent_id": "t1_dgc67js", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Instead of asking her to leave him, try making her. Just pick her up in the car with the kid, drive for hours, days. Take her out to the woods, take her phone off her, and then make her call a lawyer and start divorce proceedings.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instead of asking her to leave him, try making her. Just pick her up in the car with the kid, drive for hours, days. Take her out to the woods, take her phone off her, and then make her call a lawyer and start divorce proceedings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc6cdw", "score_hidden": false, "stickied": false, "created": 1492386609.0, "created_utc": 1492357809.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc67js", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc5bjk", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This scares the shit out of me because It's so true, especially in our town, there are calls all night long for assaults. The police themselves have told me and my husband that he is crazy and they hope she will find the strength to leave. I'm just waiting for that day. \n\nShe has so many opportunities to go to other states with my family and I have offered to leave with her. My husband and I have said we will pick up at any point in time and move. I have no doubt she's going to need a lot of therapy and that is there for her anytime she asks. I have given her multiple cell phones to hide throughout the house and I just pray that she uses them when she needs to. Removing her son from her is probably going to be our only option. I just fear what he will do to her when we do that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This scares the shit out of me because It&amp;#39;s so true, especially in our town, there are calls all night long for assaults. The police themselves have told me and my husband that he is crazy and they hope she will find the strength to leave. I&amp;#39;m just waiting for that day. &lt;/p&gt;\n\n&lt;p&gt;She has so many opportunities to go to other states with my family and I have offered to leave with her. My husband and I have said we will pick up at any point in time and move. I have no doubt she&amp;#39;s going to need a lot of therapy and that is there for her anytime she asks. I have given her multiple cell phones to hide throughout the house and I just pray that she uses them when she needs to. Removing her son from her is probably going to be our only option. I just fear what he will do to her when we do that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc67js", "score_hidden": false, "stickied": false, "created": 1492386429.0, "created_utc": 1492357629.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5bjk", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "katorulestheworld", "parent_id": "t1_dgc4r8r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "which is what he is relying on, everyone being too \"nice\". I can understand the cops attitude because how many times do they get called to a house to see a woman covered in bruises with a man smirking and cuts on his knuckles? I bet they know exactly how many phone calls its going to be until they arrive to find her dead body?\n\nthis guy is just waiting for her to inherit, at that point, if shes lucky, he'll drain the accounts and leave her. If shes lucky. On the other hand, you can explain to him in the only language he will understand, that he;s lost his right to be part of the family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;which is what he is relying on, everyone being too &amp;quot;nice&amp;quot;. I can understand the cops attitude because how many times do they get called to a house to see a woman covered in bruises with a man smirking and cuts on his knuckles? I bet they know exactly how many phone calls its going to be until they arrive to find her dead body?&lt;/p&gt;\n\n&lt;p&gt;this guy is just waiting for her to inherit, at that point, if shes lucky, he&amp;#39;ll drain the accounts and leave her. If shes lucky. On the other hand, you can explain to him in the only language he will understand, that he;s lost his right to be part of the family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc5bjk", "score_hidden": false, "stickied": false, "created": 1492385209.0, "created_utc": 1492356409.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4r8r", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc4jbr", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "And this is what scares the shit out of me, and this is real, and this is exactly what would happen. She can't even hold her head up she's not going to stand up for herself ever. And cops they get tired of it, they get tired of going to domestics when women go back home. And honestly they are not always the nicest. I am right with this thought of yours though. Because is anything other than this  avenue really going to work? without hurting everyone but him? Probably not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And this is what scares the shit out of me, and this is real, and this is exactly what would happen. She can&amp;#39;t even hold her head up she&amp;#39;s not going to stand up for herself ever. And cops they get tired of it, they get tired of going to domestics when women go back home. And honestly they are not always the nicest. I am right with this thought of yours though. Because is anything other than this  avenue really going to work? without hurting everyone but him? Probably not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4r8r", "score_hidden": false, "stickied": false, "created": 1492384423.0, "created_utc": 1492355623.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4jbr", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "katorulestheworld", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think I would pay someone to beat the shit out of him. When he gets out of hospital, have them do it again. And again. And again. Until he leaves.\n\nYour daughter will let him kill her, she wont leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I would pay someone to beat the shit out of him. When he gets out of hospital, have them do it again. And again. And again. Until he leaves.&lt;/p&gt;\n\n&lt;p&gt;Your daughter will let him kill her, she wont leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4jbr", "score_hidden": false, "stickied": false, "created": 1492384107.0, "created_utc": 1492355307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcciag", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bittersweetdromedary", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Tell her what you just said, about how every time you hear sirens you worry that it's an ambulance coming for her. Tell her you know she feels that she needs to protect her boyfriend, but her child is the one who actually needs protection. Tell her she is very close to losing her child forever. Don't sugarcoat it. There's support, and then there's enabling. \n\nFrom now on, every single incident needs to result in a call to the police. She will fight you and be pissed at you, but a pissed off daughter is better than a dead one. Her life needs to be #1 priority right now. Her happiness is something you can work on once her abuser is out of the picture. \n\nI think emphasizing the safety of her and her child is the best way for her to wake up. She made the choice to be with him, but her poor child certainly didn't. It's not fair of her to stay with a dangerous man when she has a young child. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell her what you just said, about how every time you hear sirens you worry that it&amp;#39;s an ambulance coming for her. Tell her you know she feels that she needs to protect her boyfriend, but her child is the one who actually needs protection. Tell her she is very close to losing her child forever. Don&amp;#39;t sugarcoat it. There&amp;#39;s support, and then there&amp;#39;s enabling. &lt;/p&gt;\n\n&lt;p&gt;From now on, every single incident needs to result in a call to the police. She will fight you and be pissed at you, but a pissed off daughter is better than a dead one. Her life needs to be #1 priority right now. Her happiness is something you can work on once her abuser is out of the picture. &lt;/p&gt;\n\n&lt;p&gt;I think emphasizing the safety of her and her child is the best way for her to wake up. She made the choice to be with him, but her poor child certainly didn&amp;#39;t. It&amp;#39;s not fair of her to stay with a dangerous man when she has a young child. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcciag", "score_hidden": false, "stickied": false, "created": 1492394744.0, "created_utc": 1492365944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcektr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "craniumblood", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "My only recommendation is to get legal advice in taking custody of your grandson. My father did so because my brother and his girlfriend were drug users. With all the police calls, reports and witness testimonies it will not be hard to get custody of your grandson. Your daughter will most likely be very upset with you but she needs to learn to change and that environment is not safe for your grandson. He needs to be your first priority. Eventually your daughter will realize what's going on and will (hopefully) leave him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My only recommendation is to get legal advice in taking custody of your grandson. My father did so because my brother and his girlfriend were drug users. With all the police calls, reports and witness testimonies it will not be hard to get custody of your grandson. Your daughter will most likely be very upset with you but she needs to learn to change and that environment is not safe for your grandson. He needs to be your first priority. Eventually your daughter will realize what&amp;#39;s going on and will (hopefully) leave him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcektr", "score_hidden": false, "stickied": false, "created": 1492397537.0, "created_utc": 1492368737.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcerft", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "We are doing this after we tell her that we are going to keep her son until she can protect him.  Sadly that's not until she leaves or takes the steps to charge him and moves home.  I just can't take the chance of her having her own home right now. She'll lie for him. I cannot trust to leave that little boy there ever until I know 100% he's never coming back. So her options aren't anything other than moving home or with a family member until she goes through intense therapy and we will take care of all the needs and financial needs of her home until  then. Thank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We are doing this after we tell her that we are going to keep her son until she can protect him.  Sadly that&amp;#39;s not until she leaves or takes the steps to charge him and moves home.  I just can&amp;#39;t take the chance of her having her own home right now. She&amp;#39;ll lie for him. I cannot trust to leave that little boy there ever until I know 100% he&amp;#39;s never coming back. So her options aren&amp;#39;t anything other than moving home or with a family member until she goes through intense therapy and we will take care of all the needs and financial needs of her home until  then. Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcerft", "score_hidden": false, "stickied": false, "created": 1492397781.0, "created_utc": 1492368981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcaejn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sanguinaria4711", "parent_id": "t1_dgc9moz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If you have the means, then do it. I wouldn't give up hope for your daughter, but someone needs to think of your grandson's well-being first and foremost. He does not need to be raised in such a toxic atmosphere. I wonder if you didn't have him so much if he would be getting hit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you have the means, then do it. I wouldn&amp;#39;t give up hope for your daughter, but someone needs to think of your grandson&amp;#39;s well-being first and foremost. He does not need to be raised in such a toxic atmosphere. I wonder if you didn&amp;#39;t have him so much if he would be getting hit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcaejn", "score_hidden": false, "stickied": false, "created": 1492391974.0, "created_utc": 1492363174.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9moz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc981l", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I don't think he's hit him. I have him everyday sometimes for weeks. I've had him now for 2 weeks and have no plans of letting him leave. We're telling her the choice is hers to leave but that I've made the choice about her son. I know she won't fight us because we have the means to go to court and win, and we will do this. His egotistical ass will try some shady stuff and might make waves but I don't think his mother can fight as long as we can. I just hope she doesn't stay and give up. All I can do is pray.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think he&amp;#39;s hit him. I have him everyday sometimes for weeks. I&amp;#39;ve had him now for 2 weeks and have no plans of letting him leave. We&amp;#39;re telling her the choice is hers to leave but that I&amp;#39;ve made the choice about her son. I know she won&amp;#39;t fight us because we have the means to go to court and win, and we will do this. His egotistical ass will try some shady stuff and might make waves but I don&amp;#39;t think his mother can fight as long as we can. I just hope she doesn&amp;#39;t stay and give up. All I can do is pray.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9moz", "score_hidden": false, "stickied": false, "created": 1492390951.0, "created_utc": 1492362151.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc981l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sanguinaria4711", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Do you know if he has ever hit your grandson? Your daughter may not want to press charges, but she's an adult and has to live with the consequences of her actions. Your grandson, however, is an innocent, and if he's getting hurt because of it (besides the obvious psychological issues he's likely developing from that toxic environment)... personally, I'd do the jail time with a smile on my face, assuming I left enough of him to identify, but you have to think of your grandson's well-being, since unfortunately your daughter isn't. \n\nBest I can suggest, document whatever you can and file charges. Every time. You're going to have to file charges against your own daughter, too, which will be the hard part as she's also a victim, but as I said, right now she is not thinking of her son's well-being, and that cannot be allowed to continue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you know if he has ever hit your grandson? Your daughter may not want to press charges, but she&amp;#39;s an adult and has to live with the consequences of her actions. Your grandson, however, is an innocent, and if he&amp;#39;s getting hurt because of it (besides the obvious psychological issues he&amp;#39;s likely developing from that toxic environment)... personally, I&amp;#39;d do the jail time with a smile on my face, assuming I left enough of him to identify, but you have to think of your grandson&amp;#39;s well-being, since unfortunately your daughter isn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Best I can suggest, document whatever you can and file charges. Every time. You&amp;#39;re going to have to file charges against your own daughter, too, which will be the hard part as she&amp;#39;s also a victim, but as I said, right now she is not thinking of her son&amp;#39;s well-being, and that cannot be allowed to continue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc981l", "score_hidden": false, "stickied": false, "created": 1492390440.0, "created_utc": 1492361640.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd22wg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bloodycardigan", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Have her written out of the will and all trusts going to your grandson at 25. The loser will peace out in no time. He's playing the long game and waiting for her to be wealthy so he can suck that money dry too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have her written out of the will and all trusts going to your grandson at 25. The loser will peace out in no time. He&amp;#39;s playing the long game and waiting for her to be wealthy so he can suck that money dry too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd22wg", "score_hidden": false, "stickied": false, "created": 1492429152.0, "created_utc": 1492400352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgccrvf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "The-Ham-Bummer", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Go to the police with your story.\nAsk them who they recommend as a private eye to gather evidence. Gather evidence. \nAs for today, maybe go to the police now, with boy and contact of all people who can informally confirm your story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to the police with your story.\nAsk them who they recommend as a private eye to gather evidence. Gather evidence. \nAs for today, maybe go to the police now, with boy and contact of all people who can informally confirm your story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgccrvf", "score_hidden": false, "stickied": false, "created": 1492395102.0, "created_utc": 1492366302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgchy2v", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "StinkyDogFarts", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If you broke my front teeth by hitting me at a bar, you're going to jail. I stopped reading about there... The credibility is waning. Or everyone involved is dense as a block. I don't like anyone enough to let their spouse knock my teeth out and not get authorities involved. If true, start getting the police involved and rip him away from her. She can keep him in sticky buns and honey pies from commissary with her trust fund. \n\nFeel free to agitate him... Get him to hit you. That's out of your daughters hands and press full charges. He will lose custody or at least the restraining order will keep him away when you have the child, if he shows up call police immediately. Get him a record going. He's a woman beater. He will start beating your grandchild, promise. Your daughter is going to blame you for a while... She needs therapy to realise what's really going on. ", "edited": 1492373413.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you broke my front teeth by hitting me at a bar, you&amp;#39;re going to jail. I stopped reading about there... The credibility is waning. Or everyone involved is dense as a block. I don&amp;#39;t like anyone enough to let their spouse knock my teeth out and not get authorities involved. If true, start getting the police involved and rip him away from her. She can keep him in sticky buns and honey pies from commissary with her trust fund. &lt;/p&gt;\n\n&lt;p&gt;Feel free to agitate him... Get him to hit you. That&amp;#39;s out of your daughters hands and press full charges. He will lose custody or at least the restraining order will keep him away when you have the child, if he shows up call police immediately. Get him a record going. He&amp;#39;s a woman beater. He will start beating your grandchild, promise. Your daughter is going to blame you for a while... She needs therapy to realise what&amp;#39;s really going on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgchy2v", "score_hidden": false, "stickied": false, "created": 1492401953.0, "created_utc": 1492373153.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc3y8q", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "tfresca", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "May I suggest a too long didn't read here? Is the basic gist that she's with an abusive asshole and won't/can't leave? You are under no obligation not to call the police. Not addressing this situation is not helping her. Not calling the cops is not helping her. \n\nI think it's possible to let her know that you love and support her and will help her leave this situation when she's ready but you aren't going to enable her to stay with an abusive piece of shit or subject your grandson to it. Call the cops. If he gets a record you could probably petition for custody. Abusive husbands are often abusive dads too. ", "edited": 1492354712.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;May I suggest a too long didn&amp;#39;t read here? Is the basic gist that she&amp;#39;s with an abusive asshole and won&amp;#39;t/can&amp;#39;t leave? You are under no obligation not to call the police. Not addressing this situation is not helping her. Not calling the cops is not helping her. &lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s possible to let her know that you love and support her and will help her leave this situation when she&amp;#39;s ready but you aren&amp;#39;t going to enable her to stay with an abusive piece of shit or subject your grandson to it. Call the cops. If he gets a record you could probably petition for custody. Abusive husbands are often abusive dads too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc3y8q", "score_hidden": false, "stickied": false, "created": 1492383227.0, "created_utc": 1492354427.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgci76g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgcf6cv", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Great point, she may thing she is protecting everyoen by staying with him. When you live in fear for years, things no longer need to be logical and the fear feeds on itself. Let us know how things go, don't get yourself in jail! and help that little grandkid the best you can. good luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great point, she may thing she is protecting everyoen by staying with him. When you live in fear for years, things no longer need to be logical and the fear feeds on itself. Let us know how things go, don&amp;#39;t get yourself in jail! and help that little grandkid the best you can. good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgci76g", "score_hidden": false, "stickied": false, "created": 1492402276.0, "created_utc": 1492373476.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf6cv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc92u0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "When she's not around him, she's my daughter, she's tired but she talks about totally different things. But when she's also with me he constantly calls and texts he will blow up her Facebook messenger 1 million times until she answers. if she doesn't answer, he gets on mine. I have tried being nice to him about it I have tried being a psycho mother about it I have tried just disregarding it and the only thing that's work sometimes is being nice. She says it only makes it worse for her because it adds more shit that she has to explain and it's never the right answer.\n\nI wholeheartedly believe she knows this is bad bad. I think she's waiting for someone to do something because she's too weak to do it. Like when my brother did it she almost was relieved. But he gets out and I think that's what she's afraid of to cross that line one final time. He has told her he has established residency in her home and he has, however if it's domestic violence no judge in the world is going to say he can stay there with her until we can evict him. She's the type of girl that has to know 100% if you know what I mean if it is not black-and-white she's not going to count on it. So what I'm gathering from her is she has to know 100% that he is never going to come back around and she would leave. I'm sure that he is threatened horrible things to do to us, I have said I am not one bit scared but she's not believing that.  So he has her scared of something, I just don't know what", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When she&amp;#39;s not around him, she&amp;#39;s my daughter, she&amp;#39;s tired but she talks about totally different things. But when she&amp;#39;s also with me he constantly calls and texts he will blow up her Facebook messenger 1 million times until she answers. if she doesn&amp;#39;t answer, he gets on mine. I have tried being nice to him about it I have tried being a psycho mother about it I have tried just disregarding it and the only thing that&amp;#39;s work sometimes is being nice. She says it only makes it worse for her because it adds more shit that she has to explain and it&amp;#39;s never the right answer.&lt;/p&gt;\n\n&lt;p&gt;I wholeheartedly believe she knows this is bad bad. I think she&amp;#39;s waiting for someone to do something because she&amp;#39;s too weak to do it. Like when my brother did it she almost was relieved. But he gets out and I think that&amp;#39;s what she&amp;#39;s afraid of to cross that line one final time. He has told her he has established residency in her home and he has, however if it&amp;#39;s domestic violence no judge in the world is going to say he can stay there with her until we can evict him. She&amp;#39;s the type of girl that has to know 100% if you know what I mean if it is not black-and-white she&amp;#39;s not going to count on it. So what I&amp;#39;m gathering from her is she has to know 100% that he is never going to come back around and she would leave. I&amp;#39;m sure that he is threatened horrible things to do to us, I have said I am not one bit scared but she&amp;#39;s not believing that.  So he has her scared of something, I just don&amp;#39;t know what&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcf6cv", "score_hidden": false, "stickied": false, "created": 1492398331.0, "created_utc": 1492369531.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc92u0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "scratchingcats", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Dear god, I can't believe all your poor daughter and yourself have gone through. It sounds like you really have done everything to try to support her, but she needs to wake up. How does she act when he is not around? Does she accept that he is abusive? Does she accept that she is afraid? What does she think has to happen for her to break things off? For him to hurt her or the child? I know you are afraid of the state taking the kid, but honestly, I don't see how else that baby can be protected. If your daughter ever makes it to this conclusion, she needs to fie for divorce and a restraining order simultaneously and ask for help to protect her kid. It's insane how someone can completely ruin a whole family. Please I know it' shard, but you can't get your hands dirty for this guy, there has to be another way. And also, do not enable them. Make it clear to your daughter that you will be there when she is ready to leave him, but hosting easter for them, bailing out of their debts, and any of that has to stop. She has to realize this is more than just direct mistreatment from this guy (which clearly she has resigned herself to), she has to understand this is literally breaking your whole family apart, and you can't let that happen. Again, be there for her, tell her she can call and visit whenever, and that she is welcome to come back home anytime, but you need to set some boundaries or your husband or siblings will beat this guy senseless and shit is jsut going to get worse. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dear god, I can&amp;#39;t believe all your poor daughter and yourself have gone through. It sounds like you really have done everything to try to support her, but she needs to wake up. How does she act when he is not around? Does she accept that he is abusive? Does she accept that she is afraid? What does she think has to happen for her to break things off? For him to hurt her or the child? I know you are afraid of the state taking the kid, but honestly, I don&amp;#39;t see how else that baby can be protected. If your daughter ever makes it to this conclusion, she needs to fie for divorce and a restraining order simultaneously and ask for help to protect her kid. It&amp;#39;s insane how someone can completely ruin a whole family. Please I know it&amp;#39; shard, but you can&amp;#39;t get your hands dirty for this guy, there has to be another way. And also, do not enable them. Make it clear to your daughter that you will be there when she is ready to leave him, but hosting easter for them, bailing out of their debts, and any of that has to stop. She has to realize this is more than just direct mistreatment from this guy (which clearly she has resigned herself to), she has to understand this is literally breaking your whole family apart, and you can&amp;#39;t let that happen. Again, be there for her, tell her she can call and visit whenever, and that she is welcome to come back home anytime, but you need to set some boundaries or your husband or siblings will beat this guy senseless and shit is jsut going to get worse. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc92u0", "score_hidden": false, "stickied": false, "created": 1492390262.0, "created_utc": 1492361462.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcqhhe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "amateursexoffender", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I highly suggest showing a copy of this post to your daughter. It makes me so sad that she's thrown away her future for this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I highly suggest showing a copy of this post to your daughter. It makes me so sad that she&amp;#39;s thrown away her future for this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcqhhe", "score_hidden": false, "stickied": false, "created": 1492413287.0, "created_utc": 1492384487.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcug2i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cRaZyDaVe23", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Have the guy have an accident.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have the guy have an accident.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcug2i", "score_hidden": false, "stickied": false, "created": 1492418646.0, "created_utc": 1492389846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcad5u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mrtheboyfull", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Well I'm not sure if this is a right thing to say, but why don't you try and setup some hidden cameras on her home? If you can get access to it a day that they both are out , hire a PI or something to setup the cameras for your or try and do it yourself but just try and get low profile cameras and if it's Wi-Fi enabled even better so you can record to a remote location in case they are discovered.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;m not sure if this is a right thing to say, but why don&amp;#39;t you try and setup some hidden cameras on her home? If you can get access to it a day that they both are out , hire a PI or something to setup the cameras for your or try and do it yourself but just try and get low profile cameras and if it&amp;#39;s Wi-Fi enabled even better so you can record to a remote location in case they are discovered.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcad5u", "score_hidden": false, "stickied": false, "created": 1492391923.0, "created_utc": 1492363123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgccgjk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Relationships_shit", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "For fucks sake why haven't her brothers beaten the shit out of him yet, if this was my sister I would be sitting in prison right now \n\nDo you have access to his house? If you do you need to buy small cameras and bug the house so you have evidence of him putting both your daughter and grand daughter in harmful situations, and in this instance don't worry about trespass or two party consent, all of that is thrown out of the window when it comes to children \n\nShe's keeps going back because she's addicted to him, simply put she's a lot like a gambling addict all of the losses are worth the high she gets from a win, for example she will take all of the beating and the berating because the time that he's sweet to her is worth it, you need to look in to gambling addiction and read up on how to get over them and then support her when you bring her back\n\nHe's going to get worse and worse, and soon enough you'll be licking up the phone and the officer on the other side will be telling you that he's sorry for your loss", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For fucks sake why haven&amp;#39;t her brothers beaten the shit out of him yet, if this was my sister I would be sitting in prison right now &lt;/p&gt;\n\n&lt;p&gt;Do you have access to his house? If you do you need to buy small cameras and bug the house so you have evidence of him putting both your daughter and grand daughter in harmful situations, and in this instance don&amp;#39;t worry about trespass or two party consent, all of that is thrown out of the window when it comes to children &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s keeps going back because she&amp;#39;s addicted to him, simply put she&amp;#39;s a lot like a gambling addict all of the losses are worth the high she gets from a win, for example she will take all of the beating and the berating because the time that he&amp;#39;s sweet to her is worth it, you need to look in to gambling addiction and read up on how to get over them and then support her when you bring her back&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s going to get worse and worse, and soon enough you&amp;#39;ll be licking up the phone and the officer on the other side will be telling you that he&amp;#39;s sorry for your loss&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgccgjk", "score_hidden": false, "stickied": false, "created": 1492394679.0, "created_utc": 1492365879.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgci1jy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "headphonez", "parent_id": "t1_dgcegwx", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Your attention-seeking posts in this thread are pitifully obsessive. You are essentially begging for it at this point. Come on, man. Surely you've got something better to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your attention-seeking posts in this thread are pitifully obsessive. You are essentially begging for it at this point. Come on, man. Surely you&amp;#39;ve got something better to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgci1jy", "score_hidden": false, "stickied": false, "created": 1492402077.0, "created_utc": 1492373277.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcegwx", "gilded": 0, "archived": false, "score": -10, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgcdxtg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; I can imagine what you are going through. I can imagine what your daughter is going through. I have no advice to offer except that you shouldnt have had a kid at 15. I am just not sorry this is happening to all of you because its your fault. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I can imagine what you are going through. I can imagine what your daughter is going through. I have no advice to offer except that you shouldnt have had a kid at 15. I am just not sorry this is happening to all of you because its your fault. &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcegwx", "score_hidden": false, "stickied": false, "created": 1492397386.0, "created_utc": 1492368586.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdxtg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ILoveLucilleAustero", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I cannot imagine what you are going through. I cannot imagine what your daughter is going through. I have no advice to offer as it seems you are doing your best to do what is right in this situation. I am just so sorry this is happening to all of you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cannot imagine what you are going through. I cannot imagine what your daughter is going through. I have no advice to offer as it seems you are doing your best to do what is right in this situation. I am just so sorry this is happening to all of you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcdxtg", "score_hidden": false, "stickied": false, "created": 1492396674.0, "created_utc": 1492367874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc6iq5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "charlie6969", "parent_id": "t1_dgc496h", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Your grandson is living in a chaotic and violent household. You KNOW, from your daughters actions, what is going on.\n\nNO ONE is protecting that child! I know your daughter is YOUR baby, but YOUR baby is an adult. You have no actual control over her actions and her actions, by staying with an abuser, is placing your grandson in the middle of domestic violence Hell!\n\nLook, I know this sounds incredibly harsh, but your daughter needs to choose between her abuser and her child, because that baby CANNOT stay in a violent household when you know there is violence going on! If you know about abuse in the home and you don't tell Children's Services, then you are being complicit in child abuse by not reporting it! (Actually, that might just be for court-mandated reporters)\nTaking that child out of that home and keeping him safe is the only thing that you can actually DO to help your daughter, as long as her abuser has her under his control.\n\n\nPlease, take care of that baby FIRST! The adults have to ACCEPT help.\n\nI am so, so sorry that this is happening to your family. *hugs if wanted*\n\n**edit: I've been watching too much Dr. Phil. But, you might try checking out his website for places to call for help. Good luck; you're a good Mom and Grandmom.**", "edited": 1492359112.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your grandson is living in a chaotic and violent household. You KNOW, from your daughters actions, what is going on.&lt;/p&gt;\n\n&lt;p&gt;NO ONE is protecting that child! I know your daughter is YOUR baby, but YOUR baby is an adult. You have no actual control over her actions and her actions, by staying with an abuser, is placing your grandson in the middle of domestic violence Hell!&lt;/p&gt;\n\n&lt;p&gt;Look, I know this sounds incredibly harsh, but your daughter needs to choose between her abuser and her child, because that baby CANNOT stay in a violent household when you know there is violence going on! If you know about abuse in the home and you don&amp;#39;t tell Children&amp;#39;s Services, then you are being complicit in child abuse by not reporting it! (Actually, that might just be for court-mandated reporters)\nTaking that child out of that home and keeping him safe is the only thing that you can actually DO to help your daughter, as long as her abuser has her under his control.&lt;/p&gt;\n\n&lt;p&gt;Please, take care of that baby FIRST! The adults have to ACCEPT help.&lt;/p&gt;\n\n&lt;p&gt;I am so, so sorry that this is happening to your family. &lt;em&gt;hugs if wanted&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit: I&amp;#39;ve been watching too much Dr. Phil. But, you might try checking out his website for places to call for help. Good luck; you&amp;#39;re a good Mom and Grandmom.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc6iq5", "score_hidden": false, "stickied": false, "created": 1492386847.0, "created_utc": 1492358047.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc496h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc38zj", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you, sadly, I'm thinking that's all we can do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, sadly, I&amp;#39;m thinking that&amp;#39;s all we can do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc496h", "score_hidden": false, "stickied": false, "created": 1492383685.0, "created_utc": 1492354885.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc38zj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theconnorssc", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "Praying for you ❤", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Praying for you ❤&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc38zj", "score_hidden": false, "stickied": false, "created": 1492382152.0, "created_utc": 1492353352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc89v0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc89v0", "score_hidden": false, "stickied": false, "created": 1492389205.0, "created_utc": 1492360405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd3ia6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AdrenalineEmily", "parent_id": "t1_dgcgtxf", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I would like to know the state. And do NOT record them in their own home. Unless you own said home. Not only is it not usable as evidence, but its illegal. You can also be sued for it. Its a civil tort. And the jury would never hear you recorded them. It would be kept out of trial. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would like to know the state. And do NOT record them in their own home. Unless you own said home. Not only is it not usable as evidence, but its illegal. You can also be sued for it. Its a civil tort. And the jury would never hear you recorded them. It would be kept out of trial. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd3ia6", "score_hidden": false, "stickied": false, "created": 1492431442.0, "created_utc": 1492402642.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcgtxf", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Relationships_shit", "parent_id": "t1_dgceccz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Wrong you have money and there is a childs life in the line, make sure you have a good lawyer and it will be pushed to jury, do you really think that a jury is going to care that you recorded him in his home\n\nQuick Q, what state do you live in if you willing to share? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wrong you have money and there is a childs life in the line, make sure you have a good lawyer and it will be pushed to jury, do you really think that a jury is going to care that you recorded him in his home&lt;/p&gt;\n\n&lt;p&gt;Quick Q, what state do you live in if you willing to share? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcgtxf", "score_hidden": false, "stickied": false, "created": 1492400506.0, "created_utc": 1492371706.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgceccz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": " Yes I have thought of that and in looking at the lies it is illegal and I couldn't use it as any evidence and I would be charged. It's illegal to record in someone's home without both of them having knowledge. Because I do not own the home I would be arrested and charged with a felony he. Of course the felony would be worth it however, it wouldn't help my child  They couldn't use it as evidence . We have them in our home outside our home and inside but we have to have signs that say that surveillance is in use in the home and outside.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I have thought of that and in looking at the lies it is illegal and I couldn&amp;#39;t use it as any evidence and I would be charged. It&amp;#39;s illegal to record in someone&amp;#39;s home without both of them having knowledge. Because I do not own the home I would be arrested and charged with a felony he. Of course the felony would be worth it however, it wouldn&amp;#39;t help my child  They couldn&amp;#39;t use it as evidence . We have them in our home outside our home and inside but we have to have signs that say that surveillance is in use in the home and outside.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgceccz", "score_hidden": false, "stickied": false, "created": 1492397210.0, "created_utc": 1492368410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcl4ax", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AdrenalineEmily", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Theres a lot of help available on the internet about temp guardianship. Check this out \n http://uwc.211ct.org/kinship-caregiversgrandparents-raising-grandchildrencustodial-relatives/\n\nIMMEDIATE TEMPORARY CUSTODY - I would check this out. It is good for five business days. I would consider going to your local police station and asking for a cop who could speak with you regarding a unreported DV issue. Some states charges maybe filed without her consent. Some states she must be a complaining victim. It varies. \n\nIf you are comfortable can you provide the state y'all are in? I am happy to help you look up DV laws etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Theres a lot of help available on the internet about temp guardianship. Check this out \n &lt;a href=\"http://uwc.211ct.org/kinship-caregiversgrandparents-raising-grandchildrencustodial-relatives/\"&gt;http://uwc.211ct.org/kinship-caregiversgrandparents-raising-grandchildrencustodial-relatives/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;IMMEDIATE TEMPORARY CUSTODY - I would check this out. It is good for five business days. I would consider going to your local police station and asking for a cop who could speak with you regarding a unreported DV issue. Some states charges maybe filed without her consent. Some states she must be a complaining victim. It varies. &lt;/p&gt;\n\n&lt;p&gt;If you are comfortable can you provide the state y&amp;#39;all are in? I am happy to help you look up DV laws etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcl4ax", "score_hidden": false, "stickied": false, "created": 1492406071.0, "created_utc": 1492377271.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcmn33", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deltadal", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Call Child Protective Services. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call Child Protective Services. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcmn33", "score_hidden": false, "stickied": false, "created": 1492408057.0, "created_utc": 1492379257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcvr5i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xelaandra23", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This is how all the guys in rap and hip hop talk - literally just about all of the mainstream guys every kid hears on the radio. It's not surprising that everyday guys think it's OK if that's the type of music/language/attitudes they were raised on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is how all the guys in rap and hip hop talk - literally just about all of the mainstream guys every kid hears on the radio. It&amp;#39;s not surprising that everyday guys think it&amp;#39;s OK if that&amp;#39;s the type of music/language/attitudes they were raised on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcvr5i", "score_hidden": false, "stickied": false, "created": 1492420372.0, "created_utc": 1492391572.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcvtjq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TParis00ap", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Honestly, it's time to go to jail.  Let him know you're ready, and you look good in orange.\n\nEdit: My advice is purely validation of your feelings, do not take it literally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, it&amp;#39;s time to go to jail.  Let him know you&amp;#39;re ready, and you look good in orange.&lt;/p&gt;\n\n&lt;p&gt;Edit: My advice is purely validation of your feelings, do not take it literally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcvtjq", "score_hidden": false, "stickied": false, "created": 1492420457.0, "created_utc": 1492391657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcx342", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frosttenchi", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Maybe some things in here will help, although intended for a slightly younger audience: http://www.scarleteen.com/article/abuse_assault/why_i_deeply_dislike_your_older_boyfriend", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe some things in here will help, although intended for a slightly younger audience: &lt;a href=\"http://www.scarleteen.com/article/abuse_assault/why_i_deeply_dislike_your_older_boyfriend\"&gt;http://www.scarleteen.com/article/abuse_assault/why_i_deeply_dislike_your_older_boyfriend&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcx342", "score_hidden": false, "stickied": false, "created": 1492422094.0, "created_utc": 1492393294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd0dza", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Manderspls", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "First of all, I read this entire thing and it made me absolutely sick to my stomach... I'm disgusted that someone can treat someone like this, and you have to sit back and watch it.. not at all do I blame you for having those horrible thoughts, it is completely justified but it is a very bad idea if they are put to action.\n\n\nSecondly, I am very very very sorry this is happening... It breaks my heart. It makes me dear what would happen if my mother or myself were in that position and it scares the absolute shit out of me. I've never ready something on here that's made me feel so awful and I hope to god things go better for you and your family. My heart and thoughts go out to you all, and your daughter in hopes that she finds her way back to you, and back to herself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I read this entire thing and it made me absolutely sick to my stomach... I&amp;#39;m disgusted that someone can treat someone like this, and you have to sit back and watch it.. not at all do I blame you for having those horrible thoughts, it is completely justified but it is a very bad idea if they are put to action.&lt;/p&gt;\n\n&lt;p&gt;Secondly, I am very very very sorry this is happening... It breaks my heart. It makes me dear what would happen if my mother or myself were in that position and it scares the absolute shit out of me. I&amp;#39;ve never ready something on here that&amp;#39;s made me feel so awful and I hope to god things go better for you and your family. My heart and thoughts go out to you all, and your daughter in hopes that she finds her way back to you, and back to herself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd0dza", "score_hidden": false, "stickied": false, "created": 1492426702.0, "created_utc": 1492397902.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd1kv9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DrinkVictoryGin", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I have immense empathy for you. I have a cousin who hasn't seen the family in nearly 20 yrs because she married a man like this right out of college. \n\nCall a lawyer first. Find out what your rights are as a grandparent. \n\nIn so sorry for you to be going through this. Your grandson is lucky to have you looking out for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have immense empathy for you. I have a cousin who hasn&amp;#39;t seen the family in nearly 20 yrs because she married a man like this right out of college. &lt;/p&gt;\n\n&lt;p&gt;Call a lawyer first. Find out what your rights are as a grandparent. &lt;/p&gt;\n\n&lt;p&gt;In so sorry for you to be going through this. Your grandson is lucky to have you looking out for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd1kv9", "score_hidden": false, "stickied": false, "created": 1492428416.0, "created_utc": 1492399616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd62ls", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yolo20152016", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Call CPS and have your bouncers call anonymously. Have everyone you know call. Get temp custody of the baby. Your sister is a doctor have her call and testify. Next, time your daughter is hit call the police and demand he be arrested. If they don't do anything call the states attorney and report it. \n\nYou're much calmer than I am. I would have put him through a wall and played high five to his face a couple dozen times. Thick phone books and baseball bats don't leave heavy marks and bruises. FYI. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call CPS and have your bouncers call anonymously. Have everyone you know call. Get temp custody of the baby. Your sister is a doctor have her call and testify. Next, time your daughter is hit call the police and demand he be arrested. If they don&amp;#39;t do anything call the states attorney and report it. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re much calmer than I am. I would have put him through a wall and played high five to his face a couple dozen times. Thick phone books and baseball bats don&amp;#39;t leave heavy marks and bruises. FYI. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd62ls", "score_hidden": false, "stickied": false, "created": 1492436281.0, "created_utc": 1492407481.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd8nrv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Prufrock82", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I feel for you as someone i love was i  a bad situation so i know how heartbraking. Domestic violence carries on because the perpetrator wears someone's self esteem down so much and the narrative he has built up is that he is the only person that loves her. You need to try and build it up again- remind her that you live her and believe in her. Contact her old friends and ask them to reach out to her. Think about everything in your power to help her perspective from films and books which show up DV storylines or even better kids that free up in DV situations (which you can subtly get her to see) - to people who have witnessed there things tell her how awful it is. \nI agree you need to get her away from him but DV so hard to prove if she doesn't want to press charges &amp; victims hardly ever do. If he has such a cavalier attitude to the law surely this can't be the only way he breaks it. For example does he do drugs or drink drive? Think about when he is most likely to be in possession or driving drunk and report him? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel for you as someone i love was i  a bad situation so i know how heartbraking. Domestic violence carries on because the perpetrator wears someone&amp;#39;s self esteem down so much and the narrative he has built up is that he is the only person that loves her. You need to try and build it up again- remind her that you live her and believe in her. Contact her old friends and ask them to reach out to her. Think about everything in your power to help her perspective from films and books which show up DV storylines or even better kids that free up in DV situations (which you can subtly get her to see) - to people who have witnessed there things tell her how awful it is. \nI agree you need to get her away from him but DV so hard to prove if she doesn&amp;#39;t want to press charges &amp;amp; victims hardly ever do. If he has such a cavalier attitude to the law surely this can&amp;#39;t be the only way he breaks it. For example does he do drugs or drink drive? Think about when he is most likely to be in possession or driving drunk and report him? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd8nrv", "score_hidden": false, "stickied": false, "created": 1492442050.0, "created_utc": 1492413250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd9dhx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "garblegarble12", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You cray cray in the A A. Honestly there is help available. Pm me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You cray cray in the A A. Honestly there is help available. Pm me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd9dhx", "score_hidden": false, "stickied": false, "created": 1492444094.0, "created_utc": 1492415294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdalct", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "whatsthefussallabout", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Im sorry i have no solutions, its such a horrible situation to be in. I know hes not worth you guys going to jail but its so hard to resist in that situation im not sure if i could, i know my partner would have done him in years ago if it was our daughter. A friend of mine went through something similar and didnt kick him out until he put her in hospital and her kids saw it all. Its horrible for the kids to go through and they still see their dad and u can see the pervasive effect he still has on them... In situations like this the kids would be better off without the dad.... I hope you can get this resolved asap xxxxx", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im sorry i have no solutions, its such a horrible situation to be in. I know hes not worth you guys going to jail but its so hard to resist in that situation im not sure if i could, i know my partner would have done him in years ago if it was our daughter. A friend of mine went through something similar and didnt kick him out until he put her in hospital and her kids saw it all. Its horrible for the kids to go through and they still see their dad and u can see the pervasive effect he still has on them... In situations like this the kids would be better off without the dad.... I hope you can get this resolved asap xxxxx&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdalct", "score_hidden": false, "stickied": false, "created": 1492448152.0, "created_utc": 1492419352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdb5v3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlitzedGoom", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I would have this guy crippled, but that's probably a bad idea if you don't have the right connections...act within the law and save your grandchild.  Your daughter is beyond saving at this point..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would have this guy crippled, but that&amp;#39;s probably a bad idea if you don&amp;#39;t have the right connections...act within the law and save your grandchild.  Your daughter is beyond saving at this point..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdb5v3", "score_hidden": false, "stickied": false, "created": 1492450145.0, "created_utc": 1492421345.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdfklc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CobraKev24", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Get a lawyer. Document everything. Call the police everytime he hits her. If the cops show up, someone has to go to jail. It's the law, albeit it may only be overnight. Try an intervention with her as soon as you know he's in lockup. But at the end of the day, try to get custody of your grandson. He's the real victim here. Your daughter is definitely a victim as well, but she's also an adult and knows what's going on. If you lose her because she's mad at you, then that's on her, not you. Get that grandson.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a lawyer. Document everything. Call the police everytime he hits her. If the cops show up, someone has to go to jail. It&amp;#39;s the law, albeit it may only be overnight. Try an intervention with her as soon as you know he&amp;#39;s in lockup. But at the end of the day, try to get custody of your grandson. He&amp;#39;s the real victim here. Your daughter is definitely a victim as well, but she&amp;#39;s also an adult and knows what&amp;#39;s going on. If you lose her because she&amp;#39;s mad at you, then that&amp;#39;s on her, not you. Get that grandson.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdfklc", "score_hidden": false, "stickied": false, "created": 1492461921.0, "created_utc": 1492433121.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdgs2e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He looks weed and in our state they don't do anything about it. It's a fine if you get caught with so much or something. To my knowledge that's what he does and he drinks. I don't even think they would do anything about having weed in the home just because they're so close to legalizing it. Many police around here don't even pay attention to weed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He looks weed and in our state they don&amp;#39;t do anything about it. It&amp;#39;s a fine if you get caught with so much or something. To my knowledge that&amp;#39;s what he does and he drinks. I don&amp;#39;t even think they would do anything about having weed in the home just because they&amp;#39;re so close to legalizing it. Many police around here don&amp;#39;t even pay attention to weed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgs2e", "score_hidden": false, "stickied": false, "created": 1492464029.0, "created_utc": 1492435229.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdgttw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm quite certain if he makes it to jail or prison he will get exactly what's coming to him", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m quite certain if he makes it to jail or prison he will get exactly what&amp;#39;s coming to him&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgttw", "score_hidden": false, "stickied": false, "created": 1492464107.0, "created_utc": 1492435307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdhre2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "panickedmess33", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "So classy, bet your mamas proud! Can't wait till something out of the normal does happen. You surely won't be able to cope. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So classy, bet your mamas proud! Can&amp;#39;t wait till something out of the normal does happen. You surely won&amp;#39;t be able to cope. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdhre2", "score_hidden": false, "stickied": false, "created": 1492465578.0, "created_utc": 1492436778.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgds39h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "eggsnbaconpie", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "What are the laws like regarding consent and collecting evidence? I would be collecting everything and anything if I were you - video, audio, photos, screen capturing all texts, recording phone calls, etc. EVERYTHING. \n\nYou're going to need it when it comes time to decide who gets custody, and you'll probably make a very good case that it should be you. START COLLECTING.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are the laws like regarding consent and collecting evidence? I would be collecting everything and anything if I were you - video, audio, photos, screen capturing all texts, recording phone calls, etc. EVERYTHING. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re going to need it when it comes time to decide who gets custody, and you&amp;#39;ll probably make a very good case that it should be you. START COLLECTING.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgds39h", "score_hidden": false, "stickied": false, "created": 1492478116.0, "created_utc": 1492449316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcmoj2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "goldishblue", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Some people think having a step dad should automatically fix things.\n\nI've never met my dad either so I could see where your daughter is lacking. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some people think having a step dad should automatically fix things.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never met my dad either so I could see where your daughter is lacking. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcmoj2", "score_hidden": false, "stickied": false, "created": 1492408112.0, "created_utc": 1492379312.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc8o8y", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "texashatesme", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "Ricin.... Nobody will suspect a thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ricin.... Nobody will suspect a thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8o8y", "score_hidden": false, "stickied": false, "created": 1492389729.0, "created_utc": 1492360929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc7q5g", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "kathytoure", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Pay somebody and SOON! If he's a drug dealer and running a boosting operation, it'll be easy to make it look drug related. Nobody will have sympathy for him.", "edited": 1492360477.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pay somebody and SOON! If he&amp;#39;s a drug dealer and running a boosting operation, it&amp;#39;ll be easy to make it look drug related. Nobody will have sympathy for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc7q5g", "score_hidden": false, "stickied": false, "created": 1492388478.0, "created_utc": 1492359678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgd5gdh", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "VeganLGBTCrossfitter", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "An ar-15 is about $650. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An ar-15 is about $650. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd5gdh", "score_hidden": false, "stickied": false, "created": 1492435024.0, "created_utc": 1492406224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgc6fa1", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MissColombia", "parent_id": "t1_dgc4s3o", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I get where you're coming from about OP's grandson but it's much easier said than done for a grandparent to get custody. Both parents are living, in a relationship together, there is no documented abuse (because no one will call the cops), no proof of drug addiction, etc. Courts don't just take kids away from their parents because grandma claims dad is abusive. \n\nOP's best course of action is to call the police when this POS pulls his shit and to do everything in her power to convince her daughter not to go back to him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get where you&amp;#39;re coming from about OP&amp;#39;s grandson but it&amp;#39;s much easier said than done for a grandparent to get custody. Both parents are living, in a relationship together, there is no documented abuse (because no one will call the cops), no proof of drug addiction, etc. Courts don&amp;#39;t just take kids away from their parents because grandma claims dad is abusive. &lt;/p&gt;\n\n&lt;p&gt;OP&amp;#39;s best course of action is to call the police when this POS pulls his shit and to do everything in her power to convince her daughter not to go back to him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc6fa1", "score_hidden": false, "stickied": false, "created": 1492386718.0, "created_utc": 1492357918.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4s3o", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "LittleLissy", "parent_id": "t1_dgc4b9o", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": " You can take the looking route then. \n\nGet custody of your grandchild. You'll at least be able to protect one of them.  Once the kid is free,  she won't feel as trapped and will be more likely to leave ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can take the looking route then. &lt;/p&gt;\n\n&lt;p&gt;Get custody of your grandchild. You&amp;#39;ll at least be able to protect one of them.  Once the kid is free,  she won&amp;#39;t feel as trapped and will be more likely to leave &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4s3o", "score_hidden": false, "stickied": false, "created": 1492384455.0, "created_utc": 1492355655.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4b9o", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc40s2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You have no idea how badly I'd love to set his balls on fire. Unfortunately, it will only make shit worse. But your advice is definitely my many thoughts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have no idea how badly I&amp;#39;d love to set his balls on fire. Unfortunately, it will only make shit worse. But your advice is definitely my many thoughts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc4b9o", "score_hidden": false, "stickied": false, "created": 1492383773.0, "created_utc": 1492354973.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc40s2", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "LittleLissy", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Pick a fight with him. \n\n Take a hit. \n\nShoot him. \n\nShit to kill. \n\n\n\nYour daughter will only be mad at first. \n\nMaybe. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pick a fight with him. &lt;/p&gt;\n\n&lt;p&gt;Take a hit. &lt;/p&gt;\n\n&lt;p&gt;Shoot him. &lt;/p&gt;\n\n&lt;p&gt;Shit to kill. &lt;/p&gt;\n\n&lt;p&gt;Your daughter will only be mad at first. &lt;/p&gt;\n\n&lt;p&gt;Maybe. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc40s2", "score_hidden": false, "stickied": false, "created": 1492383333.0, "created_utc": 1492354533.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdmy21", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "sadshark", "parent_id": "t1_dgdl5sy", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You took the time to stalk my profile? What kind of sad life you have...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You took the time to stalk my profile? What kind of sad life you have...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdmy21", "score_hidden": false, "stickied": false, "created": 1492472336.0, "created_utc": 1492443536.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdl5sy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Thatsnotyourface", "parent_id": "t1_dgdbssg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Oh look you've taken a second to stop gaming to write a nasty comment to someone going through a hard time. What a scumbag you are. \n\nGet a life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh look you&amp;#39;ve taken a second to stop gaming to write a nasty comment to someone going through a hard time. What a scumbag you are. &lt;/p&gt;\n\n&lt;p&gt;Get a life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdl5sy", "score_hidden": false, "stickied": false, "created": 1492470209.0, "created_utc": 1492441409.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgdhple", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "sadshark", "parent_id": "t1_dgdgnzi", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It won't happen in my family because we're not degenerates getting pumped and dumped by felons at 15.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It won&amp;#39;t happen in my family because we&amp;#39;re not degenerates getting pumped and dumped by felons at 15.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdhple", "score_hidden": false, "stickied": false, "created": 1492465501.0, "created_utc": 1492436701.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgnzi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgdbssg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Certainly hope it doesn't happen in your family. It happens to many, and I don't regret anything that I've done. But thank you for your kind words. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Certainly hope it doesn&amp;#39;t happen in your family. It happens to many, and I don&amp;#39;t regret anything that I&amp;#39;ve done. But thank you for your kind words. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgnzi", "score_hidden": false, "stickied": false, "created": 1492463850.0, "created_utc": 1492435050.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbssg", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "sadshark", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; Let's not forget, I had a child with a 3 time felon at age 15\n\nThe apple doesn't fall far away from the tree, does it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Let&amp;#39;s not forget, I had a child with a 3 time felon at age 15&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The apple doesn&amp;#39;t fall far away from the tree, does it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbssg", "score_hidden": false, "stickied": false, "created": 1492452326.0, "created_utc": 1492423526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcjz0i", "gilded": 0, "archived": false, "score": -16, "report_reasons": null, "author": "baba_booey123", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Where's the tl:dr. Jesus lady. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where&amp;#39;s the tl:dr. Jesus lady. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjz0i", "score_hidden": false, "stickied": false, "created": 1492404560.0, "created_utc": 1492375760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcey8a", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "Licalottapuss", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Well first off i am sorry for your situation.. Next,, man,, delete this post and do what you gotta do. Just sayin'...and i mean this only in the way as 1father to another.. That situation is horrific. And i empathize with you. Talk to a lawyer, talk to the police. Please. ", "edited": 1492369769.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well first off i am sorry for your situation.. Next,, man,, delete this post and do what you gotta do. Just sayin&amp;#39;...and i mean this only in the way as 1father to another.. That situation is horrific. And i empathize with you. Talk to a lawyer, talk to the police. Please. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcey8a", "score_hidden": false, "stickied": false, "created": 1492398035.0, "created_utc": 1492369235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcel8s", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DanaBana420", "parent_id": "t1_dgcagel", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Feeding into it fuels the fire. Report and ignore.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feeding into it fuels the fire. Report and ignore.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcel8s", "score_hidden": false, "stickied": false, "created": 1492397553.0, "created_utc": 1492368753.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcagel", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgc9ddc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You are just a poor loser trolling the internet because his life is empty and who has noting good to contribute to the world. I hope you are unable to reproduce. I want to see you talking like that to someone in person, you would get your ugly ass-teeth knocked out you piece of garbage. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are just a poor loser trolling the internet because his life is empty and who has noting good to contribute to the world. I hope you are unable to reproduce. I want to see you talking like that to someone in person, you would get your ugly ass-teeth knocked out you piece of garbage. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcagel", "score_hidden": false, "stickied": false, "created": 1492392039.0, "created_utc": 1492363239.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcbuwk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ILoveLucilleAustero", "parent_id": "t1_dgc9ddc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I wonder how many people you are holding captive in your basement. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder how many people you are holding captive in your basement. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcbuwk", "score_hidden": false, "stickied": false, "created": 1492393887.0, "created_utc": 1492365087.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcfryz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rosielizard", "parent_id": "t1_dgc9ddc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Offended? No. Do I think you're a sad, pathetic man with no balls who doesn't deserve to be on this planet? Yes.\n\nCalling people names shows how little intellect you have. Are you sure you're not special needs? Cause you might want to get tested.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Offended? No. Do I think you&amp;#39;re a sad, pathetic man with no balls who doesn&amp;#39;t deserve to be on this planet? Yes.&lt;/p&gt;\n\n&lt;p&gt;Calling people names shows how little intellect you have. Are you sure you&amp;#39;re not special needs? Cause you might want to get tested.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcfryz", "score_hidden": false, "stickied": false, "created": 1492399120.0, "created_utc": 1492370320.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9ddc", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgc90zo", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "fuck you bitch dont tell me what to do. Let me guess, another female with a kid that feels offended? what a joke LOL and people wonder why im a misogynist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;fuck you bitch dont tell me what to do. Let me guess, another female with a kid that feels offended? what a joke LOL and people wonder why im a misogynist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9ddc", "score_hidden": false, "stickied": false, "created": 1492390621.0, "created_utc": 1492361821.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc90zo", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "rosielizard", "parent_id": "t1_dgc8d7k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Maybe you shouldn't reply to someone wanting advice by calling them a skank.\n\nIt's sad that you're probably either 14 or an older domestic abuser yourself. Either way, get off Reddit and get some help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you shouldn&amp;#39;t reply to someone wanting advice by calling them a skank.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sad that you&amp;#39;re probably either 14 or an older domestic abuser yourself. Either way, get off Reddit and get some help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc90zo", "score_hidden": false, "stickied": false, "created": 1492390196.0, "created_utc": 1492361396.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcb0od", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgcaun1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Let me guess, you are some ugly fat loser who can't reproduce because noone is down and not even a hooker would get on you. Different from you, I don't have to fuck myself. And.... I'm done acknowledging your existence, just like the rest of the world should. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let me guess, you are some ugly fat loser who can&amp;#39;t reproduce because noone is down and not even a hooker would get on you. Different from you, I don&amp;#39;t have to fuck myself. And.... I&amp;#39;m done acknowledging your existence, just like the rest of the world should. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcb0od", "score_hidden": false, "stickied": false, "created": 1492392788.0, "created_utc": 1492363988.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgccv6y", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgcc08k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "wow, you act like women impregnate themselves when guys could just so easily keep it in their pants or wrap it up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wow, you act like women impregnate themselves when guys could just so easily keep it in their pants or wrap it up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgccv6y", "score_hidden": false, "stickied": false, "created": 1492395226.0, "created_utc": 1492366426.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcd15e", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ILoveLucilleAustero", "parent_id": "t1_dgcc08k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You slander yourself sir. And it is called 'Libel' when written, typed, and/or published. The act of 'slander' is verbal or spoken. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You slander yourself sir. And it is called &amp;#39;Libel&amp;#39; when written, typed, and/or published. The act of &amp;#39;slander&amp;#39; is verbal or spoken. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcd15e", "score_hidden": false, "stickied": false, "created": 1492395444.0, "created_utc": 1492366644.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcjoux", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rosielizard", "parent_id": "t1_dgcc08k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think you're a sad, pathetic man with no balls who doesn't deserve to be on this planet.\n\nWhat's up no balls?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re a sad, pathetic man with no balls who doesn&amp;#39;t deserve to be on this planet.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s up no balls?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjoux", "score_hidden": false, "stickied": false, "created": 1492404202.0, "created_utc": 1492375402.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc08k", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgcbtc6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "more females coming to slander me! What a suprise. How many kids do you have ILoveLucilleAustero? 5? 10? maybe 100???", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;more females coming to slander me! What a suprise. How many kids do you have ILoveLucilleAustero? 5? 10? maybe 100???&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcc08k", "score_hidden": false, "stickied": false, "created": 1492394084.0, "created_utc": 1492365284.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbtc6", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ILoveLucilleAustero", "parent_id": "t1_dgcaun1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Your grammar is atrocious. You should focus on that first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your grammar is atrocious. You should focus on that first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcbtc6", "score_hidden": false, "stickied": false, "created": 1492393832.0, "created_utc": 1492365032.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcq3yq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "k10morgan", "parent_id": "t1_dgcaun1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You do realize the earth's big population boom was back in the 1800's, right? We're actually coming to a plateau. Yes, it's far above the carrying capacity of the earth, but there's a reason it isn't talked about much anymore. A population problem is not as big of a problem as it used to be. Please educate yourself before spouting nonsense in such a hateful way.\n\n\nEDIT: never mind, I thought you were just a moron. Turns out you're a moron and a troll, so education isn't going to do a damn thing for you.\nThat's enough internet for you, go shove your head up your ass again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You do realize the earth&amp;#39;s big population boom was back in the 1800&amp;#39;s, right? We&amp;#39;re actually coming to a plateau. Yes, it&amp;#39;s far above the carrying capacity of the earth, but there&amp;#39;s a reason it isn&amp;#39;t talked about much anymore. A population problem is not as big of a problem as it used to be. Please educate yourself before spouting nonsense in such a hateful way.&lt;/p&gt;\n\n&lt;p&gt;EDIT: never mind, I thought you were just a moron. Turns out you&amp;#39;re a moron and a troll, so education isn&amp;#39;t going to do a damn thing for you.\nThat&amp;#39;s enough internet for you, go shove your head up your ass again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcq3yq", "score_hidden": false, "stickied": false, "created": 1492412759.0, "created_utc": 1492383959.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcaun1", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgcaloi", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "do you even know we have a population problem, or is that not something you even care about or are you to stupid to comprehend? Im doing my part by not reproducing not like i would want to anyway wit dumbfucks like you walking around. Go fuck yourself bitch. Do you have kids??? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;do you even know we have a population problem, or is that not something you even care about or are you to stupid to comprehend? Im doing my part by not reproducing not like i would want to anyway wit dumbfucks like you walking around. Go fuck yourself bitch. Do you have kids??? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcaun1", "score_hidden": false, "stickied": false, "created": 1492392563.0, "created_utc": 1492363763.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcaloi", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgc8ubx", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "maybe we should get rid of people like you to fix that overpopulation problem ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;maybe we should get rid of people like you to fix that overpopulation problem &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcaloi", "score_hidden": false, "stickied": false, "created": 1492392231.0, "created_utc": 1492363431.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcjqk6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "rosielizard", "parent_id": "t1_dgc9u2v", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Castration would look good on you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Castration would look good on you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjqk6", "score_hidden": false, "stickied": false, "created": 1492404264.0, "created_utc": 1492375464.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9u2v", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgc9q9f", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah i dont have any kids because its immoral. Try reading some philosophy sometime instead of your garbage \"bible\" you religious fuck. I definitely dont want kids if people like you are around walking the earth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah i dont have any kids because its immoral. Try reading some philosophy sometime instead of your garbage &amp;quot;bible&amp;quot; you religious fuck. I definitely dont want kids if people like you are around walking the earth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9u2v", "score_hidden": false, "stickied": false, "created": 1492391220.0, "created_utc": 1492362420.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9q9f", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc8ubx", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Praying you have no children. God help them if you do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Praying you have no children. God help them if you do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9q9f", "score_hidden": false, "stickied": false, "created": 1492391081.0, "created_utc": 1492362281.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcjnmi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "rosielizard", "parent_id": "t1_dgcdt8w", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think you're a sad, pathetic man with no balls who doesn't deserve to be on this planet.\n\nWhat's up no balls?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re a sad, pathetic man with no balls who doesn&amp;#39;t deserve to be on this planet.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s up no balls?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjnmi", "score_hidden": false, "stickied": false, "created": 1492404157.0, "created_utc": 1492375357.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdt8w", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgcdiuf", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "why are you stalking me? you want my dick that bad bitch? holy fuck this is the 6th reply! Hop off my dick bitch!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why are you stalking me? you want my dick that bad bitch? holy fuck this is the 6th reply! Hop off my dick bitch!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcdt8w", "score_hidden": false, "stickied": false, "created": 1492396497.0, "created_utc": 1492367697.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdiuf", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ILoveLucilleAustero", "parent_id": "t1_dgc8ubx", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You do not say these things to every woman with children, that has the misfortune of meeting you. We all know you remain silent. And soon you will return to your Cup-O-Noodles and delusions of grandeur; and the wholly misguided precept that YOU are making the world a better place. Bless your bitter little heart. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You do not say these things to every woman with children, that has the misfortune of meeting you. We all know you remain silent. And soon you will return to your Cup-O-Noodles and delusions of grandeur; and the wholly misguided precept that YOU are making the world a better place. Bless your bitter little heart. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcdiuf", "score_hidden": false, "stickied": false, "created": 1492396105.0, "created_utc": 1492367305.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcc32z", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ILoveLucilleAustero", "parent_id": "t1_dgc8ubx", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "But you said, \"having children is immoral.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But you said, &amp;quot;having children is immoral.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcc32z", "score_hidden": false, "stickied": false, "created": 1492394186.0, "created_utc": 1492365386.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8ubx", "gilded": 0, "archived": false, "score": -30, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgc8mwb", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah i say that to every stupid bitch that has a kid because we are already overpopulated but i guess your tiny female brain cant comprehend that. Where do you live? Maybe we can meet up and fuck so i can get you pregnant? You would probably like that you shortsighted pig", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah i say that to every stupid bitch that has a kid because we are already overpopulated but i guess your tiny female brain cant comprehend that. Where do you live? Maybe we can meet up and fuck so i can get you pregnant? You would probably like that you shortsighted pig&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8ubx", "score_hidden": false, "stickied": false, "created": 1492389952.0, "created_utc": 1492361152.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -30}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8mwb", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc8d7k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Do you say this to every woman who has a child at that age? Because I feel sorry for people like you. God blessed me with a beautiful child regardless the age. And she had the best upbringing she could have asked for. I did my best with her and I don't regret my choice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you say this to every woman who has a child at that age? Because I feel sorry for people like you. God blessed me with a beautiful child regardless the age. And she had the best upbringing she could have asked for. I did my best with her and I don&amp;#39;t regret my choice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8mwb", "score_hidden": false, "stickied": false, "created": 1492389679.0, "created_utc": 1492360879.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8d7k", "gilded": 0, "archived": false, "score": -52, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgc7yty", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Nothing says classy like having a kid at 15. Close your legs you stupid skank whore and maybe a kid wont pop out next time. What a fucking joke. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing says classy like having a kid at 15. Close your legs you stupid skank whore and maybe a kid wont pop out next time. What a fucking joke. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc8d7k", "score_hidden": false, "stickied": false, "created": 1492389331.0, "created_utc": 1492360531.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -52}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7yty", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "panickedmess33", "parent_id": "t1_dgc6fio", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes and I'm quite sure that you make your mother proud. You sound as classy as The pile of shit that she dates.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes and I&amp;#39;m quite sure that you make your mother proud. You sound as classy as The pile of shit that she dates.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc7yty", "score_hidden": false, "stickied": false, "created": 1492388801.0, "created_utc": 1492360001.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcacfr", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgcaa9d", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "no, just disappointed people like you exist ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no, just disappointed people like you exist &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcacfr", "score_hidden": false, "stickied": false, "created": 1492391897.0, "created_utc": 1492363097.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcf7lh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "alickstee", "parent_id": "t1_dgcaa9d", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Take your fake edginess elsewhere.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take your fake edginess elsewhere.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcf7lh", "score_hidden": false, "stickied": false, "created": 1492398377.0, "created_utc": 1492369577.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcjpq0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rosielizard", "parent_id": "t1_dgcaa9d", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Got castration?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Got castration?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjpq0", "score_hidden": false, "stickied": false, "created": 1492404233.0, "created_utc": 1492375433.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcaa9d", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t1_dgc9uee", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "you mad whore?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you mad whore?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcaa9d", "score_hidden": false, "stickied": false, "created": 1492391818.0, "created_utc": 1492363018.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9uee", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgc6fio", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "maybe you need to mind your own damn business, the only stupid slut is the one who raised such a piece of crap as yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;maybe you need to mind your own damn business, the only stupid slut is the one who raised such a piece of crap as yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc9uee", "score_hidden": false, "stickied": false, "created": 1492391231.0, "created_utc": 1492362431.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgcd0wx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "spillingwine", "parent_id": "t1_dgcbkjm", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Every woman on Earth with half a brain", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Every woman on Earth with half a brain&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcd0wx", "score_hidden": false, "stickied": false, "created": 1492395435.0, "created_utc": 1492366635.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbkjm", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ILoveLucilleAustero", "parent_id": "t1_dgc6fio", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "And who is the girl that pissed in your Corn Flakes!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And who is the girl that pissed in your Corn Flakes!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcbkjm", "score_hidden": false, "stickied": false, "created": 1492393514.0, "created_utc": 1492364714.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65pazz", "likes": null, "replies": "", "user_reports": [], "id": "dgceiy5", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "DanaBana420", "parent_id": "t1_dgc6fio", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Straight up reported. Don't be a troll. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Straight up reported. Don&amp;#39;t be a troll. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgceiy5", "score_hidden": false, "stickied": false, "created": 1492397465.0, "created_utc": 1492368665.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6fio", "gilded": 0, "archived": false, "score": -59, "report_reasons": null, "author": "redditiscool1234", "parent_id": "t3_65pazz", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "maybe you shouldnt have been a stupid slut and had a kid at 15? stupid fucking bitch", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;maybe you shouldnt have been a stupid slut and had a kid at 15? stupid fucking bitch&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgc6fio", "score_hidden": false, "stickied": false, "created": 1492386727.0, "created_utc": 1492357927.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -59}}], "after": null, "before": null}}]