[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Contemplating a breakup with my current GF of 7 months. She continues to violate my trust and my desires; all while projecting her own onto me and using me as her main support system due to her lack of friends.&lt;/p&gt;\n\n&lt;p&gt;Long story here, scroll down for Tl;dr&lt;/p&gt;\n\n&lt;p&gt;We met back in October, shared a class together and I came over to study one night. Instead of studying we ended up getting very intimate due to some great chemistry between the two of us. What she told me the next day angered me though; she admitted she has a boyfriend she was still with long distance. I immediately put a stop too it as I wanted to respect the other man, and to do that we could not continue that level of relationship.&lt;/p&gt;\n\n&lt;p&gt;What I soon learned in the coming days was just how abusive this guy was (or so I thought at the time). He didn&amp;#39;t allow her to have any male friends, always texted her nonstop throughout the day, and not only deals drugs (Weed, so low level stuff but still) but actively parties hard and drinks. She was staying with him because he has threatened to self-harm and worse and she wanted to fix him. Now I am super uncomfortable with infidelity; but having heard this guy yell at her and what he did I knew that he was a jackass taking his problems out on his GF of 4 years. I wanted to help her out of that situation. But this is where I fucked up.&lt;/p&gt;\n\n&lt;p&gt;I made my big mistake of enabling her to get closer to me, and she managed to convince me that it was ok for her to be with me as she was &amp;quot;just phasing him out&amp;quot; and &amp;quot;she&amp;#39;d break up with him soon&amp;quot;. So we slept together and ate together and had a great time. But as things progressed I would bring him up and her reply would be &amp;quot;Soon, I promise. It&amp;#39;s hard.&amp;quot; That &amp;#39;soon&amp;#39; turned out to be January; 3 months from when we started! During this period she would drive hours away to him for a weekend once or twice a month and she missed some really important things to me (my second Marathon race, family issues, sick, etc.) &lt;/p&gt;\n\n&lt;p&gt;When it finally was over with the jackass Ex-BF she didnt even admit to him that there was another guy! Worse yet; she had confided in me that she had cheated on him before a year prior; and part of the reason he was so controlling is cause he took her back despite being hurt. I felt like a fool. But I was happy it was finally behind us and wanted to focus on building a real and healthy relationship with her. Except I was wrong, not only did she still text him but she refuses to post anything on Social Medias of Me because she doesn&amp;#39;t want to &amp;quot;hurt his feelings&amp;quot;. This (now) Ex-BF of hers is still a problem months later; I can understand not wanting to tell him or anyone too soon after the break up. But I cannot sympathize with this far into our relationship.&lt;/p&gt;\n\n&lt;p&gt;Now, there have been other issues. Namely my roommate. We are best friends, practically brothers. But when she initially met him she developed a small crush on him (back in November). I threatened to leave immediately as I was already dealing with way too much in regards to the (ex) BF shit. She told me it wouldn&amp;#39;t be a problem and that &amp;quot;I was better than him&amp;quot; and that &amp;quot;she&amp;#39;d get over him&amp;quot; &amp;quot;she chose me&amp;quot; etc. She claims not to like him anymore but she will still flirt/make advances I&amp;#39;m uncomfortable with (like seeing both of us walking up to her, and shouting his &amp;quot;Roommate!&amp;quot;  And giving him a long hug, or how she will take him shopping or to dinners) and when I point out these advances she acts confused and guilts me into thinking I&amp;#39;m wrong. Now mind you, my Roommate and I have talked extensively on this and he is a better guy than me, he doesn&amp;#39;t like her and he is also uncomfortable sometimes with her advances. He&amp;#39;s even come to me openly about if I&amp;#39;m ok with them hanging out as it&amp;#39;s a weird dynamic. I&amp;#39;m not worried about him instigating cheating I&amp;#39;m worried about her. He recently got a GF and they are great together; I&amp;#39;m scared for him that my GF is gonna interfere with his relationship too as she suddenly doesn&amp;#39;t like the other girl. Also he came with her to church today and had lunch with her family (she said &amp;quot;my mom and dad want to meet my friends&amp;quot; but it feels wrong that she&amp;#39;s doing it the same weekend we fought). But I can&amp;#39;t express concern without her claiming I&amp;#39;m being just like her Ex-BF.&lt;/p&gt;\n\n&lt;p&gt;Another missed point is that my GF has no friends. She has me her BF and best friend, my roommate that she hangs out with, and her church band. None of these people in her life are girls (&amp;quot;not a girl person&amp;quot;, which is a huge red flag). She also is very extroverted while I am introverted. She wants to hang out 24/7 and Id be happy seeing her twice a week.&lt;/p&gt;\n\n&lt;p&gt;I want to say that we have had some really wondeful times too; plenty of memories and she has helped make my first university year great. But she has also been my primary source of stress and I thought it  change once she did. But she didn&amp;#39;t and frankly won&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;At the moment there is one month left of University, and we have classes together. We had a big fight on Friday (our first one recently, mostly due to my repressed frustration) and Monday we are gonna talk again. My plan is to coast out these next few weeks; support her when I can but also work on letting her go. I will break up with her when Finals are over to avoid the shit storm now (as I guarantee she will make it bloody). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not innocent in this. I know I treated her very well as I was there for every emotional breakdown and gave her my love and affection through it all. I taught her a lot, but I also enabled her to some horrible things to me and others (particularly her Ex-BF).&lt;/p&gt;\n\n&lt;p&gt;Tl;dr&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;She cheated on her Ex-BF with me; and has cheated prior...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Refuses to post anything on social media of me or us to protect her Ex-BF&amp;#39;s feelings...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;She developed a crush on my roommate (my best friend) and has since gotten rid of the feelings but he is her closest friend...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;She has no friends and leans on me for emotional support...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;High levels of anxiety that she pushes onto me...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Uses God and Religion for justification &amp;quot;if I feel this way than it&amp;#39;s meant to be; if not then also meant to be&amp;quot;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Deletes all of her texts and msgs out of habit. But thats just sketchy.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;What do you think of the situation and what I should do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Contemplating a breakup with my current GF of 7 months. She continues to violate my trust and my desires; all while projecting her own onto me and using me as her main support system due to her lack of friends.\n\nLong story here, scroll down for Tl;dr\n\nWe met back in October, shared a class together and I came over to study one night. Instead of studying we ended up getting very intimate due to some great chemistry between the two of us. What she told me the next day angered me though; she admitted she has a boyfriend she was still with long distance. I immediately put a stop too it as I wanted to respect the other man, and to do that we could not continue that level of relationship.\n\nWhat I soon learned in the coming days was just how abusive this guy was (or so I thought at the time). He didn't allow her to have any male friends, always texted her nonstop throughout the day, and not only deals drugs (Weed, so low level stuff but still) but actively parties hard and drinks. She was staying with him because he has threatened to self-harm and worse and she wanted to fix him. Now I am super uncomfortable with infidelity; but having heard this guy yell at her and what he did I knew that he was a jackass taking his problems out on his GF of 4 years. I wanted to help her out of that situation. But this is where I fucked up.\n\nI made my big mistake of enabling her to get closer to me, and she managed to convince me that it was ok for her to be with me as she was \"just phasing him out\" and \"she'd break up with him soon\". So we slept together and ate together and had a great time. But as things progressed I would bring him up and her reply would be \"Soon, I promise. It's hard.\" That 'soon' turned out to be January; 3 months from when we started! During this period she would drive hours away to him for a weekend once or twice a month and she missed some really important things to me (my second Marathon race, family issues, sick, etc.) \n\nWhen it finally was over with the jackass Ex-BF she didnt even admit to him that there was another guy! Worse yet; she had confided in me that she had cheated on him before a year prior; and part of the reason he was so controlling is cause he took her back despite being hurt. I felt like a fool. But I was happy it was finally behind us and wanted to focus on building a real and healthy relationship with her. Except I was wrong, not only did she still text him but she refuses to post anything on Social Medias of Me because she doesn't want to \"hurt his feelings\". This (now) Ex-BF of hers is still a problem months later; I can understand not wanting to tell him or anyone too soon after the break up. But I cannot sympathize with this far into our relationship.\n\nNow, there have been other issues. Namely my roommate. We are best friends, practically brothers. But when she initially met him she developed a small crush on him (back in November). I threatened to leave immediately as I was already dealing with way too much in regards to the (ex) BF shit. She told me it wouldn't be a problem and that \"I was better than him\" and that \"she'd get over him\" \"she chose me\" etc. She claims not to like him anymore but she will still flirt/make advances I'm uncomfortable with (like seeing both of us walking up to her, and shouting his \"Roommate!\"  And giving him a long hug, or how she will take him shopping or to dinners) and when I point out these advances she acts confused and guilts me into thinking I'm wrong. Now mind you, my Roommate and I have talked extensively on this and he is a better guy than me, he doesn't like her and he is also uncomfortable sometimes with her advances. He's even come to me openly about if I'm ok with them hanging out as it's a weird dynamic. I'm not worried about him instigating cheating I'm worried about her. He recently got a GF and they are great together; I'm scared for him that my GF is gonna interfere with his relationship too as she suddenly doesn't like the other girl. Also he came with her to church today and had lunch with her family (she said \"my mom and dad want to meet my friends\" but it feels wrong that she's doing it the same weekend we fought). But I can't express concern without her claiming I'm being just like her Ex-BF.\n\nAnother missed point is that my GF has no friends. She has me her BF and best friend, my roommate that she hangs out with, and her church band. None of these people in her life are girls (\"not a girl person\", which is a huge red flag). She also is very extroverted while I am introverted. She wants to hang out 24/7 and Id be happy seeing her twice a week.\n\n I want to say that we have had some really wondeful times too; plenty of memories and she has helped make my first university year great. But she has also been my primary source of stress and I thought it  change once she did. But she didn't and frankly won't.\n\nAt the moment there is one month left of University, and we have classes together. We had a big fight on Friday (our first one recently, mostly due to my repressed frustration) and Monday we are gonna talk again. My plan is to coast out these next few weeks; support her when I can but also work on letting her go. I will break up with her when Finals are over to avoid the shit storm now (as I guarantee she will make it bloody). \n\nI'm not innocent in this. I know I treated her very well as I was there for every emotional breakdown and gave her my love and affection through it all. I taught her a lot, but I also enabled her to some horrible things to me and others (particularly her Ex-BF).\n\n\n\nTl;dr\n\n1. She cheated on her Ex-BF with me; and has cheated prior...\n\n2. Refuses to post anything on social media of me or us to protect her Ex-BF's feelings...\n\n3. She developed a crush on my roommate (my best friend) and has since gotten rid of the feelings but he is her closest friend...\n\n4. She has no friends and leans on me for emotional support...\n\n5. High levels of anxiety that she pushes onto me...\n\n6. Uses God and Religion for justification \"if I feel this way than it's meant to be; if not then also meant to be\"\n\n7. Deletes all of her texts and msgs out of habit. But thats just sketchy.\n\n\nWhat do you think of the situation and what I should do?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qv5e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Im_Not_Kevin", "saved": false, "mod_reports": [], "name": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492371033.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65qv5e/i_m19_cannot_bring_myself_to_trust_my_girlfriend/", "num_reports": null, "locked": false, "stickied": false, "created": 1492399256.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65qv5e/i_m19_cannot_bring_myself_to_trust_my_girlfriend/", "author_flair_text": null, "quarantine": false, "title": "I (M19) cannot bring myself to Trust my girlfriend (F18) despite her attempts to redeem herself.", "created_utc": 1492370456.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgcgigy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Im_Not_Kevin", "parent_id": "t1_dgcg9d3", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you for agreeing with me there; I think it's the easiest way for me to get away from her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for agreeing with me there; I think it&amp;#39;s the easiest way for me to get away from her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcgigy", "score_hidden": false, "stickied": false, "created": 1492400085.0, "created_utc": 1492371285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcg9d3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Chimera99", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Breaking up after finals is probably a good idea. When it's done pull the bandaid off fast, or you'll probably find yourself in the same position your girlfriends ex did.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Breaking up after finals is probably a good idea. When it&amp;#39;s done pull the bandaid off fast, or you&amp;#39;ll probably find yourself in the same position your girlfriends ex did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcg9d3", "score_hidden": false, "stickied": false, "created": 1492399758.0, "created_utc": 1492370958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgcjws8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Im_Not_Kevin", "parent_id": "t1_dgcij0u", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Ahhh great point. These are all lessons I promise to carry forward in future relationships :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahhh great point. These are all lessons I promise to carry forward in future relationships :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjws8", "score_hidden": false, "stickied": false, "created": 1492404481.0, "created_utc": 1492375681.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcij0u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "unbalancedlife", "parent_id": "t1_dgci8zv", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Hey man, don't worry, but let me say, fights are common. It's trust issues, like you're having with her, that's a red flag.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, don&amp;#39;t worry, but let me say, fights are common. It&amp;#39;s trust issues, like you&amp;#39;re having with her, that&amp;#39;s a red flag.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcij0u", "score_hidden": false, "stickied": false, "created": 1492402694.0, "created_utc": 1492373894.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgci8zv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Im_Not_Kevin", "parent_id": "t1_dgcha3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you, Im not experienced enough to know that's true haha! Couples fight all the time and I thought if I left at the first fight I'd have missed out on a lot of good times. Which is true, but the bad has outweighed the good nowadays and its time to move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, Im not experienced enough to know that&amp;#39;s true haha! Couples fight all the time and I thought if I left at the first fight I&amp;#39;d have missed out on a lot of good times. Which is true, but the bad has outweighed the good nowadays and its time to move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgci8zv", "score_hidden": false, "stickied": false, "created": 1492402342.0, "created_utc": 1492373542.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcha3r", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "unbalancedlife", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "End the relationship. If you need to ask, that's your answer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;End the relationship. If you need to ask, that&amp;#39;s your answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcha3r", "score_hidden": false, "stickied": false, "created": 1492401093.0, "created_utc": 1492372293.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgci9qj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Im_Not_Kevin", "parent_id": "t1_dgchr5x", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Typing it out helped me realize how bad it got! :[", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Typing it out helped me realize how bad it got! :[&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgci9qj", "score_hidden": false, "stickied": false, "created": 1492402369.0, "created_utc": 1492373569.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchr5x", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Terribledragon4Hire", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah no. Just from the TLDR I would be heading for the hills. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah no. Just from the TLDR I would be heading for the hills. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgchr5x", "score_hidden": false, "stickied": false, "created": 1492401707.0, "created_utc": 1492372907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgcjzrf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Im_Not_Kevin", "parent_id": "t1_dgcj3qg", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I agree with the logic, and will highly consider it. My only \"but\" is because it would be MORE stressful for me to break up NOW as opposed to after I never have to see her again. Maybe you're right tho thanks for the advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with the logic, and will highly consider it. My only &amp;quot;but&amp;quot; is because it would be MORE stressful for me to break up NOW as opposed to after I never have to see her again. Maybe you&amp;#39;re right tho thanks for the advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjzrf", "score_hidden": false, "stickied": false, "created": 1492404588.0, "created_utc": 1492375788.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcj3qg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Relationships_shit", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yes dump her and don't bother waiting, why be considerate to her when she isn't to you \n\nDo it now ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes dump her and don&amp;#39;t bother waiting, why be considerate to her when she isn&amp;#39;t to you &lt;/p&gt;\n\n&lt;p&gt;Do it now &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcj3qg", "score_hidden": false, "stickied": false, "created": 1492403439.0, "created_utc": 1492374639.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgd5uq3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mistermorteau", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Breakup now, tell your roomie she is unwelcome to your place, and he can see her elsewhere. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Breakup now, tell your roomie she is unwelcome to your place, and he can see her elsewhere. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd5uq3", "score_hidden": false, "stickied": false, "created": 1492435826.0, "created_utc": 1492407026.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgcidlc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Im_Not_Kevin", "parent_id": "t1_dgchw8k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you so much, and you nailed it on the head with her needing a relationship. She doesn't know how to be alone; she has always 'dated' even silly elementary school stuff. She has never had a good guy who was willing to love and help her progress as a person; well I least I tried too.\n\nYeah I definitely will talk to friends about it before. I would like to get the story straight before she tries to blow it all up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much, and you nailed it on the head with her needing a relationship. She doesn&amp;#39;t know how to be alone; she has always &amp;#39;dated&amp;#39; even silly elementary school stuff. She has never had a good guy who was willing to love and help her progress as a person; well I least I tried too.&lt;/p&gt;\n\n&lt;p&gt;Yeah I definitely will talk to friends about it before. I would like to get the story straight before she tries to blow it all up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcidlc", "score_hidden": false, "stickied": false, "created": 1492402500.0, "created_utc": 1492373700.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchw8k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OneDayEveryDay", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Definitely end it. It seems like she needs a relationship for some level of stability, rather than genuine love and interest. It's often easier to vent and to act awful around people close to you because they know you won't reject them, and that enables them to carry on with what they've done without having to change. She's been very emotionally manipulative, and she's also hiding you from her social life and approaching other guys. I suggest ending it cold: cut all contacts with her, and in case she's manipulative enough to spin it around, talk about your situation and how things have progressed with her with your close friends first before breaking up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely end it. It seems like she needs a relationship for some level of stability, rather than genuine love and interest. It&amp;#39;s often easier to vent and to act awful around people close to you because they know you won&amp;#39;t reject them, and that enables them to carry on with what they&amp;#39;ve done without having to change. She&amp;#39;s been very emotionally manipulative, and she&amp;#39;s also hiding you from her social life and approaching other guys. I suggest ending it cold: cut all contacts with her, and in case she&amp;#39;s manipulative enough to spin it around, talk about your situation and how things have progressed with her with your close friends first before breaking up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgchw8k", "score_hidden": false, "stickied": false, "created": 1492401887.0, "created_utc": 1492373087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgcq6eq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheFinalStrawman", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "just ghost her", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;just ghost her&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcq6eq", "score_hidden": false, "stickied": false, "created": 1492412853.0, "created_utc": 1492384053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65qv5e", "likes": null, "replies": "", "user_reports": [], "id": "dgcmsqp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Im_Not_Kevin", "parent_id": "t1_dgcmmok", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you PimpVader. It's good to know Im a fucking moron; best advice all day! ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you PimpVader. It&amp;#39;s good to know Im a fucking moron; best advice all day! ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcmsqp", "score_hidden": false, "stickied": false, "created": 1492408270.0, "created_utc": 1492379470.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmmok", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "P1mpVader", "parent_id": "t3_65qv5e", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You're a fucking moron and she's a cheating slut. Dump her immediately. This girl sounds like a disgusting human being.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re a fucking moron and she&amp;#39;s a cheating slut. Dump her immediately. This girl sounds like a disgusting human being.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcmmok", "score_hidden": false, "stickied": false, "created": 1492408041.0, "created_utc": 1492379241.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]