[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys&lt;/p&gt;\n\n&lt;p&gt;Me and my wife have been together for 6 years and married for two. This just happened in the past week, but the our problems have been building for awhile. So my wife and I have had communication issues that have caused and there has been a lack of intimacy and trust.  She asked me to move out last Tuesday and we talked about doing a separation period, so we could clear our heads.  I proposed doing a separation because I thought with some time apart we could let our anger and hurt feeling subside and try to work on our issues.  She seemed to think this was a good idea and was genuinely happy that I was moving out and staying close instead of moving away to be with family.  This made me think we were on relatively good terms and would work on ourselves to be better for each other. &lt;/p&gt;\n\n&lt;p&gt;Well I found out that within 2 days of me leaving she invited another guy she worked with over and they did stuff.  Now she saws it was a cook from were she works, but wont tell me who.  According to her this guy has had a crush on her, but she didn&amp;#39;t know and they ended up talking and she invited him over.  While he was their they talked and started kissing.  Then she said she stated to give him head but when they were going to have sex she couldn&amp;#39;t go through with it.  This is especially hurtful because she had a past experience where the guy forced her to give him head and it has always been a sore spot.  So for her to do that for a guy that quickly when she would never do it with me really hurt.  Now I think I trust her account and that she feels terrible about it.  &lt;/p&gt;\n\n&lt;p&gt;What really gets me is that while we were separated we are still married and I though on good terms and were going to work on our issues, plus what happened was so quick after I left.  To me I think this was cheating, but I am not sure if that is fair to her.  I really do love her a lot and want so badly to make things better, but this was something I never thought would happen.  I was going through the whole distance make the heart grow fonder feelings and she is hooking up with a random guy.  This is the first time I have really considered giving up on her and I feel like my trust in her is shattered.  As badly as I love her and want to give her what she has needed, i don&amp;#39;t know if I can come back from this.  One of my biggest issues is that this isn&amp;#39;t the first time something like this has happened.  When we first stared dating she kissed another guy.  She felt terrible and cut up her arm, but the excuse was that we were new and she didn&amp;#39;t know how serious we were and didn&amp;#39;t mean for it to happen.  Then 2 years later while we are in college doing long distance she hangs out with a guy and they have tickle fights in bed and she lets him take her shirt off and feel her up.  Again she felt terrible and talked about killing herself and it was because we were doing great and she wanted to feel like someone wanted her.  And now this happened with her blowing a guy.  Each time she has felt terrible, but there is always an excuse and it doesn&amp;#39;t stop her from doing it again, and escalating it each time.  I know it is my job to make her feel wanted and loved, but stuff like this can&amp;#39;t keep happening every time we go through a rough patch. &lt;/p&gt;\n\n&lt;p&gt;How bad do you guys think this is and do you think there is a way we can work through our problems?  I still love her so much, but I feel lost and don&amp;#39;t know what to do about us?&lt;/p&gt;\n\n&lt;p&gt;edit: To clarify we did not specifically talk about not seeing other people, but I still consider what she did cheating in spirit at a minimum.&lt;/p&gt;\n\n&lt;p&gt;I know this subreddit is very anti-cheater and from what I read on other reddit threads and websites these things never end well.  Once cheating has happens you cant take it back. Everything I have seen says either break it off now; or they try to make it work and it fails or their is a repeat of cheating.  This is really disheartening because I love her so much and want to give her a shot, but everything I have seen says we have basically a 0% chance of working.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys\n\n\nMe and my wife have been together for 6 years and married for two. This just happened in the past week, but the our problems have been building for awhile. So my wife and I have had communication issues that have caused and there has been a lack of intimacy and trust.  She asked me to move out last Tuesday and we talked about doing a separation period, so we could clear our heads.  I proposed doing a separation because I thought with some time apart we could let our anger and hurt feeling subside and try to work on our issues.  She seemed to think this was a good idea and was genuinely happy that I was moving out and staying close instead of moving away to be with family.  This made me think we were on relatively good terms and would work on ourselves to be better for each other. \n\nWell I found out that within 2 days of me leaving she invited another guy she worked with over and they did stuff.  Now she saws it was a cook from were she works, but wont tell me who.  According to her this guy has had a crush on her, but she didn't know and they ended up talking and she invited him over.  While he was their they talked and started kissing.  Then she said she stated to give him head but when they were going to have sex she couldn't go through with it.  This is especially hurtful because she had a past experience where the guy forced her to give him head and it has always been a sore spot.  So for her to do that for a guy that quickly when she would never do it with me really hurt.  Now I think I trust her account and that she feels terrible about it.  \n\nWhat really gets me is that while we were separated we are still married and I though on good terms and were going to work on our issues, plus what happened was so quick after I left.  To me I think this was cheating, but I am not sure if that is fair to her.  I really do love her a lot and want so badly to make things better, but this was something I never thought would happen.  I was going through the whole distance make the heart grow fonder feelings and she is hooking up with a random guy.  This is the first time I have really considered giving up on her and I feel like my trust in her is shattered.  As badly as I love her and want to give her what she has needed, i don't know if I can come back from this.  One of my biggest issues is that this isn't the first time something like this has happened.  When we first stared dating she kissed another guy.  She felt terrible and cut up her arm, but the excuse was that we were new and she didn't know how serious we were and didn't mean for it to happen.  Then 2 years later while we are in college doing long distance she hangs out with a guy and they have tickle fights in bed and she lets him take her shirt off and feel her up.  Again she felt terrible and talked about killing herself and it was because we were doing great and she wanted to feel like someone wanted her.  And now this happened with her blowing a guy.  Each time she has felt terrible, but there is always an excuse and it doesn't stop her from doing it again, and escalating it each time.  I know it is my job to make her feel wanted and loved, but stuff like this can't keep happening every time we go through a rough patch. \n\nHow bad do you guys think this is and do you think there is a way we can work through our problems?  I still love her so much, but I feel lost and don't know what to do about us?\n\n\nedit: To clarify we did not specifically talk about not seeing other people, but I still consider what she did cheating in spirit at a minimum.\n\nI know this subreddit is very anti-cheater and from what I read on other reddit threads and websites these things never end well.  Once cheating has happens you cant take it back. Everything I have seen says either break it off now; or they try to make it work and it fails or their is a repeat of cheating.  This is really disheartening because I love her so much and want to give her a shot, but everything I have seen says we have basically a 0% chance of working.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65r2b0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "MarriageTaW", "saved": false, "mod_reports": [], "name": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492376178.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65r2b0/my_24m_wife_24f_fooled_around_with_a_random_guy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492401523.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65r2b0/my_24m_wife_24f_fooled_around_with_a_random_guy/", "author_flair_text": null, "quarantine": false, "title": "My [24/m] wife [24/f] fooled around with a random guy as soon as we separated. Is this cheating?", "created_utc": 1492372723.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 34, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcjoxz", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Relationships_shit", "parent_id": "t1_dgcj88q", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "No she doesn't want to be a cheater that's why she waited until you were on a break, and now your the nice guy who finished last and now you'll forever walk on eggshells because of her past relationship when the cold truth is if you treated her like her exs you wouldn't be in this situation \n\nShe hates cheaters but she wanted to fuck someone else and she did it 48 hours after you went on a break and it's a guy she knows and works with \n\nIf you want to delude yourself into thinking that all of this is just coincidence and that a dick just fell in to her mouthy pussy and ass then by all means do so it's your funeral  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No she doesn&amp;#39;t want to be a cheater that&amp;#39;s why she waited until you were on a break, and now your the nice guy who finished last and now you&amp;#39;ll forever walk on eggshells because of her past relationship when the cold truth is if you treated her like her exs you wouldn&amp;#39;t be in this situation &lt;/p&gt;\n\n&lt;p&gt;She hates cheaters but she wanted to fuck someone else and she did it 48 hours after you went on a break and it&amp;#39;s a guy she knows and works with &lt;/p&gt;\n\n&lt;p&gt;If you want to delude yourself into thinking that all of this is just coincidence and that a dick just fell in to her mouthy pussy and ass then by all means do so it&amp;#39;s your funeral  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjoxz", "score_hidden": false, "stickied": false, "created": 1492404205.0, "created_utc": 1492375405.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgclt2u", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Grim_Truths_With_Luv", "parent_id": "t1_dgcj88q", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; she says it just happened. \n\nYeah, she slipped on a banana, spent time flirting at work with him, invited him back to her place, made sure her sexy underwear was on, checked her make-up and hair, moved onto the couch with him, kissed him, undressed him, undressed herself, etc., etc.\n\nIt just happened.  /s\n\n&gt;  I feel like I am prone to making excuses for her.\n\nBecause that is precisely what you are doing in this thread.  She does something.  You find out, and go ape. She engages in pointless, dramatic acts of phoney self-harm (drinking, cutting) to manipulate you. You go charging back in to save her, sword held aloft, armour gleaming.  Now you feel like a hero, she got her outside sex, and the relationship resumes.  \n\nThat makes you a chump, and her a varsity-level manipulator. ", "edited": 1492378558.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she says it just happened. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, she slipped on a banana, spent time flirting at work with him, invited him back to her place, made sure her sexy underwear was on, checked her make-up and hair, moved onto the couch with him, kissed him, undressed him, undressed herself, etc., etc.&lt;/p&gt;\n\n&lt;p&gt;It just happened.  /s&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel like I am prone to making excuses for her.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because that is precisely what you are doing in this thread.  She does something.  You find out, and go ape. She engages in pointless, dramatic acts of phoney self-harm (drinking, cutting) to manipulate you. You go charging back in to save her, sword held aloft, armour gleaming.  Now you feel like a hero, she got her outside sex, and the relationship resumes.  &lt;/p&gt;\n\n&lt;p&gt;That makes you a chump, and her a varsity-level manipulator. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgclt2u", "score_hidden": false, "stickied": false, "created": 1492406959.0, "created_utc": 1492378159.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcjnni", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "headphonez", "parent_id": "t1_dgcj88q", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;My concern is that those relationships have conditioned her to what a relationship is and no matter how much she says she hates cheaters, there is a part of her that will mirror what happened to her before\n\nYou need to apply this concern to yourself. You won't come out of this relationship without some issues because of this chick. Stop worrying about fixing and helping her; she has to do that for herself for it to stick. You need to look out for yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My concern is that those relationships have conditioned her to what a relationship is and no matter how much she says she hates cheaters, there is a part of her that will mirror what happened to her before&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You need to apply this concern to yourself. You won&amp;#39;t come out of this relationship without some issues because of this chick. Stop worrying about fixing and helping her; she has to do that for herself for it to stick. You need to look out for yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjnni", "score_hidden": false, "stickied": false, "created": 1492404158.0, "created_utc": 1492375358.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgd5nzz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mistermorteau", "parent_id": "t1_dgcj88q", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Ok so you been a doormat, shown her it was ok to walk over you and she thought you would be ok with her cheating on you.  \n\nAnd the only way to have a break in a marriage is by divorcing, or having a legal drafted separation. \n\nMarriage is between you, her and the states. It's not a high school romance. \n\nOr do you plan to pay your taxes during 50 weeks as married people and 2 weeks as dingle people ?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok so you been a doormat, shown her it was ok to walk over you and she thought you would be ok with her cheating on you.  &lt;/p&gt;\n\n&lt;p&gt;And the only way to have a break in a marriage is by divorcing, or having a legal drafted separation. &lt;/p&gt;\n\n&lt;p&gt;Marriage is between you, her and the states. It&amp;#39;s not a high school romance. &lt;/p&gt;\n\n&lt;p&gt;Or do you plan to pay your taxes during 50 weeks as married people and 2 weeks as dingle people ?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd5nzz", "score_hidden": false, "stickied": false, "created": 1492435445.0, "created_utc": 1492406645.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcj88q", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "MarriageTaW", "parent_id": "t1_dgci8hh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "Some part of me believes her when she says it just happened.  I know that since I left she has been through like 3 bottles of tequila and she is a lightweight.  She has been feeling a dark spiral of emotionless-ness and not caring about anything and I really don't think she is in a place to plan something like this.  But that doesn't excuse it to me, and honestly I feel like I am prone to making excuses for her.\n\nI don't think she is or wants to be a ho or cheater.  But in her early relationships she was cheated on and made to feel like she wasn't good enough.  I have always tried to be better than those past guys, even to the point of trying to protect her too much.  Like I would not fight with her and would always put her feelings first to the point where I was not putting communication into the relationship; which has caused lots of problems.  My concern is that those relationships have conditioned her to what a relationship is and no matter how much she says she hates cheaters, there is a part of her that will mirror what happened to her before.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some part of me believes her when she says it just happened.  I know that since I left she has been through like 3 bottles of tequila and she is a lightweight.  She has been feeling a dark spiral of emotionless-ness and not caring about anything and I really don&amp;#39;t think she is in a place to plan something like this.  But that doesn&amp;#39;t excuse it to me, and honestly I feel like I am prone to making excuses for her.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think she is or wants to be a ho or cheater.  But in her early relationships she was cheated on and made to feel like she wasn&amp;#39;t good enough.  I have always tried to be better than those past guys, even to the point of trying to protect her too much.  Like I would not fight with her and would always put her feelings first to the point where I was not putting communication into the relationship; which has caused lots of problems.  My concern is that those relationships have conditioned her to what a relationship is and no matter how much she says she hates cheaters, there is a part of her that will mirror what happened to her before.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcj88q", "score_hidden": false, "stickied": false, "created": 1492403605.0, "created_utc": 1492374805.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgci8hh", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "Relationships_shit", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He's the reason that you two went a break, this was premeditated so that she could sleep with him with out the guilt of being a cheater \n\nAnd even when people tell you that she didn't cheat because you were on a break, do you really want to take her back when she just showed you how little your relationship meant? She's been emotionally cheating for a while and then she asked for a break so she could fuck him and yes she fucked Him and she did a lot more with him than she ever did with you and ever will do with you \n\nYou tried to make a ho a housewife, ignored all the red flags and now your dealing with the consequences of your actions ", "edited": 1492373773.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s the reason that you two went a break, this was premeditated so that she could sleep with him with out the guilt of being a cheater &lt;/p&gt;\n\n&lt;p&gt;And even when people tell you that she didn&amp;#39;t cheat because you were on a break, do you really want to take her back when she just showed you how little your relationship meant? She&amp;#39;s been emotionally cheating for a while and then she asked for a break so she could fuck him and yes she fucked Him and she did a lot more with him than she ever did with you and ever will do with you &lt;/p&gt;\n\n&lt;p&gt;You tried to make a ho a housewife, ignored all the red flags and now your dealing with the consequences of your actions &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgci8hh", "score_hidden": false, "stickied": false, "created": 1492402324.0, "created_utc": 1492373524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcqy9k", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "y90210", "parent_id": "t1_dgclnan", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She didn't cheat if they were on a break. Also while we are on the subject, you don't take a break from a relationship. That isn't how they work. \n\nOp just happened to think taking a break would help, while his wife thought a break was great so she could get into a cook's pants. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She didn&amp;#39;t cheat if they were on a break. Also while we are on the subject, you don&amp;#39;t take a break from a relationship. That isn&amp;#39;t how they work. &lt;/p&gt;\n\n&lt;p&gt;Op just happened to think taking a break would help, while his wife thought a break was great so she could get into a cook&amp;#39;s pants. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcqy9k", "score_hidden": false, "stickied": false, "created": 1492413927.0, "created_utc": 1492385127.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclnan", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Grim_Truths_With_Luv", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; I still consider what she did cheating in spirit at a minimum.\n\nOf course it was.  Anyone saying otherwise is full of it.\n\nShe wanted the guy. She had him. Google \"Trickle Truth.\"  Sorry, man.\n\nShe has a history of known infidelities, and you keep taking responsibility for them.  Cut it out.  She needs to get some serious mental health help, and you need a divorce lawyer.", "edited": 1492378330.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I still consider what she did cheating in spirit at a minimum.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course it was.  Anyone saying otherwise is full of it.&lt;/p&gt;\n\n&lt;p&gt;She wanted the guy. She had him. Google &amp;quot;Trickle Truth.&amp;quot;  Sorry, man.&lt;/p&gt;\n\n&lt;p&gt;She has a history of known infidelities, and you keep taking responsibility for them.  Cut it out.  She needs to get some serious mental health help, and you need a divorce lawyer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgclnan", "score_hidden": false, "stickied": false, "created": 1492406750.0, "created_utc": 1492377950.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcmiqv", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "P1mpVader", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She asked you to move out, was delighted at the idea of a separation, and **two fucking days later** she had another man over in your house, probably fucking him in your bed. And you don't think she planned this or has been thinking about him sexually until you two officially separated?\n\nMove back into your own house you stupid fuck, and tell her if she wants to screw around with other guys SHE will move out. \n\nTell her until such times as a divorce is decided upon, or at least a permanent spit, she will keep her legs closed. And if she intends to stay in the marriage she will find a new job and go complete no contact with this other man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She asked you to move out, was delighted at the idea of a separation, and &lt;strong&gt;two fucking days later&lt;/strong&gt; she had another man over in your house, probably fucking him in your bed. And you don&amp;#39;t think she planned this or has been thinking about him sexually until you two officially separated?&lt;/p&gt;\n\n&lt;p&gt;Move back into your own house you stupid fuck, and tell her if she wants to screw around with other guys SHE will move out. &lt;/p&gt;\n\n&lt;p&gt;Tell her until such times as a divorce is decided upon, or at least a permanent spit, she will keep her legs closed. And if she intends to stay in the marriage she will find a new job and go complete no contact with this other man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcmiqv", "score_hidden": false, "stickied": false, "created": 1492407893.0, "created_utc": 1492379093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcmer5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "clumplings2", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;hen they were going to have sex she couldn't go through with it.\n\nThis is a lie. How gullible are you?\n\nShe won't even tell his name?\n\nYou are being \"fair\" to her to a fault. \"Fair\" enough that you actually call it lack of self respect for yourself and lack of dignity.\n\nFair to her my ass. She likely pushed you to make the break call and fucked some guy in your house while you moved out. Find your self respect wherever you lost it. \n\n", "edited": 1492379138.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;hen they were going to have sex she couldn&amp;#39;t go through with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a lie. How gullible are you?&lt;/p&gt;\n\n&lt;p&gt;She won&amp;#39;t even tell his name?&lt;/p&gt;\n\n&lt;p&gt;You are being &amp;quot;fair&amp;quot; to her to a fault. &amp;quot;Fair&amp;quot; enough that you actually call it lack of self respect for yourself and lack of dignity.&lt;/p&gt;\n\n&lt;p&gt;Fair to her my ass. She likely pushed you to make the break call and fucked some guy in your house while you moved out. Find your self respect wherever you lost it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcmer5", "score_hidden": false, "stickied": false, "created": 1492407751.0, "created_utc": 1492378951.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcmmh7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "clumplings2", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;I know this subreddit is very anti-cheater \n\nYour wife cheated on you 3 times that you know of and this is your stance ? Grow some ball and self respect, will you? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I know this subreddit is very anti-cheater &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your wife cheated on you 3 times that you know of and this is your stance ? Grow some ball and self respect, will you? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcmmh7", "score_hidden": false, "stickied": false, "created": 1492408033.0, "created_utc": 1492379233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcptjh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Pepe4Prez", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You don't need a therapist. You need a lawyer. She cheated. No if, ands or buts. You guys are MARRIED. You didn't agree to an open marriage, but you're in one now. Actually, I wouldn't even call it that because that would imply that you're getting some too. Nope, this is flat out cuckoldry. \n\nI mean, you have given this woman everything you can, invested soooo much and she won't even blow you, but she will wrap her mouth around some random dude the second you give her space? okay.\n\nLook, her behavior is predictable at this point. She will never really take responsibility for what she does, she will instead become such a headcase that, again, you have to put your own feelings aside to care for HER. So... who cares for YOU, op? Who? It sure as shit isn't your WIFE, whom you swore an oath of LOYALTY and FIDELITY, not one of BETRAYAL and CUCKOLDRY. She obviously thinks it was the latter though.\n\nI think you need to draw the line here. This was a bridge too far and you don't owe her anything at this point. Move back into your home, burn those fucking sheets, let her keep the bed in the divorce. If she  tries any of her suicide nonsense, call the cops. Make her sleep on the couch, and keep a recorder handy just in case. Finally, have her write a timeline of the affair and have her send it to your email from her email. Say you need to know everything before you decide whether you reconcile, but just use it in court to file for adultery. Finally, DO NOT SLEEP WITH HER unless you have resigned yourself to a lifetime of cuckdom. In many jurisdictions, you forfeit your rights to sue for adultery if you do because they view banging her as \"condoning\" what she did. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t need a therapist. You need a lawyer. She cheated. No if, ands or buts. You guys are MARRIED. You didn&amp;#39;t agree to an open marriage, but you&amp;#39;re in one now. Actually, I wouldn&amp;#39;t even call it that because that would imply that you&amp;#39;re getting some too. Nope, this is flat out cuckoldry. &lt;/p&gt;\n\n&lt;p&gt;I mean, you have given this woman everything you can, invested soooo much and she won&amp;#39;t even blow you, but she will wrap her mouth around some random dude the second you give her space? okay.&lt;/p&gt;\n\n&lt;p&gt;Look, her behavior is predictable at this point. She will never really take responsibility for what she does, she will instead become such a headcase that, again, you have to put your own feelings aside to care for HER. So... who cares for YOU, op? Who? It sure as shit isn&amp;#39;t your WIFE, whom you swore an oath of LOYALTY and FIDELITY, not one of BETRAYAL and CUCKOLDRY. She obviously thinks it was the latter though.&lt;/p&gt;\n\n&lt;p&gt;I think you need to draw the line here. This was a bridge too far and you don&amp;#39;t owe her anything at this point. Move back into your home, burn those fucking sheets, let her keep the bed in the divorce. If she  tries any of her suicide nonsense, call the cops. Make her sleep on the couch, and keep a recorder handy just in case. Finally, have her write a timeline of the affair and have her send it to your email from her email. Say you need to know everything before you decide whether you reconcile, but just use it in court to file for adultery. Finally, DO NOT SLEEP WITH HER unless you have resigned yourself to a lifetime of cuckdom. In many jurisdictions, you forfeit your rights to sue for adultery if you do because they view banging her as &amp;quot;condoning&amp;quot; what she did. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcptjh", "score_hidden": false, "stickied": false, "created": 1492412355.0, "created_utc": 1492383555.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcl4ha", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t1_dgcjp4c", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You could have a future together but she needs to agree to counselling. Like I said in my other comment, are you really going to let her keep working with the cook who put his dick in her mouth?\n\nEvery day when she goes to work and sees this guy you will wonder what they are doing in their break :(  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could have a future together but she needs to agree to counselling. Like I said in my other comment, are you really going to let her keep working with the cook who put his dick in her mouth?&lt;/p&gt;\n\n&lt;p&gt;Every day when she goes to work and sees this guy you will wonder what they are doing in their break :(  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcl4ha", "score_hidden": false, "stickied": false, "created": 1492406078.0, "created_utc": 1492377278.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjp4c", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "MarriageTaW", "parent_id": "t1_dgcidnu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I have always wanted to get couples help with her, but she hasn't ever really committed to it.  She more entertains the idea because I bring it up.\n\nI really do love her and can see a good future for us, but some part of me thinks my heart is playing myself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have always wanted to get couples help with her, but she hasn&amp;#39;t ever really committed to it.  She more entertains the idea because I bring it up.&lt;/p&gt;\n\n&lt;p&gt;I really do love her and can see a good future for us, but some part of me thinks my heart is playing myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjp4c", "score_hidden": false, "stickied": false, "created": 1492404212.0, "created_utc": 1492375412.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcidnu", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Chimera99", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Cutting, talking about suicide, hooking up the week after a separation with a random guy from work...don't pretend that this lady doesn't have serious serious emotional issues that will need to be addressed if you really want to move forward with her. \n\nEven if she commits to some serious therapy and couples counseling it might take years for her to get better, meanwhile at 24 you're missing out on opportunities to have a more trusting and effective partnership with someone. I'd factor this in to your final decision.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cutting, talking about suicide, hooking up the week after a separation with a random guy from work...don&amp;#39;t pretend that this lady doesn&amp;#39;t have serious serious emotional issues that will need to be addressed if you really want to move forward with her. &lt;/p&gt;\n\n&lt;p&gt;Even if she commits to some serious therapy and couples counseling it might take years for her to get better, meanwhile at 24 you&amp;#39;re missing out on opportunities to have a more trusting and effective partnership with someone. I&amp;#39;d factor this in to your final decision.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcidnu", "score_hidden": false, "stickied": false, "created": 1492402503.0, "created_utc": 1492373703.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcpes2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "capilot", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If the break was her idea, then I'd say this was her plan all along.\n\nIf it was your idea, then it could be just the way she says. A lot of people will immediately go out and find someone else to sleep with when they've been dumped, just to show they can. And women find it extremely easy to do so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the break was her idea, then I&amp;#39;d say this was her plan all along.&lt;/p&gt;\n\n&lt;p&gt;If it was your idea, then it could be just the way she says. A lot of people will immediately go out and find someone else to sleep with when they&amp;#39;ve been dumped, just to show they can. And women find it extremely easy to do so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcpes2", "score_hidden": false, "stickied": false, "created": 1492411797.0, "created_utc": 1492382997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcy1ao", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bobbyg06", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "wait - she is sucking another guy's dick and has never even sucked yours? her husband? jesus! she sounds like a keeper...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wait - she is sucking another guy&amp;#39;s dick and has never even sucked yours? her husband? jesus! she sounds like a keeper...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcy1ao", "score_hidden": false, "stickied": false, "created": 1492423418.0, "created_utc": 1492394618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgd2xc4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "24carats", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You proposed the separation, but didn't discuss things like seeing other people. Ross and Rachel \"We were on a break!\" It's muddy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You proposed the separation, but didn&amp;#39;t discuss things like seeing other people. Ross and Rachel &amp;quot;We were on a break!&amp;quot; It&amp;#39;s muddy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd2xc4", "score_hidden": false, "stickied": false, "created": 1492430486.0, "created_utc": 1492401686.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcki9h", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Form1040", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;She seemed to think this was a good idea and was genuinely happy \n\nYeah, I bet she thought it was a good idea. \n\nWhen women want a break it is ALWAYS ALWAYS ALWAYS to fuck another guy. Generally she has him in the pipeline and ready to go. \n\nDivorce. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She seemed to think this was a good idea and was genuinely happy &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, I bet she thought it was a good idea. &lt;/p&gt;\n\n&lt;p&gt;When women want a break it is ALWAYS ALWAYS ALWAYS to fuck another guy. Generally she has him in the pipeline and ready to go. &lt;/p&gt;\n\n&lt;p&gt;Divorce. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcki9h", "score_hidden": false, "stickied": false, "created": 1492405262.0, "created_utc": 1492376462.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcpwqk", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She didn't do it because you separated.  This is the guy that helped **cause** the separation.\n\n&gt;Some part of me believes her when she says it just happened. \n\nThat's your pussy speaking.\n\n&gt;I know that since I left she has been through like 3 bottles of tequila and she is a lightweight.\n\nListen to all the justification you're doing for your whore.\n\n&gt;She has been feeling a dark spiral of emotionless-ness and not caring about anything and I really don't think she is in a place to plan something like this.\n\nPussies like you believe your women are helpless and naive and their sucking of other cock \"isn't their fault.\"\n\n&gt;My concern is that those relationships have conditioned her to what a relationship is and no matter how much she says she hates cheaters, there is a part of her that will mirror what happened to her before.\n\nThat's right, \"Captain Save-A-Ho.\"  You *save* her!  Show her what a true, white knight can do for her... which is be the pussy who makes excuses for her while she gargles random cum.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She didn&amp;#39;t do it because you separated.  This is the guy that helped &lt;strong&gt;cause&lt;/strong&gt; the separation.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Some part of me believes her when she says it just happened. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s your pussy speaking.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I know that since I left she has been through like 3 bottles of tequila and she is a lightweight.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Listen to all the justification you&amp;#39;re doing for your whore.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She has been feeling a dark spiral of emotionless-ness and not caring about anything and I really don&amp;#39;t think she is in a place to plan something like this.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Pussies like you believe your women are helpless and naive and their sucking of other cock &amp;quot;isn&amp;#39;t their fault.&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My concern is that those relationships have conditioned her to what a relationship is and no matter how much she says she hates cheaters, there is a part of her that will mirror what happened to her before.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s right, &amp;quot;Captain Save-A-Ho.&amp;quot;  You &lt;em&gt;save&lt;/em&gt; her!  Show her what a true, white knight can do for her... which is be the pussy who makes excuses for her while she gargles random cum.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcpwqk", "score_hidden": false, "stickied": false, "created": 1492412479.0, "created_utc": 1492383679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcqws9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ronald_Dillons", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Are you trollin'? Of fucking course this is cheating! Setting aside that backstory that should already clue you in on what you need to do, you separated - by distance and not divorce, is what I'm getting - and she immediately gets busy with a guy she knows from work. Let me guess, she said some suicidal shit to keep you around afterwards? Get the fuck out of there, my dude!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you trollin&amp;#39;? Of fucking course this is cheating! Setting aside that backstory that should already clue you in on what you need to do, you separated - by distance and not divorce, is what I&amp;#39;m getting - and she immediately gets busy with a guy she knows from work. Let me guess, she said some suicidal shit to keep you around afterwards? Get the fuck out of there, my dude!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcqws9", "score_hidden": false, "stickied": false, "created": 1492413868.0, "created_utc": 1492385068.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcu46i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ImFreeMan", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "How many more red flags do you need?\n\n\nDude just be grateful you don't have kids. Your love means shit to her. \n\n\nShe has issues, and nothing you can do will heal those up, she will always be looking for that reassurance that she is enough, and no matter how many guys she goes through she will never get it. And you will ever be wondering if she is up to no good.\n\n\n\nGet a backbone would ya ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How many more red flags do you need?&lt;/p&gt;\n\n&lt;p&gt;Dude just be grateful you don&amp;#39;t have kids. Your love means shit to her. &lt;/p&gt;\n\n&lt;p&gt;She has issues, and nothing you can do will heal those up, she will always be looking for that reassurance that she is enough, and no matter how many guys she goes through she will never get it. And you will ever be wondering if she is up to no good.&lt;/p&gt;\n\n&lt;p&gt;Get a backbone would ya ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcu46i", "score_hidden": false, "stickied": false, "created": 1492418204.0, "created_utc": 1492389404.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgdblnc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chief_slap_ahoe", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Dude pull your head out of your ass. It was planned. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude pull your head out of your ass. It was planned. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdblnc", "score_hidden": false, "stickied": false, "created": 1492451654.0, "created_utc": 1492422854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgdlx1o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Prince-Gnarls", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;Then she said she stated to give him head but when they were going to have sex she couldn't go through with it. This is especially hurtful because she had a past experience where the guy forced her to give him head\n\nA few things stick out to me. Firstly, with cheaters it seems like admitting only cheating for 'a second' or 'only going so far' is a common theme to not only alliviate guilt from their own conscience but to give enough details so as not to do serious damage to their character. Ergo she likely went all the way with this guy!\n\nSecondly, the time where she was 'forced' to give someone head is likely another of these scenarios. There is a thing among cheaters people like to call 'regret sex' (you would have seen plenty of it in the media) where normally the woman cheats, regrets it and then makes accusations of rape/sexual assault to manoeuvre herself into the victim position to receive pity instead of critisism.\n\nThe other times where she has clearly cheated on you and has come up with excuses removing herself from any responsibility should give you an idea of the type of character would who cheat and lie/deflect like in the way I described in the first two paragraphs.\n\nGet rid of her. She doesn't know how to be faithful or even take responsibility. You'll live an anxious life wondering where she is and what she's doing for the rest of your days together!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Then she said she stated to give him head but when they were going to have sex she couldn&amp;#39;t go through with it. This is especially hurtful because she had a past experience where the guy forced her to give him head&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A few things stick out to me. Firstly, with cheaters it seems like admitting only cheating for &amp;#39;a second&amp;#39; or &amp;#39;only going so far&amp;#39; is a common theme to not only alliviate guilt from their own conscience but to give enough details so as not to do serious damage to their character. Ergo she likely went all the way with this guy!&lt;/p&gt;\n\n&lt;p&gt;Secondly, the time where she was &amp;#39;forced&amp;#39; to give someone head is likely another of these scenarios. There is a thing among cheaters people like to call &amp;#39;regret sex&amp;#39; (you would have seen plenty of it in the media) where normally the woman cheats, regrets it and then makes accusations of rape/sexual assault to manoeuvre herself into the victim position to receive pity instead of critisism.&lt;/p&gt;\n\n&lt;p&gt;The other times where she has clearly cheated on you and has come up with excuses removing herself from any responsibility should give you an idea of the type of character would who cheat and lie/deflect like in the way I described in the first two paragraphs.&lt;/p&gt;\n\n&lt;p&gt;Get rid of her. She doesn&amp;#39;t know how to be faithful or even take responsibility. You&amp;#39;ll live an anxious life wondering where she is and what she&amp;#39;s doing for the rest of your days together!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdlx1o", "score_hidden": false, "stickied": false, "created": 1492471137.0, "created_utc": 1492442337.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgdqz75", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yourworldismytvshow", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You sir are a doormat grow a spine and be a man. I've read through your responses and you're being a weak needy pussy. She has walked all over you and you're enabling her to do it. Get some pride about yourself!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sir are a doormat grow a spine and be a man. I&amp;#39;ve read through your responses and you&amp;#39;re being a weak needy pussy. She has walked all over you and you&amp;#39;re enabling her to do it. Get some pride about yourself!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdqz75", "score_hidden": false, "stickied": false, "created": 1492476873.0, "created_utc": 1492448073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgdrjs3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wizardglick", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "So she wants to separate to clear heads and she decides to increase the problems you're both having by cheating on you?   You're still married so yes, she cheated on you (yet again!).  Exactly when are you going to wake up and realize she's using you over and over again?  She doesn't love you and obviously doesn't respect you at all.  And you're constantly going back with her shows her you don't expect any respect.  Dump her now, please", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So she wants to separate to clear heads and she decides to increase the problems you&amp;#39;re both having by cheating on you?   You&amp;#39;re still married so yes, she cheated on you (yet again!).  Exactly when are you going to wake up and realize she&amp;#39;s using you over and over again?  She doesn&amp;#39;t love you and obviously doesn&amp;#39;t respect you at all.  And you&amp;#39;re constantly going back with her shows her you don&amp;#39;t expect any respect.  Dump her now, please&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdrjs3", "score_hidden": false, "stickied": false, "created": 1492477510.0, "created_utc": 1492448710.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcqhd5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t1_dgclckp", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I thought as much sorry for you man, you should put your feelings first this time this is a big betrayal. Sounds like her family did a number on her, you need to get a proper apology this time if you take her back though which it sounds like you will.\n\nAnd book some therapy for her, make her go or she will do it again. Good luck with fixing the marriage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought as much sorry for you man, you should put your feelings first this time this is a big betrayal. Sounds like her family did a number on her, you need to get a proper apology this time if you take her back though which it sounds like you will.&lt;/p&gt;\n\n&lt;p&gt;And book some therapy for her, make her go or she will do it again. Good luck with fixing the marriage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcqhd5", "score_hidden": false, "stickied": false, "created": 1492413282.0, "created_utc": 1492384482.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclckp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarriageTaW", "parent_id": "t1_dgcjigt", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;no she isn't sorry about cheating she is sorry about feeling incredibly guilty\n\nThis part struck home with me because I have always had an issue with how she gets upset.  She always talks about how she feels terrible for hurting me, or she feels like she is the worst person, or she feels so guilty about whatever.  It seems like the focus is on how bad she feels about the situation and not how it effects me.\n\nWe talked about it and I know she hates saying \"I'm sorry\" because of some history with her mom, who is rather messed up, and thinks that it is a meaningless gesture.  She said that I am not listing to why she feels bad and if she didn't care about me she would feel bad.  Its hard to know what she feels bad about.\n\nWhen the second event I wrote about happened in college I felt like I had about 30 seconds to feel upset and hurt after she told me.  After that I ended up comforting her and telling her we would work through it and I would forgive her.  I didn't want her to drive back to her school because I thought she might intentionally crash.  It made me feel like I was cheated out of feeling upset over her screw up.  It seemed like she took letting another guy feel her up and flipped it into me comforting her about how awful she felt about it.  Looking back on it I should have stood my ground and let her know how pissed and hurt I was, but my concern for her overtook that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;no she isn&amp;#39;t sorry about cheating she is sorry about feeling incredibly guilty&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This part struck home with me because I have always had an issue with how she gets upset.  She always talks about how she feels terrible for hurting me, or she feels like she is the worst person, or she feels so guilty about whatever.  It seems like the focus is on how bad she feels about the situation and not how it effects me.&lt;/p&gt;\n\n&lt;p&gt;We talked about it and I know she hates saying &amp;quot;I&amp;#39;m sorry&amp;quot; because of some history with her mom, who is rather messed up, and thinks that it is a meaningless gesture.  She said that I am not listing to why she feels bad and if she didn&amp;#39;t care about me she would feel bad.  Its hard to know what she feels bad about.&lt;/p&gt;\n\n&lt;p&gt;When the second event I wrote about happened in college I felt like I had about 30 seconds to feel upset and hurt after she told me.  After that I ended up comforting her and telling her we would work through it and I would forgive her.  I didn&amp;#39;t want her to drive back to her school because I thought she might intentionally crash.  It made me feel like I was cheated out of feeling upset over her screw up.  It seemed like she took letting another guy feel her up and flipped it into me comforting her about how awful she felt about it.  Looking back on it I should have stood my ground and let her know how pissed and hurt I was, but my concern for her overtook that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgclckp", "score_hidden": false, "stickied": false, "created": 1492406363.0, "created_utc": 1492377563.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjigt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She cheated it was cheating. She likely had this already guy lined up and sucked his dick within 2 days and knew about the crush , no she isn't sorry about cheating she is sorry about feeling incredibly guilty, while this guys dick was in her mouth she realized what a truly disgusting and vile person she was and so she stopped. Cheaters guilt stopped her fucking him not her love for you.\n\n&gt;  This is the first time I have really considered giving up on her and I feel like my trust in her is shattered.\n\nShe is a multiple cheater and emotionally blackmails you to get you to forgive her. She is not worthy of you.\n\nYou have 2 options that will return your self respect and dignity somewhat\n\nOption 1- Serve her with divorce papers asap, she cheated so make plans to walk away and cut contact until the divorce is finalized. Move away. Do not answer her calls or read her texts all contact via your lawyer\n\nOption 2- If you want to give her a second chance (you shouldn't). You go see her and you tell her to quit her job IMMEDIATELY that you cannot be with her if she is working with some guy whose dick she sucked. Tell her the break is over that she cannot even be trusted to stay faithful.\n\nTell her you are going to find a lawyer and either the break ends and she quits her job or you will go ahead with the divorce. Tell her that if she wants to get back with you you want fucking blowjobs and not to hear any of her lame excuses.\n\nTell her she gets some therapy for her infidelity and cheating tendencies, even couples counselling\n\nAnything other than her leaving her job and being a full sexual partner to you makes you a fool unfortunately. She has to prove her love and commitment not you. Leaves her job, becomes a faithful loving wife who gives you head\n\nI cannot stress this enough either she quits her job or you must divorce her, you will never trust her again unless she does and she won't even tell you who this guy is.\n\nvery sorry for you OP", "edited": 1492375670.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She cheated it was cheating. She likely had this already guy lined up and sucked his dick within 2 days and knew about the crush , no she isn&amp;#39;t sorry about cheating she is sorry about feeling incredibly guilty, while this guys dick was in her mouth she realized what a truly disgusting and vile person she was and so she stopped. Cheaters guilt stopped her fucking him not her love for you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This is the first time I have really considered giving up on her and I feel like my trust in her is shattered.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She is a multiple cheater and emotionally blackmails you to get you to forgive her. She is not worthy of you.&lt;/p&gt;\n\n&lt;p&gt;You have 2 options that will return your self respect and dignity somewhat&lt;/p&gt;\n\n&lt;p&gt;Option 1- Serve her with divorce papers asap, she cheated so make plans to walk away and cut contact until the divorce is finalized. Move away. Do not answer her calls or read her texts all contact via your lawyer&lt;/p&gt;\n\n&lt;p&gt;Option 2- If you want to give her a second chance (you shouldn&amp;#39;t). You go see her and you tell her to quit her job IMMEDIATELY that you cannot be with her if she is working with some guy whose dick she sucked. Tell her the break is over that she cannot even be trusted to stay faithful.&lt;/p&gt;\n\n&lt;p&gt;Tell her you are going to find a lawyer and either the break ends and she quits her job or you will go ahead with the divorce. Tell her that if she wants to get back with you you want fucking blowjobs and not to hear any of her lame excuses.&lt;/p&gt;\n\n&lt;p&gt;Tell her she gets some therapy for her infidelity and cheating tendencies, even couples counselling&lt;/p&gt;\n\n&lt;p&gt;Anything other than her leaving her job and being a full sexual partner to you makes you a fool unfortunately. She has to prove her love and commitment not you. Leaves her job, becomes a faithful loving wife who gives you head&lt;/p&gt;\n\n&lt;p&gt;I cannot stress this enough either she quits her job or you must divorce her, you will never trust her again unless she does and she won&amp;#39;t even tell you who this guy is.&lt;/p&gt;\n\n&lt;p&gt;very sorry for you OP&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjigt", "score_hidden": false, "stickied": false, "created": 1492403971.0, "created_utc": 1492375171.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgciw7t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scratchingcats", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Better to end things now homie, this is not going ot work. She wants to fool around. Idk if having been married so young has anything to do with it, but she certainly wasn't ready for a fully committed relationship, and it looks like there were plenty of red flags.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Better to end things now homie, this is not going ot work. She wants to fool around. Idk if having been married so young has anything to do with it, but she certainly wasn&amp;#39;t ready for a fully committed relationship, and it looks like there were plenty of red flags.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgciw7t", "score_hidden": false, "stickied": false, "created": 1492403162.0, "created_utc": 1492374362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgckukr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Form1040", "parent_id": "t1_dgcjrz6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah. \"Forsaking ALL OTHERS 'til death do us part.\"\n\nYou know, vows. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. &amp;quot;Forsaking ALL OTHERS &amp;#39;til death do us part.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You know, vows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgckukr", "score_hidden": false, "stickied": false, "created": 1492405728.0, "created_utc": 1492376928.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjrz6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t1_dgcikml", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "What are you talking about? She cheated. **She is his wife** not a girlfriend or fwb, their separation was temporary to work on issues neither said their marital vows were null and void\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are you talking about? She cheated. &lt;strong&gt;She is his wife&lt;/strong&gt; not a girlfriend or fwb, their separation was temporary to work on issues neither said their marital vows were null and void&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjrz6", "score_hidden": false, "stickied": false, "created": 1492404311.0, "created_utc": 1492375511.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65r2b0", "likes": null, "replies": "", "user_reports": [], "id": "dgcpyss", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t1_dgcjkg1", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "The amount of deflection you do is astounding.  No wonder your *wife* will suck every cock BUT yours.  Your cock is inverted so far, you've got an honorary pussy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The amount of deflection you do is astounding.  No wonder your &lt;em&gt;wife&lt;/em&gt; will suck every cock BUT yours.  Your cock is inverted so far, you&amp;#39;ve got an honorary pussy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcpyss", "score_hidden": false, "stickied": false, "created": 1492412557.0, "created_utc": 1492383757.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjkg1", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "MarriageTaW", "parent_id": "t1_dgcikml", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That is part of why I feel like I can't get super mad at her.  We did not explicitly discuss that as a rule in the separation, but I feel like the spirit and conditions of the action still warrants cheating.  This might be unfair to her, but it is how I feel.\n\nThe self-harm and suicide threats have caused huge problems for us because it made me try to protect her too much.  She hates when I walk on egg shells around her and don't communicate to protect her feelings.  She has changed over the years and most of that stuff was in the first two years, but it still affects my ability to communicate with her out of fear of her reaction.  It's not fair to her because I don't treat her like she can handle stuff, but there was never a clear line for me where I knew that she wouldn't harm herself.  Looking back I should have treated her with more respect, but the memories of how she would spiral down were always weighing on me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is part of why I feel like I can&amp;#39;t get super mad at her.  We did not explicitly discuss that as a rule in the separation, but I feel like the spirit and conditions of the action still warrants cheating.  This might be unfair to her, but it is how I feel.&lt;/p&gt;\n\n&lt;p&gt;The self-harm and suicide threats have caused huge problems for us because it made me try to protect her too much.  She hates when I walk on egg shells around her and don&amp;#39;t communicate to protect her feelings.  She has changed over the years and most of that stuff was in the first two years, but it still affects my ability to communicate with her out of fear of her reaction.  It&amp;#39;s not fair to her because I don&amp;#39;t treat her like she can handle stuff, but there was never a clear line for me where I knew that she wouldn&amp;#39;t harm herself.  Looking back I should have treated her with more respect, but the memories of how she would spiral down were always weighing on me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcjkg1", "score_hidden": false, "stickied": false, "created": 1492404046.0, "created_utc": 1492375246.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcikml", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65r2b0", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "[deleted]", "edited": 1492374164.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcikml", "score_hidden": false, "stickied": false, "created": 1492402752.0, "created_utc": 1492373952.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]