[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel so terrible for even feeling this way but sometimes I think of being with other women, I think of how my time could be spent better just working towards my future, and I feel like being in a relationship is killing those dreams and aspirations I have. &lt;/p&gt;\n\n&lt;p&gt;I have been with this girl for 2 years and loved her from the start, but over the past 6-8 months we&amp;#39;ve just been on the rocks, and I understand everyone goes through a rough patch, but how we&amp;#39;ve been is just not right. I think it was at that point I started realizing that I&amp;#39;d rather be spending my time on my own, and on myself and not sharing it. It&amp;#39;s sad because I was actually looking forward to marrying her, We even met each other&amp;#39;s parents and everything but now it&amp;#39;s just so many doubts about her. &lt;/p&gt;\n\n&lt;p&gt;For example she doesn&amp;#39;t get along with my siblings, and is too judgemental, which is a little annoying, and at first I guess I used to brush it over the shoulder and it slowly started to bug me little by little. She&amp;#39;s a little clingy, too demanding for my attention, too sensitive and takes too many things to heart. &lt;/p&gt;\n\n&lt;p&gt;I like to believe that these things also contribute to me losing feelings for her, I can&amp;#39;t say I love her like I used to. Sometimes I feel like I&amp;#39;d rather be at home or doing my own thing rather than be chilling with her. &lt;/p&gt;\n\n&lt;p&gt;Also with her I can&amp;#39;t reach my financial goals, I want to save and buy my first house, get whatever car I want even if she thinks it&amp;#39;s ugly. I don&amp;#39;t want to think of her first, maybe not yet, maybe when I am satisfied where I am in life.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m very easily distracted and even when I was single I procrastinated but I think I can do it now with the motivation I have. I have started a couple things, I&amp;#39;ve started a real estate course and started to do basic stock trading, but I strongly believe that if I was on my own, single I would&amp;#39;ve been much far ahead in these studies, to achieving some of my goals if I weren&amp;#39;t in a relationship. I have been overspending financially, and I&amp;#39;m a guy that can&amp;#39;t see her sad. And I&amp;#39;ve tried breaking up with her but her tears always get me. &lt;/p&gt;\n\n&lt;p&gt;She truly loves me so much and I don&amp;#39;t think anyone will love me or care for me as much as she will. She is a one of a kind girl, she&amp;#39;s someone I would consider marrying, she&amp;#39;s loyal to a fault and I could never suspect her of doing any wrong. She&amp;#39;s a 11/10 guys, and I&amp;#39;m stupid for even thinking of all of this but I cannot help but thinking that I&amp;#39;m missing out on opportunities like these. Certain jobs that I have given up to be with her and I&amp;#39;m already regretting it right now. I&amp;#39;m 24, and I want to be somewhere, start something, build good habits, make connections and have a happy life. &lt;/p&gt;\n\n&lt;p&gt;At the same time i don&amp;#39;t know if I can meet another individual like her, my dad, a successful businessman has said that I&amp;#39;m wasting my time being with her, my siblings who love this girl say that she&amp;#39;s holding me back. My gut tells me the same thing but I don&amp;#39;t know how to break it to her. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m at cross roads Reddit, and I need some advice, I know I can be somewhere but to get there I feel like I have to do it without her, and i know it&amp;#39;s not going to be a walk in the park by I have friends my age who are successful, being with her I miss out on hanging out with these bright minded people. I know it&amp;#39;s much more than that and it still won&amp;#39;t be a walk in the park but I have what it takes but I won&amp;#39;t be able to do it with her in the picture.  With her I don&amp;#39;t think I&amp;#39;ll get to most of those goals, and she does hold me back in a sense. Even if I go this route how can I break it to her? In the most unhurtful way? I already wasted her two years, I led her on, I told her I truest loved her these last 6 months when I actually had some hesitation in my heart. I lied, I lied to her about my feelings for 6 months. But it was only to save her from the pain, but now I&amp;#39;m regretting it because it&amp;#39;s only going to hurt her more.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t say that I&amp;#39;m fully happy, I love her but I don&amp;#39;t fully love her, because then none of these things will be an issue. None of this would matter, she would be the greatest goal, but sadly that is not so. So reddit give me your thoughts and opinions. She&amp;#39;s such a sweet sweet girl. &lt;/p&gt;\n\n&lt;p&gt;Tl;dr: fell in love with a girl from school, made plans with her that I&amp;#39;d marry her, but instead I lost feelings slowly, hurt her every step of the way because I just wanted to be selfish, I just cared about myself and I think that&amp;#39;s how I have to be in order to get where I want to be. I have ambitions and dreams and goals that I will strive to achieve but is it worth losing the perfect girl? The sweetest girl, who checks all the boxes? I don&amp;#39;t know, I love her, but I love myself much much more, and I can&amp;#39;t always put her before myself, I can&amp;#39;t always honk of her first and think of her feelings. She even knows it but love makes you blind. I&amp;#39;m like the guy who is just happy she&amp;#39;s there but wouldn&amp;#39;t really be affected much if she left or we broke up. But she would cry for months.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I feel so terrible for even feeling this way but sometimes I think of being with other women, I think of how my time could be spent better just working towards my future, and I feel like being in a relationship is killing those dreams and aspirations I have. \n\nI have been with this girl for 2 years and loved her from the start, but over the past 6-8 months we've just been on the rocks, and I understand everyone goes through a rough patch, but how we've been is just not right. I think it was at that point I started realizing that I'd rather be spending my time on my own, and on myself and not sharing it. It's sad because I was actually looking forward to marrying her, We even met each other's parents and everything but now it's just so many doubts about her. \n\nFor example she doesn't get along with my siblings, and is too judgemental, which is a little annoying, and at first I guess I used to brush it over the shoulder and it slowly started to bug me little by little. She's a little clingy, too demanding for my attention, too sensitive and takes too many things to heart. \n\nI like to believe that these things also contribute to me losing feelings for her, I can't say I love her like I used to. Sometimes I feel like I'd rather be at home or doing my own thing rather than be chilling with her. \n\nAlso with her I can't reach my financial goals, I want to save and buy my first house, get whatever car I want even if she thinks it's ugly. I don't want to think of her first, maybe not yet, maybe when I am satisfied where I am in life.\n\nI'm very easily distracted and even when I was single I procrastinated but I think I can do it now with the motivation I have. I have started a couple things, I've started a real estate course and started to do basic stock trading, but I strongly believe that if I was on my own, single I would've been much far ahead in these studies, to achieving some of my goals if I weren't in a relationship. I have been overspending financially, and I'm a guy that can't see her sad. And I've tried breaking up with her but her tears always get me. \n\nShe truly loves me so much and I don't think anyone will love me or care for me as much as she will. She is a one of a kind girl, she's someone I would consider marrying, she's loyal to a fault and I could never suspect her of doing any wrong. She's a 11/10 guys, and I'm stupid for even thinking of all of this but I cannot help but thinking that I'm missing out on opportunities like these. Certain jobs that I have given up to be with her and I'm already regretting it right now. I'm 24, and I want to be somewhere, start something, build good habits, make connections and have a happy life. \n\nAt the same time i don't know if I can meet another individual like her, my dad, a successful businessman has said that I'm wasting my time being with her, my siblings who love this girl say that she's holding me back. My gut tells me the same thing but I don't know how to break it to her. \n\nI'm at cross roads Reddit, and I need some advice, I know I can be somewhere but to get there I feel like I have to do it without her, and i know it's not going to be a walk in the park by I have friends my age who are successful, being with her I miss out on hanging out with these bright minded people. I know it's much more than that and it still won't be a walk in the park but I have what it takes but I won't be able to do it with her in the picture.  With her I don't think I'll get to most of those goals, and she does hold me back in a sense. Even if I go this route how can I break it to her? In the most unhurtful way? I already wasted her two years, I led her on, I told her I truest loved her these last 6 months when I actually had some hesitation in my heart. I lied, I lied to her about my feelings for 6 months. But it was only to save her from the pain, but now I'm regretting it because it's only going to hurt her more.\n\nI can't say that I'm fully happy, I love her but I don't fully love her, because then none of these things will be an issue. None of this would matter, she would be the greatest goal, but sadly that is not so. So reddit give me your thoughts and opinions. She's such a sweet sweet girl. \n\n\nTl;dr: fell in love with a girl from school, made plans with her that I'd marry her, but instead I lost feelings slowly, hurt her every step of the way because I just wanted to be selfish, I just cared about myself and I think that's how I have to be in order to get where I want to be. I have ambitions and dreams and goals that I will strive to achieve but is it worth losing the perfect girl? The sweetest girl, who checks all the boxes? I don't know, I love her, but I love myself much much more, and I can't always put her before myself, I can't always honk of her first and think of her feelings. She even knows it but love makes you blind. I'm like the guy who is just happy she's there but wouldn't really be affected much if she left or we broke up. But she would cry for months.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65si3a", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "Naim12345", "saved": false, "mod_reports": [], "name": "t3_65si3a", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65si3a/is_it_wrong_to_suddenly_give_in_to_my_24m/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418710.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65si3a/is_it_wrong_to_suddenly_give_in_to_my_24m/", "author_flair_text": null, "quarantine": false, "title": "Is it wrong to suddenly give in to my [24M] selfishness and break up with my gf[22] of two years?", "created_utc": 1492389910.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65si3a", "likes": null, "replies": "", "user_reports": [], "id": "dgcv4cn", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "zBuckets", "parent_id": "t3_65si3a", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "OP man you are in a pickle right now and I know where you're at because I am on the other end of the spectrum sort of. I'm 23 doing my own thing on the single side with the my own place, looking at the car and focusing on the career. I'm going to go on a rant so just bear with me okay?\n\nYou are in love with this girl. My father told me a good piece of advice when it comes to breaking up with a girl. If you get that feeling that you're about to hate yourself because you're going to break up with her then that means you genuinely care about her. Think about it for a second, if you didn't love her, why would her crying really STOP you from ending things?\n\nWhich leads me to my next point. TAKE SOME TIME FOR YOURSELF. You are not in good headspace to decide about breaking up with what you have called a great girl. You are annoyed, feel relationship claustrophobia and you are looking for excuses to get out of the relationship. You are going to start seeing certain interactions as always negative because you are trying to find a reason to end things. IDK how you clear your headspace, maybe take a weekend to be truly truly alone. No cell phone, no guy time, nothing. Just you, see how lonely it really is. maybe do that for two weeks. You have been dating a girl for 2 years, you should be able to communicate you need to just do some solo guy time. \n\nTalk to your single friends about everything but YOUR relationship. Really sit back and listen to what your single friends are up to, are you that jealous of their life? Or do you realize how good you have it?\n\nFinally, COMMUNICATION. Talk to your girlfriend my man. Don't text her and be like \"we need to talk\" that's not fair. Make dinner, hang aroun the house and just bring it up. \"Babe, I have been having a hard time growing up\".  Dude, we are young guys, and we are all learning so much about our lives right now. We are learning about being on our own, financial stability (or instability for some), and independence. She's going through the same stuff and you two may be growing in different directions. Open that dialogue, she's your girlfriend and possibly your best friend at this point, you can talk about this. BUT do NOT ask her to change or make an unfair deal if shes that clingy. Do not abuse her love.\n\n\nBONUS. dude you're dating, and you're young. It's cool to be away from each other. take this piece of advice from my married older brother. \"You have your entire life to be married. Stop trying to play house/the married couple. When you see her, go do something. That can mean dinner, a hike, going to the gym or anything else you can think of. Stop sitting at home all the time, be friends first, lovers second (but do that as much as you can. AFTER the activity you planned).\n\nGood luck man, don't try to argue with the advice anyone else tries to give you, just soak it in and make your decision after meditating/sleeping on it.\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP man you are in a pickle right now and I know where you&amp;#39;re at because I am on the other end of the spectrum sort of. I&amp;#39;m 23 doing my own thing on the single side with the my own place, looking at the car and focusing on the career. I&amp;#39;m going to go on a rant so just bear with me okay?&lt;/p&gt;\n\n&lt;p&gt;You are in love with this girl. My father told me a good piece of advice when it comes to breaking up with a girl. If you get that feeling that you&amp;#39;re about to hate yourself because you&amp;#39;re going to break up with her then that means you genuinely care about her. Think about it for a second, if you didn&amp;#39;t love her, why would her crying really STOP you from ending things?&lt;/p&gt;\n\n&lt;p&gt;Which leads me to my next point. TAKE SOME TIME FOR YOURSELF. You are not in good headspace to decide about breaking up with what you have called a great girl. You are annoyed, feel relationship claustrophobia and you are looking for excuses to get out of the relationship. You are going to start seeing certain interactions as always negative because you are trying to find a reason to end things. IDK how you clear your headspace, maybe take a weekend to be truly truly alone. No cell phone, no guy time, nothing. Just you, see how lonely it really is. maybe do that for two weeks. You have been dating a girl for 2 years, you should be able to communicate you need to just do some solo guy time. &lt;/p&gt;\n\n&lt;p&gt;Talk to your single friends about everything but YOUR relationship. Really sit back and listen to what your single friends are up to, are you that jealous of their life? Or do you realize how good you have it?&lt;/p&gt;\n\n&lt;p&gt;Finally, COMMUNICATION. Talk to your girlfriend my man. Don&amp;#39;t text her and be like &amp;quot;we need to talk&amp;quot; that&amp;#39;s not fair. Make dinner, hang aroun the house and just bring it up. &amp;quot;Babe, I have been having a hard time growing up&amp;quot;.  Dude, we are young guys, and we are all learning so much about our lives right now. We are learning about being on our own, financial stability (or instability for some), and independence. She&amp;#39;s going through the same stuff and you two may be growing in different directions. Open that dialogue, she&amp;#39;s your girlfriend and possibly your best friend at this point, you can talk about this. BUT do NOT ask her to change or make an unfair deal if shes that clingy. Do not abuse her love.&lt;/p&gt;\n\n&lt;p&gt;BONUS. dude you&amp;#39;re dating, and you&amp;#39;re young. It&amp;#39;s cool to be away from each other. take this piece of advice from my married older brother. &amp;quot;You have your entire life to be married. Stop trying to play house/the married couple. When you see her, go do something. That can mean dinner, a hike, going to the gym or anything else you can think of. Stop sitting at home all the time, be friends first, lovers second (but do that as much as you can. AFTER the activity you planned).&lt;/p&gt;\n\n&lt;p&gt;Good luck man, don&amp;#39;t try to argue with the advice anyone else tries to give you, just soak it in and make your decision after meditating/sleeping on it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcv4cn", "score_hidden": false, "stickied": false, "created": 1492419548.0, "created_utc": 1492390748.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65si3a", "likes": null, "replies": "", "user_reports": [], "id": "dgcva5j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lindyp0p", "parent_id": "t3_65si3a", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It's okay to end a relationship if it's not working for you,  it's okay to be single,  it's okay to tell someone how you really feel.  It's not okay however to stay with someone out of guilt that's so shitty to do to someone if that's really one of  the main reasons you don't want to dump her rethink that.  If the relationship has run its course and you feel it's holding you back and she's just not doing it for you anymore rip off the band aide and let her go it's not nice to hold onto someone you don't want to keep and prevent them from finding someone who does want to keep them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s okay to end a relationship if it&amp;#39;s not working for you,  it&amp;#39;s okay to be single,  it&amp;#39;s okay to tell someone how you really feel.  It&amp;#39;s not okay however to stay with someone out of guilt that&amp;#39;s so shitty to do to someone if that&amp;#39;s really one of  the main reasons you don&amp;#39;t want to dump her rethink that.  If the relationship has run its course and you feel it&amp;#39;s holding you back and she&amp;#39;s just not doing it for you anymore rip off the band aide and let her go it&amp;#39;s not nice to hold onto someone you don&amp;#39;t want to keep and prevent them from finding someone who does want to keep them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgcva5j", "score_hidden": false, "stickied": false, "created": 1492419755.0, "created_utc": 1492390955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]