[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have posted a few times about this relationship and how bad things are going, but now it&amp;#39;s worse than ever. Long story short, my &amp;quot;boyfriend&amp;quot; (18 yr old male, high school senior) got mad at me earlier this week because apparently I lied to him (even though I never did??). He didn&amp;#39;t tell me what I lied about, but he accused me of lying, insulted me, and said he never wanted to see me again. I was heartbroken, but at the same time, I wanted the relationship to end cause it was too much damage. I followed his orders, and didn&amp;#39;t call him again. I built up the courage to finally tell my parents about some of the things he&amp;#39;s done and how painful the relationship was, and they&amp;#39;re raging. Fast forward to today, he called me asking for a pen drive I lost, and said that if I didn&amp;#39;t pay for it (he wants $150 for it) he was going to take measures. I simply ignored his request, I have no money and that pendrive was lost over a year ago. So now, he&amp;#39;s even more mad. He said he was going to settle things in court. I tried telling him that I just wanted to leave and close things out like a normal couple. He decided to guilt trip me, saying that if it wasn&amp;#39;t for him, my high school experience would have been a living hell (we&amp;#39;ve been together for two years) and that he was going to help me get into my dream major (I&amp;#39;m an 18 yr old girl in college btw). I sort of told him that I still wanted to end things, and that my parents knew he was hurting me. He got enraged, saying that he was never going to sue me, but he now will cause things &amp;quot;just got personal.&amp;quot; I told him I needed to talk, and he said he would give me until 3 pm tomorrow to fix things before he would sue me. What do I do? Everyone told me to tell my parents but I just feel like I made things a lot worse. I just want him to leave me alone so I can focus on my own things, is that so much to ask for? I love him but he doesn&amp;#39;t respect me and constantly manipulates me, and I feel like right now I can either stay with him and disappoint myself and everyone who warned me about him, and take all the shit he gives me, or I can leave and get sued and perhaps even go to jail, cause I don&amp;#39;t have any money to pay him back (he said the lawsuit fine was going to be $1000). At this rate, I wish I could just disappear, I know I&amp;#39;m not the perfect girlfriend (I committed many mistakes in our relationship), but I really don&amp;#39;t know what I did to deserve this. I was loyal and care a lot about him, I feel beyond betrayed, stressed, anxious, and worried. Oh and yes, I&amp;#39;m pretty sure I&amp;#39;ve developed some form of anxiety from this entire relationship (I constantly fear that he will get mad and snap at me, and I&amp;#39;m starting to fear doing other things as well). What can I do to get out of this mess?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have posted a few times about this relationship and how bad things are going, but now it's worse than ever. Long story short, my \"boyfriend\" (18 yr old male, high school senior) got mad at me earlier this week because apparently I lied to him (even though I never did??). He didn't tell me what I lied about, but he accused me of lying, insulted me, and said he never wanted to see me again. I was heartbroken, but at the same time, I wanted the relationship to end cause it was too much damage. I followed his orders, and didn't call him again. I built up the courage to finally tell my parents about some of the things he's done and how painful the relationship was, and they're raging. Fast forward to today, he called me asking for a pen drive I lost, and said that if I didn't pay for it (he wants $150 for it) he was going to take measures. I simply ignored his request, I have no money and that pendrive was lost over a year ago. So now, he's even more mad. He said he was going to settle things in court. I tried telling him that I just wanted to leave and close things out like a normal couple. He decided to guilt trip me, saying that if it wasn't for him, my high school experience would have been a living hell (we've been together for two years) and that he was going to help me get into my dream major (I'm an 18 yr old girl in college btw). I sort of told him that I still wanted to end things, and that my parents knew he was hurting me. He got enraged, saying that he was never going to sue me, but he now will cause things \"just got personal.\" I told him I needed to talk, and he said he would give me until 3 pm tomorrow to fix things before he would sue me. What do I do? Everyone told me to tell my parents but I just feel like I made things a lot worse. I just want him to leave me alone so I can focus on my own things, is that so much to ask for? I love him but he doesn't respect me and constantly manipulates me, and I feel like right now I can either stay with him and disappoint myself and everyone who warned me about him, and take all the shit he gives me, or I can leave and get sued and perhaps even go to jail, cause I don't have any money to pay him back (he said the lawsuit fine was going to be $1000). At this rate, I wish I could just disappear, I know I'm not the perfect girlfriend (I committed many mistakes in our relationship), but I really don't know what I did to deserve this. I was loyal and care a lot about him, I feel beyond betrayed, stressed, anxious, and worried. Oh and yes, I'm pretty sure I've developed some form of anxiety from this entire relationship (I constantly fear that he will get mad and snap at me, and I'm starting to fear doing other things as well). What can I do to get out of this mess?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65tzlh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "angelicsailors", "saved": false, "mod_reports": [], "name": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65tzlh/abusive_boyfriend_trying_to_sue_me_and_get_revenge/", "num_reports": null, "locked": false, "stickied": false, "created": 1492439224.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65tzlh/abusive_boyfriend_trying_to_sue_me_and_get_revenge/", "author_flair_text": null, "quarantine": false, "title": "Abusive boyfriend trying to sue me and get revenge?", "created_utc": 1492410424.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 24, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgda287", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Caribbean_Queen_1985", "parent_id": "t1_dgd82dc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It would be small claims court and he'd have to pay to file the claim, $30-60 probably.   There would be no fine if you lost. However, I don't know if the judge can make the winner pay the other's court costs in small claims but if so, again, only $30-60. Also, the police won't get involved. If he insisted on filing a report, they might take it to humor him but they almost always say it's a civil matter (meaning court) and they don't get involved.  \n\nHe's full of you-know-what. Don't let him BS or scare you anymore. Stop talking to him. Block his cellphone number, block him on Facebook and other social media. You've already wasted too much time on an abusive coward. Coward because he abuses and threatens a little girl (you weren't an adult when he started).  Time to move on and forward. You can do it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would be small claims court and he&amp;#39;d have to pay to file the claim, $30-60 probably.   There would be no fine if you lost. However, I don&amp;#39;t know if the judge can make the winner pay the other&amp;#39;s court costs in small claims but if so, again, only $30-60. Also, the police won&amp;#39;t get involved. If he insisted on filing a report, they might take it to humor him but they almost always say it&amp;#39;s a civil matter (meaning court) and they don&amp;#39;t get involved.  &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s full of you-know-what. Don&amp;#39;t let him BS or scare you anymore. Stop talking to him. Block his cellphone number, block him on Facebook and other social media. You&amp;#39;ve already wasted too much time on an abusive coward. Coward because he abuses and threatens a little girl (you weren&amp;#39;t an adult when he started).  Time to move on and forward. You can do it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgda287", "score_hidden": false, "stickied": false, "created": 1492446320.0, "created_utc": 1492417520.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgdzfuk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "angelicsailors", "parent_id": "t1_dgd82dc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you, it really relieves me to know this. He constantly lies about things so I wouldn't be surprised if this was a lie as well (even though I've personally met his aunt and she is a judge but I doubt she would work with such a petty case).\n\nJust in case though, I might ask one of my mom's friends who's a lawyer to give me advice/confirm that this can't happen so easily.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, it really relieves me to know this. He constantly lies about things so I wouldn&amp;#39;t be surprised if this was a lie as well (even though I&amp;#39;ve personally met his aunt and she is a judge but I doubt she would work with such a petty case).&lt;/p&gt;\n\n&lt;p&gt;Just in case though, I might ask one of my mom&amp;#39;s friends who&amp;#39;s a lawyer to give me advice/confirm that this can&amp;#39;t happen so easily.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdzfuk", "score_hidden": false, "stickied": false, "created": 1492486354.0, "created_utc": 1492457554.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd82dc", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "ParallelLynx", "parent_id": "t1_dgd7x4b", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Doesn't matter who he knows that's a judge or a lawyer. They wouldn't risk their careers for nothing. And you would have to be served papers for a court date. It's not something that you can just walk in and set up an appointment for the following week. It can take months for even small claims. \n\nHowever, if you're really worried, you can call or visit the courthouse and check that there isn't anything scheduled for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t matter who he knows that&amp;#39;s a judge or a lawyer. They wouldn&amp;#39;t risk their careers for nothing. And you would have to be served papers for a court date. It&amp;#39;s not something that you can just walk in and set up an appointment for the following week. It can take months for even small claims. &lt;/p&gt;\n\n&lt;p&gt;However, if you&amp;#39;re really worried, you can call or visit the courthouse and check that there isn&amp;#39;t anything scheduled for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd82dc", "score_hidden": false, "stickied": false, "created": 1492440687.0, "created_utc": 1492411887.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgdaotu", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "illogictc", "parent_id": "t1_dgd8c2a", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Depending on your state they may even be required to subpoena you in person, usually a deputy or someone would serve papers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depending on your state they may even be required to subpoena you in person, usually a deputy or someone would serve papers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdaotu", "score_hidden": false, "stickied": false, "created": 1492448499.0, "created_utc": 1492419699.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgdzk2y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "angelicsailors", "parent_id": "t1_dgd8c2a", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Thank you. This comment made me realize how fake the situation actually seems to be, he literally told me this yesterday after I ticked him off so I doubt anyone could do a lawsuit so quickly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. This comment made me realize how fake the situation actually seems to be, he literally told me this yesterday after I ticked him off so I doubt anyone could do a lawsuit so quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdzk2y", "score_hidden": false, "stickied": false, "created": 1492486486.0, "created_utc": 1492457686.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8c2a", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "scratchingcats", "parent_id": "t1_dgd7x4b", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "lol that is conflict of interest, he can't ask her to do that. And if she is even a judge, she knows and won't get into some petty fight. Come on, you are not a child, you can't believe any of this bs. HAHA he doesn't have a court date, he is bluffing, those things take months, and you would find out through a mail notice, he would not be allowed to give you that information. PLEASE BLOCK HIM OFF EVERYTHING LIKE RIGHT NOW, email, phone, social media, everything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol that is conflict of interest, he can&amp;#39;t ask her to do that. And if she is even a judge, she knows and won&amp;#39;t get into some petty fight. Come on, you are not a child, you can&amp;#39;t believe any of this bs. HAHA he doesn&amp;#39;t have a court date, he is bluffing, those things take months, and you would find out through a mail notice, he would not be allowed to give you that information. PLEASE BLOCK HIM OFF EVERYTHING LIKE RIGHT NOW, email, phone, social media, everything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd8c2a", "score_hidden": false, "stickied": false, "created": 1492441321.0, "created_utc": 1492412521.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7x4b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "angelicsailors", "parent_id": "t1_dgd7kyc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm glad to know this, however his aunt is a judge, and he said he was going to go straight to her to settle things. He even gave me a date and everything (apparently I have to be on court on April 28th). He might be lying just to scare me (he's done it before) but he seems really legitimate with this threat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad to know this, however his aunt is a judge, and he said he was going to go straight to her to settle things. He even gave me a date and everything (apparently I have to be on court on April 28th). He might be lying just to scare me (he&amp;#39;s done it before) but he seems really legitimate with this threat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd7x4b", "score_hidden": false, "stickied": false, "created": 1492440340.0, "created_utc": 1492411540.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgdbe3a", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ChildfreePersonified", "parent_id": "t1_dgda1ey", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "And she can say in court that it was lost a year ago,  and that he could have lost it himself.  He would also need a receipt to prove he even owned it.  Courts want proof.  In a car accident you have an estimate of damages. Without that receipt for the drive,  the courts can't enforce anything because he can't even PROVE he owned the item in the first place. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And she can say in court that it was lost a year ago,  and that he could have lost it himself.  He would also need a receipt to prove he even owned it.  Courts want proof.  In a car accident you have an estimate of damages. Without that receipt for the drive,  the courts can&amp;#39;t enforce anything because he can&amp;#39;t even PROVE he owned the item in the first place. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbe3a", "score_hidden": false, "stickied": false, "created": 1492450935.0, "created_utc": 1492422135.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda1ey", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "branfip82", "parent_id": "t1_dgd7kyc", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "That's not at all true.\n\nIf he lent her a pen drive and she admittedly lost it then she's responsible for the replacement cost.\n\nSmall claims don't require a malicious intent. You can sue somebody for an accidental traffic accident.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not at all true.&lt;/p&gt;\n\n&lt;p&gt;If he lent her a pen drive and she admittedly lost it then she&amp;#39;s responsible for the replacement cost.&lt;/p&gt;\n\n&lt;p&gt;Small claims don&amp;#39;t require a malicious intent. You can sue somebody for an accidental traffic accident.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgda1ey", "score_hidden": false, "stickied": false, "created": 1492446246.0, "created_utc": 1492417446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7kyc", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "ParallelLynx", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Unless you've done something that he can prove was purposely against him (property damage, theft, etc) then he has no ground to stand on for a court case. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unless you&amp;#39;ve done something that he can prove was purposely against him (property damage, theft, etc) then he has no ground to stand on for a court case. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd7kyc", "score_hidden": false, "stickied": false, "created": 1492439552.0, "created_utc": 1492410752.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgd8a41", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "scratchingcats", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Lol he can't do that. I mean he could go to the courts and do a civil lawsuit (those are usually a joke) and unless he has proof of you having taken the stuff and selling it on ebay or something, he's got nothing. DO NOT engage him, completely cut him off 100%, he is bluffing. He is making that $1000 up, its not a thing. If you were found liable for the dumb thing he is claiming, you would be asked to pay him back in whatever payment amount you can (let's say $10 over 10 months). BUT then again, you would not lose the case so that won't happen. BELIEVE me , he is full of crap. \n\nFuck this guy, he is causing you distress. Save all the messages he sent, all of them. You can file for a restraining order if he keeps bothering you. There is nothing for you to be afraid of. Completely stop contacting him please. You lost nothing, this was a stupid relationship with an asshole, this is a good day for you, you are FREE!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol he can&amp;#39;t do that. I mean he could go to the courts and do a civil lawsuit (those are usually a joke) and unless he has proof of you having taken the stuff and selling it on ebay or something, he&amp;#39;s got nothing. DO NOT engage him, completely cut him off 100%, he is bluffing. He is making that $1000 up, its not a thing. If you were found liable for the dumb thing he is claiming, you would be asked to pay him back in whatever payment amount you can (let&amp;#39;s say $10 over 10 months). BUT then again, you would not lose the case so that won&amp;#39;t happen. BELIEVE me , he is full of crap. &lt;/p&gt;\n\n&lt;p&gt;Fuck this guy, he is causing you distress. Save all the messages he sent, all of them. You can file for a restraining order if he keeps bothering you. There is nothing for you to be afraid of. Completely stop contacting him please. You lost nothing, this was a stupid relationship with an asshole, this is a good day for you, you are FREE!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd8a41", "score_hidden": false, "stickied": false, "created": 1492441193.0, "created_utc": 1492412393.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgd9gcd", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ViaMoon", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Tell your parents, do not answer him again, save any texts, e-mails that sort of thing that he sends you from now on. And wait to see gow it plays out. Most likely nothing will happen, because he has no ground to stand on. But plz do the first 2 things or it will not go well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell your parents, do not answer him again, save any texts, e-mails that sort of thing that he sends you from now on. And wait to see gow it plays out. Most likely nothing will happen, because he has no ground to stand on. But plz do the first 2 things or it will not go well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd9gcd", "score_hidden": false, "stickied": false, "created": 1492444335.0, "created_utc": 1492415535.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgda9ce", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "8530683641", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I do not think that he can sue you over pen drive as no court has time to go on trial over something like this so it is his just a mere threaten. Moreover, if he sues you then you can sue him back for harassing you mentally and court will give verdict in your favor that is for you. \n\nOne thing you should do is inform your parents about it so you can get mental support which is your requirement at this point of time. Warn him that if he threatens you anymore then you will file a case against him and he has to face the cops. You are worried for nothing; just block him from everywhere so he cannot contact you. You have not done anything wrong so be relaxed. He cannot do anything so inform your parents and stay away from him. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not think that he can sue you over pen drive as no court has time to go on trial over something like this so it is his just a mere threaten. Moreover, if he sues you then you can sue him back for harassing you mentally and court will give verdict in your favor that is for you. &lt;/p&gt;\n\n&lt;p&gt;One thing you should do is inform your parents about it so you can get mental support which is your requirement at this point of time. Warn him that if he threatens you anymore then you will file a case against him and he has to face the cops. You are worried for nothing; just block him from everywhere so he cannot contact you. You have not done anything wrong so be relaxed. He cannot do anything so inform your parents and stay away from him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgda9ce", "score_hidden": false, "stickied": false, "created": 1492446987.0, "created_utc": 1492418187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgdbfw8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ChildfreePersonified", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Unless he has a receipt from when he purchased this pen drive and can prove that he even owned one to begin with,  he can't do anything.  Otherwise bitter exes would be dragging each other to court over items that didn't exist to exact revenge. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unless he has a receipt from when he purchased this pen drive and can prove that he even owned one to begin with,  he can&amp;#39;t do anything.  Otherwise bitter exes would be dragging each other to court over items that didn&amp;#39;t exist to exact revenge. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbfw8", "score_hidden": false, "stickied": false, "created": 1492451108.0, "created_utc": 1492422308.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgdd06f", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Dragonsblud", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Awe go. Go to the police make a statement. When it was lost not by you a year ago. The violence the abuse everything. And don't knock yourself for not being perfect. Who is. The past is the past take what you learned from this one and get a better relationship. Keep strong and get a guy minus the abuse", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awe go. Go to the police make a statement. When it was lost not by you a year ago. The violence the abuse everything. And don&amp;#39;t knock yourself for not being perfect. Who is. The past is the past take what you learned from this one and get a better relationship. Keep strong and get a guy minus the abuse&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdd06f", "score_hidden": false, "stickied": false, "created": 1492456081.0, "created_utc": 1492427281.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgddy2w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mmactavish", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He's bluffing about the court date and $1,000 fine/jail threat. It's not real. His goal is to stress you out, make you scared and miserable. He wants to drag you down because he's a miserable person. Tell your parents about his new threat and block him everywhere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s bluffing about the court date and $1,000 fine/jail threat. It&amp;#39;s not real. His goal is to stress you out, make you scared and miserable. He wants to drag you down because he&amp;#39;s a miserable person. Tell your parents about his new threat and block him everywhere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgddy2w", "score_hidden": false, "stickied": false, "created": 1492458493.0, "created_utc": 1492429693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgdbhi6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DPPThrow45", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Lawsuit fine?  Just....no.  And no jail time, either.\n\nWhat you do is cut him off, cold.  Not another word.  For a bit, it's best not to go to places he's likely to show up, too.  What you need is zero communication of any kind.  \n\nThen you work up documentation to obtain a restraining order if he doesn't back off.\n\nNext, go through the grieving process that comes after most every breakup.  Buckle down on the school work.  Eat regularly and healthy.  Hang with friends.  Take care of you, and work getting better as a person and look forward to a bright future.\n\nGood luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lawsuit fine?  Just....no.  And no jail time, either.&lt;/p&gt;\n\n&lt;p&gt;What you do is cut him off, cold.  Not another word.  For a bit, it&amp;#39;s best not to go to places he&amp;#39;s likely to show up, too.  What you need is zero communication of any kind.  &lt;/p&gt;\n\n&lt;p&gt;Then you work up documentation to obtain a restraining order if he doesn&amp;#39;t back off.&lt;/p&gt;\n\n&lt;p&gt;Next, go through the grieving process that comes after most every breakup.  Buckle down on the school work.  Eat regularly and healthy.  Hang with friends.  Take care of you, and work getting better as a person and look forward to a bright future.&lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbhi6", "score_hidden": false, "stickied": false, "created": 1492451261.0, "created_utc": 1492422461.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgefy3s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "modaaa", "parent_id": "t1_dge0cvu", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I know he's stressing you out with his threats, that's what he's aiming for. The end goal is to get a reaction, not to actually follow through. Ignoring him will cause more threats and possibly even trying to get you back. Don't buy it,  it's all about getting a reaction and control. You react, and he knows he's got a hold on your emotions. I guarantee the aunt filing suit for him is a lie. First off,  a judge can't rule on a case they filed as they'd obviously be biased. You also haven't been served and that wouldn't happen in a day, and there definitely wouldn't be a hearing so soon. If he actually tried to sue you, which he won't, there's no such thing as a \"lawsuit fine\" and in this hypothetical suit you wouldn't be ordered to pay $1000 if he's only suing for $150. You also wouldn't be going to jail as this would be a civil matter, not criminal, and individuals don't file criminal charges, the state does. \n\nWhen you told your parents about the abuse, which was the right thing to do, he made his idiotic counter threat as punishment for exposing him to be the piece of shit abuser that he is. Your anxiety is directly related to the abuse he inflicted, and you should know you're having a normal reaction to abnormal behavior.  Here's the reality: everything he's done, the bad AND the good, is all about control. This is the cycle of abuse. He lies, makes promises to keep your hopes up but never follows through, then insults you when you call him out on it, makes threats and tells you people hate you so you constantly second guess everything....all of these things mean you behave the way he wants you too. You stop doing normal things to avoid conflict, and you're constantly anxious because having to be hyper aware all the time is mentally exhausting. \n\nThe only way to stop this, and believe me I speak from experience, is to go no contact. I mean completely. Once you respond to him, even if it's a one word response or an emoji, he knows he's got you.  There's nothing you can say that will suddenly make him understand. I suggest you start googling relationship abuse to understand the behaviors of both abusers AND victims. It will provide clarity and peace of mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know he&amp;#39;s stressing you out with his threats, that&amp;#39;s what he&amp;#39;s aiming for. The end goal is to get a reaction, not to actually follow through. Ignoring him will cause more threats and possibly even trying to get you back. Don&amp;#39;t buy it,  it&amp;#39;s all about getting a reaction and control. You react, and he knows he&amp;#39;s got a hold on your emotions. I guarantee the aunt filing suit for him is a lie. First off,  a judge can&amp;#39;t rule on a case they filed as they&amp;#39;d obviously be biased. You also haven&amp;#39;t been served and that wouldn&amp;#39;t happen in a day, and there definitely wouldn&amp;#39;t be a hearing so soon. If he actually tried to sue you, which he won&amp;#39;t, there&amp;#39;s no such thing as a &amp;quot;lawsuit fine&amp;quot; and in this hypothetical suit you wouldn&amp;#39;t be ordered to pay $1000 if he&amp;#39;s only suing for $150. You also wouldn&amp;#39;t be going to jail as this would be a civil matter, not criminal, and individuals don&amp;#39;t file criminal charges, the state does. &lt;/p&gt;\n\n&lt;p&gt;When you told your parents about the abuse, which was the right thing to do, he made his idiotic counter threat as punishment for exposing him to be the piece of shit abuser that he is. Your anxiety is directly related to the abuse he inflicted, and you should know you&amp;#39;re having a normal reaction to abnormal behavior.  Here&amp;#39;s the reality: everything he&amp;#39;s done, the bad AND the good, is all about control. This is the cycle of abuse. He lies, makes promises to keep your hopes up but never follows through, then insults you when you call him out on it, makes threats and tells you people hate you so you constantly second guess everything....all of these things mean you behave the way he wants you too. You stop doing normal things to avoid conflict, and you&amp;#39;re constantly anxious because having to be hyper aware all the time is mentally exhausting. &lt;/p&gt;\n\n&lt;p&gt;The only way to stop this, and believe me I speak from experience, is to go no contact. I mean completely. Once you respond to him, even if it&amp;#39;s a one word response or an emoji, he knows he&amp;#39;s got you.  There&amp;#39;s nothing you can say that will suddenly make him understand. I suggest you start googling relationship abuse to understand the behaviors of both abusers AND victims. It will provide clarity and peace of mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgefy3s", "score_hidden": false, "stickied": false, "created": 1492506516.0, "created_utc": 1492477716.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0cvu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "angelicsailors", "parent_id": "t1_dgdohai", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He's threatened me with numerous things, from posting my underwear pictures online, to \"destroying my reputation\". So far he hasn't done any of those things. However, I did get scared once he told me about the lawsuit, so I'm glad you all confirmed that this can't actually happen so quickly and over a petty reason, hence he's lying... again.\n\nHe warned me that he was going to tell his aunt, a judge, today to create the lawsuit. Not sure if he will succeed, his aunt is a highly respected judge in our area and not sure if she will work with something so petty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s threatened me with numerous things, from posting my underwear pictures online, to &amp;quot;destroying my reputation&amp;quot;. So far he hasn&amp;#39;t done any of those things. However, I did get scared once he told me about the lawsuit, so I&amp;#39;m glad you all confirmed that this can&amp;#39;t actually happen so quickly and over a petty reason, hence he&amp;#39;s lying... again.&lt;/p&gt;\n\n&lt;p&gt;He warned me that he was going to tell his aunt, a judge, today to create the lawsuit. Not sure if he will succeed, his aunt is a highly respected judge in our area and not sure if she will work with something so petty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge0cvu", "score_hidden": false, "stickied": false, "created": 1492487383.0, "created_utc": 1492458583.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdohai", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "modaaa", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "How often did he make baseless threats in your relationship that he didn't follow through with?  My abusive ex threatened me with dumb shit like this, except I used to be a paralegal and have an understanding of how the court system works. What he's telling you is bullshit. Ignore him, he's bluffing and still trying to control you. Block him on everything, you're giving him power by responding. Ignoring abusers cause them to ramp up threats until you respond, that's literally all he wants is a response to know he still has control. I know it's hard to wrap your head around the idea but abuse is not rational. Take away that power by cutting him out for good. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How often did he make baseless threats in your relationship that he didn&amp;#39;t follow through with?  My abusive ex threatened me with dumb shit like this, except I used to be a paralegal and have an understanding of how the court system works. What he&amp;#39;s telling you is bullshit. Ignore him, he&amp;#39;s bluffing and still trying to control you. Block him on everything, you&amp;#39;re giving him power by responding. Ignoring abusers cause them to ramp up threats until you respond, that&amp;#39;s literally all he wants is a response to know he still has control. I know it&amp;#39;s hard to wrap your head around the idea but abuse is not rational. Take away that power by cutting him out for good. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdohai", "score_hidden": false, "stickied": false, "created": 1492474092.0, "created_utc": 1492445292.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgda2h2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "dreddit_reddit", "parent_id": "t1_dgd7uee", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Anime episodes he downloaded illegaly? Schoolwork that can easily be done again because whta would he be doing at 18yrs? USB drive/stick that costs like 10$ these days? \n\nSeriously he has no case. He is trying to guilt you into submission, using anger to soften you up to get something out of you a final time. End it!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anime episodes he downloaded illegaly? Schoolwork that can easily be done again because whta would he be doing at 18yrs? USB drive/stick that costs like 10$ these days? &lt;/p&gt;\n\n&lt;p&gt;Seriously he has no case. He is trying to guilt you into submission, using anger to soften you up to get something out of you a final time. End it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgda2h2", "score_hidden": false, "stickied": false, "created": 1492446344.0, "created_utc": 1492417544.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65tzlh", "likes": null, "replies": "", "user_reports": [], "id": "dgd7v9y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "branfip82", "parent_id": "t1_dgd7uee", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "The pen drive is worth its replacement cost.\n\nOffer him that and then go no contact.\n\nIt's over, stop dragging this out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The pen drive is worth its replacement cost.&lt;/p&gt;\n\n&lt;p&gt;Offer him that and then go no contact.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s over, stop dragging this out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd7v9y", "score_hidden": false, "stickied": false, "created": 1492440220.0, "created_utc": 1492411420.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7uee", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "angelicsailors", "parent_id": "t1_dgd7mze", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I gave him that option, but he wouldn't budge. It's not really the USB in itself that was worth that much, but the contents inside. Which I find ridiculous because the only thing that pendrive had was schoolwork and anime episodes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I gave him that option, but he wouldn&amp;#39;t budge. It&amp;#39;s not really the USB in itself that was worth that much, but the contents inside. Which I find ridiculous because the only thing that pendrive had was schoolwork and anime episodes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd7uee", "score_hidden": false, "stickied": false, "created": 1492440157.0, "created_utc": 1492411357.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7mze", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "branfip82", "parent_id": "t3_65tzlh", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "Why can't you just replace the pen drive that you lost?\n\nThen go no contact.\n\nYou can't go to jail and it won't be $1000 but you are responsible for replacing that USB drive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why can&amp;#39;t you just replace the pen drive that you lost?&lt;/p&gt;\n\n&lt;p&gt;Then go no contact.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t go to jail and it won&amp;#39;t be $1000 but you are responsible for replacing that USB drive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgd7mze", "score_hidden": false, "stickied": false, "created": 1492439678.0, "created_utc": 1492410878.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]