[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So for a while now I&amp;#39;ve been attending this &amp;quot;meet up&amp;quot; group with a few other people. We&amp;#39;d usually meet once a week and just hang out at this video game bar. Well, yesterday one of the men who was a regular (aged 34) posted a message asking if anyone would like to hang out for a bit. Me and this other woman (both 25) both agreed to come down.&lt;/p&gt;\n\n&lt;p&gt;When I got there, it was just me and the guy because the other woman was arriving a bit later. So we started playing a bit of Mario. Then he got a phone call from his wife who said she&amp;#39;ll stop by for a bit. When she arrived she sat with us and watched us play. It was clear she had no interest in video games and I sensed a bit of tension from her. After 10 minutes she said she was leaving and I said &amp;quot;goodbye&amp;quot; but she didn&amp;#39;t really acknowledge me.&lt;/p&gt;\n\n&lt;p&gt;20 minutes later, I noticed the guy started laughing and then he showed me his phone and his wife had written a facebook status saying &amp;quot;was fun to see my husband hanging out with his little girlfriends...funny sort of meet-up group&amp;quot;. I was very confused as to why he was laughing about it. He just said &amp;quot;I think she&amp;#39;s just jealous because I have my own friends&amp;quot;. Then for the next hour, he kept showing me the comments on her status and she was saying things like &amp;quot;omg you should&amp;#39;ve seen the girls he was with, I&amp;#39;ll PM you, you&amp;#39;ll get what I mean&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;For a start, the other woman hadn&amp;#39;t even arrived yet so I don&amp;#39;t know why she said that. If you looked at me, you&amp;#39;d see I was a quiet, young-looking, tomboy wearing converse -- you wouldn&amp;#39;t immediately think maneater. I even told him to text her and tell her I was gay so she wouldn&amp;#39;t have to worry. (my last relationship was with a woman and technically, I&amp;#39;m bisexual).&lt;/p&gt;\n\n&lt;p&gt;Strangely, the man continued to laugh about it through the entire night, and kept saying &amp;quot;she&amp;#39;s just a bit of a drama queen, she&amp;#39;s just jealous&amp;quot;. She kept texting him saying things like &amp;quot;still out with your sad girlfriends playing silly games? don&amp;#39;t expect to be sleeping in my bed tonight&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I got really pissed off at one point and asked him why he found it so funny? I told him she was being totally unreasonable and I was very offended by her behaviour. I told him this didn&amp;#39;t seem like a very healthy marriage and that he needs to talk to her. He said &amp;quot;oh no I don&amp;#39;t want to argue with her, I like to keep the peace&amp;quot;. I asked him if he even loved her and he just giggled and couldn&amp;#39;t say it. I just didn&amp;#39;t understand at all. I have never felt so insulted in my life and now I just don&amp;#39;t really feel like going to the meet-up anymore because the whole thing makes me uncomfortable.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So for a while now I've been attending this \"meet up\" group with a few other people. We'd usually meet once a week and just hang out at this video game bar. Well, yesterday one of the men who was a regular (aged 34) posted a message asking if anyone would like to hang out for a bit. Me and this other woman (both 25) both agreed to come down.\n\nWhen I got there, it was just me and the guy because the other woman was arriving a bit later. So we started playing a bit of Mario. Then he got a phone call from his wife who said she'll stop by for a bit. When she arrived she sat with us and watched us play. It was clear she had no interest in video games and I sensed a bit of tension from her. After 10 minutes she said she was leaving and I said \"goodbye\" but she didn't really acknowledge me.\n\n20 minutes later, I noticed the guy started laughing and then he showed me his phone and his wife had written a facebook status saying \"was fun to see my husband hanging out with his little girlfriends...funny sort of meet-up group\". I was very confused as to why he was laughing about it. He just said \"I think she's just jealous because I have my own friends\". Then for the next hour, he kept showing me the comments on her status and she was saying things like \"omg you should've seen the girls he was with, I'll PM you, you'll get what I mean\". \n\nFor a start, the other woman hadn't even arrived yet so I don't know why she said that. If you looked at me, you'd see I was a quiet, young-looking, tomboy wearing converse -- you wouldn't immediately think maneater. I even told him to text her and tell her I was gay so she wouldn't have to worry. (my last relationship was with a woman and technically, I'm bisexual).\n\nStrangely, the man continued to laugh about it through the entire night, and kept saying \"she's just a bit of a drama queen, she's just jealous\". She kept texting him saying things like \"still out with your sad girlfriends playing silly games? don't expect to be sleeping in my bed tonight\". \n\nI got really pissed off at one point and asked him why he found it so funny? I told him she was being totally unreasonable and I was very offended by her behaviour. I told him this didn't seem like a very healthy marriage and that he needs to talk to her. He said \"oh no I don't want to argue with her, I like to keep the peace\". I asked him if he even loved her and he just giggled and couldn't say it. I just didn't understand at all. I have never felt so insulted in my life and now I just don't really feel like going to the meet-up anymore because the whole thing makes me uncomfortable.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uh9k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "hayleighlo", "saved": false, "mod_reports": [], "name": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65uh9k/i_hung_out_with_a_male_friend_and_his_wife_threw/", "num_reports": null, "locked": false, "stickied": false, "created": 1492448452.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65uh9k/i_hung_out_with_a_male_friend_and_his_wife_threw/", "author_flair_text": null, "quarantine": false, "title": "I hung out with a male friend and his wife threw a tantrum", "created_utc": 1492419652.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdbc78", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Soliques", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "To be completely fair, he is being unreasonable just as well as his wife. \n\nThey both sound immature. Especially for a marriage.\n\nMy advice? Maybe try and discontinue contact with him (and his wife, of course) and hang out with other people at the meet ups. You don't need that in your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be completely fair, he is being unreasonable just as well as his wife. &lt;/p&gt;\n\n&lt;p&gt;They both sound immature. Especially for a marriage.&lt;/p&gt;\n\n&lt;p&gt;My advice? Maybe try and discontinue contact with him (and his wife, of course) and hang out with other people at the meet ups. You don&amp;#39;t need that in your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbc78", "score_hidden": false, "stickied": false, "created": 1492450757.0, "created_utc": 1492421957.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdgekl", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Wizardglick", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He may also be using you to make her jealous for whatever reason (like maybe she hangs with her guy friends, he's voiced his dislike for it, and she told him too bad).  Do yourself a favor and if you're uncomfortable with hanging with him then don't.  They both sound immature ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He may also be using you to make her jealous for whatever reason (like maybe she hangs with her guy friends, he&amp;#39;s voiced his dislike for it, and she told him too bad).  Do yourself a favor and if you&amp;#39;re uncomfortable with hanging with him then don&amp;#39;t.  They both sound immature &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgekl", "score_hidden": false, "stickied": false, "created": 1492463406.0, "created_utc": 1492434606.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdio1d", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thebabes2", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yikes.  Sounds like there is some serious trouble at home and he's acting out.  He's enjoying teasing her and she sounds equally awful.  If I were you I'd stop meeting with this man.  If she showed up to watch him play, he must have bragged he was there with other women.  You're part of some game.  Stop playing it.  I don't think you should stop going if you enjoy the rest of the group, but I'd avoid any one to one time with this guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yikes.  Sounds like there is some serious trouble at home and he&amp;#39;s acting out.  He&amp;#39;s enjoying teasing her and she sounds equally awful.  If I were you I&amp;#39;d stop meeting with this man.  If she showed up to watch him play, he must have bragged he was there with other women.  You&amp;#39;re part of some game.  Stop playing it.  I don&amp;#39;t think you should stop going if you enjoy the rest of the group, but I&amp;#39;d avoid any one to one time with this guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdio1d", "score_hidden": false, "stickied": false, "created": 1492466922.0, "created_utc": 1492438122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdbmrg", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Vinnie_Vegas", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; I have never felt so insulted in my life \n\nSounds like you must have had a pretty good life then, because honestly, this is minor bullshit from people you basically don't know. \n\nHe was being ridiculous letting you see the passive aggressive stuff she was doing, which was also ridiculous. \n\nBut if you let these two ridiculous people get to you, when they aren't actually anything to you, then guess what you're being?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have never felt so insulted in my life &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sounds like you must have had a pretty good life then, because honestly, this is minor bullshit from people you basically don&amp;#39;t know. &lt;/p&gt;\n\n&lt;p&gt;He was being ridiculous letting you see the passive aggressive stuff she was doing, which was also ridiculous. &lt;/p&gt;\n\n&lt;p&gt;But if you let these two ridiculous people get to you, when they aren&amp;#39;t actually anything to you, then guess what you&amp;#39;re being?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbmrg", "score_hidden": false, "stickied": false, "created": 1492451762.0, "created_utc": 1492422962.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdd06w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lobsty501", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Just ignore him the next time he tries to show you his facebook crap / text messages. His behaviour was immature and you should simply ignore it in future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just ignore him the next time he tries to show you his facebook crap / text messages. His behaviour was immature and you should simply ignore it in future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdd06w", "score_hidden": false, "stickied": false, "created": 1492456082.0, "created_utc": 1492427282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdcgh1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lamamaloca", "parent_id": "t1_dgdbtf5", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yeah,it reminds me of how I react to my sister in law's craziness. It really means they're done and he just has to leave. A lot of people leave it too late.", "edited": 1492426511.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah,it reminds me of how I react to my sister in law&amp;#39;s craziness. It really means they&amp;#39;re done and he just has to leave. A lot of people leave it too late.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdcgh1", "score_hidden": false, "stickied": false, "created": 1492454443.0, "created_utc": 1492425643.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbtf5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Sturm_Templar", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It might not make any sense to most people, but I have a decent idea of what's going on.\n\nIt sounds to me like he's already checked-out of the relationship. At a certain point, a partner can get so unreasonable that you're literally ready to break up and have very little emotional attachment left. That has happened to me when I was with an ex who was cheating on me and who was very bad at lying, and I acted a lot like he did; showing my brother her angry ridiculous texts, laughing about it, etc.\n\nTo anyone else, it would have looked like I was being totally irrational. Laughing in the face of a terribly unhealthy relationship and disregarding my (at the time) partner's emotions entirely. In reality, I was already checked out of the relationship and was just waiting to see if she was really going to live up to her promise to improve, which ofc I didn't believe she would. I was also curious about how far she'd go in her weird elaborate spiderweb of unbelievable lies.\n\nI was giving her a few last weeks. I knew she had no power over me and was incapable of hurting me physically, financially, or emotionally. She had emotionally hurt me very badly initially, but once she got too blatant with her lies and cheating, she lost the capacity to affect me. So yes, I laughed at her incredibly angry behavior and spent large sums of time engaging in my hobbies or ignoring her texts to provoke a reaction.\n\nWas it immature? I honestly don't care if it was or not, I have no regrets. She was a terrible person and after she lost the power to hurt me, I was quite entertained by the end.\n\nAnd I'm actually in a very good relationship now with none of that stuff, on either side.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might not make any sense to most people, but I have a decent idea of what&amp;#39;s going on.&lt;/p&gt;\n\n&lt;p&gt;It sounds to me like he&amp;#39;s already checked-out of the relationship. At a certain point, a partner can get so unreasonable that you&amp;#39;re literally ready to break up and have very little emotional attachment left. That has happened to me when I was with an ex who was cheating on me and who was very bad at lying, and I acted a lot like he did; showing my brother her angry ridiculous texts, laughing about it, etc.&lt;/p&gt;\n\n&lt;p&gt;To anyone else, it would have looked like I was being totally irrational. Laughing in the face of a terribly unhealthy relationship and disregarding my (at the time) partner&amp;#39;s emotions entirely. In reality, I was already checked out of the relationship and was just waiting to see if she was really going to live up to her promise to improve, which ofc I didn&amp;#39;t believe she would. I was also curious about how far she&amp;#39;d go in her weird elaborate spiderweb of unbelievable lies.&lt;/p&gt;\n\n&lt;p&gt;I was giving her a few last weeks. I knew she had no power over me and was incapable of hurting me physically, financially, or emotionally. She had emotionally hurt me very badly initially, but once she got too blatant with her lies and cheating, she lost the capacity to affect me. So yes, I laughed at her incredibly angry behavior and spent large sums of time engaging in my hobbies or ignoring her texts to provoke a reaction.&lt;/p&gt;\n\n&lt;p&gt;Was it immature? I honestly don&amp;#39;t care if it was or not, I have no regrets. She was a terrible person and after she lost the power to hurt me, I was quite entertained by the end.&lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m actually in a very good relationship now with none of that stuff, on either side.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbtf5", "score_hidden": false, "stickied": false, "created": 1492452386.0, "created_utc": 1492423586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdbqjy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "8530683641", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You took a right decision not want to meet him again as that is the best courage of actions you can take from your end. Do not get involved in his drama which his wife created because of you. He could have handled it better way but it sounds that he did not do it purposely so you just stay away from him and do your things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You took a right decision not want to meet him again as that is the best courage of actions you can take from your end. Do not get involved in his drama which his wife created because of you. He could have handled it better way but it sounds that he did not do it purposely so you just stay away from him and do your things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbqjy", "score_hidden": false, "stickied": false, "created": 1492452118.0, "created_utc": 1492423318.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdchua", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "notevenapro", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Steer clear of this dude. He is in a failing marriage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Steer clear of this dude. He is in a failing marriage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdchua", "score_hidden": false, "stickied": false, "created": 1492454561.0, "created_utc": 1492425761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdey9i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "311s", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "they both know what theyre doing and theyre draggin you into the dysfunctional bullshit, you can setup a line of communication with the wife and ease her fears or back away and find better people. 1up? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;they both know what theyre doing and theyre draggin you into the dysfunctional bullshit, you can setup a line of communication with the wife and ease her fears or back away and find better people. 1up? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdey9i", "score_hidden": false, "stickied": false, "created": 1492460713.0, "created_utc": 1492431913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdbm7x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "annek22", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I wouldn't be friends or get together with him again.  He's obviously in this meet up group to create problems.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t be friends or get together with him again.  He&amp;#39;s obviously in this meet up group to create problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdbm7x", "score_hidden": false, "stickied": false, "created": 1492451707.0, "created_utc": 1492422907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdonqg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Grim_Truths_With_Luv", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You got used to play a role in their ongoing games within their marriage.\n\nAvoid this guy; he is bad news.  If he treats his wife like that, strangers like you can expect nothing better from him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You got used to play a role in their ongoing games within their marriage.&lt;/p&gt;\n\n&lt;p&gt;Avoid this guy; he is bad news.  If he treats his wife like that, strangers like you can expect nothing better from him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdonqg", "score_hidden": false, "stickied": false, "created": 1492474295.0, "created_utc": 1492445495.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgea8zv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ima-kitty", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "when you meet new females you have to be friends with them first or she won't like you. at least show some interest in her next time, make her comfortable so she doesn't feel you as a threat. this is what i do and it works perfectly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;when you meet new females you have to be friends with them first or she won&amp;#39;t like you. at least show some interest in her next time, make her comfortable so she doesn&amp;#39;t feel you as a threat. this is what i do and it works perfectly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgea8zv", "score_hidden": false, "stickied": false, "created": 1492499282.0, "created_utc": 1492470482.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgeen3c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skeeter04", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "His wife is his problem - not yours.  Be glad you are not married to someone like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His wife is his problem - not yours.  Be glad you are not married to someone like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgeen3c", "score_hidden": false, "stickied": false, "created": 1492504901.0, "created_utc": 1492476101.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgddazq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stubbornside3", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Stay away hunny. He is bad news and you don't want to be caught up in their unhealthy marriage. Or be the excuse/reason they end it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stay away hunny. He is bad news and you don&amp;#39;t want to be caught up in their unhealthy marriage. Or be the excuse/reason they end it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgddazq", "score_hidden": false, "stickied": false, "created": 1492456891.0, "created_utc": 1492428091.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uh9k", "likes": null, "replies": "", "user_reports": [], "id": "dgdxvw0", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "thundertool", "parent_id": "t3_65uh9k", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "\"Young looking tomboy in converse\"\n\nYou just described exactly what I'm attracted to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Young looking tomboy in converse&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You just described exactly what I&amp;#39;m attracted to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdxvw0", "score_hidden": false, "stickied": false, "created": 1492484577.0, "created_utc": 1492455777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]