[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (24/f) have been with my boyfriend (27/m) for three years. &lt;/p&gt;\n\n&lt;p&gt;My boyfriend&amp;#39;s work commitments and stress have recently increased a lot, as a result I have become less of a priority (although I feel like I wasn&amp;#39;t a huge priority before). He never wants to go on dates or try new things (we go on weekly dinner dates, he&amp;#39;s often browsing on his phone or taking about his work stress), he doesn&amp;#39;t compliment me ever (I compliment him often), I have to ask him for a kiss or a hug and he&amp;#39;ll pull away if I try and hold his hand, we&amp;#39;ve only had sex once this year so far (he refuses to stay over at my place claiming that he doesn&amp;#39;t like my bed). He&amp;#39;s also stopped making an effort with my family (he promised days before to come over for a lunch with my extended family last weekend, he told me an hour before that he couldn&amp;#39;t come because he hadn&amp;#39;t left his mom&amp;#39;s place who he was spending the weekend with and who lives several hours drive away), he often declines catch-ups with my family and he knows that it matters to me because I&amp;#39;ve told him in the past. My family when I told them said that they&amp;#39;d assumed he wasn&amp;#39;t coming so hadn&amp;#39;t set a place at the table for him anyhow. I know that he&amp;#39;s busy/ tired as he works crazy hours in a very demanding job, but I still can&amp;#39;t help but feel like if he wanted to come he would have planned accordingly. \nHe also won&amp;#39;t schedule dates more than a few hours in advance, he&amp;#39;s like this with his friends too, but they&amp;#39;re all also like this (he has pre-planned a few boys weekends in the past however). It&amp;#39;s like if I say let&amp;#39;s go for a hike this weekend on Thursday, he&amp;#39;s either not interested or doesn&amp;#39;t know etc. Also complains that we never do anything despite all of my suggestions. I&amp;#39;ve tried to talk to him about the intimacy thing, like asked him why he won&amp;#39;t hold my hand etc. he just changes the topic or gets frustrated and denies it, e.g. I&amp;#39;ll say &amp;quot;why do you pull away when I try and hold your hand&amp;quot; and he&amp;#39;ll respond with something like &amp;quot;that&amp;#39;s not true I never said that, and well, that&amp;#39;s fine if you think that&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;A bit of background on me: I admit that I&amp;#39;ve got low self-esteem and I often think that I&amp;#39;m not worthy of other people&amp;#39;s efforts etc. My friends consider me to be a loyal, caring friend. The reason I mention these details is because I&amp;#39;ve been told in the past (during past relationships) by those who are close to me that these traits make me vulnerable to being taken advantage of (basically, accepting behavior that most other people wouldn&amp;#39;t in a similar situation). &lt;/p&gt;\n\n&lt;p&gt;(+ve): He&amp;#39;s very intelligent, committed to his job and hard working, and I do love him, we have great conversation he makes me smile/ laugh and we do enjoy each other&amp;#39;s company. Our relationship used to have a lot more intimacy during the first year, he&amp;#39;d stay over and he&amp;#39;d make an effort to do nice things/ fun dates and holidays with me, and he&amp;#39;d spend time with my family (he was less busy). I just feel taken for granted now and that maybe I&amp;#39;m not seeing the signs? I am also very close to his family, they like me a lot and are very kind and supportive, they text/ call me regularly, invite me to events/ get me gifts and celebrate my birthday etc. I value my relationship with them dearly and would hate to upset them. &lt;/p&gt;\n\n&lt;p&gt;Thanks in advance for your advice/ opinions, I appreciate it! :) &lt;/p&gt;\n\n&lt;p&gt;TL;DR I feel like my boyfriend of 3 years is taking me for granted/ not making an effort/ regularly priorities other things over me, this coincides with his work becoming insanely busy. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I (24/f) have been with my boyfriend (27/m) for three years. \n\nMy boyfriend's work commitments and stress have recently increased a lot, as a result I have become less of a priority (although I feel like I wasn't a huge priority before). He never wants to go on dates or try new things (we go on weekly dinner dates, he's often browsing on his phone or taking about his work stress), he doesn't compliment me ever (I compliment him often), I have to ask him for a kiss or a hug and he'll pull away if I try and hold his hand, we've only had sex once this year so far (he refuses to stay over at my place claiming that he doesn't like my bed). He's also stopped making an effort with my family (he promised days before to come over for a lunch with my extended family last weekend, he told me an hour before that he couldn't come because he hadn't left his mom's place who he was spending the weekend with and who lives several hours drive away), he often declines catch-ups with my family and he knows that it matters to me because I've told him in the past. My family when I told them said that they'd assumed he wasn't coming so hadn't set a place at the table for him anyhow. I know that he's busy/ tired as he works crazy hours in a very demanding job, but I still can't help but feel like if he wanted to come he would have planned accordingly. \nHe also won't schedule dates more than a few hours in advance, he's like this with his friends too, but they're all also like this (he has pre-planned a few boys weekends in the past however). It's like if I say let's go for a hike this weekend on Thursday, he's either not interested or doesn't know etc. Also complains that we never do anything despite all of my suggestions. I've tried to talk to him about the intimacy thing, like asked him why he won't hold my hand etc. he just changes the topic or gets frustrated and denies it, e.g. I'll say \"why do you pull away when I try and hold your hand\" and he'll respond with something like \"that's not true I never said that, and well, that's fine if you think that\". \n\nA bit of background on me: I admit that I've got low self-esteem and I often think that I'm not worthy of other people's efforts etc. My friends consider me to be a loyal, caring friend. The reason I mention these details is because I've been told in the past (during past relationships) by those who are close to me that these traits make me vulnerable to being taken advantage of (basically, accepting behavior that most other people wouldn't in a similar situation). \n\n(+ve): He's very intelligent, committed to his job and hard working, and I do love him, we have great conversation he makes me smile/ laugh and we do enjoy each other's company. Our relationship used to have a lot more intimacy during the first year, he'd stay over and he'd make an effort to do nice things/ fun dates and holidays with me, and he'd spend time with my family (he was less busy). I just feel taken for granted now and that maybe I'm not seeing the signs? I am also very close to his family, they like me a lot and are very kind and supportive, they text/ call me regularly, invite me to events/ get me gifts and celebrate my birthday etc. I value my relationship with them dearly and would hate to upset them. \n\nThanks in advance for your advice/ opinions, I appreciate it! :) \n\nTL;DR I feel like my boyfriend of 3 years is taking me for granted/ not making an effort/ regularly priorities other things over me, this coincides with his work becoming insanely busy. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uyov", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "Ana_Wolf", "saved": false, "mod_reports": [], "name": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492429025.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65uyov/should_i_24f_lower_my_expectations_of_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492457007.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65uyov/should_i_24f_lower_my_expectations_of_my/", "author_flair_text": null, "quarantine": false, "title": "Should I (24/f) lower my expectations of my boyfriend (27/m), or is this not normal? I feel like I'm being taken for granted.", "created_utc": 1492428207.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgddmdm", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "cmac168", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Relationships require effort on both sides if they have a hope of working. He is not putting in the minimal amount of effort and if I were you, I would seriously think about whether it's worth being with him when he's continually letting you down like this. \n\nMy advice would be to sit down and talk to him about how you are feeling and that you cannot continue like this - not in accusatory way, but in a calm and adult manner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Relationships require effort on both sides if they have a hope of working. He is not putting in the minimal amount of effort and if I were you, I would seriously think about whether it&amp;#39;s worth being with him when he&amp;#39;s continually letting you down like this. &lt;/p&gt;\n\n&lt;p&gt;My advice would be to sit down and talk to him about how you are feeling and that you cannot continue like this - not in accusatory way, but in a calm and adult manner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgddmdm", "score_hidden": false, "stickied": false, "created": 1492457691.0, "created_utc": 1492428891.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgddtp1", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "fiziix", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Sometimes we stay with people because we have been together a while and it would be difficult to 'restart' and be single. Plus all the emotion of a breakup. However, there has to be equal effort and it does sound like he's just not into you anymore, as hard as that is to hear! Looks like you're making all the effort for no reward, the no kissing, no hand holding, no sex, no off schedule dates etc should be enough to make you realise.\n\nI would sit down around a table after telling him you need to have a serious chat. Tell him everything you feel and the eventual outcome if it continues and see what his reaction is. If he shrugs his shoulders then maybe it's time to move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes we stay with people because we have been together a while and it would be difficult to &amp;#39;restart&amp;#39; and be single. Plus all the emotion of a breakup. However, there has to be equal effort and it does sound like he&amp;#39;s just not into you anymore, as hard as that is to hear! Looks like you&amp;#39;re making all the effort for no reward, the no kissing, no hand holding, no sex, no off schedule dates etc should be enough to make you realise.&lt;/p&gt;\n\n&lt;p&gt;I would sit down around a table after telling him you need to have a serious chat. Tell him everything you feel and the eventual outcome if it continues and see what his reaction is. If he shrugs his shoulders then maybe it&amp;#39;s time to move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgddtp1", "score_hidden": false, "stickied": false, "created": 1492458200.0, "created_utc": 1492429400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgdnzgz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "xamberglow", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'd say to have one last talk with him about these issues, and if he's still unwilling to change, then I'm sorry but it's time to walk away. He's wasting your time, and you're basically more like a friend than a girlfriend at this point. If you plan on getting married one day, then it's time you stop wasting your time on this guy (as dear to you as I know he must be) and find someone who will treat you better (believe me you will). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say to have one last talk with him about these issues, and if he&amp;#39;s still unwilling to change, then I&amp;#39;m sorry but it&amp;#39;s time to walk away. He&amp;#39;s wasting your time, and you&amp;#39;re basically more like a friend than a girlfriend at this point. If you plan on getting married one day, then it&amp;#39;s time you stop wasting your time on this guy (as dear to you as I know he must be) and find someone who will treat you better (believe me you will). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdnzgz", "score_hidden": false, "stickied": false, "created": 1492473525.0, "created_utc": 1492444725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgde44j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "omghi2posers", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He sounds like he's not really into this relationship. You should end it and find someone who meets your needs for closeness and effort. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He sounds like he&amp;#39;s not really into this relationship. You should end it and find someone who meets your needs for closeness and effort. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgde44j", "score_hidden": false, "stickied": false, "created": 1492458887.0, "created_utc": 1492430087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgdgd2u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sugamonkey", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He's not making you happy, actually it sounds like he is making you miserable and he has no desire to change.   This tells you how he really feels. Dump him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s not making you happy, actually it sounds like he is making you miserable and he has no desire to change.   This tells you how he really feels. Dump him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgd2u", "score_hidden": false, "stickied": false, "created": 1492463332.0, "created_utc": 1492434532.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgdzmqr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Corgiwiggle", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Sounds like he doesn't care about the relationship but doesn't want to be bothered to change his life by breaking up", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like he doesn&amp;#39;t care about the relationship but doesn&amp;#39;t want to be bothered to change his life by breaking up&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdzmqr", "score_hidden": false, "stickied": false, "created": 1492486569.0, "created_utc": 1492457769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dge2zdz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lordica", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "He's taking you for granted and you are letting him.  He doesn't think you are special and isn't willing to inconvenience himself for you.  If you stay with him, this is what the rest of your life will look like.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s taking you for granted and you are letting him.  He doesn&amp;#39;t think you are special and isn&amp;#39;t willing to inconvenience himself for you.  If you stay with him, this is what the rest of your life will look like.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge2zdz", "score_hidden": false, "stickied": false, "created": 1492490320.0, "created_utc": 1492461520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgdgvf1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jiltedatthealtar", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "The mere fact that you are out here asking for advise sounds like you already know what you shld do. Listen to your insticts and follow them. Best of luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mere fact that you are out here asking for advise sounds like you already know what you shld do. Listen to your insticts and follow them. Best of luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdgvf1", "score_hidden": false, "stickied": false, "created": 1492464176.0, "created_utc": 1492435376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgdji1y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gastonstegall", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "it's always a balance. different for every couple. there is no normal. everyone has to get what they need, and if you don't, you're not compatible. it's a kind of negotiation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s always a balance. different for every couple. there is no normal. everyone has to get what they need, and if you don&amp;#39;t, you&amp;#39;re not compatible. it&amp;#39;s a kind of negotiation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdji1y", "score_hidden": false, "stickied": false, "created": 1492468068.0, "created_utc": 1492439268.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgdjqpg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "onekate", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Year one was good. Years two and three, not so much. Stop investing in someone who doesn't invest in you. It's been TWO YEARS. Make the change and end this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Year one was good. Years two and three, not so much. Stop investing in someone who doesn&amp;#39;t invest in you. It&amp;#39;s been TWO YEARS. Make the change and end this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdjqpg", "score_hidden": false, "stickied": false, "created": 1492468394.0, "created_utc": 1492439594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgduvrk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trey580", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I would make an effort to meet some other people and hang out with them / make plans with.  Just see if you are holding onto anything just because.  Say you join the local Monday (Activity you like here) club and start hanging out with other people and all of the sudden you don't care what he's doing?\nSorry tough time.  \n\nAlso, if it has been 3 years it does warrant a conversation.  As a 36M I am curious to him not wanting sex for several months, not sure if you will get a straight answer out of him, but that is too long!  I wonder what he is getting out of the relationship?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would make an effort to meet some other people and hang out with them / make plans with.  Just see if you are holding onto anything just because.  Say you join the local Monday (Activity you like here) club and start hanging out with other people and all of the sudden you don&amp;#39;t care what he&amp;#39;s doing?\nSorry tough time.  &lt;/p&gt;\n\n&lt;p&gt;Also, if it has been 3 years it does warrant a conversation.  As a 36M I am curious to him not wanting sex for several months, not sure if you will get a straight answer out of him, but that is too long!  I wonder what he is getting out of the relationship?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgduvrk", "score_hidden": false, "stickied": false, "created": 1492481193.0, "created_utc": 1492452393.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65uyov", "likes": null, "replies": "", "user_reports": [], "id": "dgedcyg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "charlie22901", "parent_id": "t3_65uyov", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Sit down and talk with him, do not give ultimatums or suggest you deserve better immediately.\n\nWalk him through some of the things he did that left you feeling down and explain to him that you think his stress/job have something to do with it.  He may very well agree and seek a different job that causes less stress so he can enjoy his life again.\n\nTimes get tough and too many people here just cut and run.  If you love him, try to work through it first.  If it becomes unbearable and he won't change, then you need to leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sit down and talk with him, do not give ultimatums or suggest you deserve better immediately.&lt;/p&gt;\n\n&lt;p&gt;Walk him through some of the things he did that left you feeling down and explain to him that you think his stress/job have something to do with it.  He may very well agree and seek a different job that causes less stress so he can enjoy his life again.&lt;/p&gt;\n\n&lt;p&gt;Times get tough and too many people here just cut and run.  If you love him, try to work through it first.  If it becomes unbearable and he won&amp;#39;t change, then you need to leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgedcyg", "score_hidden": false, "stickied": false, "created": 1492503298.0, "created_utc": 1492474498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]