[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my girlfriend and I recently just celebrated our 3 year anniversary and will be graduating in a couple weeks.  I accepted a full time job fairly close to where we go to school, she accepted her dream job 2 hours away (at least a 16 month program and hopeful placement after).  I offered to split the distance with her (about 50 minutes each way) for a year from when I start full time (will be less for her as she starts 2-3 months after me) then I&amp;#39;d find a new job closer, but she&amp;#39;s not interested.  She wants to move there to make new friends at work and be by them.&lt;/p&gt;\n\n&lt;p&gt;At this point I feel lower than low.  I&amp;#39;ve commuted to be with her before (an hour at a summer internship that would have given me an apartment 5 minutes down the road) and didn&amp;#39;t even have to think to make that decision.  Now she won&amp;#39;t even consider doing it for me.&lt;/p&gt;\n\n&lt;p&gt;She often makes decisions based on what others to keep them happy and isn&amp;#39;t very non-confrontational.  She says she wants to make a decision not based on someone else for once, which makes sense except we&amp;#39;ve been dating for 3 years... &lt;/p&gt;\n\n&lt;p&gt;I would do anything to be with her, but at this point I&amp;#39;d have to give up almost every to not be with her.  Being her dream job, I can imagine that she&amp;#39;ll want to stay after her 16 month initial period so I&amp;#39;d have to find a new job to be closer in the fairly near future.  Leaving that job means my 401k won&amp;#39;t vest so that&amp;#39;s probably a couple thousand dollar cost too.  She knows that it was my dream to graduate and by a house, but I can&amp;#39;t really do that if there&amp;#39;s a good chance I&amp;#39;ll have to move within two years.  I was also planning to go back and get an mba after I worked at my company for a year, but you have to stay 2 years after graduation so I can&amp;#39;t do that either.  I feel like she hasn&amp;#39;t thought about any of that, only that she wants to be close to work and her new coworkers.&lt;/p&gt;\n\n&lt;p&gt;Any moment I haven&amp;#39;t been preoccupied since she told me (couple weeks) I&amp;#39;ve wanted to simultaneously cry and punch something.  At this point it feels like she&amp;#39;s just telling me that I have to deal with only seeing her on weekends (not even all of them, she&amp;#39;ll have to work some) to have a chance at a relationship whenever she decides we can do that.  I&amp;#39;m generally a pretty happy person, but I&amp;#39;ve never been more miserable in my life and have no idea what to do at this point. We&amp;#39;ve seen each other pretty much at least every other day for the 3 years we&amp;#39;ve been dating.&lt;/p&gt;\n\n&lt;p&gt;I love her immensely and we&amp;#39;ve talked about marriage before (she told me I had to wait til after graduation to propose), but I feel like our relationship just isn&amp;#39;t a priority to her right now and I&amp;#39;m heartbroken. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So my girlfriend and I recently just celebrated our 3 year anniversary and will be graduating in a couple weeks.  I accepted a full time job fairly close to where we go to school, she accepted her dream job 2 hours away (at least a 16 month program and hopeful placement after).  I offered to split the distance with her (about 50 minutes each way) for a year from when I start full time (will be less for her as she starts 2-3 months after me) then I'd find a new job closer, but she's not interested.  She wants to move there to make new friends at work and be by them.\n\nAt this point I feel lower than low.  I've commuted to be with her before (an hour at a summer internship that would have given me an apartment 5 minutes down the road) and didn't even have to think to make that decision.  Now she won't even consider doing it for me.\n\nShe often makes decisions based on what others to keep them happy and isn't very non-confrontational.  She says she wants to make a decision not based on someone else for once, which makes sense except we've been dating for 3 years... \n\nI would do anything to be with her, but at this point I'd have to give up almost every to not be with her.  Being her dream job, I can imagine that she'll want to stay after her 16 month initial period so I'd have to find a new job to be closer in the fairly near future.  Leaving that job means my 401k won't vest so that's probably a couple thousand dollar cost too.  She knows that it was my dream to graduate and by a house, but I can't really do that if there's a good chance I'll have to move within two years.  I was also planning to go back and get an mba after I worked at my company for a year, but you have to stay 2 years after graduation so I can't do that either.  I feel like she hasn't thought about any of that, only that she wants to be close to work and her new coworkers.\n\nAny moment I haven't been preoccupied since she told me (couple weeks) I've wanted to simultaneously cry and punch something.  At this point it feels like she's just telling me that I have to deal with only seeing her on weekends (not even all of them, she'll have to work some) to have a chance at a relationship whenever she decides we can do that.  I'm generally a pretty happy person, but I've never been more miserable in my life and have no idea what to do at this point. We've seen each other pretty much at least every other day for the 3 years we've been dating.\n\nI love her immensely and we've talked about marriage before (she told me I had to wait til after graduation to propose), but I feel like our relationship just isn't a priority to her right now and I'm heartbroken. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xl3r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "HeartBrokenn", "saved": false, "mod_reports": [], "name": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65xl3r/23m_heartbroken_and_dont_know_what_to_do_gf_21f/", "num_reports": null, "locked": false, "stickied": false, "created": 1492484545.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65xl3r/23m_heartbroken_and_dont_know_what_to_do_gf_21f/", "author_flair_text": null, "quarantine": false, "title": "[23/m] heartbroken and don't know what to do. GF [21/F] of 3 years wants to move 2 hours away after graduation. Feel like our relationship is her last priority.", "created_utc": 1492455745.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dgdy3eb", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Digitaldreamer7", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If she didn't at least chat with you about this position before she took it, it's game over and i'd be out the door.  That's a huge disrespect to your relationship and you shouldn't reward or compromise your life for her since she didn't even consider you and your relationship when she made that decision.  Time to move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she didn&amp;#39;t at least chat with you about this position before she took it, it&amp;#39;s game over and i&amp;#39;d be out the door.  That&amp;#39;s a huge disrespect to your relationship and you shouldn&amp;#39;t reward or compromise your life for her since she didn&amp;#39;t even consider you and your relationship when she made that decision.  Time to move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdy3eb", "score_hidden": false, "stickied": false, "created": 1492484819.0, "created_utc": 1492456019.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dgdyv16", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "omghi2posers", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Sounds like you guys saw the relationship differently. Was a college fling for her and was a serious life long thing for you. Hard to reconcile that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you guys saw the relationship differently. Was a college fling for her and was a serious life long thing for you. Hard to reconcile that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdyv16", "score_hidden": false, "stickied": false, "created": 1492485692.0, "created_utc": 1492456892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dge2j6t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TululaDaydream", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; Feel like our relationship is her last priority\n\nIt probably is. I'm sorry, but you're both so young, and relationships which begin at such a young age often don't last. Whereas the opportunity to get her dream career may only come once in a lifetime. \n\nI say you should bow out with dignity. You'll move past this. You have your whole life ahead of you. Cherish the last three years you had with her, but don't hinge your entire future on it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Feel like our relationship is her last priority&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It probably is. I&amp;#39;m sorry, but you&amp;#39;re both so young, and relationships which begin at such a young age often don&amp;#39;t last. Whereas the opportunity to get her dream career may only come once in a lifetime. &lt;/p&gt;\n\n&lt;p&gt;I say you should bow out with dignity. You&amp;#39;ll move past this. You have your whole life ahead of you. Cherish the last three years you had with her, but don&amp;#39;t hinge your entire future on it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge2j6t", "score_hidden": false, "stickied": false, "created": 1492489812.0, "created_utc": 1492461012.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dgdyeth", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "She doesn't sound like she really loves you enough, she is unwilling to compromise and would rather see you maybe 4-6 days a month instead of having to commute a bit. She wants to go out drinking with her new guy friends at her new placement than come home to you.\n\nShe is being selfish. I doubt if you proposed she would say yes, she threw your relationship under the bus and you know it.\n\nI honestly think you have 1 play and 1 play only. Go home pack up your stuff and move out, tell her you can't accept seeing her every other weekend so you are breaking up with her now rather than later. Walk away and hope the shock and time apart makes her realize she wants to be with you and compromise. Going long distance like this will wreck your head you won't trust her because you know you invested more than her,\n\nIf you don't hear from her well it was fucking over anyway and you dodged a proposal and likely her cheating on you with Chad or Brad in her new circle of friends. High risk but you have to do it man else you will be in for a shockingly bad year\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She doesn&amp;#39;t sound like she really loves you enough, she is unwilling to compromise and would rather see you maybe 4-6 days a month instead of having to commute a bit. She wants to go out drinking with her new guy friends at her new placement than come home to you.&lt;/p&gt;\n\n&lt;p&gt;She is being selfish. I doubt if you proposed she would say yes, she threw your relationship under the bus and you know it.&lt;/p&gt;\n\n&lt;p&gt;I honestly think you have 1 play and 1 play only. Go home pack up your stuff and move out, tell her you can&amp;#39;t accept seeing her every other weekend so you are breaking up with her now rather than later. Walk away and hope the shock and time apart makes her realize she wants to be with you and compromise. Going long distance like this will wreck your head you won&amp;#39;t trust her because you know you invested more than her,&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t hear from her well it was fucking over anyway and you dodged a proposal and likely her cheating on you with Chad or Brad in her new circle of friends. High risk but you have to do it man else you will be in for a shockingly bad year&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdyeth", "score_hidden": false, "stickied": false, "created": 1492485176.0, "created_utc": 1492456376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dgdza6u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "albinomoontanning", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If she didn't even want to drive an hour to meet with you, she's probably not interested anymore... I would talk to her now and let her know how you feel. you have needs in a relationship and if shes not interested it shouldnt continue, for your own sanity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she didn&amp;#39;t even want to drive an hour to meet with you, she&amp;#39;s probably not interested anymore... I would talk to her now and let her know how you feel. you have needs in a relationship and if shes not interested it shouldnt continue, for your own sanity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdza6u", "score_hidden": false, "stickied": false, "created": 1492486175.0, "created_utc": 1492457375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dge1xxf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThisTimeImTheAsshole", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I think you need to ask yourself a question... Am I going to live my life or am I going to live a life chasing a woman who didn't even discuss future plans?\n\n&gt; I love her immensely and we've talked about marriage before (she told me I had to wait til after graduation to propose), but I feel like our relationship just isn't a priority to her right now\n\n*\"right now\"* or never was a top priority. If she didn't want you to propose until a certain time, she was trying to avoid marriage. she probably had already thought about moving after graduating.\n\nDid you live together while going to school? Did you help her with finances during that time? Did your sex life remain good or has it dwindled? Could she have used you to help get through school easier?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you need to ask yourself a question... Am I going to live my life or am I going to live a life chasing a woman who didn&amp;#39;t even discuss future plans?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I love her immensely and we&amp;#39;ve talked about marriage before (she told me I had to wait til after graduation to propose), but I feel like our relationship just isn&amp;#39;t a priority to her right now&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;right now&amp;quot;&lt;/em&gt; or never was a top priority. If she didn&amp;#39;t want you to propose until a certain time, she was trying to avoid marriage. she probably had already thought about moving after graduating.&lt;/p&gt;\n\n&lt;p&gt;Did you live together while going to school? Did you help her with finances during that time? Did your sex life remain good or has it dwindled? Could she have used you to help get through school easier?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge1xxf", "score_hidden": false, "stickied": false, "created": 1492489160.0, "created_utc": 1492460360.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dge5vwz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kelbelkm", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Oof! That is tough, on one hand you can't fault for taking her dream job and wanting to meet new friends at said job, but on the other it does sound like she's put your relationship on the back burner for the sake of the job. I would say it doesn't mean she doesn't love you, but it's clear you two don't have the same priorities right now. You have to decide if you can live with that being the case in hopes that it might change or cut her lose and follow your dreams without her. Sorry you're hurting!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oof! That is tough, on one hand you can&amp;#39;t fault for taking her dream job and wanting to meet new friends at said job, but on the other it does sound like she&amp;#39;s put your relationship on the back burner for the sake of the job. I would say it doesn&amp;#39;t mean she doesn&amp;#39;t love you, but it&amp;#39;s clear you two don&amp;#39;t have the same priorities right now. You have to decide if you can live with that being the case in hopes that it might change or cut her lose and follow your dreams without her. Sorry you&amp;#39;re hurting!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge5vwz", "score_hidden": false, "stickied": false, "created": 1492493706.0, "created_utc": 1492464906.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dge81zo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VeganLGBTCrossfitter", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "What kind of dream job has a 16 month lifespan with no assurances? \n\nBuddy, you're less important to her than the toaster is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of dream job has a 16 month lifespan with no assurances? &lt;/p&gt;\n\n&lt;p&gt;Buddy, you&amp;#39;re less important to her than the toaster is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge81zo", "score_hidden": false, "stickied": false, "created": 1492496416.0, "created_utc": 1492467616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dge8238", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "primusinterpares1", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'd actually say that the girl is wise to focus on her career right now, you should take a leaf out of her book,the relationship is great and all, but she's not ready to sacrifice her career for it, and neither should you, stick to your goals of graduating , working with the company , getting an MBA and then buying a house, let the relationship evolve or dissolve naturally, you can still see each other weekends, and if it can't be sustained by weekend visits and skyping then it wasn't meant to be.It won't have to be that way forever,so don't pressure her to give up her dream job, and don't give up your plans", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d actually say that the girl is wise to focus on her career right now, you should take a leaf out of her book,the relationship is great and all, but she&amp;#39;s not ready to sacrifice her career for it, and neither should you, stick to your goals of graduating , working with the company , getting an MBA and then buying a house, let the relationship evolve or dissolve naturally, you can still see each other weekends, and if it can&amp;#39;t be sustained by weekend visits and skyping then it wasn&amp;#39;t meant to be.It won&amp;#39;t have to be that way forever,so don&amp;#39;t pressure her to give up her dream job, and don&amp;#39;t give up your plans&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge8238", "score_hidden": false, "stickied": false, "created": 1492496420.0, "created_utc": 1492467620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xl3r", "likes": null, "replies": "", "user_reports": [], "id": "dgeazcc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Foe_Hammer", "parent_id": "t3_65xl3r", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "So, by the time I was three years in with my wife, I would not accept seeing her \"some weekends\". If she felt like it. I'd fucking commute in order to live with her because I love the home we've built together. \n\nYou're completely right, to her your relationship is her last thought in the matter. Which to me means you've got different plans. Talk to her, ask her whether she gives a fuck. I'm guessing she'll say she does but throw a dozen excuses out as to why she can't possibly compromise on this. \n\nBut compromise is the key to being together, if she can't, you won't work. I'm sorry mate, this is a shitty place to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, by the time I was three years in with my wife, I would not accept seeing her &amp;quot;some weekends&amp;quot;. If she felt like it. I&amp;#39;d fucking commute in order to live with her because I love the home we&amp;#39;ve built together. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re completely right, to her your relationship is her last thought in the matter. Which to me means you&amp;#39;ve got different plans. Talk to her, ask her whether she gives a fuck. I&amp;#39;m guessing she&amp;#39;ll say she does but throw a dozen excuses out as to why she can&amp;#39;t possibly compromise on this. &lt;/p&gt;\n\n&lt;p&gt;But compromise is the key to being together, if she can&amp;#39;t, you won&amp;#39;t work. I&amp;#39;m sorry mate, this is a shitty place to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgeazcc", "score_hidden": false, "stickied": false, "created": 1492500247.0, "created_utc": 1492471447.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]