[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;[[This is a little lengthy but there&amp;#39;s a TL;DR at the bottom!]]\nI&amp;#39;ve always been interested in older men, as someone who was previously abused for 18 years, then abused further by not knowing what was normal when I went out into the world, I&amp;#39;ve finally found someone who&amp;#39;s almost perfect. But the problem is, due to my abusive past, I literally don&amp;#39;t know if he actually is good to me. I lived with an abusive man thinking it was normal, until I met a guy at the club believe it or not, the first man to ever be nice to me, and I realized what I was living with wasn&amp;#39;t normal. I left my abuser for the other man, but after meeting someone else, I realized that other man wasn&amp;#39;t nice to me either, and let that scenario keep repeating itself again and again, the men weren&amp;#39;t ACTUALLY treating me well, they were just treating me slightly better than the other ones, so in my eyes, for that time, they were like Gods, until I realized I wasn&amp;#39;t actually being treated well and was being taken advantage of. \nThis one, we&amp;#39;ll call him Roman, does not hit or yell, no emotional or physical problems and truly supports me in getting better and encouraging getting medication etc, compliments me, worries about me, he&amp;#39;s a good guy, the best. -- Though sometimes I get overwhelmed with fear and small amounts of resentment, because he is a God in my eyes, and it terrifies me that he may not actually be treating me well, he&amp;#39;s just treating me better than the last guy. I don&amp;#39;t know what&amp;#39;s good or what&amp;#39;s bad. I have no basis, no scale, I don&amp;#39;t know if I&amp;#39;m going to wake up one day realizing he never cared, or that I&amp;#39;m being taken advantage of again. I don&amp;#39;t know how to overcome this... which leads us to part two, I may not have to overcome it; I might just leave.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been considering leaving him, not due to being unsure about if he&amp;#39;s actually good to me or not, but because of the age difference. I ONLY date older men, they&amp;#39;re real and kind and supportive and stable and secure and they don&amp;#39;t run screaming by just the word &amp;quot;period&amp;quot; they have lived life and are REAL, and looking for something REAL, and not just partying and playing around etc. They want real and serious. UNFORTUNATELY, the age difference means that he&amp;#39;s done. At 43, he has travelled LITERALLY everywhere, he&amp;#39;s been married, had a kid, (which if fine I don&amp;#39;t want kids) BUT, that means he has made all the memories possible already. Nothing is new or exciting, he&amp;#39;s been everywhere, ate everything, skydiving, festivals, events, birthdays and christmas you get where I&amp;#39;m going, everything is old for him. For me, now that I&amp;#39;ve gotten out of the abuse, I&amp;#39;ve never done anything before. I&amp;#39;ve never gotten my hair done, nails done, I&amp;#39;ve never had lamb or steak, I&amp;#39;ve never been taken on a fancy date, I&amp;#39;ve never gotten to dress up I&amp;#39;ve never been to a festival, seen a concert, cooked dinner with someone, traveled, I&amp;#39;ve never been given flowers, I&amp;#39;ve never had a valentines day, celebrated thanksgiving or christmas or my birthday. There&amp;#39;s an entire world out there I want to see, but he doesn&amp;#39;t want to see movies or go to festivals or see an art show or go to a museum, he won&amp;#39;t go anywhere or do anything with me because nothing is interested, he&amp;#39;s done it a thousand times before, meanwhile I have never even driven a car. \nMy abuse has held me back to where I&amp;#39;m basically a newborn child who wore make up for the first time only last year. \nI adore him, he makes me happy, but what if I never get to experience anything? what if I always have to do everything alone? I&amp;#39;m sad and scared I&amp;#39;m doomed for that since I don&amp;#39;t like guys my age. (abuse, grew up fast, never had a childhood so there&amp;#39;s no connection for me to make with people my age) \nEvery time I try to ask if he wants to do something I get shut down, or in general he is very negative and dismissive, but his other qualities make up for it. But it leaves me all alone. &lt;/p&gt;\n\n&lt;p&gt;I used to do sex work, I have no self preservation or care for myself so sex work was always totally fine, in fact I miss it, but mostly I miss it is because it&amp;#39;s mass amounts of money for something not very hard, thus, my way out of my meth-den origins. Sex Work was my way of being able to see the world, wear things and see things and do things people like me would otherwise be unable to experience. I left that behind for Roman, but I worry that if I stay, I&amp;#39;ll stay dead, I&amp;#39;ll never experience life or see what&amp;#39;s out there. I worry staying with him is basically suicide, but I&amp;#39;m also petrified he really is the best I&amp;#39;m going to get, that he is treating me the best I deserve, and that leaving him will torment me forever.&lt;/p&gt;\n\n&lt;p&gt;TL;DR I only date older men but Older men have already done everything and thus I am left being the only one excited, and having to do everything by myself or not at all, making no memories. I used to do sex work and that was my big-money ticket to experience all the things people like me normally don&amp;#39;t get to experience. I left that life for him, I&amp;#39;m afraid I&amp;#39;ll never truly live if I stay, and that due to my past while I THINK he treats me well, there is no logical way for me to know if I am, in fact, being treated like other people. How do I decide if I should stay with him or leave to go back to sex work? &lt;/p&gt;\n\n&lt;p&gt;[[EDIT]] Going to clarify that I DO NOT live with him, I have my own apartment, and a full time 40 hours a week job.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[[This is a little lengthy but there's a TL;DR at the bottom!]]\nI've always been interested in older men, as someone who was previously abused for 18 years, then abused further by not knowing what was normal when I went out into the world, I've finally found someone who's almost perfect. But the problem is, due to my abusive past, I literally don't know if he actually is good to me. I lived with an abusive man thinking it was normal, until I met a guy at the club believe it or not, the first man to ever be nice to me, and I realized what I was living with wasn't normal. I left my abuser for the other man, but after meeting someone else, I realized that other man wasn't nice to me either, and let that scenario keep repeating itself again and again, the men weren't ACTUALLY treating me well, they were just treating me slightly better than the other ones, so in my eyes, for that time, they were like Gods, until I realized I wasn't actually being treated well and was being taken advantage of. \nThis one, we'll call him Roman, does not hit or yell, no emotional or physical problems and truly supports me in getting better and encouraging getting medication etc, compliments me, worries about me, he's a good guy, the best. -- Though sometimes I get overwhelmed with fear and small amounts of resentment, because he is a God in my eyes, and it terrifies me that he may not actually be treating me well, he's just treating me better than the last guy. I don't know what's good or what's bad. I have no basis, no scale, I don't know if I'm going to wake up one day realizing he never cared, or that I'm being taken advantage of again. I don't know how to overcome this... which leads us to part two, I may not have to overcome it; I might just leave.\n\nI've been considering leaving him, not due to being unsure about if he's actually good to me or not, but because of the age difference. I ONLY date older men, they're real and kind and supportive and stable and secure and they don't run screaming by just the word \"period\" they have lived life and are REAL, and looking for something REAL, and not just partying and playing around etc. They want real and serious. UNFORTUNATELY, the age difference means that he's done. At 43, he has travelled LITERALLY everywhere, he's been married, had a kid, (which if fine I don't want kids) BUT, that means he has made all the memories possible already. Nothing is new or exciting, he's been everywhere, ate everything, skydiving, festivals, events, birthdays and christmas you get where I'm going, everything is old for him. For me, now that I've gotten out of the abuse, I've never done anything before. I've never gotten my hair done, nails done, I've never had lamb or steak, I've never been taken on a fancy date, I've never gotten to dress up I've never been to a festival, seen a concert, cooked dinner with someone, traveled, I've never been given flowers, I've never had a valentines day, celebrated thanksgiving or christmas or my birthday. There's an entire world out there I want to see, but he doesn't want to see movies or go to festivals or see an art show or go to a museum, he won't go anywhere or do anything with me because nothing is interested, he's done it a thousand times before, meanwhile I have never even driven a car. \nMy abuse has held me back to where I'm basically a newborn child who wore make up for the first time only last year. \nI adore him, he makes me happy, but what if I never get to experience anything? what if I always have to do everything alone? I'm sad and scared I'm doomed for that since I don't like guys my age. (abuse, grew up fast, never had a childhood so there's no connection for me to make with people my age) \nEvery time I try to ask if he wants to do something I get shut down, or in general he is very negative and dismissive, but his other qualities make up for it. But it leaves me all alone. \n\nI used to do sex work, I have no self preservation or care for myself so sex work was always totally fine, in fact I miss it, but mostly I miss it is because it's mass amounts of money for something not very hard, thus, my way out of my meth-den origins. Sex Work was my way of being able to see the world, wear things and see things and do things people like me would otherwise be unable to experience. I left that behind for Roman, but I worry that if I stay, I'll stay dead, I'll never experience life or see what's out there. I worry staying with him is basically suicide, but I'm also petrified he really is the best I'm going to get, that he is treating me the best I deserve, and that leaving him will torment me forever.\n\nTL;DR I only date older men but Older men have already done everything and thus I am left being the only one excited, and having to do everything by myself or not at all, making no memories. I used to do sex work and that was my big-money ticket to experience all the things people like me normally don't get to experience. I left that life for him, I'm afraid I'll never truly live if I stay, and that due to my past while I THINK he treats me well, there is no logical way for me to know if I am, in fact, being treated like other people. How do I decide if I should stay with him or leave to go back to sex work? \n\n[[EDIT]] Going to clarify that I DO NOT live with him, I have my own apartment, and a full time 40 hours a week job.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xnw6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "TerraUniversalist", "saved": false, "mod_reports": [], "name": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492458872.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65xnw6/should_i_19f_leave_my_43m_or_stay/", "num_reports": null, "locked": false, "stickied": false, "created": 1492485292.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65xnw6/should_i_19f_leave_my_43m_or_stay/", "author_flair_text": null, "quarantine": false, "title": "Should I (19/f) leave my (43/M) or stay?", "created_utc": 1492456492.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dgdyl6a", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Digitaldreamer7", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Leave and get therapy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Leave and get therapy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdyl6a", "score_hidden": false, "stickied": false, "created": 1492485378.0, "created_utc": 1492456578.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dge2duk", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "SeamlessYellow", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You need a lot of therapy. Stay single for a while and focus on therapy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need a lot of therapy. Stay single for a while and focus on therapy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge2duk", "score_hidden": false, "stickied": false, "created": 1492489649.0, "created_utc": 1492460849.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dge1o0w", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "marializer", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Most of this is above my pay grade, but wanted address \"he won't go anywhere or do anything with me because nothing is interested, he's done it a thousand times before.\" I am older than this guy, I've done a lot of stuff. Trust me, art and movies and concerts and steak are still fun. Festivals, okay, I can take a pass on that :) But his negativity is just negativity, it's not a function of his age.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most of this is above my pay grade, but wanted address &amp;quot;he won&amp;#39;t go anywhere or do anything with me because nothing is interested, he&amp;#39;s done it a thousand times before.&amp;quot; I am older than this guy, I&amp;#39;ve done a lot of stuff. Trust me, art and movies and concerts and steak are still fun. Festivals, okay, I can take a pass on that :) But his negativity is just negativity, it&amp;#39;s not a function of his age.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge1o0w", "score_hidden": false, "stickied": false, "created": 1492488855.0, "created_utc": 1492460055.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dge3ym0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thebabes2", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You deserve better, in all aspects of your life.  I think a problem here is you keep putting your life into the hands of others (mainly older men) and hope they'll make a life for you.  Stop doing that.  Live the life you want and let the rest come together on its own.  You can't have the life you want with this man.  He has no interest in your joy or happiness.\n\nYou're 19 and have a life ahead of  you. Live it.  I think a good start would be to get into counseling so you can start recognizing the destructive patterns in your life and to help avoid them in the future.  You can have a happy life, please don't give up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You deserve better, in all aspects of your life.  I think a problem here is you keep putting your life into the hands of others (mainly older men) and hope they&amp;#39;ll make a life for you.  Stop doing that.  Live the life you want and let the rest come together on its own.  You can&amp;#39;t have the life you want with this man.  He has no interest in your joy or happiness.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re 19 and have a life ahead of  you. Live it.  I think a good start would be to get into counseling so you can start recognizing the destructive patterns in your life and to help avoid them in the future.  You can have a happy life, please don&amp;#39;t give up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge3ym0", "score_hidden": false, "stickied": false, "created": 1492491412.0, "created_utc": 1492462612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dge7sx2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "VeganLGBTCrossfitter", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "This is a whole lot of crazy that reddit posts are gonna help. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a whole lot of crazy that reddit posts are gonna help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge7sx2", "score_hidden": false, "stickied": false, "created": 1492496096.0, "created_utc": 1492467296.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dge8fy3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stopbngcrazy", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Do not go back into the sex trade. Whether you stay with him or not is up to you, pray on it, it might give you some solace but going back into the sex trade will not. With a background of abuse, the sex trade is the last place you should be, no one should be, please give yourself a chance to learn some dignity and respect. Why not try to make friends and experience new and exciting things to do. There's lots of exciting things out there, try them. Oh and definitely get therapy. Good luck with everything. GBY. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not go back into the sex trade. Whether you stay with him or not is up to you, pray on it, it might give you some solace but going back into the sex trade will not. With a background of abuse, the sex trade is the last place you should be, no one should be, please give yourself a chance to learn some dignity and respect. Why not try to make friends and experience new and exciting things to do. There&amp;#39;s lots of exciting things out there, try them. Oh and definitely get therapy. Good luck with everything. GBY. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge8fy3", "score_hidden": false, "stickied": false, "created": 1492496913.0, "created_utc": 1492468113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dgeb2rs", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Corgiwiggle", "parent_id": "t1_dgea40o", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "If she is somewhere where their are protections it shouldn't be bad. She can also do porn or have a cam show", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she is somewhere where their are protections it shouldn&amp;#39;t be bad. She can also do porn or have a cam show&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgeb2rs", "score_hidden": false, "stickied": false, "created": 1492500372.0, "created_utc": 1492471572.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgea40o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Lucid003", "parent_id": "t1_dge7462", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "People who use heroin sure enjoy the shit out of it. Does that mean it's a good decision?\n\nPutting yourself into a situation where you're likely to be abused is not a good decision when you come from a background of abuse. It perpetuates the cycle.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People who use heroin sure enjoy the shit out of it. Does that mean it&amp;#39;s a good decision?&lt;/p&gt;\n\n&lt;p&gt;Putting yourself into a situation where you&amp;#39;re likely to be abused is not a good decision when you come from a background of abuse. It perpetuates the cycle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgea40o", "score_hidden": false, "stickied": false, "created": 1492499101.0, "created_utc": 1492470301.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dge7462", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Corgiwiggle", "parent_id": "t1_dge4vpf", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Not if she enjoys it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not if she enjoys it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge7462", "score_hidden": false, "stickied": false, "created": 1492495234.0, "created_utc": 1492466434.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4vpf", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Lucid003", "parent_id": "t1_dgdzyre", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Getting into sex work is a horrible decision for someone who has lived a life of abuse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Getting into sex work is a horrible decision for someone who has lived a life of abuse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge4vpf", "score_hidden": false, "stickied": false, "created": 1492492486.0, "created_utc": 1492463686.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzyre", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Corgiwiggle", "parent_id": "t1_dgdyrfn", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 1, "body": "Nothing wrong with sex work if she is safe ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing wrong with sex work if she is safe &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdzyre", "score_hidden": false, "stickied": false, "created": 1492486945.0, "created_utc": 1492458145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyrfn", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "eggsnbaconpie", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; How do I decide if I should stay with him or leave to go back to sex work?\n\nThe fuck? \n\nWhy isn't \"neither\" an option? Don't stay with abusive people and have some class and dignity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How do I decide if I should stay with him or leave to go back to sex work?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The fuck? &lt;/p&gt;\n\n&lt;p&gt;Why isn&amp;#39;t &amp;quot;neither&amp;quot; an option? Don&amp;#39;t stay with abusive people and have some class and dignity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdyrfn", "score_hidden": false, "stickied": false, "created": 1492485577.0, "created_utc": 1492456777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dgdzxw0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Corgiwiggle", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Nothing wrong with dating older people. That said you should date somebody who makes you happy. Your guy doesn't sound like he cares much about your wants and making you happy. He isn't putting in much effort. It might be helpful for you to take some time off to figure yourself out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing wrong with dating older people. That said you should date somebody who makes you happy. Your guy doesn&amp;#39;t sound like he cares much about your wants and making you happy. He isn&amp;#39;t putting in much effort. It might be helpful for you to take some time off to figure yourself out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdzxw0", "score_hidden": false, "stickied": false, "created": 1492486918.0, "created_utc": 1492458118.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dgdyol7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "omghi2posers", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Yea older men is fine. This dude could be your father. Are you just a fuck toy? Doesn't sound like he puts much effort in... I'm sure the power balance of this relationship is absolutely fucked. Find a shelter that will take you in and get help to get your life turned around. \n\nYou have a pattern here, you need help to break out. Seriously find a shelter and don't go back to sex work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea older men is fine. This dude could be your father. Are you just a fuck toy? Doesn&amp;#39;t sound like he puts much effort in... I&amp;#39;m sure the power balance of this relationship is absolutely fucked. Find a shelter that will take you in and get help to get your life turned around. &lt;/p&gt;\n\n&lt;p&gt;You have a pattern here, you need help to break out. Seriously find a shelter and don&amp;#39;t go back to sex work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgdyol7", "score_hidden": false, "stickied": false, "created": 1492485486.0, "created_utc": 1492456686.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dgekgji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "teezydoon", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I didn't read a single word of your post. The title enough speaks volumes. 19, and 43? Use your brain, girl. There is no way this relationship would work. Unless it's a hookup, leave his ass. This is borderline pedophilia\n\nEDIT; read about 50 words of your post. Looks like you need some therapy. I'm sorry about your abuse growing up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t read a single word of your post. The title enough speaks volumes. 19, and 43? Use your brain, girl. There is no way this relationship would work. Unless it&amp;#39;s a hookup, leave his ass. This is borderline pedophilia&lt;/p&gt;\n\n&lt;p&gt;EDIT; read about 50 words of your post. Looks like you need some therapy. I&amp;#39;m sorry about your abuse growing up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgekgji", "score_hidden": true, "stickied": false, "created": 1492511960.0, "created_utc": 1492483160.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65xnw6", "likes": null, "replies": "", "user_reports": [], "id": "dge156d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "betamaleorderbride", "parent_id": "t3_65xnw6", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I'm 43m.  I would never, ever date a 19 year old.  Fuck?  Sure, but expect to have any commonality beyond \"hey we both dig each other let's have sex\"?  No way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 43m.  I would never, ever date a 19 year old.  Fuck?  Sure, but expect to have any commonality beyond &amp;quot;hey we both dig each other let&amp;#39;s have sex&amp;quot;?  No way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dge156d", "score_hidden": false, "stickied": false, "created": 1492488271.0, "created_utc": 1492459471.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]