[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationship_advice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We started dating back in November, knowing that she would be leaving in January. Everything was amazing and I fell hard for this girl, which has never happened to me before. I think she fell pretty hard for me to because up until we started going out she had a plan to go abroad single. We were hesitant to make ourselves official but we eventually did, and then made plans for me to come visit her. For the first couple months everything was going really really well. We started a routine of talking to each other on FaceTime at least once a day and texted throughout the day whenever we had the chance. Somewhere in March I noticed that our video calls were slowly becoming shorter and quieter and that we weren&amp;#39;t making as much time for these calls as we used to. Good morning and goodnight texts began to fade out a little. Eventually, my girlfriend told me that she had been feeling really down and that maintaining an LDR without most of the benefits of actually having a boyfriend was starting to take its toll on her. She didn&amp;#39;t want to feel like she was holding herself back during a once-in-a-lifetime experience and also didn&amp;#39;t want to hold me back, also that she didn&amp;#39;t want to resent herself for creating a situation that made her unhappy. I can&amp;#39;t say that I don&amp;#39;t understand where she was coming from, after a while the calls and texts begin to feel more like &amp;quot;check-ins&amp;quot; and aren&amp;#39;t much of a replacement for being by each other&amp;#39;s side. She asked if we could do sort of a more open relationship, not necessarily seeing other people but just putting less pressure on ourselves in general. At the same time, she assured me that there wasn&amp;#39;t anything I had done to cause this, she had existing issues with anxiety (which I knew about early on) and felt like she was changing as a person and was having trouble figuring out herself and the situation, she said she didn&amp;#39;t want to me to see her at her worst and didn&amp;#39;t want to be the girl to fuck me up. I told her that I just didn&amp;#39;t think I liked the idea of it (which may have been selfish) and that I wanted to be there for her whether things were good or bad. After this, she was a little distant, which she apologized for, but we continued the routine we had with relatively few issues. The time came for me to visit. The first couple of days she was still acting very distant, emotionally and physically. Again she told me that she was still having trouble and that she was sorry. She didn&amp;#39;t know what to do about the situation and that she may just need a break, but she still loves me and wants an outcome where she doesn&amp;#39;t lose me. I told her I still love her and that I wanted the same thing. I also said that her being happy was extremely important to me, but at the same time it hurt me to even think about a break. We ended the conversation there and agreed that we wouldn&amp;#39;t talk about it again until the trip was over. The rest of it was amazing, except for the lack of intimacy. She was sick and had been for a little while so that probably had something to do with it but it&amp;#39;s hard not to feel like she&amp;#39;s not losing interest in me. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to now, she&amp;#39;s home on spring break for a few more days. As soon as we came back together she was acting distant again, we talked about it and decided we needed to have conversation on what the plan was for the last month of her trip. The same stuff as before came up, she was still figuring things out and unhappy not with me but her situation, I was beginning to feel lonely and unwanted, we both still loved each other and still wanted to be together when I went to visit again and when she came back. I said that going about things the same way we had been just wasn&amp;#39;t an option because it would only get worse, and that we had a choice between breaking up or taking a break, both of which I hated. She wanted to take breaking up off the table but I maintained that we had to be realistic. As the title said, we decided that we would take a break beginning when she goes back, and she said that anything we did during that period we would keep to ourselves. My problem is that I don&amp;#39;t think I could bring myself to see other people, it&amp;#39;s just not something that&amp;#39;s in me right now. I don&amp;#39;t know what to do and I can&amp;#39;t turn around and say that I changed my mind and give her some ultimatum. Thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We started dating back in November, knowing that she would be leaving in January. Everything was amazing and I fell hard for this girl, which has never happened to me before. I think she fell pretty hard for me to because up until we started going out she had a plan to go abroad single. We were hesitant to make ourselves official but we eventually did, and then made plans for me to come visit her. For the first couple months everything was going really really well. We started a routine of talking to each other on FaceTime at least once a day and texted throughout the day whenever we had the chance. Somewhere in March I noticed that our video calls were slowly becoming shorter and quieter and that we weren't making as much time for these calls as we used to. Good morning and goodnight texts began to fade out a little. Eventually, my girlfriend told me that she had been feeling really down and that maintaining an LDR without most of the benefits of actually having a boyfriend was starting to take its toll on her. She didn't want to feel like she was holding herself back during a once-in-a-lifetime experience and also didn't want to hold me back, also that she didn't want to resent herself for creating a situation that made her unhappy. I can't say that I don't understand where she was coming from, after a while the calls and texts begin to feel more like \"check-ins\" and aren't much of a replacement for being by each other's side. She asked if we could do sort of a more open relationship, not necessarily seeing other people but just putting less pressure on ourselves in general. At the same time, she assured me that there wasn't anything I had done to cause this, she had existing issues with anxiety (which I knew about early on) and felt like she was changing as a person and was having trouble figuring out herself and the situation, she said she didn't want to me to see her at her worst and didn't want to be the girl to fuck me up. I told her that I just didn't think I liked the idea of it (which may have been selfish) and that I wanted to be there for her whether things were good or bad. After this, she was a little distant, which she apologized for, but we continued the routine we had with relatively few issues. The time came for me to visit. The first couple of days she was still acting very distant, emotionally and physically. Again she told me that she was still having trouble and that she was sorry. She didn't know what to do about the situation and that she may just need a break, but she still loves me and wants an outcome where she doesn't lose me. I told her I still love her and that I wanted the same thing. I also said that her being happy was extremely important to me, but at the same time it hurt me to even think about a break. We ended the conversation there and agreed that we wouldn't talk about it again until the trip was over. The rest of it was amazing, except for the lack of intimacy. She was sick and had been for a little while so that probably had something to do with it but it's hard not to feel like she's not losing interest in me. \n\nFast forward to now, she's home on spring break for a few more days. As soon as we came back together she was acting distant again, we talked about it and decided we needed to have conversation on what the plan was for the last month of her trip. The same stuff as before came up, she was still figuring things out and unhappy not with me but her situation, I was beginning to feel lonely and unwanted, we both still loved each other and still wanted to be together when I went to visit again and when she came back. I said that going about things the same way we had been just wasn't an option because it would only get worse, and that we had a choice between breaking up or taking a break, both of which I hated. She wanted to take breaking up off the table but I maintained that we had to be realistic. As the title said, we decided that we would take a break beginning when she goes back, and she said that anything we did during that period we would keep to ourselves. My problem is that I don't think I could bring myself to see other people, it's just not something that's in me right now. I don't know what to do and I can't turn around and say that I changed my mind and give her some ultimatum. Thoughts?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zgp2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "PM_ME_REALFAKEDOORS", "saved": false, "mod_reports": [], "name": "t3_65zgp2", "subreddit_name_prefixed": "r/relationship_advice", "approved_by": null, "over_18": false, "domain": "self.relationship_advice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0cn", "edited": 1492475103.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationship_advice/comments/65zgp2/girlfriend22f_and_i_21m_are_taking_a_break_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492503539.0, "url": "https://www.reddit.com/r/relationship_advice/comments/65zgp2/girlfriend22f_and_i_21m_are_taking_a_break_for/", "author_flair_text": null, "quarantine": false, "title": "Girlfriend[22/f] and I [21/m] are taking a break for her last month abroad. Not sure how I feel.", "created_utc": 1492474739.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgee65a", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Mindtaker", "parent_id": "t3_65zgp2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Real relationships dont' take breaks.  People give each other space and shit of course but no.  Breaks are 100% situations where someone wants to fuck other people and do it guilt free.\n\nyou are being a doormat, if you put up with any of this she will know she owns you and so will every woman that comes after her.\n\nYou need to have some self respect dude.  You can't expect someone to respect someone who doesn't respect themselves. \n\nBreak up.  Work on your shit, then when you get back out there don't put up with this nonsense.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Real relationships dont&amp;#39; take breaks.  People give each other space and shit of course but no.  Breaks are 100% situations where someone wants to fuck other people and do it guilt free.&lt;/p&gt;\n\n&lt;p&gt;you are being a doormat, if you put up with any of this she will know she owns you and so will every woman that comes after her.&lt;/p&gt;\n\n&lt;p&gt;You need to have some self respect dude.  You can&amp;#39;t expect someone to respect someone who doesn&amp;#39;t respect themselves. &lt;/p&gt;\n\n&lt;p&gt;Break up.  Work on your shit, then when you get back out there don&amp;#39;t put up with this nonsense.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgee65a", "score_hidden": false, "stickied": false, "created": 1492504318.0, "created_utc": 1492475518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgeexlc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CaptnSave-A-Ho", "parent_id": "t3_65zgp2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "People fall \"hard and fast\" when there is an end date (her going abroad). Granted it wasn't a like a break up, but it is a distance that you know you won't be together physically if that makes sense. This tends make what would have been a normal relationship feel like the love of your lives.\n\nShe wants a break because there is another guy or she wants to sample the local fair. Like it or not, that's the deal. Since going abroad is temporary, if there wasn't something like this, she would have no problem riding it out like you are. You can say \"you know for a fact\" that this is not what's happened, but there is no way for you to really know this \"for a fact.\" I can say from personal experience being on both sides of this, this what happens when someone is apart and wants a \"break\". \n\nI'm sure she still has the feelings for you that she says she does, but she wants to get out and live a little and then pick up where you left off when she's state side again. Personally, I would end it and take it for what it was, but some people can ignore it and move on once she's back. That's something you have to figure out for yourself. Good luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People fall &amp;quot;hard and fast&amp;quot; when there is an end date (her going abroad). Granted it wasn&amp;#39;t a like a break up, but it is a distance that you know you won&amp;#39;t be together physically if that makes sense. This tends make what would have been a normal relationship feel like the love of your lives.&lt;/p&gt;\n\n&lt;p&gt;She wants a break because there is another guy or she wants to sample the local fair. Like it or not, that&amp;#39;s the deal. Since going abroad is temporary, if there wasn&amp;#39;t something like this, she would have no problem riding it out like you are. You can say &amp;quot;you know for a fact&amp;quot; that this is not what&amp;#39;s happened, but there is no way for you to really know this &amp;quot;for a fact.&amp;quot; I can say from personal experience being on both sides of this, this what happens when someone is apart and wants a &amp;quot;break&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure she still has the feelings for you that she says she does, but she wants to get out and live a little and then pick up where you left off when she&amp;#39;s state side again. Personally, I would end it and take it for what it was, but some people can ignore it and move on once she&amp;#39;s back. That&amp;#39;s something you have to figure out for yourself. Good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgeexlc", "score_hidden": false, "stickied": false, "created": 1492505265.0, "created_utc": 1492476465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgeegto", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "uafukboi", "parent_id": "t1_dgee9pl", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You just an idiot but it's okay everyone is an idiot at least once in their lifetime ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You just an idiot but it&amp;#39;s okay everyone is an idiot at least once in their lifetime &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgeegto", "score_hidden": false, "stickied": false, "created": 1492504683.0, "created_utc": 1492475883.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgeewrg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t1_dgee9pl", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt;  that maintaining an LDR without most of the benefits of actually having a boyfriend was starting to take its toll on her\n\nShe means fucking and she doesn't want to fuck you. You saw her after being apart for months and she was distant and refused any intimacy. She made excuses , you are friendzoned my poor fellow\n\nShe asked for an open relationship. She still wants sex just NOT WITH YOU. maybe she will take you back when she has had her fill of dicks but it will never be the same\n\n&gt; Fast forward to now, she's home on spring break for a few more days. As soon as we came back together she was acting distant again\n\nShe is back home and again wants nothing to do with you other than keeping you dangling like a piece of string. Has she even kissed you since you are back? A simple make out session? Cuddles? If no you are seriously deluded about her feelings\n\n&gt; I was beginning to feel lonely and unwanted\n\nYou are unwanted and alone, she just wants to keep you as her back up plan. Anyway my advice to you is re-read what you wrote. Then reread it again, she is not your GF anymore she just doesn't have the heart to dump you because you are a loyal doormat.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;that maintaining an LDR without most of the benefits of actually having a boyfriend was starting to take its toll on her&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She means fucking and she doesn&amp;#39;t want to fuck you. You saw her after being apart for months and she was distant and refused any intimacy. She made excuses , you are friendzoned my poor fellow&lt;/p&gt;\n\n&lt;p&gt;She asked for an open relationship. She still wants sex just NOT WITH YOU. maybe she will take you back when she has had her fill of dicks but it will never be the same&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Fast forward to now, she&amp;#39;s home on spring break for a few more days. As soon as we came back together she was acting distant again&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She is back home and again wants nothing to do with you other than keeping you dangling like a piece of string. Has she even kissed you since you are back? A simple make out session? Cuddles? If no you are seriously deluded about her feelings&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I was beginning to feel lonely and unwanted&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are unwanted and alone, she just wants to keep you as her back up plan. Anyway my advice to you is re-read what you wrote. Then reread it again, she is not your GF anymore she just doesn&amp;#39;t have the heart to dump you because you are a loyal doormat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgeewrg", "score_hidden": false, "stickied": false, "created": 1492505235.0, "created_utc": 1492476435.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgehub9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "P1mpVader", "parent_id": "t1_dgee9pl", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; I know for a fact she didn't cheat on me\n\nYou're a fucking moron. You (dopey, naive cuck) and her (slut who wants to slut) tick every fucking box of cliche. Keep buying her bullshit and enjoy those cummy kisses when she gets back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I know for a fact she didn&amp;#39;t cheat on me&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re a fucking moron. You (dopey, naive cuck) and her (slut who wants to slut) tick every fucking box of cliche. Keep buying her bullshit and enjoy those cummy kisses when she gets back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgehub9", "score_hidden": false, "stickied": false, "created": 1492508854.0, "created_utc": 1492480054.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgefnk3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cvega88", "parent_id": "t1_dgef895", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "OP, I understand why you got defensive about the subject at hand but the fellas have pretty much hit the nail on the head on this one. Don't be fooled and come to your senses, also, come on man, you've been dating since November, thay doesn't mean anything. She is done with you romantically, find someone local to crush on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, I understand why you got defensive about the subject at hand but the fellas have pretty much hit the nail on the head on this one. Don&amp;#39;t be fooled and come to your senses, also, come on man, you&amp;#39;ve been dating since November, thay doesn&amp;#39;t mean anything. She is done with you romantically, find someone local to crush on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgefnk3", "score_hidden": false, "stickied": false, "created": 1492506147.0, "created_utc": 1492477347.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgef895", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t1_dgee9pl", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "Guys who \"know for a fact\" that the girl who asked for a break and wants an open relationship \"hasn't cheated\" are the idiots of idiots. \n\nEnjoy tastings other cum. Enjoy STDs. Enjoy raising children by guys whose seed she preferred but has you paying for. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Guys who &amp;quot;know for a fact&amp;quot; that the girl who asked for a break and wants an open relationship &amp;quot;hasn&amp;#39;t cheated&amp;quot; are the idiots of idiots. &lt;/p&gt;\n\n&lt;p&gt;Enjoy tastings other cum. Enjoy STDs. Enjoy raising children by guys whose seed she preferred but has you paying for. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgef895", "score_hidden": false, "stickied": false, "created": 1492505627.0, "created_utc": 1492476827.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgee9pl", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "PM_ME_REALFAKEDOORS", "parent_id": "t1_dgedsng", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "I know for a fact that she hasn't cheated on me and doesn't have another guy lined up. And emotionally she's still there, excluding the short periods of time where she acts more distant, but that usually doesn't go on for more than a couple days. She was going to stick with the way things when I was hesitant about a break so I just don't think I agree with you. Maybe I am wrapped around her finger but I don't believe this is some scheme by her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know for a fact that she hasn&amp;#39;t cheated on me and doesn&amp;#39;t have another guy lined up. And emotionally she&amp;#39;s still there, excluding the short periods of time where she acts more distant, but that usually doesn&amp;#39;t go on for more than a couple days. She was going to stick with the way things when I was hesitant about a break so I just don&amp;#39;t think I agree with you. Maybe I am wrapped around her finger but I don&amp;#39;t believe this is some scheme by her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgee9pl", "score_hidden": false, "stickied": false, "created": 1492504444.0, "created_utc": 1492475644.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgedsng", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Cheddarcakes", "parent_id": "t3_65zgp2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "&gt; Thoughts?\n\nShe wants to fuck other people, lots of them. She is distant and refused to have sex with you why? Because she has another guy and didn't want to cheat on him or she caught an STD.\n\nYou are her back up , her plan B, her fall back. Dump her honestly reading your text made me feel bad for you , she isn't even pretending to be your GF anymore either emotionally or physically. She is mugging you off.\n\nShe has you wrapped around her little finger believing all her bullshit.\n\nBreak up and save yourself from heartbreak, date another girl asap to get back in the game", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Thoughts?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She wants to fuck other people, lots of them. She is distant and refused to have sex with you why? Because she has another guy and didn&amp;#39;t want to cheat on him or she caught an STD.&lt;/p&gt;\n\n&lt;p&gt;You are her back up , her plan B, her fall back. Dump her honestly reading your text made me feel bad for you , she isn&amp;#39;t even pretending to be your GF anymore either emotionally or physically. She is mugging you off.&lt;/p&gt;\n\n&lt;p&gt;She has you wrapped around her little finger believing all her bullshit.&lt;/p&gt;\n\n&lt;p&gt;Break up and save yourself from heartbreak, date another girl asap to get back in the game&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgedsng", "score_hidden": false, "stickied": false, "created": 1492503852.0, "created_utc": 1492475052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgef6bn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "the_bum_hammer", "parent_id": "t3_65zgp2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "When a girl wants a break, it's to fuck and suck a new cock. Maybe many new cocks. \n\nDistant and refusing you sex either means she caught something, she's afraid she caught something, or worse (and you're going to hate this), she doesn't want to *cheat* on him with you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When a girl wants a break, it&amp;#39;s to fuck and suck a new cock. Maybe many new cocks. &lt;/p&gt;\n\n&lt;p&gt;Distant and refusing you sex either means she caught something, she&amp;#39;s afraid she caught something, or worse (and you&amp;#39;re going to hate this), she doesn&amp;#39;t want to &lt;em&gt;cheat&lt;/em&gt; on him with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgef6bn", "score_hidden": false, "stickied": false, "created": 1492505560.0, "created_utc": 1492476760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgeh7xn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TryhardPantiesON", "parent_id": "t3_65zgp2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "You are getting cucked as you read this message, seriously man, last month and she wants a break? Oh god she is taking mad dicks inside her sugar walls i can tell you. Fucking dump her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are getting cucked as you read this message, seriously man, last month and she wants a break? Oh god she is taking mad dicks inside her sugar walls i can tell you. Fucking dump her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgeh7xn", "score_hidden": false, "stickied": false, "created": 1492508117.0, "created_utc": 1492479317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0cn", "removal_reason": null, "link_id": "t3_65zgp2", "likes": null, "replies": "", "user_reports": [], "id": "dgei87l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "capilot", "parent_id": "t3_65zgp2", "subreddit_name_prefixed": "r/relationship_advice", "controversiality": 0, "body": "It could be that the separation between the two of you caused love to fade. It happens. It's very sad, but it happens.\n\nWhose idea was the break? If it was hers, I can almost guarantee that she had found someone new before she even brought it up.", "edited": 1492481348.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It could be that the separation between the two of you caused love to fade. It happens. It&amp;#39;s very sad, but it happens.&lt;/p&gt;\n\n&lt;p&gt;Whose idea was the break? If it was hers, I can almost guarantee that she had found someone new before she even brought it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationship_advice", "name": "t1_dgei87l", "score_hidden": true, "stickied": false, "created": 1492509323.0, "created_utc": 1492480523.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]