[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Drugs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys, I&amp;#39;ve never actually wrote one of these before so bare with me, I&amp;#39;ll do my best to format this in a nice journal fashion that isn&amp;#39;t too hard to read.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Day 1:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The power had gone out fairly early in the day, and I was at work when it happened. Working from home on my PC this meant I would not be able to work at all for the time this outage was going on. I called the electric company and was greeted by a robot saying they were working to restore the issue and would likely have it restored around midnight.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Great,&amp;quot; I thought to myself and just sighed sitting on my couch staring at darkness in my living room. I decided to phone up my friend who was on break from college at the time and see if he wanted to chill for the day since I wouldn&amp;#39;t be doing anything anyway. We spent a lot of time just hanging out in my car, and catching up as it had been a little while since we&amp;#39;ve seen each other.  We ended up going to see Logan in the movies (great movie by the way). When after I received a call from my parents saying they called the electric company again and they were now saying they wouldn&amp;#39;t have the power restored for 2 more days. I was so disappointed because not only would I have nothing to fulfill my time for this time, I was also losing time at work because of this. My friend and I got in the car and went to McDonalds for a late night dinner and kill more time.&lt;/p&gt;\n\n&lt;p&gt;During the time we were there I had remembered you can get high off of cough syrup, and that I had done a fair bit of research on it a few months ago. So I got out my phone and pulled up some links I had saved with information on DXM. My friend and I got in the car and drove to the Walmart in his town, got some stuff, and spent a good few minutes rifling through brands of cough syrup with just DXM in it. Finally I found the long lasting brand of Robitussin and it said it only had DXM as the active ingredient.&lt;/p&gt;\n\n&lt;p&gt;Finally I got home, immediately after I went into my room and measured out 300mg worth of syrup for my first dose, a nice mid-range 3rd plateau trip. I spent a good hour waiting to feel something just staring at my ceiling in my bedroom, when finally I decided to get up and go to the kitchen for a drink. I remembered getting that drip feeling the moment I got on my feet, my legs felt like thick syrup, and my movements were weird. Suddenly the effects hit me like a brick almost immediately, I remember stumbling to the kitchen while laughing talking to myself at 3 AM &amp;quot;Whooooaaa, this shit is weeeeiiiirrrd&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I spent some time just wandering around my house enjoying the feeling, chanting weird things because it sounded cool and trippy. I spent most of the trip looking at CEVs while lying down on my kitchen floor and laughing, needless to say the cats were concerned. Eventually I made my way back to my room and some vivid dreams.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Day 2:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I woke up the next morning with a fierce headache, I realized that I didn&amp;#39;t actually drink any water or eat during that time, so I was extremely hungry and probably very dehydrated. I walked to the kitchen, beams of sun peering through the blinds and dust being highlighted by the light bouncing off of each speck. I downed 2 bottles of water as quickly as I could and made a thick PB&amp;amp;J sandwich for breakfast. I still felt slightly disassociated as I think the DXM was still slightly active at the time, a few more hours went by and my parents approached me saying they were going to my Grandmothers house for dinner, and wanted me to come along.&lt;/p&gt;\n\n&lt;p&gt;I felt too socially withdrawn to think that was a good idea, also I kinda wanted to do more DXM. So I made up not feeling well which I think with how weird I was acting probably helped reinforce the idea I was sick without my knowing of it. My parents looked a bit annoyed by the fact I was rejecting the idea of going with them, but I just couldn&amp;#39;t do it today, my parents know I use, but my Grandmother really doesn&amp;#39;t know about any of the things I do regarding this stuff, and I didn&amp;#39;t want to alarm her. &lt;/p&gt;\n\n&lt;p&gt;My parents were getting ready to leave, and I asked if they could charge my phone while they were there since she had electricity, and my phone was on 13%. I locked my phone and turned it off then handed it to them. I watched as their car pulled out of the driveway, and I promptly went to my room and measured the remaining cough syrup which ended up just being enough for a high 1st plateau trip. There wasn&amp;#39;t any visuals like I&amp;#39;d hoped for, just some slight euphoria. I remember getting my guitar that I hadn&amp;#39;t played in 6 years, and played random string combinations thinking they all sounded amazing.&lt;/p&gt;\n\n&lt;p&gt;I ended up falling asleep for the rest of the trip, and woke up much later in the night with my phone next to my bed on my desk, and I was completely sober by this time. There was a note next to my phone saying there was some leftover pizza in the fridge from my Grandmothers and that I needed to eat it quick before it went bad. I went and got the pizza and ate a few slices and downed some more water, then proceeded to grab my car keys and take a trip to my Walmart.&lt;/p&gt;\n\n&lt;p&gt;I got some jolly ranchers and Sprite from the Walmart as well as two bottles of Robitussin, because I was curious if I could take it in the lean fashion, and remove some of that disgusting artificial taste. I got home and put my groceries in their respective spots in my room, I wasn&amp;#39;t entirely sure if the lean method would do something to the DXM chemically and I couldn&amp;#39;t find any information on it, so I would measure out 10 mL of DXM and with each shot I&amp;#39;d down some Sprite immediately after. I dosed around 600mg worth this time, and began the wait once more.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Day 3:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Before I knew it, I was in my living room in the pitch dark standing in front of the light from a battery powered lantern watching my shadow on the ceiling, dancing to music I had on my phone, robo-tripping out of my mind. I swear I danced for 2 hours straight to the music I had on my phone, just captivated by my shadow on the ceiling. It was so fluid and beautiful, it was just a manifestation of myself plastered on the ceiling, no physical appearance, just my soul moving to the sound of the music. Eventually I decided I wanted another Sprite, so I stepped outside around 2 AM in search of a vending machine somewhere in the outside world. It was actually surprisingly easy toning down the &amp;quot;robo walk&amp;quot; and walking normal, or at least what I felt was normal but in reality was a baby step shuffle down the sidewalk. I managed to find a vending machine, but it was out. So I took my tripping self further on my journey, a pile of change jingling in my pocket with each step. I finally found another vending machine that was working, but someone had blocked the coin slot with 3 quarters all stuffed inside, I tried to remove the quarters but they were jammed inside. I was disappointed and took myself back home to continue my trip.&lt;/p&gt;\n\n&lt;p&gt;When I finally arrived back at my home, I realized the feeling was dying down, so I re-dosed around 200mg. It was at this point things became really trippy, I was no longer just having CEVs, but also some light OEVs. Around 4 AM I decided to go on another walk and listen to &amp;quot;3001: A Laced Odyssey by Flatbush Zombies.&amp;quot; Just listening to the music on the album, walking around in a completely pitch dark town, tripping balls -- such an amazing experience. Everything was so peaceful and quiet, it was just me alone in this world to myself, no worries, no stress.&lt;/p&gt;\n\n&lt;p&gt;Life started to feel like a video game, I explored an idea I had already realized a long time ago regarding societies guidelines that we all follow so blindly. I realized that they were just imaginary lines and didn&amp;#39;t exist, and what was real was that I&amp;#39;m here right now, in this spot on the Earth. I ended up leaving my neighborhood, walking on a sidewalk next to a busy street. I remember thinking about each personality that could possibly exist that drove by me in those fast cars, each one of them thinking about the &amp;quot;probably homeless bum&amp;quot; wandering on the sidewalk they just drove by. I felt sorry for them, they had no idea I was having the most real experience in my life to date, I was sad that those people probably didn&amp;#39;t understand, and all they saw was some weird guy walking late at night. &lt;/p&gt;\n\n&lt;p&gt;I started thinking that money wasn&amp;#39;t real, and it was just paper that we decided to give value, and that laws don&amp;#39;t exist. And if I really wanted to I could go to a store, take something and just walk out if I really wanted to, nothing was actually stopping me, I felt like I was the God of my own universe that was being laid out in front of me before my eyes. I continued to walk for hours, strictly avoiding going back home.&lt;/p&gt;\n\n&lt;p&gt;Eventually I began to question why I avoided going back so harshly, and I realized it was because it felt like my own home was a prison to me, and that I needed to get out and experience the world but I couldn&amp;#39;t because of my responsibilities to my family. Being outside was like a glimpse at the rest of the world, a prisoner looking out the window of his cell and taking in the fresh air, imaging what was waiting for him outside. Hours later I decided to finally go home, I lied down on the couch physically exhausted from all of the moving I had just done.&lt;/p&gt;\n\n&lt;p&gt;My Mom came out to the living room and talked to me a bit, almost immediately she asked if I was on something, I casually responded &amp;quot;cough syrup&amp;quot;, she followed up with an &amp;quot;Ah, okay.&amp;quot; I wasn&amp;#39;t sure if she thought I was being sarcastic or if she knew you could actually get high off of cough syrup. We ended up having a very meaningful conversation about our financial situation, and some other personal things regarding my family life. The sun was coming up again, and there was the same image of the sun peeking through the blinds reflecting off of the dust. &lt;/p&gt;\n\n&lt;p&gt;I started to get into a panicked confused state in my mind, I had convinced myself that this was the world we live in now. Electricity was no longer a thing, and we are officially back in the stone age. I was happy at this thought, but also terrified because it was such an immediate and big change to life as I knew it. I spent a solid 5 minutes in my racing frantic thoughts before I reminded myself that a common side effect of DXM was confusion, and I was panicking over nothing. Though I still thought there was never going to be power again, I was just content with it. I texted my friend and told him I just had the most amazing experience of my life and went to sleep finally with some residual euphoria to finish the day off with. &lt;/p&gt;\n\n&lt;p&gt;I woke up later that night to my lights being back on, and my PC sitting on a login screen next to me.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading, I hope you enjoyed the read. Also before anyone says, I know this was pretty irresponsible of me to binge this much, and it wasn&amp;#39;t the safest. But it&amp;#39;s definitely an experience I&amp;#39;ll hold with me for all of my life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys, I've never actually wrote one of these before so bare with me, I'll do my best to format this in a nice journal fashion that isn't too hard to read.\n\n**Day 1:**\n\nThe power had gone out fairly early in the day, and I was at work when it happened. Working from home on my PC this meant I would not be able to work at all for the time this outage was going on. I called the electric company and was greeted by a robot saying they were working to restore the issue and would likely have it restored around midnight.\n\n\"Great,\" I thought to myself and just sighed sitting on my couch staring at darkness in my living room. I decided to phone up my friend who was on break from college at the time and see if he wanted to chill for the day since I wouldn't be doing anything anyway. We spent a lot of time just hanging out in my car, and catching up as it had been a little while since we've seen each other.  We ended up going to see Logan in the movies (great movie by the way). When after I received a call from my parents saying they called the electric company again and they were now saying they wouldn't have the power restored for 2 more days. I was so disappointed because not only would I have nothing to fulfill my time for this time, I was also losing time at work because of this. My friend and I got in the car and went to McDonalds for a late night dinner and kill more time.\n\nDuring the time we were there I had remembered you can get high off of cough syrup, and that I had done a fair bit of research on it a few months ago. So I got out my phone and pulled up some links I had saved with information on DXM. My friend and I got in the car and drove to the Walmart in his town, got some stuff, and spent a good few minutes rifling through brands of cough syrup with just DXM in it. Finally I found the long lasting brand of Robitussin and it said it only had DXM as the active ingredient.\n\nFinally I got home, immediately after I went into my room and measured out 300mg worth of syrup for my first dose, a nice mid-range 3rd plateau trip. I spent a good hour waiting to feel something just staring at my ceiling in my bedroom, when finally I decided to get up and go to the kitchen for a drink. I remembered getting that drip feeling the moment I got on my feet, my legs felt like thick syrup, and my movements were weird. Suddenly the effects hit me like a brick almost immediately, I remember stumbling to the kitchen while laughing talking to myself at 3 AM \"Whooooaaa, this shit is weeeeiiiirrrd\" \n\nI spent some time just wandering around my house enjoying the feeling, chanting weird things because it sounded cool and trippy. I spent most of the trip looking at CEVs while lying down on my kitchen floor and laughing, needless to say the cats were concerned. Eventually I made my way back to my room and some vivid dreams.\n\n**Day 2:**\n\nI woke up the next morning with a fierce headache, I realized that I didn't actually drink any water or eat during that time, so I was extremely hungry and probably very dehydrated. I walked to the kitchen, beams of sun peering through the blinds and dust being highlighted by the light bouncing off of each speck. I downed 2 bottles of water as quickly as I could and made a thick PB&amp;J sandwich for breakfast. I still felt slightly disassociated as I think the DXM was still slightly active at the time, a few more hours went by and my parents approached me saying they were going to my Grandmothers house for dinner, and wanted me to come along.\n\nI felt too socially withdrawn to think that was a good idea, also I kinda wanted to do more DXM. So I made up not feeling well which I think with how weird I was acting probably helped reinforce the idea I was sick without my knowing of it. My parents looked a bit annoyed by the fact I was rejecting the idea of going with them, but I just couldn't do it today, my parents know I use, but my Grandmother really doesn't know about any of the things I do regarding this stuff, and I didn't want to alarm her. \n\nMy parents were getting ready to leave, and I asked if they could charge my phone while they were there since she had electricity, and my phone was on 13%. I locked my phone and turned it off then handed it to them. I watched as their car pulled out of the driveway, and I promptly went to my room and measured the remaining cough syrup which ended up just being enough for a high 1st plateau trip. There wasn't any visuals like I'd hoped for, just some slight euphoria. I remember getting my guitar that I hadn't played in 6 years, and played random string combinations thinking they all sounded amazing.\n\nI ended up falling asleep for the rest of the trip, and woke up much later in the night with my phone next to my bed on my desk, and I was completely sober by this time. There was a note next to my phone saying there was some leftover pizza in the fridge from my Grandmothers and that I needed to eat it quick before it went bad. I went and got the pizza and ate a few slices and downed some more water, then proceeded to grab my car keys and take a trip to my Walmart.\n\nI got some jolly ranchers and Sprite from the Walmart as well as two bottles of Robitussin, because I was curious if I could take it in the lean fashion, and remove some of that disgusting artificial taste. I got home and put my groceries in their respective spots in my room, I wasn't entirely sure if the lean method would do something to the DXM chemically and I couldn't find any information on it, so I would measure out 10 mL of DXM and with each shot I'd down some Sprite immediately after. I dosed around 600mg worth this time, and began the wait once more.\n\n**Day 3:**\n\nBefore I knew it, I was in my living room in the pitch dark standing in front of the light from a battery powered lantern watching my shadow on the ceiling, dancing to music I had on my phone, robo-tripping out of my mind. I swear I danced for 2 hours straight to the music I had on my phone, just captivated by my shadow on the ceiling. It was so fluid and beautiful, it was just a manifestation of myself plastered on the ceiling, no physical appearance, just my soul moving to the sound of the music. Eventually I decided I wanted another Sprite, so I stepped outside around 2 AM in search of a vending machine somewhere in the outside world. It was actually surprisingly easy toning down the \"robo walk\" and walking normal, or at least what I felt was normal but in reality was a baby step shuffle down the sidewalk. I managed to find a vending machine, but it was out. So I took my tripping self further on my journey, a pile of change jingling in my pocket with each step. I finally found another vending machine that was working, but someone had blocked the coin slot with 3 quarters all stuffed inside, I tried to remove the quarters but they were jammed inside. I was disappointed and took myself back home to continue my trip.\n\nWhen I finally arrived back at my home, I realized the feeling was dying down, so I re-dosed around 200mg. It was at this point things became really trippy, I was no longer just having CEVs, but also some light OEVs. Around 4 AM I decided to go on another walk and listen to \"3001: A Laced Odyssey by Flatbush Zombies.\" Just listening to the music on the album, walking around in a completely pitch dark town, tripping balls -- such an amazing experience. Everything was so peaceful and quiet, it was just me alone in this world to myself, no worries, no stress.\n\nLife started to feel like a video game, I explored an idea I had already realized a long time ago regarding societies guidelines that we all follow so blindly. I realized that they were just imaginary lines and didn't exist, and what was real was that I'm here right now, in this spot on the Earth. I ended up leaving my neighborhood, walking on a sidewalk next to a busy street. I remember thinking about each personality that could possibly exist that drove by me in those fast cars, each one of them thinking about the \"probably homeless bum\" wandering on the sidewalk they just drove by. I felt sorry for them, they had no idea I was having the most real experience in my life to date, I was sad that those people probably didn't understand, and all they saw was some weird guy walking late at night. \n\nI started thinking that money wasn't real, and it was just paper that we decided to give value, and that laws don't exist. And if I really wanted to I could go to a store, take something and just walk out if I really wanted to, nothing was actually stopping me, I felt like I was the God of my own universe that was being laid out in front of me before my eyes. I continued to walk for hours, strictly avoiding going back home.\n\nEventually I began to question why I avoided going back so harshly, and I realized it was because it felt like my own home was a prison to me, and that I needed to get out and experience the world but I couldn't because of my responsibilities to my family. Being outside was like a glimpse at the rest of the world, a prisoner looking out the window of his cell and taking in the fresh air, imaging what was waiting for him outside. Hours later I decided to finally go home, I lied down on the couch physically exhausted from all of the moving I had just done.\n\nMy Mom came out to the living room and talked to me a bit, almost immediately she asked if I was on something, I casually responded \"cough syrup\", she followed up with an \"Ah, okay.\" I wasn't sure if she thought I was being sarcastic or if she knew you could actually get high off of cough syrup. We ended up having a very meaningful conversation about our financial situation, and some other personal things regarding my family life. The sun was coming up again, and there was the same image of the sun peeking through the blinds reflecting off of the dust. \n\nI started to get into a panicked confused state in my mind, I had convinced myself that this was the world we live in now. Electricity was no longer a thing, and we are officially back in the stone age. I was happy at this thought, but also terrified because it was such an immediate and big change to life as I knew it. I spent a solid 5 minutes in my racing frantic thoughts before I reminded myself that a common side effect of DXM was confusion, and I was panicking over nothing. Though I still thought there was never going to be power again, I was just content with it. I texted my friend and told him I just had the most amazing experience of my life and went to sleep finally with some residual euphoria to finish the day off with. \n\nI woke up later that night to my lights being back on, and my PC sitting on a login screen next to me.\n\nThank you for reading, I hope you enjoyed the read. Also before anyone says, I know this was pretty irresponsible of me to binge this much, and it wasn't the safest. But it's definitely an experience I'll hold with me for all of my life.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long Post", "id": "64we9y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 83, "report_reasons": null, "author": "Oneleg5", "saved": false, "mod_reports": [], "name": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "approved_by": null, "over_18": false, "domain": "self.Drugs", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh7l", "edited": false, "link_flair_css_class": "Custom", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Drugs/comments/64we9y/the_time_i_binged_dxm_for_3_days_with_no_power/", "num_reports": null, "locked": false, "stickied": false, "created": 1492005253.0, "url": "https://www.reddit.com/r/Drugs/comments/64we9y/the_time_i_binged_dxm_for_3_days_with_no_power/", "author_flair_text": null, "quarantine": false, "title": "The time I binged DXM for 3 days with no power", "created_utc": 1491976453.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 51, "visited": false, "subreddit_type": "public", "ups": 83}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6vk8v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LifeIsHighOnMe", "parent_id": "t1_dg5jsts", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "I have done DXM almost every day for the past week. I have really shitty willpower.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have done DXM almost every day for the past week. I have really shitty willpower.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6vk8v", "score_hidden": false, "stickied": false, "created": 1492073736.0, "created_utc": 1492044936.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6fhrb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t1_dg5jsts", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Lowkey weak sauce lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lowkey weak sauce lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6fhrb", "score_hidden": false, "stickied": false, "created": 1492054998.0, "created_utc": 1492026198.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jsts", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "PV_Superfiend", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "3 day DXM binge lmao", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;3 day DXM binge lmao&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5jsts", "score_hidden": false, "stickied": false, "created": 1492005767.0, "created_utc": 1491976967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg5lle1", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "LSDAFFECTMRI", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Great story man", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story man&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5lle1", "score_hidden": false, "stickied": false, "created": 1492010292.0, "created_utc": 1491981492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg5pjlb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "snowclick", "parent_id": "t1_dg5ph9t", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "It definitely is good for that sorta thing. Especially since you can take it in the morning and it'll last well into the evening ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It definitely is good for that sorta thing. Especially since you can take it in the morning and it&amp;#39;ll last well into the evening &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5pjlb", "score_hidden": false, "stickied": false, "created": 1492022332.0, "created_utc": 1491993532.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ph9t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg5pf7i", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Honestly I think I'd only use it if I know I need a confidence boost for the day. There's a girl I'd really like to ask out, I feel like phenibut could definitely come in handy there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I think I&amp;#39;d only use it if I know I need a confidence boost for the day. There&amp;#39;s a girl I&amp;#39;d really like to ask out, I feel like phenibut could definitely come in handy there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5ph9t", "score_hidden": false, "stickied": false, "created": 1492022144.0, "created_utc": 1491993344.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pf7i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "snowclick", "parent_id": "t1_dg5pd4v", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Yeah I agree with that statement. It tests your limits. If you get into phenibut definitely pay attention to the warnings of using it once or twice a week max. Even 3 or 4 days in a row then quitting feels like shit but you definitely don't wanna get into it for weeks like I did. Feel like I totally ruined my body", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I agree with that statement. It tests your limits. If you get into phenibut definitely pay attention to the warnings of using it once or twice a week max. Even 3 or 4 days in a row then quitting feels like shit but you definitely don&amp;#39;t wanna get into it for weeks like I did. Feel like I totally ruined my body&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5pf7i", "score_hidden": false, "stickied": false, "created": 1492021976.0, "created_utc": 1491993176.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pd4v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg5p90u", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "There was a quote I saw on here awhile ago, maybe doesn't apply but I still think it's interesting and could provide some insight. \"Sometimes addiction can be on the path to enlightenment\", I feel like it has some merit, maybe it's just glorifying addiction, I don't know. I think it's profound though.\n\nI've been meaning to order some phenibut lately to give it a try, but financial things keep coming up that prevent me from doing so. :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was a quote I saw on here awhile ago, maybe doesn&amp;#39;t apply but I still think it&amp;#39;s interesting and could provide some insight. &amp;quot;Sometimes addiction can be on the path to enlightenment&amp;quot;, I feel like it has some merit, maybe it&amp;#39;s just glorifying addiction, I don&amp;#39;t know. I think it&amp;#39;s profound though.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been meaning to order some phenibut lately to give it a try, but financial things keep coming up that prevent me from doing so. :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5pd4v", "score_hidden": false, "stickied": false, "created": 1492021805.0, "created_utc": 1491993005.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5p90u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "snowclick", "parent_id": "t1_dg5p6rt", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "After that day I felt super proud that I kept it together and didn't totally lose it considering I already have anxiety issues. Felt like I had a breakthrough with anxiety.... and now I'm going through tapering off phenibut and it is a million times worse lol. Still feel like my DXM idiocy helped tho", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After that day I felt super proud that I kept it together and didn&amp;#39;t totally lose it considering I already have anxiety issues. Felt like I had a breakthrough with anxiety.... and now I&amp;#39;m going through tapering off phenibut and it is a million times worse lol. Still feel like my DXM idiocy helped tho&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5p90u", "score_hidden": false, "stickied": false, "created": 1492021468.0, "created_utc": 1491992668.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5p6rt", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg5oyhh", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "My early days of trying weed the first few times taught me heavily how to deal with anxiety in general, and I apply the same logic to all drugs now. I pride myself on my ability to rationalize my highs if something goes wrong.\n\nBob's Burgers is a great show though, my favorite episode was when the kids worked on a Hippie Pot farm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My early days of trying weed the first few times taught me heavily how to deal with anxiety in general, and I apply the same logic to all drugs now. I pride myself on my ability to rationalize my highs if something goes wrong.&lt;/p&gt;\n\n&lt;p&gt;Bob&amp;#39;s Burgers is a great show though, my favorite episode was when the kids worked on a Hippie Pot farm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5p6rt", "score_hidden": false, "stickied": false, "created": 1492021279.0, "created_utc": 1491992479.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg5vzef", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PreventFalls", "parent_id": "t1_dg5oyhh", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "I did it two days in a row once, many moons ago.  Yeah, that was not at all worth it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did it two days in a row once, many moons ago.  Yeah, that was not at all worth it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5vzef", "score_hidden": false, "stickied": false, "created": 1492034158.0, "created_utc": 1492005358.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oyhh", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "snowclick", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Jesus dude. I fucked myself up using it just two days in a row. Second day I had a terrible trip due to dosing too much and I had to sit in my room watching Bob's Burgers chugging water for like 7 hours just telling myself it'll end soon. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus dude. I fucked myself up using it just two days in a row. Second day I had a terrible trip due to dosing too much and I had to sit in my room watching Bob&amp;#39;s Burgers chugging water for like 7 hours just telling myself it&amp;#39;ll end soon. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5oyhh", "score_hidden": false, "stickied": false, "created": 1492020579.0, "created_utc": 1491991779.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg7suqw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jakearoo27", "parent_id": "t1_dg7n7xz", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Taking pictures of my bloody self absolutely sounds like something I would do too, especially if I was on dxm. I tried looking for the equate version but I could only find the kind with acetaminophen in them, but this was a neighborhood market Walmart, so milage may vary. I've found that dxm can actually work as a mild Viagra in low doses, Lol. But too right about not being able to actually finish. Another thing I've noticed quite a bit with low to moderate doses of dxm, i.e not so fucked up you can't function socially, Is it gives you an ego out of this world. Not on the same level as coke, But definitely a \"I kind do anything\" kind of feeling. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Taking pictures of my bloody self absolutely sounds like something I would do too, especially if I was on dxm. I tried looking for the equate version but I could only find the kind with acetaminophen in them, but this was a neighborhood market Walmart, so milage may vary. I&amp;#39;ve found that dxm can actually work as a mild Viagra in low doses, Lol. But too right about not being able to actually finish. Another thing I&amp;#39;ve noticed quite a bit with low to moderate doses of dxm, i.e not so fucked up you can&amp;#39;t function socially, Is it gives you an ego out of this world. Not on the same level as coke, But definitely a &amp;quot;I kind do anything&amp;quot; kind of feeling. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg7suqw", "score_hidden": false, "stickied": false, "created": 1492129764.0, "created_utc": 1492100964.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7n7xz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "srsadvicethrow", "parent_id": "t1_dg7ji25", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "You want the generic for extra strength mucinex dm.  Walmart has an equate version of it that's like $15 for 1.7g of dxm.\n\nSome stores have non-extended release versions of those pills that are like $5 for a gram of dxm.\n\nIf you're going with daily use though, extended release is the way to go, minimizes the ups and downs and kinda smooths over the edges.\n\nSome people just puke their guts up from guaf, some people it doesn't really seem to affect.  YMMV.\n\nStart with like 200mg twice/day and scale up with tolerance, you'll be in space if you start at 800-1600mg/day.\n\nRegarding injuries, i used to love to take pics of my bloody body parts if i'd fall while running, climbing, biking etc.  My hands used to be scarred up from all the falls and shit, but that's mostly healed.  Same with my knees.\n\nThe disconnection and numbness really does take all of the trauma away from a serious injury.  Like i'd trip and my knee would be bleeding bad enough that blood would be soaking into my socks and i'd just be like, 'wow, that's a lot of blood, i should take a pic of that'.  I dug rocks out of my hand with a knife once while dexed out after an injury.\n\nI get how people can be on PCP and just do something insane like cut their faces off, though i never had any self-harm tendencies from dxm.\n\nIt just takes all the emotion out of trauma and makes it feel disconnected and clinical.  \n\nJust be careful, things that would normally hurt like crazy don't even hurt when you're dexed daily.\n\nAlso, good luck with cumming when you're on that much dxm, it was a big part of why i stopped.  You can still get hard, but it's a huge ordeal to finish, so fucking frustrating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You want the generic for extra strength mucinex dm.  Walmart has an equate version of it that&amp;#39;s like $15 for 1.7g of dxm.&lt;/p&gt;\n\n&lt;p&gt;Some stores have non-extended release versions of those pills that are like $5 for a gram of dxm.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re going with daily use though, extended release is the way to go, minimizes the ups and downs and kinda smooths over the edges.&lt;/p&gt;\n\n&lt;p&gt;Some people just puke their guts up from guaf, some people it doesn&amp;#39;t really seem to affect.  YMMV.&lt;/p&gt;\n\n&lt;p&gt;Start with like 200mg twice/day and scale up with tolerance, you&amp;#39;ll be in space if you start at 800-1600mg/day.&lt;/p&gt;\n\n&lt;p&gt;Regarding injuries, i used to love to take pics of my bloody body parts if i&amp;#39;d fall while running, climbing, biking etc.  My hands used to be scarred up from all the falls and shit, but that&amp;#39;s mostly healed.  Same with my knees.&lt;/p&gt;\n\n&lt;p&gt;The disconnection and numbness really does take all of the trauma away from a serious injury.  Like i&amp;#39;d trip and my knee would be bleeding bad enough that blood would be soaking into my socks and i&amp;#39;d just be like, &amp;#39;wow, that&amp;#39;s a lot of blood, i should take a pic of that&amp;#39;.  I dug rocks out of my hand with a knife once while dexed out after an injury.&lt;/p&gt;\n\n&lt;p&gt;I get how people can be on PCP and just do something insane like cut their faces off, though i never had any self-harm tendencies from dxm.&lt;/p&gt;\n\n&lt;p&gt;It just takes all the emotion out of trauma and makes it feel disconnected and clinical.  &lt;/p&gt;\n\n&lt;p&gt;Just be careful, things that would normally hurt like crazy don&amp;#39;t even hurt when you&amp;#39;re dexed daily.&lt;/p&gt;\n\n&lt;p&gt;Also, good luck with cumming when you&amp;#39;re on that much dxm, it was a big part of why i stopped.  You can still get hard, but it&amp;#39;s a huge ordeal to finish, so fucking frustrating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg7n7xz", "score_hidden": false, "stickied": false, "created": 1492123696.0, "created_utc": 1492094896.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ji25", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jakearoo27", "parent_id": "t1_dg6y7u0", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "I'll have to keep my eyes out for the pill form, I've always used syrup and that's caused major gastrointestinal trouble. On my heaviest trip, The bathroom was only about 15 steps away but it took me about 15 minutes to make it there. Haha I'll let you know, I'm afraid if I did do it on a level that you were it'd be too noticeable, it almost reminds me of PCP in the way you can easily sustain injuries just from the fact it numbs almost all your pain. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll have to keep my eyes out for the pill form, I&amp;#39;ve always used syrup and that&amp;#39;s caused major gastrointestinal trouble. On my heaviest trip, The bathroom was only about 15 steps away but it took me about 15 minutes to make it there. Haha I&amp;#39;ll let you know, I&amp;#39;m afraid if I did do it on a level that you were it&amp;#39;d be too noticeable, it almost reminds me of PCP in the way you can easily sustain injuries just from the fact it numbs almost all your pain. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg7ji25", "score_hidden": false, "stickied": false, "created": 1492119116.0, "created_utc": 1492090316.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6y7u0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "srsadvicethrow", "parent_id": "t1_dg6xiar", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "When i used it regularly, i mostly used generic extended release dxm/guaf pills as they're cheap, 60mg/pill, and i never had issues with nausea from guaf.  Guaf is basically non-toxic, like i've eaten so much of it with no problems.\n\nIf you can still find dxm powder, then that would probably be best, and maybe remember me if you find a good way to get it lol.\n\nDon't use syrup for long term use though, too much other crap.  At least dxm/guaf tabs are mostly dxm and guaf, and you can always smoke a little bit to kill the nausea.\n\nDon't use as much as i did daily, it was too much.  Maybe half of what i was using would be more sustainable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When i used it regularly, i mostly used generic extended release dxm/guaf pills as they&amp;#39;re cheap, 60mg/pill, and i never had issues with nausea from guaf.  Guaf is basically non-toxic, like i&amp;#39;ve eaten so much of it with no problems.&lt;/p&gt;\n\n&lt;p&gt;If you can still find dxm powder, then that would probably be best, and maybe remember me if you find a good way to get it lol.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t use syrup for long term use though, too much other crap.  At least dxm/guaf tabs are mostly dxm and guaf, and you can always smoke a little bit to kill the nausea.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t use as much as i did daily, it was too much.  Maybe half of what i was using would be more sustainable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6y7u0", "score_hidden": false, "stickied": false, "created": 1492077017.0, "created_utc": 1492048217.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xiar", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jakearoo27", "parent_id": "t1_dg6x9tu", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "You raise a good point with benzos and alcohol definitely having long term damage, I would much rather robo-trip on some dxm than drink any day. That's good to know though, I've thought about using it akin to you have as well, I.e everyday use for pain relief, general happiness etc. You would say getting it in pure form as opposed to in cough syrup would be better in the long run, right? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You raise a good point with benzos and alcohol definitely having long term damage, I would much rather robo-trip on some dxm than drink any day. That&amp;#39;s good to know though, I&amp;#39;ve thought about using it akin to you have as well, I.e everyday use for pain relief, general happiness etc. You would say getting it in pure form as opposed to in cough syrup would be better in the long run, right? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6xiar", "score_hidden": false, "stickied": false, "created": 1492076144.0, "created_utc": 1492047344.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6x9tu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "srsadvicethrow", "parent_id": "t1_dg6tnc3", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "So i'm 27, i learned about dxm from a PSA we had to watch in middle school about cough medicine abuse.  Unsurprisingly, we had a bunch of kids in my school end up abusing dxm after that.  Kids like me were the reason that you now have to be 18 to buy dxm containing products.\n\nI've tripped on dxm thousands of times.\n\nI have HPPD from dxm use, other than that, i wouldn't really say that dxm has negatively affected me in any way.  I mean i have had physical injuries that stemmed from dxm use, like falls while running, really bad frostbite on my hands from holding a bag of dry ice while so dexed out i couldn't feel my skin freezing and stuff like that, but i don't feel that my dxm use has affected my mental capacities in any significant way. \n\nIn contrast, alcohol and benzos have definite negative mental effects that are very apparent.\n\nAlcohol and benzos did far more damage than anything else that i've done.\n\nSome people seem to get really fucked up from dxm use, or at least that's what i've read anecdotally many times over the years.\n\nPersonally, its been pretty benign.  I've eaten over a kilo of dxm in my lifetime, i can say that without a doubt, and it had few negative effects other than HPPD.  \n\nI wouldn't take this one anecdote as a reason to assume dxm is harmless, but it's not guaranteed to fry your brain or anything like that.\n\nIn my experience though, it's relatively benign.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So i&amp;#39;m 27, i learned about dxm from a PSA we had to watch in middle school about cough medicine abuse.  Unsurprisingly, we had a bunch of kids in my school end up abusing dxm after that.  Kids like me were the reason that you now have to be 18 to buy dxm containing products.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tripped on dxm thousands of times.&lt;/p&gt;\n\n&lt;p&gt;I have HPPD from dxm use, other than that, i wouldn&amp;#39;t really say that dxm has negatively affected me in any way.  I mean i have had physical injuries that stemmed from dxm use, like falls while running, really bad frostbite on my hands from holding a bag of dry ice while so dexed out i couldn&amp;#39;t feel my skin freezing and stuff like that, but i don&amp;#39;t feel that my dxm use has affected my mental capacities in any significant way. &lt;/p&gt;\n\n&lt;p&gt;In contrast, alcohol and benzos have definite negative mental effects that are very apparent.&lt;/p&gt;\n\n&lt;p&gt;Alcohol and benzos did far more damage than anything else that i&amp;#39;ve done.&lt;/p&gt;\n\n&lt;p&gt;Some people seem to get really fucked up from dxm use, or at least that&amp;#39;s what i&amp;#39;ve read anecdotally many times over the years.&lt;/p&gt;\n\n&lt;p&gt;Personally, its been pretty benign.  I&amp;#39;ve eaten over a kilo of dxm in my lifetime, i can say that without a doubt, and it had few negative effects other than HPPD.  &lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t take this one anecdote as a reason to assume dxm is harmless, but it&amp;#39;s not guaranteed to fry your brain or anything like that.&lt;/p&gt;\n\n&lt;p&gt;In my experience though, it&amp;#39;s relatively benign.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6x9tu", "score_hidden": false, "stickied": false, "created": 1492075855.0, "created_utc": 1492047055.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tnc3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jakearoo27", "parent_id": "t1_dg638g5", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Have you ever felt like your dxm usage has affected your thinking, or felt any negative effects from prolonged use? I've had my fair share of dxm binges, all less than a week. It's underrated and a drug best paired with music and darkness, Imo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever felt like your dxm usage has affected your thinking, or felt any negative effects from prolonged use? I&amp;#39;ve had my fair share of dxm binges, all less than a week. It&amp;#39;s underrated and a drug best paired with music and darkness, Imo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6tnc3", "score_hidden": false, "stickied": false, "created": 1492071470.0, "created_utc": 1492042670.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg638g5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "srsadvicethrow", "parent_id": "t1_dg622kq", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "If you overdo it it can be bad for you.  Bursitis is typically an overuse injury and i kept running on it once it started because it didn't really hurt that bad until it got really bad.  It heals on its own in a couple of weeks if you stop running and let it heal.  It's very painful though, it hurt enough that it was hard to walk despite being on that much dxm daily.\n\nI mean, i was running a ton, but it wasn't really that extreme.  People training for marathons run as much or more than that.  I could have  run a marathon by the time i was in peak shape before the bursitis, like i wouldn't have set any records, but i could definitely have finished.  I just never actually did.  \n\nOnce you get to the point where you can run a half marathon, you're physically like 90% of the way there to running a whole marathon.  You just have to make sure that you're well hydrated, rested, fed, and generally prepared if you're gonna do the whole thing.  When you think about it from a running time perspective, the most i ever ran was like 18 miles on some trails through the woods.  I ran about 8 mph at the time on average for distance so it took a bit over 2 hours, had i kept running for another hour or so i would have gone a marathon distance.  \n\nI ran 2 half marathon distance runs in a day a couple of times with a break in between, i just never did it all at once.\n\nThe bursitis got bad before i got to actually do a marathon all at once.\n\nIt really doesn't take that long to get into shape like that if you run everyday.  Like i could get back there by like july or august if i started ramping up now.\n\nI currently run 25-30 miles/week.  Usually 6ish miles on 4 or 5 days.  I don't really count distance, i just run for a certain amount of time or i run a random route through my town or on the trails near it and just run to complete it, however long that takes.\n\nI'm not really a runner or anything either, like i never did cross country or anything like that.  I used to lift a ton in high school/college and running just felt like something i should do.  When i realized how easy and fun it was on dxm, i just kept with it.   I like it, so i keep doing it.  That's it really.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you overdo it it can be bad for you.  Bursitis is typically an overuse injury and i kept running on it once it started because it didn&amp;#39;t really hurt that bad until it got really bad.  It heals on its own in a couple of weeks if you stop running and let it heal.  It&amp;#39;s very painful though, it hurt enough that it was hard to walk despite being on that much dxm daily.&lt;/p&gt;\n\n&lt;p&gt;I mean, i was running a ton, but it wasn&amp;#39;t really that extreme.  People training for marathons run as much or more than that.  I could have  run a marathon by the time i was in peak shape before the bursitis, like i wouldn&amp;#39;t have set any records, but i could definitely have finished.  I just never actually did.  &lt;/p&gt;\n\n&lt;p&gt;Once you get to the point where you can run a half marathon, you&amp;#39;re physically like 90% of the way there to running a whole marathon.  You just have to make sure that you&amp;#39;re well hydrated, rested, fed, and generally prepared if you&amp;#39;re gonna do the whole thing.  When you think about it from a running time perspective, the most i ever ran was like 18 miles on some trails through the woods.  I ran about 8 mph at the time on average for distance so it took a bit over 2 hours, had i kept running for another hour or so i would have gone a marathon distance.  &lt;/p&gt;\n\n&lt;p&gt;I ran 2 half marathon distance runs in a day a couple of times with a break in between, i just never did it all at once.&lt;/p&gt;\n\n&lt;p&gt;The bursitis got bad before i got to actually do a marathon all at once.&lt;/p&gt;\n\n&lt;p&gt;It really doesn&amp;#39;t take that long to get into shape like that if you run everyday.  Like i could get back there by like july or august if i started ramping up now.&lt;/p&gt;\n\n&lt;p&gt;I currently run 25-30 miles/week.  Usually 6ish miles on 4 or 5 days.  I don&amp;#39;t really count distance, i just run for a certain amount of time or i run a random route through my town or on the trails near it and just run to complete it, however long that takes.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not really a runner or anything either, like i never did cross country or anything like that.  I used to lift a ton in high school/college and running just felt like something i should do.  When i realized how easy and fun it was on dxm, i just kept with it.   I like it, so i keep doing it.  That&amp;#39;s it really.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg638g5", "score_hidden": false, "stickied": false, "created": 1492042423.0, "created_utc": 1492013623.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg622kq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "doomedrig", "parent_id": "t1_dg5w6ys", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Daily running is bad for you? How do you prevent bursitis? And how much do you run now without DXM?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Daily running is bad for you? How do you prevent bursitis? And how much do you run now without DXM?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg622kq", "score_hidden": false, "stickied": false, "created": 1492041168.0, "created_utc": 1492012368.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w6ys", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "srsadvicethrow", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "I used to do a ton of dxm when i was younger.  There was a period of maybe 4-6 months where i was using dxm daily in 840-1680mg/day doses.  I would start my day with 420-600mg and redose however much i felt like during the day.\n\nDXM loses a lot of the magical trippiness when used this way, but it was an extremely effective antidepressant.  It also made me feel no pain and have unlimited energy so i'd run 7-9 miles/day, double on weekends, and ran a few half marathons while on it like they were nothing.  You just don't get tired, or feel pain.  Like i'd up my dxm dose by a few hundred mg a half hour before i'd run, smoke a bowl, put in earbuds and just listen to music and run and run and run, stopping not because i was tired or sore, but because enough time had passed that i felt like i should stop or because i was getting bored.\n\nI ended up getting bursitis in my hip from running so much so i quit running like that and quit using dxm like that in general.\n\nI had SSRI like withdrawal symptoms for about 5 days, then i was back to normal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to do a ton of dxm when i was younger.  There was a period of maybe 4-6 months where i was using dxm daily in 840-1680mg/day doses.  I would start my day with 420-600mg and redose however much i felt like during the day.&lt;/p&gt;\n\n&lt;p&gt;DXM loses a lot of the magical trippiness when used this way, but it was an extremely effective antidepressant.  It also made me feel no pain and have unlimited energy so i&amp;#39;d run 7-9 miles/day, double on weekends, and ran a few half marathons while on it like they were nothing.  You just don&amp;#39;t get tired, or feel pain.  Like i&amp;#39;d up my dxm dose by a few hundred mg a half hour before i&amp;#39;d run, smoke a bowl, put in earbuds and just listen to music and run and run and run, stopping not because i was tired or sore, but because enough time had passed that i felt like i should stop or because i was getting bored.&lt;/p&gt;\n\n&lt;p&gt;I ended up getting bursitis in my hip from running so much so i quit running like that and quit using dxm like that in general.&lt;/p&gt;\n\n&lt;p&gt;I had SSRI like withdrawal symptoms for about 5 days, then i was back to normal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5w6ys", "score_hidden": false, "stickied": false, "created": 1492034433.0, "created_utc": 1492005633.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg5pfy7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg5mlrr", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Oh definitely was fun, except the part where I thought we were entering a dark age for a moment! Definitely something I'm very careful about not doing too much though since it does have the potential for some adverse effects, even though I'd love to take it a few times through out the week I know I can't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh definitely was fun, except the part where I thought we were entering a dark age for a moment! Definitely something I&amp;#39;m very careful about not doing too much though since it does have the potential for some adverse effects, even though I&amp;#39;d love to take it a few times through out the week I know I can&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5pfy7", "score_hidden": false, "stickied": false, "created": 1492022037.0, "created_utc": 1491993237.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6j7pt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Flunkie_Drugs", "parent_id": "t1_dg6elxi", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "what do you mean, i've been able to be do far better writing large papers, participating in class, doing all my normal shit like better", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what do you mean, i&amp;#39;ve been able to be do far better writing large papers, participating in class, doing all my normal shit like better&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6j7pt", "score_hidden": false, "stickied": false, "created": 1492058830.0, "created_utc": 1492030030.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6elxi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SCREAMING_DUMB_SHIT", "parent_id": "t1_dg5w2mx", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Good lord man slow down", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good lord man slow down&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6elxi", "score_hidden": false, "stickied": false, "created": 1492054095.0, "created_utc": 1492025295.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6flbl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t1_dg5wfd9", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Very smart of you. Don't be like this guy ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very smart of you. Don&amp;#39;t be like this guy &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6flbl", "score_hidden": false, "stickied": false, "created": 1492055098.0, "created_utc": 1492026298.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wfd9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg5w2mx", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Well I mainly air on the side of caution because there isn't much research on it all, the benefits for some people though are very positive and sound nice. I'm moreso concerned about it losing its euphoric and psychedelic magic by constantly dosing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I mainly air on the side of caution because there isn&amp;#39;t much research on it all, the benefits for some people though are very positive and sound nice. I&amp;#39;m moreso concerned about it losing its euphoric and psychedelic magic by constantly dosing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5wfd9", "score_hidden": false, "stickied": false, "created": 1492034729.0, "created_utc": 1492005929.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6qt7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t1_dg6qs80", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Ah mannn it's the worst. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah mannn it&amp;#39;s the worst. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6qt7i", "score_hidden": false, "stickied": false, "created": 1492067960.0, "created_utc": 1492039160.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qs80", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flunkie_Drugs", "parent_id": "t1_dg6qfgq", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "well I can't wait for the diarrhea, been clogged up due to other chems in the pill.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well I can&amp;#39;t wait for the diarrhea, been clogged up due to other chems in the pill.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6qs80", "score_hidden": false, "stickied": false, "created": 1492067925.0, "created_utc": 1492039125.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6vquo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t1_dg6s5yt", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Ohhh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ohhh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6vquo", "score_hidden": false, "stickied": false, "created": 1492073958.0, "created_utc": 1492045158.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6s5yt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "srsadvicethrow", "parent_id": "t1_dg6qfgq", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "DXM withdrawal isn't that bad, it's like SSRI withdrawal, which makes sense since dxm is a serotonin/norepinephrine reuptake inhibitor.\n\nIt lasts less than a week, it's very unpleasant, but it's not life threatening or anything.  I'd recommend using other drugs to cover it up and make it go more smoothly as it sucks, but it's not *that* terrible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DXM withdrawal isn&amp;#39;t that bad, it&amp;#39;s like SSRI withdrawal, which makes sense since dxm is a serotonin/norepinephrine reuptake inhibitor.&lt;/p&gt;\n\n&lt;p&gt;It lasts less than a week, it&amp;#39;s very unpleasant, but it&amp;#39;s not life threatening or anything.  I&amp;#39;d recommend using other drugs to cover it up and make it go more smoothly as it sucks, but it&amp;#39;s not &lt;em&gt;that&lt;/em&gt; terrible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6s5yt", "score_hidden": false, "stickied": false, "created": 1492069613.0, "created_utc": 1492040813.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qfgq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t1_dg6j8bs", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Well yea it's good now but you're doing damage to yourself. Once you come off of it tho you're gonna get some nasty withdraws ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well yea it&amp;#39;s good now but you&amp;#39;re doing damage to yourself. Once you come off of it tho you&amp;#39;re gonna get some nasty withdraws &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6qfgq", "score_hidden": false, "stickied": false, "created": 1492067486.0, "created_utc": 1492038686.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6j8bs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flunkie_Drugs", "parent_id": "t1_dg6fkff", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "read my comment to screaming_dumb_shit please", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;read my comment to screaming_dumb_shit please&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6j8bs", "score_hidden": false, "stickied": false, "created": 1492058848.0, "created_utc": 1492030048.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fkff", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t1_dg5w2mx", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Not okay brodi ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not okay brodi &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6fkff", "score_hidden": false, "stickied": false, "created": 1492055072.0, "created_utc": 1492026272.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w2mx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flunkie_Drugs", "parent_id": "t1_dg5mlrr", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Why? Currently on month like 3 , 4-600mg day\nI'm loving it, functioning better than ever", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why? Currently on month like 3 , 4-600mg day\nI&amp;#39;m loving it, functioning better than ever&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5w2mx", "score_hidden": false, "stickied": false, "created": 1492034279.0, "created_utc": 1492005479.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mlrr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Sprayerxx", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "My last 7 day binge of DXM got me to ER- be careful! Sounds like you had fun though, this shit can be good when youre dry!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My last 7 day binge of DXM got me to ER- be careful! Sounds like you had fun though, this shit can be good when youre dry!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg5mlrr", "score_hidden": false, "stickied": false, "created": 1492013199.0, "created_utc": 1491984399.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg61xas", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "murraydylan", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Should have tripped on DPH, and suddenly see your long lost cousin from China come in your room and turn your light on, when in reality you're sitting there staring at a pair of jeans and talking to them ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Should have tripped on DPH, and suddenly see your long lost cousin from China come in your room and turn your light on, when in reality you&amp;#39;re sitting there staring at a pair of jeans and talking to them &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg61xas", "score_hidden": false, "stickied": false, "created": 1492041007.0, "created_utc": 1492012207.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6b57l", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Dogolio", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Mom im high on cough syrup \"ah, okay\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mom im high on cough syrup &amp;quot;ah, okay&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6b57l", "score_hidden": false, "stickied": false, "created": 1492050517.0, "created_utc": 1492021717.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg69uhp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg63jmm", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Sorry, my mistake. I'm sure you understand but those 3 days are a bit of a blur to me. Realistically that dose was probably around 600mg worth as well, and I probably got the 300 because that was likely the near amount of mL I consumed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, my mistake. I&amp;#39;m sure you understand but those 3 days are a bit of a blur to me. Realistically that dose was probably around 600mg worth as well, and I probably got the 300 because that was likely the near amount of mL I consumed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg69uhp", "score_hidden": false, "stickied": false, "created": 1492049185.0, "created_utc": 1492020385.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63jmm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Ace_Tyro", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "&gt;300 mg\n\n&gt;a nice mid-range 3rd plateau trip\n\nYeah no, in order to have 300 mg pure dxm to get you to a mid third plateau OP would have to be 70.5 pounds [try again bud!](http://dxm.darkridge.com/calc.html)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;300 mg&lt;/p&gt;\n\n&lt;p&gt;a nice mid-range 3rd plateau trip&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah no, in order to have 300 mg pure dxm to get you to a mid third plateau OP would have to be 70.5 pounds &lt;a href=\"http://dxm.darkridge.com/calc.html\"&gt;try again bud!&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg63jmm", "score_hidden": false, "stickied": false, "created": 1492042752.0, "created_utc": 1492013952.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg62g5i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FangornEnt", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Well written experience man. Makes me want to try DXM.  \n\nOne tried and true activity for when the power goes out: Drugs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well written experience man. Makes me want to try DXM.  &lt;/p&gt;\n\n&lt;p&gt;One tried and true activity for when the power goes out: Drugs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg62g5i", "score_hidden": false, "stickied": false, "created": 1492041572.0, "created_utc": 1492012772.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6fu9g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t1_dg63vji", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Ahh, the Dextroverse", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahh, the Dextroverse&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6fu9g", "score_hidden": false, "stickied": false, "created": 1492055353.0, "created_utc": 1492026553.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63vji", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "alphac16", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "One time i heard that grapefruit juice deactivates the enzyme that breaks down dxm so i drank a gallon of red grapefruit juice the day i drank 900mg dxm and was lost in the 4th plateau for near on 32 hours before i was back to baseline", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One time i heard that grapefruit juice deactivates the enzyme that breaks down dxm so i drank a gallon of red grapefruit juice the day i drank 900mg dxm and was lost in the 4th plateau for near on 32 hours before i was back to baseline&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg63vji", "score_hidden": false, "stickied": false, "created": 1492043099.0, "created_utc": 1492014299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6dbi3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AestheticVolt", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Damn dude. This story was great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn dude. This story was great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6dbi3", "score_hidden": false, "stickied": false, "created": 1492052760.0, "created_utc": 1492023960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6fvcz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustAnotherStonerYo", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Good read man (:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good read man (:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6fvcz", "score_hidden": false, "stickied": false, "created": 1492055383.0, "created_utc": 1492026583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg6hblo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_blackbear_", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Not sure why everyone is being so hostile in the comments - I thought this was a fantastic post OP, makes me remember why I'm so fond of DXM :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure why everyone is being so hostile in the comments - I thought this was a fantastic post OP, makes me remember why I&amp;#39;m so fond of DXM :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6hblo", "score_hidden": false, "stickied": false, "created": 1492056868.0, "created_utc": 1492028068.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh7l", "removal_reason": null, "link_id": "t3_64we9y", "likes": null, "replies": "", "user_reports": [], "id": "dg7gd0m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg78hy7", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Nah, you're good. Like I said this was my first time posting a \"trip report\" so I wasn't too thorough with it, will definitely fix that for the next time I write one of these up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, you&amp;#39;re good. Like I said this was my first time posting a &amp;quot;trip report&amp;quot; so I wasn&amp;#39;t too thorough with it, will definitely fix that for the next time I write one of these up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg7gd0m", "score_hidden": false, "stickied": false, "created": 1492114210.0, "created_utc": 1492085410.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78hy7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RikuAotsuki", "parent_id": "t1_dg6s4ej", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "I do apologize if I came off as bitchy. DXM dosing is very much weight based, and 3rd plateau is typically around 8mg/kg. 600mg could get you to third at around 175lbs and below, but 3rd at 300mg seemed a bit off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do apologize if I came off as bitchy. DXM dosing is very much weight based, and 3rd plateau is typically around 8mg/kg. 600mg could get you to third at around 175lbs and below, but 3rd at 300mg seemed a bit off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg78hy7", "score_hidden": false, "stickied": false, "created": 1492092964.0, "created_utc": 1492064164.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6s4ej", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Oneleg5", "parent_id": "t1_dg6f0yw", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "Indicated in another reply I probably got the 300 from the amount of mL consumed, not the actual mg worth. Slight oversight on my part, and the whole 3 days are pretty difficult to remember for the most part because the time warp was insane.\n\nAs for the dancing, I don't know what to tell you other than it was the 3rd consecutive day in a row, and that my tolerance was probably building up pretty steadily from the past 2 days, so this 600mg likely became a high 2nd plateau, possibly a very low 3rd. Also consider that I never actually indicated my weight in the OP, not saying I'm under 90 lbs. Just saying that it's just theorizing around a possible number that could be incorrect, all of that coupled with the fact that everyone's brain chemistry is different, and we all react differently to different things.\n\nI appreciate the response though, and sorry if I caused any confusion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indicated in another reply I probably got the 300 from the amount of mL consumed, not the actual mg worth. Slight oversight on my part, and the whole 3 days are pretty difficult to remember for the most part because the time warp was insane.&lt;/p&gt;\n\n&lt;p&gt;As for the dancing, I don&amp;#39;t know what to tell you other than it was the 3rd consecutive day in a row, and that my tolerance was probably building up pretty steadily from the past 2 days, so this 600mg likely became a high 2nd plateau, possibly a very low 3rd. Also consider that I never actually indicated my weight in the OP, not saying I&amp;#39;m under 90 lbs. Just saying that it&amp;#39;s just theorizing around a possible number that could be incorrect, all of that coupled with the fact that everyone&amp;#39;s brain chemistry is different, and we all react differently to different things.&lt;/p&gt;\n\n&lt;p&gt;I appreciate the response though, and sorry if I caused any confusion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6s4ej", "score_hidden": false, "stickied": false, "created": 1492069557.0, "created_utc": 1492040757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6f0yw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RikuAotsuki", "parent_id": "t3_64we9y", "subreddit_name_prefixed": "r/Drugs", "controversiality": 0, "body": "I'm sorry, 300mg for a mid third? You'd have to weigh clear under 90lbs... And ya sure wouldn't be dancing on 600.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, 300mg for a mid third? You&amp;#39;d have to weigh clear under 90lbs... And ya sure wouldn&amp;#39;t be dancing on 600.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Drugs", "name": "t1_dg6f0yw", "score_hidden": false, "stickied": false, "created": 1492054517.0, "created_utc": 1492025717.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]