[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "horror", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am someone who suffers from generalised anxiety and for a very long time I didn&amp;#39;t know how to cope with it. Things are very tense around the house as my dad just lost his job for the second time in a very short period of time and both him and my mother seem to be unhappy with how life is going. It&amp;#39;s filling my mind with constant stress because it seems like I can never relax in my own home. One day, I was looking for any way to distract myself from all my stresses and I decided to watch a horror movie; The Blair Witch Project to be more specific. I was captivated and I instantly forgot all my problems. I loved the feeling of being temporarily scared and just being able to shrug it off once the movie&amp;#39;s running time was up because it felt like a form of anxiety I could beat, knowing that the movie was fake. The only problem was that the movie stayed with me and for two weeks I had nightmares. I know some horror vets might laugh at the idea of that however I was a complete horror noob at this point. Anyway, I eventually got over it and built up the courage to go see The Conjuring 2 with my girlfriend in theatres. Again, I really enjoyed it but I had nightmares of that creepy nun for about a week straight. I almost gave up on horror entirely and thought it was yet another failed attempt at coping with anxiety BUT not too long after, I made a reddit account and dicovered the horror sub. I read a few posts and was instantly facinated and subscribed. One of the first things I posted was asking you guys how to not be so affected by horror movies and after one day I had 20+ people giving me tips and reassuring me that I&amp;#39;d built a tolerance to scary movies if I just kept watching them. Sure enough, the people that responded to that post were all right. I became used to watching horror movies over time and most of what I was watching was all movies from recommendations or discussions here on the sub. As weird as it seems, horror movies is how I cope with my severe anxiety. My anxiety used to make me depressed, every day but now I always have the next horror movie to look forward to and enjoy. I don&amp;#39;t know how well I&amp;#39;m explaining this but after watching a horror movie and going through all the tense emotions it brings to me as a viewer, I feel like I can kick anxiety&amp;#39;s butt and just forget about it all together because I&amp;#39;m so captivated. For me, anxiety will always be a part of my life but at least now I have an actual way of finding some sort of releaf. I know this was long and might come off a little corny but I just felt like I had to tell you guys that this community has truly impacted my life in a positive way and for that, I can&amp;#39;t thank this sub enough!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am someone who suffers from generalised anxiety and for a very long time I didn't know how to cope with it. Things are very tense around the house as my dad just lost his job for the second time in a very short period of time and both him and my mother seem to be unhappy with how life is going. It's filling my mind with constant stress because it seems like I can never relax in my own home. One day, I was looking for any way to distract myself from all my stresses and I decided to watch a horror movie; The Blair Witch Project to be more specific. I was captivated and I instantly forgot all my problems. I loved the feeling of being temporarily scared and just being able to shrug it off once the movie's running time was up because it felt like a form of anxiety I could beat, knowing that the movie was fake. The only problem was that the movie stayed with me and for two weeks I had nightmares. I know some horror vets might laugh at the idea of that however I was a complete horror noob at this point. Anyway, I eventually got over it and built up the courage to go see The Conjuring 2 with my girlfriend in theatres. Again, I really enjoyed it but I had nightmares of that creepy nun for about a week straight. I almost gave up on horror entirely and thought it was yet another failed attempt at coping with anxiety BUT not too long after, I made a reddit account and dicovered the horror sub. I read a few posts and was instantly facinated and subscribed. One of the first things I posted was asking you guys how to not be so affected by horror movies and after one day I had 20+ people giving me tips and reassuring me that I'd built a tolerance to scary movies if I just kept watching them. Sure enough, the people that responded to that post were all right. I became used to watching horror movies over time and most of what I was watching was all movies from recommendations or discussions here on the sub. As weird as it seems, horror movies is how I cope with my severe anxiety. My anxiety used to make me depressed, every day but now I always have the next horror movie to look forward to and enjoy. I don't know how well I'm explaining this but after watching a horror movie and going through all the tense emotions it brings to me as a viewer, I feel like I can kick anxiety's butt and just forget about it all together because I'm so captivated. For me, anxiety will always be a part of my life but at least now I have an actual way of finding some sort of releaf. I know this was long and might come off a little corny but I just felt like I had to tell you guys that this community has truly impacted my life in a positive way and for that, I can't thank this sub enough!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65f1m7", "gilded": 1, "secure_media_embed": {}, "clicked": false, "score": 134, "report_reasons": null, "author": "TylersSoap", "saved": false, "mod_reports": [], "name": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "approved_by": null, "over_18": false, "domain": "self.horror", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh9x", "edited": 1492230556.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/horror/comments/65f1m7/i_cant_thank_this_sub_enough_my_story_of_horror/", "num_reports": null, "locked": false, "stickied": false, "created": 1492230907.0, "url": "https://www.reddit.com/r/horror/comments/65f1m7/i_cant_thank_this_sub_enough_my_story_of_horror/", "author_flair_text": null, "quarantine": false, "title": "I can't thank this sub enough (My story of horror, anxiety and depression)", "created_utc": 1492202107.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 20, "visited": false, "subreddit_type": "public", "ups": 134}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dgacvh3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "alexfiat", "parent_id": "t1_dg9r63w", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Exactly, is your life shitty or are you currently going through some difficult shit? Well... At least you're not being haunted or being torn limb from limb like people in horror films! \n\n\nWhen my dog died a few months ago, I found a lot of comfort in horror films. They distracted me, but also comforted me in a weird way (especially paranormal ones) that maybe one day, I'll see my dog again. But yeah it can be really cathartic watching horror films! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly, is your life shitty or are you currently going through some difficult shit? Well... At least you&amp;#39;re not being haunted or being torn limb from limb like people in horror films! &lt;/p&gt;\n\n&lt;p&gt;When my dog died a few months ago, I found a lot of comfort in horror films. They distracted me, but also comforted me in a weird way (especially paranormal ones) that maybe one day, I&amp;#39;ll see my dog again. But yeah it can be really cathartic watching horror films! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dgacvh3", "score_hidden": false, "stickied": false, "created": 1492264535.0, "created_utc": 1492235735.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9r63w", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "The_Dead_See", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "This is awesome. I've always been a big advocate of the cathartic side of horror and it sounds like you're living proof. I'm glad you found us :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is awesome. I&amp;#39;ve always been a big advocate of the cathartic side of horror and it sounds like you&amp;#39;re living proof. I&amp;#39;m glad you found us :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9r63w", "score_hidden": false, "stickied": false, "created": 1492232824.0, "created_utc": 1492204024.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dg9tn3g", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "bellenus", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "awesome dude, what you said really connected with me. i had a spinal injury at work and basically spent 7 months lying in bed without any friends or family, stressing about the insurance company yelling at me, not having any money, and having very limited medical treatment. i wasnt sure if i would ever walk normally again or if the pain would ever go away and basically was suffering panic attacks every night. the only thing which sort of kept my mind off of wanting to kill myself was watching horror movies, and now im a total horror nut. really did help so much", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;awesome dude, what you said really connected with me. i had a spinal injury at work and basically spent 7 months lying in bed without any friends or family, stressing about the insurance company yelling at me, not having any money, and having very limited medical treatment. i wasnt sure if i would ever walk normally again or if the pain would ever go away and basically was suffering panic attacks every night. the only thing which sort of kept my mind off of wanting to kill myself was watching horror movies, and now im a total horror nut. really did help so much&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9tn3g", "score_hidden": false, "stickied": false, "created": 1492235985.0, "created_utc": 1492207185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dg9thsk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TylersSoap", "parent_id": "t1_dg9szz4", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Thank you, I appreciate that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I appreciate that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9thsk", "score_hidden": false, "stickied": false, "created": 1492235794.0, "created_utc": 1492206994.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9szz4", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "convergence_limit", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "It's great to hear stories like yours. I think sometimes people view others who are into horror as kind of like weirdos? But you hit the nail on the head with the idea of horror being cathartic. A lot of times, at least with me, anxiety is about not being able to control your situation and when watching a scary movie you lose that control but in a comfortable environment. I hope youre doing well and I hope things work out for your family!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s great to hear stories like yours. I think sometimes people view others who are into horror as kind of like weirdos? But you hit the nail on the head with the idea of horror being cathartic. A lot of times, at least with me, anxiety is about not being able to control your situation and when watching a scary movie you lose that control but in a comfortable environment. I hope youre doing well and I hope things work out for your family!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9szz4", "score_hidden": false, "stickied": false, "created": 1492235156.0, "created_utc": 1492206356.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dg9x22k", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Splitsurround", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Welcome to the fold, friend. \n\nI honestly believe that, on some level, your reason is all of our reason for watching horror. Maybe not anxiety, but watching artificial bad things lets us exercise all the feelings that entails, while still knowing it's not \"real\". \n\nAt least for me, that gives me a bit more strength to deal with the real shitty aspects of life. Generally speaking, they're mostly better and easier to deal with than the horrors that happen in film. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome to the fold, friend. &lt;/p&gt;\n\n&lt;p&gt;I honestly believe that, on some level, your reason is all of our reason for watching horror. Maybe not anxiety, but watching artificial bad things lets us exercise all the feelings that entails, while still knowing it&amp;#39;s not &amp;quot;real&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;At least for me, that gives me a bit more strength to deal with the real shitty aspects of life. Generally speaking, they&amp;#39;re mostly better and easier to deal with than the horrors that happen in film. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9x22k", "score_hidden": false, "stickied": false, "created": 1492240558.0, "created_utc": 1492211758.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dg9zloy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "agramugl", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "I mainly lurk a lot on this board without saying much, but what you said really affected me. Yeah, seriously, as someone who also deals with anxiety a ton, I feel the same way. There's a catharsis to cinema in general that people often overlook. But horror can mean so much...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mainly lurk a lot on this board without saying much, but what you said really affected me. Yeah, seriously, as someone who also deals with anxiety a ton, I feel the same way. There&amp;#39;s a catharsis to cinema in general that people often overlook. But horror can mean so much...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9zloy", "score_hidden": false, "stickied": false, "created": 1492243927.0, "created_utc": 1492215127.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dg9xil5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tstaff98", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Horror movies can be your best friend when you're depressed/anxious. A couple of months ago I had a surgery and was stuck in bed/on the couch. All I did was watch horror movies. It's like the pain you feel is completely absorbed by the people suffering in the film. Glad to hear that our beloved horror movies helped you out. I always though I was the only person who used horror movies so therapeutically. This thread made me happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Horror movies can be your best friend when you&amp;#39;re depressed/anxious. A couple of months ago I had a surgery and was stuck in bed/on the couch. All I did was watch horror movies. It&amp;#39;s like the pain you feel is completely absorbed by the people suffering in the film. Glad to hear that our beloved horror movies helped you out. I always though I was the only person who used horror movies so therapeutically. This thread made me happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9xil5", "score_hidden": false, "stickied": false, "created": 1492241158.0, "created_utc": 1492212358.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dga5ycr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "munchem6", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "I know the feels dude, I have a similar thing with horror. I've got pretty mild anxiety so I can't pretend like I know what you're going through, and I'm sorry that things are rough around the house. But for me watching a good horror movie, or at the very least knowing that I can watch one at the end of the day, instantly makes any anxious feelings disappear. Terrifying situations and brutal kills make me think \"damn, at least my life isn't *that* bad\" and afterwards it brings about a moment of quiet introspection. No other genre really does that, besides maybe scifi, but even there there's a lot of common ground between the two. Anyways, best of luck with everything, man! Don't stress too hard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know the feels dude, I have a similar thing with horror. I&amp;#39;ve got pretty mild anxiety so I can&amp;#39;t pretend like I know what you&amp;#39;re going through, and I&amp;#39;m sorry that things are rough around the house. But for me watching a good horror movie, or at the very least knowing that I can watch one at the end of the day, instantly makes any anxious feelings disappear. Terrifying situations and brutal kills make me think &amp;quot;damn, at least my life isn&amp;#39;t &lt;em&gt;that&lt;/em&gt; bad&amp;quot; and afterwards it brings about a moment of quiet introspection. No other genre really does that, besides maybe scifi, but even there there&amp;#39;s a lot of common ground between the two. Anyways, best of luck with everything, man! Don&amp;#39;t stress too hard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dga5ycr", "score_hidden": false, "stickied": false, "created": 1492252692.0, "created_utc": 1492223892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dga5omp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kapprika", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "This really resonates with me, as I suffer from generalized anxiety, too. In addition to being so cathartic for me, horror movies also make me feel kind of tough. It might sound silly, but while I'm usually ashamed of my anxiety, I can take pride in making it easily through movies that freak other people out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This really resonates with me, as I suffer from generalized anxiety, too. In addition to being so cathartic for me, horror movies also make me feel kind of tough. It might sound silly, but while I&amp;#39;m usually ashamed of my anxiety, I can take pride in making it easily through movies that freak other people out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dga5omp", "score_hidden": false, "stickied": false, "created": 1492252313.0, "created_utc": 1492223513.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dga8goq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kltor6", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "As someone who has been dealing with diagnosed depression and anxiety for almost 10 years, I totally understand where you are coming from. I have three things that have helped me, World of Warcraft (until it consumed my world and I quit playing), reading, and movies. Reading lets me use my imagination and go into another world that isn't mine, let's me escape. Movies are the same thing. I've only gotten back into horror movie the last six months or so, but horror has always been my mainstay for novels. Maybe give books a try also and see if they help the way movies have. There is a sub called r/horrorlit and they have tons of great suggestions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who has been dealing with diagnosed depression and anxiety for almost 10 years, I totally understand where you are coming from. I have three things that have helped me, World of Warcraft (until it consumed my world and I quit playing), reading, and movies. Reading lets me use my imagination and go into another world that isn&amp;#39;t mine, let&amp;#39;s me escape. Movies are the same thing. I&amp;#39;ve only gotten back into horror movie the last six months or so, but horror has always been my mainstay for novels. Maybe give books a try also and see if they help the way movies have. There is a sub called &lt;a href=\"/r/horrorlit\"&gt;r/horrorlit&lt;/a&gt; and they have tons of great suggestions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dga8goq", "score_hidden": false, "stickied": false, "created": 1492256491.0, "created_utc": 1492227691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dgb4hyy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FakkoPrime", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Glad you've found an outlet and coping method. \n\nWe all need a pressure valve. Too many turn to alcohol and drugs for it. \n\nKeep on keepin' on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad you&amp;#39;ve found an outlet and coping method. &lt;/p&gt;\n\n&lt;p&gt;We all need a pressure valve. Too many turn to alcohol and drugs for it. &lt;/p&gt;\n\n&lt;p&gt;Keep on keepin&amp;#39; on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dgb4hyy", "score_hidden": false, "stickied": false, "created": 1492316660.0, "created_utc": 1492287860.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dga3mwo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RapProducer", "parent_id": "t1_dg9ugje", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Then why haven't I had any wet dreams since then daddy?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then why haven&amp;#39;t I had any wet dreams since then daddy?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dga3mwo", "score_hidden": false, "stickied": false, "created": 1492249387.0, "created_utc": 1492220587.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ugje", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mzieg", "parent_id": "t1_dg9qoxx", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "No, we were real.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, we were real.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9ugje", "score_hidden": false, "stickied": false, "created": 1492237066.0, "created_utc": 1492208266.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qoxx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RapProducer", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "i feel you except i had mild paranoia, imagining delusions, now i am fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i feel you except i had mild paranoia, imagining delusions, now i am fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9qoxx", "score_hidden": false, "stickied": false, "created": 1492232227.0, "created_utc": 1492203427.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dg9z0ik", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "notpickard", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Nice", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dg9z0ik", "score_hidden": false, "stickied": false, "created": 1492243137.0, "created_utc": 1492214337.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dgagxkn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Emitex", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Good for you!\n\nI myself suffer from anxiety- and panic disorder. Also got some depression once a while. That's true horror.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good for you!&lt;/p&gt;\n\n&lt;p&gt;I myself suffer from anxiety- and panic disorder. Also got some depression once a while. That&amp;#39;s true horror.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dgagxkn", "score_hidden": false, "stickied": false, "created": 1492275110.0, "created_utc": 1492246310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dgahgi7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nikmeone", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "You have managed to put into words exactly how I feel about scary films! I have become obsessed with horror over the last 5 years. I had a breakdown 3 years ago. It's been the one constant, reliable outlet that has helped me through. Thank you for your post. I'm so glad it's helped you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have managed to put into words exactly how I feel about scary films! I have become obsessed with horror over the last 5 years. I had a breakdown 3 years ago. It&amp;#39;s been the one constant, reliable outlet that has helped me through. Thank you for your post. I&amp;#39;m so glad it&amp;#39;s helped you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dgahgi7", "score_hidden": false, "stickied": false, "created": 1492276784.0, "created_utc": 1492247984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dgan7tn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bloodgutssc", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Late to the party but I get where you are coming from. I've been laid up/housebound for about a year due to physical issues but it's taken an obvious psychological toll. Using horror as a means to cope may seem weird to some but hey if it works, it works. We all have our ways of dealing and sitting down to watch a movie is pretty healthy all things considered :D So happy to hear about horrors positive impact on your life!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Late to the party but I get where you are coming from. I&amp;#39;ve been laid up/housebound for about a year due to physical issues but it&amp;#39;s taken an obvious psychological toll. Using horror as a means to cope may seem weird to some but hey if it works, it works. We all have our ways of dealing and sitting down to watch a movie is pretty healthy all things considered :D So happy to hear about horrors positive impact on your life!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dgan7tn", "score_hidden": false, "stickied": false, "created": 1492291993.0, "created_utc": 1492263193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh9x", "removal_reason": null, "link_id": "t3_65f1m7", "likes": null, "replies": "", "user_reports": [], "id": "dgc2rvt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vulkans", "parent_id": "t3_65f1m7", "subreddit_name_prefixed": "r/horror", "controversiality": 0, "body": "Interesting take on horror, thanks for sharing.\n\nBlair Witch Project lingered with me weeks after seeing it back when it was released as well. Everything from nightmares to seeing shapes just outside of my field of vision, to feeling dread at the sight of an open window looking out to pitch black darkness at night- and it was the greatest feeling ever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting take on horror, thanks for sharing.&lt;/p&gt;\n\n&lt;p&gt;Blair Witch Project lingered with me weeks after seeing it back when it was released as well. Everything from nightmares to seeing shapes just outside of my field of vision, to feeling dread at the sight of an open window looking out to pitch black darkness at night- and it was the greatest feeling ever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "horror", "name": "t1_dgc2rvt", "score_hidden": false, "stickied": false, "created": 1492381414.0, "created_utc": 1492352614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]