[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "gameofthrones", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just curious, I&amp;#39;ve been itching to try a GoT themed campaign, set in Westeros of course, like areas where the character comes from, that could kinda be their class, abilities, etc. It&amp;#39;d be cool to set something during the Rebellion, fighting alongside Robert, or Rhaegar for that matter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just curious, I've been itching to try a GoT themed campaign, set in Westeros of course, like areas where the character comes from, that could kinda be their class, abilities, etc. It'd be cool to set something during the Rebellion, fighting alongside Robert, or Rhaegar for that matter.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "No Spoilers", "id": "64nb8i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "LetThereBeSmock", "saved": false, "mod_reports": [], "name": "t3_64nb8i", "subreddit_name_prefixed": "r/gameofthrones", "approved_by": null, "over_18": false, "domain": "self.gameofthrones", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjz2", "edited": false, "link_flair_css_class": "s-none", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/gameofthrones/comments/64nb8i/no_spoilers_does_anyone_have_any_good_dungeons/", "num_reports": null, "locked": false, "stickied": false, "created": 1491896993.0, "url": "https://www.reddit.com/r/gameofthrones/comments/64nb8i/no_spoilers_does_anyone_have_any_good_dungeons/", "author_flair_text": null, "quarantine": false, "title": "[No Spoilers] Does anyone have any good Dungeons and Dragons sets, campaigns, or simple ideas for something of the sort?", "created_utc": 1491868193.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_64nb8i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_64nb8i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_64nb8i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_64nb8i", "likes": null, "replies": "", "user_reports": [], "id": "dg4sepe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LetThereBeSmock", "parent_id": "t1_dg4dvf6", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "That sounds nice! I have as actually thinking the group would be doing a little mission outside, based on the very beginning of it all with going out to seee whst had happpened to some wildlings with a ranger, encountering a white Walker eventually, something along the lines of that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds nice! I have as actually thinking the group would be doing a little mission outside, based on the very beginning of it all with going out to seee whst had happpened to some wildlings with a ranger, encountering a white Walker eventually, something along the lines of that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg4sepe", "score_hidden": false, "stickied": false, "created": 1491968131.0, "created_utc": 1491939331.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dvf6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MairmanChao", "parent_id": "t1_dg4736q", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "Glad I could help. Best of luck with your campaign! For the Wall, maybe set your players up as a group of Night's Watchmen sent to garrison a previously unmanned fort that is not explored in the books? Gives you a great place to really make your own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad I could help. Best of luck with your campaign! For the Wall, maybe set your players up as a group of Night&amp;#39;s Watchmen sent to garrison a previously unmanned fort that is not explored in the books? Gives you a great place to really make your own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg4dvf6", "score_hidden": false, "stickied": false, "created": 1491952281.0, "created_utc": 1491923481.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4736q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LetThereBeSmock", "parent_id": "t1_dg3nfhf", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "Point taken, and received well! I gotcha about being constrained, and I have started planning a campaign based off the Wall, kinda left it to sit a while ago, but I'll have to go back and work on it, thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Point taken, and received well! I gotcha about being constrained, and I have started planning a campaign based off the Wall, kinda left it to sit a while ago, but I&amp;#39;ll have to go back and work on it, thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg4736q", "score_hidden": false, "stickied": false, "created": 1491943394.0, "created_utc": 1491914594.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3nfhf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MairmanChao", "parent_id": "t3_64nb8i", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "I'm not sure GoT is the best world to play D&amp;D in, and here's why: Dungeons and Dragons is purpose-built to be the ultimate role-playing game. Players are not only allowed but encouraged to do whatever they want and make as large or as small of an impact on the world as they choose. Because of this, the worlds that D&amp;D is typically played in, whether provided or homebrewed, usually sit on some sort of precipice as far as major events and are purposely not planned out into any major conclusion so as to not constrain the players and thus leaving them the freedom to create their own adventure. The problem with the GoT/ASOIAF world is that its bread and butter is that almost every detail and piece of minutia regarding its history has been laid out and explained to some degree. People interested enough can find out the chain of events that led to certain things in the GoT world almost as thoroughly as they might be able to for a real historical event. Even the established properties that people play RPGs in, like Star Wars for example, have either less dense histories or much more vast scales to work with than that of GoT. \n\n\nThis presents a serious problem to a prospective DM looking to plan a campaign in Westeros. You already know what's going to happen - not just the major points, but right down to every last battle and encounter. Trying to forge a completely new story, especially in the midst of a well-established period like the Rebellion, would quickly become a storytelling minefield as you and your players become increasingly conflicted over how to make independent decisions. Any major choice would always have an \"established\" option, letting players fall in line with the established history and essentially ride things out exactly as they're told in the books. If they do decide to veer off and change how things happened, you might find yourself in a panic about how to reconnect your players' tangential story back to the major events that are already spelled out. Also, as your players move off into new story arcs and begin to encounter familiar characters, you may find yourself overwhelmed with trying to do justice to the characters you must now control by making them feel as close to to books as you can, inevitably leading to a point where a player will say \"I don't think ______ would do that.\" because they've read the books too and they've got their own opinions about the character. Players who have read the books would also likely come to a point where they read something that conflicts with the campaign, negatively affecting the decisions they made or will make based on meta-reasoning that wasn't influenced by the game.\n\n\nI'm not saying it can't be done, and I don't by any means want to discourage you from trying, I'm just saying it will be extremely tricky. GoT is a very dense and established world with its histories, and I would hate to see you and your players lose interest in D&amp;D altogether because you feel that you can't make your own decisions. My recommendation is to create a homebrew world that is based on the GoT world, but with any and all of the changes you want to make plus a ton more wiggle room for players to blaze their own trail. There are so many resources on r/DnD and especially r/DnDBehindTheScreen that make building your own world easier than ever. You can start small and build it out as you play, adding things as they're needed.\n\nWhatever you decide to do, I wish you the best of luck!", "edited": 1491875252.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure GoT is the best world to play D&amp;amp;D in, and here&amp;#39;s why: Dungeons and Dragons is purpose-built to be the ultimate role-playing game. Players are not only allowed but encouraged to do whatever they want and make as large or as small of an impact on the world as they choose. Because of this, the worlds that D&amp;amp;D is typically played in, whether provided or homebrewed, usually sit on some sort of precipice as far as major events and are purposely not planned out into any major conclusion so as to not constrain the players and thus leaving them the freedom to create their own adventure. The problem with the GoT/ASOIAF world is that its bread and butter is that almost every detail and piece of minutia regarding its history has been laid out and explained to some degree. People interested enough can find out the chain of events that led to certain things in the GoT world almost as thoroughly as they might be able to for a real historical event. Even the established properties that people play RPGs in, like Star Wars for example, have either less dense histories or much more vast scales to work with than that of GoT. &lt;/p&gt;\n\n&lt;p&gt;This presents a serious problem to a prospective DM looking to plan a campaign in Westeros. You already know what&amp;#39;s going to happen - not just the major points, but right down to every last battle and encounter. Trying to forge a completely new story, especially in the midst of a well-established period like the Rebellion, would quickly become a storytelling minefield as you and your players become increasingly conflicted over how to make independent decisions. Any major choice would always have an &amp;quot;established&amp;quot; option, letting players fall in line with the established history and essentially ride things out exactly as they&amp;#39;re told in the books. If they do decide to veer off and change how things happened, you might find yourself in a panic about how to reconnect your players&amp;#39; tangential story back to the major events that are already spelled out. Also, as your players move off into new story arcs and begin to encounter familiar characters, you may find yourself overwhelmed with trying to do justice to the characters you must now control by making them feel as close to to books as you can, inevitably leading to a point where a player will say &amp;quot;I don&amp;#39;t think ______ would do that.&amp;quot; because they&amp;#39;ve read the books too and they&amp;#39;ve got their own opinions about the character. Players who have read the books would also likely come to a point where they read something that conflicts with the campaign, negatively affecting the decisions they made or will make based on meta-reasoning that wasn&amp;#39;t influenced by the game.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying it can&amp;#39;t be done, and I don&amp;#39;t by any means want to discourage you from trying, I&amp;#39;m just saying it will be extremely tricky. GoT is a very dense and established world with its histories, and I would hate to see you and your players lose interest in D&amp;amp;D altogether because you feel that you can&amp;#39;t make your own decisions. My recommendation is to create a homebrew world that is based on the GoT world, but with any and all of the changes you want to make plus a ton more wiggle room for players to blaze their own trail. There are so many resources on &lt;a href=\"/r/DnD\"&gt;r/DnD&lt;/a&gt; and especially &lt;a href=\"/r/DnDBehindTheScreen\"&gt;r/DnDBehindTheScreen&lt;/a&gt; that make building your own world easier than ever. You can start small and build it out as you play, adding things as they&amp;#39;re needed.&lt;/p&gt;\n\n&lt;p&gt;Whatever you decide to do, I wish you the best of luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg3nfhf", "score_hidden": false, "stickied": false, "created": 1491903777.0, "created_utc": 1491874977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_64nb8i", "likes": null, "replies": "", "user_reports": [], "id": "dg3i0hc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_64nb8i", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "[NO SPOILERS] means all event details need spoiler tags.  Show tags are black. Book tags are red. Theory tags are green. For more info on spoilers and tagging please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[NO SPOILERS] means all event details need spoiler tags.  Show tags are black. Book tags are red. Theory tags are green. For more info on spoilers and tagging please check the &lt;a href=\"/r/gameofthrones/w/spoiler_guide\"&gt;spoiler guide&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/gameofthrones\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg3i0hc", "score_hidden": false, "stickied": false, "created": 1491896993.0, "created_utc": 1491868193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]