[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "gameofthrones", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;ve seen quite a few tinfoil posts over the last few weeks about Cersei&amp;#39;s prophecy and the valonqar. &lt;/p&gt;\n\n&lt;p&gt;Allow me to don my tinfoil top hat and throw a crazy theory into the ring: Arya will kill Cersei while wearing Jaime&amp;#39;s face. &lt;/p&gt;\n\n&lt;p&gt;We saw Arya checking out Jaime at the end of last season. I posited in another thread that she was sizing Jaime up, since she probably realizes that she will have to kill him in order to get to Cersei. What if, instead, Arya is planning on killing Jaime, taking his face, and then killing Cersei? It would fulfill the prophesy of the valonqar...and might actually mean that Arya could somehow choke Cersei. According to the prophecy: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;And when your tears have drowned you, the valonqar shall wrap his hands about your pale white throat and choke the life from you.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jaime currently does not have the use of his dominant hand, which has made me question his ability to choke Cersei, as stated in the prophesy. But if Arya dons Jaime&amp;#39;s face, (and her body morphs along with it, which seems to be the case), she wouldn&amp;#39;t necessarily be missing a right hand herself. It&amp;#39;s only a form of disguise, after all. Granted, Arya would have to hide (or disguise) her right hand from Cersei in order to not arouse suspicion, but, interestingly enough, Arya is left-handed, so this would not constitute a problem for her. Since we&amp;#39;re talking industrial-grade tinfoil here - why couldn&amp;#39;t Arya be the valonqar in both senses of the term? She would be Jaime (the male younger brother) as well as herself (also a younger sibling). &lt;/p&gt;\n\n&lt;p&gt;So, what do you think? Did I do the tinfoil thing right? Does it need more tin, more foil, or both?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Please Note:&lt;/strong&gt; While it was fun to come up with, I don&amp;#39;t actually believe this theory will happen. I think Jaime will continue on in his redemption arc and will ultimately be the one to kill Cersei when she inevitably threatens to blow up KL and everyone who lives there. The Jaime as valonqar theory has been out there for a while and is no longer new and exciting, however I think it&amp;#39;s the most plausible, and also the most satisfying because I personally want to see Jaime redeem himself and I think it would be poetic if he was the one to kill Cersei.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, I've seen quite a few tinfoil posts over the last few weeks about Cersei's prophecy and the valonqar. \n\nAllow me to don my tinfoil top hat and throw a crazy theory into the ring: Arya will kill Cersei while wearing Jaime's face. \n\n\nWe saw Arya checking out Jaime at the end of last season. I posited in another thread that she was sizing Jaime up, since she probably realizes that she will have to kill him in order to get to Cersei. What if, instead, Arya is planning on killing Jaime, taking his face, and then killing Cersei? It would fulfill the prophesy of the valonqar...and might actually mean that Arya could somehow choke Cersei. According to the prophecy: \n\n&gt;\"And when your tears have drowned you, the valonqar shall wrap his hands about your pale white throat and choke the life from you.\"\n\nJaime currently does not have the use of his dominant hand, which has made me question his ability to choke Cersei, as stated in the prophesy. But if Arya dons Jaime's face, (and her body morphs along with it, which seems to be the case), she wouldn't necessarily be missing a right hand herself. It's only a form of disguise, after all. Granted, Arya would have to hide (or disguise) her right hand from Cersei in order to not arouse suspicion, but, interestingly enough, Arya is left-handed, so this would not constitute a problem for her. Since we're talking industrial-grade tinfoil here - why couldn't Arya be the valonqar in both senses of the term? She would be Jaime (the male younger brother) as well as herself (also a younger sibling). \n\nSo, what do you think? Did I do the tinfoil thing right? Does it need more tin, more foil, or both?\n\n**Please Note:** While it was fun to come up with, I don't actually believe this theory will happen. I think Jaime will continue on in his redemption arc and will ultimately be the one to kill Cersei when she inevitably threatens to blow up KL and everyone who lives there. The Jaime as valonqar theory has been out there for a while and is no longer new and exciting, however I think it's the most plausible, and also the most satisfying because I personally want to see Jaime redeem himself and I think it would be poetic if he was the one to kill Cersei.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Everything", "id": "657s1s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "Valar_Derpghulis", "saved": false, "mod_reports": [], "name": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "approved_by": null, "over_18": false, "domain": "self.gameofthrones", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjz2", "edited": 1492112593.0, "link_flair_css_class": "s-everything", "author_flair_css_class": "51", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/gameofthrones/comments/657s1s/everything_since_everyone_is_talking/", "num_reports": null, "locked": false, "stickied": false, "created": 1492141205.0, "url": "https://www.reddit.com/r/gameofthrones/comments/657s1s/everything_since_everyone_is_talking/", "author_flair_text": "House Whent", "quarantine": false, "title": "[EVERYTHING] Since everyone is talking tinfoil...(Arya/Jaime/Cersei tinfoil)", "created_utc": 1492112405.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dg87hf7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "keplar", "parent_id": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "Alright, we're talking tinfoil, so let's take the above as given - important thing in my mind is to figure out how Arya takes down Jaime. In her normal form it wouldn't work, obviously, since he knows her. What forms could she use? There's the serving girl she used to kill Frey - we know Jaime saw that persona, and that there was some camera linger to make that connection a possibility. Thing is, Jaime has been true to Cersei so far, and if he were to stray, it seems like he would try to go after Brienne, not some random serving girl. She could try to get Brienne, whom she has met, and who she knows has a sword from Jaime, but she is all the way North, and it would be a stretch to have Arya discover Jaime's fondness for Brienne. Also, Arya killing Brienne seems like a bit of a stretch, given that Brienne is a hell of a fighter and nearly always wary.\n\nNow, we've seen Jaqen gender bend, if I recall correctly, so there no reason Arya couldn't play a man. We've seen her pretend to be a boy before, and she's certainly spent a good deal of time around military men, so perhaps she emulates her most recent kill - Walder Frey. She spent time with Tywin as his cupbearer, and of course around her father, so she's not ignorant of how the Lord's of the realm act, and she would only need to maintain it briefly. If she were to go to King's Landing and assume the guise of Walder Frey under the pretense of paying homage to the new queen, Jaime would almost certainly meet with her/him, and could be drawn in to discussion relating to Riverrun, the surviving Starks, or other politics. Get Jaime looking at a map, his remaining good hand holding something, and the throat cutting could commence. \n\nLike you, I don't believe this will happen, but it's fun to think about and come up with ways it could!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alright, we&amp;#39;re talking tinfoil, so let&amp;#39;s take the above as given - important thing in my mind is to figure out how Arya takes down Jaime. In her normal form it wouldn&amp;#39;t work, obviously, since he knows her. What forms could she use? There&amp;#39;s the serving girl she used to kill Frey - we know Jaime saw that persona, and that there was some camera linger to make that connection a possibility. Thing is, Jaime has been true to Cersei so far, and if he were to stray, it seems like he would try to go after Brienne, not some random serving girl. She could try to get Brienne, whom she has met, and who she knows has a sword from Jaime, but she is all the way North, and it would be a stretch to have Arya discover Jaime&amp;#39;s fondness for Brienne. Also, Arya killing Brienne seems like a bit of a stretch, given that Brienne is a hell of a fighter and nearly always wary.&lt;/p&gt;\n\n&lt;p&gt;Now, we&amp;#39;ve seen Jaqen gender bend, if I recall correctly, so there no reason Arya couldn&amp;#39;t play a man. We&amp;#39;ve seen her pretend to be a boy before, and she&amp;#39;s certainly spent a good deal of time around military men, so perhaps she emulates her most recent kill - Walder Frey. She spent time with Tywin as his cupbearer, and of course around her father, so she&amp;#39;s not ignorant of how the Lord&amp;#39;s of the realm act, and she would only need to maintain it briefly. If she were to go to King&amp;#39;s Landing and assume the guise of Walder Frey under the pretense of paying homage to the new queen, Jaime would almost certainly meet with her/him, and could be drawn in to discussion relating to Riverrun, the surviving Starks, or other politics. Get Jaime looking at a map, his remaining good hand holding something, and the throat cutting could commence. &lt;/p&gt;\n\n&lt;p&gt;Like you, I don&amp;#39;t believe this will happen, but it&amp;#39;s fun to think about and come up with ways it could!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg87hf7", "score_hidden": false, "stickied": false, "created": 1492145584.0, "created_utc": 1492116784.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dg8b2cg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Valar_Derpghulis", "parent_id": "t1_dg8akjr", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "&gt;hosted by Chris Hardwick.\n\nOr, you know, [**this guy**](http://i2.kym-cdn.com/photos/images/facebook/000/158/326/9148130.jpg)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;hosted by Chris Hardwick.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Or, you know, &lt;a href=\"http://i2.kym-cdn.com/photos/images/facebook/000/158/326/9148130.jpg\"&gt;&lt;strong&gt;this guy&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg8b2cg", "score_hidden": false, "stickied": false, "created": 1492149942.0, "created_utc": 1492121142.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8akjr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Mousse_is_Optional", "parent_id": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "Talking Tinfoil sounds like a show that airs after Game of Thrones, and is hosted by Chris Hardwick.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talking Tinfoil sounds like a show that airs after Game of Thrones, and is hosted by Chris Hardwick.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg8akjr", "score_hidden": false, "stickied": false, "created": 1492149316.0, "created_utc": 1492120516.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dg8avjg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Valar_Derpghulis", "parent_id": "t1_dg88zvg", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "&gt; The bit that stands out for me is 'when your tears have drowned you'. Cersei's eyes barely even watered when Tommen died and it looked like that emotional part of Cersei had gone forever. \n\n\nYou make a good point - she *doesn't* show any emotion during her coronation. That said, it could still be figurative instead of literal. The only reason I like Jaime as the valonqar more than other options is because of the way it mirrors history. Tyrion has always seemed too obvious, but that doesn't mean it won't be him. I'm looking forward to seeing how this all unfolds!\n\n\n&gt;I wonder if the 'when your tears have drowned you' refers to Jamie. I can imagine she would weep for Jamie.\n\n\nI've felt for a while that (show) Cersei isn't in love with Jaime anymore (and maybe never truly was), so I'm not sure if she would even cry for him. If he were to die before her, I think she'd cry more because she is the the last Lannister (in her eyes Tyrion doesn't count and never will) and is thus alone. You could argue that the only reason she loved Jaime and her children were because they reminded her of herself, but I think this is more applicable to book Cersei than show Cersei.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The bit that stands out for me is &amp;#39;when your tears have drowned you&amp;#39;. Cersei&amp;#39;s eyes barely even watered when Tommen died and it looked like that emotional part of Cersei had gone forever. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You make a good point - she &lt;em&gt;doesn&amp;#39;t&lt;/em&gt; show any emotion during her coronation. That said, it could still be figurative instead of literal. The only reason I like Jaime as the valonqar more than other options is because of the way it mirrors history. Tyrion has always seemed too obvious, but that doesn&amp;#39;t mean it won&amp;#39;t be him. I&amp;#39;m looking forward to seeing how this all unfolds!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I wonder if the &amp;#39;when your tears have drowned you&amp;#39; refers to Jamie. I can imagine she would weep for Jamie.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve felt for a while that (show) Cersei isn&amp;#39;t in love with Jaime anymore (and maybe never truly was), so I&amp;#39;m not sure if she would even cry for him. If he were to die before her, I think she&amp;#39;d cry more because she is the the last Lannister (in her eyes Tyrion doesn&amp;#39;t count and never will) and is thus alone. You could argue that the only reason she loved Jaime and her children were because they reminded her of herself, but I think this is more applicable to book Cersei than show Cersei.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg8avjg", "score_hidden": false, "stickied": false, "created": 1492149699.0, "created_utc": 1492120899.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dg9hsjm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VENOMOUSbullet", "parent_id": "t1_dg88zvg", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "Now that you've said this, when would Cersei ever cry? I don't think she will. So what if it was the Tears of Lys that 'drowns' her. If I am not wrong in remembering​, the Tears of Lys make the person who intakes them suffocate. Similar to drowning. And how would she take them? Jaime unwittingly hands her a cup of wine that has been poisonined and in his despair, he choked her to stop the liquid from going down her throat. Effectively making her 'drown' and die at the hands of her Valomnquar. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now that you&amp;#39;ve said this, when would Cersei ever cry? I don&amp;#39;t think she will. So what if it was the Tears of Lys that &amp;#39;drowns&amp;#39; her. If I am not wrong in remembering​, the Tears of Lys make the person who intakes them suffocate. Similar to drowning. And how would she take them? Jaime unwittingly hands her a cup of wine that has been poisonined and in his despair, he choked her to stop the liquid from going down her throat. Effectively making her &amp;#39;drown&amp;#39; and die at the hands of her Valomnquar. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg9hsjm", "score_hidden": false, "stickied": false, "created": 1492221528.0, "created_utc": 1492192728.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88zvg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Waitingforadragon", "parent_id": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "&gt;\"And when your tears have drowned you, the valonqar shall wrap his hands about your pale white throat and choke the life from you.\"\n\nI'm not sure I believe the whole Jamie/valonqar thing. Wasn't that whole sentence omitted from the show? I can't think why as they could easily have included it. \n\nEven if that statement is still valid I still think it doesn't refer to Jamie. The bit that stands out for me is 'when your tears have drowned you'. Cersei's eyes barely even watered when Tommen died and it looked like that emotional part of Cersei had gone forever. However I wonder if the 'when your tears have drowned you' refers to Jamie. I can imagine she would weep for Jamie. So perhaps he dies before she does. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;And when your tears have drowned you, the valonqar shall wrap his hands about your pale white throat and choke the life from you.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure I believe the whole Jamie/valonqar thing. Wasn&amp;#39;t that whole sentence omitted from the show? I can&amp;#39;t think why as they could easily have included it. &lt;/p&gt;\n\n&lt;p&gt;Even if that statement is still valid I still think it doesn&amp;#39;t refer to Jamie. The bit that stands out for me is &amp;#39;when your tears have drowned you&amp;#39;. Cersei&amp;#39;s eyes barely even watered when Tommen died and it looked like that emotional part of Cersei had gone forever. However I wonder if the &amp;#39;when your tears have drowned you&amp;#39; refers to Jamie. I can imagine she would weep for Jamie. So perhaps he dies before she does. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg88zvg", "score_hidden": false, "stickied": false, "created": 1492147364.0, "created_utc": 1492118564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dg8f235", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "voodooxpizza", "parent_id": "t1_dg8csty", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "May be more satisfying if Cersei has him killed by the Mountain", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;May be more satisfying if Cersei has him killed by the Mountain&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg8f235", "score_hidden": false, "stickied": false, "created": 1492155222.0, "created_utc": 1492126422.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8csty", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Valar_Derpghulis", "parent_id": "t1_dg8c7gj", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "&gt; Does Arya have anything against him?\n\nI don't think she has anything *explicitly* against him...other than the fact that he killed Jory. (I'm not 100% on whether or not she knows it was Jaime, specifically, who landed the killing blow. She definitely knows he was there and had his men attack her father and kill his retainers.)  \n\nShe no doubt hates Jaime, just maybe not enough to put him in her initial top 10. Maybe now that she's been crossing off some names...she'll decide to add some more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Does Arya have anything against him?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think she has anything &lt;em&gt;explicitly&lt;/em&gt; against him...other than the fact that he killed Jory. (I&amp;#39;m not 100% on whether or not she knows it was Jaime, specifically, who landed the killing blow. She definitely knows he was there and had his men attack her father and kill his retainers.)  &lt;/p&gt;\n\n&lt;p&gt;She no doubt hates Jaime, just maybe not enough to put him in her initial top 10. Maybe now that she&amp;#39;s been crossing off some names...she&amp;#39;ll decide to add some more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg8csty", "score_hidden": false, "stickied": false, "created": 1492152228.0, "created_utc": 1492123428.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8c7gj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "voodooxpizza", "parent_id": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "I think you've got a great idea there, you might be right. This would be really exciting and thrilling to see on screen. Cercei is on the list, she's gotta go down hard, it would be really satisfying but my only criticism would be her motivation to kill Jamie. Does Arya have anything against him? She probably does, but I can't remember.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;ve got a great idea there, you might be right. This would be really exciting and thrilling to see on screen. Cercei is on the list, she&amp;#39;s gotta go down hard, it would be really satisfying but my only criticism would be her motivation to kill Jamie. Does Arya have anything against him? She probably does, but I can&amp;#39;t remember.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg8c7gj", "score_hidden": false, "stickied": false, "created": 1492151446.0, "created_utc": 1492122646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dg9rsl8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CaveLupum", "parent_id": "t1_dg9470q", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "I'd be glad if Arya does kill Cersei, but not via the face of Jaime or any known character. My ideal scenario is for Jon and Dany to need Cersei killed to win the War against the Dead. So they get Arya and the Hound to go to KL. To get to Cersei, they must first kill Qyburn and the Mountain. Sandor dons his brother's armor and when Cersei leaves her chamber, Arya slips in. When Cersei and her 'guard' return, ARya confronts Cersei in a brief conversation. But suddenly Cersei tells the Mountain to kill this upstart.  Off comes the helmet and...it's Sandor. Then Needle does its work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d be glad if Arya does kill Cersei, but not via the face of Jaime or any known character. My ideal scenario is for Jon and Dany to need Cersei killed to win the War against the Dead. So they get Arya and the Hound to go to KL. To get to Cersei, they must first kill Qyburn and the Mountain. Sandor dons his brother&amp;#39;s armor and when Cersei leaves her chamber, Arya slips in. When Cersei and her &amp;#39;guard&amp;#39; return, ARya confronts Cersei in a brief conversation. But suddenly Cersei tells the Mountain to kill this upstart.  Off comes the helmet and...it&amp;#39;s Sandor. Then Needle does its work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg9rsl8", "score_hidden": false, "stickied": false, "created": 1492233610.0, "created_utc": 1492204810.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9470q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Usurper213", "parent_id": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "I don't like the Arya wears Jaime's face and kills Cercei theory it feels like a waste of Jaime's arc and just because Cercei is on the list doesn't mean Arya should be the one to do it. In my opinion it has to be Jaime that's what would pack the biggest punch and would wrap up his character well and tragically.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t like the Arya wears Jaime&amp;#39;s face and kills Cercei theory it feels like a waste of Jaime&amp;#39;s arc and just because Cercei is on the list doesn&amp;#39;t mean Arya should be the one to do it. In my opinion it has to be Jaime that&amp;#39;s what would pack the biggest punch and would wrap up his character well and tragically.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg9470q", "score_hidden": false, "stickied": false, "created": 1492204849.0, "created_utc": 1492176049.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dga9rfc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WitELeoparD", "parent_id": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "I'm pretty sure that theory can be disproven in many ways.\nA : She doesn't need Jaime's face to get in the Sam e room as cercei. Literally being a servant girl could get her alone with Cersei.\nB : The faceless never seem to take the face of the opposite gender, as far as I can remember the men have always taken men's faces and the women the women's faces.\nC : Jamie's a great character his death has to be more horific/glorious.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure that theory can be disproven in many ways.\nA : She doesn&amp;#39;t need Jaime&amp;#39;s face to get in the Sam e room as cercei. Literally being a servant girl could get her alone with Cersei.\nB : The faceless never seem to take the face of the opposite gender, as far as I can remember the men have always taken men&amp;#39;s faces and the women the women&amp;#39;s faces.\nC : Jamie&amp;#39;s a great character his death has to be more horific/glorious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dga9rfc", "score_hidden": false, "stickied": false, "created": 1492258648.0, "created_utc": 1492229848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjz2", "removal_reason": null, "link_id": "t3_657s1s", "likes": null, "replies": "", "user_reports": [], "id": "dg83jhl", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_657s1s", "subreddit_name_prefixed": "r/gameofthrones", "controversiality": 0, "body": "[EVERYTHING] means comments about any event or theory are fine without spoiler tags. If you are concerned about spoilers, leave this thread immediately. For more info on spoilers and tagging please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide). **[EVERYTHING] does not cover Season 7 production leaks/spoilers. Please tag your comments with [S7] if you wish to discuss them.**.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[EVERYTHING] means comments about any event or theory are fine without spoiler tags. If you are concerned about spoilers, leave this thread immediately. For more info on spoilers and tagging please check the &lt;a href=\"/r/gameofthrones/w/spoiler_guide\"&gt;spoiler guide&lt;/a&gt;. &lt;strong&gt;[EVERYTHING] does not cover Season 7 production leaks/spoilers. Please tag your comments with [S7] if you wish to discuss them.&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/gameofthrones\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gameofthrones", "name": "t1_dg83jhl", "score_hidden": false, "stickied": false, "created": 1492141205.0, "created_utc": 1492112405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]