[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "linguistics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was speaking to my advisor yesterday about my major. I really want to do Linguistics and Computer Science but seeing as CS is extremely competitive I might have to settle for a minor instead. The only issue was that she said I&amp;#39;d likely have to go to grad school if I get just a linguistics degree or else it&amp;#39;s be really hard to find a good job. Is this true? Because if so, it makes me nervous. I don&amp;#39;t have the money to go to grad school and to be honest it doesn&amp;#39;t sound too appealing. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also not sure if a minor in CS will boost my resume because people don&amp;#39;t normally ask what you minored in...so I&amp;#39;m kind of lost and stressed right now. &lt;/p&gt;\n\n&lt;p&gt;What kind of job would a linguist with a bachelors get? And what would be the average salary? &lt;/p&gt;\n\n&lt;p&gt;One last thing: I really don&amp;#39;t plan on studying anything else because I&amp;#39;ve always wanted to get a job in tech and I love languages so it&amp;#39;s like my dream combination. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I was speaking to my advisor yesterday about my major. I really want to do Linguistics and Computer Science but seeing as CS is extremely competitive I might have to settle for a minor instead. The only issue was that she said I'd likely have to go to grad school if I get just a linguistics degree or else it's be really hard to find a good job. Is this true? Because if so, it makes me nervous. I don't have the money to go to grad school and to be honest it doesn't sound too appealing. \n\n\nI'm also not sure if a minor in CS will boost my resume because people don't normally ask what you minored in...so I'm kind of lost and stressed right now. \n\n\nWhat kind of job would a linguist with a bachelors get? And what would be the average salary? \n\n\nOne last thing: I really don't plan on studying anything else because I've always wanted to get a job in tech and I love languages so it's like my dream combination. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ygu4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "papichuloooo", "saved": false, "mod_reports": [], "name": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "approved_by": null, "over_18": false, "domain": "self.linguistics", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhos", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/linguistics/comments/64ygu4/jobs_for_linguists/", "num_reports": null, "locked": false, "stickied": false, "created": 1492035990.0, "url": "https://www.reddit.com/r/linguistics/comments/64ygu4/jobs_for_linguists/", "author_flair_text": null, "quarantine": false, "title": "Jobs for linguists?", "created_utc": 1492007190.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg7rgf2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "laura_leigh", "parent_id": "t1_dg67id8", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Also look into the type of CS job you want and where you want to live. Silicon Valley will be more competitive and require more than say the Midwest. Some jobs require Masters and others don't require a degree at all only proof you can do the job via portfolio of previous work or by testing within the interview process. \n\nHowever, if you struggle with the concepts get the degree. It's better to learn those where you have a built in support system if you find them difficult to understand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also look into the type of CS job you want and where you want to live. Silicon Valley will be more competitive and require more than say the Midwest. Some jobs require Masters and others don&amp;#39;t require a degree at all only proof you can do the job via portfolio of previous work or by testing within the interview process. &lt;/p&gt;\n\n&lt;p&gt;However, if you struggle with the concepts get the degree. It&amp;#39;s better to learn those where you have a built in support system if you find them difficult to understand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg7rgf2", "score_hidden": false, "stickied": false, "created": 1492128284.0, "created_utc": 1492099484.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67id8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "papichuloooo", "parent_id": "t1_dg66y7d", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Thanks for taking the time to respond. I'm gonna push myself and apply to transfer into the CS + Ling combined degree. It's not gonna be easy but I want to try. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for taking the time to respond. I&amp;#39;m gonna push myself and apply to transfer into the CS + Ling combined degree. It&amp;#39;s not gonna be easy but I want to try. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg67id8", "score_hidden": false, "stickied": false, "created": 1492046826.0, "created_utc": 1492018026.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66y7d", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "millionsofcats", "parent_id": "t1_dg66bph", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Good linguistics jobs, for the most part, are tenured faculty at research institutions. So ... your advisor was right, sadly. \n\nI'm sorry you're having trouble with CS. If you want to do a degree that leads to a job, though, you really should focus on the CS much more than ling. If it was me I would plan to double major, and if that was too much, do a ling minor (not a CS minor). If you can't do the CS courses, though, that choice is made for you I guess. Your head CS advisor might be a good person to continue going to for advice.\n\nOne additional thing to consider is that, for most students, the material covered in a ling major or minor is easier to self-teach than the material covered in a CS major or minor. This is especially true if you have difficulty with mathematical concepts. So, not having a formal education in ling doesn't mean that you can't still learn a lot about it it, if you're passionate. You can buy introductory textbooks,  read some of the great pop science out there, etc - and depending on your motivation/discipline, end up with a pretty decent undergrad-level amoung of knowledge.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good linguistics jobs, for the most part, are tenured faculty at research institutions. So ... your advisor was right, sadly. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re having trouble with CS. If you want to do a degree that leads to a job, though, you really should focus on the CS much more than ling. If it was me I would plan to double major, and if that was too much, do a ling minor (not a CS minor). If you can&amp;#39;t do the CS courses, though, that choice is made for you I guess. Your head CS advisor might be a good person to continue going to for advice.&lt;/p&gt;\n\n&lt;p&gt;One additional thing to consider is that, for most students, the material covered in a ling major or minor is easier to self-teach than the material covered in a CS major or minor. This is especially true if you have difficulty with mathematical concepts. So, not having a formal education in ling doesn&amp;#39;t mean that you can&amp;#39;t still learn a lot about it it, if you&amp;#39;re passionate. You can buy introductory textbooks,  read some of the great pop science out there, etc - and depending on your motivation/discipline, end up with a pretty decent undergrad-level amoung of knowledge.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg66y7d", "score_hidden": false, "stickied": false, "created": 1492046269.0, "created_utc": 1492017469.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66bph", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "papichuloooo", "parent_id": "t1_dg657qd", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Thanks for your response! I actually just came back from a meeting with the head CS advisor and he said I should try CS and Ling and if that doesn't work out, do a minor. My university has a pretty big research park and he said if I get an internship it would definitely increase my chances of landing a tech job. \n\nI also luckily have a research opportunity with my professor on a minority language so I'm hoping that would help me a bit. \n\nI was just kinda thrown off guard when my advisor said I'd need to probably go to grad school to get a good linguistics job because that was my fall back option if I failed in CS. I wasn't sure if I even wanted to try doing CS next year because this semester has been killing my spirit. \n\nI admit CS is difficult for me, seeing as I'm not the most mathematical person and I struggle with some concepts that others can do in their sleep. It's weird because I'm really good at learning HTML, CSS, and even Python but not Java. But I think I'm going to just go for it and try the combined major. I don't want to give up my dream. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your response! I actually just came back from a meeting with the head CS advisor and he said I should try CS and Ling and if that doesn&amp;#39;t work out, do a minor. My university has a pretty big research park and he said if I get an internship it would definitely increase my chances of landing a tech job. &lt;/p&gt;\n\n&lt;p&gt;I also luckily have a research opportunity with my professor on a minority language so I&amp;#39;m hoping that would help me a bit. &lt;/p&gt;\n\n&lt;p&gt;I was just kinda thrown off guard when my advisor said I&amp;#39;d need to probably go to grad school to get a good linguistics job because that was my fall back option if I failed in CS. I wasn&amp;#39;t sure if I even wanted to try doing CS next year because this semester has been killing my spirit. &lt;/p&gt;\n\n&lt;p&gt;I admit CS is difficult for me, seeing as I&amp;#39;m not the most mathematical person and I struggle with some concepts that others can do in their sleep. It&amp;#39;s weird because I&amp;#39;m really good at learning HTML, CSS, and even Python but not Java. But I think I&amp;#39;m going to just go for it and try the combined major. I don&amp;#39;t want to give up my dream. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg66bph", "score_hidden": false, "stickied": false, "created": 1492045632.0, "created_utc": 1492016832.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg657qd", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "millionsofcats", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "I'm going to be blunt. I actually wrote a gentler version of this comment, but thought that it didn't make the point strongly enough - and it is better if you aren't mislead by sugarcoating:\n\nYou won't get a job as a linguist with a BA or BS. You *probably* won't get a job as a linguist with a PhD, because the job market is incredibly competitive; there are many more linguistics PhDs than there are linguistics jobs. This is because linguistics isn't an area of inquiry with much private application--that is, there is next to no private market for linguists. Most professional linguists are faculty at universities.\n\nI don't know what to tell you about CS. I suspect that minoring in it will not be sufficient enough to qualify you for most CS jobs, but it's not my area. If you have an interest in tech and CS, I think you should seriously investigate before giving up.\n\nThis connects to a broader point:\n\nIt is becoming more and more true that you need at least a BA/BS in order to get a decent white-collar job. So, kids are told that they need to go to college - and they do, in numbers that increase every year. But *college isn't actually jobs training.* Many (most?) degrees don't prepare you for a particular career - even many degrees in STEM. And many jobs don't even care what degree you have; they just use it to narrow down the pool of applicants. \n\nSome linguistics departments try to spin this positively. My own has posters in the hallway advertising jobs like teachers, translators, and programmers - jobs that people with linguistics degrees do indeed get... *but none of those jobs are \"linguist\".* And none of them require a linguistics degree - in fact, most require additional knowledge / certification. \n\nI suggest that you turn the question around. Don't ask what kind of job you can get with a particular major and what kind of money you'll make. Instead, start by considering what kind of job you would like - and then find out what major will make you competitive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to be blunt. I actually wrote a gentler version of this comment, but thought that it didn&amp;#39;t make the point strongly enough - and it is better if you aren&amp;#39;t mislead by sugarcoating:&lt;/p&gt;\n\n&lt;p&gt;You won&amp;#39;t get a job as a linguist with a BA or BS. You &lt;em&gt;probably&lt;/em&gt; won&amp;#39;t get a job as a linguist with a PhD, because the job market is incredibly competitive; there are many more linguistics PhDs than there are linguistics jobs. This is because linguistics isn&amp;#39;t an area of inquiry with much private application--that is, there is next to no private market for linguists. Most professional linguists are faculty at universities.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to tell you about CS. I suspect that minoring in it will not be sufficient enough to qualify you for most CS jobs, but it&amp;#39;s not my area. If you have an interest in tech and CS, I think you should seriously investigate before giving up.&lt;/p&gt;\n\n&lt;p&gt;This connects to a broader point:&lt;/p&gt;\n\n&lt;p&gt;It is becoming more and more true that you need at least a BA/BS in order to get a decent white-collar job. So, kids are told that they need to go to college - and they do, in numbers that increase every year. But &lt;em&gt;college isn&amp;#39;t actually jobs training.&lt;/em&gt; Many (most?) degrees don&amp;#39;t prepare you for a particular career - even many degrees in STEM. And many jobs don&amp;#39;t even care what degree you have; they just use it to narrow down the pool of applicants. &lt;/p&gt;\n\n&lt;p&gt;Some linguistics departments try to spin this positively. My own has posters in the hallway advertising jobs like teachers, translators, and programmers - jobs that people with linguistics degrees do indeed get... &lt;em&gt;but none of those jobs are &amp;quot;linguist&amp;quot;.&lt;/em&gt; And none of them require a linguistics degree - in fact, most require additional knowledge / certification. &lt;/p&gt;\n\n&lt;p&gt;I suggest that you turn the question around. Don&amp;#39;t ask what kind of job you can get with a particular major and what kind of money you&amp;#39;ll make. Instead, start by considering what kind of job you would like - and then find out what major will make you competitive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg657qd", "score_hidden": false, "stickied": false, "created": 1492044491.0, "created_utc": 1492015691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6espo", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "theodric", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "I remember once, many years ago, looking at the website for a historical linguistics program at a German university. Under the \"practical applications\" section they simply wrote \"none.\" The sigh that I spontaneously emitted was also the sound of my dreams dying.\n\nIf you find a job *in your field* it will be a job as a prof making more linguists. They're self-replicating! If we don't control the population, one day, everyone will be linguists!\n\ntl;dr hahahahaha oh wait you were serious, I dunno, IT or something, glhf", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember once, many years ago, looking at the website for a historical linguistics program at a German university. Under the &amp;quot;practical applications&amp;quot; section they simply wrote &amp;quot;none.&amp;quot; The sigh that I spontaneously emitted was also the sound of my dreams dying.&lt;/p&gt;\n\n&lt;p&gt;If you find a job &lt;em&gt;in your field&lt;/em&gt; it will be a job as a prof making more linguists. They&amp;#39;re self-replicating! If we don&amp;#39;t control the population, one day, everyone will be linguists!&lt;/p&gt;\n\n&lt;p&gt;tl;dr hahahahaha oh wait you were serious, I dunno, IT or something, glhf&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6espo", "score_hidden": false, "stickied": false, "created": 1492054288.0, "created_utc": 1492025488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg8whmn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sublimenotions", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Get a linguistics degree and then get a job teaching ESL. The fact that it has not been mentioned in this thread is mind-boggling. Linguistics is the default degree for teaching ESL (and it is the default reason for getting a linguistics degree) and ESL is non-competitive because it is in demand literally everywhere on the globe and there are not enough teachers to go around. Depending where you work this will give you ample amounts of time to study the things you want. If you are in a metropolitan American city and you don't want to leave then yeah it is going to be difficult; but if the world is opened to you then you can throw a dart at a map and find a job where it lands.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a linguistics degree and then get a job teaching ESL. The fact that it has not been mentioned in this thread is mind-boggling. Linguistics is the default degree for teaching ESL (and it is the default reason for getting a linguistics degree) and ESL is non-competitive because it is in demand literally everywhere on the globe and there are not enough teachers to go around. Depending where you work this will give you ample amounts of time to study the things you want. If you are in a metropolitan American city and you don&amp;#39;t want to leave then yeah it is going to be difficult; but if the world is opened to you then you can throw a dart at a map and find a job where it lands.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg8whmn", "score_hidden": false, "stickied": false, "created": 1492184444.0, "created_utc": 1492155644.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg69d83", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "h2g2Ben", "parent_id": "t1_dg68b0s", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Yeah, I'm going to say that computational linguistics would be the exception to /u/millionsofcats doom-saying. \n\nYou'd probably be a little safer switching those around, Degree in CS, minor in linguistics, but if you can actually code and problem solve, and have the linguistics background, a minor may be OK. Really depends on the employer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I&amp;#39;m going to say that computational linguistics would be the exception to &lt;a href=\"/u/millionsofcats\"&gt;/u/millionsofcats&lt;/a&gt; doom-saying. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;d probably be a little safer switching those around, Degree in CS, minor in linguistics, but if you can actually code and problem solve, and have the linguistics background, a minor may be OK. Really depends on the employer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg69d83", "score_hidden": false, "stickied": false, "created": 1492048691.0, "created_utc": 1492019891.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68b0s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "papichuloooo", "parent_id": "t1_dg67ss7", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Yes, that's kind of what I'm going for! I want a career that entails both technology and language. I'm just really intimidated by the combined major my university offers and I'm wondering if I can still get a tech job with only a linguistics degree. Does a CS minor give any boosts? \n\nI'm worried about not making it because CS is extremely competitive at my school and it's difficult to transfer majors. So I'm hoping my backup plan of majoring in Ling and minoring in CS would be of any help to the career search. \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, that&amp;#39;s kind of what I&amp;#39;m going for! I want a career that entails both technology and language. I&amp;#39;m just really intimidated by the combined major my university offers and I&amp;#39;m wondering if I can still get a tech job with only a linguistics degree. Does a CS minor give any boosts? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m worried about not making it because CS is extremely competitive at my school and it&amp;#39;s difficult to transfer majors. So I&amp;#39;m hoping my backup plan of majoring in Ling and minoring in CS would be of any help to the career search. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg68b0s", "score_hidden": false, "stickied": false, "created": 1492047625.0, "created_utc": 1492018825.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67ss7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cubyblizzy88", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Have you looked into computational linguistics? It is definitely something you can pursue if you take classes in both linguistics and computer science. Furthermore there are tons of jobs asking for computational linguists. I am doing a master in computational linguistics and some of the students come from a linguistics background and some from C.S and AI.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you looked into computational linguistics? It is definitely something you can pursue if you take classes in both linguistics and computer science. Furthermore there are tons of jobs asking for computational linguists. I am doing a master in computational linguistics and some of the students come from a linguistics background and some from C.S and AI.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg67ss7", "score_hidden": false, "stickied": false, "created": 1492047113.0, "created_utc": 1492018313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6drv8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dom", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "What worries me is your comment that \"CS is extremely competitive\". Do you mean that you don't think you'll be able to pass all the classes in the CS major? In that case (and I'm going to be blunt here, like others are doing), what makes you think you'll be able to cut it in a tech job?\n\nThat said, there's a lot of shitty programmers out there. I once interviewed someone who had a CS degree and could barely answer any of my questions (I work as a programmer, despite having undergrad+graduate degrees in linguistics). Also, programming/\"software engineering\" is different from computer science, so it's conceivable that you'll bomb your algorithms class but still be a decent programmer. What actually matters is not so much your degree, but your experience. So regardless of your major, you could get a job in tech, but without a CS degree it's even more important that you land a good internship or two before you graduate.\n\nIf you're aiming to work in \"computational linguistics\", be aware that (despite the name) most computational stuff is heavy on the computation and light on the linguistics. Basically if you ask someone who works on NLP what a word is, they'll tell you it's what you get when you break up a string by spaces (unless it's one of those pesky languages like Chinese that don't have spaces, in which case you have to tokenize that shit). So again if you're going to work in that field you'll still want your background to be mainly in CS (and in this case it's even more important that you understand algorithms and statistical AI, etc. etc.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What worries me is your comment that &amp;quot;CS is extremely competitive&amp;quot;. Do you mean that you don&amp;#39;t think you&amp;#39;ll be able to pass all the classes in the CS major? In that case (and I&amp;#39;m going to be blunt here, like others are doing), what makes you think you&amp;#39;ll be able to cut it in a tech job?&lt;/p&gt;\n\n&lt;p&gt;That said, there&amp;#39;s a lot of shitty programmers out there. I once interviewed someone who had a CS degree and could barely answer any of my questions (I work as a programmer, despite having undergrad+graduate degrees in linguistics). Also, programming/&amp;quot;software engineering&amp;quot; is different from computer science, so it&amp;#39;s conceivable that you&amp;#39;ll bomb your algorithms class but still be a decent programmer. What actually matters is not so much your degree, but your experience. So regardless of your major, you could get a job in tech, but without a CS degree it&amp;#39;s even more important that you land a good internship or two before you graduate.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re aiming to work in &amp;quot;computational linguistics&amp;quot;, be aware that (despite the name) most computational stuff is heavy on the computation and light on the linguistics. Basically if you ask someone who works on NLP what a word is, they&amp;#39;ll tell you it&amp;#39;s what you get when you break up a string by spaces (unless it&amp;#39;s one of those pesky languages like Chinese that don&amp;#39;t have spaces, in which case you have to tokenize that shit). So again if you&amp;#39;re going to work in that field you&amp;#39;ll still want your background to be mainly in CS (and in this case it&amp;#39;s even more important that you understand algorithms and statistical AI, etc. etc.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6drv8", "score_hidden": false, "stickied": false, "created": 1492053227.0, "created_utc": 1492024427.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6jd9t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "millionsofcats", "parent_id": "t1_dg6it49", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "If the OP doesn't think graduate school sounds appealing, they probably shouldn't go. I don't think they're looking for academic jobs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the OP doesn&amp;#39;t think graduate school sounds appealing, they probably shouldn&amp;#39;t go. I don&amp;#39;t think they&amp;#39;re looking for academic jobs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6jd9t", "score_hidden": false, "stickied": false, "created": 1492058995.0, "created_utc": 1492030195.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6it49", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WigglyHypersurface", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "One thing I feel should be pointed out is that if you want a job involving language and computers, there's a lot more out there than just linguistics or the private sector. Computational social science in general applies tools from computational linguistics quite often, and you can see papers in everything from psychology to political science leveraging computers and text to learn cool stuff. There's also the 'digital humanities' which although a bit muddled in name and purpose also often applies tools from CS to humanistic questions, often about texts. These are niche areas, but computational experience is often more valuable than content experience in the academic job market in this day and age. Learn stats, machine learning, and natural language processing and it can take you unexpected places! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing I feel should be pointed out is that if you want a job involving language and computers, there&amp;#39;s a lot more out there than just linguistics or the private sector. Computational social science in general applies tools from computational linguistics quite often, and you can see papers in everything from psychology to political science leveraging computers and text to learn cool stuff. There&amp;#39;s also the &amp;#39;digital humanities&amp;#39; which although a bit muddled in name and purpose also often applies tools from CS to humanistic questions, often about texts. These are niche areas, but computational experience is often more valuable than content experience in the academic job market in this day and age. Learn stats, machine learning, and natural language processing and it can take you unexpected places! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6it49", "score_hidden": false, "stickied": false, "created": 1492058404.0, "created_utc": 1492029604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6fjvo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cubyblizzy88", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "If you do happen to do a major in linguistics then I would recommend that you chose linguistics courses which are more beneficial in the field of computational linguistics. These include formal syntax, logic and formal semantics etc. I would definitely try to do a minor in CS if possible, but if that is not possible then get into programming yourself. As a computational linguist programming is essential, in fact a lot of CS stuff won't even be relevant. Most computational linguists work with CS methods, and are not doing research into the methods themselves but rather the application of those methods in language technology, for example I use neural networks to create language models and I know how and why they work, I do not however do research into neural nets themselves. Also a good book for beginners (and a good reference book in general) is speech and language processing by jurafsky and martin", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you do happen to do a major in linguistics then I would recommend that you chose linguistics courses which are more beneficial in the field of computational linguistics. These include formal syntax, logic and formal semantics etc. I would definitely try to do a minor in CS if possible, but if that is not possible then get into programming yourself. As a computational linguist programming is essential, in fact a lot of CS stuff won&amp;#39;t even be relevant. Most computational linguists work with CS methods, and are not doing research into the methods themselves but rather the application of those methods in language technology, for example I use neural networks to create language models and I know how and why they work, I do not however do research into neural nets themselves. Also a good book for beginners (and a good reference book in general) is speech and language processing by jurafsky and martin&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6fjvo", "score_hidden": false, "stickied": false, "created": 1492055057.0, "created_utc": 1492026257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6gg53", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rogue780", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "CS jobs aren't as competitive as you seem to think. The job pool is only going to get bigger", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;CS jobs aren&amp;#39;t as competitive as you seem to think. The job pool is only going to get bigger&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6gg53", "score_hidden": false, "stickied": false, "created": 1492055966.0, "created_utc": 1492027166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6jkmy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fogandafterimages", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "I doubled in Linguistics and Cognitive Science, with a lot of artificial intelligence and machine learning in there—not too different from Ling + Comp Sci. My first job out of school was a fraud analyst at Google; two of my coworkers (on a team of about 20) had also done Linguistics. After two and a half years of that, I became the data scientist for a small startup, which got bought by a big corp; I'm now a data scientist at a different, much larger startup.\n\nSo that's one path. But it's hard as heck to get a job as a DS with only a bachelors, you need lots of luck and good connections on top of the right skills and right experience, unfortunately.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I doubled in Linguistics and Cognitive Science, with a lot of artificial intelligence and machine learning in there—not too different from Ling + Comp Sci. My first job out of school was a fraud analyst at Google; two of my coworkers (on a team of about 20) had also done Linguistics. After two and a half years of that, I became the data scientist for a small startup, which got bought by a big corp; I&amp;#39;m now a data scientist at a different, much larger startup.&lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s one path. But it&amp;#39;s hard as heck to get a job as a DS with only a bachelors, you need lots of luck and good connections on top of the right skills and right experience, unfortunately.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6jkmy", "score_hidden": false, "stickied": false, "created": 1492059216.0, "created_utc": 1492030416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6jp4h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "redhedjim", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "I have a BA in linguistics and a CS job. Send me a message if you wanna talk details. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a BA in linguistics and a CS job. Send me a message if you wanna talk details. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6jp4h", "score_hidden": false, "stickied": false, "created": 1492059349.0, "created_utc": 1492030549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6syxd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OneMansModusPonens", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "There's some good advice in this thread so I'm not sure I can add much, but to this point: \n\n&gt;I don't have the money to go to grad school and to be honest it doesn't sound too appealing.\n\nIf it doesn't sound appealing to begin with then this won't matter, but PhD programs (at least in the US) are by and large fully funded. They'll pay your tuition and pay you a (small) salary too. There's opportunity cost sure, but it's not like med or law school where you're expected to take out loans! Again, I don't think that itself is enough to make grad school sound appealing, but it's something to keep in mind if you do end up falling in love with some aspect of the field and deciding you'd like to pursue a research career. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s some good advice in this thread so I&amp;#39;m not sure I can add much, but to this point: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t have the money to go to grad school and to be honest it doesn&amp;#39;t sound too appealing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If it doesn&amp;#39;t sound appealing to begin with then this won&amp;#39;t matter, but PhD programs (at least in the US) are by and large fully funded. They&amp;#39;ll pay your tuition and pay you a (small) salary too. There&amp;#39;s opportunity cost sure, but it&amp;#39;s not like med or law school where you&amp;#39;re expected to take out loans! Again, I don&amp;#39;t think that itself is enough to make grad school sound appealing, but it&amp;#39;s something to keep in mind if you do end up falling in love with some aspect of the field and deciding you&amp;#39;d like to pursue a research career. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6syxd", "score_hidden": false, "stickied": false, "created": 1492070623.0, "created_utc": 1492041823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg7zweh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WavesWashSands", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Can you do decision analytics/data science as your second major? If you're afraid of theoretical CS, you can go for this route, which is more like half-stats half-CS with some applied maths. If this is not available, you can always go for statistics if the statistics major offers programming and data mining courses.\n\nYou need basic knowledge of calc (up to Lagrange multiplers and triple integrals, but not line and surface integrals) for this, though you don't have to be very good at it because statisticians have invented a plenty of calc shortcuts. A strong background in basic linear algebra would be fairly important, though only with Euclidean space - you don't have to deal that much with general vector spaces.", "edited": 1492109073.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you do decision analytics/data science as your second major? If you&amp;#39;re afraid of theoretical CS, you can go for this route, which is more like half-stats half-CS with some applied maths. If this is not available, you can always go for statistics if the statistics major offers programming and data mining courses.&lt;/p&gt;\n\n&lt;p&gt;You need basic knowledge of calc (up to Lagrange multiplers and triple integrals, but not line and surface integrals) for this, though you don&amp;#39;t have to be very good at it because statisticians have invented a plenty of calc shortcuts. A strong background in basic linear algebra would be fairly important, though only with Euclidean space - you don&amp;#39;t have to deal that much with general vector spaces.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg7zweh", "score_hidden": false, "stickied": false, "created": 1492137258.0, "created_utc": 1492108458.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg8ly2j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tevin_", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "What about a job in Psycholinguistics? Would I need some sort of degree in psychology on the side or would grad school still be recommended?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about a job in Psycholinguistics? Would I need some sort of degree in psychology on the side or would grad school still be recommended?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg8ly2j", "score_hidden": false, "stickied": false, "created": 1492164705.0, "created_utc": 1492135905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg6qqvr", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "noduckposes", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Study a post graduate degree or diploma in applied linguistics.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Study a post graduate degree or diploma in applied linguistics.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6qqvr", "score_hidden": false, "stickied": false, "created": 1492067878.0, "created_utc": 1492039078.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_64ygu4", "likes": null, "replies": "", "user_reports": [], "id": "dg8a2vz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "k10_ftw", "parent_id": "t3_64ygu4", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Jobs in comp ling require a graduate degree, yes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jobs in comp ling require a graduate degree, yes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg8a2vz", "score_hidden": false, "stickied": false, "created": 1492148704.0, "created_utc": 1492119904.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]