[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "linguistics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This might be outside the strict scope of linguistics, as it&amp;#39;s a descriptive science; still, it seems the best place to ask. &lt;/p&gt;\n\n&lt;p&gt;As a monolingual, if I&amp;#39;d been told about code switching in the abstract without having seen it or being given examples, I would have assumed that it happens when one language doesn&amp;#39;t have the concept the other does, or when one word offers greater nuance. &lt;/p&gt;\n\n&lt;p&gt;But this generally isn&amp;#39;t how it works, both in my experience and in examples I&amp;#39;ve read. Code switching is usually all over the place and often substitutes one language for another when the concepts behind the words are identical. Basically just because. I don&amp;#39;t get it; what&amp;#39;s up with that? Seems to be reasonably common across languages, as far as I, a layman, have read.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This might be outside the strict scope of linguistics, as it's a descriptive science; still, it seems the best place to ask. \n\nAs a monolingual, if I'd been told about code switching in the abstract without having seen it or being given examples, I would have assumed that it happens when one language doesn't have the concept the other does, or when one word offers greater nuance. \n\nBut this generally isn't how it works, both in my experience and in examples I've read. Code switching is usually all over the place and often substitutes one language for another when the concepts behind the words are identical. Basically just because. I don't get it; what's up with that? Seems to be reasonably common across languages, as far as I, a layman, have read.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "651wu7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "dewarr", "saved": false, "mod_reports": [], "name": "t3_651wu7", "subreddit_name_prefixed": "r/linguistics", "approved_by": null, "over_18": false, "domain": "self.linguistics", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhos", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/linguistics/comments/651wu7/why_does_code_switching_happen_as_it_does/", "num_reports": null, "locked": false, "stickied": false, "created": 1492069105.0, "url": "https://www.reddit.com/r/linguistics/comments/651wu7/why_does_code_switching_happen_as_it_does/", "author_flair_text": null, "quarantine": false, "title": "Why does code switching happen as it does?", "created_utc": 1492040305.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": "", "user_reports": [], "id": "dg72sbi", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Choosing_is_a_sin", "parent_id": "t3_651wu7", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Code-switching is a logical consequence of human language production. Psycholinguists know that when our brains build trees (or whatever metaphor we want to use for language structure), we build multiple trees and access multiple words in our minds, even monolinguals, which allow us to exploit or resolve things like structural ambiguity or sound similarities. It should come as no surprise then that bilinguals have both their languages activated at the same time when they are speaking and listening, even in monolingual situations. In monolingual situations, proficient bilinguals -- at least, those who are accustomed to being in monolingual communities -- can successfully hold back the other language most of the time.\n\nHowever, oftentimes, people live in communities or families of bilinguals. In these situations, bilinguals do what monolinguals do, and exploit the full range of variation available to them in their situation. As such, people can use code-switching for rhetorical purposes. They may use a particular language to convey a level of officiousness or officiality of a certain statement in the conversation. They may switch to a certain language to mark a change in tone or in topic. They may switch to maintain a level of privacy. They may switch because a joke only makes sense in the other language or because a switch at the right moment provides a bilingual pun. They may switch to quote someone who spoke in another language or to tell a story about an event that happened in another language. In short (or maybe not), there are many social reasons for code-switching to happen the way it does.\n\nBut there are also linguistic factors at work. Code-switching is most certainly not random. The higher the level of structural integration, the lower the likelihood of a code-switch. For example, it's much less likely to see a switch inside a word than between words (a switch inside a word is so rare and so frequently ambiguous that some researchers deny that it even happens). It's also more common for a stretch of words to be code-switched if they form a constituent than if they don't (that is, looking at the last sentence, it's much more likely that *form a constituent* would be a switch into another language than *than if they*). And it's much more common for conjunctions, tag questions, interjections, and discourse markers (that is, things that stand outside or on the edge of clauses) to be code-switched than any other parts of the sentence. Verbs, which often have a greater impact on the structure of a sentence by determining how many arguments (required noun phrases) are needed and the form and order that they should take, are less likely to be code-switched than nouns, which have a bit less impact on the clause structure as a whole.\n\nBeyond that, people have different theories about how code-switched sentences are constrained. Some talk about a type of code-switching in which one language supplies most of the grammar and grammatical morphemes and the other supplies some words and, less commonly, whole constituents in the other language. Others talk about a model of code-switching in which bilingual discourse is only restricted by the types of things that would also make monolingual sentences ungrammatical ('feature checking'). Still others rely on surface patterns and saying that word order of the two languages usually has to line up.\n\nSo there are structural and linguistic factors that condition code-switching. As you can see, there's no real reason to expect that code-switching would be limited to situations where a word is not known in one language. Indeed, it's where the words are well-known in both that would lead to greater intensity of competition between the two forms and therefore, more likelihood of switching.\n\nEDIT: I'm not sure why you thought this was something that would not fall under the purview of language description. I'd be interested to hear why you thought it wasn't.", "edited": 1492055232.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Code-switching is a logical consequence of human language production. Psycholinguists know that when our brains build trees (or whatever metaphor we want to use for language structure), we build multiple trees and access multiple words in our minds, even monolinguals, which allow us to exploit or resolve things like structural ambiguity or sound similarities. It should come as no surprise then that bilinguals have both their languages activated at the same time when they are speaking and listening, even in monolingual situations. In monolingual situations, proficient bilinguals -- at least, those who are accustomed to being in monolingual communities -- can successfully hold back the other language most of the time.&lt;/p&gt;\n\n&lt;p&gt;However, oftentimes, people live in communities or families of bilinguals. In these situations, bilinguals do what monolinguals do, and exploit the full range of variation available to them in their situation. As such, people can use code-switching for rhetorical purposes. They may use a particular language to convey a level of officiousness or officiality of a certain statement in the conversation. They may switch to a certain language to mark a change in tone or in topic. They may switch to maintain a level of privacy. They may switch because a joke only makes sense in the other language or because a switch at the right moment provides a bilingual pun. They may switch to quote someone who spoke in another language or to tell a story about an event that happened in another language. In short (or maybe not), there are many social reasons for code-switching to happen the way it does.&lt;/p&gt;\n\n&lt;p&gt;But there are also linguistic factors at work. Code-switching is most certainly not random. The higher the level of structural integration, the lower the likelihood of a code-switch. For example, it&amp;#39;s much less likely to see a switch inside a word than between words (a switch inside a word is so rare and so frequently ambiguous that some researchers deny that it even happens). It&amp;#39;s also more common for a stretch of words to be code-switched if they form a constituent than if they don&amp;#39;t (that is, looking at the last sentence, it&amp;#39;s much more likely that &lt;em&gt;form a constituent&lt;/em&gt; would be a switch into another language than &lt;em&gt;than if they&lt;/em&gt;). And it&amp;#39;s much more common for conjunctions, tag questions, interjections, and discourse markers (that is, things that stand outside or on the edge of clauses) to be code-switched than any other parts of the sentence. Verbs, which often have a greater impact on the structure of a sentence by determining how many arguments (required noun phrases) are needed and the form and order that they should take, are less likely to be code-switched than nouns, which have a bit less impact on the clause structure as a whole.&lt;/p&gt;\n\n&lt;p&gt;Beyond that, people have different theories about how code-switched sentences are constrained. Some talk about a type of code-switching in which one language supplies most of the grammar and grammatical morphemes and the other supplies some words and, less commonly, whole constituents in the other language. Others talk about a model of code-switching in which bilingual discourse is only restricted by the types of things that would also make monolingual sentences ungrammatical (&amp;#39;feature checking&amp;#39;). Still others rely on surface patterns and saying that word order of the two languages usually has to line up.&lt;/p&gt;\n\n&lt;p&gt;So there are structural and linguistic factors that condition code-switching. As you can see, there&amp;#39;s no real reason to expect that code-switching would be limited to situations where a word is not known in one language. Indeed, it&amp;#39;s where the words are well-known in both that would lead to greater intensity of competition between the two forms and therefore, more likelihood of switching.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I&amp;#39;m not sure why you thought this was something that would not fall under the purview of language description. I&amp;#39;d be interested to hear why you thought it wasn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg72sbi", "score_hidden": false, "stickied": false, "created": 1492082950.0, "created_utc": 1492054150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": "", "user_reports": [], "id": "dg8vjx1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kissemjolk", "parent_id": "t1_dg8lrkc", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Hm, no, I don't think I have a good reference. It just came up while doing research on the topic a few years back. Now, I don't really remember where.\n\nThere is a trans speech therapist in Seattle who is widely regarded as perhaps the most experienced. (I've forgotten her name now.) But she has a book about trans voice work. Very technical, not for the actual trans person to learn from themselves though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hm, no, I don&amp;#39;t think I have a good reference. It just came up while doing research on the topic a few years back. Now, I don&amp;#39;t really remember where.&lt;/p&gt;\n\n&lt;p&gt;There is a trans speech therapist in Seattle who is widely regarded as perhaps the most experienced. (I&amp;#39;ve forgotten her name now.) But she has a book about trans voice work. Very technical, not for the actual trans person to learn from themselves though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg8vjx1", "score_hidden": false, "stickied": false, "created": 1492181861.0, "created_utc": 1492153061.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lrkc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tevin_", "parent_id": "t1_dg7s7vx", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "That's really interesting, do you have a reference or more to read on the trans perspective of that phenomenon?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s really interesting, do you have a reference or more to read on the trans perspective of that phenomenon?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg8lrkc", "score_hidden": false, "stickied": false, "created": 1492164445.0, "created_utc": 1492135645.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7s7vx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "kissemjolk", "parent_id": "t1_dg74sn5", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Indeed, often an entire topic will be better known in one language than the other, and the person will find it easier to just code-switch to talk about the topic.\n\nA common example for bilingual students growing up in New Mexico is that they are for more likely to talk about school in English and home in Spanish if given the ability to choose a language. Even though they do pretty much know the vocabulary for both topics in both languages, they still find it \"more comfortable\" to just fall into the \"rut\".\n\nI'd also kind of point to trans voice concerns. Trans people tend to fall back into a more familiar voice when talking about things like their childhood, and/or their profession, things that are strongly bound to before their transition. It's basically a kind of a completely unconscious mechanic... in a similar way, the code-switcher adopts the \"most comfortable/well-worn\" language for the particular topic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indeed, often an entire topic will be better known in one language than the other, and the person will find it easier to just code-switch to talk about the topic.&lt;/p&gt;\n\n&lt;p&gt;A common example for bilingual students growing up in New Mexico is that they are for more likely to talk about school in English and home in Spanish if given the ability to choose a language. Even though they do pretty much know the vocabulary for both topics in both languages, they still find it &amp;quot;more comfortable&amp;quot; to just fall into the &amp;quot;rut&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d also kind of point to trans voice concerns. Trans people tend to fall back into a more familiar voice when talking about things like their childhood, and/or their profession, things that are strongly bound to before their transition. It&amp;#39;s basically a kind of a completely unconscious mechanic... in a similar way, the code-switcher adopts the &amp;quot;most comfortable/well-worn&amp;quot; language for the particular topic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg7s7vx", "score_hidden": false, "stickied": false, "created": 1492129095.0, "created_utc": 1492100295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74sn5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Rocb11", "parent_id": "t3_651wu7", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Almeida Toribio has written a lot a number of articles on Spanish-English code switching in the US, particularly regarding which specifically which switches are likely to occur and why.\n\nAnyhow, one frequent use, as Choosing_as_a_sin alludes to, is to express things beyond lexical meaning.  Sometimes it does have to do with a concept being deemed \"clearer\" in one language, or maybe a word comes more naturally to a speaker, but more likely, it depends on other factors.  The audience, the mood or attitude being expressed, something related to personal identity or background, and many other things find expression through code switching.  Some might even enjoy the creativity and playfulness that code switching often requires.        ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Almeida Toribio has written a lot a number of articles on Spanish-English code switching in the US, particularly regarding which specifically which switches are likely to occur and why.&lt;/p&gt;\n\n&lt;p&gt;Anyhow, one frequent use, as Choosing_as_a_sin alludes to, is to express things beyond lexical meaning.  Sometimes it does have to do with a concept being deemed &amp;quot;clearer&amp;quot; in one language, or maybe a word comes more naturally to a speaker, but more likely, it depends on other factors.  The audience, the mood or attitude being expressed, something related to personal identity or background, and many other things find expression through code switching.  Some might even enjoy the creativity and playfulness that code switching often requires.        &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg74sn5", "score_hidden": false, "stickied": false, "created": 1492085943.0, "created_utc": 1492057143.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": "", "user_reports": [], "id": "dg7p36f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Torentsu", "parent_id": "t3_651wu7", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Its much the same as when you write a paper or speak in certain context you choose words that fit the situation.  Whether it be for register's sake,  to be polite or make a joke you choose a word that fits the situation. Consider the code switching person to just have a larger arsenal of words/structures to fire at the situation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its much the same as when you write a paper or speak in certain context you choose words that fit the situation.  Whether it be for register&amp;#39;s sake,  to be polite or make a joke you choose a word that fits the situation. Consider the code switching person to just have a larger arsenal of words/structures to fire at the situation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg7p36f", "score_hidden": false, "stickied": false, "created": 1492125762.0, "created_utc": 1492096962.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": "", "user_reports": [], "id": "dg9ifn1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The2StripedFox", "parent_id": "t3_651wu7", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "I assume, by code-switching, you mean mixing words from another language in a sentence. Take a look at Hong Kong, a place where people code-mix Cantonese (the vernacular language)^note1 with English all day long. Most Hongkongers take it for-granted, but as a linguistic student who has lived through such weirdness, I find it a discussion-worthy topic with other linguists, especially with the empirical factors. (For non-empirical factors see [the first comment](https://www.reddit.com/r/linguistics/comments/651wu7/why_does_code_switching_happen_as_it_does/dg72sbi/?utm_content=permalink&amp;utm_medium=front&amp;utm_source=reddit&amp;utm_name=linguistics).) \n\nOn an empirical view, code-mixing has given us many huge advantages; one of which is the syntactic flexibility and phonological flexibility it offers. Our language has 19 initial consonants (all voiceless except sonorants), 54 (+6) rimes and 6 tones, which don’t quite map with the English sound inventory; we corrupt the pronunciation and borrow the words anyway. Take a look at the following example and its pure-Cantonese equivalents:\n\n\n    * CALL (vt) [kɔ:˥] to phone someone\n    Derived from the English verb \"to call\", in the sense of calling someone on a phone call.\n    \n    遲    啲        CALL  返    你   呀\n    late  adv-COMP  call  back  you  FP_ASS\n    \"I'll call you back later.\" (6 syllables)\n    \n    Compare:\n\t\n    遲    啲        打    返   電話       俾        你   呀\n    late  adv-COMP  call  back telephone  ACC.PART  you  FP_ASS\n\t(9 syllables)\n\t\n    遲    啲        打-返-俾             你   呀\n    late  adv-COMP  hit-back-ACC.PART   you  FP_ASS\n\t(Abbreviated from the above; 7 syllables)\n\n\nAnother example:\n\n\n    hou2ci5  tung4  keoi5   DEBATE  gam,\n    seems    P      he/she  debate  PRT\n    'beibei' haa5 doul  mou5  sam1geil\n    debate   ASP  ADV   NEG   mood\n    (reduplication, phonologically assimilated)\n    \"It seems like I was debating with him.\n    I was in no mood to debate with him.\" (Chan, 1998)\n\n\nThe book chapter \"How Does Cantonese-English Code-Mixing Work?\" (see references) has an in-depth analysis on the code-mixing techniques used in Hong Kong Cantonese. As a native speaker, though, I say we code-mix instead of using the native words basically because of these reasons:\n\n* Some words are much clunky than their English counterparts... or at least what is left of the counterparts after serious corruption in pronunciation (and perhaps meaning).\n* We find prepositions and relative pronouns to be easy getaways with complicated sentence structures.\n\nClunkiness and sentence structures aside, there are sociolinguistic factors at work here. Hong Kong was a British colony; the city itself is considered bilingual, while in reality it is a disglossia: English is the high variety, while Cantonese is the low variety (sometimes both). English is taught in education, and dominates the realm of tertiary education. But since English is regarded as a tongue for the elites, professionals and the learned, most students are unable to use English proficiently, but are still able to use English to some extent, and understand code-mixed English words. Slipping English words and sentence structures in your daily speech is a way to show off (which doesn't remotely correlate with proficiency; also overdoing that shows arrogance), although this has been less so since more and more of the populace are taught English as part of their education. The populace being half-proficient at English is one of the reasons why code-mixing happens in Hong Kong.\n\nRecently there have been questions on the identity of Hongkongers (which is a political minefield that I dare not step into), and code-mixing has become something to identify ourselves with. Although English is the high variety in diglossic Hong Kong, nearly everything seen in public is bilingual; every Hongkonger grows up in contact with both Chinese and English, and taught both languages - such extensive degree of exposure to English, and the resulting intensive use of code-mixing, is what makes Hong Kong stand out from other regions: we don't speak like other Cantonese-speaking regions. In fact, if you encounter a Cantonese speaker speaking Cantonese with a great deal of English words popping out here and there, they are most certainly from Hong Kong. And that ultimately means code-mixing is something to identify ourselves and to be part of the local culture.\n\nIn all, we code-mix because we want to speak fluently; because we want to borrow their meaning; because we want to prove ourselves to be able to speak it; and - transcending all other reasons - because that's what make us Hongkongers.\n\t\n\nREFERENCE\nChan, B.H.S. (1998). How Does Cantonese-English Code-Mixing Work? In Pennington M. (Ed.), Language in Hong Kong at Century's End (pp. 191-216). Hong Kong University Press. Retrieved from http://www.jstor.org.eproxy1.lib.hku.hk/stable/j.ctt2jc7vf.11\nFleming, K. (2017). Language, diversity, and education. Lecture Notes: CCGL9024 The life and death of languages.  \n\n\t\nNote1: We are taught to write Standard Chinese, although infused with regional vocabulary in Hong Kong and syntax in Cantonese. We tend to write in a more literary style too. The situation on the vernacular being different from the writing is worth a thesis, and will drive this comment off-topic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I assume, by code-switching, you mean mixing words from another language in a sentence. Take a look at Hong Kong, a place where people code-mix Cantonese (the vernacular language)&lt;sup&gt;note1&lt;/sup&gt; with English all day long. Most Hongkongers take it for-granted, but as a linguistic student who has lived through such weirdness, I find it a discussion-worthy topic with other linguists, especially with the empirical factors. (For non-empirical factors see &lt;a href=\"https://www.reddit.com/r/linguistics/comments/651wu7/why_does_code_switching_happen_as_it_does/dg72sbi/?utm_content=permalink&amp;amp;utm_medium=front&amp;amp;utm_source=reddit&amp;amp;utm_name=linguistics\"&gt;the first comment&lt;/a&gt;.) &lt;/p&gt;\n\n&lt;p&gt;On an empirical view, code-mixing has given us many huge advantages; one of which is the syntactic flexibility and phonological flexibility it offers. Our language has 19 initial consonants (all voiceless except sonorants), 54 (+6) rimes and 6 tones, which don’t quite map with the English sound inventory; we corrupt the pronunciation and borrow the words anyway. Take a look at the following example and its pure-Cantonese equivalents:&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;* CALL (vt) [kɔ:˥] to phone someone\nDerived from the English verb &amp;quot;to call&amp;quot;, in the sense of calling someone on a phone call.\n\n遲    啲        CALL  返    你   呀\nlate  adv-COMP  call  back  you  FP_ASS\n&amp;quot;I&amp;#39;ll call you back later.&amp;quot; (6 syllables)\n\nCompare:\n\n遲    啲        打    返   電話       俾        你   呀\nlate  adv-COMP  call  back telephone  ACC.PART  you  FP_ASS\n(9 syllables)\n\n遲    啲        打-返-俾             你   呀\nlate  adv-COMP  hit-back-ACC.PART   you  FP_ASS\n(Abbreviated from the above; 7 syllables)\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Another example:&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;hou2ci5  tung4  keoi5   DEBATE  gam,\nseems    P      he/she  debate  PRT\n&amp;#39;beibei&amp;#39; haa5 doul  mou5  sam1geil\ndebate   ASP  ADV   NEG   mood\n(reduplication, phonologically assimilated)\n&amp;quot;It seems like I was debating with him.\nI was in no mood to debate with him.&amp;quot; (Chan, 1998)\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;The book chapter &amp;quot;How Does Cantonese-English Code-Mixing Work?&amp;quot; (see references) has an in-depth analysis on the code-mixing techniques used in Hong Kong Cantonese. As a native speaker, though, I say we code-mix instead of using the native words basically because of these reasons:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Some words are much clunky than their English counterparts... or at least what is left of the counterparts after serious corruption in pronunciation (and perhaps meaning).&lt;/li&gt;\n&lt;li&gt;We find prepositions and relative pronouns to be easy getaways with complicated sentence structures.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Clunkiness and sentence structures aside, there are sociolinguistic factors at work here. Hong Kong was a British colony; the city itself is considered bilingual, while in reality it is a disglossia: English is the high variety, while Cantonese is the low variety (sometimes both). English is taught in education, and dominates the realm of tertiary education. But since English is regarded as a tongue for the elites, professionals and the learned, most students are unable to use English proficiently, but are still able to use English to some extent, and understand code-mixed English words. Slipping English words and sentence structures in your daily speech is a way to show off (which doesn&amp;#39;t remotely correlate with proficiency; also overdoing that shows arrogance), although this has been less so since more and more of the populace are taught English as part of their education. The populace being half-proficient at English is one of the reasons why code-mixing happens in Hong Kong.&lt;/p&gt;\n\n&lt;p&gt;Recently there have been questions on the identity of Hongkongers (which is a political minefield that I dare not step into), and code-mixing has become something to identify ourselves with. Although English is the high variety in diglossic Hong Kong, nearly everything seen in public is bilingual; every Hongkonger grows up in contact with both Chinese and English, and taught both languages - such extensive degree of exposure to English, and the resulting intensive use of code-mixing, is what makes Hong Kong stand out from other regions: we don&amp;#39;t speak like other Cantonese-speaking regions. In fact, if you encounter a Cantonese speaker speaking Cantonese with a great deal of English words popping out here and there, they are most certainly from Hong Kong. And that ultimately means code-mixing is something to identify ourselves and to be part of the local culture.&lt;/p&gt;\n\n&lt;p&gt;In all, we code-mix because we want to speak fluently; because we want to borrow their meaning; because we want to prove ourselves to be able to speak it; and - transcending all other reasons - because that&amp;#39;s what make us Hongkongers.&lt;/p&gt;\n\n&lt;p&gt;REFERENCE\nChan, B.H.S. (1998). How Does Cantonese-English Code-Mixing Work? In Pennington M. (Ed.), Language in Hong Kong at Century&amp;#39;s End (pp. 191-216). Hong Kong University Press. Retrieved from &lt;a href=\"http://www.jstor.org.eproxy1.lib.hku.hk/stable/j.ctt2jc7vf.11\"&gt;http://www.jstor.org.eproxy1.lib.hku.hk/stable/j.ctt2jc7vf.11&lt;/a&gt;\nFleming, K. (2017). Language, diversity, and education. Lecture Notes: CCGL9024 The life and death of languages.  &lt;/p&gt;\n\n&lt;p&gt;Note1: We are taught to write Standard Chinese, although infused with regional vocabulary in Hong Kong and syntax in Cantonese. We tend to write in a more literary style too. The situation on the vernacular being different from the writing is worth a thesis, and will drive this comment off-topic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg9ifn1", "score_hidden": false, "stickied": false, "created": 1492222286.0, "created_utc": 1492193486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_651wu7", "likes": null, "replies": "", "user_reports": [], "id": "dg73giw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Choosing_is_a_sin", "parent_id": "t1_dg6vyux", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "Expressing disdain for language behavior is not acceptable in this subreddit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Expressing disdain for language behavior is not acceptable in this subreddit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg73giw", "score_hidden": false, "stickied": false, "created": 1492083935.0, "created_utc": 1492055135.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vyux", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_651wu7", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dg6vyux", "score_hidden": false, "stickied": false, "created": 1492074238.0, "created_utc": 1492045438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]