[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "linguistics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This might be kind of a strange question but I&amp;#39;m curious. I&amp;#39;m bilingual, my native language is English but I did all of my schooling in French-immersion (Canadian). I&amp;#39;m also in the midst of learning Spanish.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also always been pretty good at pronouncing things as opposed to other people. I mean things like foreign names, places, and words in languages that aren&amp;#39;t French/English, or fantasy/made-up words &amp;amp; names. I can very often just look at the word &amp;amp; understand it&amp;#39;s proper pronunciation without being told. Obviously this doesn&amp;#39;t extend to EVERY single language/nationality or even word I read, but I find that I often have a much better pronunciation on the first try as opposed to other people. I can very frequently look at a word and just kind of &amp;quot;know&amp;quot; how it should be pronounced (most of the time anyway).&lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t mean to be all humble-braggy about this, I&amp;#39;m so sorry if it seems like that. But does learning a second language help a person recognize the proper pronunciation of other languages or words? Or is it a natural talent? I kind of feel like since French has such a different way of pronouncing things as opposed to English, it&amp;#39;s sort of become a learned habit of mine to more closely judge how something should be pronounced. I&amp;#39;m really not sure, but as I&amp;#39;ve been thinking a lot about this lately I&amp;#39;m curious about input from people who actually know what they&amp;#39;re talking about. I&amp;#39;ve never studied language or linguistics so I don&amp;#39;t know how this stuff works.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This might be kind of a strange question but I'm curious. I'm bilingual, my native language is English but I did all of my schooling in French-immersion (Canadian). I'm also in the midst of learning Spanish.\n\n\n\n\n\nI've also always been pretty good at pronouncing things as opposed to other people. I mean things like foreign names, places, and words in languages that aren't French/English, or fantasy/made-up words &amp; names. I can very often just look at the word &amp; understand it's proper pronunciation without being told. Obviously this doesn't extend to EVERY single language/nationality or even word I read, but I find that I often have a much better pronunciation on the first try as opposed to other people. I can very frequently look at a word and just kind of \"know\" how it should be pronounced (most of the time anyway).\n\n\n\n\n\n\n\nI really don't mean to be all humble-braggy about this, I'm so sorry if it seems like that. But does learning a second language help a person recognize the proper pronunciation of other languages or words? Or is it a natural talent? I kind of feel like since French has such a different way of pronouncing things as opposed to English, it's sort of become a learned habit of mine to more closely judge how something should be pronounced. I'm really not sure, but as I've been thinking a lot about this lately I'm curious about input from people who actually know what they're talking about. I've never studied language or linguistics so I don't know how this stuff works.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xy88", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "halfling_queen", "saved": false, "mod_reports": [], "name": "t3_65xy88", "subreddit_name_prefixed": "r/linguistics", "approved_by": null, "over_18": false, "domain": "self.linguistics", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhos", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/linguistics/comments/65xy88/what_makes_someone_particularly_good_at/", "num_reports": null, "locked": false, "stickied": false, "created": 1492487999.0, "url": "https://www.reddit.com/r/linguistics/comments/65xy88/what_makes_someone_particularly_good_at/", "author_flair_text": null, "quarantine": false, "title": "What makes someone particularly good at pronouncing things without practice?", "created_utc": 1492459199.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_65xy88", "likes": null, "replies": "", "user_reports": [], "id": "dge9fbo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "67TacoShells", "parent_id": "t3_65xy88", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "I think it might be something to do with the fact that you're billingual. I'm sort-of billingual and since my family is a bunch of immigrants I grew up with a lot of different accents around me; Highland Scottish, Irish, Japanese, New zealand, etc. I think it might be that we grew up with a lot of different phonemes and had to learn how to diffrientiate them? Like you though, I'm no expert in linguistics.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it might be something to do with the fact that you&amp;#39;re billingual. I&amp;#39;m sort-of billingual and since my family is a bunch of immigrants I grew up with a lot of different accents around me; Highland Scottish, Irish, Japanese, New zealand, etc. I think it might be that we grew up with a lot of different phonemes and had to learn how to diffrientiate them? Like you though, I&amp;#39;m no expert in linguistics.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dge9fbo", "score_hidden": false, "stickied": false, "created": 1492498202.0, "created_utc": 1492469402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_65xy88", "likes": null, "replies": "", "user_reports": [], "id": "dgew3pf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nerian99", "parent_id": "t3_65xy88", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": "I've always had a facility for it beyond the average person around me. I think some people have this talent, but I'm not exactly sure why. It's likely not environmental. I was raised monolingual English in Australia. Yet I always had an ability to imitate English accents better and I think this transfered to picking up foreign language accents. I taught myself French with a much more authentic accent than most L2 speakers I have encountered. (Also not bragging, just a fact. I have been asked if I had French parents by natives, etc.) I also seem to actually HEAR the difference amongst phonemes and can usually transfer it into my mouth without too much practice. Still, there have been sounds I have never been able to get. Such as 'ü' in German. I think there's an innate talent to it, and it helps if you are young. The ability to pick up a native accent fades quickly after puberty. The deep 'why' is another question and I'm not sure. I enhanced my abilities by learning phonetics. It took me to the next level.", "edited": 1492506227.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always had a facility for it beyond the average person around me. I think some people have this talent, but I&amp;#39;m not exactly sure why. It&amp;#39;s likely not environmental. I was raised monolingual English in Australia. Yet I always had an ability to imitate English accents better and I think this transfered to picking up foreign language accents. I taught myself French with a much more authentic accent than most L2 speakers I have encountered. (Also not bragging, just a fact. I have been asked if I had French parents by natives, etc.) I also seem to actually HEAR the difference amongst phonemes and can usually transfer it into my mouth without too much practice. Still, there have been sounds I have never been able to get. Such as &amp;#39;ü&amp;#39; in German. I think there&amp;#39;s an innate talent to it, and it helps if you are young. The ability to pick up a native accent fades quickly after puberty. The deep &amp;#39;why&amp;#39; is another question and I&amp;#39;m not sure. I enhanced my abilities by learning phonetics. It took me to the next level.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dgew3pf", "score_hidden": false, "stickied": false, "created": 1492534721.0, "created_utc": 1492505921.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]