[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "linguistics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(Also asked this over at &lt;a href=\"/r/compling\"&gt;/r/compling&lt;/a&gt;) \nHey guys, I&amp;#39;m a high school senior currently stressing out over colleges, as I have a few choices of schools to think about before May 1st rolls around, and within each school, different combinations of majors to consider. I&amp;#39;m interested in NLP, machine learning, and artificial intelligence, and am interested in working in those fields in the future after going to grad school for CompLing.\nNortheastern University is one of my top choices for college, and I&amp;#39;m intrigued by their Linguistics/Computer Science combined major. Does anyone here familiar with combined majors know if such a program would be adequate enough to get me into grad school for CompLing? Or should I pursue a double major (or major/minor combination) instead?\nAs for the other schools of consideration, UCSD and UCSB are my other choices. I was wondering if anyone familiar with these schools had any advice on which I should pick to go to for my undergrad, if my end-goal is to end up in grad school for CompLing and pursue a job in any of the fields I mentioned above. One of my main concerns and one of the reasons I&amp;#39;m leaning towards Northeastern at the moment is that I was admitted into UCSD for Linguistics, and I&amp;#39;ve heard it&amp;#39;s almost impossible to take CS courses if you weren&amp;#39;t directly admitted into the program. But I know next to nothing about Northeastern&amp;#39;s CS/Ling program besides the description they have on their website, so I feel that I need more context before I make a decision.\nI realize this is a pretty question-heavy post, so if you could answer any one of my inquiries, that would be more than welcome. Thanks in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(Also asked this over at /r/compling) \nHey guys, I'm a high school senior currently stressing out over colleges, as I have a few choices of schools to think about before May 1st rolls around, and within each school, different combinations of majors to consider. I'm interested in NLP, machine learning, and artificial intelligence, and am interested in working in those fields in the future after going to grad school for CompLing.\nNortheastern University is one of my top choices for college, and I'm intrigued by their Linguistics/Computer Science combined major. Does anyone here familiar with combined majors know if such a program would be adequate enough to get me into grad school for CompLing? Or should I pursue a double major (or major/minor combination) instead?\nAs for the other schools of consideration, UCSD and UCSB are my other choices. I was wondering if anyone familiar with these schools had any advice on which I should pick to go to for my undergrad, if my end-goal is to end up in grad school for CompLing and pursue a job in any of the fields I mentioned above. One of my main concerns and one of the reasons I'm leaning towards Northeastern at the moment is that I was admitted into UCSD for Linguistics, and I've heard it's almost impossible to take CS courses if you weren't directly admitted into the program. But I know next to nothing about Northeastern's CS/Ling program besides the description they have on their website, so I feel that I need more context before I make a decision.\nI realize this is a pretty question-heavy post, so if you could answer any one of my inquiries, that would be more than welcome. Thanks in advance!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "661633", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "Targokiin", "saved": false, "mod_reports": [], "name": "t3_661633", "subreddit_name_prefixed": "r/linguistics", "approved_by": null, "over_18": false, "domain": "self.linguistics", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhos", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/linguistics/comments/661633/what_should_i_do_in_my_undergrad_for_compling/", "num_reports": null, "locked": false, "stickied": false, "created": 1492525325.0, "url": "https://www.reddit.com/r/linguistics/comments/661633/what_should_i_do_in_my_undergrad_for_compling/", "author_flair_text": null, "quarantine": false, "title": "What should I do in my Undergrad for CompLing?", "created_utc": 1492496525.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhos", "removal_reason": null, "link_id": "t3_661633", "likes": null, "replies": "", "user_reports": [], "id": "dgevgwp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cubyblizzy88", "parent_id": "t3_661633", "subreddit_name_prefixed": "r/linguistics", "controversiality": 0, "body": " I am not from the US So I can't really reply directly to the college specific questions, however: I studied linguistics with no computer science and now am doing a Master of science in compling. I study in Germany (where is is free to study even for those from outside the EU) and there are a lot of students from the US doing a master in compling here (some from linguistics some from CS) So although it's a few years away for you, there is always that possibility for after! Of course it would be extremely advantageous to do some CS courses so if you get the chance do it! If you can't however then you should focus on formal linguistics and logic during your BA as these are critical for compling! \n\nAlso I should mention that those master degrees in Germany are in English and are very well regarded. My master for example allows us to work at the German research center for artificial intelligence (DFKI) and there is also the max Planck of informatics where we can also take classes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not from the US So I can&amp;#39;t really reply directly to the college specific questions, however: I studied linguistics with no computer science and now am doing a Master of science in compling. I study in Germany (where is is free to study even for those from outside the EU) and there are a lot of students from the US doing a master in compling here (some from linguistics some from CS) So although it&amp;#39;s a few years away for you, there is always that possibility for after! Of course it would be extremely advantageous to do some CS courses so if you get the chance do it! If you can&amp;#39;t however then you should focus on formal linguistics and logic during your BA as these are critical for compling! &lt;/p&gt;\n\n&lt;p&gt;Also I should mention that those master degrees in Germany are in English and are very well regarded. My master for example allows us to work at the German research center for artificial intelligence (DFKI) and there is also the max Planck of informatics where we can also take classes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "linguistics", "name": "t1_dgevgwp", "score_hidden": false, "stickied": false, "created": 1492532671.0, "created_utc": 1492503871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]