[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TalesFromRetail", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in a popular east coast grocery store as a cashier training to be &amp;quot;Customer Service Staff&amp;quot; where you can handle returns, lottery, etc. I&amp;#39;ve been working here for 3 years so I knew a lot before going into this promotion. We also have a program known as a &amp;quot;rain check&amp;quot; where you can get a certain deal on an item in case we&amp;#39;re sold out when the sale ends for up to 30 days. Typically, we end our sales Wednesday and the new one starts Thursday. However, this time the ad ends this Saturday as our stores close on Easter. It&amp;#39;s about 9:40 at night, close to closing. I&amp;#39;m manning the front when a woman asks for a rain check for a jar of gravy. I ask the typical questions &amp;quot;Did you ask someone to check the back, etc.?&amp;quot; and according to her, it wasn&amp;#39;t there so I filled out the slip and gave it to her. I also informed her beforehand that our ad lasts til Saturday so she has lots of time. She explains that she&amp;#39;s working and won&amp;#39;t have time to get it. No problem. I filled out the rain check and gave it to her.&lt;/p&gt;\n\n&lt;p&gt;About five minutes later, she comes around and asks for another rain check for a buy two, get two deal on Mr. Pib 12 packs. I inform her that we only issue rain checks once per household per day (I was told this long ago, before I started training. It&amp;#39;s not on the slip, but it&amp;#39;s policy). She was clearly annoyed but I sort of shrugged and said sorry. She started to leave when I blurted out &amp;quot;You can try tomorrow&amp;quot; (I forgot for that split second that she was too busy).&lt;/p&gt;\n\n&lt;p&gt;I soon realized that I made the biggest mistake in my three months of training. I even asked another rep after she left in the cash office what the policy was and she replied &amp;quot;One per household&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Not even 2 minutes go by and she&amp;#39;s accompanied by a big man in an electric cart. &amp;quot;Get me your manager!&amp;quot; he demands in an angry tone. I say no problem in an attempt to be lax and page the Asst. Store Mgr. While I&amp;#39;m helping a woman with her lotto tickets, the man is giving me this glare of death, never blinking. When I finish lotto, I say to him &amp;quot;Sir, I can give you a rain check, no problem&amp;quot; to which he quickly interrupts me, demanding to see a manager once again. He&amp;#39;s yelling violently at this point and my Mgr. quickly comes up. (Note: I&amp;#39;m trying to be as objective as possible. I don&amp;#39;t want this to be another &amp;quot;evil customer&amp;quot; blame game off the bat).&lt;/p&gt;\n\n&lt;p&gt;Out of nowhere, another customer around and yells at the big guy: &amp;quot;Why don&amp;#39;t you try being a little nicer?!&amp;quot; The guy just sits there and the other customer leaves not wanting to start anything. At this point, my manager is asking them what they wanted, asking the same questions I did about getting sale items. Meanwhile, the man is calling me out, saying I&amp;#39;m a horrible customer service rep., even pointing out that the sign says &amp;quot;Customer Service&amp;quot;, the whole nine yards. He also says that he&amp;#39;s been shopping at our company for 35 years and that it&amp;#39;s our fault for not stocking up enough product. It feels like forever. The woman says I dissed her off like she was nothing (Even though she went to leave but I digress).&lt;/p&gt;\n\n&lt;p&gt;Eventually, the manager goes to find some soda with the man, I write up a rain check for the Mr. Pib and give it to her. She doesn&amp;#39;t snatch it or anything. All the while, a regular customer (Sweet old lady) is watching the whole thing happening and just smiles like she usually does, telling me that people like that shouldn&amp;#39;t keep me down. I didn&amp;#39;t think much of the words then but now I&amp;#39;m starting to tear up a bit. At that point, I&amp;#39;m doing everything I can to keep calm. I&amp;#39;m a Taurus and it takes a lot to make me angry. And this man right here made me furious. I felt heat coming from my hands and face, red with anger, biting my tongue to stop myself from cursing out this entitled demon for wanting a rain check over FREAKING SODA.&lt;/p&gt;\n\n&lt;p&gt;The last time I see them was turning to see the man angrily glaring at me as he leaves. I shrug and finish up my duties as we close up the store.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m sitting here writing my story. I look back and think &amp;quot;I should&amp;#39;ve just given her the rain check&amp;quot;. I&amp;#39;ve never been in trouble yet and my main manager is giving me kudos nonstop. I think I&amp;#39;m afraid of messing up because there&amp;#39;s been some staff issues right now and I don&amp;#39;t want my good streak to end. But on the other side, obviously the man shouldn&amp;#39;t have reacted that way and just cursed me out for saying no to an extra slip of paper. He could&amp;#39;ve asked for a manager and gotten a rain check from him. There were other ways to approach it...but the roads still lead to me refusing that second rain check.&lt;/p&gt;\n\n&lt;p&gt;I need some advice/thoughts from other people. I&amp;#39;m pretty conflicted and would like some objective eyes so I can learn from this&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work in a popular east coast grocery store as a cashier training to be \"Customer Service Staff\" where you can handle returns, lottery, etc. I've been working here for 3 years so I knew a lot before going into this promotion. We also have a program known as a \"rain check\" where you can get a certain deal on an item in case we're sold out when the sale ends for up to 30 days. Typically, we end our sales Wednesday and the new one starts Thursday. However, this time the ad ends this Saturday as our stores close on Easter. It's about 9:40 at night, close to closing. I'm manning the front when a woman asks for a rain check for a jar of gravy. I ask the typical questions \"Did you ask someone to check the back, etc.?\" and according to her, it wasn't there so I filled out the slip and gave it to her. I also informed her beforehand that our ad lasts til Saturday so she has lots of time. She explains that she's working and won't have time to get it. No problem. I filled out the rain check and gave it to her.\n\nAbout five minutes later, she comes around and asks for another rain check for a buy two, get two deal on Mr. Pib 12 packs. I inform her that we only issue rain checks once per household per day (I was told this long ago, before I started training. It's not on the slip, but it's policy). She was clearly annoyed but I sort of shrugged and said sorry. She started to leave when I blurted out \"You can try tomorrow\" (I forgot for that split second that she was too busy).\n\nI soon realized that I made the biggest mistake in my three months of training. I even asked another rep after she left in the cash office what the policy was and she replied \"One per household\".\n\nNot even 2 minutes go by and she's accompanied by a big man in an electric cart. \"Get me your manager!\" he demands in an angry tone. I say no problem in an attempt to be lax and page the Asst. Store Mgr. While I'm helping a woman with her lotto tickets, the man is giving me this glare of death, never blinking. When I finish lotto, I say to him \"Sir, I can give you a rain check, no problem\" to which he quickly interrupts me, demanding to see a manager once again. He's yelling violently at this point and my Mgr. quickly comes up. (Note: I'm trying to be as objective as possible. I don't want this to be another \"evil customer\" blame game off the bat).\n\n Out of nowhere, another customer around and yells at the big guy: \"Why don't you try being a little nicer?!\" The guy just sits there and the other customer leaves not wanting to start anything. At this point, my manager is asking them what they wanted, asking the same questions I did about getting sale items. Meanwhile, the man is calling me out, saying I'm a horrible customer service rep., even pointing out that the sign says \"Customer Service\", the whole nine yards. He also says that he's been shopping at our company for 35 years and that it's our fault for not stocking up enough product. It feels like forever. The woman says I dissed her off like she was nothing (Even though she went to leave but I digress).\n\n Eventually, the manager goes to find some soda with the man, I write up a rain check for the Mr. Pib and give it to her. She doesn't snatch it or anything. All the while, a regular customer (Sweet old lady) is watching the whole thing happening and just smiles like she usually does, telling me that people like that shouldn't keep me down. I didn't think much of the words then but now I'm starting to tear up a bit. At that point, I'm doing everything I can to keep calm. I'm a Taurus and it takes a lot to make me angry. And this man right here made me furious. I felt heat coming from my hands and face, red with anger, biting my tongue to stop myself from cursing out this entitled demon for wanting a rain check over FREAKING SODA.\n\nThe last time I see them was turning to see the man angrily glaring at me as he leaves. I shrug and finish up my duties as we close up the store.\n\n Now I'm sitting here writing my story. I look back and think \"I should've just given her the rain check\". I've never been in trouble yet and my main manager is giving me kudos nonstop. I think I'm afraid of messing up because there's been some staff issues right now and I don't want my good streak to end. But on the other side, obviously the man shouldn't have reacted that way and just cursed me out for saying no to an extra slip of paper. He could've asked for a manager and gotten a rain check from him. There were other ways to approach it...but the roads still lead to me refusing that second rain check.\n\nI need some advice/thoughts from other people. I'm pretty conflicted and would like some objective eyes so I can learn from this", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653waw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 48, "report_reasons": null, "author": "SkyrinGans", "saved": false, "mod_reports": [], "name": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "approved_by": null, "over_18": false, "domain": "self.TalesFromRetail", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t2zt", "edited": 1492066012.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TalesFromRetail/comments/653waw/i_honestly_dont_know_how_to_handle_what_just/", "num_reports": null, "locked": false, "stickied": false, "created": 1492094622.0, "url": "https://www.reddit.com/r/TalesFromRetail/comments/653waw/i_honestly_dont_know_how_to_handle_what_just/", "author_flair_text": null, "quarantine": false, "title": "I honestly don't know how to handle what just happened...", "created_utc": 1492065822.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 48}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dg8hrqa", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "5HINY5HEEP", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "From what you've said, You were in the right.   No one has the right to abuse someone verbally because of a mistake.  The little old lady was telling the truth, sadly customers like her are rare.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what you&amp;#39;ve said, You were in the right.   No one has the right to abuse someone verbally because of a mistake.  The little old lady was telling the truth, sadly customers like her are rare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dg8hrqa", "score_hidden": false, "stickied": false, "created": 1492158938.0, "created_utc": 1492130138.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dg8usft", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Nunyabz7", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Literally no matter what you do sometimes, people will still act like that.\n\nHad you given another rain check (against your policy), they would've come up with something else to bitch about.\n\nIt sucks, but some people are just like that. I think they enjoy acting like that.\n\nBesides that, you don't need to risk losing your job by not following the policy, just so some rude people can save a buck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Literally no matter what you do sometimes, people will still act like that.&lt;/p&gt;\n\n&lt;p&gt;Had you given another rain check (against your policy), they would&amp;#39;ve come up with something else to bitch about.&lt;/p&gt;\n\n&lt;p&gt;It sucks, but some people are just like that. I think they enjoy acting like that.&lt;/p&gt;\n\n&lt;p&gt;Besides that, you don&amp;#39;t need to risk losing your job by not following the policy, just so some rude people can save a buck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dg8usft", "score_hidden": false, "stickied": false, "created": 1492179952.0, "created_utc": 1492151152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dg8ikl5", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "abgwin", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Welcome to retail. There's a lot to love about it (youve seen a little bit of that from the 'sweet old lady'; treasure them!) but there's a lot of crap, too. \nFor what it's worth, you did the right thing. Follow policy, get a manager when policy fails, and try not to take it personally when you're over-ruled. It will happen a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome to retail. There&amp;#39;s a lot to love about it (youve seen a little bit of that from the &amp;#39;sweet old lady&amp;#39;; treasure them!) but there&amp;#39;s a lot of crap, too. \nFor what it&amp;#39;s worth, you did the right thing. Follow policy, get a manager when policy fails, and try not to take it personally when you&amp;#39;re over-ruled. It will happen a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dg8ikl5", "score_hidden": false, "stickied": false, "created": 1492160023.0, "created_utc": 1492131223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dg8jfxd", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "EricKei", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I'd say you were in the right. When in doubt regarding a store policy -- or if a customer starts acting like that *at all* -- call a manager and remove yourself from the situation. Dealing with abusive people and deciding whether or not to break with policies (big or small) is THEIR job.\n\nThat, and try not to let the b-....er, turkeys get you down. Those two folks have to live with their miserable selves -- and worse -- each other -- 24/7. You only have to deal with them for a limited time. They're not worth stressing over.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say you were in the right. When in doubt regarding a store policy -- or if a customer starts acting like that &lt;em&gt;at all&lt;/em&gt; -- call a manager and remove yourself from the situation. Dealing with abusive people and deciding whether or not to break with policies (big or small) is THEIR job.&lt;/p&gt;\n\n&lt;p&gt;That, and try not to let the b-....er, turkeys get you down. Those two folks have to live with their miserable selves -- and worse -- each other -- 24/7. You only have to deal with them for a limited time. They&amp;#39;re not worth stressing over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dg8jfxd", "score_hidden": false, "stickied": false, "created": 1492161213.0, "created_utc": 1492132413.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dg8sl3h", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Finlanderboy", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Having worked customer service for over a decade I have learned some things.  It is estimated sociopaths make up around 4% of the population.  Lets round up to 5 for the jerks that act like them.  So 1 in 20 people would just as happily treat you like garbage if it made their day the tiniest bit better.  You see how many people a day?\n\nI call the unreasonable jerks 5 percenters, and move on with my day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having worked customer service for over a decade I have learned some things.  It is estimated sociopaths make up around 4% of the population.  Lets round up to 5 for the jerks that act like them.  So 1 in 20 people would just as happily treat you like garbage if it made their day the tiniest bit better.  You see how many people a day?&lt;/p&gt;\n\n&lt;p&gt;I call the unreasonable jerks 5 percenters, and move on with my day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dg8sl3h", "score_hidden": false, "stickied": false, "created": 1492175267.0, "created_utc": 1492146467.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dg8tcth", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kpark0", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "In my opinion, you did the right thing. I stick to the policy unless someone gets really upset about it, then I get a manager. I'm not in a position with the authority to deal with that, nor am I being paid enough to want to deal with that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my opinion, you did the right thing. I stick to the policy unless someone gets really upset about it, then I get a manager. I&amp;#39;m not in a position with the authority to deal with that, nor am I being paid enough to want to deal with that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dg8tcth", "score_hidden": false, "stickied": false, "created": 1492176773.0, "created_utc": 1492147973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dg8oob1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "raycamike", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Yeah eff those two, you handled it fine. Don't worry", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah eff those two, you handled it fine. Don&amp;#39;t worry&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dg8oob1", "score_hidden": false, "stickied": false, "created": 1492168675.0, "created_utc": 1492139875.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_653waw", "likes": null, "replies": "", "user_reports": [], "id": "dgbcx0x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BigHeroSix1993", "parent_id": "t3_653waw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "You did fine. They were in the wrong. Don't worry about it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You did fine. They were in the wrong. Don&amp;#39;t worry about it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbcx0x", "score_hidden": false, "stickied": false, "created": 1492328530.0, "created_utc": 1492299730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]