[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TalesFromRetail", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have another story, however this doesn&amp;#39;t come from the supermarket and instead from an ice cream parlour/cafe I worked at for over a year. This place did a simple selection of hot food/drinks and desserts, but the main attraction was the huge selection of fresh dairy ice cream that was made right on site. It was a family run working farm, really quaint looking, you could even go and see the cows as they waited to be milked. So you&amp;#39;d think it would be a nice, cute place to work. Oh no. As soon as the sun came out this place turned into hell on earth for the small team of staff that worked there. My story will reveal all:  &lt;/p&gt;\n\n&lt;p&gt;It was a day sometime in May I think, not the summer because I high-tailed it out of there before then, but still warm enough to justify grown men walking round with no tops on and everyone and their mums going out for an ice cream before the rain came back (here in the UK the sun has to only pop out for half an hour and suddenly everyone&amp;#39;s dressed like it&amp;#39;s Ibiza and stocking up on BBQ supplies). So as you can imagine the amount of customers at the ice cream parlour increased tenfold. The cafe was small, only 9 tables inside and then an add-on outdoor hut with 5 tables in it. Inside we had one till at the ice cream counter where you could order your ice cream, and another till adjacent where people could order their hot food/drinks etc. Both were clearly signed. It made more sense to have them split to make two more manageable queues rather than one long beast of a queue. It was also a pain on hot days if you just wanted a coffee to sit inside with and had to wait in a massive queue of people who wanted ice cream cones. Or vice versa on cold days and everyones queuing in the hot queue but your child just wants an ice cream, we could direct people to the right till and generally it cut waiting times and most people found the system easy.     &lt;/p&gt;\n\n&lt;p&gt;Most people. Not this family. On this hot day our ice cream queue was extending out of the cafe (not actually that far as it was a small cafe), but with two people serving the ice creams and using the ice cream till the wait wasn&amp;#39;t actually that unbearable considering the amount of people waiting. They were going as fast as they could, while I was serving people ordering hot food/drinks at my till parallel to them. It&amp;#39;s a system where you order and pay at the counter, then your food comes, so no waiting for a bill, and once you&amp;#39;ve paid and sat back down obviously if you want anything else you have to come back up to the counter. A concept many places use, nothing new. This family had been here a good couple of hours and had been a nightmare from the beginning. Re-arranging and then saving tables for a long time for people who were joining them and taking forever to arrive, meaning they couldn&amp;#39;t be used for people actually there ready and waiting. Once the other members arrived they made several attempts to get table service as &amp;#39;they were a large party&amp;#39;, which we politely explained several times we cannot do. They eventually ordered their food with me and went to sit back down, no problem. Their food came, they ate, and stuck around for a bit chatting after their meal.    &lt;/p&gt;\n\n&lt;p&gt;This is when the real problem came. The guy who placed their food order comes back up to my till, looks over at the ice creams available, then looks back to me. I will be &amp;#39;Me&amp;#39; and guy will be &amp;#39;G&amp;#39;:   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;G: &amp;quot;I&amp;#39;d like to order some ice creams, I&amp;#39;ll hav-&amp;quot;&lt;br/&gt;\nMe: &amp;quot;Oh I&amp;#39;m sorry, that&amp;#39;s the ice cream queue on that side. If you want to order ice creams please join that queue, it won&amp;#39;t be long.&amp;quot;&lt;br/&gt;\nG: &amp;quot;You mean I have to queue?&amp;quot;     &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;By this time a few of the people in the ice cream queue are frowning at this guy, obviously thinking &amp;#39;well, yes!&amp;#39;. There is also a queue forming behind him at my till.    &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: &amp;quot;Yes sir, however it won&amp;#39;t be long. Our staff are pretty quick at serving. You order over there and they will scoop up as you order.&amp;quot;&lt;br/&gt;\nG: &amp;quot;But I&amp;#39;ve already ordered food with you and paid for that. That should mean I don&amp;#39;t have to queue for ice cream. We&amp;#39;ll be eating them inside anyway.&amp;quot;&lt;br/&gt;\nMe: &amp;quot;No, sir. These people have been waiting patiently for these ice creams, I can&amp;#39;t cut you in front of them because you have already spent money with us. Many of these customers have spent money with us prior to their ice creams too, either today or on other days. Many will also be eating theirs inside too, and are waiting patiently. We will be happy to serve you, but you will have to queue like everyone else.&amp;quot;&lt;br/&gt;\nG: &amp;quot;No no but I have spent A LOT of money. You see. I want SUNDAES.&amp;quot;&lt;br/&gt;\nMe: &amp;quot;I&amp;#39;m sorry, the amount you spend doesn&amp;#39;t determine whether you queue or not as that isn&amp;#39;t fair. First come first served is fair. We make the sundaes at the ice cream counter to give to you straight away, like all the other ice creams. You will have to queue on that side. This side is for hot food and drinks, if you do not want anything from this side may I ask you to step to one side so I can continue to serve.&amp;quot;&lt;br/&gt;\nG: &amp;quot;But this is ridiculous. I don&amp;#39;t believe I have to queue!&amp;quot;     &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He throws a bit of a tantrum but goes to queue. He then decides that is beneath him and goes back to his family, ushering them out.  A couple from the ice cream queue thank me for not allowing him to cut in despite his tantrum.     &lt;/p&gt;\n\n&lt;p&gt;Although it was a victory on the day he left a complaint with the cafe owner, who caved after a lengthy argument with the man and offered him free sundaes to drop the matter. She said she would serve them herself so nobody else had to deal with him. It still annoys me that his tantrum worked out for him in the end, the disgusting giant man-baby.    &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have another story, however this doesn't come from the supermarket and instead from an ice cream parlour/cafe I worked at for over a year. This place did a simple selection of hot food/drinks and desserts, but the main attraction was the huge selection of fresh dairy ice cream that was made right on site. It was a family run working farm, really quaint looking, you could even go and see the cows as they waited to be milked. So you'd think it would be a nice, cute place to work. Oh no. As soon as the sun came out this place turned into hell on earth for the small team of staff that worked there. My story will reveal all:  \n\nIt was a day sometime in May I think, not the summer because I high-tailed it out of there before then, but still warm enough to justify grown men walking round with no tops on and everyone and their mums going out for an ice cream before the rain came back (here in the UK the sun has to only pop out for half an hour and suddenly everyone's dressed like it's Ibiza and stocking up on BBQ supplies). So as you can imagine the amount of customers at the ice cream parlour increased tenfold. The cafe was small, only 9 tables inside and then an add-on outdoor hut with 5 tables in it. Inside we had one till at the ice cream counter where you could order your ice cream, and another till adjacent where people could order their hot food/drinks etc. Both were clearly signed. It made more sense to have them split to make two more manageable queues rather than one long beast of a queue. It was also a pain on hot days if you just wanted a coffee to sit inside with and had to wait in a massive queue of people who wanted ice cream cones. Or vice versa on cold days and everyones queuing in the hot queue but your child just wants an ice cream, we could direct people to the right till and generally it cut waiting times and most people found the system easy.     \n \nMost people. Not this family. On this hot day our ice cream queue was extending out of the cafe (not actually that far as it was a small cafe), but with two people serving the ice creams and using the ice cream till the wait wasn't actually that unbearable considering the amount of people waiting. They were going as fast as they could, while I was serving people ordering hot food/drinks at my till parallel to them. It's a system where you order and pay at the counter, then your food comes, so no waiting for a bill, and once you've paid and sat back down obviously if you want anything else you have to come back up to the counter. A concept many places use, nothing new. This family had been here a good couple of hours and had been a nightmare from the beginning. Re-arranging and then saving tables for a long time for people who were joining them and taking forever to arrive, meaning they couldn't be used for people actually there ready and waiting. Once the other members arrived they made several attempts to get table service as 'they were a large party', which we politely explained several times we cannot do. They eventually ordered their food with me and went to sit back down, no problem. Their food came, they ate, and stuck around for a bit chatting after their meal.    \n\nThis is when the real problem came. The guy who placed their food order comes back up to my till, looks over at the ice creams available, then looks back to me. I will be 'Me' and guy will be 'G':   \n\n&gt; G: \"I'd like to order some ice creams, I'll hav-\"   \n&gt;Me: \"Oh I'm sorry, that's the ice cream queue on that side. If you want to order ice creams please join that queue, it won't be long.\"   \n&gt;G: \"You mean I have to queue?\"     \n\nBy this time a few of the people in the ice cream queue are frowning at this guy, obviously thinking 'well, yes!'. There is also a queue forming behind him at my till.    \n\n&gt;Me: \"Yes sir, however it won't be long. Our staff are pretty quick at serving. You order over there and they will scoop up as you order.\"    \n&gt;G: \"But I've already ordered food with you and paid for that. That should mean I don't have to queue for ice cream. We'll be eating them inside anyway.\"    \n&gt;Me: \"No, sir. These people have been waiting patiently for these ice creams, I can't cut you in front of them because you have already spent money with us. Many of these customers have spent money with us prior to their ice creams too, either today or on other days. Many will also be eating theirs inside too, and are waiting patiently. We will be happy to serve you, but you will have to queue like everyone else.\"      \n&gt;G: \"No no but I have spent A LOT of money. You see. I want SUNDAES.\"     \n&gt;Me: \"I'm sorry, the amount you spend doesn't determine whether you queue or not as that isn't fair. First come first served is fair. We make the sundaes at the ice cream counter to give to you straight away, like all the other ice creams. You will have to queue on that side. This side is for hot food and drinks, if you do not want anything from this side may I ask you to step to one side so I can continue to serve.\"        \n&gt;G: \"But this is ridiculous. I don't believe I have to queue!\"     \n\nHe throws a bit of a tantrum but goes to queue. He then decides that is beneath him and goes back to his family, ushering them out.  A couple from the ice cream queue thank me for not allowing him to cut in despite his tantrum.     \n\nAlthough it was a victory on the day he left a complaint with the cafe owner, who caved after a lengthy argument with the man and offered him free sundaes to drop the matter. She said she would serve them herself so nobody else had to deal with him. It still annoys me that his tantrum worked out for him in the end, the disgusting giant man-baby.    \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Medium", "id": "65k0uy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 130, "report_reasons": null, "author": "Zoologically", "saved": false, "mod_reports": [], "name": "t3_65k0uy", "subreddit_name_prefixed": "r/TalesFromRetail", "approved_by": null, "over_18": false, "domain": "self.TalesFromRetail", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t2zt", "edited": false, "link_flair_css_class": "medium", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TalesFromRetail/comments/65k0uy/why_should_i_queue/", "num_reports": null, "locked": false, "stickied": false, "created": 1492303371.0, "url": "https://www.reddit.com/r/TalesFromRetail/comments/65k0uy/why_should_i_queue/", "author_flair_text": null, "quarantine": false, "title": "Why should I queue?", "created_utc": 1492274571.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 130}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dgbkq4k", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "LokiKamiSama", "parent_id": "t1_dgb1l9o", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I know!  Throw a fit and get your way.  No.  It doesn't work on toddlers (with good parents) and shouldn't work with adults either.  If you give in, then you are being a bad parent.  I don't care who you are, how much money you spend or who your \"daddy\" is.  You are a person like everyone else.  You were born, and one day you will die, just like everyone else.  Suck it up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know!  Throw a fit and get your way.  No.  It doesn&amp;#39;t work on toddlers (with good parents) and shouldn&amp;#39;t work with adults either.  If you give in, then you are being a bad parent.  I don&amp;#39;t care who you are, how much money you spend or who your &amp;quot;daddy&amp;quot; is.  You are a person like everyone else.  You were born, and one day you will die, just like everyone else.  Suck it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbkq4k", "score_hidden": false, "stickied": false, "created": 1492339780.0, "created_utc": 1492310980.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1l9o", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "HoratioHorsefucker", "parent_id": "t3_65k0uy", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Pisses me off when people get rewarded for throwing tantrums because you were trying to treat them fairly.  Good thing you got out of there...I wouldn't be able to stand working for someone who enables that sort of behavior.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pisses me off when people get rewarded for throwing tantrums because you were trying to treat them fairly.  Good thing you got out of there...I wouldn&amp;#39;t be able to stand working for someone who enables that sort of behavior.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgb1l9o", "score_hidden": false, "stickied": false, "created": 1492312717.0, "created_utc": 1492283917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dgcekw0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reebeaster", "parent_id": "t1_dgc97cp", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": " No queuey, no ice creamy. Comprende?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No queuey, no ice creamy. Comprende?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgcekw0", "score_hidden": false, "stickied": false, "created": 1492397539.0, "created_utc": 1492368739.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc97cp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Rocknocker", "parent_id": "t3_65k0uy", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "&gt;G: \"But this is ridiculous. I don't believe I have to queue!\"\n\n\"Believe in a queue? Hell, man, look around. You can SEE the queue.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;G: &amp;quot;But this is ridiculous. I don&amp;#39;t believe I have to queue!&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;Believe in a queue? Hell, man, look around. You can SEE the queue.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgc97cp", "score_hidden": false, "stickied": false, "created": 1492390419.0, "created_utc": 1492361619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dgdk6i4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MistressLiliana", "parent_id": "t3_65k0uy", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "But... I thought Brits LIKED to queue! Isn't it your national pastime?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But... I thought Brits LIKED to queue! Isn&amp;#39;t it your national pastime?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdk6i4", "score_hidden": false, "stickied": false, "created": 1492468970.0, "created_utc": 1492440170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dgc4x3c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jennociide", "parent_id": "t1_dgbs4ca", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I'm not the OP, but yes that seems to be the case ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not the OP, but yes that seems to be the case &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgc4x3c", "score_hidden": false, "stickied": false, "created": 1492384649.0, "created_utc": 1492355849.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dgby1t9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "poopscooper34234", "parent_id": "t1_dgbs4ca", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I hope this is /s", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope this is /s&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgby1t9", "score_hidden": false, "stickied": false, "created": 1492371452.0, "created_utc": 1492342652.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbs4ca", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "CoveredinCatHairs", "parent_id": "t1_dgbnwq3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 1, "body": "Wait, so you have to go through two lines, and pay for two separate transactions?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait, so you have to go through two lines, and pay for two separate transactions?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbs4ca", "score_hidden": false, "stickied": false, "created": 1492353011.0, "created_utc": 1492324211.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnwq3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Jennociide", "parent_id": "t1_dgbjw6q", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "You pick a line first, and then choose the other line second ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You pick a line first, and then choose the other line second &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbnwq3", "score_hidden": false, "stickied": false, "created": 1492344715.0, "created_utc": 1492315915.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dgd56ph", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jsm553", "parent_id": "t1_dgbyff7", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "That seems kind of dumb 😐\n\nWhat of you wanted a combo?  Or what if you wanted a side salad instead of fries...salads are cold food", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That seems kind of dumb 😐&lt;/p&gt;\n\n&lt;p&gt;What of you wanted a combo?  Or what if you wanted a side salad instead of fries...salads are cold food&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgd56ph", "score_hidden": false, "stickied": false, "created": 1492434483.0, "created_utc": 1492405683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbyff7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mistress_Jedana", "parent_id": "t1_dgbjw6q", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "There was a DQ that was like that, where we lived almost 20 years ago.  It was an outdoor place, with 2 small walk up buildings (one for hot and the other for cold), no indoor seating  and it closed in the winter.  No sodas available at the hot side...you had to order your meal at the hot, then requeue to get your drink at the cold.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was a DQ that was like that, where we lived almost 20 years ago.  It was an outdoor place, with 2 small walk up buildings (one for hot and the other for cold), no indoor seating  and it closed in the winter.  No sodas available at the hot side...you had to order your meal at the hot, then requeue to get your drink at the cold.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbyff7", "score_hidden": false, "stickied": false, "created": 1492372518.0, "created_utc": 1492343718.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dgdbpy1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zoologically", "parent_id": "t1_dgbjw6q", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "When it was quiet, so most weekdays if it wasn't hot, we would do both through the hot food till, and whoever was on it would finish the transaction then go over and scoop the ice cream. But on days like this that backwards-and-forwards just didn't work, hence opening the ice cream till just for that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it was quiet, so most weekdays if it wasn&amp;#39;t hot, we would do both through the hot food till, and whoever was on it would finish the transaction then go over and scoop the ice cream. But on days like this that backwards-and-forwards just didn&amp;#39;t work, hence opening the ice cream till just for that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdbpy1", "score_hidden": false, "stickied": false, "created": 1492452061.0, "created_utc": 1492423261.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjw6q", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CoveredinCatHairs", "parent_id": "t3_65k0uy", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "What do you do if you want hot food and ice cream at the same time?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you do if you want hot food and ice cream at the same time?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbjw6q", "score_hidden": false, "stickied": false, "created": 1492338558.0, "created_utc": 1492309758.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k0uy", "likes": null, "replies": "", "user_reports": [], "id": "dge9paa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ahayzo", "parent_id": "t3_65k0uy", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I can't stand managers like that. You need to balance the result of the complaint with the accommodations you plan to give. If it's giving something small, fine it can be worth shutting up the idiot customer. Caving like this looks bad to every other customer who sees it happen, and is demoralizing to your employees, belittles your management capabilities, and overall is worth than kicking them out entirely.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t stand managers like that. You need to balance the result of the complaint with the accommodations you plan to give. If it&amp;#39;s giving something small, fine it can be worth shutting up the idiot customer. Caving like this looks bad to every other customer who sees it happen, and is demoralizing to your employees, belittles your management capabilities, and overall is worth than kicking them out entirely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge9paa", "score_hidden": false, "stickied": false, "created": 1492498567.0, "created_utc": 1492469767.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]