[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TalesFromRetail", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in charity shop in England for one of the area&amp;#39;s most well known animal shelters. My day started off with a bang when my manager called me whilst I was still in bed, telling me that a Wii game I had priced at £10.00 and put in our locked glass cabinet didn&amp;#39;t have the disk in it and the guy who brought it brought it back later that day. I said I must have forgotten to check it because I was too preoccupied with looking up a price and apologised, but it was on my mind all day. &lt;/p&gt;\n\n&lt;p&gt;While I was in the shop in the afternoon, I being the only volunteer on the shop floor while my manager was upstairs, I saw someone I know enter the shop while we were fairly busy. Me and the manager call him The Man with Two Hearts because he has spilt personalities. He&amp;#39;s always caused problems before as he always tries to get us to hold items for longer than we&amp;#39;re allowed to or get discounts for no reason. He even went crazy once, we think he&amp;#39;s either on drugs or didn&amp;#39;t take his medication that day, and threatened to suck the blood out of me and my coworkers, because apparently he&amp;#39;s a vampire. Needless to say, I&amp;#39;m put on edge by his mere appearance, but I had a feeling he was going to be a problem today. &lt;/p&gt;\n\n&lt;p&gt;Upon coming in he immediately squatted down to look at our men&amp;#39;s trousers section, picking out a pair of quite expensive looking ones and muttering something about &amp;#39;asking the guy&amp;#39;. He comes up to the till a moment later, I having been sorting out some jewellery stock in the hope that he would leave me alone, but he doesn&amp;#39;t. He said something about the trousers being a certain make, then asked if we could hold them until Wednesday and he&amp;#39;d pay for them then. In our shop we have a 24 hour hold rule, we can&amp;#39;t keep items aside for any longer. I told him this but he kept begging me, saying he&amp;#39;d pay more than twice the amount they are priced at if I do it for him. He even said that we&amp;#39;ve done it for him before, which I was quick to argue against because we&amp;#39;ve had the 24 hour rule in place for as long as I&amp;#39;ve worked there. I said the only thing I could do was go and get my manager, I knowing that she had had plenty of dealings with him in the past and would know to handle it. I called up and said &amp;#39;Man with two hearts, I need say no more&amp;#39;, so she came down and told him exactly what I had. He kept on pleading begging, at one point saying he would give her his hat for it, she responding with, &amp;#39;I don&amp;#39;t want your hat.&amp;#39; She continuously said he didn&amp;#39;t stick to his promise and come back for it last time so she wouldn&amp;#39;t do it again, but he kept on going and just wouldn&amp;#39;t give up. Eventually she said she&amp;#39;d hold it until 9:00am Wednesday on the dot before putting it back out, he accepting this and she starting to leave. When she reiterated the terms however, he said that she had said 4:30pm on Wednesday, when she had not. Even I said she hadn&amp;#39;t, despite thinking I should stay out of it. &lt;/p&gt;\n\n&lt;p&gt;Eventually he got this look in his eye, the same look he had when he threatened my co workers, and then left. Now since my manager is away on Wednesday I&amp;#39;ll have to put the trousers back out first thing in the morning, and deal with him alone if he comes in. My manager later said to just let him have what he wants next time, which made me quite angry. We shouldn&amp;#39;t make an exception just because he might hurt someone. If he threatens me or lashes out on wednesday, I&amp;#39;ll call the police without hesitation. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work in charity shop in England for one of the area's most well known animal shelters. My day started off with a bang when my manager called me whilst I was still in bed, telling me that a Wii game I had priced at £10.00 and put in our locked glass cabinet didn't have the disk in it and the guy who brought it brought it back later that day. I said I must have forgotten to check it because I was too preoccupied with looking up a price and apologised, but it was on my mind all day. \n\nWhile I was in the shop in the afternoon, I being the only volunteer on the shop floor while my manager was upstairs, I saw someone I know enter the shop while we were fairly busy. Me and the manager call him The Man with Two Hearts because he has spilt personalities. He's always caused problems before as he always tries to get us to hold items for longer than we're allowed to or get discounts for no reason. He even went crazy once, we think he's either on drugs or didn't take his medication that day, and threatened to suck the blood out of me and my coworkers, because apparently he's a vampire. Needless to say, I'm put on edge by his mere appearance, but I had a feeling he was going to be a problem today. \n\nUpon coming in he immediately squatted down to look at our men's trousers section, picking out a pair of quite expensive looking ones and muttering something about 'asking the guy'. He comes up to the till a moment later, I having been sorting out some jewellery stock in the hope that he would leave me alone, but he doesn't. He said something about the trousers being a certain make, then asked if we could hold them until Wednesday and he'd pay for them then. In our shop we have a 24 hour hold rule, we can't keep items aside for any longer. I told him this but he kept begging me, saying he'd pay more than twice the amount they are priced at if I do it for him. He even said that we've done it for him before, which I was quick to argue against because we've had the 24 hour rule in place for as long as I've worked there. I said the only thing I could do was go and get my manager, I knowing that she had had plenty of dealings with him in the past and would know to handle it. I called up and said 'Man with two hearts, I need say no more', so she came down and told him exactly what I had. He kept on pleading begging, at one point saying he would give her his hat for it, she responding with, 'I don't want your hat.' She continuously said he didn't stick to his promise and come back for it last time so she wouldn't do it again, but he kept on going and just wouldn't give up. Eventually she said she'd hold it until 9:00am Wednesday on the dot before putting it back out, he accepting this and she starting to leave. When she reiterated the terms however, he said that she had said 4:30pm on Wednesday, when she had not. Even I said she hadn't, despite thinking I should stay out of it. \n\nEventually he got this look in his eye, the same look he had when he threatened my co workers, and then left. Now since my manager is away on Wednesday I'll have to put the trousers back out first thing in the morning, and deal with him alone if he comes in. My manager later said to just let him have what he wants next time, which made me quite angry. We shouldn't make an exception just because he might hurt someone. If he threatens me or lashes out on wednesday, I'll call the police without hesitation. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "65k5y0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 66, "report_reasons": null, "author": "Halogod678", "saved": false, "mod_reports": [], "name": "t3_65k5y0", "subreddit_name_prefixed": "r/TalesFromRetail", "approved_by": null, "over_18": false, "domain": "self.TalesFromRetail", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t2zt", "edited": false, "link_flair_css_class": "long", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TalesFromRetail/comments/65k5y0/ill_give_you_my_hat_the_man_with_two_hearts/", "num_reports": null, "locked": false, "stickied": false, "created": 1492304892.0, "url": "https://www.reddit.com/r/TalesFromRetail/comments/65k5y0/ill_give_you_my_hat_the_man_with_two_hearts/", "author_flair_text": null, "quarantine": false, "title": "'I'll give you my hat!' - The man with two hearts.", "created_utc": 1492276092.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 66}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k5y0", "likes": null, "replies": "", "user_reports": [], "id": "dgaz4e1", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "ShadeFTW", "parent_id": "t3_65k5y0", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Be sure to instruct the police to equip wooden stakes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be sure to instruct the police to equip wooden stakes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgaz4e1", "score_hidden": false, "stickied": false, "created": 1492309379.0, "created_utc": 1492280579.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k5y0", "likes": null, "replies": "", "user_reports": [], "id": "dgazavk", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "MustNeedDogs", "parent_id": "t3_65k5y0", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "This guy seems like he probably is not in his right mind. Careful out there, op. Definitely definitely call the police if he escalates again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This guy seems like he probably is not in his right mind. Careful out there, op. Definitely definitely call the police if he escalates again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgazavk", "score_hidden": false, "stickied": false, "created": 1492309634.0, "created_utc": 1492280834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k5y0", "likes": null, "replies": "", "user_reports": [], "id": "dgbca62", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Skiz_0", "parent_id": "t3_65k5y0", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Might wanna go down to a police station or the non-emergency phone, just to say this guy is probably coming back and he's threatened you before, police might even send someone over or keep someone close to be sure", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Might wanna go down to a police station or the non-emergency phone, just to say this guy is probably coming back and he&amp;#39;s threatened you before, police might even send someone over or keep someone close to be sure&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbca62", "score_hidden": false, "stickied": false, "created": 1492327639.0, "created_utc": 1492298839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k5y0", "likes": null, "replies": "", "user_reports": [], "id": "dgb66yx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Belle_Corliss", "parent_id": "t3_65k5y0", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Make certain you have a crucifix, garlic &amp; a wooden stake on hand OP.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make certain you have a crucifix, garlic &amp;amp; a wooden stake on hand OP.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgb66yx", "score_hidden": false, "stickied": false, "created": 1492318973.0, "created_utc": 1492290173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k5y0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65k5y0", "likes": null, "replies": "", "user_reports": [], "id": "dgbvbdq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Halogod678", "parent_id": "t1_dgbuqcw", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Yeah he put it down on the counter when he said he'd give it to us", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah he put it down on the counter when he said he&amp;#39;d give it to us&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbvbdq", "score_hidden": false, "stickied": false, "created": 1492362293.0, "created_utc": 1492333493.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbuqcw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "raptor-kinna", "parent_id": "t3_65k5y0", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Was he even wearing a hat at the time?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was he even wearing a hat at the time?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgbuqcw", "score_hidden": false, "stickied": false, "created": 1492360357.0, "created_utc": 1492331557.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]