[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TalesFromRetail", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in a Furniture Store on the West Coast as a customer service rep/manager.&lt;/p&gt;\n\n&lt;p&gt;A good percentage of our clientele are originally from South of the border, so about 50% of my sales staff and my customer service office actually do speak Spanish. We try to keep at least a few of them working each shift, even in my office, but due to scheduling sometimes its not possible.&lt;/p&gt;\n\n&lt;p&gt;So on Saturday we are having our sale, it&amp;#39;s busy because we are closed on Easter Sunday (today). Wouldn&amp;#39;t ya know it but the two girls who do speak Spanish in my office both called off, my 3rd one had to leave midshift for a family emergency. I am left all alone working a busy store from about 5pm. Not only am I taking care of my sales staff, their customers, I  am also handling the numerous calls that are coming in from sales calls to people who are calling to see if we were open on Easter.&lt;/p&gt;\n\n&lt;p&gt;So I take a call from a lady who immediately demands to speak to some who can converse in Spanish (she asked this in perfect, slightly accented English, mind you). I apologize to her that I don&amp;#39;t have anyone available right now, that if she gives me a moment, I can check if one of my Spanish speaking sales staff can lend me a hand. I place her on hold and page for a Spanish speaker.&lt;/p&gt;\n\n&lt;p&gt;We are busy so no one comes, of course. I pick up the phone to advise her...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Lady: This is ridiculous!! I have been calling all week about a problem and you have no one that speaks Spanish. I&amp;#39;ve asked for a manager to call me back, but no one has. &lt;/p&gt;\n\n&lt;p&gt;Me: I apologize for that, but none of my managers even speak Spanish. &lt;/p&gt;\n\n&lt;p&gt;Lady: Then why do you have your commercials in Spanish on (name of Spanish programming chanel we have here)? That is false advertising!&lt;/p&gt;\n\n&lt;p&gt;Me: Because that is a Spanish language chanel. They don&amp;#39;t even put English commercials on that Chanel.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Soooo... Yes, she has been speaking to me this entire time in English. I finally get her to tell me her problem as there is no way I am pulling a Spanish speaking sales person off the floor on a busy Saturday (sales staff work on commission) for a customer service issue in which it seems she can full well converse in English.&lt;/p&gt;\n\n&lt;p&gt;The problem was with her father&amp;#39;s order. She states again that he&amp;#39;s been calling, demanding a Spanish speaking rep to help him. &lt;/p&gt;\n\n&lt;p&gt;I help as much as I can, but it seemed odd that this family keeps demanding a Spanish speaking rep, when they all seem to speak English perfectly. To make matters even more interesting, the entire sale was done by my Vietnamese salesperson who knows less Spanish than I do and barely has a handle on English as it is.&lt;/p&gt;\n\n&lt;p&gt;So she finally hangs up, still not happy as I really couldn&amp;#39;t help her at that time with her issue (due to the Holiday, the department I would need to contact would be closed until Monday).&lt;/p&gt;\n\n&lt;p&gt;Not an hour later, a family approaches me at the customer service desk and as soon as they hand me their invoice, I see that it&amp;#39;s the ones who had called earlier. Again they ask for someone to speak Spanish, but demands a manager.&lt;/p&gt;\n\n&lt;p&gt;The only manager I have available is my Vietnamese manager, but I explain the issue. She comes out and speaks with the family, all the while the WHOLE family is speaking English perfectly.&lt;/p&gt;\n\n&lt;p&gt;We were finally able to offer a resolution that made them happy and they left the store.&lt;/p&gt;\n\n&lt;p&gt;Why make a big deal about insisting on a Spanish speaker, complain that you can&amp;#39;t get one because you either called when one wasn&amp;#39;t avaialble or didnt just call our corporate customer service and they could have helped in Spanish, upset that we don&amp;#39;t even have a Spanish speaking manager, but y&amp;#39;all can speak and understand English fine?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work in a Furniture Store on the West Coast as a customer service rep/manager.\n\nA good percentage of our clientele are originally from South of the border, so about 50% of my sales staff and my customer service office actually do speak Spanish. We try to keep at least a few of them working each shift, even in my office, but due to scheduling sometimes its not possible.\n\nSo on Saturday we are having our sale, it's busy because we are closed on Easter Sunday (today). Wouldn't ya know it but the two girls who do speak Spanish in my office both called off, my 3rd one had to leave midshift for a family emergency. I am left all alone working a busy store from about 5pm. Not only am I taking care of my sales staff, their customers, I  am also handling the numerous calls that are coming in from sales calls to people who are calling to see if we were open on Easter.\n\nSo I take a call from a lady who immediately demands to speak to some who can converse in Spanish (she asked this in perfect, slightly accented English, mind you). I apologize to her that I don't have anyone available right now, that if she gives me a moment, I can check if one of my Spanish speaking sales staff can lend me a hand. I place her on hold and page for a Spanish speaker.\n\nWe are busy so no one comes, of course. I pick up the phone to advise her...\n\n&gt;Lady: This is ridiculous!! I have been calling all week about a problem and you have no one that speaks Spanish. I've asked for a manager to call me back, but no one has. \n\n&gt;Me: I apologize for that, but none of my managers even speak Spanish. \n\n&gt;Lady: Then why do you have your commercials in Spanish on (name of Spanish programming chanel we have here)? That is false advertising!\n\n&gt;Me: Because that is a Spanish language chanel. They don't even put English commercials on that Chanel.\n\nSoooo... Yes, she has been speaking to me this entire time in English. I finally get her to tell me her problem as there is no way I am pulling a Spanish speaking sales person off the floor on a busy Saturday (sales staff work on commission) for a customer service issue in which it seems she can full well converse in English.\n\nThe problem was with her father's order. She states again that he's been calling, demanding a Spanish speaking rep to help him. \n\nI help as much as I can, but it seemed odd that this family keeps demanding a Spanish speaking rep, when they all seem to speak English perfectly. To make matters even more interesting, the entire sale was done by my Vietnamese salesperson who knows less Spanish than I do and barely has a handle on English as it is.\n\nSo she finally hangs up, still not happy as I really couldn't help her at that time with her issue (due to the Holiday, the department I would need to contact would be closed until Monday).\n\nNot an hour later, a family approaches me at the customer service desk and as soon as they hand me their invoice, I see that it's the ones who had called earlier. Again they ask for someone to speak Spanish, but demands a manager.\n\nThe only manager I have available is my Vietnamese manager, but I explain the issue. She comes out and speaks with the family, all the while the WHOLE family is speaking English perfectly.\n\nWe were finally able to offer a resolution that made them happy and they left the store.\n\nWhy make a big deal about insisting on a Spanish speaker, complain that you can't get one because you either called when one wasn't avaialble or didnt just call our corporate customer service and they could have helped in Spanish, upset that we don't even have a Spanish speaking manager, but y'all can speak and understand English fine?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "65u0s3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 132, "report_reasons": null, "author": "Kara-El", "saved": false, "mod_reports": [], "name": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "approved_by": null, "over_18": false, "domain": "self.TalesFromRetail", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t2zt", "edited": false, "link_flair_css_class": "long", "author_flair_css_class": "standard", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TalesFromRetail/comments/65u0s3/horrible_company_that_you_have_no_spanish/", "num_reports": null, "locked": false, "stickied": false, "created": 1492439826.0, "url": "https://www.reddit.com/r/TalesFromRetail/comments/65u0s3/horrible_company_that_you_have_no_spanish/", "author_flair_text": "The customer is \"always\" right", "quarantine": false, "title": "Horrible company that you have no Spanish speakers available...", "created_utc": 1492411026.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 28, "visited": false, "subreddit_type": "public", "ups": 132}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdlyp5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Rocknocker", "parent_id": "t1_dgd8k6a", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "My career has enabled me to travel to some fairly remote and unusual places in the search for hydrocarbons and I've always liked linguistics (if 6 years of Latin and Greek in Jr. and Sr. High School says anything). Since I've lived abroad for most my adult life, I've learned (by total immersion) Russian, passable Ukrainian, oilfield Spanish (know more curses than verses), Esperanto, agonizing Mandarin, ASL, bits and bobs of Arabic, and working on West Greenlandic (Danish) for my next job. Along the way, I've picked up some Inuit, Chukchi, Navajo, Uzbek, Azeri, Tianshan, and various other far-flung verbiages. \n\nI currently sell cigars and booze in US Heartland (helping out a comrade retired from the hurlyburly of the Oil Patch) and frequently run into folks not wishing to communicate in English (although the vast majority are perfectly capable of doing so) and become irate when I do not immediately capitulate. \n\nSo, depending on how nasty I feel at the particular moment, I switch to one or another of  my backup lingos. \n\nAmazing how their perplexity and vexation rapidly turns into fluent 'Complainers English'.\n\nYá'át'ééh abíní, diné bizaadísh dinitsʼaʼ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My career has enabled me to travel to some fairly remote and unusual places in the search for hydrocarbons and I&amp;#39;ve always liked linguistics (if 6 years of Latin and Greek in Jr. and Sr. High School says anything). Since I&amp;#39;ve lived abroad for most my adult life, I&amp;#39;ve learned (by total immersion) Russian, passable Ukrainian, oilfield Spanish (know more curses than verses), Esperanto, agonizing Mandarin, ASL, bits and bobs of Arabic, and working on West Greenlandic (Danish) for my next job. Along the way, I&amp;#39;ve picked up some Inuit, Chukchi, Navajo, Uzbek, Azeri, Tianshan, and various other far-flung verbiages. &lt;/p&gt;\n\n&lt;p&gt;I currently sell cigars and booze in US Heartland (helping out a comrade retired from the hurlyburly of the Oil Patch) and frequently run into folks not wishing to communicate in English (although the vast majority are perfectly capable of doing so) and become irate when I do not immediately capitulate. &lt;/p&gt;\n\n&lt;p&gt;So, depending on how nasty I feel at the particular moment, I switch to one or another of  my backup lingos. &lt;/p&gt;\n\n&lt;p&gt;Amazing how their perplexity and vexation rapidly turns into fluent &amp;#39;Complainers English&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Yá&amp;#39;át&amp;#39;ééh abíní, diné bizaadísh dinitsʼaʼ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdlyp5", "score_hidden": false, "stickied": false, "created": 1492471192.0, "created_utc": 1492442392.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dge13nb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "songoku9001", "parent_id": "t1_dge07fq", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "That's why I said it is the majority language in US as there are an assortment of others and depending on where you may be 2nd or 3rd but good chance you'd find it being in like top 5 at least.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s why I said it is the majority language in US as there are an assortment of others and depending on where you may be 2nd or 3rd but good chance you&amp;#39;d find it being in like top 5 at least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge13nb", "score_hidden": false, "stickied": false, "created": 1492488221.0, "created_utc": 1492459421.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge07fq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PastaSocks", "parent_id": "t1_dgdo8ww", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Depends on where you go. Primarily (American) English, but in the South (Texas, Florida, Oklahoma, others, but I know first hand for these) there's a lot of Spanish. Also, parts of Illinois. Not sure why. I believe there's a decent concentration of Asian language speakers in Hawaii, but that's also not part of the main land, and I've never been there myself...\n\nEnglish is everywhere, but there are communities or cities that will have a high percentage of other ethnicities, so the amount of English varies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depends on where you go. Primarily (American) English, but in the South (Texas, Florida, Oklahoma, others, but I know first hand for these) there&amp;#39;s a lot of Spanish. Also, parts of Illinois. Not sure why. I believe there&amp;#39;s a decent concentration of Asian language speakers in Hawaii, but that&amp;#39;s also not part of the main land, and I&amp;#39;ve never been there myself...&lt;/p&gt;\n\n&lt;p&gt;English is everywhere, but there are communities or cities that will have a high percentage of other ethnicities, so the amount of English varies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge07fq", "score_hidden": false, "stickied": false, "created": 1492487213.0, "created_utc": 1492458413.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo8ww", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "songoku9001", "parent_id": "t1_dgd8k6a", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I know it wouldn't be official language like French for France, Spanish for Spain, etc, but always thought American English held majority share in spoken language throughout the US (in past few centuries or however old the US is)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it wouldn&amp;#39;t be official language like French for France, Spanish for Spain, etc, but always thought American English held majority share in spoken language throughout the US (in past few centuries or however old the US is)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdo8ww", "score_hidden": false, "stickied": false, "created": 1492473826.0, "created_utc": 1492445026.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdzswi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PastaSocks", "parent_id": "t1_dgd8k6a", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "As much as I am glad I never bothered to learn Spanish, living in the southern US, it's kind of a detriment. I know my numbers, only because I went to a private kindergarten and they taught us Spanish there, and it just stuck. I only speak English and a bit of Japanese, not cause I am Japanese at all, but because in 5th grade, I wanted to learn a \"lesser known\" language (absolutely motivated by being able to have conversations where no one else could understand me. Too many people knew Spanish, so nope.) so I started way back then. Now in Japanese IV in college, 0 regrets, but also 0 practicality. My Spanish speaking friends always tease me about it, but quite frankly, I love the Japanese language. \n\nIf only someone who primarily speaks Japanese would wander into the smaller grocery store in my small town in southern US... I'll feel so useful...\n\nThis did remind me of a story I'll try to post later though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As much as I am glad I never bothered to learn Spanish, living in the southern US, it&amp;#39;s kind of a detriment. I know my numbers, only because I went to a private kindergarten and they taught us Spanish there, and it just stuck. I only speak English and a bit of Japanese, not cause I am Japanese at all, but because in 5th grade, I wanted to learn a &amp;quot;lesser known&amp;quot; language (absolutely motivated by being able to have conversations where no one else could understand me. Too many people knew Spanish, so nope.) so I started way back then. Now in Japanese IV in college, 0 regrets, but also 0 practicality. My Spanish speaking friends always tease me about it, but quite frankly, I love the Japanese language. &lt;/p&gt;\n\n&lt;p&gt;If only someone who primarily speaks Japanese would wander into the smaller grocery store in my small town in southern US... I&amp;#39;ll feel so useful...&lt;/p&gt;\n\n&lt;p&gt;This did remind me of a story I&amp;#39;ll try to post later though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdzswi", "score_hidden": false, "stickied": false, "created": 1492486762.0, "created_utc": 1492457962.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8k6a", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Kara-El", "parent_id": "t1_dgd85i8", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "The old man spoke English to me and my manager just fine...\n\nI speak English (born and raised in the US!) and I can understand Japanese to a degree (I am half Japanese, my mother didn't speak it but could understand it, but my grandparents were Japanese and spoke the language fluently, yet they both spoke English as well). I can get by on some Spanish from the similar words used in French (took one semester of French in HS) and I am slowwwwwly picking up some from speaking with our customers, but do NOT ask me to speak it....I simply can't. \n\nIt just amazes me that most people don't have the courtesy here to even ask if I can speak it or ask if I have someone that does...\n\nThe amount of times I clearly pick up the phone and offer our store greeting in English, the caller will immediately start rattling off in Spanish without even asking if I speak it or to ask for someone who does is countless. If I am in your country, I will ask first if you speak English before I start off on a conversation. It's very rude to just assume that everyone automatically speaks the same language that you do when you are NOT in your home country. If I am in Russia, I am going to assume most speak Russian, not English.\n\nThis is why I hate the fact the US doesn't have an official language...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The old man spoke English to me and my manager just fine...&lt;/p&gt;\n\n&lt;p&gt;I speak English (born and raised in the US!) and I can understand Japanese to a degree (I am half Japanese, my mother didn&amp;#39;t speak it but could understand it, but my grandparents were Japanese and spoke the language fluently, yet they both spoke English as well). I can get by on some Spanish from the similar words used in French (took one semester of French in HS) and I am slowwwwwly picking up some from speaking with our customers, but do NOT ask me to speak it....I simply can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;It just amazes me that most people don&amp;#39;t have the courtesy here to even ask if I can speak it or ask if I have someone that does...&lt;/p&gt;\n\n&lt;p&gt;The amount of times I clearly pick up the phone and offer our store greeting in English, the caller will immediately start rattling off in Spanish without even asking if I speak it or to ask for someone who does is countless. If I am in your country, I will ask first if you speak English before I start off on a conversation. It&amp;#39;s very rude to just assume that everyone automatically speaks the same language that you do when you are NOT in your home country. If I am in Russia, I am going to assume most speak Russian, not English.&lt;/p&gt;\n\n&lt;p&gt;This is why I hate the fact the US doesn&amp;#39;t have an official language...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgd8k6a", "score_hidden": false, "stickied": false, "created": 1492441810.0, "created_utc": 1492413010.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdezs3", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "techiejames", "parent_id": "t1_dgd85i8", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I'm from the Mid-Atlantic part of the US. We get customers like this too. It's just a ruze to get freebies. \n\nIt doesn't work on the coworkers that speak both. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m from the Mid-Atlantic part of the US. We get customers like this too. It&amp;#39;s just a ruze to get freebies. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t work on the coworkers that speak both. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdezs3", "score_hidden": false, "stickied": false, "created": 1492460797.0, "created_utc": 1492431997.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd85i8", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "ZeroTwo3", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I don't, I can't, why? There is no logic to this! If you speak English AND Spanish, why can't you translate for your old man? WTF!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t, I can&amp;#39;t, why? There is no logic to this! If you speak English AND Spanish, why can&amp;#39;t you translate for your old man? WTF!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgd85i8", "score_hidden": false, "stickied": false, "created": 1492440903.0, "created_utc": 1492412103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdhyxy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jsm553", "parent_id": "t1_dgdfgy6", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I do this everyday\n\nI'm on day 40 or something ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do this everyday&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m on day 40 or something &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdhyxy", "score_hidden": false, "stickied": false, "created": 1492465904.0, "created_utc": 1492437104.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dge538g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zedman5000", "parent_id": "t1_dgdfgy6", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "You may have just indirectly taught me several languages. Shouldn't take too long to learn Spanish since I have a background in Latin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may have just indirectly taught me several languages. Shouldn&amp;#39;t take too long to learn Spanish since I have a background in Latin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge538g", "score_hidden": false, "stickied": false, "created": 1492492743.0, "created_utc": 1492463943.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfgy6", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "coinaday", "parent_id": "t1_dgd8t7v", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "&gt; I have countered with asking them if they would pay for the Rosetta Stone program so I may learn Spanish. Yeah, I wouldn't want to pay the $400 either, I'll stick to speaking English. Ive survived 40+ years using English, dont really need to change that for anyone.\n\nI don't disagree with you at all, but if you want to work on another language, I highly recommend Duolingo. It's free and I find it pretty fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have countered with asking them if they would pay for the Rosetta Stone program so I may learn Spanish. Yeah, I wouldn&amp;#39;t want to pay the $400 either, I&amp;#39;ll stick to speaking English. Ive survived 40+ years using English, dont really need to change that for anyone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t disagree with you at all, but if you want to work on another language, I highly recommend Duolingo. It&amp;#39;s free and I find it pretty fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdfgy6", "score_hidden": false, "stickied": false, "created": 1492461724.0, "created_utc": 1492432924.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdlyzu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "inibrius", "parent_id": "t1_dgd8t7v", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "If you're interested in another language, go to your local library and check out the Pimsleur method CD's.  Got me from 'I can order food' to 'I can fully function in a foreign country' in 6 months.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re interested in another language, go to your local library and check out the Pimsleur method CD&amp;#39;s.  Got me from &amp;#39;I can order food&amp;#39; to &amp;#39;I can fully function in a foreign country&amp;#39; in 6 months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdlyzu", "score_hidden": false, "stickied": false, "created": 1492471201.0, "created_utc": 1492442401.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8t7v", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Kara-El", "parent_id": "t1_dgd8inr", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I get that all the time. I have countered with asking them if they would pay for the Rosetta Stone program so I may learn Spanish. Yeah, I wouldn't want to pay the $400 either, I'll stick to speaking English. Ive survived 40+ years using English, dont really need to change that for anyone.\n\nI'm not being English-centric but I have never had the need to learn another language as part of my day to day livelihood. If that changes and I need to learn another language to survive, you betcha I will!\n\nIf I do move to Spain, you can bet your ass I will learn to speak Spanish. I won't expect anyone to cater to me just because I refuse to learn the local language. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get that all the time. I have countered with asking them if they would pay for the Rosetta Stone program so I may learn Spanish. Yeah, I wouldn&amp;#39;t want to pay the $400 either, I&amp;#39;ll stick to speaking English. Ive survived 40+ years using English, dont really need to change that for anyone.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not being English-centric but I have never had the need to learn another language as part of my day to day livelihood. If that changes and I need to learn another language to survive, you betcha I will!&lt;/p&gt;\n\n&lt;p&gt;If I do move to Spain, you can bet your ass I will learn to speak Spanish. I won&amp;#39;t expect anyone to cater to me just because I refuse to learn the local language. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgd8t7v", "score_hidden": false, "stickied": false, "created": 1492442456.0, "created_utc": 1492413656.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8inr", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "slow-shadow", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I had a lady (with a customer) at my auto parts job tell me I need to learn Spanish if I want to work in northern California.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a lady (with a customer) at my auto parts job tell me I need to learn Spanish if I want to work in northern California.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgd8inr", "score_hidden": false, "stickied": false, "created": 1492441722.0, "created_utc": 1492412922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdl0du", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Rocknocker", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "&gt;Lady: Then why do you have your commercials in Spanish on (name of Spanish programming chanel we have here)?\n\n\"Because if we do them in Latin, everyone would want to make tithes.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Lady: Then why do you have your commercials in Spanish on (name of Spanish programming chanel we have here)?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;Because if we do them in Latin, everyone would want to make tithes.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdl0du", "score_hidden": false, "stickied": false, "created": 1492470021.0, "created_utc": 1492441221.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgd90kp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tlsampl", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "They usually have someone who can speak both languages\n\nBut they still seem to need someone that can speak spanish\n\nI still do not understand why", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They usually have someone who can speak both languages&lt;/p&gt;\n\n&lt;p&gt;But they still seem to need someone that can speak spanish&lt;/p&gt;\n\n&lt;p&gt;I still do not understand why&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgd90kp", "score_hidden": false, "stickied": false, "created": 1492443034.0, "created_utc": 1492414234.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgeck1f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Demonsthense", "parent_id": "t1_dgeaj9i", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "If you're interested, there are actually a lot more than 2 varieties of 'Chinese'! Chinese itself refers to the written language. The spoken languages are classed by families based on their pronunciation and linguistic family tree, so ones that sound similar get grouped. \n\nMandarin, which actually has some sub-varieties itself, is the official language and the one used in schools. Standard Mandarin is based off of the Beijing dialect.\n\nThen Min is the next most popular one I've run into, with the most popular sub-variety being Taiwanese.\n\nThird most common was Wu, most notably Shanghainese.\n\nCantonese is in the Yue classification, and has a reputation of being the language of China in the US due to a large number of initial immigrants being from Cantonese areas. The sound of this language is also the source of the \"ching chong\" sound effect.\n\nThere are a few others, but nearly all of these people can also speak Mandarin anyway, since that's what they would have encountered in public school (unless they're really old or really rural).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re interested, there are actually a lot more than 2 varieties of &amp;#39;Chinese&amp;#39;! Chinese itself refers to the written language. The spoken languages are classed by families based on their pronunciation and linguistic family tree, so ones that sound similar get grouped. &lt;/p&gt;\n\n&lt;p&gt;Mandarin, which actually has some sub-varieties itself, is the official language and the one used in schools. Standard Mandarin is based off of the Beijing dialect.&lt;/p&gt;\n\n&lt;p&gt;Then Min is the next most popular one I&amp;#39;ve run into, with the most popular sub-variety being Taiwanese.&lt;/p&gt;\n\n&lt;p&gt;Third most common was Wu, most notably Shanghainese.&lt;/p&gt;\n\n&lt;p&gt;Cantonese is in the Yue classification, and has a reputation of being the language of China in the US due to a large number of initial immigrants being from Cantonese areas. The sound of this language is also the source of the &amp;quot;ching chong&amp;quot; sound effect.&lt;/p&gt;\n\n&lt;p&gt;There are a few others, but nearly all of these people can also speak Mandarin anyway, since that&amp;#39;s what they would have encountered in public school (unless they&amp;#39;re really old or really rural).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgeck1f", "score_hidden": false, "stickied": false, "created": 1492502264.0, "created_utc": 1492473464.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeaj9i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jonandre989", "parent_id": "t1_dgeaf6w", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "And yes, I know there are actually two languages spoken in China: Mandarin (the official language) and Cantonese (the language everyone speaks).  Don't know either.  Didn't know either back then.  Still had a family of Chinese immigrants sent to me so I could ask, in Japanese, if any of them understood English.\n\nAnd now that I think of it, I don't even remember that phrase, in Japanese.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And yes, I know there are actually two languages spoken in China: Mandarin (the official language) and Cantonese (the language everyone speaks).  Don&amp;#39;t know either.  Didn&amp;#39;t know either back then.  Still had a family of Chinese immigrants sent to me so I could ask, in Japanese, if any of them understood English.&lt;/p&gt;\n\n&lt;p&gt;And now that I think of it, I don&amp;#39;t even remember that phrase, in Japanese.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgeaj9i", "score_hidden": false, "stickied": false, "created": 1492499658.0, "created_utc": 1492470858.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgecae8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BelfortSchatzi", "parent_id": "t1_dgeaf6w", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Ach so! Mein Deutsch ist nicht die beste aber ich liebe die Spräche.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ach so! Mein Deutsch ist nicht die beste aber ich liebe die Spräche.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgecae8", "score_hidden": false, "stickied": false, "created": 1492501919.0, "created_utc": 1492473119.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeaf6w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Jonandre989", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Oh dear.  About two decades ago, I got a temporary position at a local furniture store (a huge sprawling complex that sold everything from office furniture to home electronics -- and even had a *subsidiary* that did consignment work).  On the job application, I decided to list down (under \"Special Skills\") the fact that I'd had three years of high school Japanese.\n\n***BIG mistake.***\n\nSuddenly every Asian customer that comes to the store is directed to me to deal with, directly.  Of Japanese, by the by, I know exactly three phrases (Yes, I took three years of that language, but due to the nature of the school, it was essentially the *same* year, repeated three times): a greeting, a farewell and how to ask where someone who speaks English might be.\n\nI do not know Vietnamese, Chinese (this is 1998, we don't even know what \"Ni Hao\" means), Korean or any other Asian language.\n\nWHY IS (was) THE STORE SENDING THESE PEOPLE TO SPEAK WITH ME???\n\nSo these customers got hugely irate thanks to the store's incompetence, and I got written up several times for being unable to help the customer (it was a temporary position for the summer and I had the funds I needed inside three weeks; after that I pretty much ignored complaints and just fucked off).\n\nThe **funny** part: At the end of the summer -- I actually lasted in that position three months -- HR wanted me to stay on, and tried offering me a promotion (to \"customer service specialist\") and a *bonus* for continuing my employment there.  Why?  Because *I knew Japanese*.\n\nFrom that point on, the fact that I knew a smattering of Japanese stayed off resumes and applications.  Hell, I understand more **German** than I remember of Japanese.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh dear.  About two decades ago, I got a temporary position at a local furniture store (a huge sprawling complex that sold everything from office furniture to home electronics -- and even had a &lt;em&gt;subsidiary&lt;/em&gt; that did consignment work).  On the job application, I decided to list down (under &amp;quot;Special Skills&amp;quot;) the fact that I&amp;#39;d had three years of high school Japanese.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;BIG mistake.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Suddenly every Asian customer that comes to the store is directed to me to deal with, directly.  Of Japanese, by the by, I know exactly three phrases (Yes, I took three years of that language, but due to the nature of the school, it was essentially the &lt;em&gt;same&lt;/em&gt; year, repeated three times): a greeting, a farewell and how to ask where someone who speaks English might be.&lt;/p&gt;\n\n&lt;p&gt;I do not know Vietnamese, Chinese (this is 1998, we don&amp;#39;t even know what &amp;quot;Ni Hao&amp;quot; means), Korean or any other Asian language.&lt;/p&gt;\n\n&lt;p&gt;WHY IS (was) THE STORE SENDING THESE PEOPLE TO SPEAK WITH ME???&lt;/p&gt;\n\n&lt;p&gt;So these customers got hugely irate thanks to the store&amp;#39;s incompetence, and I got written up several times for being unable to help the customer (it was a temporary position for the summer and I had the funds I needed inside three weeks; after that I pretty much ignored complaints and just fucked off).&lt;/p&gt;\n\n&lt;p&gt;The &lt;strong&gt;funny&lt;/strong&gt; part: At the end of the summer -- I actually lasted in that position three months -- HR wanted me to stay on, and tried offering me a promotion (to &amp;quot;customer service specialist&amp;quot;) and a &lt;em&gt;bonus&lt;/em&gt; for continuing my employment there.  Why?  Because &lt;em&gt;I knew Japanese&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;From that point on, the fact that I knew a smattering of Japanese stayed off resumes and applications.  Hell, I understand more &lt;strong&gt;German&lt;/strong&gt; than I remember of Japanese.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgeaf6w", "score_hidden": false, "stickied": false, "created": 1492499510.0, "created_utc": 1492470710.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdrptd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "7_t_7", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I sympathize, OP. I am in the southwest, and usually a family member does translate. My spanish is really bad, I can read it a little, but have no confidence in my pronunciation, and I can't process words at the same speed most spanish speakers talk.\n\nWe only have a couple spanish speakers in our area, and usually customers can muddle through with me. If I actually need a spanish speaker, I have to call another store, or sometimes even our other (literally on the border) district to find someone who can help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sympathize, OP. I am in the southwest, and usually a family member does translate. My spanish is really bad, I can read it a little, but have no confidence in my pronunciation, and I can&amp;#39;t process words at the same speed most spanish speakers talk.&lt;/p&gt;\n\n&lt;p&gt;We only have a couple spanish speakers in our area, and usually customers can muddle through with me. If I actually need a spanish speaker, I have to call another store, or sometimes even our other (literally on the border) district to find someone who can help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdrptd", "score_hidden": false, "stickied": false, "created": 1492477698.0, "created_utc": 1492448898.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdr7hn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Downtown_Emmet_Brown", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "You just need to laugh it off, cause it's not worth your emotional capital. I have had actually the opposite happen to me. I am bi-lingual and when I hear an accent I switch to my other language. It usually works and the customers are relieved to be able to speak with me in their first language. But I get those customers that have such a heavy accent I can hardly understand them and when I switch they refuse to switch as well, these customers are mostly older. I go back to English but it is a struggle to understand them and sometimes they get the nerve to get upset because I don't understand what they said. whatever...\n\nI do ask before I switch in my second language and it has happen to me were they spoke the language in front of me to another person and yet refused to do the same to me. haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You just need to laugh it off, cause it&amp;#39;s not worth your emotional capital. I have had actually the opposite happen to me. I am bi-lingual and when I hear an accent I switch to my other language. It usually works and the customers are relieved to be able to speak with me in their first language. But I get those customers that have such a heavy accent I can hardly understand them and when I switch they refuse to switch as well, these customers are mostly older. I go back to English but it is a struggle to understand them and sometimes they get the nerve to get upset because I don&amp;#39;t understand what they said. whatever...&lt;/p&gt;\n\n&lt;p&gt;I do ask before I switch in my second language and it has happen to me were they spoke the language in front of me to another person and yet refused to do the same to me. haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdr7hn", "score_hidden": false, "stickied": false, "created": 1492477130.0, "created_utc": 1492448330.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65u0s3", "likes": null, "replies": "", "user_reports": [], "id": "dgdsf1r", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Raw_Venus", "parent_id": "t1_dgdmybl", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I'm going to assume that OP knows more about the family emergency then (s)he told us. Plus OP never said they were Hispanic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to assume that OP knows more about the family emergency then (s)he told us. Plus OP never said they were Hispanic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdsf1r", "score_hidden": false, "stickied": false, "created": 1492478478.0, "created_utc": 1492449678.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmybl", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "aonbyte", "parent_id": "t3_65u0s3", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Well you know that 3rd one didn't have a family emergency. All of them just wanted Easter off to be with their family because of how big Easter is  a with hispanics. Fuck that lady. I hate when coworkers lie to call out. Just tell the truth.", "edited": 1492446805.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well you know that 3rd one didn&amp;#39;t have a family emergency. All of them just wanted Easter off to be with their family because of how big Easter is  a with hispanics. Fuck that lady. I hate when coworkers lie to call out. Just tell the truth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdmybl", "score_hidden": false, "stickied": false, "created": 1492472345.0, "created_utc": 1492443545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}]