[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TalesFromRetail", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey all you lurkers out there! Quick developing story here that I felt I should share. Honestly, I&amp;#39;m quite on the fence about whether or not our store is in the right or the customer is in the right ( I know, the customer is ALWAYS right... but just wait.)    &lt;/p&gt;\n\n&lt;p&gt;TLDR; Customer made a part order totaling $300, claims we shipped the wrong address. Is able to get the order from old address, but refuses to pick up order and wants a full refund without giving us the parts. TBC.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Backstory:&lt;/strong&gt; I&amp;#39;m a supervisor of a retail parts store. We sell parts for your appliances, lawn and garden, home equipment, etc. We also send items for repair and yadda yadda. It&amp;#39;s a relatively small store, so easy to keep track of everything.   &lt;/p&gt;\n\n&lt;p&gt;Last week (Monday), a customer (C) came into our store and needed to order parts for his lawn mower, totaling over $300. All items were to be shipped to his address within the week, all&amp;#39;s good.  &lt;/p&gt;\n\n&lt;p&gt;Now I don&amp;#39;t remember this customer, but my associate is the one who completed the order with him. At the beginning of every order, when we pull up the customer info, we verify the address. We verify again at the end of the order right before it&amp;#39;s submitted. We want to make sure the customer is getting their parts, obvi.  &lt;/p&gt;\n\n&lt;p&gt;On Thursday, I was working counter (ugh), and a call comes in from C.&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Hi, I&amp;#39;m [Customer] and I order parts on Monday, can you look up the order for me?&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Sure thing, (pulls up order), I see that you ordered several parts, shipping to [address]?&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Yup, that&amp;#39;s correct. I was just calling about your return policy? Turns out we won&amp;#39;t be needing the parts and we want to return them.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Yeah, sure thing. You can return all the parts right back here in store when you receive them and we&amp;#39;ll give you a refund to the original payment used. I&amp;#39;ll even comment on the order to refund your original shipping cost as well. (usually we don&amp;#39;t refund shipping, but it was a good day, no matter).&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Wonderful! I&amp;#39;ll be coming in with the parts when they arrive!     &lt;/p&gt;\n\n&lt;p&gt;C hangs up and I think  nothing of it.  &lt;/p&gt;\n\n&lt;p&gt;Then on Saturday, I&amp;#39;m working counter again at a busy time and a call comes in. Again, it&amp;#39;s C.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Parts Store, thank you for calling, this is AlyBambi, how may I help you?&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Yeah, is this Parts Store?&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - .... Yes? ( I literally just said that) What can I assist you with today?&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Well I made an order on Monday of this week and you guys shipped the parts to the wrong address!&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Ok, hold on here, lemme look up your order for you. (pulls up order) Yes, for Mr. C?&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Yes! I ordered over $300 worth of parts and they were shipped to the incorrect address!&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Okay, sir, sorry about the inconvien-&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - I want an immediate refund! The parts you shipped were to my old house that we literally moved out of last week! I went over there to pick up some things and half my order was there already! I picked up the blade I ordered but the other parts weren&amp;#39;t there yet.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Yeah, no problem sir, we can definitely do a refund for you, we just need the parts brought to our store and-&lt;br/&gt;\n[C&amp;#39;s wife comes on the phone, I didn&amp;#39;t realize I was on speaker]&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - WE&amp;#39;RE NOT BRINGING THE PARTS BACK TO YOU, WE WANT OUR REFUND NOW!&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Okay, I understand-&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - YOU DON&amp;#39;T UNDERSTAND, YOU SENT THE PARTS TO THE WRONG ADDRESS, IT&amp;#39;S YOUR FAULT! $300 ISN&amp;#39;T SOMETHING THAT&amp;#39;S EASY FOR US TO PAY! WE NEED OUR REFUND TODAY!&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Unfortunately ma&amp;#39;am, I would need the parts to do the refund...&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - What do you mean?! YOU sent them to the wrong address -&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - I understand that it was sent to the wrong address, but since you admitted to picking up the parts already, I can&amp;#39;t just refund you $300 without the parts that you have in my hands.&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - THIS IS RIDICULOUS, I&amp;#39;M NOT GOING BACK TO GET THE OTHER PARTS! THIS IS YOUR FAULT.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - I apologize, I can not approve a refund without the parts returned to us. It&amp;#39;s policy.&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - But you sent it to the wrong address!&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Yes, but you admitted to being able to pick up the parts, so what&amp;#39;s to stop you from getting the rest of the parts and then just getting a refund without returning them?&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - ... well, what if the people living there won&amp;#39;t give us the parts that we didn&amp;#39;t pick up?&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - The best I can do is refund the parts you do have.&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - THIS IS UNACCEPTABLE, I WANT TO SPEAK TO THE MANAGER!&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - I&amp;#39;m sorry, but I am the supervisor here at this location. My manager isn&amp;#39;t local, there is no one higher that you can speak to at the moment.&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - THEN WE WANT A PHONECALL.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - I can&amp;#39;t give out his phone but I can give you his email to -&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - DID I ASK FOR AN EMAIL?&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - I can guarantee you that he&amp;#39;s going to tell me to give you his email address instead of calling you... Why don&amp;#39;t I just speak with him and I&amp;#39;ll have an answer for you on Monday afternoon?&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - WE WANT TO SPEAK TO HIM.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Is this phone number listed on the order correct?&lt;br/&gt;\n&lt;strong&gt;W&lt;/strong&gt; - (finally calms down a second) Yes.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Okay, I will contact him and give you call on Monday. (Hangs up without any further comments)     &lt;/p&gt;\n\n&lt;p&gt;So, I emailed my manager, and he agrees that it&amp;#39;s fishy that they got half the parts but not the other half and says we do need all the parts for a refund. I have to call them and I can feel my blood thickening and my eye twitching at the thought of it. Part of me feels bad because it&amp;#39;s so much $$ but also we verify addresses twice and I even confirmed it when C called on Thursday. I wonder if C&amp;#39;s wife got angry at how much he spent and he&amp;#39;s blaming it on us? I dunno. Update to follow.&lt;/p&gt;\n\n&lt;p&gt;Edit: Formatting sucks.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Update 1:&lt;/strong&gt; Called C this morning and he wasn&amp;#39;t pleased, but remained calm. He asked that my manager call him in couple hours. I offered to give him manager&amp;#39;s email (again) and he says he doesn&amp;#39;t do email. He requested a call from Manager. I told him that I would pass on the info and to call me by tomorrow if he didn&amp;#39;t hear anything back. Luckily, wife wasn&amp;#39;t on phone.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Update 2:&lt;/strong&gt; Customer just called and started screaming at me that my manager hasn&amp;#39;t called yet. It has been almost exactly 2.5 hours. I was on a conference call for half of one of those hours, and know that my manager was on multiple other ones afterwards. He started yelling and then I heard wife in the background. I explained that my manager has other items that he&amp;#39;s scheduled to do but would be reaching out ASAP...&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - If you wait until tomorrow, you will be getting a call. He is aware of the situation but is very busy.&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Then I want HIS manager. I want a phone number.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - I&amp;#39;m not able to give out any phone information but I can give you an email address for both.&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - Okay, yeah that&amp;#39;s fine.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - (gives emails) Sorry about the inconvience, sir.&lt;br/&gt;\n&lt;strong&gt;C&lt;/strong&gt; - It&amp;#39;s not your fault, he should&amp;#39;ve called me by now! I will make to let them know that you did everything that could for me. Thank you for being so professional and patient, but I&amp;#39;m not. This will be going to your higher ups. But you won&amp;#39;t be getting into any trouble.&lt;br/&gt;\n&lt;strong&gt;Me&lt;/strong&gt; - Sure, thank you sir. Have a good day.&lt;br/&gt;\n&lt;em&gt;I&amp;#39;m honestly not sure what&amp;#39;s going to happen, but I&amp;#39;m sure it can&amp;#39;t be good&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey all you lurkers out there! Quick developing story here that I felt I should share. Honestly, I'm quite on the fence about whether or not our store is in the right or the customer is in the right ( I know, the customer is ALWAYS right... but just wait.)    \n  \n TLDR; Customer made a part order totaling $300, claims we shipped the wrong address. Is able to get the order from old address, but refuses to pick up order and wants a full refund without giving us the parts. TBC.  \n  \n\n**Backstory:** I'm a supervisor of a retail parts store. We sell parts for your appliances, lawn and garden, home equipment, etc. We also send items for repair and yadda yadda. It's a relatively small store, so easy to keep track of everything.   \n\nLast week (Monday), a customer (C) came into our store and needed to order parts for his lawn mower, totaling over $300. All items were to be shipped to his address within the week, all's good.  \n\nNow I don't remember this customer, but my associate is the one who completed the order with him. At the beginning of every order, when we pull up the customer info, we verify the address. We verify again at the end of the order right before it's submitted. We want to make sure the customer is getting their parts, obvi.  \n\nOn Thursday, I was working counter (ugh), and a call comes in from C.   \n**C** - Hi, I'm [Customer] and I order parts on Monday, can you look up the order for me?      \n**Me** - Sure thing, (pulls up order), I see that you ordered several parts, shipping to [address]?    \n**C** - Yup, that's correct. I was just calling about your return policy? Turns out we won't be needing the parts and we want to return them.     \n**Me** - Yeah, sure thing. You can return all the parts right back here in store when you receive them and we'll give you a refund to the original payment used. I'll even comment on the order to refund your original shipping cost as well. (usually we don't refund shipping, but it was a good day, no matter).     \n**C** - Wonderful! I'll be coming in with the parts when they arrive!     \n\nC hangs up and I think  nothing of it.  \n\nThen on Saturday, I'm working counter again at a busy time and a call comes in. Again, it's C.  \n**Me** - Parts Store, thank you for calling, this is AlyBambi, how may I help you?   \n**C** - Yeah, is this Parts Store?    \n**Me** - .... Yes? ( I literally just said that) What can I assist you with today?   \n**C** - Well I made an order on Monday of this week and you guys shipped the parts to the wrong address!    \n**Me** - Ok, hold on here, lemme look up your order for you. (pulls up order) Yes, for Mr. C?    \n**C** - Yes! I ordered over $300 worth of parts and they were shipped to the incorrect address!     \n**Me** - Okay, sir, sorry about the inconvien-     \n**C** - I want an immediate refund! The parts you shipped were to my old house that we literally moved out of last week! I went over there to pick up some things and half my order was there already! I picked up the blade I ordered but the other parts weren't there yet.     \n**Me** - Yeah, no problem sir, we can definitely do a refund for you, we just need the parts brought to our store and-     \n[C's wife comes on the phone, I didn't realize I was on speaker]  \n**W** - WE'RE NOT BRINGING THE PARTS BACK TO YOU, WE WANT OUR REFUND NOW!   \n**Me** - Okay, I understand-     \n**W** - YOU DON'T UNDERSTAND, YOU SENT THE PARTS TO THE WRONG ADDRESS, IT'S YOUR FAULT! $300 ISN'T SOMETHING THAT'S EASY FOR US TO PAY! WE NEED OUR REFUND TODAY!     \n**Me** - Unfortunately ma'am, I would need the parts to do the refund...    \n**W** - What do you mean?! YOU sent them to the wrong address -     \n**Me** - I understand that it was sent to the wrong address, but since you admitted to picking up the parts already, I can't just refund you $300 without the parts that you have in my hands.     \n**C** - THIS IS RIDICULOUS, I'M NOT GOING BACK TO GET THE OTHER PARTS! THIS IS YOUR FAULT.     \n**Me** - I apologize, I can not approve a refund without the parts returned to us. It's policy.     \n**C** - But you sent it to the wrong address!   \n**Me** - Yes, but you admitted to being able to pick up the parts, so what's to stop you from getting the rest of the parts and then just getting a refund without returning them?     \n**C** - ... well, what if the people living there won't give us the parts that we didn't pick up?   \n**Me** - The best I can do is refund the parts you do have.    \n**W** - THIS IS UNACCEPTABLE, I WANT TO SPEAK TO THE MANAGER!     \n**Me** - I'm sorry, but I am the supervisor here at this location. My manager isn't local, there is no one higher that you can speak to at the moment.     \n**W** - THEN WE WANT A PHONECALL.   \n**Me** - I can't give out his phone but I can give you his email to -    \n**W** - DID I ASK FOR AN EMAIL?     \n**Me** - I can guarantee you that he's going to tell me to give you his email address instead of calling you... Why don't I just speak with him and I'll have an answer for you on Monday afternoon?     \n**W** - WE WANT TO SPEAK TO HIM.     \n**Me** - Is this phone number listed on the order correct?     \n**W** - (finally calms down a second) Yes.  \n**Me** - Okay, I will contact him and give you call on Monday. (Hangs up without any further comments)     \n\n  \nSo, I emailed my manager, and he agrees that it's fishy that they got half the parts but not the other half and says we do need all the parts for a refund. I have to call them and I can feel my blood thickening and my eye twitching at the thought of it. Part of me feels bad because it's so much $$ but also we verify addresses twice and I even confirmed it when C called on Thursday. I wonder if C's wife got angry at how much he spent and he's blaming it on us? I dunno. Update to follow.\n\nEdit: Formatting sucks.\n\n**Update 1:** Called C this morning and he wasn't pleased, but remained calm. He asked that my manager call him in couple hours. I offered to give him manager's email (again) and he says he doesn't do email. He requested a call from Manager. I told him that I would pass on the info and to call me by tomorrow if he didn't hear anything back. Luckily, wife wasn't on phone.\n\n**Update 2:** Customer just called and started screaming at me that my manager hasn't called yet. It has been almost exactly 2.5 hours. I was on a conference call for half of one of those hours, and know that my manager was on multiple other ones afterwards. He started yelling and then I heard wife in the background. I explained that my manager has other items that he's scheduled to do but would be reaching out ASAP...  \n**Me** - If you wait until tomorrow, you will be getting a call. He is aware of the situation but is very busy.  \n**C** - Then I want HIS manager. I want a phone number.  \n**Me** - I'm not able to give out any phone information but I can give you an email address for both.  \n**C** - Okay, yeah that's fine.  \n**Me** - (gives emails) Sorry about the inconvience, sir.  \n**C** - It's not your fault, he should've called me by now! I will make to let them know that you did everything that could for me. Thank you for being so professional and patient, but I'm not. This will be going to your higher ups. But you won't be getting into any trouble.  \n**Me** - Sure, thank you sir. Have a good day.  \n*I'm honestly not sure what's going to happen, but I'm sure it can't be good*\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Epic", "id": "65x2ud", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 57, "report_reasons": null, "author": "AlyBambi", "saved": false, "mod_reports": [], "name": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "approved_by": null, "over_18": false, "domain": "self.TalesFromRetail", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t2zt", "edited": 1492461837.0, "link_flair_css_class": "epic", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TalesFromRetail/comments/65x2ud/order_gone_wrong/", "num_reports": null, "locked": false, "stickied": false, "created": 1492479793.0, "url": "https://www.reddit.com/r/TalesFromRetail/comments/65x2ud/order_gone_wrong/", "author_flair_text": null, "quarantine": false, "title": "Order Gone Wrong?", "created_utc": 1492450993.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dgdulz4", "gilded": 0, "archived": false, "score": 64, "report_reasons": null, "author": "WaffleApartment", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "&gt;The parts you shipped were to my old house that we literally moved out of last week! \n\nThey gave you an old/wrong address and confirmed it multiple times. The store didn't do a damn thing wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The parts you shipped were to my old house that we literally moved out of last week! &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They gave you an old/wrong address and confirmed it multiple times. The store didn&amp;#39;t do a damn thing wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdulz4", "score_hidden": false, "stickied": false, "created": 1492480891.0, "created_utc": 1492452091.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 64}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dgdu9ng", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "trekie88", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "This is straight up fraud. I really hope your store doesn't refund this low life", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is straight up fraud. I really hope your store doesn&amp;#39;t refund this low life&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdu9ng", "score_hidden": false, "stickied": false, "created": 1492480518.0, "created_utc": 1492451718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dgdye9b", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "tacca2", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I don't really see how they can expect a refund if they confirmed the address three times, how can they say it was your fault", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really see how they can expect a refund if they confirmed the address three times, how can they say it was your fault&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdye9b", "score_hidden": false, "stickied": false, "created": 1492485159.0, "created_utc": 1492456359.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dge5kcg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Zedman5000", "parent_id": "t1_dge23qh", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I'm 99% sure he's lying out of his ass about the whole thing to get free parts. Oh well, such is life; at least the $300 your manager is probably going to fork over isn't out of your pocket.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 99% sure he&amp;#39;s lying out of his ass about the whole thing to get free parts. Oh well, such is life; at least the $300 your manager is probably going to fork over isn&amp;#39;t out of your pocket.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge5kcg", "score_hidden": false, "stickied": false, "created": 1492493317.0, "created_utc": 1492464517.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge23qh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AlyBambi", "parent_id": "t1_dgdzyiz", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "This is what I thought! Like, you already went over there once to clean up some stuff and pick up the first part of the order and now suddenly the people living there are going to hold your parts hostage? K.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what I thought! Like, you already went over there once to clean up some stuff and pick up the first part of the order and now suddenly the people living there are going to hold your parts hostage? K.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge23qh", "score_hidden": false, "stickied": false, "created": 1492489340.0, "created_utc": 1492460540.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzyiz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SpeckledFleebeedoo", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "If it's his old address, won't he at least have spoken the people who live there now?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s his old address, won&amp;#39;t he at least have spoken the people who live there now?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdzyiz", "score_hidden": false, "stickied": false, "created": 1492486938.0, "created_utc": 1492458138.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dgdx5mh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "7_t_7", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "&gt;C - ... well, what if the people living there won't give us the parts that we didn't pick up?\n\nWell, not everyone is as dishonest as you are being right now", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;C - ... well, what if the people living there won&amp;#39;t give us the parts that we didn&amp;#39;t pick up?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, not everyone is as dishonest as you are being right now&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgdx5mh", "score_hidden": false, "stickied": false, "created": 1492483755.0, "created_utc": 1492454955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dge6s0a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tmntman", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I'll add another voice to the chorus.  If they gave you the wrong address and confirmed it, and even confirmed it once more when they called back, they can't really blame you for shipping the items to that address.   (Well, clearly they can and are.  But it's completely unreasonable for them to do so.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll add another voice to the chorus.  If they gave you the wrong address and confirmed it, and even confirmed it once more when they called back, they can&amp;#39;t really blame you for shipping the items to that address.   (Well, clearly they can and are.  But it&amp;#39;s completely unreasonable for them to do so.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge6s0a", "score_hidden": false, "stickied": false, "created": 1492494815.0, "created_utc": 1492466015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dge929m", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "minacrime", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "I fail to see at all how the customer could possibly be in the right.\n\nThe suspicious part of me thinks that they intentionally used their old address and gave the new owners a heads up about it, as they knew they would be in and out of their new place a lot, and were more comfortable sending it there. Then they're either using it as an excuse to try to return the parts, or even attempt to get them for free.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fail to see at all how the customer could possibly be in the right.&lt;/p&gt;\n\n&lt;p&gt;The suspicious part of me thinks that they intentionally used their old address and gave the new owners a heads up about it, as they knew they would be in and out of their new place a lot, and were more comfortable sending it there. Then they&amp;#39;re either using it as an excuse to try to return the parts, or even attempt to get them for free.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge929m", "score_hidden": false, "stickied": false, "created": 1492497725.0, "created_utc": 1492468925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dgeakyr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MidgetChemist", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Wouldn't they know if they were going to be moving out of the address they gave you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn&amp;#39;t they know if they were going to be moving out of the address they gave you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dgeakyr", "score_hidden": false, "stickied": false, "created": 1492499719.0, "created_utc": 1492470919.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t2zt", "removal_reason": null, "link_id": "t3_65x2ud", "likes": null, "replies": "", "user_reports": [], "id": "dge7y38", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "takeel88", "parent_id": "t3_65x2ud", "subreddit_name_prefixed": "r/TalesFromRetail", "controversiality": 0, "body": "Why apologise when it's not your fault? He fucked up or needed the $300 or whatever, not your beef.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why apologise when it&amp;#39;s not your fault? He fucked up or needed the $300 or whatever, not your beef.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TalesFromRetail", "name": "t1_dge7y38", "score_hidden": false, "stickied": false, "created": 1492496277.0, "created_utc": 1492467477.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]