[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, this is my first post as I&amp;#39;ve never really had much to say and usually just lurk in this sub. This probably doesn&amp;#39;t belong here but I don&amp;#39;t really know what else to put it in.&lt;/p&gt;\n\n&lt;p&gt;So far only three things have happened, all within the space of a week.&lt;/p&gt;\n\n&lt;p&gt;Firstly, me and my mum were in the living room thinking of a movie to watch, we hadn&amp;#39;t turned on the tv yet and we were the only two people in the house. It was about lunchtime I&amp;#39;d say. We heard a woman&amp;#39;s voice say &amp;quot;hi, I&amp;#39;m here!&amp;quot; sounding as though they were just walking into the kitchen and coming towards where we were. It creeped us out as we weren&amp;#39;t expecting anyone so we quickly went to see who it was but there was no one there and the back door was shut still. We thought it was weird but brushed it off.&lt;/p&gt;\n\n&lt;p&gt;Next, I was round a friends house sleeping the night when my mum texted me &amp;quot;Bloody hell I swear I just heard your voice in the kitchen saying &amp;quot;here you goooo&amp;quot; Ahhhh!&amp;quot; She seemed really freaked out and she definitely wouldn&amp;#39;t be one to lie as she&amp;#39;s sort of skeptical about it all in the first place. &lt;/p&gt;\n\n&lt;p&gt;EDIT: it&amp;#39;s weird ^ because on my most recent birthday (Jan 28) my family and I went out for dinner at a restaurant out of town and my grandma text my mum saying &amp;quot;are you having a nice McDonalds?&amp;quot; Which confused us because we obviously weren&amp;#39;t at McDonalds, we were in the car. So we texted back saying &amp;quot;we&amp;#39;re not at McDonalds?&amp;quot; And she said &amp;quot;what, no I just saw you?&amp;quot; But she swears she did see me and my mum. Weird stuff is happening.&lt;/p&gt;\n\n&lt;p&gt;The latest thing could&amp;#39;ve been sleep paralysis but it definitely didn&amp;#39;t feel like it as I could move and everything and I was aware of my surroundings but I guess I could&amp;#39;ve been half asleep/hallucinating but I never have before. &lt;/p&gt;\n\n&lt;p&gt;Basically I woke up in the middle of the night (I was sleeping on the sofa and my mum was sleeping on the other sofa because we had people round upstairs) and I swear I saw my cousin standing next to where my mum was sleeping, smiling really freaky - wearing everything she usually does - and then she turned to me and looked confused that I could see her and then she proceeded to smirk.&lt;/p&gt;\n\n&lt;p&gt;Her face was so creepy that I turned over and tried to go back to sleep. I don&amp;#39;t know why I didn&amp;#39;t wake my mum up or try to talk to my &amp;quot;cousin&amp;quot; but I guess I was pretty spooked out. I guess you could rule it down to Sleep paralysis but as I said I could move and all.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always felt I have a sixth sense/psychic so when I woke up I remembered what happened, still completely sure it wasn&amp;#39;t a dream and actually happened and told my mum and texted my cousin to make sure she was okay just in case and to be on the safe side in case it was a premonition. She texted back later that she was fine. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll update if anything else happens! Be sure to tell me if this is in the wrong sub and I&amp;#39;ll move it I just really didn&amp;#39;t know where to put it. &lt;/p&gt;\n\n&lt;p&gt;EDIT: something happened about a year ago, I didn&amp;#39;t think it was really relevant to the other occurrences but thought I might as well mention it.&lt;/p&gt;\n\n&lt;p&gt;I had just gotten into bed so I wasn&amp;#39;t even tired yet but I had to get up early the next day so I thought id try to sleep early. I was looking at the wall when a black shadow of a hand and forearm reached across the wall where my face was, wiggled it&amp;#39;s fingers and clasped their hand as if to grab something. It&amp;#39;s fingers were so flexible it was as if it was boneless. I even tried to repeat the action to see if it was a human but it couldn&amp;#39;t be. It was a fluid motion, and the shadow was so dark. It&amp;#39;s spooked me to this day. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, this is my first post as I've never really had much to say and usually just lurk in this sub. This probably doesn't belong here but I don't really know what else to put it in.\n\nSo far only three things have happened, all within the space of a week.\n\nFirstly, me and my mum were in the living room thinking of a movie to watch, we hadn't turned on the tv yet and we were the only two people in the house. It was about lunchtime I'd say. We heard a woman's voice say \"hi, I'm here!\" sounding as though they were just walking into the kitchen and coming towards where we were. It creeped us out as we weren't expecting anyone so we quickly went to see who it was but there was no one there and the back door was shut still. We thought it was weird but brushed it off.\n\nNext, I was round a friends house sleeping the night when my mum texted me \"Bloody hell I swear I just heard your voice in the kitchen saying \"here you goooo\" Ahhhh!\" She seemed really freaked out and she definitely wouldn't be one to lie as she's sort of skeptical about it all in the first place. \n\nEDIT: it's weird ^ because on my most recent birthday (Jan 28) my family and I went out for dinner at a restaurant out of town and my grandma text my mum saying \"are you having a nice McDonalds?\" Which confused us because we obviously weren't at McDonalds, we were in the car. So we texted back saying \"we're not at McDonalds?\" And she said \"what, no I just saw you?\" But she swears she did see me and my mum. Weird stuff is happening.\n\nThe latest thing could've been sleep paralysis but it definitely didn't feel like it as I could move and everything and I was aware of my surroundings but I guess I could've been half asleep/hallucinating but I never have before. \n\nBasically I woke up in the middle of the night (I was sleeping on the sofa and my mum was sleeping on the other sofa because we had people round upstairs) and I swear I saw my cousin standing next to where my mum was sleeping, smiling really freaky - wearing everything she usually does - and then she turned to me and looked confused that I could see her and then she proceeded to smirk.\n\nHer face was so creepy that I turned over and tried to go back to sleep. I don't know why I didn't wake my mum up or try to talk to my \"cousin\" but I guess I was pretty spooked out. I guess you could rule it down to Sleep paralysis but as I said I could move and all.\n\nI've always felt I have a sixth sense/psychic so when I woke up I remembered what happened, still completely sure it wasn't a dream and actually happened and told my mum and texted my cousin to make sure she was okay just in case and to be on the safe side in case it was a premonition. She texted back later that she was fine. \n\nI'll update if anything else happens! Be sure to tell me if this is in the wrong sub and I'll move it I just really didn't know where to put it. \n\nEDIT: something happened about a year ago, I didn't think it was really relevant to the other occurrences but thought I might as well mention it.\n\nI had just gotten into bed so I wasn't even tired yet but I had to get up early the next day so I thought id try to sleep early. I was looking at the wall when a black shadow of a hand and forearm reached across the wall where my face was, wiggled it's fingers and clasped their hand as if to grab something. It's fingers were so flexible it was as if it was boneless. I even tried to repeat the action to see if it was a human but it couldn't be. It was a fluid motion, and the shadow was so dark. It's spooked me to this day. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ua6p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "24jess_stilinski", "saved": false, "mod_reports": [], "name": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": 1491989417.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/64ua6p/weird_occurrences/", "num_reports": null, "locked": false, "stickied": false, "created": 1491979192.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/64ua6p/weird_occurrences/", "author_flair_text": null, "quarantine": false, "title": "Weird Occurrences", "created_utc": 1491950392.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": "", "user_reports": [], "id": "dg5gkwk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t1_dg5e4mw", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I wonder who or what it was or what they wanted to get across to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder who or what it was or what they wanted to get across to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5gkwk", "score_hidden": false, "stickied": false, "created": 1491999539.0, "created_utc": 1491970739.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e4mw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ElcompJR", "parent_id": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "The same things about the voices happened to me like a year ago.\n\nI was in bed trying to fall asleep, my mom was next to me that night, I don't remember why. I was almost asleep when suddenly I heard somebody in a childish/happy voice say 'Hey!'. I quickly looked around, my mom looked at me because of my reaction. She asked me 'what's wrong?', and I tryed to ask her to make silence by hand signals.\n\nThen, I heard 'Hey! Over here!' coming from the window (which was closed). I looked to the window trying to distinguish some shadow behind it or something, and then I heard 'Yes! I'm here!'. I was freaking out really bad. I was also trying to figure out what was that. Somebody was in our yard, but why would you say 'Hey!'? Why did it sound like a kid? Why weren't our dogs barking?\n\nMy mom was still asking 'what's wrong?!', I told her what just happened and asked her if she heard that too. She didn't.\n\nI'm completly sure that I wasn't dreaming because I asked my mom if that event really happened that night or if it was just me, and she remembers it too. The next morning we checked if there was a signal of somebody and we found nothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same things about the voices happened to me like a year ago.&lt;/p&gt;\n\n&lt;p&gt;I was in bed trying to fall asleep, my mom was next to me that night, I don&amp;#39;t remember why. I was almost asleep when suddenly I heard somebody in a childish/happy voice say &amp;#39;Hey!&amp;#39;. I quickly looked around, my mom looked at me because of my reaction. She asked me &amp;#39;what&amp;#39;s wrong?&amp;#39;, and I tryed to ask her to make silence by hand signals.&lt;/p&gt;\n\n&lt;p&gt;Then, I heard &amp;#39;Hey! Over here!&amp;#39; coming from the window (which was closed). I looked to the window trying to distinguish some shadow behind it or something, and then I heard &amp;#39;Yes! I&amp;#39;m here!&amp;#39;. I was freaking out really bad. I was also trying to figure out what was that. Somebody was in our yard, but why would you say &amp;#39;Hey!&amp;#39;? Why did it sound like a kid? Why weren&amp;#39;t our dogs barking?&lt;/p&gt;\n\n&lt;p&gt;My mom was still asking &amp;#39;what&amp;#39;s wrong?!&amp;#39;, I told her what just happened and asked her if she heard that too. She didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m completly sure that I wasn&amp;#39;t dreaming because I asked my mom if that event really happened that night or if it was just me, and she remembers it too. The next morning we checked if there was a signal of somebody and we found nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5e4mw", "score_hidden": false, "stickied": false, "created": 1491995658.0, "created_utc": 1491966858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": "", "user_reports": [], "id": "dg5kz7e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "heartshapedmoon", "parent_id": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I can relate to the first part about you and your mom hearing a voice. My sister and I were alone on the first floor of our house one time. We were sleeping, but we both woke up because we heard a baby crying towards our front door and a woman saying \"Don't worry, it's okay.\" It was SO weird. There was no TV on or anything...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate to the first part about you and your mom hearing a voice. My sister and I were alone on the first floor of our house one time. We were sleeping, but we both woke up because we heard a baby crying towards our front door and a woman saying &amp;quot;Don&amp;#39;t worry, it&amp;#39;s okay.&amp;quot; It was SO weird. There was no TV on or anything...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5kz7e", "score_hidden": false, "stickied": false, "created": 1492008653.0, "created_utc": 1491979853.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": "", "user_reports": [], "id": "dg5vm5w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KayLove05", "parent_id": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Fuck last night I heard my kid say \"Mama\" in a weird way. I looked towards the door and no one was there. It was definitely his voice and I've never heard anything like that. My sister had 2 instances in a couple of weeks of her hearing her bfs voice and him hearing her but neither of them had said anything. He heard her scream for him loudly so that one was scary because no one else heard it and it was so loud to him.\n\nThey were in the same room when she heard him say something to her and he didn't but he didn't hear a thing...which is odd...\n\nI've had another experience with hearing something say my name. It was in my step dads voice but it turned evil at the end and scared the living shit out of me. It started screaming my name over and over and over.\n\nI don't know why it happens. The first one I had I felt was paranormal but the one last night could have been just my mind playing tricks on me. \n\nSomething definitely happened if both of you heard it...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck last night I heard my kid say &amp;quot;Mama&amp;quot; in a weird way. I looked towards the door and no one was there. It was definitely his voice and I&amp;#39;ve never heard anything like that. My sister had 2 instances in a couple of weeks of her hearing her bfs voice and him hearing her but neither of them had said anything. He heard her scream for him loudly so that one was scary because no one else heard it and it was so loud to him.&lt;/p&gt;\n\n&lt;p&gt;They were in the same room when she heard him say something to her and he didn&amp;#39;t but he didn&amp;#39;t hear a thing...which is odd...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had another experience with hearing something say my name. It was in my step dads voice but it turned evil at the end and scared the living shit out of me. It started screaming my name over and over and over.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know why it happens. The first one I had I felt was paranormal but the one last night could have been just my mind playing tricks on me. &lt;/p&gt;\n\n&lt;p&gt;Something definitely happened if both of you heard it...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5vm5w", "score_hidden": false, "stickied": false, "created": 1492033679.0, "created_utc": 1492004879.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": "", "user_reports": [], "id": "dg65hj2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WeRunTheEast", "parent_id": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I'm gonna read the story more thoroughly after I get over the fact that you have the same first name as my sister (according to your username, at least) and birthday as her, if you put your actual birthday.\n\nOk, back to reading.\n\nEdit: 1) that's some freaky shit! Did you ever turn back to see if your cousin was still there? 2) you are definitely not my sister lol. We're American. Still kinda weird.", "edited": 1492016222.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m gonna read the story more thoroughly after I get over the fact that you have the same first name as my sister (according to your username, at least) and birthday as her, if you put your actual birthday.&lt;/p&gt;\n\n&lt;p&gt;Ok, back to reading.&lt;/p&gt;\n\n&lt;p&gt;Edit: 1) that&amp;#39;s some freaky shit! Did you ever turn back to see if your cousin was still there? 2) you are definitely not my sister lol. We&amp;#39;re American. Still kinda weird.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg65hj2", "score_hidden": false, "stickied": false, "created": 1492044773.0, "created_utc": 1492015973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": "", "user_reports": [], "id": "dg5lwln", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "24jess_stilinski", "parent_id": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I forgot about this until now but a few months ago we kept hearing a cat all over the house meowing for days. We didn't own a cat and there was no way one could get in without us knowing. We did have a cat in the past and it's buried in the back garden. Weird if it was his ghost. ", "edited": 1491983201.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I forgot about this until now but a few months ago we kept hearing a cat all over the house meowing for days. We didn&amp;#39;t own a cat and there was no way one could get in without us knowing. We did have a cat in the past and it&amp;#39;s buried in the back garden. Weird if it was his ghost. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5lwln", "score_hidden": false, "stickied": false, "created": 1492011169.0, "created_utc": 1491982369.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": "", "user_reports": [], "id": "dg65jrr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "24jess_stilinski", "parent_id": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Woah, really? Yeah, that's my real birthday oh my god ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woah, really? Yeah, that&amp;#39;s my real birthday oh my god &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg65jrr", "score_hidden": false, "stickied": false, "created": 1492044839.0, "created_utc": 1492016039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64ua6p", "likes": null, "replies": "", "user_reports": [], "id": "dg6841e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "24jess_stilinski", "parent_id": "t3_64ua6p", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "That's weird because everyone says I have an \"American or Australian accent\" even though I grew up in England? I don't think I sound different or anything though 😂", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s weird because everyone says I have an &amp;quot;American or Australian accent&amp;quot; even though I grew up in England? I don&amp;#39;t think I sound different or anything though 😂&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg6841e", "score_hidden": false, "stickied": false, "created": 1492047428.0, "created_utc": 1492018628.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]