[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was driving on Venice Blvd in Los Angeles at around 11pm when I had a weird feeling and kind of thought to myself that there might be someone that needed help on the road, while simultaneously seeing in my mind&amp;#39;s eye, a distressed figure in the road in front of me. I thought nothing of it, but ten seconds later, there&amp;#39;s a woman in a wheelchair with blood on her face, screaming and waving her arms in the middle of the road. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a long story, but I stopped immediately and was able to get her to safety. I ended up calling the paramedics as it seemed to be a mental health issue. &lt;/p&gt;\n\n&lt;p&gt;Anyway, it&amp;#39;s three hours later and I&amp;#39;m still seriously shook. Part of it is anger - it took a long time to get the woman off the street because people wouldn&amp;#39;t stop their cars to let us cross. The one person that did, I asked him to help me move her because she was flailing, and he literally said &amp;quot;you need to figure it out man, she&amp;#39;s in the middle of the street.&amp;quot; I remember I yelled &amp;quot;Are you fucking kidding me?!&amp;quot; as he drove off, still grumpy from the inconvenience this extremely distressed woman had caused him. I then had to wait for several more cars to pass before I could get her to safety. &lt;/p&gt;\n\n&lt;p&gt;And of course the other part is pure wonder/disbelief at what had happened with my waking &amp;quot;vision.&amp;quot; It was such a specific feeling, sensing someone in danger and seeing what it would look like in my mind right before it happened in real life. &lt;/p&gt;\n\n&lt;p&gt;I considered that it could have been my being paranoid since it was dark, but I remember the feeling of amazement at my vision occurring in real life to such an accuracy. I just didn&amp;#39;t have time to digest it. &lt;/p&gt;\n\n&lt;p&gt;I called my girlfriend right after, telling her what had happened including the &amp;quot;vision&amp;quot;. However after I calmed down and I was telling my cousin/roommate about it when I got home, I left out the supernatural bit because, I don&amp;#39;t know, it sounds ridiculous. I left it out again when I told my best friend. &lt;/p&gt;\n\n&lt;p&gt;Anyways, that was a way longer post than I had expected it to be. Believe it or not, that was the short version. Share your thoughts/ tell me if I&amp;#39;m crazy in the comments please. Thanks for reading. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was driving on Venice Blvd in Los Angeles at around 11pm when I had a weird feeling and kind of thought to myself that there might be someone that needed help on the road, while simultaneously seeing in my mind's eye, a distressed figure in the road in front of me. I thought nothing of it, but ten seconds later, there's a woman in a wheelchair with blood on her face, screaming and waving her arms in the middle of the road. \n\nIt's a long story, but I stopped immediately and was able to get her to safety. I ended up calling the paramedics as it seemed to be a mental health issue. \n\nAnyway, it's three hours later and I'm still seriously shook. Part of it is anger - it took a long time to get the woman off the street because people wouldn't stop their cars to let us cross. The one person that did, I asked him to help me move her because she was flailing, and he literally said \"you need to figure it out man, she's in the middle of the street.\" I remember I yelled \"Are you fucking kidding me?!\" as he drove off, still grumpy from the inconvenience this extremely distressed woman had caused him. I then had to wait for several more cars to pass before I could get her to safety. \n\nAnd of course the other part is pure wonder/disbelief at what had happened with my waking \"vision.\" It was such a specific feeling, sensing someone in danger and seeing what it would look like in my mind right before it happened in real life. \n\nI considered that it could have been my being paranoid since it was dark, but I remember the feeling of amazement at my vision occurring in real life to such an accuracy. I just didn't have time to digest it. \n\nI called my girlfriend right after, telling her what had happened including the \"vision\". However after I calmed down and I was telling my cousin/roommate about it when I got home, I left out the supernatural bit because, I don't know, it sounds ridiculous. I left it out again when I told my best friend. \n\nAnyways, that was a way longer post than I had expected it to be. Believe it or not, that was the short version. Share your thoughts/ tell me if I'm crazy in the comments please. Thanks for reading. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64x2t3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 74, "report_reasons": null, "author": "alanmyrical", "saved": false, "mod_reports": [], "name": "t3_64x2t3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/64x2t3/had_a_waking_vision_of_person_in_distress_while/", "num_reports": null, "locked": false, "stickied": false, "created": 1492017619.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/64x2t3/had_a_waking_vision_of_person_in_distress_while/", "author_flair_text": null, "quarantine": false, "title": "Had a waking vision of person in distress while driving, and saw that person in the middle of the street 10 seconds later.", "created_utc": 1491988819.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 74}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": "", "user_reports": [], "id": "dg6bsyl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "alanmyrical", "parent_id": "t1_dg5qgll", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Thanks for taking the time to read. \nIt wasn't a dream - closer to a vision I think, and I was awake and driving at the time. \n\nI'd like to think I would've stopped regardless, but it's very possible that that's what prompted me to help. After I had the vision and it actually happened, there was just no doubt in my mind that I would stop and help this woman - whereas if I wasn't prepared I might've just prioritized my own life and swerved out of the way. I do think she could have died that night - nobody was stopping even when I was trying to flag people down. \n\nThanks again for your response and time, I really appreciate it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for taking the time to read. \nIt wasn&amp;#39;t a dream - closer to a vision I think, and I was awake and driving at the time. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to think I would&amp;#39;ve stopped regardless, but it&amp;#39;s very possible that that&amp;#39;s what prompted me to help. After I had the vision and it actually happened, there was just no doubt in my mind that I would stop and help this woman - whereas if I wasn&amp;#39;t prepared I might&amp;#39;ve just prioritized my own life and swerved out of the way. I do think she could have died that night - nobody was stopping even when I was trying to flag people down. &lt;/p&gt;\n\n&lt;p&gt;Thanks again for your response and time, I really appreciate it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg6bsyl", "score_hidden": false, "stickied": false, "created": 1492051185.0, "created_utc": 1492022385.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": "", "user_reports": [], "id": "dg5yeb6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Oneironaughtics", "parent_id": "t1_dg5qgll", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "People like this exist in Canada.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People like this exist in Canada.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5yeb6", "score_hidden": false, "stickied": false, "created": 1492037084.0, "created_utc": 1492008284.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": "", "user_reports": [], "id": "dg68zj5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8BitFlash", "parent_id": "t1_dg5qgll", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "People like this exist in Canada.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People like this exist in Canada.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg68zj5", "score_hidden": false, "stickied": false, "created": 1492048303.0, "created_utc": 1492019503.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qgll", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Gumlilium_", "parent_id": "t3_64x2t3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "First off thanks for sharing.\nI can't believe people like you still exist. \nThough if you don't mind me asking, was it the dream that compelled you to help her? \nShe probably would have died from a fatal accident if you had not helped, seeing that no one else cared or made the effort. Thank you OP for helping the woman out I really appreciate your humanity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off thanks for sharing.\nI can&amp;#39;t believe people like you still exist. \nThough if you don&amp;#39;t mind me asking, was it the dream that compelled you to help her? \nShe probably would have died from a fatal accident if you had not helped, seeing that no one else cared or made the effort. Thank you OP for helping the woman out I really appreciate your humanity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5qgll", "score_hidden": false, "stickied": false, "created": 1492024754.0, "created_utc": 1491995954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": "", "user_reports": [], "id": "dg6a8u0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "alanmyrical", "parent_id": "t1_dg5qb7z", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Wow, that's nuts. Exactly the same thing with me, just a weird feeling that I knew to mean that somebody definitely needed help. I also saw a figure in my mind, pretty much right where the woman in the wheelchair was.  I'm glad similar things have happened to others, and glad you were there to help her. \n\nRegarding whether she was fine at home, I think it's safe to think she is. If this thing that happened to us gave us a specific feeling that someone needed help, I feel like you would have known if this guy was the problem or not. Something enlisted your help - and you helped by talking to the woman and calming her down. If the guy was the problem you might have had a feeling closer to \"someone's in danger\" rather than \"someone's going to need my help.\" \n\nI'm not a big believer in supernatural occurrences, but I have to believe when stuff like this happens, that the feeling we get is specific enough to get us through the problem, as long as we're open to it. Otherwise, what's the point? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that&amp;#39;s nuts. Exactly the same thing with me, just a weird feeling that I knew to mean that somebody definitely needed help. I also saw a figure in my mind, pretty much right where the woman in the wheelchair was.  I&amp;#39;m glad similar things have happened to others, and glad you were there to help her. &lt;/p&gt;\n\n&lt;p&gt;Regarding whether she was fine at home, I think it&amp;#39;s safe to think she is. If this thing that happened to us gave us a specific feeling that someone needed help, I feel like you would have known if this guy was the problem or not. Something enlisted your help - and you helped by talking to the woman and calming her down. If the guy was the problem you might have had a feeling closer to &amp;quot;someone&amp;#39;s in danger&amp;quot; rather than &amp;quot;someone&amp;#39;s going to need my help.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a big believer in supernatural occurrences, but I have to believe when stuff like this happens, that the feeling we get is specific enough to get us through the problem, as long as we&amp;#39;re open to it. Otherwise, what&amp;#39;s the point? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg6a8u0", "score_hidden": false, "stickied": false, "created": 1492049595.0, "created_utc": 1492020795.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qb7z", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "a-cellar-door", "parent_id": "t3_64x2t3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I had a similar feeling once on my lunch break about a year ago.  I work in a clinical setting (but I'm a non-clinical member of staff).  I went outside to eat my lunch on a big patch of grass outside the Maternity unit and while I was there, I had this overwhelming feeling that someone was going to need my help - I didn't 'see' anything, but I certainly felt it.  I felt nervy and on edge.  About 5 minutes later, when I'm tucking into my sandwich, a young heavily pregnant woman came RUNNING out of the maternity block in a flood of tears and sat herself on the bench.  I immediately got up, leaving my lunch etc on my jacket which I'd put on the grass, and sat next to her.  I talked to her for about 10 minutes.  She was having problems with her partner and the pregnancy and she was just so overwhelmed by his lack of support (I don't think there was anything wrong with the baby, she said she had Hyperemesis Gravidarum which is like super severe morning sickness).  I asked her if she was 'safe' at home and she couldn't give me an answer to that, so I didn't push her to.  I advised her there were women's refuges in our local area and that if she felt unsafe, or felt that her baby would be unsafe, to contact them.\n\nIn the time we talked she calmed down a lot and was able to stop crying.  Her partner came outside after around 15 minutes of skulking in the Maternity unit, appropriately shame-faced, and started talking to her.  She let me know that she'd be okay and so I took up my previous position on the grass.  Her partner did seem remorseful, but I hope that if he was in any way abusive, she got out before the birth of their child.  I told her the name of one particular shelter, but I'll never know the outcome.\n\nCan't explain the 'foreknowledge' of knowing, categorically, that someone would need my help that day.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a similar feeling once on my lunch break about a year ago.  I work in a clinical setting (but I&amp;#39;m a non-clinical member of staff).  I went outside to eat my lunch on a big patch of grass outside the Maternity unit and while I was there, I had this overwhelming feeling that someone was going to need my help - I didn&amp;#39;t &amp;#39;see&amp;#39; anything, but I certainly felt it.  I felt nervy and on edge.  About 5 minutes later, when I&amp;#39;m tucking into my sandwich, a young heavily pregnant woman came RUNNING out of the maternity block in a flood of tears and sat herself on the bench.  I immediately got up, leaving my lunch etc on my jacket which I&amp;#39;d put on the grass, and sat next to her.  I talked to her for about 10 minutes.  She was having problems with her partner and the pregnancy and she was just so overwhelmed by his lack of support (I don&amp;#39;t think there was anything wrong with the baby, she said she had Hyperemesis Gravidarum which is like super severe morning sickness).  I asked her if she was &amp;#39;safe&amp;#39; at home and she couldn&amp;#39;t give me an answer to that, so I didn&amp;#39;t push her to.  I advised her there were women&amp;#39;s refuges in our local area and that if she felt unsafe, or felt that her baby would be unsafe, to contact them.&lt;/p&gt;\n\n&lt;p&gt;In the time we talked she calmed down a lot and was able to stop crying.  Her partner came outside after around 15 minutes of skulking in the Maternity unit, appropriately shame-faced, and started talking to her.  She let me know that she&amp;#39;d be okay and so I took up my previous position on the grass.  Her partner did seem remorseful, but I hope that if he was in any way abusive, she got out before the birth of their child.  I told her the name of one particular shelter, but I&amp;#39;ll never know the outcome.&lt;/p&gt;\n\n&lt;p&gt;Can&amp;#39;t explain the &amp;#39;foreknowledge&amp;#39; of knowing, categorically, that someone would need my help that day.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5qb7z", "score_hidden": false, "stickied": false, "created": 1492024392.0, "created_utc": 1491995592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": "", "user_reports": [], "id": "dg61d8c", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ssplam", "parent_id": "t1_dg5yg1f", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I'm thinking along these lines too. Not a glitch so much as a call from the Universe to help. If you believe in God, then think of it as being asked to help on His behalf.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m thinking along these lines too. Not a glitch so much as a call from the Universe to help. If you believe in God, then think of it as being asked to help on His behalf.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg61d8c", "score_hidden": false, "stickied": false, "created": 1492040391.0, "created_utc": 1492011591.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yg1f", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Oneironaughtics", "parent_id": "t3_64x2t3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I think it's the same mind projection of distress mothers receive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s the same mind projection of distress mothers receive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg5yg1f", "score_hidden": false, "stickied": false, "created": 1492037139.0, "created_utc": 1492008339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": "", "user_reports": [], "id": "dg6xpev", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Gidial", "parent_id": "t3_64x2t3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Thanks for sharing!  Having had similar visions/thoughts/precognition, I totally understand your inclination to leave that part out of the story - to \"stick to the facts\". But I hope someday you tell the whole story to some folks you know well and care about.  It's a good story, and entertaining. Find a way to tell it :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for sharing!  Having had similar visions/thoughts/precognition, I totally understand your inclination to leave that part out of the story - to &amp;quot;stick to the facts&amp;quot;. But I hope someday you tell the whole story to some folks you know well and care about.  It&amp;#39;s a good story, and entertaining. Find a way to tell it :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg6xpev", "score_hidden": false, "stickied": false, "created": 1492076390.0, "created_utc": 1492047590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_64x2t3", "likes": null, "replies": "", "user_reports": [], "id": "dg6z3o3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThaleaTiny", "parent_id": "t3_64x2t3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I've had that happen.  Man, so often. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had that happen.  Man, so often. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg6z3o3", "score_hidden": false, "stickied": false, "created": 1492078133.0, "created_utc": 1492049333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]