[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Sorry for the format for those who care, I&amp;#39;m on mobile.&lt;/p&gt;\n\n&lt;p&gt;So about two months ago I had been at my boyfriends house. He had gone to bed around 10:30 because he had to wake up early and I stayed up cleaning the entire house until 5ish in the morning. I had just finished and was walking down the stairs to the first floor (where he was sleeping) when we bumped into eachother. My boyfriend is a jokester and doesn&amp;#39;t act serious very often. I asked him what he was up to and he seemed worries from the get go. He told me he dreamt I was missing and woke up to me out of bed and went to look for me. He genuinly seemed worried then relieved the whole time. \nIn the morning I asked him about it and he was his normal &amp;#39;not taking it 100% serious self&amp;#39; and told me he never dreamt about me. He had completely forgotten he said he had that dream and also acted as though he had never been worried. \nFastforward to that night and I get a text from my friend. I hadn&amp;#39;t talked to him over text in around a month after having lived with him and moving out. One weird thing I&amp;#39;ll mention is I thought about texting him the day before. He started the text asking if I was okay and that he had a strange dream and thought to check up on me. Immediately my mind went to what my boyfriend had said so I asked if by chance his dream was about me going missing. He said this &amp;quot;To the rest of the world it would seem like you did, you a few others and me were all on a bus just ridding along it never really seemed to let anyone off and my grandmother was driving oddly enough. Why do you ask.&amp;quot; I then told him what had happened. It was very weird. \nAlso not completely related but still odd, the next day I dreamt about my best friend I hadnt hung with in awhile. To summarize she went missing while we were shopping and rerurned as a toddler. Now the day after that I had heard from another buddy that she had been loudly talking about me and some of my illegal habits as of late at her job at a local gas station to her boyfriend and his friend. Now this was extremely childish of her and not something she&amp;#39;d normally do. In my dream she became a child/toddler. In real life she acted childish as hell. Just odd.&lt;/p&gt;\n\n&lt;p&gt;Text from my friend below.\n&lt;a href=\"https://imgur.com/gallery/A4mK8\"&gt;https://imgur.com/gallery/A4mK8&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Edit: Sorry for the format for those who care, I'm on mobile.\n\nSo about two months ago I had been at my boyfriends house. He had gone to bed around 10:30 because he had to wake up early and I stayed up cleaning the entire house until 5ish in the morning. I had just finished and was walking down the stairs to the first floor (where he was sleeping) when we bumped into eachother. My boyfriend is a jokester and doesn't act serious very often. I asked him what he was up to and he seemed worries from the get go. He told me he dreamt I was missing and woke up to me out of bed and went to look for me. He genuinly seemed worried then relieved the whole time. \nIn the morning I asked him about it and he was his normal 'not taking it 100% serious self' and told me he never dreamt about me. He had completely forgotten he said he had that dream and also acted as though he had never been worried. \nFastforward to that night and I get a text from my friend. I hadn't talked to him over text in around a month after having lived with him and moving out. One weird thing I'll mention is I thought about texting him the day before. He started the text asking if I was okay and that he had a strange dream and thought to check up on me. Immediately my mind went to what my boyfriend had said so I asked if by chance his dream was about me going missing. He said this \"To the rest of the world it would seem like you did, you a few others and me were all on a bus just ridding along it never really seemed to let anyone off and my grandmother was driving oddly enough. Why do you ask.\" I then told him what had happened. It was very weird. \nAlso not completely related but still odd, the next day I dreamt about my best friend I hadnt hung with in awhile. To summarize she went missing while we were shopping and rerurned as a toddler. Now the day after that I had heard from another buddy that she had been loudly talking about me and some of my illegal habits as of late at her job at a local gas station to her boyfriend and his friend. Now this was extremely childish of her and not something she'd normally do. In my dream she became a child/toddler. In real life she acted childish as hell. Just odd.\n\nText from my friend below.\nhttps://imgur.com/gallery/A4mK8", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ztvh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "SystemOfAFoopa", "saved": false, "mod_reports": [], "name": "t3_64ztvh", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": 1492020862.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/64ztvh/odd_dream_experience/", "num_reports": null, "locked": false, "stickied": false, "created": 1492048834.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/64ztvh/odd_dream_experience/", "author_flair_text": null, "quarantine": false, "title": "Odd dream experience", "created_utc": 1492020034.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]