[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everybody! I&amp;#39;ve never posted to reddit but I&amp;#39;ve been curious about this topic. I&amp;#39;m not sure if this is the right way to post, so forgive me if it&amp;#39;s wrong &lt;/p&gt;\n\n&lt;p&gt;So for years I&amp;#39;ve had strange things happen to me. I&amp;#39;d think of someone or an event that could happen, then it does. &lt;/p&gt;\n\n&lt;p&gt;A few examples: &lt;/p&gt;\n\n&lt;p&gt;In December 2015, I get this strange feeling that my boyfriends brother is gonna do something stupid and hurt him. I tell my bf and he said he&amp;#39;ll keep his guard up. A few days later my bf gets a text from his brother admitting and confirming things about how he screwed him over in the past; basically backstabbing him badly. &lt;/p&gt;\n\n&lt;p&gt;In June 2016 I was on vacation thousands of miles away from home. As I&amp;#39;m trying to fall asleep, I get this feeling of doom. I call my bf crying and tell him that something bad is gonna happen to someone I know and I just feel it. I said it was either my grandpa or my grandma. \nThe next morning, my mom gets a call saying that my grandpa had to be rushed to the doctor appointment for an emergency. &lt;/p&gt;\n\n&lt;p&gt;In September 2016 I fell down the stairs while my bf was walking his dog and I tried calling him on his cell phone but he missed the call because his phone was on silent. As soon he missed the call, he looked at his phone and ran back to the house and looked pale. He told me &amp;quot;I knew you were hurt.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;More recently on April 2017 I was thinking about my one friend, Rayne. She&amp;#39;s an Internet friend who I&amp;#39;ve never met irl. I haven&amp;#39;t spoken to her in 2+ years. I looked at her Instagram account the other day and think &amp;quot;she&amp;#39;s grown up a lot. I wonder how she&amp;#39;s doing.&amp;quot; Today, she messages me saying how we haven&amp;#39;t talked in a while and asking how I&amp;#39;m doing. &lt;/p&gt;\n\n&lt;p&gt;These are just a few major ones I can think of and many more have happened. Anyone have any clue what&amp;#39;s going on here!? I know it has to do with the energy and how we&amp;#39;re connected but I&amp;#39;ve never met some of the Internet friends and it happens with them... \nHave you guys had similar experiences? &lt;/p&gt;\n\n&lt;p&gt;Please share your insight/stories with me! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello everybody! I've never posted to reddit but I've been curious about this topic. I'm not sure if this is the right way to post, so forgive me if it's wrong \n\nSo for years I've had strange things happen to me. I'd think of someone or an event that could happen, then it does. \n\nA few examples: \n\nIn December 2015, I get this strange feeling that my boyfriends brother is gonna do something stupid and hurt him. I tell my bf and he said he'll keep his guard up. A few days later my bf gets a text from his brother admitting and confirming things about how he screwed him over in the past; basically backstabbing him badly. \n\nIn June 2016 I was on vacation thousands of miles away from home. As I'm trying to fall asleep, I get this feeling of doom. I call my bf crying and tell him that something bad is gonna happen to someone I know and I just feel it. I said it was either my grandpa or my grandma. \nThe next morning, my mom gets a call saying that my grandpa had to be rushed to the doctor appointment for an emergency. \n\nIn September 2016 I fell down the stairs while my bf was walking his dog and I tried calling him on his cell phone but he missed the call because his phone was on silent. As soon he missed the call, he looked at his phone and ran back to the house and looked pale. He told me \"I knew you were hurt.\" \n\nMore recently on April 2017 I was thinking about my one friend, Rayne. She's an Internet friend who I've never met irl. I haven't spoken to her in 2+ years. I looked at her Instagram account the other day and think \"she's grown up a lot. I wonder how she's doing.\" Today, she messages me saying how we haven't talked in a while and asking how I'm doing. \n\nThese are just a few major ones I can think of and many more have happened. Anyone have any clue what's going on here!? I know it has to do with the energy and how we're connected but I've never met some of the Internet friends and it happens with them... \nHave you guys had similar experiences? \n\nPlease share your insight/stories with me! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652zzc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "meggy792", "saved": false, "mod_reports": [], "name": "t3_652zzc", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/652zzc/thinking_of_someone_then_they_contact_you/", "num_reports": null, "locked": false, "stickied": false, "created": 1492081723.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/652zzc/thinking_of_someone_then_they_contact_you/", "author_flair_text": null, "quarantine": false, "title": "Thinking of someone then they contact you", "created_utc": 1492052923.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": "", "user_reports": [], "id": "dg7p4de", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bchewey", "parent_id": "t1_dg78n3c", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Where can I delve in to this topic more? My friend and I have been having more and more synchronicity's with each other and it's starting to become a daily thing where we even joke about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where can I delve in to this topic more? My friend and I have been having more and more synchronicity&amp;#39;s with each other and it&amp;#39;s starting to become a daily thing where we even joke about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg7p4de", "score_hidden": false, "stickied": false, "created": 1492125798.0, "created_utc": 1492096998.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78n3c", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Luckyboxer777", "parent_id": "t3_652zzc", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Synchronicity ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Synchronicity &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg78n3c", "score_hidden": false, "stickied": false, "created": 1492093299.0, "created_utc": 1492064499.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": "", "user_reports": [], "id": "dg8a8ib", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "meggy792", "parent_id": "t1_dg7dv95", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Sometimes when I think of somebody, I'll think \"what if they message/contact me!?\" then it never happens. But if I get a gut feeling of thinking about someone, they'll usually contact me. \nOr occasionally I'll get bad feelings (premonitions while I'm awake or asleep) and nothing will happen. That happens about 30% of the time. \n\nMy bf and I also have synchronized dejavu or I'll say something he was just thinking of, or vice versa. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes when I think of somebody, I&amp;#39;ll think &amp;quot;what if they message/contact me!?&amp;quot; then it never happens. But if I get a gut feeling of thinking about someone, they&amp;#39;ll usually contact me. \nOr occasionally I&amp;#39;ll get bad feelings (premonitions while I&amp;#39;m awake or asleep) and nothing will happen. That happens about 30% of the time. &lt;/p&gt;\n\n&lt;p&gt;My bf and I also have synchronized dejavu or I&amp;#39;ll say something he was just thinking of, or vice versa. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg8a8ib", "score_hidden": false, "stickied": false, "created": 1492148897.0, "created_utc": 1492120097.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dv95", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Real_Johnny_Utah", "parent_id": "t3_652zzc", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "How many times does nothing happen when you get one of these feelings? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How many times does nothing happen when you get one of these feelings? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg7dv95", "score_hidden": false, "stickied": false, "created": 1492108360.0, "created_utc": 1492079560.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": "", "user_reports": [], "id": "dg731gt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lisa_peachy101", "parent_id": "t3_652zzc", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Omg! This happens to me as well!! But on a smaller scale than yours. Nothing very negative but just random coincidences that are so weird like thinking about a certain person out of the blue and then pop up suddenly. Or like I always think of the most random topics and then it will come up in the top of my social media or something on that same day when I've never ever thought about it before. I believe I'm just an it delusional and maybe it is a coincidence. It's just gets so weird sometimes how things can happen. Creeps me out  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Omg! This happens to me as well!! But on a smaller scale than yours. Nothing very negative but just random coincidences that are so weird like thinking about a certain person out of the blue and then pop up suddenly. Or like I always think of the most random topics and then it will come up in the top of my social media or something on that same day when I&amp;#39;ve never ever thought about it before. I believe I&amp;#39;m just an it delusional and maybe it is a coincidence. It&amp;#39;s just gets so weird sometimes how things can happen. Creeps me out  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg731gt", "score_hidden": false, "stickied": false, "created": 1492083317.0, "created_utc": 1492054517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": "", "user_reports": [], "id": "dg78n9g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Luckyboxer777", "parent_id": "t3_652zzc", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "And law of attraction ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And law of attraction &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg78n9g", "score_hidden": false, "stickied": false, "created": 1492093311.0, "created_utc": 1492064511.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": "", "user_reports": [], "id": "dg8agfe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meggy792", "parent_id": "t1_dg74fdx", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "The same thing happens to me many times a week. I'll be talking about my mother, cousin, father, etc. and they'll text/call me moments after I had just spoke about them. \nIt's an eerie feeling, yet also intriguing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same thing happens to me many times a week. I&amp;#39;ll be talking about my mother, cousin, father, etc. and they&amp;#39;ll text/call me moments after I had just spoke about them. \nIt&amp;#39;s an eerie feeling, yet also intriguing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg8agfe", "score_hidden": false, "stickied": false, "created": 1492149172.0, "created_utc": 1492120372.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74fdx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AlphabetSoup101", "parent_id": "t3_652zzc", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "This happens to me and my cousin. I've thought about him a few times to have him text me in the next few hours. One time it was half an hour later. And we don't text very often. Also some other very small coincidences happened between me and him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This happens to me and my cousin. I&amp;#39;ve thought about him a few times to have him text me in the next few hours. One time it was half an hour later. And we don&amp;#39;t text very often. Also some other very small coincidences happened between me and him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg74fdx", "score_hidden": false, "stickied": false, "created": 1492085389.0, "created_utc": 1492056589.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_652zzc", "likes": null, "replies": "", "user_reports": [], "id": "dg7rvat", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kpshivers", "parent_id": "t3_652zzc", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Premonitions or gut feelings- that's what I call them. Had them happen both to me and vice versa. The one that sticks out is when my grandfather passed away from terminal cancer. We were on Christmas break during my junior year in college, so I hadn't seen my friend, B, in a week or more. She had no idea my grandfather had been admitted to the hospital a couple of days prior. My mom calls me about 8:00 am to tell me he passed away early that morning. At around 8:45 am my friend B calls me and asks what's wrong? I asked her what do you mean- she said I had an overwhelming feeling that something wasn't right and needed to call. I told her that my grandfather had passed. She said I knew something wasn't right. While she knew he was sick, and had been for sometime, and wasn't going to get better- none of my friends knew that he had been taken to the hospital and subsequently passed away. I didn't want to burden them during their Christmas break. \n\nAnother was when a friend of mine died in her sleep. She was a young mother and had aspirated on her own fluids due to a new medication making her sick to her stomach. Her 8 yr old daughter, S, found her that morning. I woke up unusually early that Friday ( I didn't work on Fridays and that was my day to sleep in), my husband asked me what was up and I told him I just had a feeling something wasn't right. I couldn't quite put my finger on it. At around 9:00 am my friend K called. I answered and she's was crying and her voice shaking. She said that S had found G, her mother, dead. I knew then what it was. Let me back up to the week before, my friend K, G and I were hanging out. It was getting late and G needed to get home. I walked her to her car to help her put some stuff in and she had this strange look on her face. She asked me- \"I'll see you next week, right?\" I said of course you will. She just looked at me and told me you're a good friend- don't forget that. I told her \"G, you're a good friend too and mother,now go home and be with S.\" She just had a look that I won't forget, not knowing at the time that a week later she would be gone. I made the remark to K that something was up with G. K said don't be silly she's fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Premonitions or gut feelings- that&amp;#39;s what I call them. Had them happen both to me and vice versa. The one that sticks out is when my grandfather passed away from terminal cancer. We were on Christmas break during my junior year in college, so I hadn&amp;#39;t seen my friend, B, in a week or more. She had no idea my grandfather had been admitted to the hospital a couple of days prior. My mom calls me about 8:00 am to tell me he passed away early that morning. At around 8:45 am my friend B calls me and asks what&amp;#39;s wrong? I asked her what do you mean- she said I had an overwhelming feeling that something wasn&amp;#39;t right and needed to call. I told her that my grandfather had passed. She said I knew something wasn&amp;#39;t right. While she knew he was sick, and had been for sometime, and wasn&amp;#39;t going to get better- none of my friends knew that he had been taken to the hospital and subsequently passed away. I didn&amp;#39;t want to burden them during their Christmas break. &lt;/p&gt;\n\n&lt;p&gt;Another was when a friend of mine died in her sleep. She was a young mother and had aspirated on her own fluids due to a new medication making her sick to her stomach. Her 8 yr old daughter, S, found her that morning. I woke up unusually early that Friday ( I didn&amp;#39;t work on Fridays and that was my day to sleep in), my husband asked me what was up and I told him I just had a feeling something wasn&amp;#39;t right. I couldn&amp;#39;t quite put my finger on it. At around 9:00 am my friend K called. I answered and she&amp;#39;s was crying and her voice shaking. She said that S had found G, her mother, dead. I knew then what it was. Let me back up to the week before, my friend K, G and I were hanging out. It was getting late and G needed to get home. I walked her to her car to help her put some stuff in and she had this strange look on her face. She asked me- &amp;quot;I&amp;#39;ll see you next week, right?&amp;quot; I said of course you will. She just looked at me and told me you&amp;#39;re a good friend- don&amp;#39;t forget that. I told her &amp;quot;G, you&amp;#39;re a good friend too and mother,now go home and be with S.&amp;quot; She just had a look that I won&amp;#39;t forget, not knowing at the time that a week later she would be gone. I made the remark to K that something was up with G. K said don&amp;#39;t be silly she&amp;#39;s fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg7rvat", "score_hidden": false, "stickied": false, "created": 1492128725.0, "created_utc": 1492099925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]