[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The other night I was at my mom&amp;#39;s house and she was cooking a chicken. She took it out of the oven, carved it up, put the meat on a plate for her and my dad to eat later (dad wasn&amp;#39;t home). There was a wishbone on it so she broke it off and placed it on a counter top. My mom then took a nap. I remember looking over at this wishbone throughout the next few hours (I was working on my laptop) as it was right beside me and looked kind of greasy; was worried about it falling on my jeans and leaving  a stain. Despite this I absolutely did not move it. An hour or so passes and I get up to do the dishes. Wishbone is definitely still there.&lt;/p&gt;\n\n&lt;p&gt;Another hour or so passes. Mom comes back into the kitchen after her nap. Stands in the doorway, looks over at me, confused. Wishbone is GONE. We searched the entire house (which is minimalist anyways, so not a lot of places for things to hide), even went through the trash can with gloves, but nope, nada, no wishbone. No pets. No guests. No trash compactor or chute. No dishwasher. No one that could&amp;#39;ve taken it. This was 5 days ago and it still hasn&amp;#39;t showed up.&lt;/p&gt;\n\n&lt;p&gt;This has been happening to me my whole life. Sometimes I&amp;#39;ve lost something, turned the house upside down looking for it, there&amp;#39;s literally &lt;em&gt;no where&lt;/em&gt; it could be and then it&amp;#39;s like some troll face in another dimension places it on my bed, where I have of course already looked.&lt;/p&gt;\n\n&lt;p&gt;TL;DR random objects disappear from my vicinity and then either stay missing or show back up someplace I already looked. Does this happen to anyone else?&lt;/p&gt;\n\n&lt;p&gt;UPDATE: Low and behold, I have indeed been trolled by the universe. The wishbone turned up. Was at my mom&amp;#39;s house again, no one has been there other than her and my dad in the last 7 days. Entire house has been cleaned/vacuumed very thoroughly during that time. I spent the whole day there yesterday sitting in the living room. My parents went out to dinner. I&amp;#39;m sitting at the desk, get up to go answer the door (pizza delivery). Realize halfway there that I&amp;#39;ve forgotten my money, so turn back to go get it from the desk.&lt;/p&gt;\n\n&lt;p&gt;I hear a snap under my foot. &lt;/p&gt;\n\n&lt;p&gt;Somehow, I&amp;#39;ve just stood on (and broken) the wishbone. It was literally laying in the middle of the living room floor, in the most obvious position possible; the same floor I spent the day walking back and forth across. I walked over that same spot multiple times, there was nothing there. It absolutely 100% was not there before. It can&amp;#39;t have come from my clothes. No blankets or cushions it could&amp;#39;ve fallen out from. It was as if someone just put it there in the time from me getting up to answer the door to me turning back for my wallet. And worst of all, I didn&amp;#39;t even get to make my freaking wish! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The other night I was at my mom's house and she was cooking a chicken. She took it out of the oven, carved it up, put the meat on a plate for her and my dad to eat later (dad wasn't home). There was a wishbone on it so she broke it off and placed it on a counter top. My mom then took a nap. I remember looking over at this wishbone throughout the next few hours (I was working on my laptop) as it was right beside me and looked kind of greasy; was worried about it falling on my jeans and leaving  a stain. Despite this I absolutely did not move it. An hour or so passes and I get up to do the dishes. Wishbone is definitely still there.\n\n Another hour or so passes. Mom comes back into the kitchen after her nap. Stands in the doorway, looks over at me, confused. Wishbone is GONE. We searched the entire house (which is minimalist anyways, so not a lot of places for things to hide), even went through the trash can with gloves, but nope, nada, no wishbone. No pets. No guests. No trash compactor or chute. No dishwasher. No one that could've taken it. This was 5 days ago and it still hasn't showed up.\n\nThis has been happening to me my whole life. Sometimes I've lost something, turned the house upside down looking for it, there's literally *no where* it could be and then it's like some troll face in another dimension places it on my bed, where I have of course already looked.\n\nTL;DR random objects disappear from my vicinity and then either stay missing or show back up someplace I already looked. Does this happen to anyone else?\n\nUPDATE: Low and behold, I have indeed been trolled by the universe. The wishbone turned up. Was at my mom's house again, no one has been there other than her and my dad in the last 7 days. Entire house has been cleaned/vacuumed very thoroughly during that time. I spent the whole day there yesterday sitting in the living room. My parents went out to dinner. I'm sitting at the desk, get up to go answer the door (pizza delivery). Realize halfway there that I've forgotten my money, so turn back to go get it from the desk.\n\nI hear a snap under my foot. \n\nSomehow, I've just stood on (and broken) the wishbone. It was literally laying in the middle of the living room floor, in the most obvious position possible; the same floor I spent the day walking back and forth across. I walked over that same spot multiple times, there was nothing there. It absolutely 100% was not there before. It can't have come from my clothes. No blankets or cushions it could've fallen out from. It was as if someone just put it there in the time from me getting up to answer the door to me turning back for my wallet. And worst of all, I didn't even get to make my freaking wish! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65d1kj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 57, "report_reasons": null, "author": "2008hot", "saved": false, "mod_reports": [], "name": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": 1492371687.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65d1kj/sometimes_things_disappear_and_never_return/", "num_reports": null, "locked": false, "stickied": false, "created": 1492211221.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65d1kj/sometimes_things_disappear_and_never_return/", "author_flair_text": null, "quarantine": false, "title": "Sometimes things disappear and never return", "created_utc": 1492182421.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 27, "visited": false, "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dga8azu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MOMwhatsmyUsername", "parent_id": "t1_dg9kjsn", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Too real.\nBasically everytime when cleaning my clothes, some socks vanish and never appear again. But the other pair stays behind, leaving me with lots of unmatching socks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Too real.\nBasically everytime when cleaning my clothes, some socks vanish and never appear again. But the other pair stays behind, leaving me with lots of unmatching socks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga8azu", "score_hidden": false, "stickied": false, "created": 1492256234.0, "created_utc": 1492227434.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9kjsn", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "RebelJustice", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Recently, my phone up and vanished within a 20 minute period of no one else around. It showed up ran over and on a street I don't drive on. It's impossible for anyone to have taken it and even if they had, it had my ID and Debit card in the case. They were not compromised. \n\nLately things have not been where they are supposed to be. And it's getting worse. I've had several things go missing and have yet to be found. Kinda makes me feel crazy but most of the time I'm just annoyed because ain't nobody got time to search for things we may never find. :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Recently, my phone up and vanished within a 20 minute period of no one else around. It showed up ran over and on a street I don&amp;#39;t drive on. It&amp;#39;s impossible for anyone to have taken it and even if they had, it had my ID and Debit card in the case. They were not compromised. &lt;/p&gt;\n\n&lt;p&gt;Lately things have not been where they are supposed to be. And it&amp;#39;s getting worse. I&amp;#39;ve had several things go missing and have yet to be found. Kinda makes me feel crazy but most of the time I&amp;#39;m just annoyed because ain&amp;#39;t nobody got time to search for things we may never find. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9kjsn", "score_hidden": false, "stickied": false, "created": 1492224818.0, "created_utc": 1492196018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dgbye2k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Thrumpledenoozitty", "parent_id": "t1_dg9v9th", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Yes, when they turn up again. Or when the missing thing turns up and a duplicate turns up (there are a few stories like that on here). Or when something is broken and discarded and turns up again much later fully intact somewhere else.\n\nI have a story I've told on here before, and it's long when told in its entirety, so I'll just give the TL;DR.\n\nLiving in a railroad apartment in NYC with my roommate and my cat. My set of keys (with a huge keychain on it, lots of baubles) goes missing right before I need to leave for work. I had it in my hand and then I didn't have it, within a matter of minutes. Roommate and I tear up the apartment looking for it, pockets, purses, couch cushions, all of it. She leaves. I can't leave without locking the doors so I call landlady who comes to *replace the locks*. Obviously I'm late for work.\n\nEntire keychain is later found (by me) in the bathtub.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, when they turn up again. Or when the missing thing turns up and a duplicate turns up (there are a few stories like that on here). Or when something is broken and discarded and turns up again much later fully intact somewhere else.&lt;/p&gt;\n\n&lt;p&gt;I have a story I&amp;#39;ve told on here before, and it&amp;#39;s long when told in its entirety, so I&amp;#39;ll just give the TL;DR.&lt;/p&gt;\n\n&lt;p&gt;Living in a railroad apartment in NYC with my roommate and my cat. My set of keys (with a huge keychain on it, lots of baubles) goes missing right before I need to leave for work. I had it in my hand and then I didn&amp;#39;t have it, within a matter of minutes. Roommate and I tear up the apartment looking for it, pockets, purses, couch cushions, all of it. She leaves. I can&amp;#39;t leave without locking the doors so I call landlady who comes to &lt;em&gt;replace the locks&lt;/em&gt;. Obviously I&amp;#39;m late for work.&lt;/p&gt;\n\n&lt;p&gt;Entire keychain is later found (by me) in the bathtub.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbye2k", "score_hidden": false, "stickied": false, "created": 1492372419.0, "created_utc": 1492343619.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9v9th", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "answersfromthegreat", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "What's weirder to me is when they reappear.  \n\nFor example, I had a girl spend the night once right as I was getting a new apartment. Very few items in my place.  We're getting into bed, and she takes off her earrings.  One of them falls onto the floor, and we hear it hit the hardwood.  \n\nWe look for 15 minutes, tearing the bed apart and find nothing.  At this point I literally had a mattress on the ground of an empty bedroom.  There was nowhere for the earring to hide.  And yet it disappeared.  \n\nSo the girl goes to the kitchen and puts her other earring on a counter for safe keeping and we shrug it off.  The next morning, the other earring is missing.  She tells me to text her if they turn up. \n\nSure enough, about a week later, both earrings are sitting on the counter where she left the second one.  \n\nI also once had a stomach ache, went looking for some tums.  They weren't in the medicine cabinet I thought I put them in.  I'm next to a drug store, so I figured I'd just go grab another bottle. I go buy another one, and when I get back, there's the bottle of tums sitting in the cabinet.  I now have two bottles of tums.  \n\nAnother time, again right after I moved into this new place, I was looking for a bottle of cleaner I was certain was under the sink.  All that was under there was a box of tissues and a roll of clorox wipes. Nothing else.  I went around the house looking for the bottle, and couldn't find it.  Later that night, I went back into the bathroom, and there's the bottle underneath the sink.  \n\nBizarre stuff.  I'm convinced it happens just to remind us that this existence is a mystery. There is more than meets the eye to our universe, and not everything can be explained rationally.  \n\nThat, or we're a simulation without a lot of RAM power.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s weirder to me is when they reappear.  &lt;/p&gt;\n\n&lt;p&gt;For example, I had a girl spend the night once right as I was getting a new apartment. Very few items in my place.  We&amp;#39;re getting into bed, and she takes off her earrings.  One of them falls onto the floor, and we hear it hit the hardwood.  &lt;/p&gt;\n\n&lt;p&gt;We look for 15 minutes, tearing the bed apart and find nothing.  At this point I literally had a mattress on the ground of an empty bedroom.  There was nowhere for the earring to hide.  And yet it disappeared.  &lt;/p&gt;\n\n&lt;p&gt;So the girl goes to the kitchen and puts her other earring on a counter for safe keeping and we shrug it off.  The next morning, the other earring is missing.  She tells me to text her if they turn up. &lt;/p&gt;\n\n&lt;p&gt;Sure enough, about a week later, both earrings are sitting on the counter where she left the second one.  &lt;/p&gt;\n\n&lt;p&gt;I also once had a stomach ache, went looking for some tums.  They weren&amp;#39;t in the medicine cabinet I thought I put them in.  I&amp;#39;m next to a drug store, so I figured I&amp;#39;d just go grab another bottle. I go buy another one, and when I get back, there&amp;#39;s the bottle of tums sitting in the cabinet.  I now have two bottles of tums.  &lt;/p&gt;\n\n&lt;p&gt;Another time, again right after I moved into this new place, I was looking for a bottle of cleaner I was certain was under the sink.  All that was under there was a box of tissues and a roll of clorox wipes. Nothing else.  I went around the house looking for the bottle, and couldn&amp;#39;t find it.  Later that night, I went back into the bathroom, and there&amp;#39;s the bottle underneath the sink.  &lt;/p&gt;\n\n&lt;p&gt;Bizarre stuff.  I&amp;#39;m convinced it happens just to remind us that this existence is a mystery. There is more than meets the eye to our universe, and not everything can be explained rationally.  &lt;/p&gt;\n\n&lt;p&gt;That, or we&amp;#39;re a simulation without a lot of RAM power.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9v9th", "score_hidden": false, "stickied": false, "created": 1492238152.0, "created_utc": 1492209352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dg9gsc4", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "rainbeams", "parent_id": "t1_dg9f32q", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I had a very similar incident when I was thirteen. I was in the car with my mom on the way home from school. She was fiddling with her engagement ring and wedding band at a red light. She accidentally knocks the diamond and sapphire ring off her finger. She was about to reach down and get it but the light turned green. It was the last light before we got home and she didn't worry.\nI watched the ring fall straight down. We both thought it would be on the floor.\nIt was not there. We swept and vacuumed the car, swept the carport, and even a couple years later had handy men take pull up the rug and steering wheel.\nThirteen years later we still don't know what happened to her ring.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a very similar incident when I was thirteen. I was in the car with my mom on the way home from school. She was fiddling with her engagement ring and wedding band at a red light. She accidentally knocks the diamond and sapphire ring off her finger. She was about to reach down and get it but the light turned green. It was the last light before we got home and she didn&amp;#39;t worry.\nI watched the ring fall straight down. We both thought it would be on the floor.\nIt was not there. We swept and vacuumed the car, swept the carport, and even a couple years later had handy men take pull up the rug and steering wheel.\nThirteen years later we still don&amp;#39;t know what happened to her ring.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9gsc4", "score_hidden": false, "stickied": false, "created": 1492220364.0, "created_utc": 1492191564.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dga7knb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cockygiftedguy", "parent_id": "t1_dg9f32q", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Exactly the same happened to me with a nintendo DS cartridge. It fell under huge bookcase, looked for it almost every day for 4 years till I moved out of the house. Club Penguin: Herbert's Revenge is still to appear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly the same happened to me with a nintendo DS cartridge. It fell under huge bookcase, looked for it almost every day for 4 years till I moved out of the house. Club Penguin: Herbert&amp;#39;s Revenge is still to appear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga7knb", "score_hidden": false, "stickied": false, "created": 1492255080.0, "created_utc": 1492226280.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9f32q", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Thrumpledenoozitty", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I think almost everyone has a story about this. There's a related phenomenon which is objects turning up which do not belong (coins, cutlery, etc.) These are generally termed \"apports\". A guy I know calls this a \"trickster spirit\" phenomenon and I'm inclined to agree. It's usually harmless, but baffling and occasionally humorous.\n\nI once watched my favorite ring roll under my bookcase after I dropped it while taking it off. No worries, I just thought I'd look under there and fish it out. When I looked it wasn't there. So I moved the entire bookcase out from the wall. Nada. Started crawling around on my hands and knees looking everywhere for it. I'd actually *seen* it roll under the bookcase, so I knew it couldn't possibly be far, but I couldn't find it anywhere. This was during our packing process for moving house. Over the next week or so I ended up packing my entire room up, watching carefully for the ring, and eventually it was completely empty. Never did find my ring. That was 22 years ago.\n\nIf anyone out there has found a silver handmade Eye of Horus ring, do please let me know.\n\nA student of mine had a similar story: She was in her dorm room at college, alone, and had made a cup of tea, leaving the spoon in it. She took the cup and a book and sat on her bed, placing the cup on the side table. A short time later she heard (rather than saw) the spoon clatter to the floor, which was confusing because it had been actually *in* the cup, so she was surprised it had somehow leaped out on its own. She obviously looked for it on the floor, didn't see it, got down and looked under the bed and adjacent furniture, and never found it.\n\nAnother student had a story of a pair of children's pants showing up on her dorm room bed, neatly laid out as if someone were going to put them on. Obviously no children lived at the dorm, it was just college students.\n\nBoth these things happened in China where younger people are less given to superstition and paranormal beliefs than in Western countries.\n\nEdit: I want to add that I wonder if somewhere a spoon has turned up out of the blue, and elsewhere a pair of children's pants has gone missing unexpectedly. And of course if someone has come across a random greasy wishbone and thought, \"WTF???\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think almost everyone has a story about this. There&amp;#39;s a related phenomenon which is objects turning up which do not belong (coins, cutlery, etc.) These are generally termed &amp;quot;apports&amp;quot;. A guy I know calls this a &amp;quot;trickster spirit&amp;quot; phenomenon and I&amp;#39;m inclined to agree. It&amp;#39;s usually harmless, but baffling and occasionally humorous.&lt;/p&gt;\n\n&lt;p&gt;I once watched my favorite ring roll under my bookcase after I dropped it while taking it off. No worries, I just thought I&amp;#39;d look under there and fish it out. When I looked it wasn&amp;#39;t there. So I moved the entire bookcase out from the wall. Nada. Started crawling around on my hands and knees looking everywhere for it. I&amp;#39;d actually &lt;em&gt;seen&lt;/em&gt; it roll under the bookcase, so I knew it couldn&amp;#39;t possibly be far, but I couldn&amp;#39;t find it anywhere. This was during our packing process for moving house. Over the next week or so I ended up packing my entire room up, watching carefully for the ring, and eventually it was completely empty. Never did find my ring. That was 22 years ago.&lt;/p&gt;\n\n&lt;p&gt;If anyone out there has found a silver handmade Eye of Horus ring, do please let me know.&lt;/p&gt;\n\n&lt;p&gt;A student of mine had a similar story: She was in her dorm room at college, alone, and had made a cup of tea, leaving the spoon in it. She took the cup and a book and sat on her bed, placing the cup on the side table. A short time later she heard (rather than saw) the spoon clatter to the floor, which was confusing because it had been actually &lt;em&gt;in&lt;/em&gt; the cup, so she was surprised it had somehow leaped out on its own. She obviously looked for it on the floor, didn&amp;#39;t see it, got down and looked under the bed and adjacent furniture, and never found it.&lt;/p&gt;\n\n&lt;p&gt;Another student had a story of a pair of children&amp;#39;s pants showing up on her dorm room bed, neatly laid out as if someone were going to put them on. Obviously no children lived at the dorm, it was just college students.&lt;/p&gt;\n\n&lt;p&gt;Both these things happened in China where younger people are less given to superstition and paranormal beliefs than in Western countries.&lt;/p&gt;\n\n&lt;p&gt;Edit: I want to add that I wonder if somewhere a spoon has turned up out of the blue, and elsewhere a pair of children&amp;#39;s pants has gone missing unexpectedly. And of course if someone has come across a random greasy wishbone and thought, &amp;quot;WTF???&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9f32q", "score_hidden": false, "stickied": false, "created": 1492218394.0, "created_utc": 1492189594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dg9u5bn", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Poppacap080", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Here's my disappearance my story. I have a mirror--big, rectangular and old with a very very small gap between the glass and wood. It's like my shrine, I put all sorts of pictures, and knickknacks around it. I have two casino chips that I keep there too but I found a way to wedge them into the small crack. These were STUCK, and I mean stuck with nowhere to go. One was green for a higher value and one was red for a lower value. One day I'm at the mirror making sure I don't look like crap before going out and look down and the red chip is gone. No way. Like I said this thing is solid, no cracks, no way out and the chip was jammed in there. I ruled out robbery because what idiot would only take the lower value chip, plus I had money and jewelry on the table in front of it. I'm waiting to find it on my bed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s my disappearance my story. I have a mirror--big, rectangular and old with a very very small gap between the glass and wood. It&amp;#39;s like my shrine, I put all sorts of pictures, and knickknacks around it. I have two casino chips that I keep there too but I found a way to wedge them into the small crack. These were STUCK, and I mean stuck with nowhere to go. One was green for a higher value and one was red for a lower value. One day I&amp;#39;m at the mirror making sure I don&amp;#39;t look like crap before going out and look down and the red chip is gone. No way. Like I said this thing is solid, no cracks, no way out and the chip was jammed in there. I ruled out robbery because what idiot would only take the lower value chip, plus I had money and jewelry on the table in front of it. I&amp;#39;m waiting to find it on my bed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9u5bn", "score_hidden": false, "stickied": false, "created": 1492236649.0, "created_utc": 1492207849.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dganwj4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Soninuva", "parent_id": "t1_dga362t", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Same here! I'm have OCD tendencies, and so have a place for just about everything, and so never lose things on my own. Yet things have inexplicably disappeared from spots that I know they were, and often times that nobody else has access to. For example, I'm the only one with access to my room, as I keep it locked when I'm not in it (and most of the time when I am as well), and am the only one with a key. One time, as I was putting my graduation ring away, I dropped it, and it seemed to roll under a cabinet. I searched for it, but couldn't find it. The next day, I moved it, and all the surrounding furniture, but it was nowhere to be found. That was almost 4 years ago. This story is one of the more uncommon ones for me. Some things disappear, and never return. \n\nMost of the time, though, they vanish, then turn up, usually at a later date, but sometimes the same day. I don't live alone, but nobody would mess with my things, even if they had the means, which in almost every instance, they do not. I've had things vanish from a sparse cabinet with everyone accounted for well away from it in the timespan from when I last saw it, to me noticing it missing, then reappear in my room (which nobody has access to). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same here! I&amp;#39;m have OCD tendencies, and so have a place for just about everything, and so never lose things on my own. Yet things have inexplicably disappeared from spots that I know they were, and often times that nobody else has access to. For example, I&amp;#39;m the only one with access to my room, as I keep it locked when I&amp;#39;m not in it (and most of the time when I am as well), and am the only one with a key. One time, as I was putting my graduation ring away, I dropped it, and it seemed to roll under a cabinet. I searched for it, but couldn&amp;#39;t find it. The next day, I moved it, and all the surrounding furniture, but it was nowhere to be found. That was almost 4 years ago. This story is one of the more uncommon ones for me. Some things disappear, and never return. &lt;/p&gt;\n\n&lt;p&gt;Most of the time, though, they vanish, then turn up, usually at a later date, but sometimes the same day. I don&amp;#39;t live alone, but nobody would mess with my things, even if they had the means, which in almost every instance, they do not. I&amp;#39;ve had things vanish from a sparse cabinet with everyone accounted for well away from it in the timespan from when I last saw it, to me noticing it missing, then reappear in my room (which nobody has access to). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dganwj4", "score_hidden": false, "stickied": false, "created": 1492293253.0, "created_utc": 1492264453.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga362t", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "xLilac", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Over the years things just up and disappear in my house. Sometimes they appear months or even years later in places we would have seen them. I've dropped things and heard them hit the ground or even seen hit the floor and roll out of sight only to never be able to find them no matter how hard I search. We've also found things that aren't ours just sitting around our house, clothing, cutlery that doesn't match ours, I even once found a woman's ring just sitting inside of a dish in the cabinet (I hate rings and have never bought/received one in my life). It's something I think is just normal but it really makes me wonder if things just fall into a void then come out of another somewhere else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Over the years things just up and disappear in my house. Sometimes they appear months or even years later in places we would have seen them. I&amp;#39;ve dropped things and heard them hit the ground or even seen hit the floor and roll out of sight only to never be able to find them no matter how hard I search. We&amp;#39;ve also found things that aren&amp;#39;t ours just sitting around our house, clothing, cutlery that doesn&amp;#39;t match ours, I even once found a woman&amp;#39;s ring just sitting inside of a dish in the cabinet (I hate rings and have never bought/received one in my life). It&amp;#39;s something I think is just normal but it really makes me wonder if things just fall into a void then come out of another somewhere else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga362t", "score_hidden": false, "stickied": false, "created": 1492248749.0, "created_utc": 1492219949.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dga5d5k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kpshivers", "parent_id": "t1_dga4cgz", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I had this happen in a similar fashion as I too was gone from home for several weeks. We work out of state and are gone from weeks to months at a time. I have an art studio at my home and have several pieces of varying equipment in there. Upon returning home, I found that one of my machines I use for cutting, has sprouted legs and left. This machine weighs about 2lbs and is about 10 inches long. We have a home security system and video monitoring so I know we weren't burglarized, and that's the ONLY thing missing. Why would anyone take this specialized piece and not anything of significant value. It was in a studio that had a computer and there were several other electronics of greater value. That was about a year ago and it still has not turned up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had this happen in a similar fashion as I too was gone from home for several weeks. We work out of state and are gone from weeks to months at a time. I have an art studio at my home and have several pieces of varying equipment in there. Upon returning home, I found that one of my machines I use for cutting, has sprouted legs and left. This machine weighs about 2lbs and is about 10 inches long. We have a home security system and video monitoring so I know we weren&amp;#39;t burglarized, and that&amp;#39;s the ONLY thing missing. Why would anyone take this specialized piece and not anything of significant value. It was in a studio that had a computer and there were several other electronics of greater value. That was about a year ago and it still has not turned up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga5d5k", "score_hidden": false, "stickied": false, "created": 1492251857.0, "created_utc": 1492223057.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4cgz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "rocktogether", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "When I was young, I was getting ready to go on tour with my band. At the time I wore glasses sometimes, (like to read the board in class) but figured I would not need them on tour. I put them on top of my stereo speaker locked up and left for two weeks. No one had a key to my home. Nothing was stolen as if someone had broken in. My glasses were not on the speaker when I got home, and they were never found, even when I packed up and moved out.\n\nOn the other side of all this. There is an accessory for playing guitar called a capo. It is small and can fit in your hand. Although I play guitar I have never bought, owned, or used one. I came home one day, and there was one on the floor of my garage. No one had visited, I had never had friends over to jam. It just appeared out of nowhere. I guess somewhere there is someone who's capo went missing to thin air.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was young, I was getting ready to go on tour with my band. At the time I wore glasses sometimes, (like to read the board in class) but figured I would not need them on tour. I put them on top of my stereo speaker locked up and left for two weeks. No one had a key to my home. Nothing was stolen as if someone had broken in. My glasses were not on the speaker when I got home, and they were never found, even when I packed up and moved out.&lt;/p&gt;\n\n&lt;p&gt;On the other side of all this. There is an accessory for playing guitar called a capo. It is small and can fit in your hand. Although I play guitar I have never bought, owned, or used one. I came home one day, and there was one on the floor of my garage. No one had visited, I had never had friends over to jam. It just appeared out of nowhere. I guess somewhere there is someone who&amp;#39;s capo went missing to thin air.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga4cgz", "score_hidden": false, "stickied": false, "created": 1492250363.0, "created_utc": 1492221563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dgaob8c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Soninuva", "parent_id": "t1_dga822s", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "That's disturbing, yet a more logical explanation than most. I've considered this, but have no way of testing it, as things tend to vanish unexpectedly. Some vanish shortly after I've seen them last, but most vanish after a few days or so. That would make sense for me, given that there is often no one but myself with access to the items, and I'm meticulous enough to know that I didn't simply misplace them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s disturbing, yet a more logical explanation than most. I&amp;#39;ve considered this, but have no way of testing it, as things tend to vanish unexpectedly. Some vanish shortly after I&amp;#39;ve seen them last, but most vanish after a few days or so. That would make sense for me, given that there is often no one but myself with access to the items, and I&amp;#39;m meticulous enough to know that I didn&amp;#39;t simply misplace them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgaob8c", "score_hidden": false, "stickied": false, "created": 1492293961.0, "created_utc": 1492265161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga822s", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "rws8w4", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Multiple personalities disorder. This personality as described is mischievous. Personalities can appear and disappear in brief amounts of time. You would never notice them. I recommend making yourself paranoid about something like the wishbone again and have someone observe you from a distance. Don't use a recording device because your other personality could disable it. Another person can record you though. Happy hunting. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Multiple personalities disorder. This personality as described is mischievous. Personalities can appear and disappear in brief amounts of time. You would never notice them. I recommend making yourself paranoid about something like the wishbone again and have someone observe you from a distance. Don&amp;#39;t use a recording device because your other personality could disable it. Another person can record you though. Happy hunting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga822s", "score_hidden": false, "stickied": false, "created": 1492255840.0, "created_utc": 1492227040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dgbsh6i", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "pixiedust3030", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "One time all of the forks on our silverware drawer vanished overnight. Totally gone. We had to go buy all new ones. We moved a year later. Never found them.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One time all of the forks on our silverware drawer vanished overnight. Totally gone. We had to go buy all new ones. We moved a year later. Never found them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbsh6i", "score_hidden": false, "stickied": false, "created": 1492353892.0, "created_utc": 1492325092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dga7xn2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "yonreadsthis", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "You and a bunch of other people.  There's even a name: \"disappearing object phenomenon.\" [Here's the results of a Google search on that term.](https://www.google.com/search?q=disappearing+object+phenomena&amp;ie=utf-8&amp;oe=utf-8#q=disappearing+object+phenomenon)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You and a bunch of other people.  There&amp;#39;s even a name: &amp;quot;disappearing object phenomenon.&amp;quot; &lt;a href=\"https://www.google.com/search?q=disappearing+object+phenomena&amp;amp;ie=utf-8&amp;amp;oe=utf-8#q=disappearing+object+phenomenon\"&gt;Here&amp;#39;s the results of a Google search on that term.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga7xn2", "score_hidden": false, "stickied": false, "created": 1492255650.0, "created_utc": 1492226850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dgbqkr0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "shinylys", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "My aunt (technically cousin, but I've known her as my aunt since she's as old as my mom??) told me about a couple of experiences like this she had when she was a teenager. \nThe first thing was that my grandma gave her a ring when she turned fifteen. She always wore it, but one day when she took it off to do something, and she found it had disappeared. She searched every inch of the house with her mom and absolutely could not find it.\nAbout a year later she was getting ready in her bathroom - here is the weird part - she felt a tug at the bottom of her pant leg. It startled her and when she looked down, her ring was on the floor. Completely impossible to have missed it.\nAnother time she was getting ready for school and had thrown a shirt she was going to wear on the bed. After turning her back for a moment, the shirt was gone. She searched her whole room for it and left the room briefly. When she came back, the shirt was layed out on her bed neatly as if someone had set it out for her. Needless to say it freaked her the fuck out. Due to tons of other experiences she had in the house, she believes it was a duende (gnome), which are believed by many in Mexican culture as plain fact. They like to fuck with people basically.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My aunt (technically cousin, but I&amp;#39;ve known her as my aunt since she&amp;#39;s as old as my mom??) told me about a couple of experiences like this she had when she was a teenager. \nThe first thing was that my grandma gave her a ring when she turned fifteen. She always wore it, but one day when she took it off to do something, and she found it had disappeared. She searched every inch of the house with her mom and absolutely could not find it.\nAbout a year later she was getting ready in her bathroom - here is the weird part - she felt a tug at the bottom of her pant leg. It startled her and when she looked down, her ring was on the floor. Completely impossible to have missed it.\nAnother time she was getting ready for school and had thrown a shirt she was going to wear on the bed. After turning her back for a moment, the shirt was gone. She searched her whole room for it and left the room briefly. When she came back, the shirt was layed out on her bed neatly as if someone had set it out for her. Needless to say it freaked her the fuck out. Due to tons of other experiences she had in the house, she believes it was a duende (gnome), which are believed by many in Mexican culture as plain fact. They like to fuck with people basically.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbqkr0", "score_hidden": false, "stickied": false, "created": 1492349522.0, "created_utc": 1492320722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dga1wbi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CastielAOTL", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Had the same thing happen to me only once with my first iPod. I put it down on the kitchen table. A day later, I went and got my headphones from it (unplugged them and took them to my computer). Literally an hour or two later, I go back to the table and it's gone. I was home alone. I still don't know how it happened.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Had the same thing happen to me only once with my first iPod. I put it down on the kitchen table. A day later, I went and got my headphones from it (unplugged them and took them to my computer). Literally an hour or two later, I go back to the table and it&amp;#39;s gone. I was home alone. I still don&amp;#39;t know how it happened.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga1wbi", "score_hidden": false, "stickied": false, "created": 1492246977.0, "created_utc": 1492218177.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dga3qds", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "32morgue", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I had box of matches that vanished in my hand...i had a bank card that was missing in my wallet and it showed up in the living room table...i knew it wasnt there before....there was a picture photo that vanished in my room and i looked all over and never found it..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had box of matches that vanished in my hand...i had a bank card that was missing in my wallet and it showed up in the living room table...i knew it wasnt there before....there was a picture photo that vanished in my room and i looked all over and never found it..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga3qds", "score_hidden": false, "stickied": false, "created": 1492249514.0, "created_utc": 1492220714.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dga7bpi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SelfPromotion101", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Happens all the time to me. I've just learned to go with the flow yo", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happens all the time to me. I&amp;#39;ve just learned to go with the flow yo&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga7bpi", "score_hidden": false, "stickied": false, "created": 1492254694.0, "created_utc": 1492225894.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dgaanm4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "7367Network", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "The house ghosts move things around to troll people. \nHappens to me as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The house ghosts move things around to troll people. \nHappens to me as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgaanm4", "score_hidden": false, "stickied": false, "created": 1492260208.0, "created_utc": 1492231408.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dgac6rn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Meep1996", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I had a sweater go missing and I looked for it everywhere and it was no where to be found. Months went by and I forgot about it. One day I open my drawer to get a shirt and it's sitting at the top. I had already gone through all my drawers and closet multiple times looking for it and it just appeared out of no where. It's happened multiple times so I joke with my mom that it's elves. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a sweater go missing and I looked for it everywhere and it was no where to be found. Months went by and I forgot about it. One day I open my drawer to get a shirt and it&amp;#39;s sitting at the top. I had already gone through all my drawers and closet multiple times looking for it and it just appeared out of no where. It&amp;#39;s happened multiple times so I joke with my mom that it&amp;#39;s elves. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgac6rn", "score_hidden": false, "stickied": false, "created": 1492263070.0, "created_utc": 1492234270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dgb4ny9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mellegardj", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I never remember throwing away Christmas cracker gifts. They just disappear randomly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never remember throwing away Christmas cracker gifts. They just disappear randomly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgb4ny9", "score_hidden": false, "stickied": false, "created": 1492316890.0, "created_utc": 1492288090.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dg9nkyv", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "StrawberryClaire", "parent_id": "t1_dg9m9d2", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "It's actually not too weird.  If you find someone you feel comfortable enough spending your life with and sharing everything with, it's not unusual to occasionally share the bathroom.  (I say, as my husband poops with the door open so he can keep talking to me.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s actually not too weird.  If you find someone you feel comfortable enough spending your life with and sharing everything with, it&amp;#39;s not unusual to occasionally share the bathroom.  (I say, as my husband poops with the door open so he can keep talking to me.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9nkyv", "score_hidden": false, "stickied": false, "created": 1492228476.0, "created_utc": 1492199676.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9m9d2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "radeese1", "parent_id": "t1_dg9i895", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Do you really poop in front of each other? That's insane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you really poop in front of each other? That&amp;#39;s insane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9m9d2", "score_hidden": false, "stickied": false, "created": 1492226887.0, "created_utc": 1492198087.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i895", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "itimedout", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I have a story, too. Was in my bathroom in front of the mirror putting on face lotion and dropped the cap. Heard it hit the floor, tick tick tick, saw that it had rolled behind the toilet (where my so was currently taking a poop, maybe tmi but he was there and heard it too so relevant, I guess) He reached behind the toilet but didn't come up with it so I looked but did not see it. He finished up, got on his hands and knees to look, then I did but we never found that stupid cap. I mean, we heard it and saw it then it just wasn't there anymore. I don't like talking or even thinking too much on it, it bugs the hell out of me and makes me think we are just living in the simulation but wtf does that even mean, right? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a story, too. Was in my bathroom in front of the mirror putting on face lotion and dropped the cap. Heard it hit the floor, tick tick tick, saw that it had rolled behind the toilet (where my so was currently taking a poop, maybe tmi but he was there and heard it too so relevant, I guess) He reached behind the toilet but didn&amp;#39;t come up with it so I looked but did not see it. He finished up, got on his hands and knees to look, then I did but we never found that stupid cap. I mean, we heard it and saw it then it just wasn&amp;#39;t there anymore. I don&amp;#39;t like talking or even thinking too much on it, it bugs the hell out of me and makes me think we are just living in the simulation but wtf does that even mean, right? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9i895", "score_hidden": false, "stickied": false, "created": 1492222042.0, "created_utc": 1492193242.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65d1kj", "likes": null, "replies": "", "user_reports": [], "id": "dg9qi0k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kizop", "parent_id": "t3_65d1kj", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Once not long ago I looked this up on the Ínternet and came up with this :\n\nhttp://blog.spiritualparadigm.org/consciousness/disappearing-objects-phenomenon-explanation/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Once not long ago I looked this up on the Ínternet and came up with this :&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://blog.spiritualparadigm.org/consciousness/disappearing-objects-phenomenon-explanation/\"&gt;http://blog.spiritualparadigm.org/consciousness/disappearing-objects-phenomenon-explanation/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9qi0k", "score_hidden": false, "stickied": false, "created": 1492231990.0, "created_utc": 1492203190.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]