[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have always been pretty intrigued by dreams since I was a child. As I&amp;#39;ve gotten older, had children, and entrenched in everyday life, I lost alot of the experiences I had enjoyed so much growing up (vivid dreams, false awakenings, lucid dreams). Also, I&amp;#39;ve never been too into the freaky-deeky side of things (occult, paranormal, etc.) &lt;/p&gt;\n\n&lt;p&gt;Hoping to get my dreaming back, I followed the advice of the all-knowing internet and started keeping a dream journal. This is supposed to improve dream recall, and it worked! &lt;/p&gt;\n\n&lt;p&gt;Every now and then I&amp;#39;ll go back and review my journal and haphazardly try to think of the connection between my dream and what I was going through at the time. Sometimes my dreams were related to that day, or week, or just somthing I saw on TV. Other times, just pure random fantasies. This is all normal. &lt;/p&gt;\n\n&lt;p&gt;Then, this passed week there were a series that stood out immediatley and then again days after. Like I said before, I shy away from the paranormal and much rather science and provable logic. However these dreams seemed a good fit for a glitch_in_the_matrix-esque post. These are pulled directly from my journal. Real life events in (parenthesis).&lt;/p&gt;\n\n&lt;p&gt;3/28/17: I was driving an Suv down a highway, strangely I also saw a top view at some point and knew it was green with a sunroof. There was someone else in the car but I dont remember who it was. Suddenly, a big wall of dark gray clouds swept over the road, we drove into them. It was pouring rain and very windy. I could barely make out two tornadoes in all the commotion. They dissipated and all that was left was the sideways rain and clouds. I struggled to keep the car on the road. The wind kept pulling me toward the shoulder. Eventually it ended and i drove out of the storm nervous but worried about where the tornadoes touched down.\n     -(3/29/17 evening there was a series of strong thunderstorms thay swept through the area. There was big fuss ln the news about the dangers of them that afternoon. I had to drive through them on the way home from work. It was very intense, but I did not have trouble driving and saw no tornadoes. However, there was at least one tornadoe that resulted from the storm, causing damage about 40 miles North of me. Note: T-storms very common here. Tornadoes very rare.)&lt;/p&gt;\n\n&lt;p&gt;3/28/17: I was some distance away from a chemical plant and noticed that there was a large fire, isolated to one part of the plant. I watched it, and worried about the workers inside and debated with myself whether to call 911. I decided not to when I noticed firetrucks that appeared after the thought.\n     -(3/29/17 mid-day there was a fire at work. It was a decent size. I extinguished it, had I not noticed it, it may have become much more serious. ------details from my notes ommited for privacy)&lt;/p&gt;\n\n&lt;p&gt;4/4/17: A member of my wifes family came to us and asked us to decide which house of her two we would like to have. We toured both of them. I could not decide and explained that it was too stressfull to decide at the moment.\n     -(4/5/17 Approx 15mins after waking from this dream the doorbell rings. It&amp;#39;s a private investigator working for a lawyer this family member hired. He has been trying to get in touch with her over a disputed will concerning a property. *disclaimer- I knew about this will and the dispute. But, it has been months since I&amp;#39;ve heard about it. And about as long since I&amp;#39;ve thought of it.)&lt;/p&gt;\n\n&lt;p&gt;4/6/17: I was at a buddies house sitting on the couch watching him put together some type of wooden contraption. There was a knock on the door. I answered it and it there was a black man standing there. He asked to come in saying he knew my buddy. He looked about 90% like Charlie Murphy, so I nervously asked if he was. He got offended and told me that he was not, but he was an actor and wouldn&amp;#39;t tell me his name. I left him at the door and told my buddy who said he was glad I didn&amp;#39;t invite him in because he didn&amp;#39;t know him. Then I got on the internet and researched Charlie Murphy look-alikes. I found a page for the guy at the door that said somthing along the lines of low level actor that had dissapeared from acting in recent years.\n     -(4/12/17: I saw news of Charlie Murphy&amp;#39;s death. Apparently lost a battle with leukemia. I can only attest for myself that I had no clue he was ever sick, unless it slipped in my mind subliminally. Also, I wasn&amp;#39;t a big fan or anything. The only thing I remember him from is the Chappelle Show years ago.)&lt;/p&gt;\n\n&lt;p&gt;Now these all coincidences that I would have brushed off easier if they had been spread apart. Or even so without the Charlie Murphy thing. I&amp;#39;ll probably never know for sure what caused the strange dreams, unless the trend continues. This is admittedly a very long, and perhaps, boring read. But, the primary reason for sharing isn&amp;#39;t for assessment or entertainment. I just wanted to share it and don&amp;#39;t want to get crazy looks from friends or family.&lt;/p&gt;\n\n&lt;p&gt;-RIP Charlie Murphy&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have always been pretty intrigued by dreams since I was a child. As I've gotten older, had children, and entrenched in everyday life, I lost alot of the experiences I had enjoyed so much growing up (vivid dreams, false awakenings, lucid dreams). Also, I've never been too into the freaky-deeky side of things (occult, paranormal, etc.) \n\nHoping to get my dreaming back, I followed the advice of the all-knowing internet and started keeping a dream journal. This is supposed to improve dream recall, and it worked! \n\nEvery now and then I'll go back and review my journal and haphazardly try to think of the connection between my dream and what I was going through at the time. Sometimes my dreams were related to that day, or week, or just somthing I saw on TV. Other times, just pure random fantasies. This is all normal. \n\nThen, this passed week there were a series that stood out immediatley and then again days after. Like I said before, I shy away from the paranormal and much rather science and provable logic. However these dreams seemed a good fit for a glitch_in_the_matrix-esque post. These are pulled directly from my journal. Real life events in (parenthesis).\n\n3/28/17: I was driving an Suv down a highway, strangely I also saw a top view at some point and knew it was green with a sunroof. There was someone else in the car but I dont remember who it was. Suddenly, a big wall of dark gray clouds swept over the road, we drove into them. It was pouring rain and very windy. I could barely make out two tornadoes in all the commotion. They dissipated and all that was left was the sideways rain and clouds. I struggled to keep the car on the road. The wind kept pulling me toward the shoulder. Eventually it ended and i drove out of the storm nervous but worried about where the tornadoes touched down.\n     -(3/29/17 evening there was a series of strong thunderstorms thay swept through the area. There was big fuss ln the news about the dangers of them that afternoon. I had to drive through them on the way home from work. It was very intense, but I did not have trouble driving and saw no tornadoes. However, there was at least one tornadoe that resulted from the storm, causing damage about 40 miles North of me. Note: T-storms very common here. Tornadoes very rare.)\n\n3/28/17: I was some distance away from a chemical plant and noticed that there was a large fire, isolated to one part of the plant. I watched it, and worried about the workers inside and debated with myself whether to call 911. I decided not to when I noticed firetrucks that appeared after the thought.\n     -(3/29/17 mid-day there was a fire at work. It was a decent size. I extinguished it, had I not noticed it, it may have become much more serious. ------details from my notes ommited for privacy)\n\n\n4/4/17: A member of my wifes family came to us and asked us to decide which house of her two we would like to have. We toured both of them. I could not decide and explained that it was too stressfull to decide at the moment.\n     -(4/5/17 Approx 15mins after waking from this dream the doorbell rings. It's a private investigator working for a lawyer this family member hired. He has been trying to get in touch with her over a disputed will concerning a property. *disclaimer- I knew about this will and the dispute. But, it has been months since I've heard about it. And about as long since I've thought of it.)\n\n4/6/17: I was at a buddies house sitting on the couch watching him put together some type of wooden contraption. There was a knock on the door. I answered it and it there was a black man standing there. He asked to come in saying he knew my buddy. He looked about 90% like Charlie Murphy, so I nervously asked if he was. He got offended and told me that he was not, but he was an actor and wouldn't tell me his name. I left him at the door and told my buddy who said he was glad I didn't invite him in because he didn't know him. Then I got on the internet and researched Charlie Murphy look-alikes. I found a page for the guy at the door that said somthing along the lines of low level actor that had dissapeared from acting in recent years.\n     -(4/12/17: I saw news of Charlie Murphy's death. Apparently lost a battle with leukemia. I can only attest for myself that I had no clue he was ever sick, unless it slipped in my mind subliminally. Also, I wasn't a big fan or anything. The only thing I remember him from is the Chappelle Show years ago.)\n\nNow these all coincidences that I would have brushed off easier if they had been spread apart. Or even so without the Charlie Murphy thing. I'll probably never know for sure what caused the strange dreams, unless the trend continues. This is admittedly a very long, and perhaps, boring read. But, the primary reason for sharing isn't for assessment or entertainment. I just wanted to share it and don't want to get crazy looks from friends or family.\n\n-RIP Charlie Murphy", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ddrl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "jesusaichchrist", "saved": false, "mod_reports": [], "name": "t3_65ddrl", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": 1492186181.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65ddrl/precognitive_dreamsand_charlie_murphy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492214664.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65ddrl/precognitive_dreamsand_charlie_murphy/", "author_flair_text": null, "quarantine": false, "title": "Precognitive dreams...and Charlie Murphy", "created_utc": 1492185864.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65ddrl", "likes": null, "replies": "", "user_reports": [], "id": "dg9pmd8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nicunta", "parent_id": "t3_65ddrl", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "When I was 9, my grandfather died. That night, amidst thundersnow, I had a dream of his funeral. Ten days later, his funeral was exactly as I dreamed, right down to the flowers I placed in his hands.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was 9, my grandfather died. That night, amidst thundersnow, I had a dream of his funeral. Ten days later, his funeral was exactly as I dreamed, right down to the flowers I placed in his hands.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9pmd8", "score_hidden": false, "stickied": false, "created": 1492230929.0, "created_utc": 1492202129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]