[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a true description of my glitch which occurred a couple of years ago, and one of the only few examples of a &amp;quot;glitch&amp;quot; that has ever occurred to me or at least has been strange enough to make me pay attention. &lt;/p&gt;\n\n&lt;p&gt;We owned and used to live in a 1900s Victorian street house, it was absolutely massive inside with lots of quirky original features.  When we moved in we renovated it, knocking a supporting wall down which ran parallel with our staircase.  we had to quickly patch up a few jobs just so they were tidy, one of which we put some horrid temporary wooden pine tounge and groove cladding against a side panel of a solid staircase.  it remained that way for a few years while we got the rest of the house finished - bathroom and kitchen etc. &lt;/p&gt;\n\n&lt;p&gt;When it came to redecorating one of my first jobs was that horrid cladding; removing it I decided to sand down the original wood underneith, we had kept all wood unpainted in the house which made it look very rustic.&lt;/p&gt;\n\n&lt;p&gt;The wood under cladding being over 100 years old was aged almost black, being the side of the base of the staircase it was thick solid wood (probably pine or oak) it was around 3inches thick and was around 20ft -25ft in length from top to bottom, to give better description, it is what the bannister/ballaudstrading rail sat on with spindles spaces evenly going up to the landing.  &lt;/p&gt;\n\n&lt;p&gt;I set to sanding it back to its former beauty, something which took hours and hours of energy, I had to even buy a new sander as the old one burned out, I also used loads of sanding pads, it was absolutely beautiful when completed and the wood underneith came up as if brand new, all the features of the wood grain were amazing, it was something you just couldn&amp;#39;t buy in the 21st century and if you could it would cost £££s, there was only one small problem when sanding the wood a large knot in the middles of the staircase about the size of a american silver dollar (so fairly big) had completely cumbled to dust (I saw this actually happen while I sanded). when i had to sand it, being so old and birttle, it left us with a massive hole in what was a beautiful feature bare wood feature to our room.  not really knowing what to do with it, especially it beig so big, I asked my wife what we were going to do, &amp;quot;wood filler&amp;quot; seemed to be the only option that would have worked, but lots of it would be needed.  Jokingly my wife said &amp;quot;we could buy a small toy mouse, cats toy and put that in it&amp;quot;, with it being so big.  &lt;/p&gt;\n\n&lt;p&gt;After I had finished, I started clearing up the area which was covered in saw dust from all the sanding, I swept up the sawdust including the crumbled pieces of knot, sanded to nothing more than a pile a crumbled wood fragments.&lt;/p&gt;\n\n&lt;p&gt;I took the dustpan to the back yard to empty it, only our wheelie bin wasn&amp;#39;t in yard, the street house we lived in only had rear courtyards with an alley which ran down the back of them, it wasn&amp;#39;t unusual for me to forget to bring in the wheeled bin in from the alley, partly because it was a pain in the arse unlocking the gate and bringing it onto our decking area.  &lt;/p&gt;\n\n&lt;p&gt;I put the dustpan down on the floor inside the yard, unlocked my back gate and opened it to retrieve my bin, to empty said dustpan.  Opening the gate &lt;em&gt;boom&lt;/em&gt; no. Not a bomb going off, but directly outside the door on the floor of the opened gate I noticed on the floor in front of me a small piece of wood, a knot! circular in shape, I picked it up and it resembled pretty much exactly what I had just seen deteriorate to dust when I had sanded it on the staircase, it was oval in shape and slightly angled, so not a perfect circle, just like the hole that was in my staircase. &lt;/p&gt;\n\n&lt;p&gt;I ran in the house with the knott in my hand and shouted my wife, both of us were puzzled thinking &amp;quot;what the fuck?&amp;quot; Scratching our heads, the knot of wood fit the hole and I&amp;#39;m not talking just closely fitted, it was as if it was the same fucking knot that had been sanded out, only lighter in colour of a different type of wood, almost an ash, it matched the staircase perfectly colour wise now sanded. P&lt;/p&gt;\n\n&lt;p&gt;Now I dont know about you but ive not came across many knots lying around on the floor before or since.  What hits me about this glitch is what are the chances of finding a knot of wood, but even more with the 99.9% same dimensions as one you have just minutes earlier sanded out, being outside a gate in an alley at that exact moment in time and fitting perfectly?  Anyway I put the piece of knot back in the staircase hole , it would have been silly not too and i imagine its still there to this day, I sold up in 2015.  Was it just a random bizarre coincidental incident or was It was one of those little nudges the universe gives you to take notice (I think it&amp;#39;s the latter)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is a true description of my glitch which occurred a couple of years ago, and one of the only few examples of a \"glitch\" that has ever occurred to me or at least has been strange enough to make me pay attention. \n\nWe owned and used to live in a 1900s Victorian street house, it was absolutely massive inside with lots of quirky original features.  When we moved in we renovated it, knocking a supporting wall down which ran parallel with our staircase.  we had to quickly patch up a few jobs just so they were tidy, one of which we put some horrid temporary wooden pine tounge and groove cladding against a side panel of a solid staircase.  it remained that way for a few years while we got the rest of the house finished - bathroom and kitchen etc. \n\nWhen it came to redecorating one of my first jobs was that horrid cladding; removing it I decided to sand down the original wood underneith, we had kept all wood unpainted in the house which made it look very rustic.\n\nThe wood under cladding being over 100 years old was aged almost black, being the side of the base of the staircase it was thick solid wood (probably pine or oak) it was around 3inches thick and was around 20ft -25ft in length from top to bottom, to give better description, it is what the bannister/ballaudstrading rail sat on with spindles spaces evenly going up to the landing.  \n\nI set to sanding it back to its former beauty, something which took hours and hours of energy, I had to even buy a new sander as the old one burned out, I also used loads of sanding pads, it was absolutely beautiful when completed and the wood underneith came up as if brand new, all the features of the wood grain were amazing, it was something you just couldn't buy in the 21st century and if you could it would cost £££s, there was only one small problem when sanding the wood a large knot in the middles of the staircase about the size of a american silver dollar (so fairly big) had completely cumbled to dust (I saw this actually happen while I sanded). when i had to sand it, being so old and birttle, it left us with a massive hole in what was a beautiful feature bare wood feature to our room.  not really knowing what to do with it, especially it beig so big, I asked my wife what we were going to do, \"wood filler\" seemed to be the only option that would have worked, but lots of it would be needed.  Jokingly my wife said \"we could buy a small toy mouse, cats toy and put that in it\", with it being so big.  \n\nAfter I had finished, I started clearing up the area which was covered in saw dust from all the sanding, I swept up the sawdust including the crumbled pieces of knot, sanded to nothing more than a pile a crumbled wood fragments.\n\n I took the dustpan to the back yard to empty it, only our wheelie bin wasn't in yard, the street house we lived in only had rear courtyards with an alley which ran down the back of them, it wasn't unusual for me to forget to bring in the wheeled bin in from the alley, partly because it was a pain in the arse unlocking the gate and bringing it onto our decking area.  \n\nI put the dustpan down on the floor inside the yard, unlocked my back gate and opened it to retrieve my bin, to empty said dustpan.  Opening the gate *boom* no. Not a bomb going off, but directly outside the door on the floor of the opened gate I noticed on the floor in front of me a small piece of wood, a knot! circular in shape, I picked it up and it resembled pretty much exactly what I had just seen deteriorate to dust when I had sanded it on the staircase, it was oval in shape and slightly angled, so not a perfect circle, just like the hole that was in my staircase. \n\n I ran in the house with the knott in my hand and shouted my wife, both of us were puzzled thinking \"what the fuck?\" Scratching our heads, the knot of wood fit the hole and I'm not talking just closely fitted, it was as if it was the same fucking knot that had been sanded out, only lighter in colour of a different type of wood, almost an ash, it matched the staircase perfectly colour wise now sanded. P\n\n  Now I dont know about you but ive not came across many knots lying around on the floor before or since.  What hits me about this glitch is what are the chances of finding a knot of wood, but even more with the 99.9% same dimensions as one you have just minutes earlier sanded out, being outside a gate in an alley at that exact moment in time and fitting perfectly?  Anyway I put the piece of knot back in the staircase hole , it would have been silly not too and i imagine its still there to this day, I sold up in 2015.  Was it just a random bizarre coincidental incident or was It was one of those little nudges the universe gives you to take notice (I think it's the latter)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65fuqm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "halph_gracie", "saved": false, "mod_reports": [], "name": "t3_65fuqm", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": 1492260154.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65fuqm/knot_in_wood_glitch/", "num_reports": null, "locked": false, "stickied": false, "created": 1492239738.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65fuqm/knot_in_wood_glitch/", "author_flair_text": null, "quarantine": false, "title": "Knot in wood Glitch", "created_utc": 1492210938.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": "", "user_reports": [], "id": "dgaiasa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "halph_gracie", "parent_id": "t1_dg9y0dm", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Sure It's on my drop box on my old Samsung I'll fish it out, I did video it too, but unfortunately that disappeared from the drop box, that adds to the mystery!  I will add we sold this house back in July 2015, pretty gutted about giving it up to be honest 😢 The house was 27 Camelon Street, Thornaby if you fancy looking on rightmove you can see all the original wooden features we kept on the property along with the yard (without bin showing 😂) and gate mentioned in post .  The occupier probs won't have even noticed the knot even though it is massive!", "edited": 1492259887.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure It&amp;#39;s on my drop box on my old Samsung I&amp;#39;ll fish it out, I did video it too, but unfortunately that disappeared from the drop box, that adds to the mystery!  I will add we sold this house back in July 2015, pretty gutted about giving it up to be honest 😢 The house was 27 Camelon Street, Thornaby if you fancy looking on rightmove you can see all the original wooden features we kept on the property along with the yard (without bin showing 😂) and gate mentioned in post .  The occupier probs won&amp;#39;t have even noticed the knot even though it is massive!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgaiasa", "score_hidden": false, "stickied": false, "created": 1492279511.0, "created_utc": 1492250711.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y0dm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "comatronic", "parent_id": "t3_65fuqm", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Can you provide a pic? You described the work so well I'd like to see how it turned out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you provide a pic? You described the work so well I&amp;#39;d like to see how it turned out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dg9y0dm", "score_hidden": false, "stickied": false, "created": 1492241800.0, "created_utc": 1492213000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": "", "user_reports": [], "id": "dgaicot", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "halph_gracie", "parent_id": "t1_dga0kmm", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Possible I suppose, but that makes even less sense than it being a glitch 😂How did it get outside the locked gate? Why wasn't the knot noticed when I swept up ? \nAlso  This was a vertical surface the knot deteriorated before my eyes I watched it crumble to nothing, I'm not saying This was in anyway some form of weird time loop or super natural phenomenon but that it's more than like just some super random coincidental incident, some would say synchronicity, that a knot of same dimensions being outside my gate at exactly that same time,", "edited": 1492259051.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Possible I suppose, but that makes even less sense than it being a glitch 😂How did it get outside the locked gate? Why wasn&amp;#39;t the knot noticed when I swept up ? \nAlso  This was a vertical surface the knot deteriorated before my eyes I watched it crumble to nothing, I&amp;#39;m not saying This was in anyway some form of weird time loop or super natural phenomenon but that it&amp;#39;s more than like just some super random coincidental incident, some would say synchronicity, that a knot of same dimensions being outside my gate at exactly that same time,&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgaicot", "score_hidden": false, "stickied": false, "created": 1492279681.0, "created_utc": 1492250881.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga0kmm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Nvidiator", "parent_id": "t3_65fuqm", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Sanding the staircase caused a vibration which allowed the knot to fall out which you did not notice.  This hole filled with sawdust as you sanded and made it appear as though you sanded it out as you came across it.  It was by chance that you found it again and recognized the shape for what it was.\n\nThis is only one possible explanation, I am a contractor and have seen stranger things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sanding the staircase caused a vibration which allowed the knot to fall out which you did not notice.  This hole filled with sawdust as you sanded and made it appear as though you sanded it out as you came across it.  It was by chance that you found it again and recognized the shape for what it was.&lt;/p&gt;\n\n&lt;p&gt;This is only one possible explanation, I am a contractor and have seen stranger things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga0kmm", "score_hidden": false, "stickied": false, "created": 1492245212.0, "created_utc": 1492216412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": "", "user_reports": [], "id": "dgbo3m4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t3_65fuqm", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I don't see how a knot in a wood wall would just fall out, vibration or no. Maybe if somebody had used a saw or something to cut around it, then it might fall out.  I don't see how you could be sanding a wall, a knot cleanly drop out, and you don't notice it. \n\nDid you glue in that knot you found, by the way? Because now this one might drop out, if there isn't anything holding it. ", "edited": 1492316473.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see how a knot in a wood wall would just fall out, vibration or no. Maybe if somebody had used a saw or something to cut around it, then it might fall out.  I don&amp;#39;t see how you could be sanding a wall, a knot cleanly drop out, and you don&amp;#39;t notice it. &lt;/p&gt;\n\n&lt;p&gt;Did you glue in that knot you found, by the way? Because now this one might drop out, if there isn&amp;#39;t anything holding it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbo3m4", "score_hidden": false, "stickied": false, "created": 1492345035.0, "created_utc": 1492316235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65fuqm", "likes": null, "replies": "", "user_reports": [], "id": "dgbih6x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yonreadsthis", "parent_id": "t1_dgal4r9", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Thank you!\n\nWhat a lot of work you did on that house.  Wow.  However, I, too, think the knot of wood landed in the saw dust and you just didn't notice it.  (Although it would be pleasant to think the house elves quickly made you a nice piece to put in the staircase wall.) ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n\n&lt;p&gt;What a lot of work you did on that house.  Wow.  However, I, too, think the knot of wood landed in the saw dust and you just didn&amp;#39;t notice it.  (Although it would be pleasant to think the house elves quickly made you a nice piece to put in the staircase wall.) ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbih6x", "score_hidden": false, "stickied": false, "created": 1492336462.0, "created_utc": 1492307662.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgal4r9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "halph_gracie", "parent_id": "t1_dga7i80", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Sorted hope it reads better now", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorted hope it reads better now&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgal4r9", "score_hidden": false, "stickied": false, "created": 1492287621.0, "created_utc": 1492258821.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7i80", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yonreadsthis", "parent_id": "t3_65fuqm", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Press Return twice to make paragraphs.  The wall of text is really too hard to read.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Press Return twice to make paragraphs.  The wall of text is really too hard to read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dga7i80", "score_hidden": false, "stickied": false, "created": 1492254974.0, "created_utc": 1492226174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]