[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just went in the shower.   I picked up a bar of soap from the soap dish on the side of the bath and put it on top of another bar of soap on the soap dish at the side of the shower.   &lt;/p&gt;\n\n&lt;p&gt;The bar I picked up is  clove soap.  It&amp;#39;s  dark brown, semi translucent and really gritty and there was maybe half a bar left.  The other bar is a regular cream bar of soap and bright orange and there was maybe a third of a bar left.   &lt;/p&gt;\n\n&lt;p&gt;I washed top half of my body with the clove soap, then washed my face with the other bar.  I washed my hair then picked up the clove soap to wash rest of my body.   I grabbed it without looking and as I went to work up a lather I realised it&amp;#39;s smaller and not gritty so &amp;#39;obviously&amp;#39; I had picked up the wrong soap.   I turned to swap it and noticed I  hadn&amp;#39;t picked up the wrong bar.  I had the clove soap in my hand.  It&amp;#39;s now down to maybe less than a quarter of a bar and totally not gritty.  Confused I looked at the bar of orange soap in the dish which is no longer about a third of a bar but a thin sliver.  I picked it up and couldn&amp;#39;t even turn it in my hands even though a few minutes before I had used it fine.  It was so small I just threw it in the bin.    It&amp;#39;s almost like I shot ahead a few days worth of showers and I&amp;#39;m actually a bit miffed as the clove soap costs around the same as 4 bars of the other stuff and the nearest supermarket that sells it is like 3 and half miles away!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just went in the shower.   I picked up a bar of soap from the soap dish on the side of the bath and put it on top of another bar of soap on the soap dish at the side of the shower.   \n\nThe bar I picked up is  clove soap.  It's  dark brown, semi translucent and really gritty and there was maybe half a bar left.  The other bar is a regular cream bar of soap and bright orange and there was maybe a third of a bar left.   \n\nI washed top half of my body with the clove soap, then washed my face with the other bar.  I washed my hair then picked up the clove soap to wash rest of my body.   I grabbed it without looking and as I went to work up a lather I realised it's smaller and not gritty so 'obviously' I had picked up the wrong soap.   I turned to swap it and noticed I  hadn't picked up the wrong bar.  I had the clove soap in my hand.  It's now down to maybe less than a quarter of a bar and totally not gritty.  Confused I looked at the bar of orange soap in the dish which is no longer about a third of a bar but a thin sliver.  I picked it up and couldn't even turn it in my hands even though a few minutes before I had used it fine.  It was so small I just threw it in the bin.    It's almost like I shot ahead a few days worth of showers and I'm actually a bit miffed as the clove soap costs around the same as 4 bars of the other stuff and the nearest supermarket that sells it is like 3 and half miles away!\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65iy06", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "weirdismylife", "saved": false, "mod_reports": [], "name": "t3_65iy06", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65iy06/soap_glitch/", "num_reports": null, "locked": false, "stickied": false, "created": 1492289838.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65iy06/soap_glitch/", "author_flair_text": null, "quarantine": false, "title": "Soap Glitch", "created_utc": 1492261038.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65iy06", "likes": null, "replies": "", "user_reports": [], "id": "dge87rq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "THEthatdude", "parent_id": "t3_65iy06", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Are you sure you didn't drop one of the soaps and that little sliver was left there, hidden by the two soaps on top of it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sure you didn&amp;#39;t drop one of the soaps and that little sliver was left there, hidden by the two soaps on top of it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dge87rq", "score_hidden": false, "stickied": false, "created": 1492496621.0, "created_utc": 1492467821.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]