[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I posted a glitch(?) before about an antique toy phone ringing as I walked away from it, here&amp;#39;s another little one from when I was fifteen&lt;/p&gt;\n\n&lt;p&gt;My parents are divorced and my dad is remarried. I used to visit him every other weekend. While I didn&amp;#39;t live there full time, I was at his house often enough (every other weekend for 8 years by the time this event occurred) that I obviously knew the house as well as my full-time house. My step-sister and I shared a room. All of our bedrooms were upstairs and the configuration was as follows:&lt;/p&gt;\n\n&lt;p&gt;At the top of the landing, directly ahead was the bathroom door. Immediately to the left of the bathroom door was my step-sister and I&amp;#39;s room, then on the wall to the left was the door to my step-brothers room. The door to my dad and step-mom&amp;#39;s room was to the right. So my step-sister and I&amp;#39;s door was on the same wall as the bathroom door, directly across from the top of the stairs, then the other two rooms were on the other two walls. &lt;/p&gt;\n\n&lt;p&gt;I was fifteen and spending NYE at my dad&amp;#39;s. I didn&amp;#39;t drink or do drugs at the time (waited until my twenties for that...) and was heading to bed around 10:30 because I had to work the next morning (horse farm, no holidays.) Everyone else was still up waiting for the countdown. I walked up the stairs and didn&amp;#39;t turn the light on, just crossed the landing into the bathroom and brushed my teeth and got ready for bed. I came out of the bathroom, opened the door to my sister and I&amp;#39;s room and froze in my tracks.&lt;/p&gt;\n\n&lt;p&gt;Everything in the room was different- I didn&amp;#39;t recognize anything. She and I had bunk beds for years and the same dresser and reading chair. I had been in our room just a few hours prior. I tried to rationalize it in any way I could, thinking, &amp;quot;Maybe they rearranged?&amp;quot; but even the furniture was different, not just rearranged. There was no bunk bed, just a low single bed and a small dresser, totally different from the long dresser that we shared. &lt;/p&gt;\n\n&lt;p&gt;Now, I hadn&amp;#39;t turned the light on, but there is a streetlamp right outside that illuminates the room, and there&amp;#39;s no way that even in darker circumstances I could mistake a bunk bed for a single bed and a dresser that should be 3x as big as the one that was in the room. &lt;/p&gt;\n\n&lt;p&gt;Thinking that maybe I&amp;#39;d accidentally opened the door to my step-brother&amp;#39;s room, even though it was on a totally different wall, because I didn&amp;#39;t know his furnishings as well, I stepped back in the doorframe and looked at the wall where his door should be. There was a door there, but it was closed. I looked back into our room, saw it was still different, and decided to backtrack to the bathroom. It was still where it should be and seemed the same as usual.&lt;/p&gt;\n\n&lt;p&gt;I went back to the bathroom, flipped the light on and sat on the toilet for a few minutes. I got up, went back to my step-sister and I&amp;#39;s room, looked in the door, and saw that it was the same as usual. So I went to bed, because what else do you do in that situation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I posted a glitch(?) before about an antique toy phone ringing as I walked away from it, here's another little one from when I was fifteen\n\nMy parents are divorced and my dad is remarried. I used to visit him every other weekend. While I didn't live there full time, I was at his house often enough (every other weekend for 8 years by the time this event occurred) that I obviously knew the house as well as my full-time house. My step-sister and I shared a room. All of our bedrooms were upstairs and the configuration was as follows:\n\nAt the top of the landing, directly ahead was the bathroom door. Immediately to the left of the bathroom door was my step-sister and I's room, then on the wall to the left was the door to my step-brothers room. The door to my dad and step-mom's room was to the right. So my step-sister and I's door was on the same wall as the bathroom door, directly across from the top of the stairs, then the other two rooms were on the other two walls. \n\nI was fifteen and spending NYE at my dad's. I didn't drink or do drugs at the time (waited until my twenties for that...) and was heading to bed around 10:30 because I had to work the next morning (horse farm, no holidays.) Everyone else was still up waiting for the countdown. I walked up the stairs and didn't turn the light on, just crossed the landing into the bathroom and brushed my teeth and got ready for bed. I came out of the bathroom, opened the door to my sister and I's room and froze in my tracks.\n\n Everything in the room was different- I didn't recognize anything. She and I had bunk beds for years and the same dresser and reading chair. I had been in our room just a few hours prior. I tried to rationalize it in any way I could, thinking, \"Maybe they rearranged?\" but even the furniture was different, not just rearranged. There was no bunk bed, just a low single bed and a small dresser, totally different from the long dresser that we shared. \n\nNow, I hadn't turned the light on, but there is a streetlamp right outside that illuminates the room, and there's no way that even in darker circumstances I could mistake a bunk bed for a single bed and a dresser that should be 3x as big as the one that was in the room. \n\nThinking that maybe I'd accidentally opened the door to my step-brother's room, even though it was on a totally different wall, because I didn't know his furnishings as well, I stepped back in the doorframe and looked at the wall where his door should be. There was a door there, but it was closed. I looked back into our room, saw it was still different, and decided to backtrack to the bathroom. It was still where it should be and seemed the same as usual.\n\nI went back to the bathroom, flipped the light on and sat on the toilet for a few minutes. I got up, went back to my step-sister and I's room, looked in the door, and saw that it was the same as usual. So I went to bed, because what else do you do in that situation?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kca3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "farleyyel", "saved": false, "mod_reports": [], "name": "t3_65kca3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65kca3/nye_my_room_was_different/", "num_reports": null, "locked": false, "stickied": false, "created": 1492306835.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65kca3/nye_my_room_was_different/", "author_flair_text": null, "quarantine": false, "title": "NYE my room was different", "created_utc": 1492278035.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65kca3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65kca3", "likes": null, "replies": "", "user_reports": [], "id": "dgb9kt6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "farleyyel", "parent_id": "t1_dgb7fry", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Not at all! It was a brand-new townhouse, built the year we moved in. Nothing weird ever happened there, except that. I've got no theories, other than I was really tired and maybe didn't have my own reality cemented strongly enough in my mind to go and find it waiting for me ahaha. Sounds kookoo, I know, but it's all I got.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not at all! It was a brand-new townhouse, built the year we moved in. Nothing weird ever happened there, except that. I&amp;#39;ve got no theories, other than I was really tired and maybe didn&amp;#39;t have my own reality cemented strongly enough in my mind to go and find it waiting for me ahaha. Sounds kookoo, I know, but it&amp;#39;s all I got.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgb9kt6", "score_hidden": false, "stickied": false, "created": 1492323683.0, "created_utc": 1492294883.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7fry", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BambiCrackhead", "parent_id": "t3_65kca3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "lol I love that ending! But that is really weird indeed... Although I've read a few stories on here that are similar. \nDo you have any kind of theory why this happened? Did anything else that seemed off happen in that house? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol I love that ending! But that is really weird indeed... Although I&amp;#39;ve read a few stories on here that are similar. \nDo you have any kind of theory why this happened? Did anything else that seemed off happen in that house? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgb7fry", "score_hidden": false, "stickied": false, "created": 1492320710.0, "created_utc": 1492291910.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65kca3", "likes": null, "replies": "", "user_reports": [], "id": "dgbkam8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t3_65kca3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Sheesh, I was trying to figure out who L was. Finally realized you meant \"my\" not l's.", "edited": 1492315593.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sheesh, I was trying to figure out who L was. Finally realized you meant &amp;quot;my&amp;quot; not l&amp;#39;s.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbkam8", "score_hidden": false, "stickied": false, "created": 1492339149.0, "created_utc": 1492310349.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65kca3", "likes": null, "replies": "", "user_reports": [], "id": "dgbezme", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Otayyy", "parent_id": "t3_65kca3", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Did you ask your family about it? Did they find it normal?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you ask your family about it? Did they find it normal?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbezme", "score_hidden": false, "stickied": false, "created": 1492331456.0, "created_utc": 1492302656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]