[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First off let&amp;#39;s start with the dream I had I went lucid while in my room I fly up through the ceiling flew up all the way into space kept flying for a bit everything around me looked like shooting stars I had originally aimed to get to the end of the universe but I stopped midway and around me were meteors and they had glowing crystals and gems in their holes, landed on one of them it flipped over a bit then I hear a voice in my head &amp;quot;Are you one of the travelers?&amp;quot; I turn around there is a white train behind me has white levitating squares on sides of it a little above it&amp;#39;s top Everything goes third person I try to get away the train shoots out a white shuttle and it catches me with robotic like hands and I could see myself being in a white capsule pulled into the train. The next thing I&amp;#39;m in what looks to be the village where I live however there is a farming field everywhere literally fucking everywhere there was an extra mountain also filled with fields there was some kind of an aircraft above me there were a few men who looked quite identical to each other and had marks on their face that look like rust, that&amp;#39;s as far as my dream goes here&amp;#39;s a dream I read about a month after I had this one it&amp;#39;s a person&amp;#39;s experience I read here&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.trickedbythelight.com/tbtl/aliens.shtml\"&gt;http://www.trickedbythelight.com/tbtl/aliens.shtml&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is according to what the person wrote an abduction by aliens however it has a few similarities with my dream\n&amp;quot;The first one I met was standing in a field behind a fence. It was very tall and lanky. It walked back and forth for a while sizing me up before it told me that I wasn&amp;#39;t ready and it told me to &amp;quot;do more.&amp;quot; I immediately woke up and knew I had to do more. I did. Then was brought right back to it. It took me in and brought me to some others that were equally tall and lanky, grey and emotionless. They put me in a bed that sort of felt like a bobsled. Pushed me down a track to where I met with some others who were identical to them but I was now in a lab. They shadowed me around, did the long term thing and then slid me down a track back to earth, and my consciousness, if you will.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I remember specifically that I &amp;quot;stood off to the side&amp;quot; and watched &amp;quot;stars&amp;quot; shoot across the landscape from left to right in my vision and was told that those were &amp;quot;space travelers&amp;quot; trying to make the transition from earth to the farms. They were all transitioning but at the time I was in a limbo because I was being shown how the traveling looked from an outside perspective. Almost like a college orientation. The only inner workings of life they explained at the time was that life and death were one in the same. Death wasn&amp;#39;t anything to be afraid of because basically it was the same as life. We were just assigned jobs. Life was a job on earth and after we &amp;quot;punch out&amp;quot; we end our shift and report back to these farms. No souls are ever lost after that, we are reassigned. I&amp;#39;m not sure how we are used as vessels. Maybe we are meant to spread some sort of knowledge on earth but we have to combat the desensitivity of our existence which is diluted from living on earth? Either way, the main thing they did to me before having me slide back into earth was replacing something in my mind and describing it as &amp;quot;long term&amp;quot;. Maybe one day, it&amp;#39;ll be triggered and I&amp;#39;ll know what to do with it. Maybe what I&amp;#39;m supposed to do with it is to remember that it happened. I&amp;#39;m not sure.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First off let's start with the dream I had I went lucid while in my room I fly up through the ceiling flew up all the way into space kept flying for a bit everything around me looked like shooting stars I had originally aimed to get to the end of the universe but I stopped midway and around me were meteors and they had glowing crystals and gems in their holes, landed on one of them it flipped over a bit then I hear a voice in my head \"Are you one of the travelers?\" I turn around there is a white train behind me has white levitating squares on sides of it a little above it's top Everything goes third person I try to get away the train shoots out a white shuttle and it catches me with robotic like hands and I could see myself being in a white capsule pulled into the train. The next thing I'm in what looks to be the village where I live however there is a farming field everywhere literally fucking everywhere there was an extra mountain also filled with fields there was some kind of an aircraft above me there were a few men who looked quite identical to each other and had marks on their face that look like rust, that's as far as my dream goes here's a dream I read about a month after I had this one it's a person's experience I read here\n\nhttp://www.trickedbythelight.com/tbtl/aliens.shtml\n\nThis is according to what the person wrote an abduction by aliens however it has a few similarities with my dream\n\"The first one I met was standing in a field behind a fence. It was very tall and lanky. It walked back and forth for a while sizing me up before it told me that I wasn't ready and it told me to \"do more.\" I immediately woke up and knew I had to do more. I did. Then was brought right back to it. It took me in and brought me to some others that were equally tall and lanky, grey and emotionless. They put me in a bed that sort of felt like a bobsled. Pushed me down a track to where I met with some others who were identical to them but I was now in a lab. They shadowed me around, did the long term thing and then slid me down a track back to earth, and my consciousness, if you will.\"\n\n\"I remember specifically that I \"stood off to the side\" and watched \"stars\" shoot across the landscape from left to right in my vision and was told that those were \"space travelers\" trying to make the transition from earth to the farms. They were all transitioning but at the time I was in a limbo because I was being shown how the traveling looked from an outside perspective. Almost like a college orientation. The only inner workings of life they explained at the time was that life and death were one in the same. Death wasn't anything to be afraid of because basically it was the same as life. We were just assigned jobs. Life was a job on earth and after we \"punch out\" we end our shift and report back to these farms. No souls are ever lost after that, we are reassigned. I'm not sure how we are used as vessels. Maybe we are meant to spread some sort of knowledge on earth but we have to combat the desensitivity of our existence which is diluted from living on earth? Either way, the main thing they did to me before having me slide back into earth was replacing something in my mind and describing it as \"long term\". Maybe one day, it'll be triggered and I'll know what to do with it. Maybe what I'm supposed to do with it is to remember that it happened. I'm not sure.\"", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65km3s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Naruto_1999", "saved": false, "mod_reports": [], "name": "t3_65km3s", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65km3s/i_had_a_dream_the_found_out_about_another_person/", "num_reports": null, "locked": false, "stickied": false, "created": 1492309783.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65km3s/i_had_a_dream_the_found_out_about_another_person/", "author_flair_text": null, "quarantine": false, "title": "I had a dream the found out about another person having the same dream", "created_utc": 1492280983.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65km3s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65km3s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65km3s", "likes": null, "replies": "", "user_reports": [], "id": "dgdu6q3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "astralrocker2001", "parent_id": "t1_dgd56gb", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "can you give us the details...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;can you give us the details...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgdu6q3", "score_hidden": false, "stickied": false, "created": 1492480430.0, "created_utc": 1492451630.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd56gb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hc84", "parent_id": "t1_dgbcg13", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "It's happened to me too. After my grandfather died, I described a dream to my mom, and she said she had the same dream too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s happened to me too. After my grandfather died, I described a dream to my mom, and she said she had the same dream too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgd56gb", "score_hidden": false, "stickied": false, "created": 1492434468.0, "created_utc": 1492405668.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcg13", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "astralrocker2001", "parent_id": "t3_65km3s", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Shared Dreams are rare, but definitely do exist...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shared Dreams are rare, but definitely do exist...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgbcg13", "score_hidden": false, "stickied": false, "created": 1492327870.0, "created_utc": 1492299070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65km3s", "likes": null, "replies": "", "user_reports": [], "id": "dgdu649", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "astralrocker2001", "parent_id": "t3_65km3s", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "The \"tricked by the light\" link in this story should be read by everyone. it is very important...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The &amp;quot;tricked by the light&amp;quot; link in this story should be read by everyone. it is very important...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgdu649", "score_hidden": false, "stickied": false, "created": 1492480413.0, "created_utc": 1492451613.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]