[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had a day where i had my ex was blocked for weeks, the day i unblocked it she called exactly on that day few hours later. I never had the feeling she&amp;#39;d call but it was just strange possibly a coincidence or glitch.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The day before my mom fell down as her last day at home before she died at the hospital. I had a strange omen the glass fell off my hand, I normally drink water everyday and i never ever drop it, it was such a strange omen as it was only the day where she fell down and she eventually died days later off that as a sign.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Sister was talking to her fiance over her phone via voice call as she slept, overtime she fell into a sleep state and was dreaming. She felt a heavy presence on her body in her dream as she was sleeping in her dream, she opens her eyes to look at what was there she saw a dark green leg on her legs, she felt a warm temperature on her body. she was too drowsy and just ignored it and went back to closing her eyes to sleep as she felt tired, later on she heard voices of her fiance trying to wake her up. And as she woke up she replied what? what do you want. I think my sisters messing around with me. she felt a sudden temprature change from warm to cold she ignored it and she said she&amp;#39;ll go back to bed.&lt;/p&gt;\n\n&lt;p&gt;Later on next morning her fiance calls her and tells her if everything is alright, she says everything is fine, and then he says i don&amp;#39;t want to freak you out but something was very weird that night.&lt;/p&gt;\n\n&lt;p&gt;She asked him what? She said overtime she fell asleep he could hear her breathing he knows her breathing every night as she sleeps through he knows the difference of the noises she makes and what her surroundings can make.&lt;/p&gt;\n\n&lt;p&gt;There was something else in her room there was something that&amp;#39;s noise was increasing ovetime he knew something else was in the room. It was scary and it didn&amp;#39;t feel right, as he woke her up the noise vanished completely. He told her that and she&amp;#39;s wondering what all this could mean?&lt;/p&gt;\n\n&lt;p&gt;Is she losing a leg? Will someone close to her lose a leg? or is she stepping on bad or good luck on the coming days? What does this omen mean? Is she going to get possessed by something?&lt;/p&gt;\n\n&lt;p&gt;Edit: forgot to mention my other sister is no longer home as she&amp;#39;s abroad&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've had a day where i had my ex was blocked for weeks, the day i unblocked it she called exactly on that day few hours later. I never had the feeling she'd call but it was just strange possibly a coincidence or glitch.\n\n---\n\nThe day before my mom fell down as her last day at home before she died at the hospital. I had a strange omen the glass fell off my hand, I normally drink water everyday and i never ever drop it, it was such a strange omen as it was only the day where she fell down and she eventually died days later off that as a sign.\n\n---\n\nSister was talking to her fiance over her phone via voice call as she slept, overtime she fell into a sleep state and was dreaming. She felt a heavy presence on her body in her dream as she was sleeping in her dream, she opens her eyes to look at what was there she saw a dark green leg on her legs, she felt a warm temperature on her body. she was too drowsy and just ignored it and went back to closing her eyes to sleep as she felt tired, later on she heard voices of her fiance trying to wake her up. And as she woke up she replied what? what do you want. I think my sisters messing around with me. she felt a sudden temprature change from warm to cold she ignored it and she said she'll go back to bed.\n\nLater on next morning her fiance calls her and tells her if everything is alright, she says everything is fine, and then he says i don't want to freak you out but something was very weird that night.\n\nShe asked him what? She said overtime she fell asleep he could hear her breathing he knows her breathing every night as she sleeps through he knows the difference of the noises she makes and what her surroundings can make.\n\nThere was something else in her room there was something that's noise was increasing ovetime he knew something else was in the room. It was scary and it didn't feel right, as he woke her up the noise vanished completely. He told her that and she's wondering what all this could mean?\n\nIs she losing a leg? Will someone close to her lose a leg? or is she stepping on bad or good luck on the coming days? What does this omen mean? Is she going to get possessed by something?\n\nEdit: forgot to mention my other sister is no longer home as she's abroad\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xvfp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "therewasguy", "saved": false, "mod_reports": [], "name": "t3_65xvfp", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65xvfp/3_weird_experiences_2_mine_1_sisters_possible/", "num_reports": null, "locked": false, "stickied": false, "created": 1492487248.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65xvfp/3_weird_experiences_2_mine_1_sisters_possible/", "author_flair_text": null, "quarantine": false, "title": "3 weird experiences. 2 mine 1 sisters possible glitch or just coincidence?", "created_utc": 1492458448.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65xvfp", "likes": null, "replies": "", "user_reports": [], "id": "dge7g0p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "THEthatdude", "parent_id": "t3_65xvfp", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "Might be sleep paralysis, imagining someone or something laying on you and you usually can't move. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Might be sleep paralysis, imagining someone or something laying on you and you usually can&amp;#39;t move. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dge7g0p", "score_hidden": false, "stickied": false, "created": 1492495643.0, "created_utc": 1492466843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]