[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I looked at the time, and it said 3:58. Time to head out the door. I started my 5 minute routine: I stood up, dropped my basketball shorts, pulled on cotton pants, and walked to the hallway. I put on my boots, which I keep tied at the ankle so that I can slip them off and on without tying. I walked to the kitchen to grab my motorcycle key, but it wasn&amp;#39;t there, so I returned to the bedroom (appx 60&amp;#39; distance). I picked up my purse, walked back to the kitchen, and looked at the clock. 4:17.&lt;/p&gt;\n\n&lt;p&gt;Shit, I think, my bedroom clock is 20 minutes slow. I go back to look, but it too says 4:17. I notice it is 4:17, 4/17/17. I say WHAT THE FUCK very loudly and pace in circles repeating wtf wtf. I have to go now but it was so fucking weird I immediately thought of this sub.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I looked at the time, and it said 3:58. Time to head out the door. I started my 5 minute routine: I stood up, dropped my basketball shorts, pulled on cotton pants, and walked to the hallway. I put on my boots, which I keep tied at the ankle so that I can slip them off and on without tying. I walked to the kitchen to grab my motorcycle key, but it wasn't there, so I returned to the bedroom (appx 60' distance). I picked up my purse, walked back to the kitchen, and looked at the clock. 4:17.\n\nShit, I think, my bedroom clock is 20 minutes slow. I go back to look, but it too says 4:17. I notice it is 4:17, 4/17/17. I say WHAT THE FUCK very loudly and pace in circles repeating wtf wtf. I have to go now but it was so fucking weird I immediately thought of this sub.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65z6jx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "spermface", "saved": false, "mod_reports": [], "name": "t3_65z6jx", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65z6jx/i_just_lost_20_minutes_walking_between_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492500437.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65z6jx/i_just_lost_20_minutes_walking_between_the/", "author_flair_text": null, "quarantine": false, "title": "I just lost 20 minutes walking between the kitchen and bedroom.", "created_utc": 1492471637.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65z6jx", "likes": null, "replies": "", "user_reports": [], "id": "dgeee5z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "THEthatdude", "parent_id": "t3_65z6jx", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "You'd be surprised how easily you can lose track of time. It happens to me quite often, it is a two minute walk from the house to my car, but I often have to leave ten minutes in advance, and when I actually finally get in the car those ten minutes are gone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;d be surprised how easily you can lose track of time. It happens to me quite often, it is a two minute walk from the house to my car, but I often have to leave ten minutes in advance, and when I actually finally get in the car those ten minutes are gone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgeee5z", "score_hidden": false, "stickied": false, "created": 1492504594.0, "created_utc": 1492475794.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tcwa", "removal_reason": null, "link_id": "t3_65z6jx", "likes": null, "replies": "", "user_reports": [], "id": "dgelzzx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "felioness", "parent_id": "t3_65z6jx", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "controversiality": 0, "body": "I experienced a time slip back in 1985 and GAINED time.\n\n I was driving from Sakatoon Sakatchewan, Canada to Regina Saskatchewan Canada. I have made the trip many times before. It is about 150 miles and takes between 2 to the hours to get there.  I was driving with a friend. He was sick with bronchitis.  I remember being upset with him for taking so long to get ready as I did not like to drive in the dark. We were going on to Minot North Dakota from there after we gassed up. It was late afternoon. I remember sitting in the car while he finally got all of his stuff  into the trunk.The radio was playing and the DJ said it was 4 o'clock. I told Michael we'd be driving in the dark and that I wasn't very happy about that. When we hit the road Michael fell asleep shortly after.  I remember two things as I drove ... it felt like the car was gliding slightly above the road because there was absolutely no road noise nor could I feel any road bumps as I drove. Everything felt strange.  I wanted to ask Michael if it felt like that to him too, but like I said, he was sick and in a deep sleep. Secondly everything felt weird. The interior of the car seemed muffled like being wrapped in cotton.  another thing, this is the Trans-Canada highway we were on, which us a major highway and it was August.  Typically this highway is extremely busy with tourists going camping or semi trailer trucks carrying loads or politicians and government employees going to and from Regina as it is the capital of Sakatchewan, but weirdly, ours was the only car on the road. \n\nWhen we reached Regina and pulled into the gas station I heard the DJ say it was 5 pm.  That was impossible! There is no way I could have made that trip in an hour! So I asked the gas attendant if there was a time difference between Saskatoon and Regina, knowing darn well there wasn't.  He looked at me like I was crazy and said \"no\". When I asked him how much for the gas he gave another strange look and said \"five bucks!\" I could not believe my ears. By this time Michael was awake and I told what had happened. He was flabbergasted. We tried to make sense of it but could not. Somehow we had gained  an hour plus or had gone over  150 miles an hour and used only 5 dollars worth of gas.  My car was a 1979 Mustang II  and it  used 5 bucks to go across the city! All I can say is I slipped into a time warp or glitch I the matrix. It remains unexplainable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I experienced a time slip back in 1985 and GAINED time.&lt;/p&gt;\n\n&lt;p&gt;I was driving from Sakatoon Sakatchewan, Canada to Regina Saskatchewan Canada. I have made the trip many times before. It is about 150 miles and takes between 2 to the hours to get there.  I was driving with a friend. He was sick with bronchitis.  I remember being upset with him for taking so long to get ready as I did not like to drive in the dark. We were going on to Minot North Dakota from there after we gassed up. It was late afternoon. I remember sitting in the car while he finally got all of his stuff  into the trunk.The radio was playing and the DJ said it was 4 o&amp;#39;clock. I told Michael we&amp;#39;d be driving in the dark and that I wasn&amp;#39;t very happy about that. When we hit the road Michael fell asleep shortly after.  I remember two things as I drove ... it felt like the car was gliding slightly above the road because there was absolutely no road noise nor could I feel any road bumps as I drove. Everything felt strange.  I wanted to ask Michael if it felt like that to him too, but like I said, he was sick and in a deep sleep. Secondly everything felt weird. The interior of the car seemed muffled like being wrapped in cotton.  another thing, this is the Trans-Canada highway we were on, which us a major highway and it was August.  Typically this highway is extremely busy with tourists going camping or semi trailer trucks carrying loads or politicians and government employees going to and from Regina as it is the capital of Sakatchewan, but weirdly, ours was the only car on the road. &lt;/p&gt;\n\n&lt;p&gt;When we reached Regina and pulled into the gas station I heard the DJ say it was 5 pm.  That was impossible! There is no way I could have made that trip in an hour! So I asked the gas attendant if there was a time difference between Saskatoon and Regina, knowing darn well there wasn&amp;#39;t.  He looked at me like I was crazy and said &amp;quot;no&amp;quot;. When I asked him how much for the gas he gave another strange look and said &amp;quot;five bucks!&amp;quot; I could not believe my ears. By this time Michael was awake and I told what had happened. He was flabbergasted. We tried to make sense of it but could not. Somehow we had gained  an hour plus or had gone over  150 miles an hour and used only 5 dollars worth of gas.  My car was a 1979 Mustang II  and it  used 5 bucks to go across the city! All I can say is I slipped into a time warp or glitch I the matrix. It remains unexplainable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Glitch_in_the_Matrix", "name": "t1_dgelzzx", "score_hidden": true, "stickied": false, "created": 1492513916.0, "created_utc": 1492485116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]