[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Glitch_in_the_Matrix", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t know if this counts as a glitch but the odds of it happening were so unimaginably small looking back on it that it honestly blows my mind. So one night when I was about 8 or something I&amp;#39;m sitting with my sister. She was in high school at this point and studying for a test, and I was playing a game on my GameBoy Advance. The game was Megaman Battle Network 5 (might have been 6 actually but I&amp;#39;m sure it was 5). Anyway, I was just talking to my sister about school and shit and I complained about the hard homework I&amp;#39;d been getting. She burst out laughing and told me that I should be thankful cause it gets far worse, and that her homework made mine look easy. &lt;/p&gt;\n\n&lt;p&gt;My pride was kinda dented (I thought I was a really smart kid), so I told her to ask me a question from her textbook. Now I don&amp;#39;t remember the exact question, cause honestly the words sounded so technical and I kinda zoned out listening to my sister being a smartass. She started going &amp;#39;so, do you know the answer then?&amp;#39; And teasing me. I decided that giving her an answer, even a completely nonsense one, was better than staying silent. So for a laugh I decided to answer with the name of the main character of the game I was playing.&lt;/p&gt;\n\n&lt;p&gt;Those familiar with the Battle Network games will know that the main character is called &amp;#39;Lan&amp;#39;. Turns out the answer to my sister&amp;#39;s question was &amp;#39;local-area network&amp;#39;, also known as a LAN. I&amp;#39;m pretty sure the character&amp;#39;s name is based on this but I had no idea about that at this age. I just said what was in front of me. My sister was shocked that I got the right answer and asked me how the hell I got it. I thought she was making fun of me and being sarcastic but nope, I actually got the question right. I kind of passed it off and didn&amp;#39;t think about it so much, but looking back on it later in life it&amp;#39;s insane how I got this right.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Don't know if this counts as a glitch but the odds of it happening were so unimaginably small looking back on it that it honestly blows my mind. So one night when I was about 8 or something I'm sitting with my sister. She was in high school at this point and studying for a test, and I was playing a game on my GameBoy Advance. The game was Megaman Battle Network 5 (might have been 6 actually but I'm sure it was 5). Anyway, I was just talking to my sister about school and shit and I complained about the hard homework I'd been getting. She burst out laughing and told me that I should be thankful cause it gets far worse, and that her homework made mine look easy. \n\nMy pride was kinda dented (I thought I was a really smart kid), so I told her to ask me a question from her textbook. Now I don't remember the exact question, cause honestly the words sounded so technical and I kinda zoned out listening to my sister being a smartass. She started going 'so, do you know the answer then?' And teasing me. I decided that giving her an answer, even a completely nonsense one, was better than staying silent. So for a laugh I decided to answer with the name of the main character of the game I was playing.\n\nThose familiar with the Battle Network games will know that the main character is called 'Lan'. Turns out the answer to my sister's question was 'local-area network', also known as a LAN. I'm pretty sure the character's name is based on this but I had no idea about that at this age. I just said what was in front of me. My sister was shocked that I got the right answer and asked me how the hell I got it. I thought she was making fun of me and being sarcastic but nope, I actually got the question right. I kind of passed it off and didn't think about it so much, but looking back on it later in life it's insane how I got this right.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zsml", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Go_Puck_Yourself-", "saved": false, "mod_reports": [], "name": "t3_65zsml", "subreddit_name_prefixed": "r/Glitch_in_the_Matrix", "approved_by": null, "over_18": false, "domain": "self.Glitch_in_the_Matrix", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tcwa", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Glitch_in_the_Matrix/comments/65zsml/guessed_the_answer_to_my_highschool_sisters/", "num_reports": null, "locked": false, "stickied": false, "created": 1492507290.0, "url": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/65zsml/guessed_the_answer_to_my_highschool_sisters/", "author_flair_text": null, "quarantine": false, "title": "Guessed the answer to my high-school sister's homework when I was 8", "created_utc": 1492478490.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]