[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all,&lt;/p&gt;\n\n&lt;p&gt;Over a year ago I posted in this subreddit when I found out our dog was pregnant. Not having any experience with a female dog or puppies at all, this sub gave me the dose of reality that I needed and some really grounded advice. &lt;/p&gt;\n\n&lt;p&gt;This is kind of long, but I&amp;#39;m not sure what details are relevant to the behavior issue we&amp;#39;re seeing now. To set up our situation, my boyfriend had a male chocolate lab, and intended to only have him. It was just the two of them for a year or two. His college-age cousin then rescued from her local humane society a smaller female lab mix. His cousin wanted to give the little mix back to the humane society because she didn&amp;#39;t think she could take care of her. She brought the dog to my boyfriend&amp;#39;s house for the day, and after he saw how well the female got along with his lab, he decided he would keep her rather than let her go back to the humane society. Shortly after all he decided to keep the female is when I actually came into the picture.&lt;/p&gt;\n\n&lt;p&gt;My boyfriend never got his lab neutered. He assumed that the female was spayed because, from what he understood, she was adopted out of the humane society, and he thought they didn&amp;#39;t let dogs go without spaying or neutering them. We were both ignorant to the signs of heat. One thing led to another, yadda yadda yadda, and the female mix got pregnant. A lot of assumptions and ignorance on our part.&lt;/p&gt;\n\n&lt;p&gt;I posted in this subreddit and got a lot of good advice about what steps to take before, during, and after birth. We were VERY lucky - when we took our female to the vet for an ultrasound, she was only carrying one puppy, and we had the space and means to keep him. The birth went fine; we were able to set up the new mom and her puppy separately from our male to give her space. When we finally did introduce the puppy to his dad, they all three got along really well. As soon as puppy was weaned, we had the Mama spayed, and the puppy neutered as soon as he was old enough. My boyfriend has still not gotten the lab fixed - since everyone else in the house is, he doesn&amp;#39;t seem to think it&amp;#39;s necessary and he worries it will &amp;quot;change&amp;quot; the dog&amp;#39;s personality. I&amp;#39;ve been working on him on this one. I feel like it might be a part of the problem we are having now, but I really don&amp;#39;t know enough about dog behavior to back that up. I may be totally wrong. &lt;/p&gt;\n\n&lt;p&gt;Anyway... for the first seven/eight months, we had a happy little family - playing together, sleeping together, no signs of aggression from any of the three. However, the last three months or so, we&amp;#39;ve been seeing some weird tension between the mom and the dad - and it all seems to center around, weirdly, the doggy door. She&amp;#39;s used to &amp;quot;guarding&amp;quot; it (she&amp;#39;s always been less of a cuddler and more of a watchdog), but she&amp;#39;s never given the other dogs any problems over going in or out. Now, though, when the dad goes out, she sits on the other side of it and won&amp;#39;t let him through. She&amp;#39;ll snap at him if he tries. She&amp;#39;s never actually bitten him, or anyone, but he seems scared of her. He&amp;#39;s a very docile dog. So, every day almost for the last three months or so, I&amp;#39;ll be doing something around the house and hear him whining, and go to the door and find this situation: her, sitting on one side of the doggy door, and him, afraid to come in, waiting for one of us to come open the actual door for him and let him through. I know it doesn&amp;#39;t seem like a big deal - once he&amp;#39;s inside, they seem to get along like normal - but we have no cover in our backyard for him to get under if it were to start raining or get cold, which is why we have the doggy door into an inside room... I wouldn&amp;#39;t want him to be stuck out there with bad weather.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just such a strange change in dynamics to me. I asked the vet, whose only advice was to admonish her when she does it. I then asked a friend who is a vet tech, and she suggested maybe there is some jealousy because the female can sense that the male is not fixed. It didn&amp;#39;t start happened right after we got her fixed, but a few months later. Has anybody ever seen this before? Any ideas why they&amp;#39;re suddenly acting this way?  &lt;/p&gt;\n\n&lt;p&gt;tl;dr - Three dogs in house. Mom, Dad, and their puppy. Mom is being suddenly aggressive towards Dad, only seems to be centered around the doggy door. Neither will agree to couple&amp;#39;s counseling. Please help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all,\n\nOver a year ago I posted in this subreddit when I found out our dog was pregnant. Not having any experience with a female dog or puppies at all, this sub gave me the dose of reality that I needed and some really grounded advice. \n\nThis is kind of long, but I'm not sure what details are relevant to the behavior issue we're seeing now. To set up our situation, my boyfriend had a male chocolate lab, and intended to only have him. It was just the two of them for a year or two. His college-age cousin then rescued from her local humane society a smaller female lab mix. His cousin wanted to give the little mix back to the humane society because she didn't think she could take care of her. She brought the dog to my boyfriend's house for the day, and after he saw how well the female got along with his lab, he decided he would keep her rather than let her go back to the humane society. Shortly after all he decided to keep the female is when I actually came into the picture.\n\nMy boyfriend never got his lab neutered. He assumed that the female was spayed because, from what he understood, she was adopted out of the humane society, and he thought they didn't let dogs go without spaying or neutering them. We were both ignorant to the signs of heat. One thing led to another, yadda yadda yadda, and the female mix got pregnant. A lot of assumptions and ignorance on our part.\n\nI posted in this subreddit and got a lot of good advice about what steps to take before, during, and after birth. We were VERY lucky - when we took our female to the vet for an ultrasound, she was only carrying one puppy, and we had the space and means to keep him. The birth went fine; we were able to set up the new mom and her puppy separately from our male to give her space. When we finally did introduce the puppy to his dad, they all three got along really well. As soon as puppy was weaned, we had the Mama spayed, and the puppy neutered as soon as he was old enough. My boyfriend has still not gotten the lab fixed - since everyone else in the house is, he doesn't seem to think it's necessary and he worries it will \"change\" the dog's personality. I've been working on him on this one. I feel like it might be a part of the problem we are having now, but I really don't know enough about dog behavior to back that up. I may be totally wrong. \n\nAnyway... for the first seven/eight months, we had a happy little family - playing together, sleeping together, no signs of aggression from any of the three. However, the last three months or so, we've been seeing some weird tension between the mom and the dad - and it all seems to center around, weirdly, the doggy door. She's used to \"guarding\" it (she's always been less of a cuddler and more of a watchdog), but she's never given the other dogs any problems over going in or out. Now, though, when the dad goes out, she sits on the other side of it and won't let him through. She'll snap at him if he tries. She's never actually bitten him, or anyone, but he seems scared of her. He's a very docile dog. So, every day almost for the last three months or so, I'll be doing something around the house and hear him whining, and go to the door and find this situation: her, sitting on one side of the doggy door, and him, afraid to come in, waiting for one of us to come open the actual door for him and let him through. I know it doesn't seem like a big deal - once he's inside, they seem to get along like normal - but we have no cover in our backyard for him to get under if it were to start raining or get cold, which is why we have the doggy door into an inside room... I wouldn't want him to be stuck out there with bad weather.\n\nIt's just such a strange change in dynamics to me. I asked the vet, whose only advice was to admonish her when she does it. I then asked a friend who is a vet tech, and she suggested maybe there is some jealousy because the female can sense that the male is not fixed. It didn't start happened right after we got her fixed, but a few months later. Has anybody ever seen this before? Any ideas why they're suddenly acting this way?  \n\ntl;dr - Three dogs in house. Mom, Dad, and their puppy. Mom is being suddenly aggressive towards Dad, only seems to be centered around the doggy door. Neither will agree to couple's counseling. Please help.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Help!", "id": "64rja6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "jelleyk", "saved": false, "mod_reports": [], "name": "t3_64rja6", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "help", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/64rja6/help_change_in_the_dog_family_dynamic/", "num_reports": null, "locked": false, "stickied": false, "created": 1491953442.0, "url": "https://www.reddit.com/r/dogs/comments/64rja6/help_change_in_the_dog_family_dynamic/", "author_flair_text": null, "quarantine": false, "title": "[Help] Change in the Dog Family Dynamic", "created_utc": 1491924642.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64rja6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64rja6", "likes": null, "replies": "", "user_reports": [], "id": "dg4l06s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jelleyk", "parent_id": "t1_dg4hh01", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "That's great advice. I've been positioning myself between the two of them when I open the door for him to come in - but what you said makes a lot more sense. That's not teaching her that he's allowed to use the doggy door. I will definitely try it the way you suggested! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s great advice. I&amp;#39;ve been positioning myself between the two of them when I open the door for him to come in - but what you said makes a lot more sense. That&amp;#39;s not teaching her that he&amp;#39;s allowed to use the doggy door. I will definitely try it the way you suggested! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4l06s", "score_hidden": false, "stickied": false, "created": 1491960113.0, "created_utc": 1491931313.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hh01", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "oweia", "parent_id": "t3_64rja6", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I have two dogs who used to do this exact same thing. Ironically enough, a neutered lab mix being the door guardian, and a purebred lab that hasn't been spayed. The lab mix is very corrective of the lab's behavior and still tends to snap at her when he thinks she's doing something bad. Yours might start doing this if she hasn't already.\n\nMy best guess is that something about this experience has left the momma dog feel insecure. I don't think her behavior is worrisome. You did mention she has more guard dog tendencies, so it seems she's found security in guarding the house. If she's fine with the dad dog once he's inside, she's taken to treating him like a guest for one reason or another. It seems to me she isn't letting him in because you or your bf didn't communicate to her in a way she understands that the other dog is allowed in and out too. I'd try to stand between her and the doggy door when this happens (to show to her that you're in charge of the situation, not her) and try to get her to back up and call the other dog in. If she shows aggression towards him even when you do this, she should be moved to a different room and left alone for a while to let her know that's she's the one misbehaving, not the other dog. It's important to do this often enough that she sees the dog come through the doggy door so she knows he's allowed to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have two dogs who used to do this exact same thing. Ironically enough, a neutered lab mix being the door guardian, and a purebred lab that hasn&amp;#39;t been spayed. The lab mix is very corrective of the lab&amp;#39;s behavior and still tends to snap at her when he thinks she&amp;#39;s doing something bad. Yours might start doing this if she hasn&amp;#39;t already.&lt;/p&gt;\n\n&lt;p&gt;My best guess is that something about this experience has left the momma dog feel insecure. I don&amp;#39;t think her behavior is worrisome. You did mention she has more guard dog tendencies, so it seems she&amp;#39;s found security in guarding the house. If she&amp;#39;s fine with the dad dog once he&amp;#39;s inside, she&amp;#39;s taken to treating him like a guest for one reason or another. It seems to me she isn&amp;#39;t letting him in because you or your bf didn&amp;#39;t communicate to her in a way she understands that the other dog is allowed in and out too. I&amp;#39;d try to stand between her and the doggy door when this happens (to show to her that you&amp;#39;re in charge of the situation, not her) and try to get her to back up and call the other dog in. If she shows aggression towards him even when you do this, she should be moved to a different room and left alone for a while to let her know that&amp;#39;s she&amp;#39;s the one misbehaving, not the other dog. It&amp;#39;s important to do this often enough that she sees the dog come through the doggy door so she knows he&amp;#39;s allowed to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4hh01", "score_hidden": false, "stickied": false, "created": 1491956256.0, "created_utc": 1491927456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64rja6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64rja6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64rja6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64rja6", "likes": null, "replies": "", "user_reports": [], "id": "dg4zogs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jelleyk", "parent_id": "t1_dg4yvvn", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "That's very true. And I mostly catch it happening early in the morning, between when my boyfriend leaves the house at 3:30 to go to work and my usual wake-up time of 5:30/6:00. At 4:00 in the morning, after being woken up by cries and barks, I'm just not in \"training\" mode -- I'm usually frustrated and in \"do what I have to do to catch a few more minutes of sleep\" mode!\n\nIt happens in the evenings too, just not as often. But having him go outside then practicing with her over and over to reinforce it is such a good idea. I'm going to work on it this evening!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s very true. And I mostly catch it happening early in the morning, between when my boyfriend leaves the house at 3:30 to go to work and my usual wake-up time of 5:30/6:00. At 4:00 in the morning, after being woken up by cries and barks, I&amp;#39;m just not in &amp;quot;training&amp;quot; mode -- I&amp;#39;m usually frustrated and in &amp;quot;do what I have to do to catch a few more minutes of sleep&amp;quot; mode!&lt;/p&gt;\n\n&lt;p&gt;It happens in the evenings too, just not as often. But having him go outside then practicing with her over and over to reinforce it is such a good idea. I&amp;#39;m going to work on it this evening!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4zogs", "score_hidden": false, "stickied": false, "created": 1491976443.0, "created_utc": 1491947643.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4yvvn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bid325", "parent_id": "t1_dg4wnvc", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "That's the frustrating thing about training for most people, we spend some much time reacting while it's happening than correcting before it happens ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the frustrating thing about training for most people, we spend some much time reacting while it&amp;#39;s happening than correcting before it happens &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4yvvn", "score_hidden": false, "stickied": false, "created": 1491975482.0, "created_utc": 1491946682.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wnvc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jelleyk", "parent_id": "t1_dg4t9vx", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I like this idea too. I've been so focused on preventing it when it happens organically, I never really thought about creating the situation and controlling it. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like this idea too. I&amp;#39;ve been so focused on preventing it when it happens organically, I never really thought about creating the situation and controlling it. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4wnvc", "score_hidden": false, "stickied": false, "created": 1491972837.0, "created_utc": 1491944037.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4t9vx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bid325", "parent_id": "t3_64rja6", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "You can also try practicing putting the dad outside and making the mom down/stay in front of the door, motion for the dad to come in and if the mom doesn't react give her treats, if she does have treats handy and distract her with a treat and make her make eye contact while the dad goes through and reward her after he's through and if she's maintained eye contact and her attention is on you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can also try practicing putting the dad outside and making the mom down/stay in front of the door, motion for the dad to come in and if the mom doesn&amp;#39;t react give her treats, if she does have treats handy and distract her with a treat and make her make eye contact while the dad goes through and reward her after he&amp;#39;s through and if she&amp;#39;s maintained eye contact and her attention is on you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4t9vx", "score_hidden": false, "stickied": false, "created": 1491969055.0, "created_utc": 1491940255.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64rja6", "likes": null, "replies": "", "user_reports": [], "id": "dg5dv3y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bestest90girl", "parent_id": "t3_64rja6", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Also dogs can tell by hormones who is fixed. At my daycare the intact dogs get picked on like this. She may see him as a threat to her baby all of a sudden due to hormones she smells from him. I would seek out a behavior speciallist and ask for some advice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also dogs can tell by hormones who is fixed. At my daycare the intact dogs get picked on like this. She may see him as a threat to her baby all of a sudden due to hormones she smells from him. I would seek out a behavior speciallist and ask for some advice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5dv3y", "score_hidden": false, "stickied": false, "created": 1491995274.0, "created_utc": 1491966474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]