[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always fallen into the latter camp with my dogs. I don&amp;#39;t particularly care where they walk so long as there isn&amp;#39;t tension on the leash. Unless I&amp;#39;m out for a run, walks are for my dog and I want him to sniff whatever he wants. This is especially true because we live in an apartment, all his potty breaks need to be leashed.&lt;/p&gt;\n\n&lt;p&gt;This past week, I decided to switch camps.&lt;/p&gt;\n\n&lt;p&gt;My current dog (60 lb ~1.5 yo bully mix) has tested every imaginable leash boundary he can get away with. He&amp;#39;s learned that when we stop because he&amp;#39;s pulling, it means sit, lessen tension, or return to human. He hasn&amp;#39;t figured out that he has to &lt;em&gt;maintain&lt;/em&gt; that lessened tension - the minute human steps forward, he runs to the end of the line again, regardless of line length, front attaching harness, face halter, or the best treats ever.&lt;/p&gt;\n\n&lt;p&gt;He already knows a strict heel from Rally class, so it&amp;#39;s just a matter of teaching him to (somewhat) maintain that position at home and outside as well. We have a &lt;em&gt;long&lt;/em&gt; way to go, but he&amp;#39;s surprised me in how quickly he&amp;#39;s understanding! The &amp;#39;go sniff&amp;#39; command has also been good for impulse control practice. He&amp;#39;s (...kind of...) starting to realize that he can sniff wherever he wants so long as he&amp;#39;s polite about it.  &lt;/p&gt;\n\n&lt;p&gt;Maybe we&amp;#39;ll eventually switch back to being more lenient, but I feel like we need to first get basics down before we get there. So, what do you guys do? Heel(ish) position or no?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've always fallen into the latter camp with my dogs. I don't particularly care where they walk so long as there isn't tension on the leash. Unless I'm out for a run, walks are for my dog and I want him to sniff whatever he wants. This is especially true because we live in an apartment, all his potty breaks need to be leashed.\n\nThis past week, I decided to switch camps.\n\nMy current dog (60 lb ~1.5 yo bully mix) has tested every imaginable leash boundary he can get away with. He's learned that when we stop because he's pulling, it means sit, lessen tension, or return to human. He hasn't figured out that he has to *maintain* that lessened tension - the minute human steps forward, he runs to the end of the line again, regardless of line length, front attaching harness, face halter, or the best treats ever.\n\nHe already knows a strict heel from Rally class, so it's just a matter of teaching him to (somewhat) maintain that position at home and outside as well. We have a *long* way to go, but he's surprised me in how quickly he's understanding! The 'go sniff' command has also been good for impulse control practice. He's (...kind of...) starting to realize that he can sniff wherever he wants so long as he's polite about it.  \n\nMaybe we'll eventually switch back to being more lenient, but I feel like we need to first get basics down before we get there. So, what do you guys do? Heel(ish) position or no?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Misc", "id": "64sr1x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "heyjoob", "saved": false, "mod_reports": [], "name": "t3_64sr1x", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": "paw-flair", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/64sr1x/discussion_loose_leash_walking_to_loose_heel/", "num_reports": null, "locked": false, "stickied": false, "created": 1491964587.0, "url": "https://www.reddit.com/r/dogs/comments/64sr1x/discussion_loose_leash_walking_to_loose_heel/", "author_flair_text": "Roshi: American Dog", "quarantine": false, "title": "[Discussion] Loose leash walking - to (loose) heel position or not to heel position?", "created_utc": 1491935787.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64sr1x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64sr1x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64sr1x", "likes": null, "replies": "", "user_reports": [], "id": "dg4qbwy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "court67", "parent_id": "t1_dg4q9zk", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Oh definitely, can't hurt to try! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh definitely, can&amp;#39;t hurt to try! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4qbwy", "score_hidden": false, "stickied": false, "created": 1491965906.0, "created_utc": 1491937106.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4q9zk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heyjoob", "parent_id": "t1_dg4pq9j", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Oh that's a very good point about getting sloppy in competition! I have no intention of competing in Rally with my guy. I love Rally and enjoy the classes and skills, but it's not really his cup of tea (he's fantastic at nosework and barn hunt though). \n\nI don't know if my approach is wrong or right, but his pulling is *really* hard when he pulls, even with a front clip harness. I've burned my hand on the leash when he decides to go for something and he's nearly pulled me down a flight of stairs before. He's also reactive, so we always have treats with us on walks anyway. I feel like it can't hurt to try for us and then become more lenient later. ", "edited": 1491937333.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh that&amp;#39;s a very good point about getting sloppy in competition! I have no intention of competing in Rally with my guy. I love Rally and enjoy the classes and skills, but it&amp;#39;s not really his cup of tea (he&amp;#39;s fantastic at nosework and barn hunt though). &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if my approach is wrong or right, but his pulling is &lt;em&gt;really&lt;/em&gt; hard when he pulls, even with a front clip harness. I&amp;#39;ve burned my hand on the leash when he decides to go for something and he&amp;#39;s nearly pulled me down a flight of stairs before. He&amp;#39;s also reactive, so we always have treats with us on walks anyway. I feel like it can&amp;#39;t hurt to try for us and then become more lenient later. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4q9zk", "score_hidden": false, "stickied": false, "created": 1491965851.0, "created_utc": 1491937051.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pq9j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "court67", "parent_id": "t3_64sr1x", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Nope, LLW and heel position are totally separate for me, but I plan to compete in obedience with both of my dogs, so that distinction is important for me. I don't want my dog to think she is supposed to be heeling, but get away with sloppy positioning because we're just going for a walk. We walk for an hour or more, and that's way too long for a dog to be expected to hold a focused and engaged heel position. The formal heel is going to lose its value if you're asking for it for that long without a reward. \n\nWhen I'm just walking for exercise and mental stimulation, my dogs wear a harness and are allowed to pull and sniff whatever they want. They're sniffy walks and totally for my dogs' benefits. When I need them to be more controlled, I switch from the harness to a martingale and that signals that I need them to stick close and not put tension in the leash. Then when I want a formal obedience heel, there is a very different body language and set up routine that we go through to practice that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope, LLW and heel position are totally separate for me, but I plan to compete in obedience with both of my dogs, so that distinction is important for me. I don&amp;#39;t want my dog to think she is supposed to be heeling, but get away with sloppy positioning because we&amp;#39;re just going for a walk. We walk for an hour or more, and that&amp;#39;s way too long for a dog to be expected to hold a focused and engaged heel position. The formal heel is going to lose its value if you&amp;#39;re asking for it for that long without a reward. &lt;/p&gt;\n\n&lt;p&gt;When I&amp;#39;m just walking for exercise and mental stimulation, my dogs wear a harness and are allowed to pull and sniff whatever they want. They&amp;#39;re sniffy walks and totally for my dogs&amp;#39; benefits. When I need them to be more controlled, I switch from the harness to a martingale and that signals that I need them to stick close and not put tension in the leash. Then when I want a formal obedience heel, there is a very different body language and set up routine that we go through to practice that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4pq9j", "score_hidden": false, "stickied": false, "created": 1491965279.0, "created_utc": 1491936479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64sr1x", "likes": null, "replies": "", "user_reports": [], "id": "dg4wdtr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "c130", "parent_id": "t3_64sr1x", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "When my dog's on the lead, he must walk to my right side and his shoulder must be level with my knees. 90% of his daily exercise is off-lead but he must walk politely *to* the park.\n\nLoose leash was too vague - different leads are different lengths, he didn't have any reference point of where he should be except by repeatedly pulling. He had to learn to orient himself in relation to me.\n\nTeaching off-lead heeling, one step at a time, was the most effective way I found to teach him positioning. \n\nAn exercise to reinforce correct positioning is to walk in figures of 8, zig-zags in both directions and left and right u-turns. If he stops paying attention or powers on ahead, he has to walk around me or turn in a circle to get back in position. If he stays at my heel, he only has to make small adjustments. Efficiency wins out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When my dog&amp;#39;s on the lead, he must walk to my right side and his shoulder must be level with my knees. 90% of his daily exercise is off-lead but he must walk politely &lt;em&gt;to&lt;/em&gt; the park.&lt;/p&gt;\n\n&lt;p&gt;Loose leash was too vague - different leads are different lengths, he didn&amp;#39;t have any reference point of where he should be except by repeatedly pulling. He had to learn to orient himself in relation to me.&lt;/p&gt;\n\n&lt;p&gt;Teaching off-lead heeling, one step at a time, was the most effective way I found to teach him positioning. &lt;/p&gt;\n\n&lt;p&gt;An exercise to reinforce correct positioning is to walk in figures of 8, zig-zags in both directions and left and right u-turns. If he stops paying attention or powers on ahead, he has to walk around me or turn in a circle to get back in position. If he stays at my heel, he only has to make small adjustments. Efficiency wins out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4wdtr", "score_hidden": false, "stickied": false, "created": 1491972516.0, "created_utc": 1491943716.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64sr1x", "likes": null, "replies": "", "user_reports": [], "id": "dg4wpum", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "maggie8663", "parent_id": "t3_64sr1x", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "My dog walks just generally on my left, I wouldn't call it a heel. I just always rewarded him for being in that general area. This made teaching LLW super easy and not boring because we didn't have to stop-start all the time - if he tried to pull I would just encourage him back to my side and then reward him for continuing there. I don't see it interfering with his ability to learn a proper heel later on, because I would be using an entirely different cue and body language. Teaching him the heel position vs teaching him that \"let's go\" means \"walk sort of next to me but you can move around a bit and sniff\" are just two entirely separate things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dog walks just generally on my left, I wouldn&amp;#39;t call it a heel. I just always rewarded him for being in that general area. This made teaching LLW super easy and not boring because we didn&amp;#39;t have to stop-start all the time - if he tried to pull I would just encourage him back to my side and then reward him for continuing there. I don&amp;#39;t see it interfering with his ability to learn a proper heel later on, because I would be using an entirely different cue and body language. Teaching him the heel position vs teaching him that &amp;quot;let&amp;#39;s go&amp;quot; means &amp;quot;walk sort of next to me but you can move around a bit and sniff&amp;quot; are just two entirely separate things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4wpum", "score_hidden": false, "stickied": false, "created": 1491972900.0, "created_utc": 1491944100.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64sr1x", "likes": null, "replies": "", "user_reports": [], "id": "dg4pkgb", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Zensandwitch", "parent_id": "t3_64sr1x", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "My dog gets to LLW not in a heel, but if she ever started acting up I would absolutely get more strict. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dog gets to LLW not in a heel, but if she ever started acting up I would absolutely get more strict. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4pkgb", "score_hidden": false, "stickied": false, "created": 1491965110.0, "created_utc": 1491936310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]