[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you honestly buy a puppy from here you a) should not have a dog and b) are promoting animal abuse. &lt;/p&gt;\n\n&lt;p&gt;Let me explain this in the simplest terms: &lt;/p&gt;\n\n&lt;p&gt;There are people, bad people, who have discovered that if they breed pure bred dogs that they can make a lot of money from the general population. How? By charging obscene amounts of money to the buyers and pet store owners (who in turn jack the price up even further). Thus, because the American population is obsessed with dogs and cats, they churn out dogs and pets like a product for mass consumption. In addition to these companies churning out dogs over and over again, the U.S. has very few regulatory laws in regards to dog and cat breeding. The result: puppy mills. What does a puppy mill look like, you ask? To put it in the most basic terms, it is a place that has between 20-100 animals (typically cats, dogs, exotic birds). However, this isn&amp;#39;t like a TV show or your local zoo where they are taken care of, often they are mashed in cages too small for them, with wire flooring (that&amp;#39;s the flooring with squares in it) and are under feed, not hydrated, and live in their own shit. Additionally, they are often inbred (i.e the mom has sex with her son or niece or brother) resulting in recessive, abnormal traits. These traits can lead to various diseases that can commonly result in death or poor quality of life for the animal.&lt;/p&gt;\n\n&lt;p&gt;Well, you might ask, how do you know this has to do with Petland? They tell us that they are AKC registered, USDA approved, and from states that have better regulations than Michigan? Well, for the first question, USDA approved areas are typically not fit for quality life in the first place. The ASPCA  warns potential buyers of this exact caveat that pet stores use, &amp;quot;Being registered or “having papers” means nothing more than the puppy&amp;#39;s parents both had papers. Many registered dogs, as well as pedigreed dogs, are sold in puppy mills. The only way you can be sure that a puppy came from a reputable source is to see where he or she came from yourself&amp;quot; (ASPCA). &lt;/p&gt;\n\n&lt;p&gt;For the next question, what about the fact that these puppies come from &amp;quot;more highly regulated states&amp;quot;? Well, if you do your research (or actually ask follow up questions as opposed to simply believing everything you read like a horoscope) you would of asked the sales man or woman which specific states they are talking about. Fortunately for you, I did. The states that Petland Novi gets its puppies from include Ohio, Kentucky, Missouri, and Arkansas. According, again, to the ASPCA, Arkansas is the state with the highest offense of puppy mills, with Missouri at #8, and Ohio at #11. Michigan was not found on the list (ASPCA). These states have higher regulation than Michigan BECAUSE they have so many problems. Take a classroom example, would you allow the kid who eats glue to be able to watch over the classroom&amp;#39;s glue? No, because of that child&amp;#39;s previous actions. The same goes for these states. They have these laws in place because of the high accounts... and the numbers have not subsided. You are basically playing russian roulette by blindly accepting to get a dog from those states. 9/10 you will end up with the chocolate that has the pepper inside. &lt;/p&gt;\n\n&lt;p&gt;I am talking pedantically to you because this is pretty simple and well known. I knew about puppy mills at the age of 14 and I am not even an animal advocate. Unfortunately, most of these people who buy these dogs will not read this. They are too busy believing the idea that a dog is a toy and not a ten to fifteen year responsibility. When I read reviews on this site, it is typically people who write 5 star reviews for free discounts or previous buyers who had a dog die or an unhealthy one with recessive traits. These people are idiots and are buying a dog on a whim. A dog is not a toy or something you get for Xmas for your kids because they are so cute. A dog is a part of your family for life. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "If you honestly buy a puppy from here you a) should not have a dog and b) are promoting animal abuse. \n\nLet me explain this in the simplest terms: \n\nThere are people, bad people, who have discovered that if they breed pure bred dogs that they can make a lot of money from the general population. How? By charging obscene amounts of money to the buyers and pet store owners (who in turn jack the price up even further). Thus, because the American population is obsessed with dogs and cats, they churn out dogs and pets like a product for mass consumption. In addition to these companies churning out dogs over and over again, the U.S. has very few regulatory laws in regards to dog and cat breeding. The result: puppy mills. What does a puppy mill look like, you ask? To put it in the most basic terms, it is a place that has between 20-100 animals (typically cats, dogs, exotic birds). However, this isn't like a TV show or your local zoo where they are taken care of, often they are mashed in cages too small for them, with wire flooring (that's the flooring with squares in it) and are under feed, not hydrated, and live in their own shit. Additionally, they are often inbred (i.e the mom has sex with her son or niece or brother) resulting in recessive, abnormal traits. These traits can lead to various diseases that can commonly result in death or poor quality of life for the animal.\n\nWell, you might ask, how do you know this has to do with Petland? They tell us that they are AKC registered, USDA approved, and from states that have better regulations than Michigan? Well, for the first question, USDA approved areas are typically not fit for quality life in the first place. The ASPCA  warns potential buyers of this exact caveat that pet stores use, \"Being registered or “having papers” means nothing more than the puppy's parents both had papers. Many registered dogs, as well as pedigreed dogs, are sold in puppy mills. The only way you can be sure that a puppy came from a reputable source is to see where he or she came from yourself\" (ASPCA). \n\nFor the next question, what about the fact that these puppies come from \"more highly regulated states\"? Well, if you do your research (or actually ask follow up questions as opposed to simply believing everything you read like a horoscope) you would of asked the sales man or woman which specific states they are talking about. Fortunately for you, I did. The states that Petland Novi gets its puppies from include Ohio, Kentucky, Missouri, and Arkansas. According, again, to the ASPCA, Arkansas is the state with the highest offense of puppy mills, with Missouri at #8, and Ohio at #11. Michigan was not found on the list (ASPCA). These states have higher regulation than Michigan BECAUSE they have so many problems. Take a classroom example, would you allow the kid who eats glue to be able to watch over the classroom's glue? No, because of that child's previous actions. The same goes for these states. They have these laws in place because of the high accounts... and the numbers have not subsided. You are basically playing russian roulette by blindly accepting to get a dog from those states. 9/10 you will end up with the chocolate that has the pepper inside. \n\nI am talking pedantically to you because this is pretty simple and well known. I knew about puppy mills at the age of 14 and I am not even an animal advocate. Unfortunately, most of these people who buy these dogs will not read this. They are too busy believing the idea that a dog is a toy and not a ten to fifteen year responsibility. When I read reviews on this site, it is typically people who write 5 star reviews for free discounts or previous buyers who had a dog die or an unhealthy one with recessive traits. These people are idiots and are buying a dog on a whim. A dog is not a toy or something you get for Xmas for your kids because they are so cute. A dog is a part of your family for life. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Vent", "id": "64t1ig", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "ewwbi", "saved": false, "mod_reports": [], "name": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "vent", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/64t1ig/vent_petland_in_novi_michigan_i_am_writing_this/", "num_reports": null, "locked": false, "stickied": false, "created": 1491967145.0, "url": "https://www.reddit.com/r/dogs/comments/64t1ig/vent_petland_in_novi_michigan_i_am_writing_this/", "author_flair_text": null, "quarantine": false, "title": "[Vent] Petland in Novi, Michigan. I am writing this Reddit post because the store rep keeps deleting my review.", "created_utc": 1491938345.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg4sawk", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "BlueBG82", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Just FYI they cant delete facebook reviews. https://www.facebook.com/pages/Pet-Land/307593375984393", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just FYI they cant delete facebook reviews. &lt;a href=\"https://www.facebook.com/pages/Pet-Land/307593375984393\"&gt;https://www.facebook.com/pages/Pet-Land/307593375984393&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4sawk", "score_hidden": false, "stickied": false, "created": 1491968019.0, "created_utc": 1491939219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg4s1ox", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Avridt", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Most, if not all, puppies sold at pet stores or through a third party are from puppy mills. Not just petland.\n\nUnfortunately you are preaching to the choir in this sub. It's depressing how little information the general public knows about puppy mills and back yard breeders. I've met people who know their dogs come from puppy mills, but \"they rescued it\" or \"took it to the vet and they said it was healthy so it's just as good as getting it from another breeder.\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most, if not all, puppies sold at pet stores or through a third party are from puppy mills. Not just petland.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately you are preaching to the choir in this sub. It&amp;#39;s depressing how little information the general public knows about puppy mills and back yard breeders. I&amp;#39;ve met people who know their dogs come from puppy mills, but &amp;quot;they rescued it&amp;quot; or &amp;quot;took it to the vet and they said it was healthy so it&amp;#39;s just as good as getting it from another breeder.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4s1ox", "score_hidden": false, "stickied": false, "created": 1491967737.0, "created_utc": 1491938937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg4vfyu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cpcr1203", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I remember seeing a story from channel 4 about one of the dogs that was sold being sick and dying. On that post on Facebook, hundreds of people were complaining about the dogs being from puppy mills and how they would never buy an animal from there. \n\nIn all seriousness though...why would anyone go to a \"pets store\" to buy a dog? I get the whole specific breed with papers thing for some people, but I would  say that going to a reputable breeder is a better idea. I personally am all for shelter dogs, but that's just me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember seeing a story from channel 4 about one of the dogs that was sold being sick and dying. On that post on Facebook, hundreds of people were complaining about the dogs being from puppy mills and how they would never buy an animal from there. &lt;/p&gt;\n\n&lt;p&gt;In all seriousness though...why would anyone go to a &amp;quot;pets store&amp;quot; to buy a dog? I get the whole specific breed with papers thing for some people, but I would  say that going to a reputable breeder is a better idea. I personally am all for shelter dogs, but that&amp;#39;s just me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4vfyu", "score_hidden": false, "stickied": false, "created": 1491971467.0, "created_utc": 1491942667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg51tb1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "justletmesignupdamit", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Petland in Novi? Is that the one in the mall? \n\n\nI'm fairly certain most pet stores are in the puppy mill business, but yeah buying your dog and a soft pretzel from the food court at the same time just has \"horrible idea\" written all over it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Petland in Novi? Is that the one in the mall? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m fairly certain most pet stores are in the puppy mill business, but yeah buying your dog and a soft pretzel from the food court at the same time just has &amp;quot;horrible idea&amp;quot; written all over it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg51tb1", "score_hidden": false, "stickied": false, "created": 1491979150.0, "created_utc": 1491950350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg5w1s4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RussT_Shackleford", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I used to always see ads for petland Novi on my Facebook until I clicked the option to hide those ads. Obviously the puppies are adorable, but it's horrible that they're churning them out with no regard for their wellbeing and only profits in mind. I adopted a dog from the humane society in Rochester hills a month ago instead and have no regrets.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to always see ads for petland Novi on my Facebook until I clicked the option to hide those ads. Obviously the puppies are adorable, but it&amp;#39;s horrible that they&amp;#39;re churning them out with no regard for their wellbeing and only profits in mind. I adopted a dog from the humane society in Rochester hills a month ago instead and have no regrets.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5w1s4", "score_hidden": false, "stickied": false, "created": 1492034247.0, "created_utc": 1492005447.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg59fuu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sadperson123", "parent_id": "t1_dg4ult3", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I agree with this so much. Most people I know who have puppy mill dogs have no actual idea they almost definitely supported a mill (or were willfully blind). This store in particular \"pitches\" the sale really hard and is pretty aggressive about taking down bad reviews. If you read their about me, they encourage the buyer looking for information about where they get their dogs to \"come into the store and look at several puppies,\" THEN they will hand you all of the information on the dog. It's the epitome of an impulse purchase.\n\nThey go on and on about how their breeders are licensed and their dogs have papers and health guarantees and they go to inspect the breeders multiple times a year. They are very good at making themselves NOT sound like a place that sells puppy mill dogs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with this so much. Most people I know who have puppy mill dogs have no actual idea they almost definitely supported a mill (or were willfully blind). This store in particular &amp;quot;pitches&amp;quot; the sale really hard and is pretty aggressive about taking down bad reviews. If you read their about me, they encourage the buyer looking for information about where they get their dogs to &amp;quot;come into the store and look at several puppies,&amp;quot; THEN they will hand you all of the information on the dog. It&amp;#39;s the epitome of an impulse purchase.&lt;/p&gt;\n\n&lt;p&gt;They go on and on about how their breeders are licensed and their dogs have papers and health guarantees and they go to inspect the breeders multiple times a year. They are very good at making themselves NOT sound like a place that sells puppy mill dogs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg59fuu", "score_hidden": false, "stickied": false, "created": 1491989246.0, "created_utc": 1491960446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ult3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Kaedylee", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt;What does a puppy mill look like, you ask? To put it in the most basic terms, it is a place that has between 20-100 animals (typically cats, dogs, exotic birds). However, this isn't like a TV show or your local zoo where they are taken care of, often they are mashed in cages too small for them, with wire flooring (that's the flooring with squares in it) and are under feed, not hydrated, and live in their own shit. Additionally, they are often inbred (i.e the mom has sex with her son or niece or brother) resulting in recessive, abnormal traits. These traits can lead to various diseases that can commonly result in death or poor quality of life for the animal.\n\nWhile this is, unfortunately, often true, it's also important to remember that not all puppy mills are so obviously identifiable. Many puppy mill owners know what the reputation of their business is, and they are good at making it look like they aren't one of *those* puppy mills.\n\nMany well-meaning people have been tricked into supporting puppy mills because they get this picture of starving, neglected, constantly crated dogs in their head, and naturally they don't want to support that.  Then they stumble across a breeder who *couldn't possibly* be operating a puppy mill because they visited the breeder and the dogs weren't starving, and appeared to be well cared for, and lived in large, clean enclosures, and the breeder said they had all their vaccinations, and so on.\n\nA puppy mill is any person or group that breeds dogs at a large scale for the primary purpose of making a profit by selling puppies. They typically don't do the recommended health certifications on their dogs, they almost never prove their dogs in working/sport/conformation venues, and they aren't breeding with the goal of improving the breed. They *might* abuse or neglect the dogs, but they might not. Don't get fooled into buying from a puppy mill because they aren't obviously abusing their dogs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What does a puppy mill look like, you ask? To put it in the most basic terms, it is a place that has between 20-100 animals (typically cats, dogs, exotic birds). However, this isn&amp;#39;t like a TV show or your local zoo where they are taken care of, often they are mashed in cages too small for them, with wire flooring (that&amp;#39;s the flooring with squares in it) and are under feed, not hydrated, and live in their own shit. Additionally, they are often inbred (i.e the mom has sex with her son or niece or brother) resulting in recessive, abnormal traits. These traits can lead to various diseases that can commonly result in death or poor quality of life for the animal.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While this is, unfortunately, often true, it&amp;#39;s also important to remember that not all puppy mills are so obviously identifiable. Many puppy mill owners know what the reputation of their business is, and they are good at making it look like they aren&amp;#39;t one of &lt;em&gt;those&lt;/em&gt; puppy mills.&lt;/p&gt;\n\n&lt;p&gt;Many well-meaning people have been tricked into supporting puppy mills because they get this picture of starving, neglected, constantly crated dogs in their head, and naturally they don&amp;#39;t want to support that.  Then they stumble across a breeder who &lt;em&gt;couldn&amp;#39;t possibly&lt;/em&gt; be operating a puppy mill because they visited the breeder and the dogs weren&amp;#39;t starving, and appeared to be well cared for, and lived in large, clean enclosures, and the breeder said they had all their vaccinations, and so on.&lt;/p&gt;\n\n&lt;p&gt;A puppy mill is any person or group that breeds dogs at a large scale for the primary purpose of making a profit by selling puppies. They typically don&amp;#39;t do the recommended health certifications on their dogs, they almost never prove their dogs in working/sport/conformation venues, and they aren&amp;#39;t breeding with the goal of improving the breed. They &lt;em&gt;might&lt;/em&gt; abuse or neglect the dogs, but they might not. Don&amp;#39;t get fooled into buying from a puppy mill because they aren&amp;#39;t obviously abusing their dogs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg4ult3", "score_hidden": false, "stickied": false, "created": 1491970528.0, "created_utc": 1491941728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg56b61", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "huskyholms", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "If you're local to Novi, or any pet store that sells puppies/kittens, consider writing to your local representatives about getting retail pet sales banned. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re local to Novi, or any pet store that sells puppies/kittens, consider writing to your local representatives about getting retail pet sales banned. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg56b61", "score_hidden": false, "stickied": false, "created": 1491985164.0, "created_utc": 1491956364.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg5dv6r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "justletmesignupdamit", "parent_id": "t1_dg57vqx", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm pretty sure this happened to my mom. We got a puppy when I was a very young child and I don't know exactly where it came from, but he got parvo and my mom gave him back to them. I remember her yelling at the guy, I don't remember if it was a pet store or not- just my 5 foot 100 lb mom fucking giving this dude a piece of her mind. She said she always regretted giving him back and wished she had tried to treat him. \n\nMy mom then told my dad to get a small dog for us and he came home with a german shepherd/akita mix lol. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure this happened to my mom. We got a puppy when I was a very young child and I don&amp;#39;t know exactly where it came from, but he got parvo and my mom gave him back to them. I remember her yelling at the guy, I don&amp;#39;t remember if it was a pet store or not- just my 5 foot 100 lb mom fucking giving this dude a piece of her mind. She said she always regretted giving him back and wished she had tried to treat him. &lt;/p&gt;\n\n&lt;p&gt;My mom then told my dad to get a small dog for us and he came home with a german shepherd/akita mix lol. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5dv6r", "score_hidden": false, "stickied": false, "created": 1491995277.0, "created_utc": 1491966477.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg57vqx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sadperson123", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "It seems like every time someone gets a dog from there it dies of parvo after 3-5 days and $1000s in vet bills. It's the same story over and over. The owners call the store outraged, Petland eventually offers to \"exchange\" the \"defective\" puppy for a new one, the family refuses, and Petland of course refuses to pay any vet bills, because \"there's no proof it contracted the disease while in the store's care.\"\n\nI've only ever heard of them paying vet bills once, and it was [after the family contacted the local news](http://www.wxyz.com/news/region/oakland-county/family-blames-petland-novi-after-pet-dies-days-after-purchase)\n\nETA: My well meaning but misguided mother almost bought a Bernese Mountain Dog puppy from there a few months ago because she felt so bad for it. They wanted $4300. Thankfully my sister talked her out of it. ", "edited": 1491958891.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems like every time someone gets a dog from there it dies of parvo after 3-5 days and $1000s in vet bills. It&amp;#39;s the same story over and over. The owners call the store outraged, Petland eventually offers to &amp;quot;exchange&amp;quot; the &amp;quot;defective&amp;quot; puppy for a new one, the family refuses, and Petland of course refuses to pay any vet bills, because &amp;quot;there&amp;#39;s no proof it contracted the disease while in the store&amp;#39;s care.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only ever heard of them paying vet bills once, and it was &lt;a href=\"http://www.wxyz.com/news/region/oakland-county/family-blames-petland-novi-after-pet-dies-days-after-purchase\"&gt;after the family contacted the local news&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;ETA: My well meaning but misguided mother almost bought a Bernese Mountain Dog puppy from there a few months ago because she felt so bad for it. They wanted $4300. Thankfully my sister talked her out of it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg57vqx", "score_hidden": false, "stickied": false, "created": 1491987248.0, "created_utc": 1491958448.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64t1ig", "likes": null, "replies": "", "user_reports": [], "id": "dg59jfl", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "sadperson123", "parent_id": "t1_dg58xrj", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "$4300 for a Bernese Mountain Dog. I can only imagine what they would charge for a pomski.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;$4300 for a Bernese Mountain Dog. I can only imagine what they would charge for a pomski.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg59jfl", "score_hidden": false, "stickied": false, "created": 1491989371.0, "created_utc": 1491960571.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58xrj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sassyprofessor", "parent_id": "t3_64t1ig", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I live in the area and have seen stories in the news about people buying puppies from there, spending a lot of money on them at the vet for the first week only to have the poor puppy pass away.  They always have a lot of puppies listed on their website, do you know how much they sell them for?   It has to be their main source of revenue, I would love to put them out of business.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live in the area and have seen stories in the news about people buying puppies from there, spending a lot of money on them at the vet for the first week only to have the poor puppy pass away.  They always have a lot of puppies listed on their website, do you know how much they sell them for?   It has to be their main source of revenue, I would love to put them out of business.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg58xrj", "score_hidden": false, "stickied": false, "created": 1491988608.0, "created_utc": 1491959808.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]