[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hubby and I have an almost 6 year old hound mix. He&amp;#39;s our world. We both want to do more to help dogs and found a dog at our local rescue that is in need of a foster home. We have a meeting scheduled Saturday morning to meet the pooch and go from there. There is a 3 month commitment &amp;amp; the shelter pays for all but food. I&amp;#39;m a little nervous about changing our family dynamic but know this is a great thing for pups and shelters. I&amp;#39;m curious to know your experience with fostering - the good, bad, and ugly - before I get us further involved. Thanks! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hubby and I have an almost 6 year old hound mix. He's our world. We both want to do more to help dogs and found a dog at our local rescue that is in need of a foster home. We have a meeting scheduled Saturday morning to meet the pooch and go from there. There is a 3 month commitment &amp; the shelter pays for all but food. I'm a little nervous about changing our family dynamic but know this is a great thing for pups and shelters. I'm curious to know your experience with fostering - the good, bad, and ugly - before I get us further involved. Thanks! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Misc", "id": "64u29p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "imspookyboo", "saved": false, "mod_reports": [], "name": "t3_64u29p", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/64u29p/discussion_tell_me_your_experience_with_fostering/", "num_reports": null, "locked": false, "stickied": false, "created": 1491976944.0, "url": "https://www.reddit.com/r/dogs/comments/64u29p/discussion_tell_me_your_experience_with_fostering/", "author_flair_text": null, "quarantine": false, "title": "[Discussion] Tell me your experience with fostering", "created_utc": 1491948144.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": "", "user_reports": [], "id": "dg592fs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "imspookyboo", "parent_id": "t1_dg53w0p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank you so much for the thorough response. I really appreciate it!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for the thorough response. I really appreciate it!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg592fs", "score_hidden": false, "stickied": false, "created": 1491988775.0, "created_utc": 1491959975.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": "", "user_reports": [], "id": "dg61ybp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clarksophie", "parent_id": "t1_dg6077p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank you! I'll try that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I&amp;#39;ll try that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg61ybp", "score_hidden": false, "stickied": false, "created": 1492041038.0, "created_utc": 1492012238.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6077p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "orangetangerine", "parent_id": "t1_dg600tb", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I've used both and I can't really tell the difference to be honest!  We bought Urine Destroyer last time we had a leaky young foster puppy though and it helped a lot.  You couldn't even tell where she had accidents on our couch", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve used both and I can&amp;#39;t really tell the difference to be honest!  We bought Urine Destroyer last time we had a leaky young foster puppy though and it helped a lot.  You couldn&amp;#39;t even tell where she had accidents on our couch&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6077p", "score_hidden": false, "stickied": false, "created": 1492039114.0, "created_utc": 1492010314.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg600tb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clarksophie", "parent_id": "t1_dg5z7tl", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank you for the tips! We keep him leashed indoors for now (he's free to mark all he wants in the yard) to make sure it doesn't become even more of a habit than it already is.  I should try your tips at redirecting  &amp; sending outside etc. Sometimes I catch him right in the act and try to distract him but he doesn't get fazed and continues doing it anyway. I do send him outside right after but the deed is already done. For now, the leash is our temporary solution.  \n\nSo many variants of Nature's Miracle -- which do you use? Do I go with the original stain &amp; odor remover or would the urine destroyer variant work better? I've been reading Amazon reviews of Nature's Miracle changing their formula and not working as well as they used to but I'm glad to hear you seem happy with it. Hope it works for us as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the tips! We keep him leashed indoors for now (he&amp;#39;s free to mark all he wants in the yard) to make sure it doesn&amp;#39;t become even more of a habit than it already is.  I should try your tips at redirecting  &amp;amp; sending outside etc. Sometimes I catch him right in the act and try to distract him but he doesn&amp;#39;t get fazed and continues doing it anyway. I do send him outside right after but the deed is already done. For now, the leash is our temporary solution.  &lt;/p&gt;\n\n&lt;p&gt;So many variants of Nature&amp;#39;s Miracle -- which do you use? Do I go with the original stain &amp;amp; odor remover or would the urine destroyer variant work better? I&amp;#39;ve been reading Amazon reviews of Nature&amp;#39;s Miracle changing their formula and not working as well as they used to but I&amp;#39;m glad to hear you seem happy with it. Hope it works for us as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg600tb", "score_hidden": false, "stickied": false, "created": 1492038917.0, "created_utc": 1492010117.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5z7tl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "orangetangerine", "parent_id": "t1_dg5rsok", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I use Nature's Miracle, and it's important to use it the way it's written on the bottle.  With dogs marking it's never a guarantee as to what will happen when they pee on a porous surface even with enzymatic cleaner so using it as written on the bottle will help the most.\n\nWith marking, it sucks because it's way more behavioral. My fixed 3 year old dog marks (outside) and it's a doozy; she definitely also marked indoors over where our non-housetrained foster dogs would mark indoors.  It's really annoying but watching them like a hawk, redirecting when they're sniffing around indoors, sending them outside as soon as that behavior is observed, and taking them for long pee walks is a good long term solution, although it might drive you batty with how much attention you have to give them for awhile.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I use Nature&amp;#39;s Miracle, and it&amp;#39;s important to use it the way it&amp;#39;s written on the bottle.  With dogs marking it&amp;#39;s never a guarantee as to what will happen when they pee on a porous surface even with enzymatic cleaner so using it as written on the bottle will help the most.&lt;/p&gt;\n\n&lt;p&gt;With marking, it sucks because it&amp;#39;s way more behavioral. My fixed 3 year old dog marks (outside) and it&amp;#39;s a doozy; she definitely also marked indoors over where our non-housetrained foster dogs would mark indoors.  It&amp;#39;s really annoying but watching them like a hawk, redirecting when they&amp;#39;re sniffing around indoors, sending them outside as soon as that behavior is observed, and taking them for long pee walks is a good long term solution, although it might drive you batty with how much attention you have to give them for awhile.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5z7tl", "score_hidden": false, "stickied": false, "created": 1492038014.0, "created_utc": 1492009214.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rsok", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "clarksophie", "parent_id": "t1_dg53w0p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "A little off-topic, but may I know which enzymatic cleaner worked best for you? Currently having a problem with a (fairly) new dog marking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A little off-topic, but may I know which enzymatic cleaner worked best for you? Currently having a problem with a (fairly) new dog marking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5rsok", "score_hidden": false, "stickied": false, "created": 1492027642.0, "created_utc": 1491998842.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": "", "user_reports": [], "id": "dg62yj3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "orangetangerine", "parent_id": "t1_dg5s9d2", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "It really all depends. Sometimes things that will rub you the wrong way are the people in the organization running it, sometimes it will be the rules and policies that you won't agree with.\n\nI didn't really _hate_ the rescue I worked with and I look at my time with the dogs fondly.  I knew a few months in that I wasn't in agreement nor actually liked a lot of the people who worked with the rescue.  There was often discussions bashing people who own purebreds that turned into some crazy mob mentality thing, which put me in an awkward position when friends and people I knew who had responsibly-bred purebreds and were looking into fostering asked me if the organization was welcoming.  Also, they bashed on a lot of people who'd suggest positive reinforcement techniques for pretty easy behavioral cases, and bashed on other people for declining to adopt after a meet-and-greet.  It was kind of like being a new parent that walked into the wrong mommy group with a completely different parenting style.\n\nI think if you set your own ground rules when you walk into it, you will have a better experience coming out of it.  Ask a lot of questions, about how they handle behavioral cases, which trainers they work with.  Google them - the rescue I worked with was involved in a few scandals and I didn't really find that out til later.  Be satisfied with the answers before you volunteer, and hold them to it.  I wouldn't volunteer for a rescue I don't agree with the policies and procedures of.  Donating time in many cases is just as important as donating money, so it's important that you can get behind the organization you're donating to.  I think it's also important to lay down ground rules on what kinds of dogs you are open to foster with _a little_ leeway, but in general hold your ground.  There are people who come in here to this sub who are excited to foster and because they weren't specific with their reqs/the rescue ignored their reqs, they ended up stuck with a dog that did not fit for longer than they can handle, souring their own experience. For myself and my SO, we were really specific on what kinds of dogs we were to foster, and their ages.  The rescue we worked with used a (more or less) fair system of first-come-first-serve when a foster dog list gets posted, and we did not take dogs that were missing information, or dogs we felt guilted to take because they were the last on the list.  No budging, even if they started doing individual call-outs for homes they knew were open to take \"lasties\".\n\nAlso, don't be afraid to quit.  I know of a few people still in the organization who didn't want to leave because they are scared as to where they'll go because their rescue is their whole world and social circle.  If you get in and realize it's not your thing, for whatever reason, don't feel guilted into staying.  There are a lot of other organizations to work with out there, other ways to donate your time (dog or non-dog), and many other ways to help animals.", "edited": 1492013515.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really all depends. Sometimes things that will rub you the wrong way are the people in the organization running it, sometimes it will be the rules and policies that you won&amp;#39;t agree with.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t really &lt;em&gt;hate&lt;/em&gt; the rescue I worked with and I look at my time with the dogs fondly.  I knew a few months in that I wasn&amp;#39;t in agreement nor actually liked a lot of the people who worked with the rescue.  There was often discussions bashing people who own purebreds that turned into some crazy mob mentality thing, which put me in an awkward position when friends and people I knew who had responsibly-bred purebreds and were looking into fostering asked me if the organization was welcoming.  Also, they bashed on a lot of people who&amp;#39;d suggest positive reinforcement techniques for pretty easy behavioral cases, and bashed on other people for declining to adopt after a meet-and-greet.  It was kind of like being a new parent that walked into the wrong mommy group with a completely different parenting style.&lt;/p&gt;\n\n&lt;p&gt;I think if you set your own ground rules when you walk into it, you will have a better experience coming out of it.  Ask a lot of questions, about how they handle behavioral cases, which trainers they work with.  Google them - the rescue I worked with was involved in a few scandals and I didn&amp;#39;t really find that out til later.  Be satisfied with the answers before you volunteer, and hold them to it.  I wouldn&amp;#39;t volunteer for a rescue I don&amp;#39;t agree with the policies and procedures of.  Donating time in many cases is just as important as donating money, so it&amp;#39;s important that you can get behind the organization you&amp;#39;re donating to.  I think it&amp;#39;s also important to lay down ground rules on what kinds of dogs you are open to foster with &lt;em&gt;a little&lt;/em&gt; leeway, but in general hold your ground.  There are people who come in here to this sub who are excited to foster and because they weren&amp;#39;t specific with their reqs/the rescue ignored their reqs, they ended up stuck with a dog that did not fit for longer than they can handle, souring their own experience. For myself and my SO, we were really specific on what kinds of dogs we were to foster, and their ages.  The rescue we worked with used a (more or less) fair system of first-come-first-serve when a foster dog list gets posted, and we did not take dogs that were missing information, or dogs we felt guilted to take because they were the last on the list.  No budging, even if they started doing individual call-outs for homes they knew were open to take &amp;quot;lasties&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Also, don&amp;#39;t be afraid to quit.  I know of a few people still in the organization who didn&amp;#39;t want to leave because they are scared as to where they&amp;#39;ll go because their rescue is their whole world and social circle.  If you get in and realize it&amp;#39;s not your thing, for whatever reason, don&amp;#39;t feel guilted into staying.  There are a lot of other organizations to work with out there, other ways to donate your time (dog or non-dog), and many other ways to help animals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg62yj3", "score_hidden": false, "stickied": false, "created": 1492042126.0, "created_utc": 1492013326.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5s9d2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sashasan", "parent_id": "t1_dg53w0p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "This is great information and honestly you've outlined my greatest worries with fostering. I can't shake the feeling that the administrative side of a rescue group is cliquey.\n\nWhat are some things to look for in a good rescue?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is great information and honestly you&amp;#39;ve outlined my greatest worries with fostering. I can&amp;#39;t shake the feeling that the administrative side of a rescue group is cliquey.&lt;/p&gt;\n\n&lt;p&gt;What are some things to look for in a good rescue?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5s9d2", "score_hidden": false, "stickied": false, "created": 1492028522.0, "created_utc": 1491999722.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg53w0p", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "orangetangerine", "parent_id": "t3_64u29p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "The good:\n\n* NEW DOG ROOMMATES.  This was the best part of the deal.  It was awesome having them around.  We got a better idea of what traits we liked and didn't like in dogs.  It's basically like getting a dog for free, in a sense.\n* It helps you learn a lot about training, and how to motivate other dogs.  Not all dogs learn things the same way and the more experience you have with different kinds of dogs, the better equipped you are to troubleshoot your dog and future dogs.\n* You feel pretty good making room in shelters while helping save your dog, and whatever dog the shelter can take in and take care of because you helped free up a space in it.\n\nThe bad:\n\n* Depending on your organization, you may or may not get say (or get little say) in what kind of home the dog ends up in.  You may not feel like whoever adopts the dog will give the life you want for your foster dog.\n* The same problem many adopters faced - you may not get the dog that was advertised to you.  Dogs are awful at generalizing things, so even if the dog was housebroken in one place doesn't mean it will be housebroken at your house.  We went through _a lot_ of enzymatic cleaner at my house for our dogs trying to get adjusted to our place.\n* Behavioral and training issues.  Some dogs will need more training before they are adoptable, and it is a lot of work.\n* There's a chance you may get a foster that does not work well with your dog.  Some dogs just don't like other dogs for a myriad of reasons (some neutered dogs don't like intact dogs, some dogs don't like dogs of the same sex, some older dogs don't like younger ones, etc.).\n* Rescue fatigue is real.  Some people aren't equipped to have a revolving door of dogs, or bond so much to their foster that they can't bear to give them up.  As joyous as a \"foster fail\" is, the reality is that many fails don't continue to foster in many cases once they adopt, so you lose a foster home. \n\nThe ugly:\n\n* You see it all the time on Facebook - sometimes rescues and shelters are in such a need of foster homes that they try to guilt people into taking dogs to prevent them from being euthanized.  Sometimes the dog isn't a great fit, or have a lot of underlying issues that the average owner will be overwhelmed in dealing with.\n* Choosing your rescue or shelter wisely is important.  I fostered for the largest rescue in my previous home state because my friends had positive experiences adopting with them.  Once I got in, I found it was a cliquey place with a lot of power struggles.  On top of that, they used aversive methods while telling adopters to seek out the opposite in their adoption packets.  A person wrote a Reddit expose on them and they retaliated by posting her full name and hometown on Reddit.  Is any shelter or rescue perfect? It absolutely isn't, but the way they disrespected a lot of fosters didn't sit right with me.\n* Often times rescues or shelters make decisions you absolutely don't agree with.  The rescue I fostered for adopted out many multiple-bite dogs after an \"intensive rehab program\".\n* Sometimes support just isn't there.  Rescues and shelters are usually stretched thin.  I once asked for a training session for my foster with behavioral issues that was nipping me and no one got back to me for weeks.\n\nI'd like to think the good outweighs the bad, but I will need to take a long break from fostering after my last experience and will be even choosier picking an organization the next time around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The good:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;NEW DOG ROOMMATES.  This was the best part of the deal.  It was awesome having them around.  We got a better idea of what traits we liked and didn&amp;#39;t like in dogs.  It&amp;#39;s basically like getting a dog for free, in a sense.&lt;/li&gt;\n&lt;li&gt;It helps you learn a lot about training, and how to motivate other dogs.  Not all dogs learn things the same way and the more experience you have with different kinds of dogs, the better equipped you are to troubleshoot your dog and future dogs.&lt;/li&gt;\n&lt;li&gt;You feel pretty good making room in shelters while helping save your dog, and whatever dog the shelter can take in and take care of because you helped free up a space in it.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The bad:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Depending on your organization, you may or may not get say (or get little say) in what kind of home the dog ends up in.  You may not feel like whoever adopts the dog will give the life you want for your foster dog.&lt;/li&gt;\n&lt;li&gt;The same problem many adopters faced - you may not get the dog that was advertised to you.  Dogs are awful at generalizing things, so even if the dog was housebroken in one place doesn&amp;#39;t mean it will be housebroken at your house.  We went through &lt;em&gt;a lot&lt;/em&gt; of enzymatic cleaner at my house for our dogs trying to get adjusted to our place.&lt;/li&gt;\n&lt;li&gt;Behavioral and training issues.  Some dogs will need more training before they are adoptable, and it is a lot of work.&lt;/li&gt;\n&lt;li&gt;There&amp;#39;s a chance you may get a foster that does not work well with your dog.  Some dogs just don&amp;#39;t like other dogs for a myriad of reasons (some neutered dogs don&amp;#39;t like intact dogs, some dogs don&amp;#39;t like dogs of the same sex, some older dogs don&amp;#39;t like younger ones, etc.).&lt;/li&gt;\n&lt;li&gt;Rescue fatigue is real.  Some people aren&amp;#39;t equipped to have a revolving door of dogs, or bond so much to their foster that they can&amp;#39;t bear to give them up.  As joyous as a &amp;quot;foster fail&amp;quot; is, the reality is that many fails don&amp;#39;t continue to foster in many cases once they adopt, so you lose a foster home. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The ugly:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You see it all the time on Facebook - sometimes rescues and shelters are in such a need of foster homes that they try to guilt people into taking dogs to prevent them from being euthanized.  Sometimes the dog isn&amp;#39;t a great fit, or have a lot of underlying issues that the average owner will be overwhelmed in dealing with.&lt;/li&gt;\n&lt;li&gt;Choosing your rescue or shelter wisely is important.  I fostered for the largest rescue in my previous home state because my friends had positive experiences adopting with them.  Once I got in, I found it was a cliquey place with a lot of power struggles.  On top of that, they used aversive methods while telling adopters to seek out the opposite in their adoption packets.  A person wrote a Reddit expose on them and they retaliated by posting her full name and hometown on Reddit.  Is any shelter or rescue perfect? It absolutely isn&amp;#39;t, but the way they disrespected a lot of fosters didn&amp;#39;t sit right with me.&lt;/li&gt;\n&lt;li&gt;Often times rescues or shelters make decisions you absolutely don&amp;#39;t agree with.  The rescue I fostered for adopted out many multiple-bite dogs after an &amp;quot;intensive rehab program&amp;quot;.&lt;/li&gt;\n&lt;li&gt;Sometimes support just isn&amp;#39;t there.  Rescues and shelters are usually stretched thin.  I once asked for a training session for my foster with behavioral issues that was nipping me and no one got back to me for weeks.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;d like to think the good outweighs the bad, but I will need to take a long break from fostering after my last experience and will be even choosier picking an organization the next time around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg53w0p", "score_hidden": false, "stickied": false, "created": 1491981917.0, "created_utc": 1491953117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": "", "user_reports": [], "id": "dg593gl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imspookyboo", "parent_id": "t1_dg54iu2", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thanks so much! This is great advice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks so much! This is great advice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg593gl", "score_hidden": false, "stickied": false, "created": 1491988811.0, "created_utc": 1491960011.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg54iu2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hayitsahorse", "parent_id": "t3_64u29p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "We have no dog, so a little different in our situation but we love it! Be patient, consistent and just let the dog rest and adjust. Try to limit visitors, going to crazy new events or anything stressful for a couple weeks. Everyone will want to come see your cute new foster, wait a bit before bombarding the pup. Your biggest issue will be getting along with your existing dog, watch them both for signs of stress and give them time away from each other if they are getting overwhelmed. I like to crate train fosters so I never worry about accidents, this will give your dog a nice break as well to do his own thing.\n\nWe have had mostly great experiences!  Our biggest challenges from different dogs were barking (we live in an apartment), separation anxiety (ate a hole in our wall) and leash reactivity. \n\nThe best advice I would give is go into it setting the dog up for success, plan for the worst and you'll be able to handle the adjustment challenges.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We have no dog, so a little different in our situation but we love it! Be patient, consistent and just let the dog rest and adjust. Try to limit visitors, going to crazy new events or anything stressful for a couple weeks. Everyone will want to come see your cute new foster, wait a bit before bombarding the pup. Your biggest issue will be getting along with your existing dog, watch them both for signs of stress and give them time away from each other if they are getting overwhelmed. I like to crate train fosters so I never worry about accidents, this will give your dog a nice break as well to do his own thing.&lt;/p&gt;\n\n&lt;p&gt;We have had mostly great experiences!  Our biggest challenges from different dogs were barking (we live in an apartment), separation anxiety (ate a hole in our wall) and leash reactivity. &lt;/p&gt;\n\n&lt;p&gt;The best advice I would give is go into it setting the dog up for success, plan for the worst and you&amp;#39;ll be able to handle the adjustment challenges.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg54iu2", "score_hidden": false, "stickied": false, "created": 1491982769.0, "created_utc": 1491953969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": "", "user_reports": [], "id": "dg5oi7l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "imspookyboo", "parent_id": "t1_dg5a3jc", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Lol, I'm pretty sure this could be us too. We shall see...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol, I&amp;#39;m pretty sure this could be us too. We shall see...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5oi7l", "score_hidden": false, "stickied": false, "created": 1492019186.0, "created_utc": 1491990386.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": "", "user_reports": [], "id": "dg7lbv2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hayreindeer", "parent_id": "t1_dg5a3jc", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "same here! thats why I have three dogs instead of just the one I started out with ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;same here! thats why I have three dogs instead of just the one I started out with ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg7lbv2", "score_hidden": false, "stickied": false, "created": 1492121478.0, "created_utc": 1492092678.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5a3jc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "birdiebonanza", "parent_id": "t3_64u29p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I've kept every dog I've ever fostered. What can I say, I wasn't cut out to foster, just to adopt. Not complaining though :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve kept every dog I&amp;#39;ve ever fostered. What can I say, I wasn&amp;#39;t cut out to foster, just to adopt. Not complaining though :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5a3jc", "score_hidden": false, "stickied": false, "created": 1491990099.0, "created_utc": 1491961299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64u29p", "likes": null, "replies": "", "user_reports": [], "id": "dg5q9yn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "karisaur", "parent_id": "t3_64u29p", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "We are approved fosters for a single breed rescue I volunteer with.  Not once have we been contacted even though we've been on the approved list since late 2015. Unfortunately ours is more of a \"popularity\" contest situation. They use the same fosters over and over again and new ones generally don't get used. \n\nAsk the shelter about separation anxiety and if you have to do weekly events. Those were the things I was most concerned about after a friend of mine got a seriously anxious dog and almost got evicted for it. She was also told to lie at the weekly events about how bad her separation anxiety is. That's a worst case scenario! \n\nMost likely you'll just want to keep the dog and cry like a baby when they leave. We were told it's best to think of it as you helped them and taught them what they needed to get to their forever home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We are approved fosters for a single breed rescue I volunteer with.  Not once have we been contacted even though we&amp;#39;ve been on the approved list since late 2015. Unfortunately ours is more of a &amp;quot;popularity&amp;quot; contest situation. They use the same fosters over and over again and new ones generally don&amp;#39;t get used. &lt;/p&gt;\n\n&lt;p&gt;Ask the shelter about separation anxiety and if you have to do weekly events. Those were the things I was most concerned about after a friend of mine got a seriously anxious dog and almost got evicted for it. She was also told to lie at the weekly events about how bad her separation anxiety is. That&amp;#39;s a worst case scenario! &lt;/p&gt;\n\n&lt;p&gt;Most likely you&amp;#39;ll just want to keep the dog and cry like a baby when they leave. We were told it&amp;#39;s best to think of it as you helped them and taught them what they needed to get to their forever home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5q9yn", "score_hidden": false, "stickied": false, "created": 1492024305.0, "created_utc": 1491995505.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]