[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry in advance for a lengthy post. &lt;/p&gt;\n\n&lt;p&gt;My husband and I got together about 2 years ago. He had a Jack Russell (about 8 y.o. now) and I had a Lab/Border Collie (about 3 y.o. now). The two could not be more opposite in their personalities but have gotten along perfectly since the day they met. They are best friends, they play constantly and lay with each other. &lt;/p&gt;\n\n&lt;p&gt;The Jack Russell is my husband&amp;#39;s baby. He loves her more than anything and they are extremely connected. However, she is also extremely aggressive. She has bit and drew blood from most of our family and friends (and any dog she somehow encounters), including me. Thankfully, everyone has always been very kind to this point. &lt;/p&gt;\n\n&lt;p&gt;We have brought her to the top animal behavior clinic in our city and her diagnosis list is unbelievably lengthy. All sorts of aggression, territorial, anxiety, you name it. She is on several medications and we have many interventions to try to minimize the behavior. The specialists said she was clearly very abused before my husband adopted her (when she was about 4 y.o.) and was certainly a special case that needed extra care. We have taken the advice that we can and adjusted our lifestyle, but I don&amp;#39;t know that it is enough. &lt;/p&gt;\n\n&lt;p&gt;Her behavior affects our daily life and is quite a burden as we are always worried about her on walks, how we hug/act around her, and of course having guests over is quite an ordeal. We do everything we can to keep her and others safe but live in fear of a lawsuit or real injury. &lt;/p&gt;\n\n&lt;p&gt;We are just struggling with knowing the right thing to do. Sure, when it is just us at home, she can be wonderfully adorable and loving etc. I would never want my husband to resent me for asking her to be put down and I would never want to end a dog&amp;#39;s life without having done everything we can to help her live a happy and comfortable life. &lt;/p&gt;\n\n&lt;p&gt;We would like to have a child soon, and while she has actually always been perfect with children, we am not comfortable with having her around a baby. &lt;/p&gt;\n\n&lt;p&gt;We don&amp;#39;t think we could ever give her to someone else or back to a shelter because her anxiety is so insane she might just explode if she is left there. Also, we could not, in good conscience give her to someone else knowing her behavior. Are there places that can take and help a dog like this? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what I&amp;#39;m looking for exactly other than your thoughts on when is enough, enough? Has anyone had experience with this? We think we know the answer but it is still a really hard decision to make. &lt;/p&gt;\n\n&lt;p&gt;TL;DR our dog is very aggressive and we don&amp;#39;t know if we should seek more help or put her down. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry in advance for a lengthy post. \n\nMy husband and I got together about 2 years ago. He had a Jack Russell (about 8 y.o. now) and I had a Lab/Border Collie (about 3 y.o. now). The two could not be more opposite in their personalities but have gotten along perfectly since the day they met. They are best friends, they play constantly and lay with each other. \n\nThe Jack Russell is my husband's baby. He loves her more than anything and they are extremely connected. However, she is also extremely aggressive. She has bit and drew blood from most of our family and friends (and any dog she somehow encounters), including me. Thankfully, everyone has always been very kind to this point. \n\nWe have brought her to the top animal behavior clinic in our city and her diagnosis list is unbelievably lengthy. All sorts of aggression, territorial, anxiety, you name it. She is on several medications and we have many interventions to try to minimize the behavior. The specialists said she was clearly very abused before my husband adopted her (when she was about 4 y.o.) and was certainly a special case that needed extra care. We have taken the advice that we can and adjusted our lifestyle, but I don't know that it is enough. \n\nHer behavior affects our daily life and is quite a burden as we are always worried about her on walks, how we hug/act around her, and of course having guests over is quite an ordeal. We do everything we can to keep her and others safe but live in fear of a lawsuit or real injury. \n\nWe are just struggling with knowing the right thing to do. Sure, when it is just us at home, she can be wonderfully adorable and loving etc. I would never want my husband to resent me for asking her to be put down and I would never want to end a dog's life without having done everything we can to help her live a happy and comfortable life. \n\nWe would like to have a child soon, and while she has actually always been perfect with children, we am not comfortable with having her around a baby. \n\nWe don't think we could ever give her to someone else or back to a shelter because her anxiety is so insane she might just explode if she is left there. Also, we could not, in good conscience give her to someone else knowing her behavior. Are there places that can take and help a dog like this? \n\nI'm not sure what I'm looking for exactly other than your thoughts on when is enough, enough? Has anyone had experience with this? We think we know the answer but it is still a really hard decision to make. \n\nTL;DR our dog is very aggressive and we don't know if we should seek more help or put her down. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Help!", "id": "64vsy4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "chunkyindahead", "saved": false, "mod_reports": [], "name": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "help", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/64vsy4/help_how_do_you_know_when_it_is_time_to_put_an/", "num_reports": null, "locked": false, "stickied": false, "created": 1491996753.0, "url": "https://www.reddit.com/r/dogs/comments/64vsy4/help_how_do_you_know_when_it_is_time_to_put_an/", "author_flair_text": null, "quarantine": false, "title": "[Help] How do you know when it is time to put an aggressive dog down?", "created_utc": 1491967953.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 56, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5nw0s", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "mistymoonbeam", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "At this point, I wouldn't blame you for choosing to put her down and your concern for your future baby is very understandable. You seem to have already done a lot to help her (more than most people would have), but there is a limit for how much someone can handle. I would have a very serious talk with the behaviorists you've been using and ask them for an honest opinion on whether she can improve significantly or not. Not every dog can be fixed and chances are she'll never be able to be trusted around a baby. \n\nDon't let anyone make you feel bad about it - you have to live with this dog, not all the people that said not to put her down. You shouldn't have to always be walking on eggshells in your own house and you shouldn't have to worry about the safety of your children. Saying that ending a life is not a solution is easy to do when your dog is well behaved and you don't have to be worried about being around her. \n\nAt her age and with these behavioral problems, you will have an extremely hard time finding her a new home, so I don't think this is an option. ", "edited": 1491988770.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At this point, I wouldn&amp;#39;t blame you for choosing to put her down and your concern for your future baby is very understandable. You seem to have already done a lot to help her (more than most people would have), but there is a limit for how much someone can handle. I would have a very serious talk with the behaviorists you&amp;#39;ve been using and ask them for an honest opinion on whether she can improve significantly or not. Not every dog can be fixed and chances are she&amp;#39;ll never be able to be trusted around a baby. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let anyone make you feel bad about it - you have to live with this dog, not all the people that said not to put her down. You shouldn&amp;#39;t have to always be walking on eggshells in your own house and you shouldn&amp;#39;t have to worry about the safety of your children. Saying that ending a life is not a solution is easy to do when your dog is well behaved and you don&amp;#39;t have to be worried about being around her. &lt;/p&gt;\n\n&lt;p&gt;At her age and with these behavioral problems, you will have an extremely hard time finding her a new home, so I don&amp;#39;t think this is an option. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5nw0s", "score_hidden": false, "stickied": false, "created": 1492017239.0, "created_utc": 1491988439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg70j5p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fuzationism", "parent_id": "t1_dg6t8qm", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Absolutely. It's something that seems like it isn't talked about much in our community. Happy to help support in any way that I can. Plug for the weekly reactive dog thread in /r/dogtraining and /r/reactivedogs", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely. It&amp;#39;s something that seems like it isn&amp;#39;t talked about much in our community. Happy to help support in any way that I can. Plug for the weekly reactive dog thread in &lt;a href=\"/r/dogtraining\"&gt;/r/dogtraining&lt;/a&gt; and &lt;a href=\"/r/reactivedogs\"&gt;/r/reactivedogs&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg70j5p", "score_hidden": false, "stickied": false, "created": 1492079914.0, "created_utc": 1492051114.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6t8qm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "free_range_tofu", "parent_id": "t1_dg5l5pn", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I just want to offer you a pat on the back and tell you I'm sorry you had to go through that and I understand. It takes SO much strength to euthanize a pet for any reason, but making that choice took integrity that many people simply don't have. I'm currently in the trials of hoping not to need to, and I appreciate you for helping those of us on this side to know we're not alone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to offer you a pat on the back and tell you I&amp;#39;m sorry you had to go through that and I understand. It takes SO much strength to euthanize a pet for any reason, but making that choice took integrity that many people simply don&amp;#39;t have. I&amp;#39;m currently in the trials of hoping not to need to, and I appreciate you for helping those of us on this side to know we&amp;#39;re not alone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6t8qm", "score_hidden": false, "stickied": false, "created": 1492070969.0, "created_utc": 1492042169.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5l5pn", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "fuzationism", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm not entirely interested in talking about this in a public forum, but I put my dog down for aggression last week, so if you want to talk about it, feel free to PM me. I think you'll get a lot of advice (especially from people online) asking if you've tried x, y, or z, but your ultimate decision is yours alone and no one should make you feel bad about it. :)  \n\nEdit: I also want to say that you've done soooooo much for this dog. More than most dog owners - really. Trust me. I'm not saying that to make you feel better. I know. It has been the hardest thing I've ever had to do (and I'm crying typing this out to you) but no dog should have to be that stressed out on walks, or meeting new people, or managed, medicated and muzzled. YOU shouldn't have to worry about that especially if you want to bring a baby into your life. My pup was about forty pounds and did significant damage when biting people. We could not risk him biting a person or a child no less, living in a congested city. Again, not trying to swing you into one decision or another, but this is what ultimately led to our terrible decision. Again, please feel free to reach out. I'm happy to play devil's advocate for either side. I'm so sorry you have to go through this. I wouldn't wish this on anyone.  ", "edited": 1492007881.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not entirely interested in talking about this in a public forum, but I put my dog down for aggression last week, so if you want to talk about it, feel free to PM me. I think you&amp;#39;ll get a lot of advice (especially from people online) asking if you&amp;#39;ve tried x, y, or z, but your ultimate decision is yours alone and no one should make you feel bad about it. :)  &lt;/p&gt;\n\n&lt;p&gt;Edit: I also want to say that you&amp;#39;ve done soooooo much for this dog. More than most dog owners - really. Trust me. I&amp;#39;m not saying that to make you feel better. I know. It has been the hardest thing I&amp;#39;ve ever had to do (and I&amp;#39;m crying typing this out to you) but no dog should have to be that stressed out on walks, or meeting new people, or managed, medicated and muzzled. YOU shouldn&amp;#39;t have to worry about that especially if you want to bring a baby into your life. My pup was about forty pounds and did significant damage when biting people. We could not risk him biting a person or a child no less, living in a congested city. Again, not trying to swing you into one decision or another, but this is what ultimately led to our terrible decision. Again, please feel free to reach out. I&amp;#39;m happy to play devil&amp;#39;s advocate for either side. I&amp;#39;m so sorry you have to go through this. I wouldn&amp;#39;t wish this on anyone.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5l5pn", "score_hidden": false, "stickied": false, "created": 1492009131.0, "created_utc": 1491980331.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5uanw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "get-it-gone", "parent_id": "t1_dg5szi3", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "No problem, feel free to PM me if you want to talk about it. It is a gut wrenching decision that has no winning outcome and I remember how much I needed to talk it out at the time. I'm absolutely up for listening or answering any questions if you want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem, feel free to PM me if you want to talk about it. It is a gut wrenching decision that has no winning outcome and I remember how much I needed to talk it out at the time. I&amp;#39;m absolutely up for listening or answering any questions if you want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5uanw", "score_hidden": false, "stickied": false, "created": 1492031835.0, "created_utc": 1492003035.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5szi3", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "chunkyindahead", "parent_id": "t1_dg5qmgo", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "This sounds exactly like her. Thank you for the response. Every time she bites, before we can even react, she puts her tail between her legs and runs to a corner or her crate or under the bed. I really appreciate you taking the time to write this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds exactly like her. Thank you for the response. Every time she bites, before we can even react, she puts her tail between her legs and runs to a corner or her crate or under the bed. I really appreciate you taking the time to write this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5szi3", "score_hidden": false, "stickied": false, "created": 1492029785.0, "created_utc": 1492000985.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qmgo", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "get-it-gone", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I was in a very similar position as you just over a year ago. Except where I live, there are no dog behavioural clinics (there is a trainer almost 300km from where I lived) and I already had a newborn. After my husband had to get stitches in his hand from a dog bite, that was it. If that bite had been on our baby, it would have been a very, very serious mauling. We decided to have the dog put down, as we couldn't rehome her due to the same reasons you are hesitant to do so. Instead, we saw her through to the end, surrounded by people who loved her.\n\n\nOur dog was adopted at 5 years old with a history of abuse and forced repetitive breeding. She was a mess. She wanted very badly to be a good dog, but just never could totally grasp how to do it. She got a lot better in her years with us, but was starting to regress, she would panic and bark at things that weren't there. This panic out of nowhere was making her more likely to bite. She was too unpredictable to have around anybody, let alone a baby. It was very hard and I will always carry guilt about the decision. But ultimately, I know it was best because after every bite, it was easy to tell that the dog felt the worst about it out of anybody. She was not well and her life was becoming a constant stress of imagined and real encounters. I hope that letting her escape that was the right thing.\n\n\nIt's a deeply personal decision, but ultimately we landed on the fact that not all illnesses are physical. Our dog was undeniably sick and extremely unlikely to get better. And ultimately, this is what you do for an older dog whose illness is impacting their life this much. That is all even aside from the unpredictable dog + baby situation, which merits some serious thought all on its own. I couldn't handle the very significant potential for harm to the baby. The only thing you can ever be certain of with a dog who has bitten is that they can bite. No matter if they go years afterwards without an incident, you will never be able to fully trust that dog, especially not with a child. I didn't want to raise a kid who was afraid of dogs, either. And there would be almost no way to avoid that if our child grew up with that dog. Good luck, I hope you guys can figure it out and make peace with your decision either way. And I'm sorry you are getting responses meant to guilt you into acting according to someone else's agenda. Please don't let anyone else make you feel worse about this. They are *very fortunate* to not have ever been in a situation that allows them to understand your position and they likely just don't realize it.  ", "edited": 1491997100.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in a very similar position as you just over a year ago. Except where I live, there are no dog behavioural clinics (there is a trainer almost 300km from where I lived) and I already had a newborn. After my husband had to get stitches in his hand from a dog bite, that was it. If that bite had been on our baby, it would have been a very, very serious mauling. We decided to have the dog put down, as we couldn&amp;#39;t rehome her due to the same reasons you are hesitant to do so. Instead, we saw her through to the end, surrounded by people who loved her.&lt;/p&gt;\n\n&lt;p&gt;Our dog was adopted at 5 years old with a history of abuse and forced repetitive breeding. She was a mess. She wanted very badly to be a good dog, but just never could totally grasp how to do it. She got a lot better in her years with us, but was starting to regress, she would panic and bark at things that weren&amp;#39;t there. This panic out of nowhere was making her more likely to bite. She was too unpredictable to have around anybody, let alone a baby. It was very hard and I will always carry guilt about the decision. But ultimately, I know it was best because after every bite, it was easy to tell that the dog felt the worst about it out of anybody. She was not well and her life was becoming a constant stress of imagined and real encounters. I hope that letting her escape that was the right thing.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a deeply personal decision, but ultimately we landed on the fact that not all illnesses are physical. Our dog was undeniably sick and extremely unlikely to get better. And ultimately, this is what you do for an older dog whose illness is impacting their life this much. That is all even aside from the unpredictable dog + baby situation, which merits some serious thought all on its own. I couldn&amp;#39;t handle the very significant potential for harm to the baby. The only thing you can ever be certain of with a dog who has bitten is that they can bite. No matter if they go years afterwards without an incident, you will never be able to fully trust that dog, especially not with a child. I didn&amp;#39;t want to raise a kid who was afraid of dogs, either. And there would be almost no way to avoid that if our child grew up with that dog. Good luck, I hope you guys can figure it out and make peace with your decision either way. And I&amp;#39;m sorry you are getting responses meant to guilt you into acting according to someone else&amp;#39;s agenda. Please don&amp;#39;t let anyone else make you feel worse about this. They are &lt;em&gt;very fortunate&lt;/em&gt; to not have ever been in a situation that allows them to understand your position and they likely just don&amp;#39;t realize it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5qmgo", "score_hidden": false, "stickied": false, "created": 1492025141.0, "created_utc": 1491996341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5pevz", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "bobisbit", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I think that you're right to be worried about your dog around children. Even if she is fine with your child, you'd have to worry every time your kid has a friend over, and chances are that child's parents won't be as understanding as your family and friends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that you&amp;#39;re right to be worried about your dog around children. Even if she is fine with your child, you&amp;#39;d have to worry every time your kid has a friend over, and chances are that child&amp;#39;s parents won&amp;#39;t be as understanding as your family and friends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5pevz", "score_hidden": false, "stickied": false, "created": 1492021949.0, "created_utc": 1491993149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5p1ie", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Lilpeapod", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I had to make the same choice a few years ago. It was extremely hard and I miss her terribly. However, she almost bit my daughter across the face- she lunged from a sitting position- with 0 indication she was going to do so. This is a dog that would cuddle and sleep with her (and me) until she started walking. Then something completely snapped. And they were always supervised, she never hit the dog, teased her ect. Constant supervision. My dog had other issues as well. This was the reason we put her down. There were some other behavior issues as well, we adopted her, and she had some quirks. Aggression to adults was one thing-and while difficult- we could manage- but when it came to our child- we exhausted all options at that point, there was nothing left for us to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to make the same choice a few years ago. It was extremely hard and I miss her terribly. However, she almost bit my daughter across the face- she lunged from a sitting position- with 0 indication she was going to do so. This is a dog that would cuddle and sleep with her (and me) until she started walking. Then something completely snapped. And they were always supervised, she never hit the dog, teased her ect. Constant supervision. My dog had other issues as well. This was the reason we put her down. There were some other behavior issues as well, we adopted her, and she had some quirks. Aggression to adults was one thing-and while difficult- we could manage- but when it came to our child- we exhausted all options at that point, there was nothing left for us to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5p1ie", "score_hidden": false, "stickied": false, "created": 1492020833.0, "created_utc": 1491992033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5x8qs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "30secs2Motherwell", "parent_id": "t1_dg5wr3w", "subreddit_name_prefixed": "r/dogs", "controversiality": 1, "body": "So what would you do if you already had a dog, then ended up expecting a baby? Rehome the dog? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what would you do if you already had a dog, then ended up expecting a baby? Rehome the dog? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5x8qs", "score_hidden": false, "stickied": false, "created": 1492035732.0, "created_utc": 1492006932.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wr3w", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5f84c", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5wr3w", "score_hidden": false, "stickied": false, "created": 1492035140.0, "created_utc": 1492006340.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f84c", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "chunkyindahead", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "[Here](http://imgur.com/KDjb3sP) is her diagnosis list. Sorry I don't have a better copy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://imgur.com/KDjb3sP\"&gt;Here&lt;/a&gt; is her diagnosis list. Sorry I don&amp;#39;t have a better copy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5f84c", "score_hidden": false, "stickied": false, "created": 1491997321.0, "created_utc": 1491968521.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5v1kr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "sassyprofessor", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Your story could be mine!  I adopted a JRT who got increasingly aggressive over time.  My teenage son refused to be around him.  I got an amazing behaviorist and he attacked her.  He never just but once, he went from zero to total all on attacking until he was pulled off.  We walked on eggshells around him, never knowing what would set him off.  His attacks sent me to the ER for stitches several times.\n\nI waited 2 years and put him down.  The last straw was when I was sitting at my kitchen table writing out Christmas cards and he jumped up and clamped down on my forearm and wouldn't let go.  I dragged him to his kennel and he tried to get me through the kennel bars anytime I got near the kennel.  I knew he couldn't live in my house another day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your story could be mine!  I adopted a JRT who got increasingly aggressive over time.  My teenage son refused to be around him.  I got an amazing behaviorist and he attacked her.  He never just but once, he went from zero to total all on attacking until he was pulled off.  We walked on eggshells around him, never knowing what would set him off.  His attacks sent me to the ER for stitches several times.&lt;/p&gt;\n\n&lt;p&gt;I waited 2 years and put him down.  The last straw was when I was sitting at my kitchen table writing out Christmas cards and he jumped up and clamped down on my forearm and wouldn&amp;#39;t let go.  I dragged him to his kennel and he tried to get me through the kennel bars anytime I got near the kennel.  I knew he couldn&amp;#39;t live in my house another day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5v1kr", "score_hidden": false, "stickied": false, "created": 1492032902.0, "created_utc": 1492004102.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg6inba", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Twzl", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "It sounds like you guys have done everything that could be done, to figure out how to live with this dog. If she has the extensive bite history you mention, no one is going to adopt her. If you take her to a shelter and are honest about her history, they will have her PTS. \n\n&gt;Also, we could not, in good conscience give her to someone else knowing her behavior. Are there places that can take and help a dog like this?\n\nNo. You may find someone who thinks they are the savior of the dog world who will take her, but you won't be there when they get bitten and realize that their skills aren't as good as they were thinking they were. \n\nIf you have reached the end of the road with her, and you know that she's just a thought away from biting another human, possibly very seriously, I'd take her to the vet and have her put down. \n\nAnd I know I sound like a total asshole, but some dogs are not suited for living in a typical home. And the non-typical home that could **possibly** house her, already has dogs and probably doesn't want to deal with her. \n\nA dog with a bite history is a big liability. She can't go live in an apartment complex, and a single family home owner would be crazy to take her in. \n\nAnyone who second guesses your decision has never lived with a truly aggressive dog and does not understand the implications of owning one who has bitten repeatedly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you guys have done everything that could be done, to figure out how to live with this dog. If she has the extensive bite history you mention, no one is going to adopt her. If you take her to a shelter and are honest about her history, they will have her PTS. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Also, we could not, in good conscience give her to someone else knowing her behavior. Are there places that can take and help a dog like this?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. You may find someone who thinks they are the savior of the dog world who will take her, but you won&amp;#39;t be there when they get bitten and realize that their skills aren&amp;#39;t as good as they were thinking they were. &lt;/p&gt;\n\n&lt;p&gt;If you have reached the end of the road with her, and you know that she&amp;#39;s just a thought away from biting another human, possibly very seriously, I&amp;#39;d take her to the vet and have her put down. &lt;/p&gt;\n\n&lt;p&gt;And I know I sound like a total asshole, but some dogs are not suited for living in a typical home. And the non-typical home that could &lt;strong&gt;possibly&lt;/strong&gt; house her, already has dogs and probably doesn&amp;#39;t want to deal with her. &lt;/p&gt;\n\n&lt;p&gt;A dog with a bite history is a big liability. She can&amp;#39;t go live in an apartment complex, and a single family home owner would be crazy to take her in. &lt;/p&gt;\n\n&lt;p&gt;Anyone who second guesses your decision has never lived with a truly aggressive dog and does not understand the implications of owning one who has bitten repeatedly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6inba", "score_hidden": false, "stickied": false, "created": 1492058234.0, "created_utc": 1492029434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5i6aj", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Curious_One18", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Quite honestly, once a dog hits the point of indiscriminate aggression, I feel it would be time to put the dog down. All your vet did was list off what your dog is aggressive to, which tbh means nothing in this situation. \n\nEspecially with the fact that you're going to be having a child soon or one day, you need to understand that even if you put the dog between a gate, your child will eventually cross the gate or open the door and likely be maimed or mauled. \n\nYou have a difficult choice to make. However, keep in mind that some dogs simply are wired wrong. Even though your vet says the dog was likely abused, that doesn't even mean the dog **was** abused...he or she could just be guessing about the dogs past.\n\nEdit: holy shit, I'm not in the negative! Whoo", "edited": 1492006660.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Quite honestly, once a dog hits the point of indiscriminate aggression, I feel it would be time to put the dog down. All your vet did was list off what your dog is aggressive to, which tbh means nothing in this situation. &lt;/p&gt;\n\n&lt;p&gt;Especially with the fact that you&amp;#39;re going to be having a child soon or one day, you need to understand that even if you put the dog between a gate, your child will eventually cross the gate or open the door and likely be maimed or mauled. &lt;/p&gt;\n\n&lt;p&gt;You have a difficult choice to make. However, keep in mind that some dogs simply are wired wrong. Even though your vet says the dog was likely abused, that doesn&amp;#39;t even mean the dog &lt;strong&gt;was&lt;/strong&gt; abused...he or she could just be guessing about the dogs past.&lt;/p&gt;\n\n&lt;p&gt;Edit: holy shit, I&amp;#39;m not in the negative! Whoo&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5i6aj", "score_hidden": false, "stickied": false, "created": 1492002443.0, "created_utc": 1491973643.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5jvi6", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ONeOfTheNerdHerd", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "There is no easy answer. I was in your shoes many years ago with a dog that was abandoned with me dog sitting for a week. She was an older dog and somewhat aggressive. She got along fine with my two dogs for a very long time until one day she didn't. She kept attacking my dogs going in for the kill cuz she didn't want to share attention anymore. I tried so many different things to correct the behavior but she wasn't having it. I couldn't in good conscience find her a home with her past and present aggression issues nor would a shelter take her. Basically I had to handle the situation logically: my other two were not the problem, she was. My options were kennel 24/7 for her and everyone else's safety or make one of the hardest choices ever. I chose the latter cuz it was the least amount of suffering for her. There's no good answer or \"right\" choice. You do the best you can with what you have and if that's still not enough it's not your fault. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no easy answer. I was in your shoes many years ago with a dog that was abandoned with me dog sitting for a week. She was an older dog and somewhat aggressive. She got along fine with my two dogs for a very long time until one day she didn&amp;#39;t. She kept attacking my dogs going in for the kill cuz she didn&amp;#39;t want to share attention anymore. I tried so many different things to correct the behavior but she wasn&amp;#39;t having it. I couldn&amp;#39;t in good conscience find her a home with her past and present aggression issues nor would a shelter take her. Basically I had to handle the situation logically: my other two were not the problem, she was. My options were kennel 24/7 for her and everyone else&amp;#39;s safety or make one of the hardest choices ever. I chose the latter cuz it was the least amount of suffering for her. There&amp;#39;s no good answer or &amp;quot;right&amp;quot; choice. You do the best you can with what you have and if that&amp;#39;s still not enough it&amp;#39;s not your fault. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5jvi6", "score_hidden": false, "stickied": false, "created": 1492005949.0, "created_utc": 1491977149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5ihdc", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Rivka333", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt;We would like to have a child soon, and while she has actually always been perfect with children, we am not comfortable with having her around a baby.\n\nYeah.....as sad as it is, that's the last little detail that leads me to think you should put her down. I'm very sorry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We would like to have a child soon, and while she has actually always been perfect with children, we am not comfortable with having her around a baby.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah.....as sad as it is, that&amp;#39;s the last little detail that leads me to think you should put her down. I&amp;#39;m very sorry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5ihdc", "score_hidden": false, "stickied": false, "created": 1492003026.0, "created_utc": 1491974226.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5wcf0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kamalanc", "parent_id": "t1_dg5rlgs", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm sad and scared for them. I think they chose a bad breed as their \"starter\" \"hey let's raise this puppy together\" pet. That combined with their ignorance was just a recipe for disaster! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sad and scared for them. I think they chose a bad breed as their &amp;quot;starter&amp;quot; &amp;quot;hey let&amp;#39;s raise this puppy together&amp;quot; pet. That combined with their ignorance was just a recipe for disaster! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5wcf0", "score_hidden": false, "stickied": false, "created": 1492034624.0, "created_utc": 1492005824.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rlgs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RedRocksYeahYeah", "parent_id": "t1_dg5r2m4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Oh man, it does sound like they're afraid of their own dog. I'm so sad for them now. :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man, it does sound like they&amp;#39;re afraid of their own dog. I&amp;#39;m so sad for them now. :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5rlgs", "score_hidden": false, "stickied": false, "created": 1492027233.0, "created_utc": 1491998433.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5z5ph", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Maxthemutty", "parent_id": "t1_dg5w716", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt; I included the exact quote that stated this is what they (the owners) also do when faced with this aggression from the dog. \n\n\nSorry - I think I misunderstood it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I included the exact quote that stated this is what they (the owners) also do when faced with this aggression from the dog. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry - I think I misunderstood it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5z5ph", "score_hidden": false, "stickied": false, "created": 1492037947.0, "created_utc": 1492009147.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w716", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kamalanc", "parent_id": "t1_dg5v77l", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Oh yeah, I completely agree! Which was why I included the exact quote that stated this is what they (the owners) also do when faced with this aggression from the dog. They literally do not use the couch if the dog decides it's his for the day. Sorry if I was not clear on that! \n\nBut I don't fault them for telling the dog sitter to do that. Obviously the owners did not want to be liable for her getting attacked. Which she did. Multiple times... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yeah, I completely agree! Which was why I included the exact quote that stated this is what they (the owners) also do when faced with this aggression from the dog. They literally do not use the couch if the dog decides it&amp;#39;s his for the day. Sorry if I was not clear on that! &lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t fault them for telling the dog sitter to do that. Obviously the owners did not want to be liable for her getting attacked. Which she did. Multiple times... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5w716", "score_hidden": false, "stickied": false, "created": 1492034436.0, "created_utc": 1492005636.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v77l", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Maxthemutty", "parent_id": "t1_dg5r2m4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt; just let him sit on the couch and do nothing. This is what we do and it usually does not result in any further aggression for the time being\n\n\nNot being funny, but this is legit great advice if (and I may not have understood correctly) they had strangers coming into the home. They wouldn't want the strangers to get bitten by removing the dog from the sofa - they knew the trigger, they knew how to stop it escalating etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;just let him sit on the couch and do nothing. This is what we do and it usually does not result in any further aggression for the time being&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not being funny, but this is legit great advice if (and I may not have understood correctly) they had strangers coming into the home. They wouldn&amp;#39;t want the strangers to get bitten by removing the dog from the sofa - they knew the trigger, they knew how to stop it escalating etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5v77l", "score_hidden": false, "stickied": false, "created": 1492033119.0, "created_utc": 1492004319.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5r2m4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kamalanc", "parent_id": "t1_dg5qhry", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "The sort of instructions (very detailed) left for the dog sitter demonstrated to us that these people unknowingly cater to this dogs aggression. Example: If dog wants to sit on the couch and starts growling at you, \"just let him sit on the couch and do nothing. This is what we do and it usually does not result in any further aggression for the time being.\" They are simply afraid of the dog and could not synthesize the advice from the trainers even though in their minds they were doing all the right things.\n\nMore examples like that, but I don't want to give away too much info as I do not know what sort of info I am/am not allowed to disclose. They are good people, don't get me wrong, just a lot of bad circumstances and a bit of ignorance on their part.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The sort of instructions (very detailed) left for the dog sitter demonstrated to us that these people unknowingly cater to this dogs aggression. Example: If dog wants to sit on the couch and starts growling at you, &amp;quot;just let him sit on the couch and do nothing. This is what we do and it usually does not result in any further aggression for the time being.&amp;quot; They are simply afraid of the dog and could not synthesize the advice from the trainers even though in their minds they were doing all the right things.&lt;/p&gt;\n\n&lt;p&gt;More examples like that, but I don&amp;#39;t want to give away too much info as I do not know what sort of info I am/am not allowed to disclose. They are good people, don&amp;#39;t get me wrong, just a lot of bad circumstances and a bit of ignorance on their part.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5r2m4", "score_hidden": false, "stickied": false, "created": 1492026144.0, "created_utc": 1491997344.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qhry", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RedRocksYeahYeah", "parent_id": "t1_dg5q26m", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Can you elaborate on what the owners were doing that you were able to figure out while they were away? Or did it have something to do with their home environment?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you elaborate on what the owners were doing that you were able to figure out while they were away? Or did it have something to do with their home environment?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5qhry", "score_hidden": false, "stickied": false, "created": 1492024831.0, "created_utc": 1491996031.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5wc6m", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "GirlBosss", "parent_id": "t1_dg5q26m", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "That's what I thought too. Another home may be a better fit for him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I thought too. Another home may be a better fit for him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5wc6m", "score_hidden": false, "stickied": false, "created": 1492034616.0, "created_utc": 1492005816.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5q26m", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "kamalanc", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Hi there! I work at an animal hospital and we have a client who has a dog that is *very* similar to your terrier. Their lives are completely compromised because of this dog. They've went to behaviorists in other states to no avail. \n\nIt wasn't until one of my coworkers dog sat for this family that we truly realized all of these behaviors were a direct result of the owners. I believe that if they could find a new home (seems unlikely, unfortunately) this dog could at the very least be manageable. I am certainly not saying this is your case AT ALL, so please don't think that is what I am insinuating. Simply using this story to demonstrate that although you are doing everything in your power, and you are so awesome for doing so, it just might not be a good fit. You could be doing things that you aren't even aware of that could be triggering this dog. It is possible that you just aren't the right owners for this particular dog. A trainer or behaviorist would be the only option for a new home, IMO. Reach out to a few local trainers and see if they would take her on as a project case. \n\nAs is the case with our clients, finding homes for dogs with extensive bite history is hard. If you are unable to find her a new home/figure this out, I think the best option is euthanasia. I really do believe that dogs who act like this are not happy dogs. Best of luck, friend. Again, please don't take what I am saying the wrong way as I do not mean that at ALL! You are such great owners and have gone above and beyond what the average owner would do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there! I work at an animal hospital and we have a client who has a dog that is &lt;em&gt;very&lt;/em&gt; similar to your terrier. Their lives are completely compromised because of this dog. They&amp;#39;ve went to behaviorists in other states to no avail. &lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t until one of my coworkers dog sat for this family that we truly realized all of these behaviors were a direct result of the owners. I believe that if they could find a new home (seems unlikely, unfortunately) this dog could at the very least be manageable. I am certainly not saying this is your case AT ALL, so please don&amp;#39;t think that is what I am insinuating. Simply using this story to demonstrate that although you are doing everything in your power, and you are so awesome for doing so, it just might not be a good fit. You could be doing things that you aren&amp;#39;t even aware of that could be triggering this dog. It is possible that you just aren&amp;#39;t the right owners for this particular dog. A trainer or behaviorist would be the only option for a new home, IMO. Reach out to a few local trainers and see if they would take her on as a project case. &lt;/p&gt;\n\n&lt;p&gt;As is the case with our clients, finding homes for dogs with extensive bite history is hard. If you are unable to find her a new home/figure this out, I think the best option is euthanasia. I really do believe that dogs who act like this are not happy dogs. Best of luck, friend. Again, please don&amp;#39;t take what I am saying the wrong way as I do not mean that at ALL! You are such great owners and have gone above and beyond what the average owner would do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5q26m", "score_hidden": false, "stickied": false, "created": 1492023750.0, "created_utc": 1491994950.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5vaqq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "demondoc2019", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "My grandparents had to put down their Aussie because she couldn't be trusted and they needed to move across the country. It was sad for everyone because they loved that dog but she would bite people for seemingly no reason, including my grandparents. She was poorly bred and from a pet store and I think there are some things to happen to puppies that can't be undone. It's your dog and your life and no one else can really understand but you. I don't think that sending a dog over the rainbow bridge is a bad choice when you have done as much as you have. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My grandparents had to put down their Aussie because she couldn&amp;#39;t be trusted and they needed to move across the country. It was sad for everyone because they loved that dog but she would bite people for seemingly no reason, including my grandparents. She was poorly bred and from a pet store and I think there are some things to happen to puppies that can&amp;#39;t be undone. It&amp;#39;s your dog and your life and no one else can really understand but you. I don&amp;#39;t think that sending a dog over the rainbow bridge is a bad choice when you have done as much as you have. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5vaqq", "score_hidden": false, "stickied": false, "created": 1492033252.0, "created_utc": 1492004452.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5tawi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SnarfraTheEverliving", "parent_id": "t1_dg5nrkt", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "in that case I think you need to consider the other comments and think if you really want to risk it with your newborn. That being said, if you think this dog is reformable, a new home could work. If you think they will just go on and attack everyone there, thats a different story. I'm so sorry you have to go through this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;in that case I think you need to consider the other comments and think if you really want to risk it with your newborn. That being said, if you think this dog is reformable, a new home could work. If you think they will just go on and attack everyone there, thats a different story. I&amp;#39;m so sorry you have to go through this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5tawi", "score_hidden": false, "stickied": false, "created": 1492030298.0, "created_utc": 1492001498.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nrkt", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "chunkyindahead", "parent_id": "t1_dg5gxeq", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "It has been a year and a half and we have remained in contact with the vet still. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It has been a year and a half and we have remained in contact with the vet still. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5nrkt", "score_hidden": false, "stickied": false, "created": 1492016841.0, "created_utc": 1491988041.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gxeq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SnarfraTheEverliving", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Has it been the three months since your behaviorist visit? Medicines take awhile to actually start working", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has it been the three months since your behaviorist visit? Medicines take awhile to actually start working&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5gxeq", "score_hidden": false, "stickied": false, "created": 1492000147.0, "created_utc": 1491971347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5jzjh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DlSCONNECTED", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "We had a family dog like this. After he bit a friend of mine, unprovoked, my parents made the decision to put him down. Looking back I would've loved to counter condition him, but I think he would never have been one hundred percent reliable. It's a tough decision to make.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We had a family dog like this. After he bit a friend of mine, unprovoked, my parents made the decision to put him down. Looking back I would&amp;#39;ve loved to counter condition him, but I think he would never have been one hundred percent reliable. It&amp;#39;s a tough decision to make.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5jzjh", "score_hidden": false, "stickied": false, "created": 1492006209.0, "created_utc": 1491977409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5vas2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "girlfran69", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I have an aggressive Jack Russell as well. Resource guarding, hates other dogs, tolerates strangers until they stare at her. We're training her and there's much improvement. A baby in the future and coexisting with this dog is also our concern. However, my dog is not unpredictable. We know what ticks her off, and when she's likely to snap. I think we can make it work with a slow introduction and keeping her crated when the baby is out and about. Of course, we could be over our heads, but at least we know what to watch out for. If we do find there is no time and no way she can coexist with our future child, then we'd sadly have to put her down as well. It may be a risk, but because she's improved so much from training, I think it's fair to give her a chance with the future baby.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have an aggressive Jack Russell as well. Resource guarding, hates other dogs, tolerates strangers until they stare at her. We&amp;#39;re training her and there&amp;#39;s much improvement. A baby in the future and coexisting with this dog is also our concern. However, my dog is not unpredictable. We know what ticks her off, and when she&amp;#39;s likely to snap. I think we can make it work with a slow introduction and keeping her crated when the baby is out and about. Of course, we could be over our heads, but at least we know what to watch out for. If we do find there is no time and no way she can coexist with our future child, then we&amp;#39;d sadly have to put her down as well. It may be a risk, but because she&amp;#39;s improved so much from training, I think it&amp;#39;s fair to give her a chance with the future baby.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5vas2", "score_hidden": false, "stickied": false, "created": 1492033254.0, "created_utc": 1492004454.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg70n7a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blackwaterflo", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt;She has bit and drew blood from most of our family and friends (and any dog she somehow encounters), including me.\n\nAbsolutely not, in my book. I put a dog down after the third bite in three days. Similarly, everyone was cool about their situations and no one wanted anything to happen to her but I was not willing to accept the liability (the third person was a terrified pool man held hostage by her before she bit him). I loved her but I don't feel one bit bad about it. Matter of fact, I'm still a bit salty about it, like she let me down.\n\nI know she didn't. After I put her down, a lot of information came to light from the humane society I adopted her from that they never bothered to share with me from the get go. To put it succinctly, they were not at all surprised and told me I did the right thing. I have a good amount of anger for them to this day as well. \n\nFrom what I have read, you have gone above and beyond for her already. And personally, I wouldn't dare try and adopt her out because you know she is a danger and depending on your state and county laws, you could still be liable for harm she inflicts if you adopt her out knowing she is a dangerous dog. Especially if the new owner didn't take the correct precautions with her. \n\nI am sorry but IMO, it is not with the risk at all and I have been there.\n\nBest of luck to you. \n\nEdit: I feel the need to clarify \"I loved her but I don't feel one bit bad about it.\" My anger over the situation still shines. She was my Doodle. We worked so hard on confidence building and trust. She really wanted to be a good girl and tried hard but fear aggression is a powerful thing. She was damaged and mentally ill and I couldn't justify the amount of work that would go into possibly MAYBE making her semi-ok once she started attacking people. It was not fair for her, me, my other dogs, the children who were now frightened of her living next door. \n\nThe last night I spent with her, I cried and cried to her \"Doodle, why did you do that?\" I was so heartbroken, knowing the choice I had to make. I'm crying now about it. I even called her behaviorist the next day and told him about the previous three days. He somberly said \"Then you have to do the right thing for her.\" \n\nWhatever you decide won't be easy. Don't let anyone judge you for your decision. Only you and your husband know what is best for you and your family.", "edited": 1492051805.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She has bit and drew blood from most of our family and friends (and any dog she somehow encounters), including me.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely not, in my book. I put a dog down after the third bite in three days. Similarly, everyone was cool about their situations and no one wanted anything to happen to her but I was not willing to accept the liability (the third person was a terrified pool man held hostage by her before she bit him). I loved her but I don&amp;#39;t feel one bit bad about it. Matter of fact, I&amp;#39;m still a bit salty about it, like she let me down.&lt;/p&gt;\n\n&lt;p&gt;I know she didn&amp;#39;t. After I put her down, a lot of information came to light from the humane society I adopted her from that they never bothered to share with me from the get go. To put it succinctly, they were not at all surprised and told me I did the right thing. I have a good amount of anger for them to this day as well. &lt;/p&gt;\n\n&lt;p&gt;From what I have read, you have gone above and beyond for her already. And personally, I wouldn&amp;#39;t dare try and adopt her out because you know she is a danger and depending on your state and county laws, you could still be liable for harm she inflicts if you adopt her out knowing she is a dangerous dog. Especially if the new owner didn&amp;#39;t take the correct precautions with her. &lt;/p&gt;\n\n&lt;p&gt;I am sorry but IMO, it is not with the risk at all and I have been there.&lt;/p&gt;\n\n&lt;p&gt;Best of luck to you. &lt;/p&gt;\n\n&lt;p&gt;Edit: I feel the need to clarify &amp;quot;I loved her but I don&amp;#39;t feel one bit bad about it.&amp;quot; My anger over the situation still shines. She was my Doodle. We worked so hard on confidence building and trust. She really wanted to be a good girl and tried hard but fear aggression is a powerful thing. She was damaged and mentally ill and I couldn&amp;#39;t justify the amount of work that would go into possibly MAYBE making her semi-ok once she started attacking people. It was not fair for her, me, my other dogs, the children who were now frightened of her living next door. &lt;/p&gt;\n\n&lt;p&gt;The last night I spent with her, I cried and cried to her &amp;quot;Doodle, why did you do that?&amp;quot; I was so heartbroken, knowing the choice I had to make. I&amp;#39;m crying now about it. I even called her behaviorist the next day and told him about the previous three days. He somberly said &amp;quot;Then you have to do the right thing for her.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Whatever you decide won&amp;#39;t be easy. Don&amp;#39;t let anyone judge you for your decision. Only you and your husband know what is best for you and your family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg70n7a", "score_hidden": false, "stickied": false, "created": 1492080057.0, "created_utc": 1492051257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5tri7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hoonigan_4wd", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "small detail, I was under the impression shelters wont take a dog that has bitten anyone and drew blood. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;small detail, I was under the impression shelters wont take a dog that has bitten anyone and drew blood. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5tri7", "score_hidden": false, "stickied": false, "created": 1492031028.0, "created_utc": 1492002228.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5yzrx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "get-it-gone", "parent_id": "t1_dg5yb0r", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "You and I have very different opinions on what is humane to do with a loving, senior citizen dog who has a history of abuse and has already been rehomed at least once. The dog is not aggressive through its own fault and has found a loving home, settled in and started trusting these people after a really rough first number of years in life. This is really a judgment call that we can't make for others as to which is more humane. In my mind, it's abandoning a dog you've loved and worked to gain the trust of to a bunch of strangers in a shelter or shelter-like environment (where an adult dog with a history of abuse could have spent a bunch of time already before being adopted) on the off chance she's *not* euthanized by strangers in her already advancing age. \n\n\nObviously there are people who don't share my feelings on the matter. When I was in this situation, even though there was no rescue organization available to me, I would not have been able to do this. I figured I owed her at least to be the one there when it happened, not just handing the problem off and washing my hands of the dog, leaving her to whatever fate would befall an old, damaged and aggressive dog. She had finally settled into a loving and trusting place for probably the first time in her life. I felt like ripping her away from that was a worse fate because I saw how hard it was for her to learn to trust and become an actually happy dog. Many people will feel differently, view it differently and so will act differently, and that's okay. This is a no-win situation, so it really comes down to how an individual feels about each path and it's about doing what they personally feel is in the best interest of the dog. That's all anybody can really do! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You and I have very different opinions on what is humane to do with a loving, senior citizen dog who has a history of abuse and has already been rehomed at least once. The dog is not aggressive through its own fault and has found a loving home, settled in and started trusting these people after a really rough first number of years in life. This is really a judgment call that we can&amp;#39;t make for others as to which is more humane. In my mind, it&amp;#39;s abandoning a dog you&amp;#39;ve loved and worked to gain the trust of to a bunch of strangers in a shelter or shelter-like environment (where an adult dog with a history of abuse could have spent a bunch of time already before being adopted) on the off chance she&amp;#39;s &lt;em&gt;not&lt;/em&gt; euthanized by strangers in her already advancing age. &lt;/p&gt;\n\n&lt;p&gt;Obviously there are people who don&amp;#39;t share my feelings on the matter. When I was in this situation, even though there was no rescue organization available to me, I would not have been able to do this. I figured I owed her at least to be the one there when it happened, not just handing the problem off and washing my hands of the dog, leaving her to whatever fate would befall an old, damaged and aggressive dog. She had finally settled into a loving and trusting place for probably the first time in her life. I felt like ripping her away from that was a worse fate because I saw how hard it was for her to learn to trust and become an actually happy dog. Many people will feel differently, view it differently and so will act differently, and that&amp;#39;s okay. This is a no-win situation, so it really comes down to how an individual feels about each path and it&amp;#39;s about doing what they personally feel is in the best interest of the dog. That&amp;#39;s all anybody can really do! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5yzrx", "score_hidden": false, "stickied": false, "created": 1492037757.0, "created_utc": 1492008957.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yb0r", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "x3c3x3", "parent_id": "t1_dg5vrr9", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "That being said, I don't know what those \"many interventions\" entail.  If she truly has tried everything, then finding a rescue organization would be the right way to go.  Many breed specific organizations are willing to work on cases such as this.  I assume OP has already read this, but just in case: \nhttps://k9aggression.com/treatment-methods/rehoming/?v=7516fd43adaa", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That being said, I don&amp;#39;t know what those &amp;quot;many interventions&amp;quot; entail.  If she truly has tried everything, then finding a rescue organization would be the right way to go.  Many breed specific organizations are willing to work on cases such as this.  I assume OP has already read this, but just in case: \n&lt;a href=\"https://k9aggression.com/treatment-methods/rehoming/?v=7516fd43adaa\"&gt;https://k9aggression.com/treatment-methods/rehoming/?v=7516fd43adaa&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5yb0r", "score_hidden": false, "stickied": false, "created": 1492036981.0, "created_utc": 1492008181.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5y8en", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "get-it-gone", "parent_id": "t1_dg5xoos", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt;I personally don't think she has done enough to consider ending a loving dog's life\n\n\nYou seem like a very caring person, so I hope that you are lucky enough to never have the experiences that would make you feel differently in situations like this. Sincerely, I do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I personally don&amp;#39;t think she has done enough to consider ending a loving dog&amp;#39;s life&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You seem like a very caring person, so I hope that you are lucky enough to never have the experiences that would make you feel differently in situations like this. Sincerely, I do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5y8en", "score_hidden": false, "stickied": false, "created": 1492036897.0, "created_utc": 1492008097.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xoos", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "x3c3x3", "parent_id": "t1_dg5vrr9", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I read the post and comments three times before responding; the only new information here is the year and a half bit (was posted after I last read).  Again, this is one intervention, and we don't know how well OP followed the instructions.  Of course they tried reinforcement, but it's hard to say if they were reinforcing the correct behaviors.  And no they don't just sit around while their dogs bite people, but not everyone trains smart.  \n\nWe also don't know what she's done in that year and a half.  It takes training every day and hard work.  \n\nThe way OP wrote, her mind seemed to be made up.  She was more asking \"can I do this to my husband?\" and \"is this moral?\" than \"what else can we try?\".  Her question seemed to be looking for validation.  I personally don't think she has done enough to consider ending a loving dog's life, but you clearly disagree.\n\nI get that it is hard being in that situation, but she never asked \"what else can we do?\".  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read the post and comments three times before responding; the only new information here is the year and a half bit (was posted after I last read).  Again, this is one intervention, and we don&amp;#39;t know how well OP followed the instructions.  Of course they tried reinforcement, but it&amp;#39;s hard to say if they were reinforcing the correct behaviors.  And no they don&amp;#39;t just sit around while their dogs bite people, but not everyone trains smart.  &lt;/p&gt;\n\n&lt;p&gt;We also don&amp;#39;t know what she&amp;#39;s done in that year and a half.  It takes training every day and hard work.  &lt;/p&gt;\n\n&lt;p&gt;The way OP wrote, her mind seemed to be made up.  She was more asking &amp;quot;can I do this to my husband?&amp;quot; and &amp;quot;is this moral?&amp;quot; than &amp;quot;what else can we try?&amp;quot;.  Her question seemed to be looking for validation.  I personally don&amp;#39;t think she has done enough to consider ending a loving dog&amp;#39;s life, but you clearly disagree.&lt;/p&gt;\n\n&lt;p&gt;I get that it is hard being in that situation, but she never asked &amp;quot;what else can we do?&amp;quot;.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5xoos", "score_hidden": false, "stickied": false, "created": 1492036259.0, "created_utc": 1492007459.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vrr9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "get-it-gone", "parent_id": "t1_dg5v64w", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "A behavioural clinic is a place full of animal behavioural experts. That would include training and medical assessment. They've been at this for years by OP's own admission, I can't imagine you really think they just haven't tried offering rewards for good behaviour? People don't generally just sit around for years while their dog bites everyone around them. It just really seems like you're not actually listening to OP's position here and are instead focusing on your own agenda which seems fortunately shaped by probably never having been in OP's position. Like I said, I think your intentions are wonderfully kind, but I think you are also kind of dismissing the realities of the problem which is not helpful to someone facing, as you say, such a drastic thing. But that's just my 2 cents having actually been in OP's situation before. I just feel like this is a very emotionally involved issue that deserves a *little* more care than your average post about behaviour around here. It's not just an annoying habit, it's a very dangerous behaviour that they have exhausted themselves trying to correct and now they are facing down one of the worst decisions any animal lover can ever face.\n\n\nEdit:\n\n&gt;If they've been working hard at this for over a year and tried every therapy they can think of with absolutely no progress, that's an entirely different story\n\n\nThis is the situation OP explicitly describes if you read the post and comments. She says:\n\n&gt;She has bit and drew blood from most of our family and friends (and any dog she somehow encounters), including me.\n\n&amp;nbsp;\n\n\n&gt;We have brought her to the top animal behavior clinic in our city and her diagnosis list is unbelievably lengthy. \n\n&amp;nbsp;\n\n&gt;She is on several medications and we have many interventions to try to minimize the behavior. \n\n&amp;nbsp;\n\n\n&gt;The specialists said she was... was certainly a special case that needed extra care. We have taken the advice that we can and adjusted our lifestyle, but I don't know that it is enough. \n\n&amp;nbsp;\n\n&gt;Her behavior affects our daily life and is quite a burden as we are always worried about her \n\n&amp;nbsp;\n\n&gt;We do everything we can to keep her and others safe but live in fear of a lawsuit or real injury.    \n\n&amp;nbsp;\n\n&gt;It has been a year and a half [since seeing the behaviourist] and we have remained in contact with the vet still.   ", "edited": 1492006573.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A behavioural clinic is a place full of animal behavioural experts. That would include training and medical assessment. They&amp;#39;ve been at this for years by OP&amp;#39;s own admission, I can&amp;#39;t imagine you really think they just haven&amp;#39;t tried offering rewards for good behaviour? People don&amp;#39;t generally just sit around for years while their dog bites everyone around them. It just really seems like you&amp;#39;re not actually listening to OP&amp;#39;s position here and are instead focusing on your own agenda which seems fortunately shaped by probably never having been in OP&amp;#39;s position. Like I said, I think your intentions are wonderfully kind, but I think you are also kind of dismissing the realities of the problem which is not helpful to someone facing, as you say, such a drastic thing. But that&amp;#39;s just my 2 cents having actually been in OP&amp;#39;s situation before. I just feel like this is a very emotionally involved issue that deserves a &lt;em&gt;little&lt;/em&gt; more care than your average post about behaviour around here. It&amp;#39;s not just an annoying habit, it&amp;#39;s a very dangerous behaviour that they have exhausted themselves trying to correct and now they are facing down one of the worst decisions any animal lover can ever face.&lt;/p&gt;\n\n&lt;p&gt;Edit:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If they&amp;#39;ve been working hard at this for over a year and tried every therapy they can think of with absolutely no progress, that&amp;#39;s an entirely different story&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is the situation OP explicitly describes if you read the post and comments. She says:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She has bit and drew blood from most of our family and friends (and any dog she somehow encounters), including me.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We have brought her to the top animal behavior clinic in our city and her diagnosis list is unbelievably lengthy. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She is on several medications and we have many interventions to try to minimize the behavior. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The specialists said she was... was certainly a special case that needed extra care. We have taken the advice that we can and adjusted our lifestyle, but I don&amp;#39;t know that it is enough. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Her behavior affects our daily life and is quite a burden as we are always worried about her &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We do everything we can to keep her and others safe but live in fear of a lawsuit or real injury.    &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It has been a year and a half [since seeing the behaviourist] and we have remained in contact with the vet still.   &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5vrr9", "score_hidden": false, "stickied": false, "created": 1492033884.0, "created_utc": 1492005084.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5zvu6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Maxthemutty", "parent_id": "t1_dg5v64w", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt; it may feel like she's out of options before exhausting all of them. They also need to keep at them and be patient enough for them to fully work.\n\n\nI just want to pick up on this part. *How much is enough?* What does that look like? It will look like different things to different people depending on (perceived or very, very real) barriers such as money, time, mental strength, wanting children soon etc. \n\n\nI get that euthanasia is a difficult topic for many of us in the sub, but it is important to be able to talk about openly and with genuine understanding of what the person on the other side of the screen is going through. Sure, people can say \"Have you tried x, y &amp; z\" over and over and over, but the fact of the matter is that sometimes they *have already done enough*. \n\n\nRemember, this isn't an easy decision for anyone and the quality of life of the dog **and the owners** have to be considered. This dog is unwell. It is fearful and stressed and over-aroused, probably most of the time. That isn't a nice way to live for the dog, or for the owners. Sometimes, the hardest thing to do is the kindest and there should not be blame laid at the door of someone who has *tried*. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it may feel like she&amp;#39;s out of options before exhausting all of them. They also need to keep at them and be patient enough for them to fully work.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I just want to pick up on this part. &lt;em&gt;How much is enough?&lt;/em&gt; What does that look like? It will look like different things to different people depending on (perceived or very, very real) barriers such as money, time, mental strength, wanting children soon etc. &lt;/p&gt;\n\n&lt;p&gt;I get that euthanasia is a difficult topic for many of us in the sub, but it is important to be able to talk about openly and with genuine understanding of what the person on the other side of the screen is going through. Sure, people can say &amp;quot;Have you tried x, y &amp;amp; z&amp;quot; over and over and over, but the fact of the matter is that sometimes they &lt;em&gt;have already done enough&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Remember, this isn&amp;#39;t an easy decision for anyone and the quality of life of the dog &lt;strong&gt;and the owners&lt;/strong&gt; have to be considered. This dog is unwell. It is fearful and stressed and over-aroused, probably most of the time. That isn&amp;#39;t a nice way to live for the dog, or for the owners. Sometimes, the hardest thing to do is the kindest and there should not be blame laid at the door of someone who has &lt;em&gt;tried&lt;/em&gt;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5zvu6", "score_hidden": false, "stickied": false, "created": 1492038764.0, "created_utc": 1492009964.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v64w", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "x3c3x3", "parent_id": "t1_dg5ukwv", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Yeah, I disagree.  That's one intervention: bringing her to a clinic and getting medicine.  If that's all OP tried, then that's certainly not enough, but I assume they've done more than that. Putting a dog down is a drastic thing to do.  \n\nSince OP hasn't listed anything else that has been tried, it's hard to tell where she is at in the process.  Its easy to lose hope early on if you're not sure how to make things better.  Especially if she wants to have a kid soon, it may feel like she's out of options before exhausting all of them.  They also need to keep at them and be patient enough for them to fully work.  \n\nIf they've been working hard at this for over a year and tried every therapy they can think of with absolutely no progress, that's an entirely different story.  \n\nEdit: fixed a run on sentence.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I disagree.  That&amp;#39;s one intervention: bringing her to a clinic and getting medicine.  If that&amp;#39;s all OP tried, then that&amp;#39;s certainly not enough, but I assume they&amp;#39;ve done more than that. Putting a dog down is a drastic thing to do.  &lt;/p&gt;\n\n&lt;p&gt;Since OP hasn&amp;#39;t listed anything else that has been tried, it&amp;#39;s hard to tell where she is at in the process.  Its easy to lose hope early on if you&amp;#39;re not sure how to make things better.  Especially if she wants to have a kid soon, it may feel like she&amp;#39;s out of options before exhausting all of them.  They also need to keep at them and be patient enough for them to fully work.  &lt;/p&gt;\n\n&lt;p&gt;If they&amp;#39;ve been working hard at this for over a year and tried every therapy they can think of with absolutely no progress, that&amp;#39;s an entirely different story.  &lt;/p&gt;\n\n&lt;p&gt;Edit: fixed a run on sentence.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5v64w", "score_hidden": false, "stickied": false, "created": 1492033078.0, "created_utc": 1492004278.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ukwv", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "get-it-gone", "parent_id": "t1_dg5hzox", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "In the post itself, OP talks about the many interventions they have tried, up to and including taking the dog to the top behavioural clinic in their city, as well as medications. Your suggestions, while coming from a good place, are not compatible with the original post and however well-intentioned, will probably just serve to make OP feel more guilty than she already does for no actual benefit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the post itself, OP talks about the many interventions they have tried, up to and including taking the dog to the top behavioural clinic in their city, as well as medications. Your suggestions, while coming from a good place, are not compatible with the original post and however well-intentioned, will probably just serve to make OP feel more guilty than she already does for no actual benefit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5ukwv", "score_hidden": false, "stickied": false, "created": 1492032249.0, "created_utc": 1492003449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5mxti", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "clampie", "parent_id": "t1_dg5iv3l", "subreddit_name_prefixed": "r/dogs", "controversiality": 1, "body": "Train the person, not the dog. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Train the person, not the dog. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5mxti", "score_hidden": false, "stickied": false, "created": 1492014231.0, "created_utc": 1491985431.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5iv3l", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "x3c3x3", "parent_id": "t1_dg5hzox", "subreddit_name_prefixed": "r/dogs", "controversiality": 1, "body": "Also keep in mind how you are responding to her aggression.  If you're giving her attention or pulling her close to you (to remove her from the situation), you may be inadvertently giving her positive reinforcement.  I've read about some dogs whose negative behaviors completely change once they found and eliminated the root cause.  \n\nIf it's fear, work on trust.  If it's frustration, then work on understanding what she wants.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also keep in mind how you are responding to her aggression.  If you&amp;#39;re giving her attention or pulling her close to you (to remove her from the situation), you may be inadvertently giving her positive reinforcement.  I&amp;#39;ve read about some dogs whose negative behaviors completely change once they found and eliminated the root cause.  &lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s fear, work on trust.  If it&amp;#39;s frustration, then work on understanding what she wants.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5iv3l", "score_hidden": false, "stickied": false, "created": 1492003772.0, "created_utc": 1491974972.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hzox", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "x3c3x3", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 1, "body": "You may never forgive yourself if you put her down without being absolutely certain that's the only way.  Have you gone to a trainer and worked on getting her to be more trusting?  Offered treats and major rewards/praise for being friendly?  \n\nOne mistake it would be easy to make is trying to force her into trusting people too fast.  Starting off slowly and making sure she's comfortable every step of the way is the best way to handle this type of thing; every mistake she makes is a setback.  On top of that, dogs are a lot more comfortable if they know you're in charge, so make sure you interact with new people and dogs first and she knows that you have the situation under control.  \n\nTake what I say with a grain of salt though, I'm mostly speculating from what I've read and heard from dog trainers more experienced than I am.  I have no formal training.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may never forgive yourself if you put her down without being absolutely certain that&amp;#39;s the only way.  Have you gone to a trainer and worked on getting her to be more trusting?  Offered treats and major rewards/praise for being friendly?  &lt;/p&gt;\n\n&lt;p&gt;One mistake it would be easy to make is trying to force her into trusting people too fast.  Starting off slowly and making sure she&amp;#39;s comfortable every step of the way is the best way to handle this type of thing; every mistake she makes is a setback.  On top of that, dogs are a lot more comfortable if they know you&amp;#39;re in charge, so make sure you interact with new people and dogs first and she knows that you have the situation under control.  &lt;/p&gt;\n\n&lt;p&gt;Take what I say with a grain of salt though, I&amp;#39;m mostly speculating from what I&amp;#39;ve read and heard from dog trainers more experienced than I am.  I have no formal training.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5hzox", "score_hidden": false, "stickied": false, "created": 1492002089.0, "created_utc": 1491973289.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg6fbgx", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "Fossilwench", "parent_id": "t1_dg66q31", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "It's unfortunate you feel questions concerning an aggressive animal are condescending. Asking questions provides pieces of information to better understand what is or is not being done.\nA dog in her state should be muzzled when in the company of anyone but your husband particularly given you describe her as biting unexpectedly. In public and in your home. A dog that bites unexpectedly at random cannot be a dog that is ' fine with children '. I say this not as condescending towards you but as reality - an individual who cannot prevent a small child from getting close to an aggressive dog along with a laundry list of bites ( not just one or two but as you say almost all your family &amp; friends ) is not in a position to keep one. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s unfortunate you feel questions concerning an aggressive animal are condescending. Asking questions provides pieces of information to better understand what is or is not being done.\nA dog in her state should be muzzled when in the company of anyone but your husband particularly given you describe her as biting unexpectedly. In public and in your home. A dog that bites unexpectedly at random cannot be a dog that is &amp;#39; fine with children &amp;#39;. I say this not as condescending towards you but as reality - an individual who cannot prevent a small child from getting close to an aggressive dog along with a laundry list of bites ( not just one or two but as you say almost all your family &amp;amp; friends ) is not in a position to keep one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6fbgx", "score_hidden": false, "stickied": false, "created": 1492054816.0, "created_utc": 1492026016.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66q31", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "chunkyindahead", "parent_id": "t1_dg6674t", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "She does have a muzzle that she wears in public places. I don't know what a Baskerville is. As I've said, we do have several interventions that we have worked on but to list them all would be silly. She has improved over time. We haven't \"allowed\" her to be with children but previously living in apartment complex she inevitably encountered them on walks. Other people are not always responsible with their children or off-leash dogs. She bites unexpectedly so even when we have done all of our careful introducing and everything seems calm. Unfortunately not every single situation can be avoided and a dog can't live in a crate 24/7. We are not perfect and I am here for advice, which is welcomed, but condescending questions are not appreciated. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She does have a muzzle that she wears in public places. I don&amp;#39;t know what a Baskerville is. As I&amp;#39;ve said, we do have several interventions that we have worked on but to list them all would be silly. She has improved over time. We haven&amp;#39;t &amp;quot;allowed&amp;quot; her to be with children but previously living in apartment complex she inevitably encountered them on walks. Other people are not always responsible with their children or off-leash dogs. She bites unexpectedly so even when we have done all of our careful introducing and everything seems calm. Unfortunately not every single situation can be avoided and a dog can&amp;#39;t live in a crate 24/7. We are not perfect and I am here for advice, which is welcomed, but condescending questions are not appreciated. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg66q31", "score_hidden": false, "stickied": false, "created": 1492046038.0, "created_utc": 1492017238.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6674t", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Fossilwench", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 1, "body": "Why isn't the dog muzzle trained ? Why isn't she in a Baskerville muzzle anytime she is near anyone but your husband ? What have you done to mitigate aggressive behavior thus far ? Who has allowed her to be in the company of children in the past ? Who allowed her to be In the position to bite so many people ? Given she's a working breed have you reached out to a working dog trainer ?\n\n\nThis is your husband's dog.. Ultimately he makes the call. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why isn&amp;#39;t the dog muzzle trained ? Why isn&amp;#39;t she in a Baskerville muzzle anytime she is near anyone but your husband ? What have you done to mitigate aggressive behavior thus far ? Who has allowed her to be in the company of children in the past ? Who allowed her to be In the position to bite so many people ? Given she&amp;#39;s a working breed have you reached out to a working dog trainer ?&lt;/p&gt;\n\n&lt;p&gt;This is your husband&amp;#39;s dog.. Ultimately he makes the call. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6674t", "score_hidden": false, "stickied": false, "created": 1492045504.0, "created_utc": 1492016704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg72v0v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Y_vonie", "parent_id": "t1_dg5uwyl", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I see your point. I just personally don't believe in putting animals down for behavioral issues. I believe it can always be solved eventually with love, compassion and a lot of patience. I've seen it done. Especially, if these issues came from a history of abuse or a lack of understanding from humans. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see your point. I just personally don&amp;#39;t believe in putting animals down for behavioral issues. I believe it can always be solved eventually with love, compassion and a lot of patience. I&amp;#39;ve seen it done. Especially, if these issues came from a history of abuse or a lack of understanding from humans. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg72v0v", "score_hidden": false, "stickied": false, "created": 1492083056.0, "created_utc": 1492054256.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5uwyl", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Maxthemutty", "parent_id": "t1_dg5kr5o", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt; her quality of life is so poor or she is suffering from health reasons\n\n\nGenuine question; do you count mental health problems in the above? Quality of life is such a subjective and divisive term. For me quality of life is about mental *as well as* physical health. Dogs with this much anxiety cannot possibly be \"happy\" dogs, in my opinion. Just another angle to look at potentially. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;her quality of life is so poor or she is suffering from health reasons&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Genuine question; do you count mental health problems in the above? Quality of life is such a subjective and divisive term. For me quality of life is about mental &lt;em&gt;as well as&lt;/em&gt; physical health. Dogs with this much anxiety cannot possibly be &amp;quot;happy&amp;quot; dogs, in my opinion. Just another angle to look at potentially. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5uwyl", "score_hidden": false, "stickied": false, "created": 1492032727.0, "created_utc": 1492003927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5kr5o", "gilded": 0, "archived": false, "score": -26, "report_reasons": null, "author": "Y_vonie", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "There is always another way. Killing your dog/ending a life is never the answer. I truly believe it is not your decision to make unless her quality of life is so poor or she is suffering from health reasons. I have heard of shelters that take on special cases like these. I don't know the names on the top of my head but surely google will have some answer for you. I hope you decide not to put her down! So sad ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is always another way. Killing your dog/ending a life is never the answer. I truly believe it is not your decision to make unless her quality of life is so poor or she is suffering from health reasons. I have heard of shelters that take on special cases like these. I don&amp;#39;t know the names on the top of my head but surely google will have some answer for you. I hope you decide not to put her down! So sad &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5kr5o", "score_hidden": false, "stickied": false, "created": 1492008082.0, "created_utc": 1491979282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5uy4f", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Maxthemutty", "parent_id": "t1_dg5kmbf", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Did you read the OP?! Like, at all? \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you read the OP?! Like, at all? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5uy4f", "score_hidden": false, "stickied": false, "created": 1492032770.0, "created_utc": 1492003970.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5kmbf", "gilded": 0, "archived": false, "score": -16, "report_reasons": null, "author": "Ennuiwolf", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Ideally, you shouldn't give up unless the vet has said that it is a neurological disorder of some kind. If you haven't taken him to the vet yet, do it, because many issues are medical reasons. If he has a clean bill of health, seek help from a professional. But whatever you do, do not give up until the end. If it isn't a medical issue, there is always hope!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ideally, you shouldn&amp;#39;t give up unless the vet has said that it is a neurological disorder of some kind. If you haven&amp;#39;t taken him to the vet yet, do it, because many issues are medical reasons. If he has a clean bill of health, seek help from a professional. But whatever you do, do not give up until the end. If it isn&amp;#39;t a medical issue, there is always hope!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5kmbf", "score_hidden": false, "stickied": false, "created": 1492007745.0, "created_utc": 1491978945.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5s2pl", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "Bloodmoonwolf", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Try a few things first.\n\n*Get a head halter or Baskerville muzzle for use on walks. \n\n*Dedicate a room or pen as the dog's space. Put toys and a bed in it. Play with her in it and make it a safe/fun space to be in. This will be where she goes when there are guests over.\n\n*Put a t-shirt, wrap, or thunder shirt on her to try to help with anxiety.\n\n*Give treats and train her to be less aggressive. If hugging is triggering her, spend a few minutes everyday hugging and giving treats when she doesn't react to it and say no when she does react.\n\nTry training and using tools to deal with her aggression. Keep track of what exactly is causing it. Knowing her triggers can help you fix the problem or find her a perfect home if you have to rehome. We've had a few dogs with issues. One was aggressive towards men and nipped at my brothers when they got rowdy. Instead of putting him down, we found him an all female home to go to. A shepherd we had would bite your feet if you wore heavy boots and would generally be aggressive if you wore a hat. So no boots or hats around her. My family also had a mud room that belonged to the dogs. It was quiet and confined. They could go in there to get away or when we had guest over or we were doing something that would have upset them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try a few things first.&lt;/p&gt;\n\n&lt;p&gt;*Get a head halter or Baskerville muzzle for use on walks. &lt;/p&gt;\n\n&lt;p&gt;*Dedicate a room or pen as the dog&amp;#39;s space. Put toys and a bed in it. Play with her in it and make it a safe/fun space to be in. This will be where she goes when there are guests over.&lt;/p&gt;\n\n&lt;p&gt;*Put a t-shirt, wrap, or thunder shirt on her to try to help with anxiety.&lt;/p&gt;\n\n&lt;p&gt;*Give treats and train her to be less aggressive. If hugging is triggering her, spend a few minutes everyday hugging and giving treats when she doesn&amp;#39;t react to it and say no when she does react.&lt;/p&gt;\n\n&lt;p&gt;Try training and using tools to deal with her aggression. Keep track of what exactly is causing it. Knowing her triggers can help you fix the problem or find her a perfect home if you have to rehome. We&amp;#39;ve had a few dogs with issues. One was aggressive towards men and nipped at my brothers when they got rowdy. Instead of putting him down, we found him an all female home to go to. A shepherd we had would bite your feet if you wore heavy boots and would generally be aggressive if you wore a hat. So no boots or hats around her. My family also had a mud room that belonged to the dogs. It was quiet and confined. They could go in there to get away or when we had guest over or we were doing something that would have upset them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5s2pl", "score_hidden": false, "stickied": false, "created": 1492028180.0, "created_utc": 1491999380.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5mv9d", "gilded": 0, "archived": false, "score": -15, "report_reasons": null, "author": "clampie", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "In an episode of Cesar Milan's show, he tries to work with an aggressive dog and gets bitten. He admitted in the show he made several mistakes but took the dog with him to his training center. You see the dog in many other episodes with kids and socializing with other dogs and everyone in the background. I think he even brought her to another person's home for training.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In an episode of Cesar Milan&amp;#39;s show, he tries to work with an aggressive dog and gets bitten. He admitted in the show he made several mistakes but took the dog with him to his training center. You see the dog in many other episodes with kids and socializing with other dogs and everyone in the background. I think he even brought her to another person&amp;#39;s home for training.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5mv9d", "score_hidden": false, "stickied": false, "created": 1492014017.0, "created_utc": 1491985217.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vsy4", "likes": null, "replies": "", "user_reports": [], "id": "dg5u2ou", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "chairmanm30w", "parent_id": "t3_64vsy4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "How does your husband feel about putting her down? If he isn't on the same page how is trying to convince him to kill \"his baby\" going to affect your relationship? Have you been to a behavioralist and tried interventions beyond medication? As another comment stated, there are probably things you could change about how you interact with her that may help mitigate her aggression. I wouldn't give up just yet. Death is permanent and this poor doggo has already had a rough go. I also have an aggressive dog, and while she still has her issues, several years of learning to recognize subtle behavioral reactions, exposure to new situations, and positive reinforcement have made a world of difference. Best of luck. \nEdit: I got down voted so I take it all back. You should totally kill your dog!\n", "edited": 1492114602.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does your husband feel about putting her down? If he isn&amp;#39;t on the same page how is trying to convince him to kill &amp;quot;his baby&amp;quot; going to affect your relationship? Have you been to a behavioralist and tried interventions beyond medication? As another comment stated, there are probably things you could change about how you interact with her that may help mitigate her aggression. I wouldn&amp;#39;t give up just yet. Death is permanent and this poor doggo has already had a rough go. I also have an aggressive dog, and while she still has her issues, several years of learning to recognize subtle behavioral reactions, exposure to new situations, and positive reinforcement have made a world of difference. Best of luck. \nEdit: I got down voted so I take it all back. You should totally kill your dog!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5u2ou", "score_hidden": false, "stickied": false, "created": 1492031509.0, "created_utc": 1492002709.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}]