[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This post is somewhat long-winded and aimed at myself but I hope it helps anyone on here considering adopting a pet.  I adopted my dog, in 2004 from a city animal shelter.  I was in my second year of college and my mom was still paying for everything so I didn&amp;#39;t truly appreciate or recognize the cost associated with a pet (i.e. food, unexpected vet bills, the cost of boarding when traveling).  I also didn&amp;#39;t realize that in 4 years, I would join the military (happened to be a decision I made after school).  I traveled a lot prior to that and my cousin took care of him while I was away.  Well when I asked that he take care of the dog while I was in bootcamp, and possibly a little longer til I was financially stable, he said he would take him but only on the condition his family keep him because his stepson (12ish at the time) was getting attached.  I could see where he was coming from at the time, and the stepson loved the pooch, so I agreed, on the condition that if they ever got to a point where they couldn&amp;#39;t keep him, they give him back to me.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to about five years ago, I get a call from my cousin, asking if he can give the dog to his sister-in-law, because their youngest son was highly allergic... allegedly.  I had adopted another dog at this point, and wasn&amp;#39;t in a place financially to afford two pets, so I agreed, again stressing that he get proper care.  Well.  Know the people the pet is going to, because apparently even family can&amp;#39;t guarantee proper care of the pet.&lt;/p&gt;\n\n&lt;p&gt;About two months ago I got a call from my cousin saying the sister-in-law needed me to write a letter surrendering the now 14 year old pup to the pound, because he was registered and microchipped to me through their adoption records.  They said he wasn&amp;#39;t eating, was very sick, and needed to be euthanized.  I flew off the handle and said I wouldn&amp;#39;t, and under no circumstances would they surrender a fourteen year old dog to the pound, to be put to sleep like that, and that I would fly out (I am still military and live roughly 1500 miles away from my hometown; my cousin at this point also does not live in the same city as the sister in law), and be with my old dog to have him put to sleep humanely, myself.  I get told by my cousin, sure sure, not to worry, he&amp;#39;d handle the situation.&lt;/p&gt;\n\n&lt;p&gt;The next day I get a call.  Turns out the sister-in-law somehow was able to just dump the dog at the pound.  The pound was calling me, and surprise surprise, they want me to either surrender him to the adoption floor or come get him, because they don&amp;#39;t want to put down a perfectly healthy, happy pet.  I was FURIOUS.  At this point, I cut the family completely out and was lucky enough to have a friend that could pick up puppers from the shelter for me a few days after he&amp;#39;d be dumped.  So we sprung him and got him to the vet.  The sister-in-law had texted a picture of a bad wound his tail to my cousin to &amp;quot;prove&amp;quot; that he was sick and needed to be euthanized.  Well, the vet biopsied the wound, since we couldn&amp;#39;t figure out how it got there or what it was, and it was non-cancerous, so other than some bad gum disease, he is a perfectly healthy 14 year old pup.  Oh yeah, and he has a ravenous appetite.  He just needs softer food since his gums are bad.&lt;/p&gt;\n\n&lt;p&gt;The final outcome has been that I am now financially very able to support two pets, so I flew out to my hometown a month later, rented a car, and drove the little guy back up to be with me and my 7 year old mutt.  They are getting along great, so the story has a happy ending, but I definitely realized when I originally adopted, I was in no way prepared to handle the responsibilities of a dog.  I couldn&amp;#39;t have lived with myself if he&amp;#39;d been put down for no reason, or spent his last years alone in a pound, because we all know how hard it is to get older dogs adopted - especially when they have health issues like gum disease.  Your dog is your family, and if you can&amp;#39;t fathom dumping a child, or family member, that you just don&amp;#39;t care for anymore into prison when they&amp;#39;re old, then you shouldn&amp;#39;t be able to fathom doing the same to a pet.  &lt;/p&gt;\n\n&lt;p&gt;The new siblings are getting along great, and &lt;a href=\"http://imgur.com/a/1hx3j\"&gt;here they are on their first day together&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This post is somewhat long-winded and aimed at myself but I hope it helps anyone on here considering adopting a pet.  I adopted my dog, in 2004 from a city animal shelter.  I was in my second year of college and my mom was still paying for everything so I didn't truly appreciate or recognize the cost associated with a pet (i.e. food, unexpected vet bills, the cost of boarding when traveling).  I also didn't realize that in 4 years, I would join the military (happened to be a decision I made after school).  I traveled a lot prior to that and my cousin took care of him while I was away.  Well when I asked that he take care of the dog while I was in bootcamp, and possibly a little longer til I was financially stable, he said he would take him but only on the condition his family keep him because his stepson (12ish at the time) was getting attached.  I could see where he was coming from at the time, and the stepson loved the pooch, so I agreed, on the condition that if they ever got to a point where they couldn't keep him, they give him back to me.\n\nFast forward to about five years ago, I get a call from my cousin, asking if he can give the dog to his sister-in-law, because their youngest son was highly allergic... allegedly.  I had adopted another dog at this point, and wasn't in a place financially to afford two pets, so I agreed, again stressing that he get proper care.  Well.  Know the people the pet is going to, because apparently even family can't guarantee proper care of the pet.\n\nAbout two months ago I got a call from my cousin saying the sister-in-law needed me to write a letter surrendering the now 14 year old pup to the pound, because he was registered and microchipped to me through their adoption records.  They said he wasn't eating, was very sick, and needed to be euthanized.  I flew off the handle and said I wouldn't, and under no circumstances would they surrender a fourteen year old dog to the pound, to be put to sleep like that, and that I would fly out (I am still military and live roughly 1500 miles away from my hometown; my cousin at this point also does not live in the same city as the sister in law), and be with my old dog to have him put to sleep humanely, myself.  I get told by my cousin, sure sure, not to worry, he'd handle the situation.\n\nThe next day I get a call.  Turns out the sister-in-law somehow was able to just dump the dog at the pound.  The pound was calling me, and surprise surprise, they want me to either surrender him to the adoption floor or come get him, because they don't want to put down a perfectly healthy, happy pet.  I was FURIOUS.  At this point, I cut the family completely out and was lucky enough to have a friend that could pick up puppers from the shelter for me a few days after he'd be dumped.  So we sprung him and got him to the vet.  The sister-in-law had texted a picture of a bad wound his tail to my cousin to \"prove\" that he was sick and needed to be euthanized.  Well, the vet biopsied the wound, since we couldn't figure out how it got there or what it was, and it was non-cancerous, so other than some bad gum disease, he is a perfectly healthy 14 year old pup.  Oh yeah, and he has a ravenous appetite.  He just needs softer food since his gums are bad.\n\nThe final outcome has been that I am now financially very able to support two pets, so I flew out to my hometown a month later, rented a car, and drove the little guy back up to be with me and my 7 year old mutt.  They are getting along great, so the story has a happy ending, but I definitely realized when I originally adopted, I was in no way prepared to handle the responsibilities of a dog.  I couldn't have lived with myself if he'd been put down for no reason, or spent his last years alone in a pound, because we all know how hard it is to get older dogs adopted - especially when they have health issues like gum disease.  Your dog is your family, and if you can't fathom dumping a child, or family member, that you just don't care for anymore into prison when they're old, then you shouldn't be able to fathom doing the same to a pet.  \n\nThe new siblings are getting along great, and [here they are on their first day together](http://imgur.com/a/1hx3j)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Vent", "id": "64vvve", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 150, "report_reasons": null, "author": "Defnotmeyo", "saved": false, "mod_reports": [], "name": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "vent", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/64vvve/vent_please_wait_until_youre_truly_ready_to_adopt/", "num_reports": null, "locked": false, "stickied": false, "created": 1491997796.0, "url": "https://www.reddit.com/r/dogs/comments/64vvve/vent_please_wait_until_youre_truly_ready_to_adopt/", "author_flair_text": null, "quarantine": false, "title": "[Vent] Please Wait Until You're Truly Ready to Adopt", "created_utc": 1491968996.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 51, "visited": false, "subreddit_type": "public", "ups": 150}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg6sxps", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "slowfade1", "parent_id": "t1_dg6fa4f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "They come from the shelters heartworm positive. It is relatively rare to find a heartworm negative puppy to adopt, and the shelters can't afford to cover the recommended fast kill treatment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They come from the shelters heartworm positive. It is relatively rare to find a heartworm negative puppy to adopt, and the shelters can&amp;#39;t afford to cover the recommended fast kill treatment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6sxps", "score_hidden": false, "stickied": false, "created": 1492070583.0, "created_utc": 1492041783.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fa4f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedMare", "parent_id": "t1_dg6ef7o", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "... Yeah, but the post I commented on was saying that HW is common in their area which makes dog ownership expensive.  It doesn't, unless you neglect to get pills. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;... Yeah, but the post I commented on was saying that HW is common in their area which makes dog ownership expensive.  It doesn&amp;#39;t, unless you neglect to get pills. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6fa4f", "score_hidden": false, "stickied": false, "created": 1492054777.0, "created_utc": 1492025977.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ef7o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dividezero", "parent_id": "t1_dg6e8vl", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "right but not if they weren't on anything in the first place.  Which is further reason to make sure you get them on it and keep them on it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;right but not if they weren&amp;#39;t on anything in the first place.  Which is further reason to make sure you get them on it and keep them on it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6ef7o", "score_hidden": false, "stickied": false, "created": 1492053899.0, "created_utc": 1492025099.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e8vl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedMare", "parent_id": "t1_dg6dtrr", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "If they come up HW positive, some heartworm pill companies pay for treatment, as long as you have a receipt for the pill and got it from a vet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If they come up HW positive, some heartworm pill companies pay for treatment, as long as you have a receipt for the pill and got it from a vet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6e8vl", "score_hidden": false, "stickied": false, "created": 1492053716.0, "created_utc": 1492024916.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg6pz3t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PartyPorpoise", "parent_id": "t1_dg6dtrr", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "My dog had heartworms once. They were all dead by the time the vet found them so they didn't pose much threat, but it was still a lot of expense and a pain in the ass to treat to them. (her heart rate had to be kept down, so no walks, and we weren't allowed to go out and see her because she'd get excited. Poor girl was so lonely all during treatment) My family is definitely serious about her heartworm prevention!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dog had heartworms once. They were all dead by the time the vet found them so they didn&amp;#39;t pose much threat, but it was still a lot of expense and a pain in the ass to treat to them. (her heart rate had to be kept down, so no walks, and we weren&amp;#39;t allowed to go out and see her because she&amp;#39;d get excited. Poor girl was so lonely all during treatment) My family is definitely serious about her heartworm prevention!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6pz3t", "score_hidden": false, "stickied": false, "created": 1492066908.0, "created_utc": 1492038108.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dtrr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dividezero", "parent_id": "t1_dg671ra", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "that's about right unless they're ever positive.  And it varies by weight.  We had a giant dog that was heartworm positive in the past so the meds were..  i honestly can't remember since it wasn't something i was trying to skimp on but I think $300 for 6 months.  it definitely was more than $100/year plus the actual treatment (thankfully we caught it early) was in the thousands.\n\nI can't imagine skimping on annual visits but that's me.  if you do one thing for your dog, get the right medication and give it to them once a month.  for us, one little pill takes care of basically all the worms, ticks, fleas and I don't remember what all else for 4 weeks (30 days, whatever).  it's expensive but the other side of any of those things is infinitely more expensive and unless they live in a bubble, there's a not insignificant chance of them running into some of that mess.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;that&amp;#39;s about right unless they&amp;#39;re ever positive.  And it varies by weight.  We had a giant dog that was heartworm positive in the past so the meds were..  i honestly can&amp;#39;t remember since it wasn&amp;#39;t something i was trying to skimp on but I think $300 for 6 months.  it definitely was more than $100/year plus the actual treatment (thankfully we caught it early) was in the thousands.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t imagine skimping on annual visits but that&amp;#39;s me.  if you do one thing for your dog, get the right medication and give it to them once a month.  for us, one little pill takes care of basically all the worms, ticks, fleas and I don&amp;#39;t remember what all else for 4 weeks (30 days, whatever).  it&amp;#39;s expensive but the other side of any of those things is infinitely more expensive and unless they live in a bubble, there&amp;#39;s a not insignificant chance of them running into some of that mess.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6dtrr", "score_hidden": false, "stickied": false, "created": 1492053282.0, "created_utc": 1492024482.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg671ra", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RedMare", "parent_id": "t1_dg638uy", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt; not to mention the fact that we live in an area where heartworm infections are extremely common, and that treatment is NOT cheap. \n\nHeartworm prevention is pretty cheap though?  I don't remember what exactly I pay but I think it's something like $100/year, and you can buy 3 months at a time to save money. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;not to mention the fact that we live in an area where heartworm infections are extremely common, and that treatment is NOT cheap. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Heartworm prevention is pretty cheap though?  I don&amp;#39;t remember what exactly I pay but I think it&amp;#39;s something like $100/year, and you can buy 3 months at a time to save money. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg671ra", "score_hidden": false, "stickied": false, "created": 1492046368.0, "created_utc": 1492017568.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg6jjwg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iamshiny", "parent_id": "t1_dg638uy", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I live in a college town so I feel ya. Every freaking semester cats and dogs go up for adoption/sale. Usually when they're 6 to 18 months old. 😡", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live in a college town so I feel ya. Every freaking semester cats and dogs go up for adoption/sale. Usually when they&amp;#39;re 6 to 18 months old. 😡&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6jjwg", "score_hidden": false, "stickied": false, "created": 1492059194.0, "created_utc": 1492030394.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg6pw99", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PartyPorpoise", "parent_id": "t1_dg638uy", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I saw the same thing at my school. I'm surprised animal shelters aren't stricter about adopting to college students. One of my roommates adopted a kitten with her boyfriend. After they broke up, she lost interest and he wanted to take it, but he lived with his parents and his mom said no. I got attached to the cat so I convinced my parents to take it. One of my other roommates got a puppy, and it didn't get walked or played with enough so it barked constantly. (in an apartment where pets weren't allowed, so I was afraid we'd all get in trouble) I think she thought her live-in boyfriend was going to contribute more than he did, as they adopted the dog together and he was home more often. I would have offered to walk it a bit, but again, this was a no-pets apartment and I didn't want to get caught. So she took it back to the shelter, it was sad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw the same thing at my school. I&amp;#39;m surprised animal shelters aren&amp;#39;t stricter about adopting to college students. One of my roommates adopted a kitten with her boyfriend. After they broke up, she lost interest and he wanted to take it, but he lived with his parents and his mom said no. I got attached to the cat so I convinced my parents to take it. One of my other roommates got a puppy, and it didn&amp;#39;t get walked or played with enough so it barked constantly. (in an apartment where pets weren&amp;#39;t allowed, so I was afraid we&amp;#39;d all get in trouble) I think she thought her live-in boyfriend was going to contribute more than he did, as they adopted the dog together and he was home more often. I would have offered to walk it a bit, but again, this was a no-pets apartment and I didn&amp;#39;t want to get caught. So she took it back to the shelter, it was sad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6pw99", "score_hidden": false, "stickied": false, "created": 1492066810.0, "created_utc": 1492038010.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg638uy", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "slowfade1", "parent_id": "t1_dg5juui", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I teach college and I see SO MANY students with little puppies every year that I want to scream. I don't even have the time to deal with a puppy, not to mention the fact that we live in an area where heartworm infections are extremely common, and that treatment is NOT cheap.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I teach college and I see SO MANY students with little puppies every year that I want to scream. I don&amp;#39;t even have the time to deal with a puppy, not to mention the fact that we live in an area where heartworm infections are extremely common, and that treatment is NOT cheap.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg638uy", "score_hidden": false, "stickied": false, "created": 1492042436.0, "created_utc": 1492013636.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg5ydjn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "degaman", "parent_id": "t1_dg5w8oy", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "This is truly a great post. All potential first time dog owners need to read this before they make a decision. I made the same mistake you did about 15 years ago. I rescued a dog while I was in my 20's and not in a stable situation. I moved several times and never had enough money. After about a year I finally found her a good home. She lived a happy life and died just a few years ago.\n\nWhen I was finally a stable homeowner I adopted a 1 year old golden. 3 years later I adopted another 2 year old. Now we're a happy pack that is well-fed with regular vet treatment. Thanks for your story!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is truly a great post. All potential first time dog owners need to read this before they make a decision. I made the same mistake you did about 15 years ago. I rescued a dog while I was in my 20&amp;#39;s and not in a stable situation. I moved several times and never had enough money. After about a year I finally found her a good home. She lived a happy life and died just a few years ago.&lt;/p&gt;\n\n&lt;p&gt;When I was finally a stable homeowner I adopted a 1 year old golden. 3 years later I adopted another 2 year old. Now we&amp;#39;re a happy pack that is well-fed with regular vet treatment. Thanks for your story!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5ydjn", "score_hidden": false, "stickied": false, "created": 1492037061.0, "created_utc": 1492008261.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w8oy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg5juui", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank you so much for your comments. I am sure you can't wait to get out of school to swoop one up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for your comments. I am sure you can&amp;#39;t wait to get out of school to swoop one up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5w8oy", "score_hidden": false, "stickied": false, "created": 1492034493.0, "created_utc": 1492005693.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5juui", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "iamshiny", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Already on it. Having worked as a vet tech and a human society volunteer, I would be a hypocrite if I got a dog right now. As much as it kills me, I'm waiting until I have the time and money after school.\nAlso, you did way more than what the average person would do. Thank you for sticking with your puppers. You are the type of owner that gives shelter workers hope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Already on it. Having worked as a vet tech and a human society volunteer, I would be a hypocrite if I got a dog right now. As much as it kills me, I&amp;#39;m waiting until I have the time and money after school.\nAlso, you did way more than what the average person would do. Thank you for sticking with your puppers. You are the type of owner that gives shelter workers hope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5juui", "score_hidden": false, "stickied": false, "created": 1492005903.0, "created_utc": 1491977103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg7586b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg5obbw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "And honestly, unless they really need a ton of medical care, they're not any more difficult than a puppy or teenager.  Most times, they are easier.  My old guy has been incredibly easy already.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And honestly, unless they really need a ton of medical care, they&amp;#39;re not any more difficult than a puppy or teenager.  Most times, they are easier.  My old guy has been incredibly easy already.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg7586b", "score_hidden": false, "stickied": false, "created": 1492086630.0, "created_utc": 1492057830.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5obbw", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "generalrules", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Also, it kills me that people think you can just throw away a dog because they are old. \n\nOld dogs are harder to care for, but they are also incredible companions, besides being a living creature, for christ's sakes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, it kills me that people think you can just throw away a dog because they are old. &lt;/p&gt;\n\n&lt;p&gt;Old dogs are harder to care for, but they are also incredible companions, besides being a living creature, for christ&amp;#39;s sakes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5obbw", "score_hidden": false, "stickied": false, "created": 1492018577.0, "created_utc": 1491989777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg5qwr0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Colorguarder08", "parent_id": "t1_dg5q9qe", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "College town but might as well be out in the country", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;College town but might as well be out in the country&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5qwr0", "score_hidden": false, "stickied": false, "created": 1492025789.0, "created_utc": 1491996989.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5q9qe", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CritFailingLife", "parent_id": "t1_dg5p93u", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Sounds like you've got the food storage covered pretty well, but eek, what kind of emergency vet isn't equipped to handle torn stitches?  I'm guessing you're out in the country and the \"options\" are go to the only local vet or drive for hours.  I don't get being open for emergencies and not being equipped to handle even a simple one like replacing stitches...I'd laugh at the absurdity of it if it didn't mean people wound up with no care or sitting in a parking lot literally holding their dog together like you had to.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you&amp;#39;ve got the food storage covered pretty well, but eek, what kind of emergency vet isn&amp;#39;t equipped to handle torn stitches?  I&amp;#39;m guessing you&amp;#39;re out in the country and the &amp;quot;options&amp;quot; are go to the only local vet or drive for hours.  I don&amp;#39;t get being open for emergencies and not being equipped to handle even a simple one like replacing stitches...I&amp;#39;d laugh at the absurdity of it if it didn&amp;#39;t mean people wound up with no care or sitting in a parking lot literally holding their dog together like you had to.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5q9qe", "score_hidden": false, "stickied": false, "created": 1492024289.0, "created_utc": 1491995489.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg62r6f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BraveJJ", "parent_id": "t1_dg60oki", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I love Chewy!! It's where we get our kitty's renal food too!!! I have it set to Autoship which is making my life infinitely easier. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love Chewy!! It&amp;#39;s where we get our kitty&amp;#39;s renal food too!!! I have it set to Autoship which is making my life infinitely easier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg62r6f", "score_hidden": false, "stickied": false, "created": 1492041902.0, "created_utc": 1492013102.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg6elzb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Colorguarder08", "parent_id": "t1_dg60oki", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I keep an eye for it online currently it is $3 cheaper per bag to buy it in store. There are only two stores near me that sell it and my dog can only have the one variety of that brand otherwise I'm cleaning up his runny messes for the next 6 weeks. I always have a minimum of 3 unopened bags on hand", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I keep an eye for it online currently it is $3 cheaper per bag to buy it in store. There are only two stores near me that sell it and my dog can only have the one variety of that brand otherwise I&amp;#39;m cleaning up his runny messes for the next 6 weeks. I always have a minimum of 3 unopened bags on hand&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6elzb", "score_hidden": false, "stickied": false, "created": 1492054096.0, "created_utc": 1492025296.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60oki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CritFailingLife", "parent_id": "t1_dg5r3t7", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "You might want to check into the a availability of your type of dog food from online shops, too. We first looked online when our vet suggested it for the prescription diet our kidney disease kitty needed since getting it from a vet is twice as much as getting it online and you can't get it just at the pet store. Once we were already using the online service, we noticed that the dog food we used was also available there and was slightly cheaper than we were paying locally and since we'd been having more and more trouble actually getting it locally (a few times the order was delayed, a few other times they sold our special order food to other people instead of setting it aside and calling us - it was a brand they carried, but a specific variety they didn't always sell on the shelves) and since we needed the food for a pup with allergies, it was pretty shitty when it didn't show up and we had to scramble for options. So we gave getting it online a go and it was delivered regularly without fail. I still keep at least a month worth of food on hand at all times in case of emergencies or supply issues, but aside from my normal buffer supply, we haven't had to worry at all about finding it or getting it in time. We've been using the [same company](http://www.chewy.com) for about 2 years now and are still quite happy with them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might want to check into the a availability of your type of dog food from online shops, too. We first looked online when our vet suggested it for the prescription diet our kidney disease kitty needed since getting it from a vet is twice as much as getting it online and you can&amp;#39;t get it just at the pet store. Once we were already using the online service, we noticed that the dog food we used was also available there and was slightly cheaper than we were paying locally and since we&amp;#39;d been having more and more trouble actually getting it locally (a few times the order was delayed, a few other times they sold our special order food to other people instead of setting it aside and calling us - it was a brand they carried, but a specific variety they didn&amp;#39;t always sell on the shelves) and since we needed the food for a pup with allergies, it was pretty shitty when it didn&amp;#39;t show up and we had to scramble for options. So we gave getting it online a go and it was delivered regularly without fail. I still keep at least a month worth of food on hand at all times in case of emergencies or supply issues, but aside from my normal buffer supply, we haven&amp;#39;t had to worry at all about finding it or getting it in time. We&amp;#39;ve been using the &lt;a href=\"http://www.chewy.com\"&gt;same company&lt;/a&gt; for about 2 years now and are still quite happy with them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg60oki", "score_hidden": false, "stickied": false, "created": 1492039641.0, "created_utc": 1492010841.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5r3t7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Colorguarder08", "parent_id": "t1_dg5qnsj", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I do have a savings account for the animals but I still like to keep 500 on the account at the vets in case I accidently leave my cards at home or didn't bring enough cash bird can cost a lot when they get sick. I spent $700 on one of my birds back in January because the person who watched them did things she was told not and of course one of the birds got sick. I brought $300 so having that extra buffer there really helps. My dog does have food allergies so I stick with this food because he does best on it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do have a savings account for the animals but I still like to keep 500 on the account at the vets in case I accidently leave my cards at home or didn&amp;#39;t bring enough cash bird can cost a lot when they get sick. I spent $700 on one of my birds back in January because the person who watched them did things she was told not and of course one of the birds got sick. I brought $300 so having that extra buffer there really helps. My dog does have food allergies so I stick with this food because he does best on it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5r3t7", "score_hidden": false, "stickied": false, "created": 1492026220.0, "created_utc": 1491997420.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qnsj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "oneelectricsheep", "parent_id": "t1_dg5p93u", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "The other reason you might consider a savings account is that you earn interest on the account which while it may be a few cents or a couple dollars is still money you're leaving on the table. Also if you put it on your credit card and immediately pay it off it helps build credit. \n\nAnother reason stockpiling food is less than optimal is that dogs can become allergic or just not do well on certain brands . If you've already bought a bunch and they need a special diet you're SOL. \n\nIf it works for you that's fine but it is less than optimal for some people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The other reason you might consider a savings account is that you earn interest on the account which while it may be a few cents or a couple dollars is still money you&amp;#39;re leaving on the table. Also if you put it on your credit card and immediately pay it off it helps build credit. &lt;/p&gt;\n\n&lt;p&gt;Another reason stockpiling food is less than optimal is that dogs can become allergic or just not do well on certain brands . If you&amp;#39;ve already bought a bunch and they need a special diet you&amp;#39;re SOL. &lt;/p&gt;\n\n&lt;p&gt;If it works for you that&amp;#39;s fine but it is less than optimal for some people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5qnsj", "score_hidden": false, "stickied": false, "created": 1492025226.0, "created_utc": 1491996426.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5p93u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Colorguarder08", "parent_id": "t1_dg5p3t3", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I keep the dog food in a galvanized steel garbage can the unopened bags are in a huge one I forget how big but bigger than our out door garbage can and the open bag is kept in a 10gallon one which eliminates my dogs ability to open the food bin or get into an open bag. It also prevents bugs and rodents from getting into it. The last time I tried to take my dog to the only emergency vet clinic (got home around 7:30am from work and saw she chewed open his stitches and ate the e-collar from surgery) they refused to take him because they \"weren't\" set up for that kind of situation. I sat in the parking lot of the vets office (switched vets after he healed) for two hours holding his leg closed with one hand and his mouth with the other as he was trying to bite me for holding his leg closed", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I keep the dog food in a galvanized steel garbage can the unopened bags are in a huge one I forget how big but bigger than our out door garbage can and the open bag is kept in a 10gallon one which eliminates my dogs ability to open the food bin or get into an open bag. It also prevents bugs and rodents from getting into it. The last time I tried to take my dog to the only emergency vet clinic (got home around 7:30am from work and saw she chewed open his stitches and ate the e-collar from surgery) they refused to take him because they &amp;quot;weren&amp;#39;t&amp;quot; set up for that kind of situation. I sat in the parking lot of the vets office (switched vets after he healed) for two hours holding his leg closed with one hand and his mouth with the other as he was trying to bite me for holding his leg closed&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5p93u", "score_hidden": false, "stickied": false, "created": 1492021474.0, "created_utc": 1491992674.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg5xe4e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PryceTheHippo", "parent_id": "t1_dg5waen", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5xe4e", "score_hidden": false, "stickied": false, "created": 1492035909.0, "created_utc": 1492007109.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5waen", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CritFailingLife", "parent_id": "t1_dg5w13a", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "We were using Ing back in the day and after they were purchased it became CapitolOne360 and we're still pretty happy with it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We were using Ing back in the day and after they were purchased it became CapitolOne360 and we&amp;#39;re still pretty happy with it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5waen", "score_hidden": false, "stickied": false, "created": 1492034554.0, "created_utc": 1492005754.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w13a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PryceTheHippo", "parent_id": "t1_dg5p3t3", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Mind if I ask which bank you use for this? Divvying my savings and putting back for the pup specifically would help my peace of mind a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mind if I ask which bank you use for this? Divvying my savings and putting back for the pup specifically would help my peace of mind a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5w13a", "score_hidden": false, "stickied": false, "created": 1492034221.0, "created_utc": 1492005421.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5p3t3", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "CritFailingLife", "parent_id": "t1_dg5losr", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "The weird looks are probably because that's an atypical way of going about ensuring there's enough money for dog food and vet visits. \n  \nThere are a couple of disadvantages to the stocking up and prepaying method:\n  \n* Storing all the bags of food takes up space, the food gets older as it waits to be used so it's less fresh for your pup, and the chances of bug or critter infestations happening go up when you're storing more food for more time (odds of noticing a small puncture in a package are lower when you have a bunch of then stacked up than when there is only *the* package and bugs or critters could get interested in stuff coming out holes or chew through). \n* Prepaying for regular veterinary care reduces flexibility of the funds such that if there were an emergency and you had to take your pup to the emergency vet, the funds would still be tied up at your closed regular vet. \n  \nI'd recommend doing something more like my partner and I do. We use separate savings accounts in an online bank so that money is set aside for different specific things. We can create up to like 20 or so accounts and give them different names, so it works for a bunch of different things at once. It's also a great way to budget so that instead of having all of the costs of an annual check up and vaccines at once, you spread it out evenly over the year. We totaled up what the regular veterinary care for the year would be and then divided it by the number of paychecks we get and set it up to automatically transfer that amount from the checking account our paychecks go into on paydays. \n  \nSo, say care for one of my dogs is $480 a year and I get paid on the first and 15th, that's 24 paychecks a year, $480/24=$20, so I set it to automatically transfer $20 every payday and it goes straight to the savings account labeled \"regular veterinary care\" and then when it's checkup time, I just withdraw that money (or transfer it to the checking account and immediately pay the credit card off if I want points or miles or whatever bonus my credit card gives me). We have one for regular veterinary care and another for emergency veterinary care so if an emergency or unexpected illness occurs, we won't have to scramble for cash. \n  \nWe use this for non-pet related things as well.  Some things are regularly occurring but not monthly expenses like twice a year or once a year bills for things like insurance (homeowners/renters/automotive) or property tax. Other things are savings goals we'd like to put a little bit aside for without thinking about it, so we might take $20/paycheck and put it towards a new computer and then get a computer once there's enough in the computer savings account. Other things are expenses we know we're going to have but can't predict like an appliance repair/replacement fund or home repairs fund or a car repair/replacement fund. \n  \nSure we could just put it all into a single savings account, but earmarked accounts make it easier to remember how much you've set aside for what, help me not stress about it because I know there's x much just waiting for that thing, and help me not stress because if it's all in one account even if I know I saved some of it for a specific purpose, there's still this feeling of oh god, all our money is disappearing and we'll be completely fucked. \n  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The weird looks are probably because that&amp;#39;s an atypical way of going about ensuring there&amp;#39;s enough money for dog food and vet visits. &lt;/p&gt;\n\n&lt;p&gt;There are a couple of disadvantages to the stocking up and prepaying method:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Storing all the bags of food takes up space, the food gets older as it waits to be used so it&amp;#39;s less fresh for your pup, and the chances of bug or critter infestations happening go up when you&amp;#39;re storing more food for more time (odds of noticing a small puncture in a package are lower when you have a bunch of then stacked up than when there is only &lt;em&gt;the&lt;/em&gt; package and bugs or critters could get interested in stuff coming out holes or chew through). &lt;/li&gt;\n&lt;li&gt;Prepaying for regular veterinary care reduces flexibility of the funds such that if there were an emergency and you had to take your pup to the emergency vet, the funds would still be tied up at your closed regular vet. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;d recommend doing something more like my partner and I do. We use separate savings accounts in an online bank so that money is set aside for different specific things. We can create up to like 20 or so accounts and give them different names, so it works for a bunch of different things at once. It&amp;#39;s also a great way to budget so that instead of having all of the costs of an annual check up and vaccines at once, you spread it out evenly over the year. We totaled up what the regular veterinary care for the year would be and then divided it by the number of paychecks we get and set it up to automatically transfer that amount from the checking account our paychecks go into on paydays. &lt;/p&gt;\n\n&lt;p&gt;So, say care for one of my dogs is $480 a year and I get paid on the first and 15th, that&amp;#39;s 24 paychecks a year, $480/24=$20, so I set it to automatically transfer $20 every payday and it goes straight to the savings account labeled &amp;quot;regular veterinary care&amp;quot; and then when it&amp;#39;s checkup time, I just withdraw that money (or transfer it to the checking account and immediately pay the credit card off if I want points or miles or whatever bonus my credit card gives me). We have one for regular veterinary care and another for emergency veterinary care so if an emergency or unexpected illness occurs, we won&amp;#39;t have to scramble for cash. &lt;/p&gt;\n\n&lt;p&gt;We use this for non-pet related things as well.  Some things are regularly occurring but not monthly expenses like twice a year or once a year bills for things like insurance (homeowners/renters/automotive) or property tax. Other things are savings goals we&amp;#39;d like to put a little bit aside for without thinking about it, so we might take $20/paycheck and put it towards a new computer and then get a computer once there&amp;#39;s enough in the computer savings account. Other things are expenses we know we&amp;#39;re going to have but can&amp;#39;t predict like an appliance repair/replacement fund or home repairs fund or a car repair/replacement fund. &lt;/p&gt;\n\n&lt;p&gt;Sure we could just put it all into a single savings account, but earmarked accounts make it easier to remember how much you&amp;#39;ve set aside for what, help me not stress about it because I know there&amp;#39;s x much just waiting for that thing, and help me not stress because if it&amp;#39;s all in one account even if I know I saved some of it for a specific purpose, there&amp;#39;s still this feeling of oh god, all our money is disappearing and we&amp;#39;ll be completely fucked. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5p3t3", "score_hidden": false, "stickied": false, "created": 1492021026.0, "created_utc": 1491992226.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5losr", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "Colorguarder08", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Not really related but I don't understand the werid looks I get when I stock up on dog food or put extra money on my animals account at the vets office. When I got my dog as a 3 month old puppy 5 years ago I ended up losing my job later that week however the next week I got my tax refund which was over $1,400 I spent over $600 of it stocking up on puppy food bought like seven 30lbs bags of different flavors of a hard to find grain free food. One of the cashiers asked me how many dogs I had and I replied just the puppy (who was with me) and she got a really confused look and asked me why I was buying so much dog food then and I explained to her that I had recently lost my job and since I had already planned to take care if my grandmother after her back surgery I don't know how long it will take me to find another and I didn't want to chance my dog going hungry. I also set up a ln account at the vets and paid $400 to be sure he was able to get his vaccines and flea meds while I was unemployed. I spent the rest on various other dog supplies. I might not always have a ton of money but I make sure my animals get what they need. I don't think people need to be questioned on why they are providing for their pets in whatever manner they are as long as the dog is well taken care of.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really related but I don&amp;#39;t understand the werid looks I get when I stock up on dog food or put extra money on my animals account at the vets office. When I got my dog as a 3 month old puppy 5 years ago I ended up losing my job later that week however the next week I got my tax refund which was over $1,400 I spent over $600 of it stocking up on puppy food bought like seven 30lbs bags of different flavors of a hard to find grain free food. One of the cashiers asked me how many dogs I had and I replied just the puppy (who was with me) and she got a really confused look and asked me why I was buying so much dog food then and I explained to her that I had recently lost my job and since I had already planned to take care if my grandmother after her back surgery I don&amp;#39;t know how long it will take me to find another and I didn&amp;#39;t want to chance my dog going hungry. I also set up a ln account at the vets and paid $400 to be sure he was able to get his vaccines and flea meds while I was unemployed. I spent the rest on various other dog supplies. I might not always have a ton of money but I make sure my animals get what they need. I don&amp;#39;t think people need to be questioned on why they are providing for their pets in whatever manner they are as long as the dog is well taken care of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5losr", "score_hidden": false, "stickied": false, "created": 1492010560.0, "created_utc": 1491981760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg5g2qq", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "giants888", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm glad it all worked out and you were re-united. :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad it all worked out and you were re-united. :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5g2qq", "score_hidden": false, "stickied": false, "created": 1491998684.0, "created_utc": 1491969884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg5ibat", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Ironbornsuck", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "They look so cute together! I have a soft spot for older dogs : )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They look so cute together! I have a soft spot for older dogs : )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5ibat", "score_hidden": false, "stickied": false, "created": 1492002702.0, "created_utc": 1491973902.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg6z32e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tunzaroo", "parent_id": "t1_dg6qcrr", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I also don't understand how anyone can give up an animal they've bonded with. \n\nI had to leave my rabbit with my parents for three months once, and I cried and missed him. And he's an asshole who doesn't even like interacting with me. How anyone could lightly give up a dog is beyond me. I've only had mine for seven months, and I already love her to bits and would be hysterical if I had to give her up for any reason. I'd do anything to make sure I could keep her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also don&amp;#39;t understand how anyone can give up an animal they&amp;#39;ve bonded with. &lt;/p&gt;\n\n&lt;p&gt;I had to leave my rabbit with my parents for three months once, and I cried and missed him. And he&amp;#39;s an asshole who doesn&amp;#39;t even like interacting with me. How anyone could lightly give up a dog is beyond me. I&amp;#39;ve only had mine for seven months, and I already love her to bits and would be hysterical if I had to give her up for any reason. I&amp;#39;d do anything to make sure I could keep her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6z32e", "score_hidden": false, "stickied": false, "created": 1492078112.0, "created_utc": 1492049312.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg75bj4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg6qcrr", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I wish more people would do this.  When I wasn't in position a few years ago for a second dog, I volunteered a ton at the shelters and fostered a few.  It would almost be nice if shelters made you go through a mandatory two week foster period before adopting, except that it would probably be difficult on the pet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish more people would do this.  When I wasn&amp;#39;t in position a few years ago for a second dog, I volunteered a ton at the shelters and fostered a few.  It would almost be nice if shelters made you go through a mandatory two week foster period before adopting, except that it would probably be difficult on the pet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg75bj4", "score_hidden": false, "stickied": false, "created": 1492086786.0, "created_utc": 1492057986.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qcrr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PartyPorpoise", "parent_id": "t1_dg60u15", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Ugh, for real. I don't see how people can get pets without thinking about their care. It's like, you do want to have your pet for a while, right? If you only want to interact with an animal, look for a damn petting zoo, or volunteer for a shelter or sanctuary. Hell, even many regular zoos have animal interaction programs. I'd love to get a bird but I know it's a bad decision for me at the moment, so when I lived in San Antonio I settled for feeding the lorikeets at the zoo, ha ha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh, for real. I don&amp;#39;t see how people can get pets without thinking about their care. It&amp;#39;s like, you do want to have your pet for a while, right? If you only want to interact with an animal, look for a damn petting zoo, or volunteer for a shelter or sanctuary. Hell, even many regular zoos have animal interaction programs. I&amp;#39;d love to get a bird but I know it&amp;#39;s a bad decision for me at the moment, so when I lived in San Antonio I settled for feeding the lorikeets at the zoo, ha ha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6qcrr", "score_hidden": false, "stickied": false, "created": 1492067391.0, "created_utc": 1492038591.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg7ie5n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tunzaroo", "parent_id": "t1_dg75e1h", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Oh yea. Mine is 9 and still going strong. He still acts like a hyperactive baby, and shows no signs of slowing down. They're also really needy pets. They require tons of attention, expensive food, lots of space, and a lot of toys. \n\nAnd ug, I remember my mom saying that after 101 dalmations, she saw a ton of dalmations in the shelter. Because they're not great dogs for kids or inexperienced owners. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yea. Mine is 9 and still going strong. He still acts like a hyperactive baby, and shows no signs of slowing down. They&amp;#39;re also really needy pets. They require tons of attention, expensive food, lots of space, and a lot of toys. &lt;/p&gt;\n\n&lt;p&gt;And ug, I remember my mom saying that after 101 dalmations, she saw a ton of dalmations in the shelter. Because they&amp;#39;re not great dogs for kids or inexperienced owners. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg7ie5n", "score_hidden": false, "stickied": false, "created": 1492117546.0, "created_utc": 1492088746.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75e1h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg60u15", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Yup, and it will be the same the next time a big movie comes out featuring a specific breed or pet.\n\nAlso important to do research.  My friend just recently adopted a rabbit and I was astonished to learn how long they live.  I bet a lot of people go into a pet like that thinking they're only going to be around 2 or 3 years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup, and it will be the same the next time a big movie comes out featuring a specific breed or pet.&lt;/p&gt;\n\n&lt;p&gt;Also important to do research.  My friend just recently adopted a rabbit and I was astonished to learn how long they live.  I bet a lot of people go into a pet like that thinking they&amp;#39;re only going to be around 2 or 3 years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg75e1h", "score_hidden": false, "stickied": false, "created": 1492086902.0, "created_utc": 1492058102.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60u15", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tunzaroo", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "So many people get pets, only thinking about how cute they are. They don't think about what will happen in a year, or five or ten. It's pisses me off. \n\nAnd it's not just dogs. In a few weeks, every animal shelter will be overrun with abandoned rabbits, chicks, and ducks. Because so many  idiots want a cute Easter picture, and fail to stop and think \"do I have the time, money, and desire to care for this very delicate animal for 8-12 years\"?  I've got a rabbit that was an Easter bunny gift and dump. He's 9 now and doing great! But when I got him, he was sick and thin from being fed a poor diet, and had nails so overgrown that some had torn off and were bleeding. \n\nWhen I volunteered at the spca, we'd see a huge influx of young dogs/puppies/cats about 2-6 months  after Christmas. Floods of rabbits and chicks and ducklings after Easter. And, right when the local university got out for summer, a lot of cats and smaller animals. \n\nDon't buy pets for other people. Don't get a pet for yourself unless you can commit for life. If you can't honestly say you can care for a dog/cat/rabbit for 10-15 years, then get an older one or don't get one at all. There are plenty of senior animals needing homes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So many people get pets, only thinking about how cute they are. They don&amp;#39;t think about what will happen in a year, or five or ten. It&amp;#39;s pisses me off. &lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s not just dogs. In a few weeks, every animal shelter will be overrun with abandoned rabbits, chicks, and ducks. Because so many  idiots want a cute Easter picture, and fail to stop and think &amp;quot;do I have the time, money, and desire to care for this very delicate animal for 8-12 years&amp;quot;?  I&amp;#39;ve got a rabbit that was an Easter bunny gift and dump. He&amp;#39;s 9 now and doing great! But when I got him, he was sick and thin from being fed a poor diet, and had nails so overgrown that some had torn off and were bleeding. &lt;/p&gt;\n\n&lt;p&gt;When I volunteered at the spca, we&amp;#39;d see a huge influx of young dogs/puppies/cats about 2-6 months  after Christmas. Floods of rabbits and chicks and ducklings after Easter. And, right when the local university got out for summer, a lot of cats and smaller animals. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t buy pets for other people. Don&amp;#39;t get a pet for yourself unless you can commit for life. If you can&amp;#39;t honestly say you can care for a dog/cat/rabbit for 10-15 years, then get an older one or don&amp;#39;t get one at all. There are plenty of senior animals needing homes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg60u15", "score_hidden": false, "stickied": false, "created": 1492039807.0, "created_utc": 1492011007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg5il38", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vividtechnicolor", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "They are so cute together :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They are so cute together :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5il38", "score_hidden": false, "stickied": false, "created": 1492003224.0, "created_utc": 1491974424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg75gr2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg6zrrp", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Agreed, and in my situation, I have no idea what this sister-in-law's life was like, as far as circumstances and situations.  What was infuriating were the blatant lies they told about my dog.  Sick, not eating.... this dude is eating me out of house and home!  And extremely playful/great disposition with my other dog.  Not to mention, he's still incredibly well house trained, hasn't torn up anything, so I can't see past any of their lies to have sympathy for them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed, and in my situation, I have no idea what this sister-in-law&amp;#39;s life was like, as far as circumstances and situations.  What was infuriating were the blatant lies they told about my dog.  Sick, not eating.... this dude is eating me out of house and home!  And extremely playful/great disposition with my other dog.  Not to mention, he&amp;#39;s still incredibly well house trained, hasn&amp;#39;t torn up anything, so I can&amp;#39;t see past any of their lies to have sympathy for them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg75gr2", "score_hidden": false, "stickied": false, "created": 1492087025.0, "created_utc": 1492058225.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6zrrp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "well-koalafied", "parent_id": "t1_dg5qjk4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "This was something that astonished me how common it was when I volunteered at a shelter. I had sympathy for a lot of the reasons that other dogs were abandoned- big changes in life circumstance, serious behavioral issues...but I could never muster anything but disgust for the people who abandoned their (often healthy and lively) older dogs. Emotionally, I can't fathom how you could ever give up on a long-time friend like that. It's just so gross. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was something that astonished me how common it was when I volunteered at a shelter. I had sympathy for a lot of the reasons that other dogs were abandoned- big changes in life circumstance, serious behavioral issues...but I could never muster anything but disgust for the people who abandoned their (often healthy and lively) older dogs. Emotionally, I can&amp;#39;t fathom how you could ever give up on a long-time friend like that. It&amp;#39;s just so gross. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6zrrp", "score_hidden": false, "stickied": false, "created": 1492078960.0, "created_utc": 1492050160.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qjk4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "mistymoonbeam", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I can't believe that someone could just take a dog they've had for 5 years to the pound like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t believe that someone could just take a dog they&amp;#39;ve had for 5 years to the pound like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5qjk4", "score_hidden": false, "stickied": false, "created": 1492024950.0, "created_utc": 1491996150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg5wloq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "squirrelinstinct", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Crazy pants. Definitely second that! Wait until you absolutely sure.\n\nI have been waiting 10 years to finally get a dog. 6 years of school 2 years of traveling and two to settle down and find a partner to have the dog with. \n\nThe last few years I spent daily on petfinder. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Crazy pants. Definitely second that! Wait until you absolutely sure.&lt;/p&gt;\n\n&lt;p&gt;I have been waiting 10 years to finally get a dog. 6 years of school 2 years of traveling and two to settle down and find a partner to have the dog with. &lt;/p&gt;\n\n&lt;p&gt;The last few years I spent daily on petfinder. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5wloq", "score_hidden": false, "stickied": false, "created": 1492034952.0, "created_utc": 1492006152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg75hak", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg5zik1", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank you.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg75hak", "score_hidden": false, "stickied": false, "created": 1492087051.0, "created_utc": 1492058251.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zik1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "notevenapro", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Your dog loves and forgives you. The last year's will be spent with you. You are a good dude. Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your dog loves and forgives you. The last year&amp;#39;s will be spent with you. You are a good dude. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5zik1", "score_hidden": false, "stickied": false, "created": 1492038350.0, "created_utc": 1492009550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg64zpp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anotherbook", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "A had an acquaintance that adopted a rescue only to give it back after him and his girlfriend split up after 6 months. Immediate loss of all respect. Lazy and selfish.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A had an acquaintance that adopted a rescue only to give it back after him and his girlfriend split up after 6 months. Immediate loss of all respect. Lazy and selfish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg64zpp", "score_hidden": false, "stickied": false, "created": 1492044258.0, "created_utc": 1492015458.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg6joop", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "valyse", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank goodness for a happy ending! My friend told me they were at a charity auction this weekend where they were auctioning off a puppy(ugh) and some little girl kept making a big deal of how much she wanted it, but her parents said no. An older man swooped in, won the puppy and gave it to the girl. Absolutely infuriating. That poor pup. :( ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank goodness for a happy ending! My friend told me they were at a charity auction this weekend where they were auctioning off a puppy(ugh) and some little girl kept making a big deal of how much she wanted it, but her parents said no. An older man swooped in, won the puppy and gave it to the girl. Absolutely infuriating. That poor pup. :( &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6joop", "score_hidden": false, "stickied": false, "created": 1492059336.0, "created_utc": 1492030536.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg75jux", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg5xrd9", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "It's definitely easier.  When I adopted my 7 year old pup, I was in a long term relationship that I was sort of counting on, but thankfully I was still financially able to take care of him when we split up.  I also didn't realize he was going to grow into a 65 lb horse!  But I'm glad I was able to stick it out, and now even happier than I was in position to get the really old guy back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s definitely easier.  When I adopted my 7 year old pup, I was in a long term relationship that I was sort of counting on, but thankfully I was still financially able to take care of him when we split up.  I also didn&amp;#39;t realize he was going to grow into a 65 lb horse!  But I&amp;#39;m glad I was able to stick it out, and now even happier than I was in position to get the really old guy back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg75jux", "score_hidden": false, "stickied": false, "created": 1492087165.0, "created_utc": 1492058365.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xrd9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "midnitebrz", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm in college and have a dog, but I'm already engaged so it's easier. He's only ten pounds so everything tends to be cheaper for him as well. We just spent like $30 on dog food and it should last him around six months. His flea and heart worm is only $28 a month and his rabies shot is good for 3 years now (though we have to go every six months for bordatella because we take him to the dog park daily). I'm hoping once I graduate we won't have problems but it's so much easier having two to split the cost between", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in college and have a dog, but I&amp;#39;m already engaged so it&amp;#39;s easier. He&amp;#39;s only ten pounds so everything tends to be cheaper for him as well. We just spent like $30 on dog food and it should last him around six months. His flea and heart worm is only $28 a month and his rabies shot is good for 3 years now (though we have to go every six months for bordatella because we take him to the dog park daily). I&amp;#39;m hoping once I graduate we won&amp;#39;t have problems but it&amp;#39;s so much easier having two to split the cost between&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5xrd9", "score_hidden": false, "stickied": false, "created": 1492036344.0, "created_utc": 1492007544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg75l73", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg6rpcg", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Yeah I think a big issue was when I grew up (80s and 90s) many people just didn't have the same respect for animals that most of us have learned to have today.  I know my family was terrible with pets.  Fortunately myself and another relative have been able to grow past that, but some people truly never learn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I think a big issue was when I grew up (80s and 90s) many people just didn&amp;#39;t have the same respect for animals that most of us have learned to have today.  I know my family was terrible with pets.  Fortunately myself and another relative have been able to grow past that, but some people truly never learn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg75l73", "score_hidden": false, "stickied": false, "created": 1492087229.0, "created_utc": 1492058429.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rpcg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "itemside", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Totally agree. Unfortunately some people never understand this. \nMy older brother got 2 cats when he moved out after high school. My mom ended up taking them in when they moved in with his fiancées parents.\nThen, after they had gotten their own apartment, they bought a chihuahua and eventually adopted a border collie and a schnauzer.\nThen, my mom ended up taking the chihuahua because he was snappy around children. None of them would tell me what happened to the schnauzer (who I loved) - I was already in Korea otherwise I would have taken him. They still have the border collie, but he's getting on and I hope they don't get another dog after him.\n\nI am so so grateful I listened to my mom when I went to university and didn't get any animals. I probably still wasn't quite ready when I adopted Sura (already had a cat and money was tight), but I don't regret it at all. \n\nGlad you were able to get your pup back though. When my parents divorced and my dad decided to move, he rehomed all but 1 horse. I was really angry at him for a long time - I was in Korea and literally couldn't do anything. Thankfully he found homes for them all, but I have no idea how they are doing or anything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally agree. Unfortunately some people never understand this. \nMy older brother got 2 cats when he moved out after high school. My mom ended up taking them in when they moved in with his fiancées parents.\nThen, after they had gotten their own apartment, they bought a chihuahua and eventually adopted a border collie and a schnauzer.\nThen, my mom ended up taking the chihuahua because he was snappy around children. None of them would tell me what happened to the schnauzer (who I loved) - I was already in Korea otherwise I would have taken him. They still have the border collie, but he&amp;#39;s getting on and I hope they don&amp;#39;t get another dog after him.&lt;/p&gt;\n\n&lt;p&gt;I am so so grateful I listened to my mom when I went to university and didn&amp;#39;t get any animals. I probably still wasn&amp;#39;t quite ready when I adopted Sura (already had a cat and money was tight), but I don&amp;#39;t regret it at all. &lt;/p&gt;\n\n&lt;p&gt;Glad you were able to get your pup back though. When my parents divorced and my dad decided to move, he rehomed all but 1 horse. I was really angry at him for a long time - I was in Korea and literally couldn&amp;#39;t do anything. Thankfully he found homes for them all, but I have no idea how they are doing or anything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg6rpcg", "score_hidden": false, "stickied": false, "created": 1492069048.0, "created_utc": 1492040248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_64vvve", "likes": null, "replies": "", "user_reports": [], "id": "dg75gyl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Defnotmeyo", "parent_id": "t1_dg5th9d", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank you so much!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg75gyl", "score_hidden": false, "stickied": false, "created": 1492087035.0, "created_utc": 1492058235.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5th9d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "funshyne328", "parent_id": "t3_64vvve", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Your pupper is so lucky to have you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your pupper is so lucky to have you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg5th9d", "score_hidden": false, "stickied": false, "created": 1492030581.0, "created_utc": 1492001781.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]