[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today I was at the dog park with my dog and my friends dog. Everything was going fine, I was there for an hour so when a couple came in with a very cute little Rottweiler puppy about 10 weeks old.&lt;/p&gt;\n\n&lt;p&gt;My dog is a two year old pit lab mix and is a very submissive dog. He&amp;#39;s about 65 pounds and plays well with other dogs and has never had a problem with any animal. He has always gotten along real well with puppies laying down and letting them roll all over him and being gentle.&lt;/p&gt;\n\n&lt;p&gt;So today while I was at the dog park and this couple came in after a while my dog started playing with this puppy. They were playing underneath a picnic table at this point. My dog was laying down like usual and the puppy was kind of jumping all over and nipping at my dog as puppies do. My dog was just kind of pawing and making genital nips at the puppy.&lt;/p&gt;\n\n&lt;p&gt;All of a sudden I hear the puppies squeak and my dog have a short loud growl. It lasted for only one second Maybe. I immediately grabbed my dog by the collar. He sat right down and did not try to go after the puppy again. The puppy continue to whine and the owners picked him up.&lt;/p&gt;\n\n&lt;p&gt;I asked if everything was okay they seemed to think he was fine just scared. I continued to hold my dog and put him on the leash where he continue to just sit next to me calmly. I wonder if I should be concerned about my dog&amp;#39;s behavior or was this an example of learning through bite inhabition?&lt;/p&gt;\n\n&lt;p&gt;I apologize and explain how nothing like that has ever happened before. I suggested maybe the puppy bit him too hard on the ear or something and my dog just reacted and I was very sorry about it. The couple said it was okay they understood. They pet my dog and they soon left. I stayed at the dog park where everything continue to go fine with other dogs.&lt;/p&gt;\n\n&lt;p&gt;About 20 minutes later the couple came back. As they were entering the park without their dog I asked if they forgot something. They said no and came in and were soft spoken, very polite, they said that their dog did actually have a little cut on the top of his head so my dog did break the skin. I apologized again and asked if it was a gash. They said no it looks like maybe his canine tooth just got him. They said they didn&amp;#39;t want to make a scene but that they may take their dog to a vet. They wanted my information so I gave it to them and I took their information as well.&lt;/p&gt;\n\n&lt;p&gt;I asked them if they had a regular vet. They said that they usually take their dog to PetSmart. I asked them to try and use a regular vet instead of going to the emergency vet. They said they would. I never said I would pay for anything but I did cooperate with them as I felt horrible. I do feel like there might be some responsibility and want feedback for that.&lt;/p&gt;\n\n&lt;p&gt;I have anxiety and don&amp;#39;t do well with strangers and wasn&amp;#39;t sure what else to say except I hope everything is ok and let me know how it goes.&lt;/p&gt;\n\n&lt;p&gt;As soon as they left I called my husband. He said we shouldn&amp;#39;t have to pay for anything. Stuff like that happens. He said if our dog attacked an other dog in a real hurtful way or went after an other dog it would be different. I completely agree if my dog was aggressive and out right attacked a dog, I would cover costs. But this was not like an overly aggressive attack. My dog has had blood drawn from playing to hard or an other dog letting him know he crossed a line.&lt;/p&gt;\n\n&lt;p&gt;I got off the phone with my husband and called a friend for advice. She said it didnt sound like the dog was that badly hurt and if it was her dog she wouldnt take it to the vet. I think of everything was fine I wouldnt either. About 5 minutes after the couple left when I had finished talking on the phone I texted the guy this:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I am asking you call the vet before taking him in. If it is a small cut and you can wash it out and put bacitracin on it it may be fine. I feel so bad, but if a vet isnt needed and a cost could be avoided that would be best. My husband is laid off and we dont have much money so I hope things are ok.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have spoken to some other people and and from experience, if the dog doesnt need stiches there is probably not much else the vet could do but wash it out and tell you to look for signs of infection. I feel horrible and am not trying to be a jerk. But on both ends this is part of having a dog so I get being concerned.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I want to be fair but am not sure how to handle this when the guy calls back if he took it to the vet and didn&amp;#39;t need stiches.&lt;/p&gt;\n\n&lt;p&gt;My husband is laid off (union job, should be back to work in a few weeks) and I am a stay at home mom who dog walks and babysits. So we are less than paycheck to paycheck at the moment with no savings but that is not this other couples fault.&lt;/p&gt;\n\n&lt;p&gt;What do you all think about the situation? Thanks for any feedback.&lt;/p&gt;\n\n&lt;p&gt;On my cell phone. Sorry for formatting/spelling errors I didnt catch.&lt;/p&gt;\n\n&lt;p&gt;TL:DR&lt;/p&gt;\n\n&lt;p&gt;My dog broke the skin of a puppy at the dog park. It wasn&amp;#39;t a viscious attack but playing gone to far. Couple metntioned taking dog to get. What is the right thing to in terms of paying for the vet?&lt;/p&gt;\n\n&lt;p&gt;Also, should I be concerned about my dog&amp;#39;s behavior?&lt;/p&gt;\n\n&lt;p&gt;Edit: I didnt realize my text could be interpreted as rude and demanding until commenters from &lt;a href=\"/r/relationships\"&gt;r/relationships&lt;/a&gt; noted it. I was just nervous and unsure what to do. Maybe should have asked for advice on the text before I sent it but cant take it back now.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: thank you. Everyone for your feedback. People over at &lt;a href=\"/r/relationships\"&gt;r/relationships&lt;/a&gt; hate me.  Such an opposite reaction to the same issue just on different subs. The guy texted last night and said he cleaned the cut. He said he was taking the puppy for shots today so they will have the vet look at it then. I think I should be in the clear. I probably won&amp;#39;t have my dog play with puppies at the dog park anymore. I can just mention to people if they ask why, I can say without vaccinations the puppy is at risk and I don&amp;#39;t want my dog to accidentally hurt such a young pup.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Today I was at the dog park with my dog and my friends dog. Everything was going fine, I was there for an hour so when a couple came in with a very cute little Rottweiler puppy about 10 weeks old.\n\n\nMy dog is a two year old pit lab mix and is a very submissive dog. He's about 65 pounds and plays well with other dogs and has never had a problem with any animal. He has always gotten along real well with puppies laying down and letting them roll all over him and being gentle.\n\n\nSo today while I was at the dog park and this couple came in after a while my dog started playing with this puppy. They were playing underneath a picnic table at this point. My dog was laying down like usual and the puppy was kind of jumping all over and nipping at my dog as puppies do. My dog was just kind of pawing and making genital nips at the puppy.\n\n All of a sudden I hear the puppies squeak and my dog have a short loud growl. It lasted for only one second Maybe. I immediately grabbed my dog by the collar. He sat right down and did not try to go after the puppy again. The puppy continue to whine and the owners picked him up.\n\n\nI asked if everything was okay they seemed to think he was fine just scared. I continued to hold my dog and put him on the leash where he continue to just sit next to me calmly. I wonder if I should be concerned about my dog's behavior or was this an example of learning through bite inhabition?\n\n\nI apologize and explain how nothing like that has ever happened before. I suggested maybe the puppy bit him too hard on the ear or something and my dog just reacted and I was very sorry about it. The couple said it was okay they understood. They pet my dog and they soon left. I stayed at the dog park where everything continue to go fine with other dogs.\n\n\nAbout 20 minutes later the couple came back. As they were entering the park without their dog I asked if they forgot something. They said no and came in and were soft spoken, very polite, they said that their dog did actually have a little cut on the top of his head so my dog did break the skin. I apologized again and asked if it was a gash. They said no it looks like maybe his canine tooth just got him. They said they didn't want to make a scene but that they may take their dog to a vet. They wanted my information so I gave it to them and I took their information as well.\n\n\nI asked them if they had a regular vet. They said that they usually take their dog to PetSmart. I asked them to try and use a regular vet instead of going to the emergency vet. They said they would. I never said I would pay for anything but I did cooperate with them as I felt horrible. I do feel like there might be some responsibility and want feedback for that.\n\n\nI have anxiety and don't do well with strangers and wasn't sure what else to say except I hope everything is ok and let me know how it goes.\n\n\nAs soon as they left I called my husband. He said we shouldn't have to pay for anything. Stuff like that happens. He said if our dog attacked an other dog in a real hurtful way or went after an other dog it would be different. I completely agree if my dog was aggressive and out right attacked a dog, I would cover costs. But this was not like an overly aggressive attack. My dog has had blood drawn from playing to hard or an other dog letting him know he crossed a line.\n\n\nI got off the phone with my husband and called a friend for advice. She said it didnt sound like the dog was that badly hurt and if it was her dog she wouldnt take it to the vet. I think of everything was fine I wouldnt either. About 5 minutes after the couple left when I had finished talking on the phone I texted the guy this:\n\n\n\"I am asking you call the vet before taking him in. If it is a small cut and you can wash it out and put bacitracin on it it may be fine. I feel so bad, but if a vet isnt needed and a cost could be avoided that would be best. My husband is laid off and we dont have much money so I hope things are ok.\"\n\n\n\"I have spoken to some other people and and from experience, if the dog doesnt need stiches there is probably not much else the vet could do but wash it out and tell you to look for signs of infection. I feel horrible and am not trying to be a jerk. But on both ends this is part of having a dog so I get being concerned.\" \n\nI want to be fair but am not sure how to handle this when the guy calls back if he took it to the vet and didn't need stiches.\n\n\nMy husband is laid off (union job, should be back to work in a few weeks) and I am a stay at home mom who dog walks and babysits. So we are less than paycheck to paycheck at the moment with no savings but that is not this other couples fault.\n\n\nWhat do you all think about the situation? Thanks for any feedback.\n\n\nOn my cell phone. Sorry for formatting/spelling errors I didnt catch.\n\n\nTL:DR\n\n\nMy dog broke the skin of a puppy at the dog park. It wasn't a viscious attack but playing gone to far. Couple metntioned taking dog to get. What is the right thing to in terms of paying for the vet?\n\n\nAlso, should I be concerned about my dog's behavior?\n\n\n\nEdit: I didnt realize my text could be interpreted as rude and demanding until commenters from r/relationships noted it. I was just nervous and unsure what to do. Maybe should have asked for advice on the text before I sent it but cant take it back now.\n\n\n\n\nEdit 2: thank you. Everyone for your feedback. People over at r/relationships hate me.  Such an opposite reaction to the same issue just on different subs. The guy texted last night and said he cleaned the cut. He said he was taking the puppy for shots today so they will have the vet look at it then. I think I should be in the clear. I probably won't have my dog play with puppies at the dog park anymore. I can just mention to people if they ask why, I can say without vaccinations the puppy is at risk and I don't want my dog to accidentally hurt such a young pup.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Help!", "id": "65fm1f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "bird1979", "saved": false, "mod_reports": [], "name": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": 1492263896.0, "link_flair_css_class": "help", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/65fm1f/my_37_f_dog_2_m_pitlab_mix_slightly_injured_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492236971.0, "url": "https://www.reddit.com/r/dogs/comments/65fm1f/my_37_f_dog_2_m_pitlab_mix_slightly_injured_a/", "author_flair_text": null, "quarantine": false, "title": "My (37 F) dog (2 m pit/lab mix) slightly injured a couples ( early 20s m/f) puppy (10 wk old male rottwieler). What is a fair way to handle it? X posted from r/relationships [Help]", "created_utc": 1492208171.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dg9vgfa", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "SnarfraTheEverliving", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Hey check your local laws about dog parks. in my area a dog must be registered/licensed  to be at a dog park, which requires a rabies vaccine, something a 10 week old puppy can't have. I'm not sure who would bring a likely mostly unvaccinated puppy to a dog park where  larger  dogs play. There should  be puppy play times at petco  etc where the dog can learn good manners", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey check your local laws about dog parks. in my area a dog must be registered/licensed  to be at a dog park, which requires a rabies vaccine, something a 10 week old puppy can&amp;#39;t have. I&amp;#39;m not sure who would bring a likely mostly unvaccinated puppy to a dog park where  larger  dogs play. There should  be puppy play times at petco  etc where the dog can learn good manners&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg9vgfa", "score_hidden": false, "stickied": false, "created": 1492238403.0, "created_utc": 1492209603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dg9vtvr", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "BlueBG82", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Most dog parks have an \"enter at your own risk\" guidelines. Most also have an age requirement for dogs. I don't think you owe them anything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most dog parks have an &amp;quot;enter at your own risk&amp;quot; guidelines. Most also have an age requirement for dogs. I don&amp;#39;t think you owe them anything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg9vtvr", "score_hidden": false, "stickied": false, "created": 1492238905.0, "created_utc": 1492210105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dgaqyu2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bestest90girl", "parent_id": "t1_dgal8ht", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Colorado, I have not seen the law personally. I only know what the department of agriculture relayed to us. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Colorado, I have not seen the law personally. I only know what the department of agriculture relayed to us. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgaqyu2", "score_hidden": false, "stickied": false, "created": 1492298096.0, "created_utc": 1492269296.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgal8ht", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "manatee1010", "parent_id": "t1_dg9wkc2", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Huh, what a weird thing for the state to legislate. May I ask what state this is?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh, what a weird thing for the state to legislate. May I ask what state this is?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgal8ht", "score_hidden": false, "stickied": false, "created": 1492287876.0, "created_utc": 1492259076.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wkc2", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "bestest90girl", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "In my state a puppy under 16 weeks has to be supervised 100% of the time while interacting with other dogs. Basically you can't take your eyes off them which is why doggy daycares refuse them until 16 weeks. This is because they are not vaccinated, they do not have strong immune systems, and they are way too young to understand basic dog communication.\n\n\n\nThis is unfortunate for you but not 100% your fault. I would recommend not going to the dog park if you cannot pay for it your dog hurts another dog or human. Just as a precaution.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my state a puppy under 16 weeks has to be supervised 100% of the time while interacting with other dogs. Basically you can&amp;#39;t take your eyes off them which is why doggy daycares refuse them until 16 weeks. This is because they are not vaccinated, they do not have strong immune systems, and they are way too young to understand basic dog communication.&lt;/p&gt;\n\n&lt;p&gt;This is unfortunate for you but not 100% your fault. I would recommend not going to the dog park if you cannot pay for it your dog hurts another dog or human. Just as a precaution.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg9wkc2", "score_hidden": false, "stickied": false, "created": 1492239893.0, "created_utc": 1492211093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dg9yda1", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "mistymoonbeam", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I find it slightly suspicious that they didn't show you what kind of injury their dog had. Maybe it's just me though...\n\nI wouldn't pay anything without being convinced that my dog caused it and if it really is such a small cut, even going to the vet is unjustified, so again I wouldn't offer to pay anything. My main concern would be their dog getting injured by something else and them pinning it on your dog. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find it slightly suspicious that they didn&amp;#39;t show you what kind of injury their dog had. Maybe it&amp;#39;s just me though...&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t pay anything without being convinced that my dog caused it and if it really is such a small cut, even going to the vet is unjustified, so again I wouldn&amp;#39;t offer to pay anything. My main concern would be their dog getting injured by something else and them pinning it on your dog. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg9yda1", "score_hidden": false, "stickied": false, "created": 1492242269.0, "created_utc": 1492213469.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dga0p6j", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "seaboard2", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I predict you won't hear from these people again because A) a vet visit for a canine scrape is mebbe $100 max and B) the vet might yell at the couple for bringing their under-vaxxed pup to a dog park and the couple may just hush up about it all.\n\nI'd keep an eye on your dog for future interactions with little pups (it may just be he is OVER tolerating their shenanigans, and that is okay) but I wouldn't decide he is now BAD with them unless this happens again. I would go on the idea he corrected rude play and misjudged his airbite - - puppies move unpredictably and maybe he snipped just as the pup moved its head the wrong way...\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I predict you won&amp;#39;t hear from these people again because A) a vet visit for a canine scrape is mebbe $100 max and B) the vet might yell at the couple for bringing their under-vaxxed pup to a dog park and the couple may just hush up about it all.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d keep an eye on your dog for future interactions with little pups (it may just be he is OVER tolerating their shenanigans, and that is okay) but I wouldn&amp;#39;t decide he is now BAD with them unless this happens again. I would go on the idea he corrected rude play and misjudged his airbite - - puppies move unpredictably and maybe he snipped just as the pup moved its head the wrong way...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga0p6j", "score_hidden": false, "stickied": false, "created": 1492245383.0, "created_utc": 1492216583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dg9xgxq", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "fripletister", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Your text sounds completely reasonable to me, FWIW.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your text sounds completely reasonable to me, FWIW.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg9xgxq", "score_hidden": false, "stickied": false, "created": 1492241099.0, "created_utc": 1492212299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dg9ykvi", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Wolfir", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Don't worry too much. If they do end up asking you to pay the costs of their vet visit, you can kindly explain the situation that you are in, explain that you don't have the funds right now.\n\nYou were polite in your interaction, I'm sure it'll be fine. I have anxiety as well, and I don't do well with strangers. But this seems like it was handled as best as it can be. I doubt that the other couple will go through the hassle of trying to collect money from you.\n\nMy dog had a scratch on his eye this week after a rough encounter at the dog park. We didn't try to collect money from anyone, we chalked it up to \"risk of dog park\" and we took him to the dog park again today because the benefits outweigh the risk. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t worry too much. If they do end up asking you to pay the costs of their vet visit, you can kindly explain the situation that you are in, explain that you don&amp;#39;t have the funds right now.&lt;/p&gt;\n\n&lt;p&gt;You were polite in your interaction, I&amp;#39;m sure it&amp;#39;ll be fine. I have anxiety as well, and I don&amp;#39;t do well with strangers. But this seems like it was handled as best as it can be. I doubt that the other couple will go through the hassle of trying to collect money from you.&lt;/p&gt;\n\n&lt;p&gt;My dog had a scratch on his eye this week after a rough encounter at the dog park. We didn&amp;#39;t try to collect money from anyone, we chalked it up to &amp;quot;risk of dog park&amp;quot; and we took him to the dog park again today because the benefits outweigh the risk. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg9ykvi", "score_hidden": false, "stickied": false, "created": 1492242552.0, "created_utc": 1492213752.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dga6e8e", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "BubblyPhoenix", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Isn't the pup a little too young to be in there? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Isn&amp;#39;t the pup a little too young to be in there? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga6e8e", "score_hidden": false, "stickied": false, "created": 1492253319.0, "created_utc": 1492224519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dgas6a4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Marty9", "parent_id": "t1_dgai82v", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "\n&gt;Your dog was telling the puppy off, it happens thats how puppies learn what is okay and what is not. \n\nYep, exactly right. This couple sounds like they don't have much experience with dogs/dog parks. That's how puppies learn. Besides, 10 mos. is way too young to be at the dog park. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Your dog was telling the puppy off, it happens thats how puppies learn what is okay and what is not. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yep, exactly right. This couple sounds like they don&amp;#39;t have much experience with dogs/dog parks. That&amp;#39;s how puppies learn. Besides, 10 mos. is way too young to be at the dog park. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgas6a4", "score_hidden": false, "stickied": false, "created": 1492299808.0, "created_utc": 1492271008.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgai82v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Badpinapple", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Your dog was telling the puppy off, it happens thats how puppies learn what is okay and what is not. Unfortunately your dog accidently caught the puppy. \nIt doesn't sound like aggression at all! I would be a bit suspicious that you didn't see the cut on the pups head. If they do ask for money make sure they give you pictures, and a vet recipe. But honestly you shouldnt pay, it wasn't a attack it was an accident.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your dog was telling the puppy off, it happens thats how puppies learn what is okay and what is not. Unfortunately your dog accidently caught the puppy. \nIt doesn&amp;#39;t sound like aggression at all! I would be a bit suspicious that you didn&amp;#39;t see the cut on the pups head. If they do ask for money make sure they give you pictures, and a vet recipe. But honestly you shouldnt pay, it wasn&amp;#39;t a attack it was an accident.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgai82v", "score_hidden": false, "stickied": false, "created": 1492279266.0, "created_utc": 1492250466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dga5iny", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jynxed1", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "If the puppy had a cut on its head it seems they would have seen it before even leaving the park. Not on the way home.. and then dropping it off and coming all the way back to bother you about it. I agree it was definitely too young to be at a dog park in the first place let alone without them guarding it.  You handled it fairly well and they really have no right to expect anything more than the apologies already given..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the puppy had a cut on its head it seems they would have seen it before even leaving the park. Not on the way home.. and then dropping it off and coming all the way back to bother you about it. I agree it was definitely too young to be at a dog park in the first place let alone without them guarding it.  You handled it fairly well and they really have no right to expect anything more than the apologies already given..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga5iny", "score_hidden": false, "stickied": false, "created": 1492252080.0, "created_utc": 1492223280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dgamdyq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "larrieuxa", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "if its just a little cut on its head, don't pay a cent. you have no reason to believe your dog caused it and even if it did, there is no reason for them to take a dog to the vet over a small cut. furthermore, they were certainly breaking park rules bringing an unvaccinated 10 week old to the park anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if its just a little cut on its head, don&amp;#39;t pay a cent. you have no reason to believe your dog caused it and even if it did, there is no reason for them to take a dog to the vet over a small cut. furthermore, they were certainly breaking park rules bringing an unvaccinated 10 week old to the park anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgamdyq", "score_hidden": false, "stickied": false, "created": 1492290379.0, "created_utc": 1492261579.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dga3fbg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memreows", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "If they bring their dog to the vet and he doesn't need stitches, I'm guessing they'll just pay the fee for the office visit and be done with it. For me, that is $65. I'd be surprised if you even hear about it again, since I can't imagine asking someone else to cover a \"let's just be safe\" sort of office visit when it turns out there was nothing to worry about. \n\nIf they did contact you and you were in a position to pay for it, I think it would be courteous but not necessary. But I think just saying \"I'm sorry but according to your vet this is a minor injury, and these things can easily happen when you bring your dog to a park\" would probably suffice. It's not like they'll be taking you to court or calling animal control over that kind of money. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If they bring their dog to the vet and he doesn&amp;#39;t need stitches, I&amp;#39;m guessing they&amp;#39;ll just pay the fee for the office visit and be done with it. For me, that is $65. I&amp;#39;d be surprised if you even hear about it again, since I can&amp;#39;t imagine asking someone else to cover a &amp;quot;let&amp;#39;s just be safe&amp;quot; sort of office visit when it turns out there was nothing to worry about. &lt;/p&gt;\n\n&lt;p&gt;If they did contact you and you were in a position to pay for it, I think it would be courteous but not necessary. But I think just saying &amp;quot;I&amp;#39;m sorry but according to your vet this is a minor injury, and these things can easily happen when you bring your dog to a park&amp;quot; would probably suffice. It&amp;#39;s not like they&amp;#39;ll be taking you to court or calling animal control over that kind of money. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga3fbg", "score_hidden": false, "stickied": false, "created": 1492249103.0, "created_utc": 1492220303.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dg9vv3a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Volkodavy", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 1, "body": "I don't know why you're saying you're certain that it wasn't aggression when (based on how it sounds in your post) you didn't see what lead up to the bite?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know why you&amp;#39;re saying you&amp;#39;re certain that it wasn&amp;#39;t aggression when (based on how it sounds in your post) you didn&amp;#39;t see what lead up to the bite?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dg9vv3a", "score_hidden": false, "stickied": false, "created": 1492238949.0, "created_utc": 1492210149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dga3j1c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dogsaretheanswer", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "We had the sweetest beagle who was never aggressive and go along with other dogs fine. When we got our new puppy (who was an annoying little shit), our older dog was perfectly fine with her even if the pup would bite (playfully) the older dog's ear. There were only a handful of times our older dog would snap at the younger dog and even then it was little nips or hitting her with a paw. Puppies can be annoying to bigger dogs if the pup is constantly nipping and crawling all over. I'd say you're fine and the couple should have been watching their puppy more closely, especially since it was playing with a bigger dog. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We had the sweetest beagle who was never aggressive and go along with other dogs fine. When we got our new puppy (who was an annoying little shit), our older dog was perfectly fine with her even if the pup would bite (playfully) the older dog&amp;#39;s ear. There were only a handful of times our older dog would snap at the younger dog and even then it was little nips or hitting her with a paw. Puppies can be annoying to bigger dogs if the pup is constantly nipping and crawling all over. I&amp;#39;d say you&amp;#39;re fine and the couple should have been watching their puppy more closely, especially since it was playing with a bigger dog. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga3j1c", "score_hidden": false, "stickied": false, "created": 1492249244.0, "created_utc": 1492220444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dga3s7m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "evlkitten616", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I think you did the right thing and have the right to say what you did and very kindly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you did the right thing and have the right to say what you did and very kindly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga3s7m", "score_hidden": false, "stickied": false, "created": 1492249582.0, "created_utc": 1492220782.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dgahhh1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Carliebeans", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I think a lot of these places are 'at your own risk'. Taking a dog to a dog park is a risk, especially a little puppy that could easily and unintentionally get hurt by bigger dogs. Considering the pup wouldn't even have had all of its shots, it's a massive risk to its health and safety to be in a dog park at 10 weeks old.\n\nWe have public liability insurance for our dog and the number one thing they say is do not assume responsibility for any incident. Get info etc, but do not accept responsibility and call the insurer asap to discuss the incident. This would be tricky, because if your dog hurts someone, how can you not say sorry (in effect, taking responsibility)?\n\nI don't think you are liable to pay anything. Nobody actually saw what happened, just heard your dog growl and chances are the puppy nipped a little too hard and your dog responded with his displeasure. The puppy could even have bumped his head under the picnic table in fright on a screw or something.\n\nTry not to stress, as hard as it is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of these places are &amp;#39;at your own risk&amp;#39;. Taking a dog to a dog park is a risk, especially a little puppy that could easily and unintentionally get hurt by bigger dogs. Considering the pup wouldn&amp;#39;t even have had all of its shots, it&amp;#39;s a massive risk to its health and safety to be in a dog park at 10 weeks old.&lt;/p&gt;\n\n&lt;p&gt;We have public liability insurance for our dog and the number one thing they say is do not assume responsibility for any incident. Get info etc, but do not accept responsibility and call the insurer asap to discuss the incident. This would be tricky, because if your dog hurts someone, how can you not say sorry (in effect, taking responsibility)?&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you are liable to pay anything. Nobody actually saw what happened, just heard your dog growl and chances are the puppy nipped a little too hard and your dog responded with his displeasure. The puppy could even have bumped his head under the picnic table in fright on a screw or something.&lt;/p&gt;\n\n&lt;p&gt;Try not to stress, as hard as it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgahhh1", "score_hidden": false, "stickied": false, "created": 1492276870.0, "created_utc": 1492248070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65fm1f", "likes": null, "replies": "", "user_reports": [], "id": "dgbb2nz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bird1979", "parent_id": "t1_dgb9b5x", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thank you for your reply. I now realize how awkward the text was and feel like an idiot but in the grand scheme of things, it wasn't the worst thing I could say. My anxiety does get the best of me sometimes.\n\nThey guy texted me last night that he cleaned the cut and was taking the dog in for shots so he would have the vet look at it today. I haven't heard anything so I guess all is well. I said I thought having the vet check it out was a good idea, ai hoped all went well and sorry if he found my text rude, I didn't intend it to be that way.  That may have been awkward too but I was so nervous he thought I was a dick.\n\nI brought my dog back to the park today. There was a smaller adult dog and I watched them play very closely. My dog was was fine and played well. I am always next to the dog when he is wrestling or playing asides from running.\n\nI shouldnt have let them play under the table though yesterday especially with them rolling around I didnt have a clear view and it wasnt the safest place.\n\nI will be more careful with my dog with younger dogs he doesn't know well and with people I don't know so well. That puppy was very young and not vaccinated fully, I should have been more careful.\n\nIf they did contact me about payment, I would offer installments because I don't want to be a jerk. If it was that bad it needed surgery, I would also do what I could. Luckily it lasted less then a couple seconds and my dog didnt try to go back after him. So I was confident it wasn't too bad though of course I feel bad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your reply. I now realize how awkward the text was and feel like an idiot but in the grand scheme of things, it wasn&amp;#39;t the worst thing I could say. My anxiety does get the best of me sometimes.&lt;/p&gt;\n\n&lt;p&gt;They guy texted me last night that he cleaned the cut and was taking the dog in for shots so he would have the vet look at it today. I haven&amp;#39;t heard anything so I guess all is well. I said I thought having the vet check it out was a good idea, ai hoped all went well and sorry if he found my text rude, I didn&amp;#39;t intend it to be that way.  That may have been awkward too but I was so nervous he thought I was a dick.&lt;/p&gt;\n\n&lt;p&gt;I brought my dog back to the park today. There was a smaller adult dog and I watched them play very closely. My dog was was fine and played well. I am always next to the dog when he is wrestling or playing asides from running.&lt;/p&gt;\n\n&lt;p&gt;I shouldnt have let them play under the table though yesterday especially with them rolling around I didnt have a clear view and it wasnt the safest place.&lt;/p&gt;\n\n&lt;p&gt;I will be more careful with my dog with younger dogs he doesn&amp;#39;t know well and with people I don&amp;#39;t know so well. That puppy was very young and not vaccinated fully, I should have been more careful.&lt;/p&gt;\n\n&lt;p&gt;If they did contact me about payment, I would offer installments because I don&amp;#39;t want to be a jerk. If it was that bad it needed surgery, I would also do what I could. Luckily it lasted less then a couple seconds and my dog didnt try to go back after him. So I was confident it wasn&amp;#39;t too bad though of course I feel bad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgbb2nz", "score_hidden": false, "stickied": false, "created": 1492325883.0, "created_utc": 1492297083.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9b5x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "squirrelinstinct", "parent_id": "t3_65fm1f", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Well these things happen. My one guy did this to my other as he is a grumpy old man and the other was an annoying teenager.\n\nI don't think your dog is aggressive, the puppy must have just gotten too much for yours or maybe while chewing on him hurt him so your dog growled and nipped him. Like I said it's pretty normal especially as your dog did not try to continue to go after the puppy. \n\nBoth you and the puppies owners should have paid more attention. As it is your dog biting the other and you volunteered information, i would expect you to partake in vet cost. Not because it's the law but because it's the right thing to do. However in this case it wasn't really necessary. I mean if it's a 40-80 bucks vet visit, most people wouldn't hound you down for this as the dog needed to see vet anyway. If their puppy needed surgery I do think it would be your responsibility to pay parts of the treatment. (I don't know what's the law about it though, but don't you think that if a dog bites yours it's owner should pay some of the vet cost as well?)\n\nI did find your text quite awkward. I personally would find it weird if you talk about your partner being laid off and all that and then making recommendations of what care their dog should get. I get it though, you were clearly nervous about the situation and it grew exponentially in your mind as you were discussing it with friends and family ending up with those texts. \n\nAnd it seems the couple was nervous as well. I mean they got this new cute puppy and they were worried and didn't know the \"protocol\" of what to do either. \n\nWhile stressful I think it will all be ok. Relax. Maybe it wasn't the smoothest of all interactions but I do think the couple got where you are coming from and all they care about is that their puppy is ok not to make you pay.\n\nKeep an eye on your pup so you can intervene before anything happens but no need to stop your dog from going to the dog park or letting him play with puppies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well these things happen. My one guy did this to my other as he is a grumpy old man and the other was an annoying teenager.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think your dog is aggressive, the puppy must have just gotten too much for yours or maybe while chewing on him hurt him so your dog growled and nipped him. Like I said it&amp;#39;s pretty normal especially as your dog did not try to continue to go after the puppy. &lt;/p&gt;\n\n&lt;p&gt;Both you and the puppies owners should have paid more attention. As it is your dog biting the other and you volunteered information, i would expect you to partake in vet cost. Not because it&amp;#39;s the law but because it&amp;#39;s the right thing to do. However in this case it wasn&amp;#39;t really necessary. I mean if it&amp;#39;s a 40-80 bucks vet visit, most people wouldn&amp;#39;t hound you down for this as the dog needed to see vet anyway. If their puppy needed surgery I do think it would be your responsibility to pay parts of the treatment. (I don&amp;#39;t know what&amp;#39;s the law about it though, but don&amp;#39;t you think that if a dog bites yours it&amp;#39;s owner should pay some of the vet cost as well?)&lt;/p&gt;\n\n&lt;p&gt;I did find your text quite awkward. I personally would find it weird if you talk about your partner being laid off and all that and then making recommendations of what care their dog should get. I get it though, you were clearly nervous about the situation and it grew exponentially in your mind as you were discussing it with friends and family ending up with those texts. &lt;/p&gt;\n\n&lt;p&gt;And it seems the couple was nervous as well. I mean they got this new cute puppy and they were worried and didn&amp;#39;t know the &amp;quot;protocol&amp;quot; of what to do either. &lt;/p&gt;\n\n&lt;p&gt;While stressful I think it will all be ok. Relax. Maybe it wasn&amp;#39;t the smoothest of all interactions but I do think the couple got where you are coming from and all they care about is that their puppy is ok not to make you pay.&lt;/p&gt;\n\n&lt;p&gt;Keep an eye on your pup so you can intervene before anything happens but no need to stop your dog from going to the dog park or letting him play with puppies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgb9b5x", "score_hidden": false, "stickied": false, "created": 1492323298.0, "created_utc": 1492294498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]