[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Misc", "id": "65gpab", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "turncloakforwhat", "saved": false, "mod_reports": [], "name": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/65gpab/discussion_people_whose_job_is_to_work_with_dogs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492250437.0, "url": "https://www.reddit.com/r/dogs/comments/65gpab/discussion_people_whose_job_is_to_work_with_dogs/", "author_flair_text": "Huckle the Pekingese", "quarantine": false, "title": "[Discussion] people whose job is to work with dogs, what do you do and how did you get into it?", "created_utc": 1492221637.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dgaldar", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ANMLCOP", "parent_id": "t1_dga90r4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Yes, there's a certification academy which covers basic principles and techniques, and I go to yearly seminars to keep it current. I also attend any extra free training seminars on my own time that are provided by a major humane society. But nothing beats the on the job experience! In some states you get your certification first, then find a job. In others you get hired first, then get sent to the next available academy. I didn't understand this process when I was first looking for the job but I found calling my state's animal control association was very helpful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, there&amp;#39;s a certification academy which covers basic principles and techniques, and I go to yearly seminars to keep it current. I also attend any extra free training seminars on my own time that are provided by a major humane society. But nothing beats the on the job experience! In some states you get your certification first, then find a job. In others you get hired first, then get sent to the next available academy. I didn&amp;#39;t understand this process when I was first looking for the job but I found calling my state&amp;#39;s animal control association was very helpful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgaldar", "score_hidden": false, "stickied": false, "created": 1492288186.0, "created_utc": 1492259386.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga90r4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "leaping-elk", "parent_id": "t1_dga7hhy", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I considered AC for a bit. Did you have any sort of training other than on-the-job? I know police officers go to the academy, but never really knew about ACOs, and I never get to talk to the ones I see at work long enough to ask much about their jobs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I considered AC for a bit. Did you have any sort of training other than on-the-job? I know police officers go to the academy, but never really knew about ACOs, and I never get to talk to the ones I see at work long enough to ask much about their jobs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga90r4", "score_hidden": false, "stickied": false, "created": 1492257403.0, "created_utc": 1492228603.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7hhy", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ANMLCOP", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm an animal control officer for a small city. I work as a lower division of the police with a few other officers. My job is to protect the public, promote the welfare of animals, and enforce the city's animal ordinances.\n\nWe do everything, from managing the shelter, handling adoptions, doing field calls, writing citations, etc. Some days I work alone, but I always have the police available for \"backup\" in the really hairy situations! Our favorite trick when responding to a stray dog is to just let it run from us while we follow in the truck, 95% of the time it will lead us right back home. Then we can talk to the owner about fixing the problem without needing to pick up the dog. If no one is home, we will try to secure the dog back in the property and leave a note for the owner to contact us. Otherwise, we will bring the dog to the shelter and hope for an owner to come for him! After a certain amount of time, we can try to find a home for the dog or release it to an animal rescue.\n\nI also have the very tough job of euthenasia. As much as it would be ideal to be a no-kill shelter, it's just not a reality with the number of pets needing homes vs the number of people wanting pets - and working within a limited space and budget. This is why we try to educate the public about the importance of spaying and neutering.\n\nI got my job with experience, connections, and some good timing. I had recently finished college and was looking for a position within law enforcement near my husband's job and our house. There happened to be an opening for an animal control officer in a neighboring city, with the last opening being over a few years prior. I happened to be familiar with a couple people within the city who provided recommendations, and I had prior experience working with a pet store and ranch. Everything just worked out perfect and I couldn't be happier!\n\nIf this sort of thing interests you, there's more of us over at /r/animalcontrol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an animal control officer for a small city. I work as a lower division of the police with a few other officers. My job is to protect the public, promote the welfare of animals, and enforce the city&amp;#39;s animal ordinances.&lt;/p&gt;\n\n&lt;p&gt;We do everything, from managing the shelter, handling adoptions, doing field calls, writing citations, etc. Some days I work alone, but I always have the police available for &amp;quot;backup&amp;quot; in the really hairy situations! Our favorite trick when responding to a stray dog is to just let it run from us while we follow in the truck, 95% of the time it will lead us right back home. Then we can talk to the owner about fixing the problem without needing to pick up the dog. If no one is home, we will try to secure the dog back in the property and leave a note for the owner to contact us. Otherwise, we will bring the dog to the shelter and hope for an owner to come for him! After a certain amount of time, we can try to find a home for the dog or release it to an animal rescue.&lt;/p&gt;\n\n&lt;p&gt;I also have the very tough job of euthenasia. As much as it would be ideal to be a no-kill shelter, it&amp;#39;s just not a reality with the number of pets needing homes vs the number of people wanting pets - and working within a limited space and budget. This is why we try to educate the public about the importance of spaying and neutering.&lt;/p&gt;\n\n&lt;p&gt;I got my job with experience, connections, and some good timing. I had recently finished college and was looking for a position within law enforcement near my husband&amp;#39;s job and our house. There happened to be an opening for an animal control officer in a neighboring city, with the last opening being over a few years prior. I happened to be familiar with a couple people within the city who provided recommendations, and I had prior experience working with a pet store and ranch. Everything just worked out perfect and I couldn&amp;#39;t be happier!&lt;/p&gt;\n\n&lt;p&gt;If this sort of thing interests you, there&amp;#39;s more of us over at &lt;a href=\"/r/animalcontrol\"&gt;/r/animalcontrol&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga7hhy", "score_hidden": false, "stickied": false, "created": 1492254943.0, "created_utc": 1492226143.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dga5pum", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kittenxxxo", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I work at a salon. I keep it clean, and then I brush/wash/dry the doggos. I didn't do anything speciel, just needed a job and was lucky enough to get it ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work at a salon. I keep it clean, and then I brush/wash/dry the doggos. I didn&amp;#39;t do anything speciel, just needed a job and was lucky enough to get it &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga5pum", "score_hidden": false, "stickied": false, "created": 1492252357.0, "created_utc": 1492223557.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dga6xni", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "leaping-elk", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I don't work explicitly with dogs, but I'm an ER vet tech. I started off as a receptionist in my clinic when I applied to a vet tech program for school. This is the only job I've ever had working with animals, but it has been worth the struggle (not just learning how to be a tech, but doing so in an extremely stressful environment).\n\nWe don't really have specific jobs among the techs, so I talk to clients, go over estimates, triage, and do diagnostics/treatments for all of our patients. I know it's not a job many people would want; between the awful hours and the nature of the work, it can burn people out really quickly. I've seen/smelled/heard some of the worst things and come home in tears a few times... but I wouldn't trade my job for anything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t work explicitly with dogs, but I&amp;#39;m an ER vet tech. I started off as a receptionist in my clinic when I applied to a vet tech program for school. This is the only job I&amp;#39;ve ever had working with animals, but it has been worth the struggle (not just learning how to be a tech, but doing so in an extremely stressful environment).&lt;/p&gt;\n\n&lt;p&gt;We don&amp;#39;t really have specific jobs among the techs, so I talk to clients, go over estimates, triage, and do diagnostics/treatments for all of our patients. I know it&amp;#39;s not a job many people would want; between the awful hours and the nature of the work, it can burn people out really quickly. I&amp;#39;ve seen/smelled/heard some of the worst things and come home in tears a few times... but I wouldn&amp;#39;t trade my job for anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga6xni", "score_hidden": false, "stickied": false, "created": 1492254102.0, "created_utc": 1492225302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dga6zfw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kaathari", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I got lucky and applied to an ad for a kennel tech at a boarding kennel. Avid animal lover since I was very young, and it just made sense. After about a year and a half, the owner put me in touch with a lady that grooms and she trained me I did that for nearly 7 years before carpal tunnel forced me to stop grooming full time. I still groom relatives dogs, mostly to keep some semblance of my skill set up to par. After that I picked up a job as a vet tech that personally trained all their staff, and now I'm a surgery technician for that same clinic. The chain of events from replying to a newspaper ad led me to have the best job I've ever had now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got lucky and applied to an ad for a kennel tech at a boarding kennel. Avid animal lover since I was very young, and it just made sense. After about a year and a half, the owner put me in touch with a lady that grooms and she trained me I did that for nearly 7 years before carpal tunnel forced me to stop grooming full time. I still groom relatives dogs, mostly to keep some semblance of my skill set up to par. After that I picked up a job as a vet tech that personally trained all their staff, and now I&amp;#39;m a surgery technician for that same clinic. The chain of events from replying to a newspaper ad led me to have the best job I&amp;#39;ve ever had now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga6zfw", "score_hidden": false, "stickied": false, "created": 1492254176.0, "created_utc": 1492225376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dga9l6b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "severalsmallweasles", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I work in a daycare and grooming salon and am starting the training program there. I spend my days supervising play, doing 1 on 1 training, teaching classes, bathing and cleaning. **So much cleaning**. \n\nmy family was in dog sports, I grew into it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work in a daycare and grooming salon and am starting the training program there. I spend my days supervising play, doing 1 on 1 training, teaching classes, bathing and cleaning. &lt;strong&gt;So much cleaning&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;my family was in dog sports, I grew into it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga9l6b", "score_hidden": false, "stickied": false, "created": 1492258356.0, "created_utc": 1492229556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dgajhzu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Leafy33", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm a veterinary assistant at a general practice vet clinic. I graduate my veterinary technician program in 1 month and then take my VTNE to gain my RVT title. I've been working in the field since 2010. \n\nI started out when I was 17 years old. I've always been interested in animals and decided to apply for a kennel assistant position, which I got. After I graduated high school, the clinic recognized my interest and trained me on assistant duties/reception duties. In 2015, I decided this is what I wanted to do forever and applied for my vet tech program to become a registered vet tech. And now, here I am :)\n\nAs an ER tech below has stated, it can be a difficult job. You're on the front line dealing with difficult and upset pet owners, trying to handle aggressive, fearful, and painful animals, getting mentally and emotionally exhausted all day from problem solving and expending all of your compassion. But at the same time, for some people, it's so much fun. I love the connections I make with my clients and getting to see their little puppy grow into a old dog. I love when I assist with an urgent surgery and a week later get to see that same dog walking through our door wagging it's tail. It's kind of addictive getting to put your technical skills to the test with difficult cases and patients - there's something so satisfying about collecting blood from a snarling, lunging dog while standing on your head upside down and the entire family is present, or placing an IVC in a 2lb, dehydrated, 16 yr old cat with the worst veins imaginable. To succeed in the field I believe you have to be optimistic and able to roll with the punches, love problem solving, be a workaholic, and have a very good sense of humor :)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a veterinary assistant at a general practice vet clinic. I graduate my veterinary technician program in 1 month and then take my VTNE to gain my RVT title. I&amp;#39;ve been working in the field since 2010. &lt;/p&gt;\n\n&lt;p&gt;I started out when I was 17 years old. I&amp;#39;ve always been interested in animals and decided to apply for a kennel assistant position, which I got. After I graduated high school, the clinic recognized my interest and trained me on assistant duties/reception duties. In 2015, I decided this is what I wanted to do forever and applied for my vet tech program to become a registered vet tech. And now, here I am :)&lt;/p&gt;\n\n&lt;p&gt;As an ER tech below has stated, it can be a difficult job. You&amp;#39;re on the front line dealing with difficult and upset pet owners, trying to handle aggressive, fearful, and painful animals, getting mentally and emotionally exhausted all day from problem solving and expending all of your compassion. But at the same time, for some people, it&amp;#39;s so much fun. I love the connections I make with my clients and getting to see their little puppy grow into a old dog. I love when I assist with an urgent surgery and a week later get to see that same dog walking through our door wagging it&amp;#39;s tail. It&amp;#39;s kind of addictive getting to put your technical skills to the test with difficult cases and patients - there&amp;#39;s something so satisfying about collecting blood from a snarling, lunging dog while standing on your head upside down and the entire family is present, or placing an IVC in a 2lb, dehydrated, 16 yr old cat with the worst veins imaginable. To succeed in the field I believe you have to be optimistic and able to roll with the punches, love problem solving, be a workaholic, and have a very good sense of humor :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgajhzu", "score_hidden": false, "stickied": false, "created": 1492283282.0, "created_utc": 1492254482.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dgav1op", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Highwaylove", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I went to vet assistant school 17 years ago.\n Worked in animal hospitals and kennels for 14 years. Got offered a job to expand a doggy daycare program. Currently in dog training school and have a popular doggy daycare. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went to vet assistant school 17 years ago.\n Worked in animal hospitals and kennels for 14 years. Got offered a job to expand a doggy daycare program. Currently in dog training school and have a popular doggy daycare. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgav1op", "score_hidden": false, "stickied": false, "created": 1492303838.0, "created_utc": 1492275038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dga7bio", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "usmc_misfit", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Although it's not a job per se, I volunteer at a non-profit organization that deals with rescuing, rehabilitating and finding a home for abandoned/abused animals. It's mostly about dogs and cats although we sometimes also have ducks, rabbits, guinea pigs and horses coming in.\n\nWe all have different *jobs*, as there aren't many active volunteers and we have to make do with what we have. I've *worked* as:\n\n* Educator (Giving talks at schools and companies).\n* Designer (Social media post, Lost &amp; Found posters, T-shirt designs).\n* Handler  (Showing dogs off, transporting them, keeping an eye out).\n* Trainer   (Basic obedience only, no credentials though).\n* Sponsor (Taking a dog in and personally look for a permanent home)\n* Enforcer  (Dealing with aggressive dogs, retrieve abused ones).\n\nI've always liked animals but I got into it because I stumbled upon an enormous dog on the street, think a great dane, that was in really bad shape. I took him in and then looked for a NGO to help me find a home for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Although it&amp;#39;s not a job per se, I volunteer at a non-profit organization that deals with rescuing, rehabilitating and finding a home for abandoned/abused animals. It&amp;#39;s mostly about dogs and cats although we sometimes also have ducks, rabbits, guinea pigs and horses coming in.&lt;/p&gt;\n\n&lt;p&gt;We all have different &lt;em&gt;jobs&lt;/em&gt;, as there aren&amp;#39;t many active volunteers and we have to make do with what we have. I&amp;#39;ve &lt;em&gt;worked&lt;/em&gt; as:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Educator (Giving talks at schools and companies).&lt;/li&gt;\n&lt;li&gt;Designer (Social media post, Lost &amp;amp; Found posters, T-shirt designs).&lt;/li&gt;\n&lt;li&gt;Handler  (Showing dogs off, transporting them, keeping an eye out).&lt;/li&gt;\n&lt;li&gt;Trainer   (Basic obedience only, no credentials though).&lt;/li&gt;\n&lt;li&gt;Sponsor (Taking a dog in and personally look for a permanent home)&lt;/li&gt;\n&lt;li&gt;Enforcer  (Dealing with aggressive dogs, retrieve abused ones).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;ve always liked animals but I got into it because I stumbled upon an enormous dog on the street, think a great dane, that was in really bad shape. I took him in and then looked for a NGO to help me find a home for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga7bio", "score_hidden": false, "stickied": false, "created": 1492254685.0, "created_utc": 1492225885.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dga4rg2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RemindMeBot", "parent_id": "t1_dga4r8w", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I will be messaging you on [**2017-04-18 02:09:23 UTC**](http://www.wolframalpha.com/input/?i=2017-04-18 02:09:23 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/dogs/comments/65gpab/discussion_people_whose_job_is_to_work_with_dogs/dga4r8w)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=[https://www.reddit.com/r/dogs/comments/65gpab/discussion_people_whose_job_is_to_work_with_dogs/dga4r8w]%0A%0ARemindMe!  72 hours.) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete Comment&amp;message=Delete! dga4rg2)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List Of Reminders&amp;message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&amp;subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will be messaging you on &lt;a href=\"http://www.wolframalpha.com/input/?i=2017-04-18%2002:09:23%20UTC%20To%20Local%20Time\"&gt;&lt;strong&gt;2017-04-18 02:09:23 UTC&lt;/strong&gt;&lt;/a&gt; to remind you of &lt;a href=\"https://www.reddit.com/r/dogs/comments/65gpab/discussion_people_whose_job_is_to_work_with_dogs/dga4r8w\"&gt;&lt;strong&gt;this link.&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://np.reddit.com/message/compose/?to=RemindMeBot&amp;amp;subject=Reminder&amp;amp;message=%5Bhttps://www.reddit.com/r/dogs/comments/65gpab/discussion_people_whose_job_is_to_work_with_dogs/dga4r8w%5D%0A%0ARemindMe!%20%2072%20hours.\"&gt;&lt;strong&gt;CLICK THIS LINK&lt;/strong&gt;&lt;/a&gt; to send a PM to also be reminded and to reduce spam.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Parent commenter can &lt;/sup&gt; &lt;a href=\"http://np.reddit.com/message/compose/?to=RemindMeBot&amp;amp;subject=Delete%20Comment&amp;amp;message=Delete!%20dga4rg2\"&gt;&lt;sup&gt;delete this message to hide from others.&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th&gt;&lt;a href=\"http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/\"&gt;&lt;sup&gt;FAQs&lt;/sup&gt;&lt;/a&gt;&lt;/th&gt;\n&lt;th&gt;&lt;a href=\"http://np.reddit.com/message/compose/?to=RemindMeBot&amp;amp;subject=Reminder&amp;amp;message=%5BLINK%20INSIDE%20SQUARE%20BRACKETS%20else%20default%20to%20FAQs%5D%0A%0ANOTE:%20Don&amp;#x27;t%20forget%20to%20add%20the%20time%20options%20after%20the%20command.%0A%0ARemindMe!\"&gt;&lt;sup&gt;Custom&lt;/sup&gt;&lt;/a&gt;&lt;/th&gt;\n&lt;th&gt;&lt;a href=\"http://np.reddit.com/message/compose/?to=RemindMeBot&amp;amp;subject=List%20Of%20Reminders&amp;amp;message=MyReminders!\"&gt;&lt;sup&gt;Your Reminders&lt;/sup&gt;&lt;/a&gt;&lt;/th&gt;\n&lt;th&gt;&lt;a href=\"http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&amp;amp;subject=Feedback\"&gt;&lt;sup&gt;Feedback&lt;/sup&gt;&lt;/a&gt;&lt;/th&gt;\n&lt;th&gt;&lt;a href=\"https://github.com/SIlver--/remindmebot-reddit\"&gt;&lt;sup&gt;Code&lt;/sup&gt;&lt;/a&gt;&lt;/th&gt;\n&lt;th&gt;&lt;a href=\"https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/\"&gt;&lt;sup&gt;Browser Extensions&lt;/sup&gt;&lt;/a&gt;&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga4rg2", "score_hidden": false, "stickied": false, "created": 1492250969.0, "created_utc": 1492222169.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4r8w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stompinghippo", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "RemindMe! 72 hours.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;RemindMe! 72 hours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dga4r8w", "score_hidden": false, "stickied": false, "created": 1492250961.0, "created_utc": 1492222161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dgag2yu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "eyegoug3r", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm a dog trainer! (a humble rookie I must admit) I grew up doing dog shows with my mom and I got the job by bothering my managers for a training position A LOT lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a dog trainer! (a humble rookie I must admit) I grew up doing dog shows with my mom and I got the job by bothering my managers for a training position A LOT lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgag2yu", "score_hidden": false, "stickied": false, "created": 1492272520.0, "created_utc": 1492243720.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65gpab", "likes": null, "replies": "", "user_reports": [], "id": "dgajsnh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "spotpig", "parent_id": "t3_65gpab", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I don't work directly with the dogs but I handle all the pr and marketing for an organization that helps homeless animals. I can bring my dog to work, snuggle with cats on my break, and am surrounded by amazing people who are extremely knowledgeable about various types of animals. \n\nHow I got to this point: I have an education background in media communication and experience in developing and managing public programs as well as special events.", "edited": 1492255575.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t work directly with the dogs but I handle all the pr and marketing for an organization that helps homeless animals. I can bring my dog to work, snuggle with cats on my break, and am surrounded by amazing people who are extremely knowledgeable about various types of animals. &lt;/p&gt;\n\n&lt;p&gt;How I got to this point: I have an education background in media communication and experience in developing and managing public programs as well as special events.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgajsnh", "score_hidden": false, "stickied": false, "created": 1492284154.0, "created_utc": 1492255354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]