[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a &lt;a href=\"http://imgur.com/a/qaBuw\"&gt;9 month old maltese poodle mix&lt;/a&gt; who has just discovered the magical world of dog parks.  The thing is, I can&amp;#39;t decide what is going on in her little doggy mind based on her body language.&lt;br/&gt;\n On one hand, she looks terrified (&lt;a href=\"https://i2.wp.com/amyshojai.com/wp-content/uploads/2016/07/FearChihuahua_1541404_original.jpg\"&gt;like this&lt;/a&gt;) when other dogs sniff at or play with her (on of off leash).  On the other hand, her tail is always wagging like crazy, and if separated, she&amp;#39;ll go right back to playing with the same dog.  If the owner picks the other dog up, she&amp;#39;ll even dance up on her back legs to try to play again.  The dogs she initiates play with the most are the ones that tend to pin her down or mount her, which seems odd too.  In the two instances where there was a bully dog that got out of hand, she reacted by running to me and jumping into my arms, shaking, and losing interest in playing for the next several minutes.  In those cases I would say she was definitely afraid and it more aligns with her usual fear behavior of shaking and looking to me for cuddles.  &lt;/p&gt;\n\n&lt;p&gt;My gut says that she is enjoying herself because:&lt;br/&gt;\n -tail wagging&lt;br/&gt;\n -she is excited to go to the park&lt;br/&gt;\n-she will eat/drink/bathroom at the dog park&lt;br/&gt;\n-I see her usual play behavior as separate from her usual fear behavior     &lt;/p&gt;\n\n&lt;p&gt;-she keeps coming back for more play if play is disrupted  &lt;/p&gt;\n\n&lt;p&gt;I just want to make sure I&amp;#39;m not reading things wrong and putting her in scary situations.  Does anyone have any idea what is going on here?  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have a [9 month old maltese poodle mix](http://imgur.com/a/qaBuw) who has just discovered the magical world of dog parks.  The thing is, I can't decide what is going on in her little doggy mind based on her body language.   \n On one hand, she looks terrified ([like this](https://i2.wp.com/amyshojai.com/wp-content/uploads/2016/07/FearChihuahua_1541404_original.jpg)) when other dogs sniff at or play with her (on of off leash).  On the other hand, her tail is always wagging like crazy, and if separated, she'll go right back to playing with the same dog.  If the owner picks the other dog up, she'll even dance up on her back legs to try to play again.  The dogs she initiates play with the most are the ones that tend to pin her down or mount her, which seems odd too.  In the two instances where there was a bully dog that got out of hand, she reacted by running to me and jumping into my arms, shaking, and losing interest in playing for the next several minutes.  In those cases I would say she was definitely afraid and it more aligns with her usual fear behavior of shaking and looking to me for cuddles.  \n   \nMy gut says that she is enjoying herself because:  \n -tail wagging  \n -she is excited to go to the park    \n-she will eat/drink/bathroom at the dog park  \n-I see her usual play behavior as separate from her usual fear behavior     \n\n-she keeps coming back for more play if play is disrupted  \n\nI just want to make sure I'm not reading things wrong and putting her in scary situations.  Does anyone have any idea what is going on here?  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Help!", "id": "65mups", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "allonzy", "saved": false, "mod_reports": [], "name": "t3_65mups", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "help", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/65mups/help_i_cant_tell_if_my_puppy_is_thrilled_or/", "num_reports": null, "locked": false, "stickied": false, "created": 1492337196.0, "url": "https://www.reddit.com/r/dogs/comments/65mups/help_i_cant_tell_if_my_puppy_is_thrilled_or/", "author_flair_text": null, "quarantine": false, "title": "[Help] I can't tell if my puppy is thrilled or terrified when playing with other dogs", "created_utc": 1492308396.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65mups", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65mups", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65mups", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65mups", "likes": null, "replies": "", "user_reports": [], "id": "dgbovrc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "allonzy", "parent_id": "t1_dgbnv93", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Yep! We only go to the little dog park.  She seems to like big dogs better,  but she's way too small for free play with them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep! We only go to the little dog park.  She seems to like big dogs better,  but she&amp;#39;s way too small for free play with them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgbovrc", "score_hidden": false, "stickied": false, "created": 1492346389.0, "created_utc": 1492317589.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnv93", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DuchessMe", "parent_id": "t1_dgbl32d", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "If the dog park has a small dog side, try to have her play there.  Sometimes the big breeds can do damage just because they are so much bigger (my min poodle has been hit by a big dog playing with another dog that just ran into her because not looking.)  In worse cases, big dogs' prey instincts can be triggered by running small fluffies.  Yes, she should be socialized with big dogs and small dogs but a dog park is often not the best place for that socialization with big dogs because you just don't know their background and little dogs (especially poodle types who aren't terriers) just don't have a real ability to protect themselves if something does go wrong).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the dog park has a small dog side, try to have her play there.  Sometimes the big breeds can do damage just because they are so much bigger (my min poodle has been hit by a big dog playing with another dog that just ran into her because not looking.)  In worse cases, big dogs&amp;#39; prey instincts can be triggered by running small fluffies.  Yes, she should be socialized with big dogs and small dogs but a dog park is often not the best place for that socialization with big dogs because you just don&amp;#39;t know their background and little dogs (especially poodle types who aren&amp;#39;t terriers) just don&amp;#39;t have a real ability to protect themselves if something does go wrong).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgbnv93", "score_hidden": false, "stickied": false, "created": 1492344641.0, "created_utc": 1492315841.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbl32d", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "allonzy", "parent_id": "t1_dgbjx0g", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Thanks for the info! That sounds about right.   And yeah she's never done anything aggressive.       \n\n   \nI agree with not picking her up for the reasons you mentioned.   I don't  think I've ever done that at the dog park except the first time because I had a brain fart.  Haha I usually just call her over.  If she comes to me for reassurance,  I will pat her and even let her hide behind me,  but I will try to keep her on the ground and not in my lap.   \n I want her to learn to solve problems on her own and have confidence without needing me.   That's one reason we started to go to the dog park and I do think it's helping.  She spends less time with me and more time playing and exploring.      ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the info! That sounds about right.   And yeah she&amp;#39;s never done anything aggressive.       &lt;/p&gt;\n\n&lt;p&gt;I agree with not picking her up for the reasons you mentioned.   I don&amp;#39;t  think I&amp;#39;ve ever done that at the dog park except the first time because I had a brain fart.  Haha I usually just call her over.  If she comes to me for reassurance,  I will pat her and even let her hide behind me,  but I will try to keep her on the ground and not in my lap.&lt;br/&gt;\n I want her to learn to solve problems on her own and have confidence without needing me.   That&amp;#39;s one reason we started to go to the dog park and I do think it&amp;#39;s helping.  She spends less time with me and more time playing and exploring.      &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgbl32d", "score_hidden": false, "stickied": false, "created": 1492340299.0, "created_utc": 1492311499.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjx0g", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "EagleFalconn", "parent_id": "t3_65mups", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "It's a security thing. Your dog wants to play with the other dogs, but the other dogs are intimidating because your dog isn't very confident at the park yet. She's miming submissive, but still wants to play even when she's getting ganged up on.\n\nAs long as your dog reinitiates play and isn't baring teeth or snapping or other aggressive/potentially harmful fear behaviors, she's doing fine.\n\nAlso, stop picking up your dog at the park (or anywhere else for that matter) to \"protect\" her. It exacerbates her insecurity and keeps her from standing up for herself at the park, and you're likely to have another dog jump up to try to get at your dog some day and scare the bejeezsus out of you both.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a security thing. Your dog wants to play with the other dogs, but the other dogs are intimidating because your dog isn&amp;#39;t very confident at the park yet. She&amp;#39;s miming submissive, but still wants to play even when she&amp;#39;s getting ganged up on.&lt;/p&gt;\n\n&lt;p&gt;As long as your dog reinitiates play and isn&amp;#39;t baring teeth or snapping or other aggressive/potentially harmful fear behaviors, she&amp;#39;s doing fine.&lt;/p&gt;\n\n&lt;p&gt;Also, stop picking up your dog at the park (or anywhere else for that matter) to &amp;quot;protect&amp;quot; her. It exacerbates her insecurity and keeps her from standing up for herself at the park, and you&amp;#39;re likely to have another dog jump up to try to get at your dog some day and scare the bejeezsus out of you both.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgbjx0g", "score_hidden": false, "stickied": false, "created": 1492338593.0, "created_utc": 1492309793.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65mups", "likes": null, "replies": "", "user_reports": [], "id": "dgbw0h7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whenthemoonisbroken", "parent_id": "t3_65mups", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "She's so cute.  My boxer would love her, he adores little dogs and is very gentle with them.  \n\nShe sounds like she's having fun but that it is so exciting that it could tip over into being scared easily.   Maybe keep visits short and sweet for how, so she keeps having lots of good experiences as her confidence grows. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s so cute.  My boxer would love her, he adores little dogs and is very gentle with them.  &lt;/p&gt;\n\n&lt;p&gt;She sounds like she&amp;#39;s having fun but that it is so exciting that it could tip over into being scared easily.   Maybe keep visits short and sweet for how, so she keeps having lots of good experiences as her confidence grows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgbw0h7", "score_hidden": false, "stickied": false, "created": 1492364697.0, "created_utc": 1492335897.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65mups", "likes": null, "replies": "", "user_reports": [], "id": "dgcjnfi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Johnny_Kilroy_84", "parent_id": "t3_65mups", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "My new rescue is the same way. He is a ~8 month old poodle/terrier mix at about 20lbs. He will play with much larger dogs and get them to chase him but he looks terrified most of the time. The thing is, he initiates most/all the interaction with other dogs. We'll call him over or try to get him to go to another area of the park because he looks very scared, but then he'll just walk or run over to the dog he was playing with before. He never gets aggressive or growls/bears his teeth/bites; he just has a look of extreme nervousness on his face when he starts to sniff another dog, which then turns to terror when the other dog gives chase. He never runs to us for protection or anything like that. Maybe that's just the look on his face when he gets up to full speed?\n\nHe's gotten better over the last few times we went to the park. We went today and it appeared like he was actually having a good time playing with some of the dogs versus his usual sniff --&gt; jump/paw/mount --&gt; sprint --&gt; repeat. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My new rescue is the same way. He is a ~8 month old poodle/terrier mix at about 20lbs. He will play with much larger dogs and get them to chase him but he looks terrified most of the time. The thing is, he initiates most/all the interaction with other dogs. We&amp;#39;ll call him over or try to get him to go to another area of the park because he looks very scared, but then he&amp;#39;ll just walk or run over to the dog he was playing with before. He never gets aggressive or growls/bears his teeth/bites; he just has a look of extreme nervousness on his face when he starts to sniff another dog, which then turns to terror when the other dog gives chase. He never runs to us for protection or anything like that. Maybe that&amp;#39;s just the look on his face when he gets up to full speed?&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s gotten better over the last few times we went to the park. We went today and it appeared like he was actually having a good time playing with some of the dogs versus his usual sniff --&amp;gt; jump/paw/mount --&amp;gt; sprint --&amp;gt; repeat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcjnfi", "score_hidden": false, "stickied": false, "created": 1492404150.0, "created_utc": 1492375350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]