[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Two years ago we launched Treats Happen seriously. We&amp;#39;ve learned a lot over that time and always want to share with others.&lt;/p&gt;\n\n&lt;p&gt;Last week we received an email from someone just starting out. Here is the email I replied back with a few lessons we have learned along the way. Hopefully there will be a nugget or two in here for you or a friend as well. Always happy to help out the &lt;a href=\"/r/dogs\"&gt;/r/dogs&lt;/a&gt; community if anyone has an questions about their business or you just need an ear to listen to.&lt;/p&gt;\n\n&lt;p&gt;Thank you so much for reaching out and sending a picture of Bruno and Marty! It&amp;#39;s a long slow build but here are a few things that have helped us along the way.&lt;/p&gt;\n\n&lt;h1&gt;Things that have worked well for us&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;Take care of your customers&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We probably over do it but we want to be the most customer centric pet treat company. We regularly add extra product to our shipments and for our retailers to give out to their best customers. We&amp;#39;re big believers in doubling down on those who are loyal to us. &lt;/p&gt;\n\n&lt;p&gt;Our goal is to treat our customers so well they feel guilty about buying someone else&amp;#39;s treats. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Engage with everyone!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We try to reply to every comment and message. You never know what it will lead to or who will refer you. You also never know who you&amp;#39;ll meet! &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You have the flexibility to be fast&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;While other brands may have more budget, you have more speed. You won&amp;#39;t be able to outspend Milk Bone or Royal Canin but you can be quicker and more genuine.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Be Creative with your promotions&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Try to have a promotion as often as you can! Don&amp;#39;t rely on discounts but find cool things to give out or do for your customers. Make them time or quantity limited. &lt;/p&gt;\n\n&lt;h1&gt;Things to avoid&lt;/h1&gt;\n\n&lt;p&gt;You&amp;#39;ll have a lot of &amp;quot;influencers&amp;quot; reach out to you on Instagram. They all think they have a lot more pull than they do. In our experience unless they&amp;#39;re a great photographer they&amp;#39;re a waste of your time and money.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Retailers are tough&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A lot of retailers are slow to more, don&amp;#39;t like that we sell online and are happy with the status quo. Find a couple retailers who love you and double down with them. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Don&amp;#39;t overdo discounts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So many ecom companies give 10-20% just for signing up. We prefer to give value to our customers who order a lot with the collections, five packs, and ten packs. We don&amp;#39;t do a lot of discounts as we don&amp;#39;t want to train our customers to only but on discount. We prefer to give everything but the product away for free and create something worth paying for. &lt;/p&gt;\n\n&lt;p&gt;I hope that this helps, and good luck! It is tough out there but remember to think a few years ahead. Not just a few days or hours. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Two years ago we launched Treats Happen seriously. We've learned a lot over that time and always want to share with others.\n\nLast week we received an email from someone just starting out. Here is the email I replied back with a few lessons we have learned along the way. Hopefully there will be a nugget or two in here for you or a friend as well. Always happy to help out the /r/dogs community if anyone has an questions about their business or you just need an ear to listen to.\n\n\nThank you so much for reaching out and sending a picture of Bruno and Marty! It's a long slow build but here are a few things that have helped us along the way.\n\n#Things that have worked well for us\n\n**Take care of your customers**\n\nWe probably over do it but we want to be the most customer centric pet treat company. We regularly add extra product to our shipments and for our retailers to give out to their best customers. We're big believers in doubling down on those who are loyal to us. \n\nOur goal is to treat our customers so well they feel guilty about buying someone else's treats. \n\n**Engage with everyone!**\n\nWe try to reply to every comment and message. You never know what it will lead to or who will refer you. You also never know who you'll meet! \n\n**You have the flexibility to be fast**\n\nWhile other brands may have more budget, you have more speed. You won't be able to outspend Milk Bone or Royal Canin but you can be quicker and more genuine.\n\n**Be Creative with your promotions**\n\nTry to have a promotion as often as you can! Don't rely on discounts but find cool things to give out or do for your customers. Make them time or quantity limited. \n\n\n#Things to avoid\n\nYou'll have a lot of \"influencers\" reach out to you on Instagram. They all think they have a lot more pull than they do. In our experience unless they're a great photographer they're a waste of your time and money.\n\n**Retailers are tough**\n\nA lot of retailers are slow to more, don't like that we sell online and are happy with the status quo. Find a couple retailers who love you and double down with them. \n\n**Don't overdo discounts**\n\nSo many ecom companies give 10-20% just for signing up. We prefer to give value to our customers who order a lot with the collections, five packs, and ten packs. We don't do a lot of discounts as we don't want to train our customers to only but on discount. We prefer to give everything but the product away for free and create something worth paying for. \n\nI hope that this helps, and good luck! It is tough out there but remember to think a few years ahead. Not just a few days or hours. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Fluff", "id": "65opfn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 41, "report_reasons": null, "author": "walkerlucas", "saved": false, "mod_reports": [], "name": "t3_65opfn", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "fluff", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/65opfn/fluff_some_thoughtsadvice_for_anyone_who_has_or/", "num_reports": null, "locked": false, "stickied": false, "created": 1492371455.0, "url": "https://www.reddit.com/r/dogs/comments/65opfn/fluff_some_thoughtsadvice_for_anyone_who_has_or/", "author_flair_text": "3 Boxers York, Charlotte, Bentley", "quarantine": false, "title": "[FLUFF] Some thoughts/advice for anyone who has or is starting a dog business.", "created_utc": 1492342655.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]