[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry if this isn&amp;#39;t the right place to post this. I&amp;#39;m 17 and have been diagnosed with high functioning autism, depression and obsessive compulsive disorder. I love dogs, but I wasn&amp;#39;t able to be around them because I can&amp;#39;t touch anything without worrying about germs, especially animals. The other day I met my cousin&amp;#39;s Bagel and he was very nice and put his head on my lap. I was petting him and he even licked my hand. A few months ago before I started getting pills for ocd and therapy for autism and depression, this would have been impossible. Ive really wanted a pug for ages because I love pugs and I want to get a rescue dog and I will walk it everyday. I think getting a dog will help me deal with my autism and ocd, but my mum won&amp;#39;t let me because we have an old cat, She doesn&amp;#39;t really know anything about dogs and she thinks she&amp;#39;ll be the one taking care of it (I&amp;#39;ll be the one). If I pay for a dog and take care of it is there any way I can convince her?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm sorry if this isn't the right place to post this. I'm 17 and have been diagnosed with high functioning autism, depression and obsessive compulsive disorder. I love dogs, but I wasn't able to be around them because I can't touch anything without worrying about germs, especially animals. The other day I met my cousin's Bagel and he was very nice and put his head on my lap. I was petting him and he even licked my hand. A few months ago before I started getting pills for ocd and therapy for autism and depression, this would have been impossible. Ive really wanted a pug for ages because I love pugs and I want to get a rescue dog and I will walk it everyday. I think getting a dog will help me deal with my autism and ocd, but my mum won't let me because we have an old cat, She doesn't really know anything about dogs and she thinks she'll be the one taking care of it (I'll be the one). If I pay for a dog and take care of it is there any way I can convince her?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Help!", "id": "65prmw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 51, "report_reasons": null, "author": "The_baby_bat", "saved": false, "mod_reports": [], "name": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": false, "link_flair_css_class": "help", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/65prmw/help_i_think_a_dog_will_help_with_my_autism_how/", "num_reports": null, "locked": false, "stickied": false, "created": 1492386737.0, "url": "https://www.reddit.com/r/dogs/comments/65prmw/help_i_think_a_dog_will_help_with_my_autism_how/", "author_flair_text": null, "quarantine": false, "title": "[Help] I think a dog will help with my autism, how can I convince my mum?", "created_utc": 1492357937.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 20, "visited": false, "subreddit_type": "public", "ups": 51}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgca8kw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "091973", "parent_id": "t1_dgc8t3u", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "All of the other logistics just don't seem to fit so I didn't even bother going into the emotional side of it, but you're absolutely right. The puppy blues and post-adoption blues are SO REAL and as much as my dog has helped with my anxiety, she's also become the source of some of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All of the other logistics just don&amp;#39;t seem to fit so I didn&amp;#39;t even bother going into the emotional side of it, but you&amp;#39;re absolutely right. The puppy blues and post-adoption blues are SO REAL and as much as my dog has helped with my anxiety, she&amp;#39;s also become the source of some of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgca8kw", "score_hidden": false, "stickied": false, "created": 1492391756.0, "created_utc": 1492362956.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8t3u", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "ThePinkBerry", "parent_id": "t1_dgc7n7x", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "This is a very comprehensive answer! I would worry in particular about the emotional part of it - given the issues you mentioned. Getting a new dog is never easy on the mind and it will be worse before it gets better. You need to be prepared to face a lot of anxiety and bad thoughts. I have gotten my new dog 2 months ago and even though I was prepared for a very tough time, it's still much harder than I thought. I don't have the issues you mentioned and I still found it very hard emotionally. \n\nNevermind all the hours of work that go into training - a nice well behaved dog does not get born like that, lots of hours of work are needed. \n\nI am sure you can do it if you really want to - but be aware it's hard work!", "edited": 1492361439.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a very comprehensive answer! I would worry in particular about the emotional part of it - given the issues you mentioned. Getting a new dog is never easy on the mind and it will be worse before it gets better. You need to be prepared to face a lot of anxiety and bad thoughts. I have gotten my new dog 2 months ago and even though I was prepared for a very tough time, it&amp;#39;s still much harder than I thought. I don&amp;#39;t have the issues you mentioned and I still found it very hard emotionally. &lt;/p&gt;\n\n&lt;p&gt;Nevermind all the hours of work that go into training - a nice well behaved dog does not get born like that, lots of hours of work are needed. &lt;/p&gt;\n\n&lt;p&gt;I am sure you can do it if you really want to - but be aware it&amp;#39;s hard work!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgc8t3u", "score_hidden": false, "stickied": false, "created": 1492389908.0, "created_utc": 1492361108.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcd574", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "l2eversel2obot", "parent_id": "t1_dgcb82y", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Pugs are notorious for having health problems so I think, in this case, pet insurance would be a good idea. Other wise the out of pocket expenses could be overwhelming for a teenager or family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pugs are notorious for having health problems so I think, in this case, pet insurance would be a good idea. Other wise the out of pocket expenses could be overwhelming for a teenager or family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcd574", "score_hidden": false, "stickied": false, "created": 1492395601.0, "created_utc": 1492366801.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcg5hw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dioxycyclone", "parent_id": "t1_dgcc15l", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I'm not trying to say that there isn't responsibility, financially or otherwise, involved in having a dog. Just trying to be realistic. My fiancé adopted a dog for me without me knowing or agreeing, and he ended up needing tons of vet visits because he had bad hip dysplasya. I didn't have money saved and didn't have health insurance for him either. But I made it work. Things were fine and butts butts butts wouldn't have\nChanged anything. \n\nThe overarching theme being that people will make it work if they want to, and they won't if they don't. Telling them it's going to be expensive and that\nThey need savings and insurance to adopt a lab mix. That just keeps good owners from thinking they're capable. Idiots won't ask. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not trying to say that there isn&amp;#39;t responsibility, financially or otherwise, involved in having a dog. Just trying to be realistic. My fiancé adopted a dog for me without me knowing or agreeing, and he ended up needing tons of vet visits because he had bad hip dysplasya. I didn&amp;#39;t have money saved and didn&amp;#39;t have health insurance for him either. But I made it work. Things were fine and butts butts butts wouldn&amp;#39;t have\nChanged anything. &lt;/p&gt;\n\n&lt;p&gt;The overarching theme being that people will make it work if they want to, and they won&amp;#39;t if they don&amp;#39;t. Telling them it&amp;#39;s going to be expensive and that\nThey need savings and insurance to adopt a lab mix. That just keeps good owners from thinking they&amp;#39;re capable. Idiots won&amp;#39;t ask. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcg5hw", "score_hidden": false, "stickied": false, "created": 1492399623.0, "created_utc": 1492370823.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc15l", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Erinescence", "parent_id": "t1_dgcb82y", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Very good point. An adult rescue dog can be much less stressful once he settles into his new home. \n\nBut the financial aspects are important to consider, especially as someone too young to have a significant and consistent income. \n\nI mentioned this above, but one of my biggest concerns with any teen getting a dog is that their lives are about to undergo significant changes and unpredictable shifts that can make dog ownership untenable. Not because they don't love the dogs, not because they aren't responsible.  But when you're off to college or moving frequently as so many people in their late teens and early twenties do, it can become quite complicated, if not impossible, to own a dog. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good point. An adult rescue dog can be much less stressful once he settles into his new home. &lt;/p&gt;\n\n&lt;p&gt;But the financial aspects are important to consider, especially as someone too young to have a significant and consistent income. &lt;/p&gt;\n\n&lt;p&gt;I mentioned this above, but one of my biggest concerns with any teen getting a dog is that their lives are about to undergo significant changes and unpredictable shifts that can make dog ownership untenable. Not because they don&amp;#39;t love the dogs, not because they aren&amp;#39;t responsible.  But when you&amp;#39;re off to college or moving frequently as so many people in their late teens and early twenties do, it can become quite complicated, if not impossible, to own a dog. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcc15l", "score_hidden": false, "stickied": false, "created": 1492394117.0, "created_utc": 1492365317.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcb82y", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Dioxycyclone", "parent_id": "t1_dgc7n7x", "subreddit_name_prefixed": "r/dogs", "controversiality": 1, "body": "As an owner four dogs, I don't have pet insurance. I don't think this level of care would be needed for a five year old rescue pug, which OP clearly states he wants. Not every dog needs training classes. \n\nI'm not saying there isn't clear anxieties and struggles with dog ownership, but an older rescue dog is not nearly the same magnitude as a husky puppy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As an owner four dogs, I don&amp;#39;t have pet insurance. I don&amp;#39;t think this level of care would be needed for a five year old rescue pug, which OP clearly states he wants. Not every dog needs training classes. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying there isn&amp;#39;t clear anxieties and struggles with dog ownership, but an older rescue dog is not nearly the same magnitude as a husky puppy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcb82y", "score_hidden": false, "stickied": false, "created": 1492393061.0, "created_utc": 1492364261.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7n7x", "gilded": 0, "archived": false, "score": 99, "report_reasons": null, "author": "091973", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "You have to convince her that you can actually take care of this dog. You're willing to pet it and walk it, sure, but what about picking up its poop? Cleaning up when it has an accident in the house? Taking the time to house train (even house trained adult dogs can have accidents and need reinforcement when moving to a new home)? Giving it a bath when it rolls around in dirt and more poop? Making sure it doesn't eat the wrong thing off the ground (I've had to pull a wide variety of things out of my dog's mouth)?\n\nDo you have enough money to afford pet health insurance every month? Do you have enough savings to pay for an emergency?\n\nDo you have the time and money to join obedience classes? A typical 6-week course from a humane society around me runs upwards of $180.\n\nYou're a senior or rising senior in high school, right? Are you prepared to wake up early to walk the dog before school? Will you rush home to let the dog out and walk it after class, because dogs should not go more than 8 hours without a break? What will happen to the dog when you go to college? Even if you go local and live at home, your schedule will change, you'll have to navigate a new academic system.\n\nEspecially if you've never owned a dog before, there's a lot more that goes into its care physically, emotionally, and financially than one would think. If you can come up with an answer for all of these scenarios and lay it all out for your mom, so it's clear that you are willing to do *everything* the dog needs and you have a plan for it beyond high school, then sure, you have a chance at convincing her to let you have a dog. Otherwise, I absolutely understand your mom's concern that she'll end up being the primary caretaker.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have to convince her that you can actually take care of this dog. You&amp;#39;re willing to pet it and walk it, sure, but what about picking up its poop? Cleaning up when it has an accident in the house? Taking the time to house train (even house trained adult dogs can have accidents and need reinforcement when moving to a new home)? Giving it a bath when it rolls around in dirt and more poop? Making sure it doesn&amp;#39;t eat the wrong thing off the ground (I&amp;#39;ve had to pull a wide variety of things out of my dog&amp;#39;s mouth)?&lt;/p&gt;\n\n&lt;p&gt;Do you have enough money to afford pet health insurance every month? Do you have enough savings to pay for an emergency?&lt;/p&gt;\n\n&lt;p&gt;Do you have the time and money to join obedience classes? A typical 6-week course from a humane society around me runs upwards of $180.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a senior or rising senior in high school, right? Are you prepared to wake up early to walk the dog before school? Will you rush home to let the dog out and walk it after class, because dogs should not go more than 8 hours without a break? What will happen to the dog when you go to college? Even if you go local and live at home, your schedule will change, you&amp;#39;ll have to navigate a new academic system.&lt;/p&gt;\n\n&lt;p&gt;Especially if you&amp;#39;ve never owned a dog before, there&amp;#39;s a lot more that goes into its care physically, emotionally, and financially than one would think. If you can come up with an answer for all of these scenarios and lay it all out for your mom, so it&amp;#39;s clear that you are willing to do &lt;em&gt;everything&lt;/em&gt; the dog needs and you have a plan for it beyond high school, then sure, you have a chance at convincing her to let you have a dog. Otherwise, I absolutely understand your mom&amp;#39;s concern that she&amp;#39;ll end up being the primary caretaker.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgc7n7x", "score_hidden": false, "stickied": false, "created": 1492388368.0, "created_utc": 1492359568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 99}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgc8am3", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "lizzyborden42", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Have you considered volunteering at a shelter?  One big thing you haven't thought about is cleaning up after the dog. There will be poop.  It sounds like you're making great progress, but I am not sure that you are at a point where you can honestly say you will totally take care of a dog when you haven't had to pick up poop or clean dog puke out of a rug.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered volunteering at a shelter?  One big thing you haven&amp;#39;t thought about is cleaning up after the dog. There will be poop.  It sounds like you&amp;#39;re making great progress, but I am not sure that you are at a point where you can honestly say you will totally take care of a dog when you haven&amp;#39;t had to pick up poop or clean dog puke out of a rug.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgc8am3", "score_hidden": false, "stickied": false, "created": 1492389235.0, "created_utc": 1492360435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcsc7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "midnitebrz", "parent_id": "t1_dgcb9fj", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "On the housing situation, if it's for autism they could easily get a letter for the dog as an emotional support animal and live with the dog in dorms or any housing, regardless of no pet laws. People abuse the system a lot but if it's for autism they have a legitimate reason to have an ESA", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On the housing situation, if it&amp;#39;s for autism they could easily get a letter for the dog as an emotional support animal and live with the dog in dorms or any housing, regardless of no pet laws. People abuse the system a lot but if it&amp;#39;s for autism they have a legitimate reason to have an ESA&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcsc7i", "score_hidden": false, "stickied": false, "created": 1492415784.0, "created_utc": 1492386984.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcb9fj", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Erinescence", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Lots of good answers here. \n\nOne thing I haven't seen mentioned yet is that you're 17 and many young people leave home when they're 18-25 either because they go to college or it's just time to be out on their own. \n\nDogs can live up to 20 years old and will need a caring and responsible home for their entire lives. You can't bring them with you to college or university.  It's also very difficult to find rental apartments that allow them, especially if they are over 25 lbs. If you're eligible for some sort of assistance to move out on your own when you're 18, the programs you qualify for may not allow pets.\n\nI think /u/Lizzyborden42 is on the right track here.  Try volunteering at a shelter, or if your mom agrees, try fostering a dog at first.  Volunteering gives you a lot of the benefits of having a dog in your life without the full responsibility. Fostering gives you an idea of what it is like to live with a dog long-term and would allow you to demonstrate to your mom how well and consistently you can care for one without the 20 year commitment.", "edited": 1492364726.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of good answers here. &lt;/p&gt;\n\n&lt;p&gt;One thing I haven&amp;#39;t seen mentioned yet is that you&amp;#39;re 17 and many young people leave home when they&amp;#39;re 18-25 either because they go to college or it&amp;#39;s just time to be out on their own. &lt;/p&gt;\n\n&lt;p&gt;Dogs can live up to 20 years old and will need a caring and responsible home for their entire lives. You can&amp;#39;t bring them with you to college or university.  It&amp;#39;s also very difficult to find rental apartments that allow them, especially if they are over 25 lbs. If you&amp;#39;re eligible for some sort of assistance to move out on your own when you&amp;#39;re 18, the programs you qualify for may not allow pets.&lt;/p&gt;\n\n&lt;p&gt;I think &lt;a href=\"/u/Lizzyborden42\"&gt;/u/Lizzyborden42&lt;/a&gt; is on the right track here.  Try volunteering at a shelter, or if your mom agrees, try fostering a dog at first.  Volunteering gives you a lot of the benefits of having a dog in your life without the full responsibility. Fostering gives you an idea of what it is like to live with a dog long-term and would allow you to demonstrate to your mom how well and consistently you can care for one without the 20 year commitment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcb9fj", "score_hidden": false, "stickied": false, "created": 1492393110.0, "created_utc": 1492364310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgc7uhi", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Keystoner", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Dogs can be quite expensive. Since you're very young, you really need your mom to be fully supportive and agreeable to help cover food and vet bills. The responsibility of dog ownership is more than providing love and regular walks. It also entails paying for regular vet visits, monthly flea and worm medications, and costs of food. This is best case scenario, any accidents or illnesses can be quite expensive. Just a few weeks ago my dog tripped on the stairs and tore his dew claw nail off. This cost almost $1200 in surgery bills and medication. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dogs can be quite expensive. Since you&amp;#39;re very young, you really need your mom to be fully supportive and agreeable to help cover food and vet bills. The responsibility of dog ownership is more than providing love and regular walks. It also entails paying for regular vet visits, monthly flea and worm medications, and costs of food. This is best case scenario, any accidents or illnesses can be quite expensive. Just a few weeks ago my dog tripped on the stairs and tore his dew claw nail off. This cost almost $1200 in surgery bills and medication. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgc7uhi", "score_hidden": false, "stickied": false, "created": 1492388640.0, "created_utc": 1492359840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcd8kq", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "coldfirephoenix", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Okay, convince *us* that a dog would help. What are you basing this assumption on? How did you arrive at the conclusion that a dog would help, what kind of research did you do?\n\nIf you can give me good answers to the question \"Why do you think having a dog would help you?\", then you can give your mother the exact same reasons. But if you don't have a good answer, then this should not be the argument you should use with your mother either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, convince &lt;em&gt;us&lt;/em&gt; that a dog would help. What are you basing this assumption on? How did you arrive at the conclusion that a dog would help, what kind of research did you do?&lt;/p&gt;\n\n&lt;p&gt;If you can give me good answers to the question &amp;quot;Why do you think having a dog would help you?&amp;quot;, then you can give your mother the exact same reasons. But if you don&amp;#39;t have a good answer, then this should not be the argument you should use with your mother either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcd8kq", "score_hidden": false, "stickied": false, "created": 1492395723.0, "created_utc": 1492366923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgccv61", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "icefire9", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Dogs can be very messy.  Dogs get sick.  I've had to clean up my dog's puke and diarrhea multiple times.  Its not like, a regular occurrence, but its something that will probably happen at some point.\n\nDepending on your situation, you may need to pick up your dog's poop when you walk him.  They can get into the trash, into mud, into god knows what else and you have to clean them up and clean up after them.\n\nIf you're still set on it, you might be able to convince your mom to try fostering a dog first.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dogs can be very messy.  Dogs get sick.  I&amp;#39;ve had to clean up my dog&amp;#39;s puke and diarrhea multiple times.  Its not like, a regular occurrence, but its something that will probably happen at some point.&lt;/p&gt;\n\n&lt;p&gt;Depending on your situation, you may need to pick up your dog&amp;#39;s poop when you walk him.  They can get into the trash, into mud, into god knows what else and you have to clean them up and clean up after them.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re still set on it, you might be able to convince your mom to try fostering a dog first.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgccv61", "score_hidden": false, "stickied": false, "created": 1492395225.0, "created_utc": 1492366425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgci3rq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TastyFace", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "/u/091973 has a very good point about cleaning up accidents and waste in general. You mention struggling with germaphobia, though it sounds like you are improving. That being said, jumping straight into having a dog might be a bit much. \n\nYou say you need to convince your mom that you can care for the animal. Why not offer to take on the cat-related responsibilities for a couple weeks?  At the very least, the litter box. (If you can handle that, you can handle anything I think)\n\nAlternately, you could look into volunteering at a dog shelter to get more experience and exposure to grossness before making the leap. \n\nI wish you the best of luck. Remember, you can work on improving yourself with or without a dog, and you've got a lifetime of opportunities to adopt one if now isn't the time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/091973\"&gt;/u/091973&lt;/a&gt; has a very good point about cleaning up accidents and waste in general. You mention struggling with germaphobia, though it sounds like you are improving. That being said, jumping straight into having a dog might be a bit much. &lt;/p&gt;\n\n&lt;p&gt;You say you need to convince your mom that you can care for the animal. Why not offer to take on the cat-related responsibilities for a couple weeks?  At the very least, the litter box. (If you can handle that, you can handle anything I think)&lt;/p&gt;\n\n&lt;p&gt;Alternately, you could look into volunteering at a dog shelter to get more experience and exposure to grossness before making the leap. &lt;/p&gt;\n\n&lt;p&gt;I wish you the best of luck. Remember, you can work on improving yourself with or without a dog, and you&amp;#39;ve got a lifetime of opportunities to adopt one if now isn&amp;#39;t the time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgci3rq", "score_hidden": false, "stickied": false, "created": 1492402153.0, "created_utc": 1492373353.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcbrhg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Dioxycyclone", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "I want to inject some other opinions on dog ownership here. First of all, I think your desire to get an older rescue pug is awesome. Puppies are a huge pain and older dogs are so sweet and easygoing. Pugs would be perfect for you, they are standard couch potatoes. \n\nDog ownership does not require pet insurance or regular training. Many dogs are mellow and established in good habits, and although you may need training, it's not nearly as certain as if you were getting a puppy. \n\nHere's my two cents. Show your mom that you will be responsible for this dog. Save up any your money for dog emergencies. Take the twice daily walks that you will need to walk with this dog. Discuss with your mom the plan you have, that your desire to have a dog is more than a fleeting thought of a teenager, but a well thought out decision of an adult. Read books on dog care and training. You could even start training your old cat using training methods for dogs. The possibilities are endless. But you can show your mom that you will be responsible, and show her your responsibility, and I'm certain she would reconsider. \n\nIf you are not willing to do this stuff to get a dog, you certainly won't do it when you have a dog. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to inject some other opinions on dog ownership here. First of all, I think your desire to get an older rescue pug is awesome. Puppies are a huge pain and older dogs are so sweet and easygoing. Pugs would be perfect for you, they are standard couch potatoes. &lt;/p&gt;\n\n&lt;p&gt;Dog ownership does not require pet insurance or regular training. Many dogs are mellow and established in good habits, and although you may need training, it&amp;#39;s not nearly as certain as if you were getting a puppy. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my two cents. Show your mom that you will be responsible for this dog. Save up any your money for dog emergencies. Take the twice daily walks that you will need to walk with this dog. Discuss with your mom the plan you have, that your desire to have a dog is more than a fleeting thought of a teenager, but a well thought out decision of an adult. Read books on dog care and training. You could even start training your old cat using training methods for dogs. The possibilities are endless. But you can show your mom that you will be responsible, and show her your responsibility, and I&amp;#39;m certain she would reconsider. &lt;/p&gt;\n\n&lt;p&gt;If you are not willing to do this stuff to get a dog, you certainly won&amp;#39;t do it when you have a dog. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcbrhg", "score_hidden": false, "stickied": false, "created": 1492393763.0, "created_utc": 1492364963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcet0k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AGirlNamedRoni", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Eleven years ago my husband and I adopted a black lab/australian shepherd mix who changed my nephew's life. He also has high functioning autism, but was deathly afraid of dogs. She cured his fear of dogs and now he loves them. \n\nBefore going and adopting a dog, maybe contact a local shelter and inquire about fostering a dog. You would be able to see what day to day duties are required for owning a dog, and you would be able to return the dog if it isn't the kind of thing for you. Also, the shelters usually pay for vet bills and food while the dog is in your care. If it works out, you could adopt the dog.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eleven years ago my husband and I adopted a black lab/australian shepherd mix who changed my nephew&amp;#39;s life. He also has high functioning autism, but was deathly afraid of dogs. She cured his fear of dogs and now he loves them. &lt;/p&gt;\n\n&lt;p&gt;Before going and adopting a dog, maybe contact a local shelter and inquire about fostering a dog. You would be able to see what day to day duties are required for owning a dog, and you would be able to return the dog if it isn&amp;#39;t the kind of thing for you. Also, the shelters usually pay for vet bills and food while the dog is in your care. If it works out, you could adopt the dog.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcet0k", "score_hidden": false, "stickied": false, "created": 1492397840.0, "created_utc": 1492369040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcjipz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BlueDeadBear32", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "are you looking for a service dog or just a pet? there are many orginizations that will train service dogs for people with autism, but you will have to apply and get permission from your mom first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;are you looking for a service dog or just a pet? there are many orginizations that will train service dogs for people with autism, but you will have to apply and get permission from your mom first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcjipz", "score_hidden": false, "stickied": false, "created": 1492403981.0, "created_utc": 1492375181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgct92j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Twzl", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "&gt; I love pugs and I want to get a rescue dog and I will walk it everyday.\n\nOdds are you're not going to find a Pug to rescue. Do you only want a Pug and do you only want a dog that is rescued?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I love pugs and I want to get a rescue dog and I will walk it everyday.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Odds are you&amp;#39;re not going to find a Pug to rescue. Do you only want a Pug and do you only want a dog that is rescued?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgct92j", "score_hidden": false, "stickied": false, "created": 1492417046.0, "created_utc": 1492388246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgd1fyb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Krispyz", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Have you thought about contacting a service dog organization? I think you may be leaping to a pretty strong conclusion from a single interaction. Regardless, if you're thinking a dog may be able to help you with your conditions, the people to talk to would be those who train dogs for that exact situation. Even if you're not looking for a specifically trained dog, they may be able to assess your situation and give you a better idea of whether a dog might help you and, if so, prepare you for the reality of owning a dog. Going through this channel may also help convince your mom, if you have expert opinion backing you up (if that's the case).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you thought about contacting a service dog organization? I think you may be leaping to a pretty strong conclusion from a single interaction. Regardless, if you&amp;#39;re thinking a dog may be able to help you with your conditions, the people to talk to would be those who train dogs for that exact situation. Even if you&amp;#39;re not looking for a specifically trained dog, they may be able to assess your situation and give you a better idea of whether a dog might help you and, if so, prepare you for the reality of owning a dog. Going through this channel may also help convince your mom, if you have expert opinion backing you up (if that&amp;#39;s the case).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgd1fyb", "score_hidden": false, "stickied": false, "created": 1492428214.0, "created_utc": 1492399414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65prmw", "likes": null, "replies": "", "user_reports": [], "id": "dgcvlia", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "descendant4711", "parent_id": "t3_65prmw", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Dogs are very messy animals. They leave hair everywhere, they pee and poop on the carpet sometimes, they throw up on your bed and in your car, they find stinky garbage and roll around in it, they eat their poop and then try to lick your face, they stink when they get wet. If you're up for handling all that, go for it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dogs are very messy animals. They leave hair everywhere, they pee and poop on the carpet sometimes, they throw up on your bed and in your car, they find stinky garbage and roll around in it, they eat their poop and then try to lick your face, they stink when they get wet. If you&amp;#39;re up for handling all that, go for it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgcvlia", "score_hidden": false, "stickied": false, "created": 1492420162.0, "created_utc": 1492391362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]