[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dogs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m from India. &lt;/p&gt;\n\n&lt;p&gt;I owned a lab and a husky. \nFirst off it&amp;#39;s crazy that they breed huskies here. However I realised that much after I already had one . I was 17 then. My depression was off the charts. &lt;/p&gt;\n\n&lt;p&gt;As my dad predicted , the dogs really helped. \nIt was amazing .\nI raised both of them by myself . \nIt was one of the best times I&amp;#39;d had for a long long time. Ive always loved animals, especially dogs. &lt;/p&gt;\n\n&lt;p&gt;I used to train them , take them out for walks , and out to the beach once in a while , keep shaving off the huskies hair (due to the climate here) and vets and everything.&lt;/p&gt;\n\n&lt;p&gt;Just for the sake of context, I live with my dad . My mom passed away when I was 13.&lt;/p&gt;\n\n&lt;p&gt;Everything was going great. &lt;/p&gt;\n\n&lt;p&gt;Then my aunt (mothers sister) was going through a divorce. So she moved in with us for what at that time seemed an indefinite period of time. She had issues. Soon I realised she used to hit the dogs. It made me sick. \nAs an 18 year old that messed me up. &lt;/p&gt;\n\n&lt;p&gt;I told my dad , but I live in a collectivist culture where to keep up appearances selfish relatives are valued more than dogs that changed your life. &lt;/p&gt;\n\n&lt;p&gt;However I made a choice that I&amp;#39;d give up the dogs for adoption as the atmosphere was quite violent for them and they&amp;#39;d started having a fear response even when I pet them when they weren&amp;#39;t looking or expecting it. It really broke my heart and I knew I wouldn&amp;#39;t let that happen to them. &lt;/p&gt;\n\n&lt;p&gt;However again, a different set of relatives promised to take good care of them by giving them an entire terrace at their company. So my dad almost forced me to hand over my dogs to him instead of just putting it up for adoption. &lt;/p&gt;\n\n&lt;p&gt;So ever since they&amp;#39;ve been there. On a terrace . Without a family. They get food and they have someone that takes them out for walks etc , but it&amp;#39;s just a worker that does it. Medically they are okay. Food and safety wise they are alright , I order their food online and have it sent . &lt;/p&gt;\n\n&lt;p&gt;However they are in another city . And every time I go there they really get clingy and want to follow me back home. It&amp;#39;s been 3years since they&amp;#39;ve been there now. &lt;/p&gt;\n\n&lt;p&gt;I feel horrible . \nLike I&amp;#39;ve let them down . Every time I think of them I can&amp;#39;t function for a good few hours.&lt;/p&gt;\n\n&lt;p&gt;Do dogs remember past owners and few depressed ? \nIs there anything I can do for them ? \nThey&amp;#39;re in a community where many people who work in the company come and pet them once In a While but there is no one who personally looks after them as such , like it&amp;#39;s their own dog I mean . &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi. \n\nI'm from India. \n\nI owned a lab and a husky. \nFirst off it's crazy that they breed huskies here. However I realised that much after I already had one . I was 17 then. My depression was off the charts. \n\nAs my dad predicted , the dogs really helped. \nIt was amazing .\nI raised both of them by myself . \nIt was one of the best times I'd had for a long long time. Ive always loved animals, especially dogs. \n\nI used to train them , take them out for walks , and out to the beach once in a while , keep shaving off the huskies hair (due to the climate here) and vets and everything.\n\nJust for the sake of context, I live with my dad . My mom passed away when I was 13.\n\nEverything was going great. \n\nThen my aunt (mothers sister) was going through a divorce. So she moved in with us for what at that time seemed an indefinite period of time. She had issues. Soon I realised she used to hit the dogs. It made me sick. \nAs an 18 year old that messed me up. \n\nI told my dad , but I live in a collectivist culture where to keep up appearances selfish relatives are valued more than dogs that changed your life. \n\nHowever I made a choice that I'd give up the dogs for adoption as the atmosphere was quite violent for them and they'd started having a fear response even when I pet them when they weren't looking or expecting it. It really broke my heart and I knew I wouldn't let that happen to them. \n\nHowever again, a different set of relatives promised to take good care of them by giving them an entire terrace at their company. So my dad almost forced me to hand over my dogs to him instead of just putting it up for adoption. \n\nSo ever since they've been there. On a terrace . Without a family. They get food and they have someone that takes them out for walks etc , but it's just a worker that does it. Medically they are okay. Food and safety wise they are alright , I order their food online and have it sent . \n\nHowever they are in another city . And every time I go there they really get clingy and want to follow me back home. It's been 3years since they've been there now. \n\nI feel horrible . \nLike I've let them down . Every time I think of them I can't function for a good few hours.\n\nDo dogs remember past owners and few depressed ? \nIs there anything I can do for them ? \nThey're in a community where many people who work in the company come and pet them once In a While but there is no one who personally looks after them as such , like it's their own dog I mean . ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Vent", "id": "65ubf4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "fullmetal1405", "saved": false, "mod_reports": [], "name": "t3_65ubf4", "subreddit_name_prefixed": "r/dogs", "approved_by": null, "over_18": false, "domain": "self.dogs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhhk", "edited": 1492417949.0, "link_flair_css_class": "vent", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dogs/comments/65ubf4/i_feel_extremely_guilty_venthelp/", "num_reports": null, "locked": false, "stickied": false, "created": 1492445211.0, "url": "https://www.reddit.com/r/dogs/comments/65ubf4/i_feel_extremely_guilty_venthelp/", "author_flair_text": null, "quarantine": false, "title": "I feel extremely guilty. [Vent][Help]", "created_utc": 1492416411.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65ubf4", "likes": null, "replies": "", "user_reports": [], "id": "dgdczkv", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "blackwaterflo", "parent_id": "t3_65ubf4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "Dogs do remember previous owners and they can suffer from depression but it doesn't sound like they are.\n\nDogs are not like us. They don't spend their days pining over what used to be. One of the best lessons we can learn from a dog is how to live and enjoy life as it is, in the moment. \n\nThey are safe and well cared for. There are many dogs in this world who are not as fortunate as they are, sadly. They have you to come visit. They have interaction with people, even if they are employees. I know you feel bad but try not to beat yourself up. It was out of your hands and they are doing ok. They are away from your aunt. Perhaps one day, you can get them back. We never know what life is going to bring us.\n\nHang in there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dogs do remember previous owners and they can suffer from depression but it doesn&amp;#39;t sound like they are.&lt;/p&gt;\n\n&lt;p&gt;Dogs are not like us. They don&amp;#39;t spend their days pining over what used to be. One of the best lessons we can learn from a dog is how to live and enjoy life as it is, in the moment. &lt;/p&gt;\n\n&lt;p&gt;They are safe and well cared for. There are many dogs in this world who are not as fortunate as they are, sadly. They have you to come visit. They have interaction with people, even if they are employees. I know you feel bad but try not to beat yourself up. It was out of your hands and they are doing ok. They are away from your aunt. Perhaps one day, you can get them back. We never know what life is going to bring us.&lt;/p&gt;\n\n&lt;p&gt;Hang in there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgdczkv", "score_hidden": false, "stickied": false, "created": 1492456033.0, "created_utc": 1492427233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65ubf4", "likes": null, "replies": "", "user_reports": [], "id": "dgdfofs", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "binaryvisions", "parent_id": "t3_65ubf4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "You did the right thing for your friends. That's all anyone can ask for. That's all your dogs would ask for.\n\nWe can't always foresee changes in life, and even less of the time can prevent it from happening. The only measure is, when presented with a challenge, did you do everything in your power to make the right choice? And you did: you removed the dogs from a hostile situation, even at the cost of losing your furry friends and their assistance with your depression.\n\nThat's admirable. Feel proud that you could make the hard choice.\n\nDogs are remarkably adaptable. They're okay. I'm sure they still love you when you visit, but they live in the moment and they'll go back to sniffing the air and basking in the sunshine and enjoying their walks.\n\nIt's hard to alleviate guilt. But you can start by knowing that you really, truly did the right thing and that your dogs are happy if they're having their needs met.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You did the right thing for your friends. That&amp;#39;s all anyone can ask for. That&amp;#39;s all your dogs would ask for.&lt;/p&gt;\n\n&lt;p&gt;We can&amp;#39;t always foresee changes in life, and even less of the time can prevent it from happening. The only measure is, when presented with a challenge, did you do everything in your power to make the right choice? And you did: you removed the dogs from a hostile situation, even at the cost of losing your furry friends and their assistance with your depression.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s admirable. Feel proud that you could make the hard choice.&lt;/p&gt;\n\n&lt;p&gt;Dogs are remarkably adaptable. They&amp;#39;re okay. I&amp;#39;m sure they still love you when you visit, but they live in the moment and they&amp;#39;ll go back to sniffing the air and basking in the sunshine and enjoying their walks.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard to alleviate guilt. But you can start by knowing that you really, truly did the right thing and that your dogs are happy if they&amp;#39;re having their needs met.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgdfofs", "score_hidden": false, "stickied": false, "created": 1492462123.0, "created_utc": 1492433323.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhk", "removal_reason": null, "link_id": "t3_65ubf4", "likes": null, "replies": "", "user_reports": [], "id": "dgdnn4i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ennuiwolf", "parent_id": "t3_65ubf4", "subreddit_name_prefixed": "r/dogs", "controversiality": 0, "body": "This brings back memories of a black lab I knew when I lived in Pune (I live in Mumbai now, and I have a cat). He was pretty young and active so he'd scare the other kids, but I wasn't too scared by him, so we got close quickly. \n\nI was too young, but I did know that that dog lived in a balcony of the flat and wasn't allowed inside the house except when it rained. While I was too young to say anything, I did know that was wrong. \n\nAnother lab I know happens to be my neighbour. My family and I are close enough to her that she strolls into our house like she owns the place. Her problem is that she's ended up in a family where literally only one person, an old grandmother, takes care of her. The entire responsibility of the animal was shifted to someone in the evening of her life. \n\nI sometimes feel like Indians shouldn't have dogs, since most of them don't even know how to treat and respect those creatures. A tenant in my society was kicked out because her German Shepherd was aggressive, and massive, and she couldn't even take it to a trainer. \n\nI really appreciate what the dogs did for you, and what you're doing for the dogs (especially shaving the husky's fur. That's the first time I'm hearing someone doing that. Most people like the floor, me included, but they're not meant for Indian climate.) There are organizations that you can approach if you're scared for your dogs, NGOs like the SPCA or other animal welfare organizations might be willing to step in and help find your animals a better home. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This brings back memories of a black lab I knew when I lived in Pune (I live in Mumbai now, and I have a cat). He was pretty young and active so he&amp;#39;d scare the other kids, but I wasn&amp;#39;t too scared by him, so we got close quickly. &lt;/p&gt;\n\n&lt;p&gt;I was too young, but I did know that that dog lived in a balcony of the flat and wasn&amp;#39;t allowed inside the house except when it rained. While I was too young to say anything, I did know that was wrong. &lt;/p&gt;\n\n&lt;p&gt;Another lab I know happens to be my neighbour. My family and I are close enough to her that she strolls into our house like she owns the place. Her problem is that she&amp;#39;s ended up in a family where literally only one person, an old grandmother, takes care of her. The entire responsibility of the animal was shifted to someone in the evening of her life. &lt;/p&gt;\n\n&lt;p&gt;I sometimes feel like Indians shouldn&amp;#39;t have dogs, since most of them don&amp;#39;t even know how to treat and respect those creatures. A tenant in my society was kicked out because her German Shepherd was aggressive, and massive, and she couldn&amp;#39;t even take it to a trainer. &lt;/p&gt;\n\n&lt;p&gt;I really appreciate what the dogs did for you, and what you&amp;#39;re doing for the dogs (especially shaving the husky&amp;#39;s fur. That&amp;#39;s the first time I&amp;#39;m hearing someone doing that. Most people like the floor, me included, but they&amp;#39;re not meant for Indian climate.) There are organizations that you can approach if you&amp;#39;re scared for your dogs, NGOs like the SPCA or other animal welfare organizations might be willing to step in and help find your animals a better home. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dogs", "name": "t1_dgdnn4i", "score_hidden": false, "stickied": false, "created": 1492473136.0, "created_utc": 1492444336.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]