[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was younger (around 6-8) I recall getting into an argument with my parents. I do not recall exactly what the argument was about, I can only tell you I was very angry by the end of it. It would be the first time I ever said a curse word to my parents. I just remember yelling it at them with all my little heart and soul because it felt like the only way to gain one on them. I slammed the door, truly in fear if i recall correctly but also to get away. I was now in the adjoining room (my younger sister&amp;#39;s bedroom).. What I remember next will always standout to me because I remember telling myself &amp;quot;you can never forget this&amp;quot;. As I slammed the door, I just remember the craziest chemistry feeling in my body and then floating (I honestly couldnt tell you if I saw myself standing there) over the bed and toy chest to the corner of her bedroom. I was so taken back after realizing what I was experiencing that I wasn&amp;#39;t upset anymore. Maybe something was putting me in check.. It could be contributed in my opinion to many things. But that is my experience. I am curious to know if anyone else has experienced anything similar.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "When I was younger (around 6-8) I recall getting into an argument with my parents. I do not recall exactly what the argument was about, I can only tell you I was very angry by the end of it. It would be the first time I ever said a curse word to my parents. I just remember yelling it at them with all my little heart and soul because it felt like the only way to gain one on them. I slammed the door, truly in fear if i recall correctly but also to get away. I was now in the adjoining room (my younger sister's bedroom).. What I remember next will always standout to me because I remember telling myself \"you can never forget this\". As I slammed the door, I just remember the craziest chemistry feeling in my body and then floating (I honestly couldnt tell you if I saw myself standing there) over the bed and toy chest to the corner of her bedroom. I was so taken back after realizing what I was experiencing that I wasn't upset anymore. Maybe something was putting me in check.. It could be contributed in my opinion to many things. But that is my experience. I am curious to know if anyone else has experienced anything similar.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ovox", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "sofinsicc", "saved": false, "mod_reports": [], "name": "t3_64ovox", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64ovox/floatingout_of_body_experience/", "num_reports": null, "locked": false, "stickied": false, "created": 1491915893.0, "url": "https://www.reddit.com/r/Paranormal/comments/64ovox/floatingout_of_body_experience/", "author_flair_text": null, "quarantine": false, "title": "Floating/Out of body experience", "created_utc": 1491887093.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]