[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I had a lot of paranormal experiences at my old house I lived in for 17years. I am 20 now and live in the country in an older home with secret doors and stuff but have had no weird experiences what so ever, but in my first home growing up it was brand new and we were the first owners. It would make more sense vice versa, but whatever.&lt;/p&gt;\n\n&lt;p&gt;Anyway, whatever was in our house (multiple things?) Seemed to only target my brothers when they were young, but me my entire life there. My oldest brother is now a scientist and the other is a monster of a man(bodybuilder) and I wonder if that may be part of the reason things stopped happening to them, while I was a just a tiny girl.&lt;/p&gt;\n\n&lt;p&gt;After reading other posts, one experience my brother had makes me think it was a skinwalker? I&amp;#39;m not sure. Anyway, he was playing on one side of the room behind the bed (can&amp;#39;t see other side of bed on far side of the room) and he heard giggling, similar to how I sounded. He called me &amp;quot;Ren?&amp;quot; More giggles. This went on a few more times back and forth.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure why, he didn&amp;#39;t follow the noise, but instead walked out into the living room, where me and my other brother were curled up under each of my dad&amp;#39;s arms sleeping on the floor.(our nightly routine was watching Discovery channel from the floor right under the tv) no one was in the room, or even awake that could have made that noise.&lt;/p&gt;\n\n&lt;p&gt;My other monster of a brother, to this day,is terrified of the dark. Our entire childhood he&amp;#39;d take me if he had to go anywhere dark or scary, I was the fearless one of the group, or I just acted like it because I had to be tough with two older Bros. He never talks much about paranormal, but thinking back ,something may have caused him to be that way.&lt;/p&gt;\n\n&lt;p&gt;Okay, now to the good stuff, my stories. Lol. I&amp;#39;ll start with the beginning, when I was little I would play in the basement, so my dad finished the room under the stairs for me to make into my own play room, separate from my Bros. My mom made it all cozy and even put my books and toys on shelves and even let me draw flowers on the walls.&lt;/p&gt;\n\n&lt;p&gt;As soon as setting up the room was done and I was left alone down there to play, I instantly felt what I now know is the feeling of dread. My body froze and the room was so still it felt like life was in mute. I saw a white cloudy ball come from around the corner behind the stairs and it stood still in the air for a moment, then came at me.&lt;/p&gt;\n\n&lt;p&gt;I ran out and slammed the door, jumped on the couch and his under a blanket. My dad was mad I was slamming doors and found me crying. For the next 17 years, we never used that room for anything more than storage. &lt;/p&gt;\n\n&lt;p&gt;My brothers&amp;#39; room used to be connected to mine through a jack-and-jill bathroom. As we got older, the oldest went off to college and the other moved to the room down the hall.&lt;/p&gt;\n\n&lt;p&gt;There was no one in the room connected to mine, but I always kept their side of the bathroom door locked. When they weren&amp;#39;t in it anymore that room just became , uncomfortable? My friend once walked in there, she is more sensitive to stuff I guess, and instantly felt something. &lt;/p&gt;\n\n&lt;p&gt;The next time she came over, her mom gave her these white leaves to burn in our house and she told me to sprinkle salt around that room. She also tried taking pictures in that room, and like  10% of each picture was white dots. I don&amp;#39;t know about orbs, maybe she just had a dusty camera. &lt;/p&gt;\n\n&lt;p&gt;The scariest experience with that room was later in our time there, I was 15, and I was in my bathroom on the throne.(peeing) My side of the bathroom door is open straight in front of me, and the boys side, right to the left of the toilet, is locked as always. It was winter, so windows were closed, and my parents were very frugal so our heat only turned on if it went below 65°, so there was most likely no air flow in the house.&lt;/p&gt;\n\n&lt;p&gt;I was just chillin there on the pot and all of a sudden I hear jingling. I look to my left to the locked door. It jingles again, I SEE the door handle moving as if someone is trying to turn it on the other side. I&amp;#39;m frozen. Then again, I screamed &amp;quot;STOP!&amp;quot; it stops almost like at mid-jingle. I got up and ran downstairs. My whole family was waiting for me to eat dinner, no one was upstairs, not even our dogs.&lt;/p&gt;\n\n&lt;p&gt;The last experience I&amp;#39;ll tell you about was actually one of the last before my family moved. I was home alone (of course) and even our dogs were outside. It was a beautiful summer day, and they&amp;#39;re really obedient and stayed in our yard without a fence. I was listening to music on my phone with headphones in, laying on a couch in our closed off den by the front door.&lt;/p&gt;\n\n&lt;p&gt;I had not moved in a while, just laying very still, relaxing. I heard something behind the wall, which would be my parents bathroom. The sink turned on. It was one of those faucets you had to physically turn the handles out to turn on,( same as our kitchen sink. Important later) I pull and earphone out, and turn to put my feet on the ground.&lt;/p&gt;\n\n&lt;p&gt;As soon as my feet made a noise, the sink turned off abruptly. I was a little weary, but I layed back down on the couch and put my headphones back in. About 20minutes later, I hear the kitchen sink turn on, full force stream, same as my parents sink. I shot up, and again, the sink turned off abruptly. I ran outside and took my dogs with me to my neighbors.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had many experiences similar when I was home alone, that whatever happened stopped as soon as I made a noise. My neighbor tried to explain it as just movement of water in the pipes, but there&amp;#39;s an obvious difference of sound from that and a faucet on full force stream.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had nightmares like crazy in that house, and tried many remedies over the years and in the end, I found that the best thing was to say &amp;quot;leave me alone&amp;quot; when I felt uneasy in that house. I even had a nightmare the few nights before the move that it was going to find me, whatever that meant. &lt;/p&gt;\n\n&lt;p&gt;My parents new house is wonderful, and actually looks more like a place you&amp;#39;d expect activity, but so far, nothing. So far nothing has scared me or bothered me like my childhood home, so maybe that last dream something was trying to mess with me one last time before the move!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I had a lot of paranormal experiences at my old house I lived in for 17years. I am 20 now and live in the country in an older home with secret doors and stuff but have had no weird experiences what so ever, but in my first home growing up it was brand new and we were the first owners. It would make more sense vice versa, but whatever.\n\nAnyway, whatever was in our house (multiple things?) Seemed to only target my brothers when they were young, but me my entire life there. My oldest brother is now a scientist and the other is a monster of a man(bodybuilder) and I wonder if that may be part of the reason things stopped happening to them, while I was a just a tiny girl.\n\nAfter reading other posts, one experience my brother had makes me think it was a skinwalker? I'm not sure. Anyway, he was playing on one side of the room behind the bed (can't see other side of bed on far side of the room) and he heard giggling, similar to how I sounded. He called me \"Ren?\" More giggles. This went on a few more times back and forth.\n\nI'm not sure why, he didn't follow the noise, but instead walked out into the living room, where me and my other brother were curled up under each of my dad's arms sleeping on the floor.(our nightly routine was watching Discovery channel from the floor right under the tv) no one was in the room, or even awake that could have made that noise.\n\nMy other monster of a brother, to this day,is terrified of the dark. Our entire childhood he'd take me if he had to go anywhere dark or scary, I was the fearless one of the group, or I just acted like it because I had to be tough with two older Bros. He never talks much about paranormal, but thinking back ,something may have caused him to be that way.\n\nOkay, now to the good stuff, my stories. Lol. I'll start with the beginning, when I was little I would play in the basement, so my dad finished the room under the stairs for me to make into my own play room, separate from my Bros. My mom made it all cozy and even put my books and toys on shelves and even let me draw flowers on the walls.\n\nAs soon as setting up the room was done and I was left alone down there to play, I instantly felt what I now know is the feeling of dread. My body froze and the room was so still it felt like life was in mute. I saw a white cloudy ball come from around the corner behind the stairs and it stood still in the air for a moment, then came at me.\n\nI ran out and slammed the door, jumped on the couch and his under a blanket. My dad was mad I was slamming doors and found me crying. For the next 17 years, we never used that room for anything more than storage. \n\nMy brothers' room used to be connected to mine through a jack-and-jill bathroom. As we got older, the oldest went off to college and the other moved to the room down the hall.\n\n There was no one in the room connected to mine, but I always kept their side of the bathroom door locked. When they weren't in it anymore that room just became , uncomfortable? My friend once walked in there, she is more sensitive to stuff I guess, and instantly felt something. \n\nThe next time she came over, her mom gave her these white leaves to burn in our house and she told me to sprinkle salt around that room. She also tried taking pictures in that room, and like  10% of each picture was white dots. I don't know about orbs, maybe she just had a dusty camera. \n\nThe scariest experience with that room was later in our time there, I was 15, and I was in my bathroom on the throne.(peeing) My side of the bathroom door is open straight in front of me, and the boys side, right to the left of the toilet, is locked as always. It was winter, so windows were closed, and my parents were very frugal so our heat only turned on if it went below 65°, so there was most likely no air flow in the house.\n\nI was just chillin there on the pot and all of a sudden I hear jingling. I look to my left to the locked door. It jingles again, I SEE the door handle moving as if someone is trying to turn it on the other side. I'm frozen. Then again, I screamed \"STOP!\" it stops almost like at mid-jingle. I got up and ran downstairs. My whole family was waiting for me to eat dinner, no one was upstairs, not even our dogs.\n\nThe last experience I'll tell you about was actually one of the last before my family moved. I was home alone (of course) and even our dogs were outside. It was a beautiful summer day, and they're really obedient and stayed in our yard without a fence. I was listening to music on my phone with headphones in, laying on a couch in our closed off den by the front door.\n\nI had not moved in a while, just laying very still, relaxing. I heard something behind the wall, which would be my parents bathroom. The sink turned on. It was one of those faucets you had to physically turn the handles out to turn on,( same as our kitchen sink. Important later) I pull and earphone out, and turn to put my feet on the ground.\n\nAs soon as my feet made a noise, the sink turned off abruptly. I was a little weary, but I layed back down on the couch and put my headphones back in. About 20minutes later, I hear the kitchen sink turn on, full force stream, same as my parents sink. I shot up, and again, the sink turned off abruptly. I ran outside and took my dogs with me to my neighbors.\n\nI've had many experiences similar when I was home alone, that whatever happened stopped as soon as I made a noise. My neighbor tried to explain it as just movement of water in the pipes, but there's an obvious difference of sound from that and a faucet on full force stream.\n\nI've had nightmares like crazy in that house, and tried many remedies over the years and in the end, I found that the best thing was to say \"leave me alone\" when I felt uneasy in that house. I even had a nightmare the few nights before the move that it was going to find me, whatever that meant. \n\nMy parents new house is wonderful, and actually looks more like a place you'd expect activity, but so far, nothing. So far nothing has scared me or bothered me like my childhood home, so maybe that last dream something was trying to mess with me one last time before the move!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ovpr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "remmysroad", "saved": false, "mod_reports": [], "name": "t3_64ovpr", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64ovpr/jingling_door/", "num_reports": null, "locked": false, "stickied": false, "created": 1491915903.0, "url": "https://www.reddit.com/r/Paranormal/comments/64ovpr/jingling_door/", "author_flair_text": null, "quarantine": false, "title": "Jingling door", "created_utc": 1491887103.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ovpr", "likes": null, "replies": "", "user_reports": [], "id": "dg526rz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eyetechnick", "parent_id": "t3_64ovpr", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I'm so sorry you went through all that but it was a really cool story!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you went through all that but it was a really cool story!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg526rz", "score_hidden": false, "stickied": false, "created": 1491979636.0, "created_utc": 1491950836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ovpr", "likes": null, "replies": "", "user_reports": [], "id": "dg54sps", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DJysyed", "parent_id": "t3_64ovpr", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I'm glad to hear that you're doing well now. It was just a troublesome spirit that enjoys playing pranks. Have an exorcist just go in and wipe the house clean.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad to hear that you&amp;#39;re doing well now. It was just a troublesome spirit that enjoys playing pranks. Have an exorcist just go in and wipe the house clean.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg54sps", "score_hidden": false, "stickied": false, "created": 1491983145.0, "created_utc": 1491954345.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]