[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ok so this is happening \nI jusy recently moved in with a friend who says he used to do ocultism stuff. He used to tell us a lot of anecdotes which I really never believed, but they were a lot of fun.&lt;/p&gt;\n\n&lt;p&gt;The house we live in is a big one, at least for two people. There&amp;#39;s 2 floors. On the upper one there&amp;#39;s 3 bedrooms, 2 bathrooms and a sort of living room.The master room is in the left side of the floor. That&amp;#39;s the one my friend&amp;#39;s staying at. I got one of the two rooms on the right. They&amp;#39;re next to each other.&lt;/p&gt;\n\n&lt;p&gt;The place is really neat, specially considering it&amp;#39;s free. My roomie got the house from his dad. Since he didn&amp;#39;t want to live alone he invited me to live with him.&lt;/p&gt;\n\n&lt;p&gt;When we got the house there was a lot of shit left around by my friend&amp;#39;s dad. We decided to throw everything in the vacant room.\nEvery now and then I&amp;#39;ll find some stuff laying around that doesn&amp;#39;t belong anywhere, so I put it in the room next door.&lt;/p&gt;\n\n&lt;p&gt;Last time I did that things got a little... Odd. I went in to the room at around 2:00 a.m. I didn&amp;#39;t turned on the lights, it&amp;#39;s hard to miss one of the many boxes there. Suddenly, I got this really eerie feel. Like something was there. It really didn&amp;#39;t feel like something was watching me or threatening me. More like it was just... disturbed by my presence. I got out of there quickly but didn&amp;#39;t mind it much. I shrugged it off.&lt;/p&gt;\n\n&lt;p&gt;I told my friend the next day and he didn&amp;#39;t think much of it. Before leaving the house I did something I&amp;#39;m not sure I should&amp;#39;ve. I got this odd habit of saying goodbye to my room. I went upstairs and said &amp;quot;Good bye old friend!&amp;quot;. When I was turning around I saw the room next door and felt.. Bad that I didn&amp;#39;t say goodbye to it so I said &amp;quot;Good bye, new friend!&amp;quot;. I&amp;#39;m not sure why O did that.&lt;/p&gt;\n\n&lt;p&gt;Fast forward a couple of days to Saturday and my roomie, a friend and me are drinking some cocktails (yes, we do guys night with cocktails) and smoking some weed. My roomie is downstairs making some tequila sunrise and my friend and I are listening to Rage against the machine on my room, door closed. &lt;/p&gt;\n\n&lt;p&gt;Suddenly my door opens with considerable force. It actually hit the wall slightly. My friend got really spooked. I was kinda sceptic to the whole thing. Couldn&amp;#39;t really explain what happened. We decided to go downstairs and told my roomie about it. He said was gonna do some sort of cleanse and we talked some more about it.&lt;/p&gt;\n\n&lt;p&gt;At the moment of writing, it&amp;#39;s Monday 1:00 a.m. And my door just opened again, but this time I was alone. It&amp;#39;s beginning to get spooky. &lt;/p&gt;\n\n&lt;p&gt;I always wanted something like this. Should I try to make contact? I wanna borrow a video recorder, maybe something will show up(?)&lt;/p&gt;\n\n&lt;p&gt;My friend is really serious about the cleanse tho. He wants to do it no later than Thursday. &lt;/p&gt;\n\n&lt;p&gt;What are your thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ok so this is happening \nI jusy recently moved in with a friend who says he used to do ocultism stuff. He used to tell us a lot of anecdotes which I really never believed, but they were a lot of fun.\n\nThe house we live in is a big one, at least for two people. There's 2 floors. On the upper one there's 3 bedrooms, 2 bathrooms and a sort of living room.The master room is in the left side of the floor. That's the one my friend's staying at. I got one of the two rooms on the right. They're next to each other.\n\nThe place is really neat, specially considering it's free. My roomie got the house from his dad. Since he didn't want to live alone he invited me to live with him.\n\nWhen we got the house there was a lot of shit left around by my friend's dad. We decided to throw everything in the vacant room.\nEvery now and then I'll find some stuff laying around that doesn't belong anywhere, so I put it in the room next door.\n\nLast time I did that things got a little... Odd. I went in to the room at around 2:00 a.m. I didn't turned on the lights, it's hard to miss one of the many boxes there. Suddenly, I got this really eerie feel. Like something was there. It really didn't feel like something was watching me or threatening me. More like it was just... disturbed by my presence. I got out of there quickly but didn't mind it much. I shrugged it off.\n\nI told my friend the next day and he didn't think much of it. Before leaving the house I did something I'm not sure I should've. I got this odd habit of saying goodbye to my room. I went upstairs and said \"Good bye old friend!\". When I was turning around I saw the room next door and felt.. Bad that I didn't say goodbye to it so I said \"Good bye, new friend!\". I'm not sure why O did that.\n\nFast forward a couple of days to Saturday and my roomie, a friend and me are drinking some cocktails (yes, we do guys night with cocktails) and smoking some weed. My roomie is downstairs making some tequila sunrise and my friend and I are listening to Rage against the machine on my room, door closed. \n\nSuddenly my door opens with considerable force. It actually hit the wall slightly. My friend got really spooked. I was kinda sceptic to the whole thing. Couldn't really explain what happened. We decided to go downstairs and told my roomie about it. He said was gonna do some sort of cleanse and we talked some more about it.\n\nAt the moment of writing, it's Monday 1:00 a.m. And my door just opened again, but this time I was alone. It's beginning to get spooky. \n\nI always wanted something like this. Should I try to make contact? I wanna borrow a video recorder, maybe something will show up(?)\n\nMy friend is really serious about the cleanse tho. He wants to do it no later than Thursday. \n\nWhat are your thoughts?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64p82z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "frood1", "saved": false, "mod_reports": [], "name": "t3_64p82z", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64p82z/theres_a_ghost_in_my_house/", "num_reports": null, "locked": false, "stickied": false, "created": 1491921295.0, "url": "https://www.reddit.com/r/Paranormal/comments/64p82z/theres_a_ghost_in_my_house/", "author_flair_text": null, "quarantine": false, "title": "There's a ghost in my house", "created_utc": 1491892495.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64p82z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64p82z", "likes": null, "replies": "", "user_reports": [], "id": "dg5cp57", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RainyDayHaze", "parent_id": "t1_dg4l4oc", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I have nothing paranormal going on in my home. Is burning sage to cleanse the energy still a bad idea or is it just not advised while dealing with the occult/ paranormal?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have nothing paranormal going on in my home. Is burning sage to cleanse the energy still a bad idea or is it just not advised while dealing with the occult/ paranormal?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5cp57", "score_hidden": false, "stickied": false, "created": 1491993630.0, "created_utc": 1491964830.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4l4oc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BarkWolfBacon", "parent_id": "t3_64p82z", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Chances are your friends occult activity opened a door and something is attached to him. Don't make contact with it or things may get worse. As far as cleanses go, don't burn sage, AT ALL. It is a spiritual battery that could charge this thing up, whatever it may be. If you want to document it for a professional cleanser, like a deliverance minister, there isn't any harm in that. But don't expect to come away feeling particularly safe. Engaging is a dangerous thing to do. So long as your friend still practices the occult or hasnt renounced the practices, this thing will stick to your home like glue. The other comment is right, a blessing on your home is going to be the most effective thing to do. It could also have been attached to some of his dad's stuff he left lying around. \n\nI'm begging you don't burn sage. Some teams I used to work with did that before they met me and came to me because they only made things worth with it. It has gained use in the occult, new-age crap, but I've seen it make some investigators' lives a living hell. \n\nRemember that you are dealing with a being, often a type of spiritual predator, that has more knowledge than you and is immune to your physical defenses. Tread carefully. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chances are your friends occult activity opened a door and something is attached to him. Don&amp;#39;t make contact with it or things may get worse. As far as cleanses go, don&amp;#39;t burn sage, AT ALL. It is a spiritual battery that could charge this thing up, whatever it may be. If you want to document it for a professional cleanser, like a deliverance minister, there isn&amp;#39;t any harm in that. But don&amp;#39;t expect to come away feeling particularly safe. Engaging is a dangerous thing to do. So long as your friend still practices the occult or hasnt renounced the practices, this thing will stick to your home like glue. The other comment is right, a blessing on your home is going to be the most effective thing to do. It could also have been attached to some of his dad&amp;#39;s stuff he left lying around. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m begging you don&amp;#39;t burn sage. Some teams I used to work with did that before they met me and came to me because they only made things worth with it. It has gained use in the occult, new-age crap, but I&amp;#39;ve seen it make some investigators&amp;#39; lives a living hell. &lt;/p&gt;\n\n&lt;p&gt;Remember that you are dealing with a being, often a type of spiritual predator, that has more knowledge than you and is immune to your physical defenses. Tread carefully. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4l4oc", "score_hidden": false, "stickied": false, "created": 1491960249.0, "created_utc": 1491931449.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64p82z", "likes": null, "replies": "", "user_reports": [], "id": "dg4ekzg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "So72surreal", "parent_id": "t3_64p82z", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Iv practiced occult and yes it open doors an let's evil in I'm having bible study's I never beleaved in god up till a few weeks ago .Iv started reading the bilble and prying I think you should cause it will be a demon your feeling it will only get worse cleansing will not work Iv cleansed my house things got worse that's my advice op", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Iv practiced occult and yes it open doors an let&amp;#39;s evil in I&amp;#39;m having bible study&amp;#39;s I never beleaved in god up till a few weeks ago .Iv started reading the bilble and prying I think you should cause it will be a demon your feeling it will only get worse cleansing will not work Iv cleansed my house things got worse that&amp;#39;s my advice op&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4ekzg", "score_hidden": false, "stickied": false, "created": 1491953066.0, "created_utc": 1491924266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]