[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live near Jamestown and the historic battlefields at Yorktown. It seems like there would be many chances for experiences but I haven&amp;#39;t heard of them. Does anyone live in Virginia and have an experience? Maybe near this location?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I live near Jamestown and the historic battlefields at Yorktown. It seems like there would be many chances for experiences but I haven't heard of them. Does anyone live in Virginia and have an experience? Maybe near this location?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qo5w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "Donvito757", "saved": false, "mod_reports": [], "name": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64qo5w/any_experiences_in_virginia/", "num_reports": null, "locked": false, "stickied": false, "created": 1491944541.0, "url": "https://www.reddit.com/r/Paranormal/comments/64qo5w/any_experiences_in_virginia/", "author_flair_text": null, "quarantine": false, "title": "Any experiences in Virginia?", "created_utc": 1491915741.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4a81o", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Chichi_lovesme", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "This is a copy/paste from a post I made in the past. \n\nMany people don't believe the numerous paranormal encounters I have experienced in my childhood home but they have shaped the person I am today. There is some background information you should know before I delve into my experiences. I lived with my mother, grandma and grandpa in a large two story house in Manassas Virginia. We were located a stones throw away from the Bull Run Battlefield. Literally I could step off of my front porch and in ten strides be in the trails. Now the Battle of First Manassas or the First Battle of Bull Run was basically fought in my backyard and the surrounding woods. The Stonewall Jackson memorial was about a half mile down the road from our home as well as the old brick school building repurposed as a wartime hospital for injured soldiers. As a kid I would go with my grandpa metal detecting. Over the years in our backyard alone we found numerous spent bullets from muskets, buttons from confederate/union uniforms and loads of Native American arrow heads and old pottery.                                             \n\nNow onto some of the creepy things my family, myself and a handful of our guests have witnessed/heard/felt. As a child I slept in my mother's bed until I was thirteen and the only reason I stopped was because we moved away from that house. This is a story that is kind of creepy but honestly it gives me almost a sense of a guardian angel or something of the sorts. I don't have any recollection of this but my mother just loves to retell this incident to me. Apparently I was about 4 years old and didn't sneak into my mother's room the night before. That morning she told me how proud she was that I slept in my own bed like a big girl. My response was \"The nice man came and tucked me in and told me not to be afraid because he was watching over me.\" She was a bit freaked out but it didn't seem sinister unlike some of the other events in our home and didn't push me for much info.                                   \n\nI also used to hear my name called around the house and barn. It was almost like someone calling from far away. I remember asking my grandma if she'd been calling for me but she had not. She also confided in me that she heard her name called sometimes as well. Over the years we all heard ourselves being called but just tried to dismiss it.                                     \n\nMy mom and I had the downstairs to ourselves and my grandparents lived upstairs. They would go on trips a lot for stamp shows leaving my mother and I the run of the house. Almost every time they were gone for a few nights weird things would start happening. We would hear the tv and radio turn on upstairs but once we went to check it out there wouldn't be anything on. We would also hear tons of footsteps going all through the upstairs as well as the toilets flushing. At night our dog would lay over our legs and continuously growl at the ceiling. It was so creepy seeing as she was a very sweet dog and hardly ever took to growling.\n\nMy mom and her three siblings had lived in the house as kids/teenagers and had tons of creepy stuff happen. My uncle was sleeping downstairs in bed and woke to a man standing at the end of his bed. He literally had to run past this \"man\", up the stairs and into his parents bedroom. He told my grandpa what he had seen. Grandpa grabbed an aluminum baseball bat and headed downstairs. Now the previous owners had a schizophrenic son so my grandpa assumed he was having an episode and made his way back to the house in a confused state. Once downstairs they checked all the rooms but to no avail. He then asked my uncle what the man looked like. His description was of a young man in a grey uniform with no hands or feet. His description closely resembled a confederate soldier. This was not the last time he was seen in the house. My grandpa used to be a HUGE skeptic and only believed in what could be explained by science and fact. Well he was reading the paper in bed one night only to look up from the paper and see the aforementioned man by the foot of the bed. He stood there for a moment and then slowly faded away. Well needless to say, this made my grandpa rethink a few things. He also saw him many years later when walking by the opened guest bedroom upstairs. The solider was just sort of hovering over the bed and disappeared. My grandpa is now a strong believer in spirits.                                             \n\nThis story, told to me by my aunt brings tears to my eyes every time I retell it or think about it. She was a young teenager and loved to take her horse out for night rides in the national park next to our house. Well she was in an open field surrounded by trees riding her horse in large circles when he began to freak out. She thought at first that maybe he spotted a bobcat or cougar but quickly dismissed that theory when an overwhelming sense of dread washed over her. It was then that she spotted it. A hulking black figure the branches of a tree between her and the trail home. She described it as being like a huge man but completely shrouded in blackness with a glare she could feel piercing through her. His presence was of pure evil. She decided to nope the fuck out of there and rode as quickly as possible past it. When she arrived in our front yard it was there waiting for her in the fruit trees on the property. My aunt had her horse race to the barn and she put him out to pasture bridle and all. She never saw the figure again but it still shakes her to the bone to even talk about it.\n\nNow growing up, my uncle was a bit of a hooligan and frequently snuck people in his bedroom window. One night he heard two men having a conversation outside of his bedroom. I should add that his room was on the lower floor of the house and there was gravel outside of the window covering the ground. As he listens to these men he hears footsteps in the gravel and someone drop keys. He decided to open the window and tell whichever of his friends were out there to get inside and quiet down. Well when he looked out there was no one there. He thought someone was messing with him and told them to basically fuck off or show themselves. He heard nothing in response and figures it was one of his friends being a dick. He eventually went back to bed only to hear the conversation start up again. At this point he started to feel freaked. He got a gun and went outside only to find nothing. Well I guess he thought it was over and life moved on. Over time though, every year around fall I think this same event would take place. The conversation, the footsteps in gravel and the keys dropping. He apparently just got used to it somehow! Once I was born my uncle had already moved out and low and behold that became my room! I never heard the keys but on multiple occasions I did hear footsteps in the gravel and both my mom and I heard a conversation on the downstairs porch. It was a man and a woman this time. We figured it was my grandparents outside enjoying the nice night. That morning when we asked them about it they were insistent that at the time we though we herd them, they were sleeping in bed. We were freaked out! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a copy/paste from a post I made in the past. &lt;/p&gt;\n\n&lt;p&gt;Many people don&amp;#39;t believe the numerous paranormal encounters I have experienced in my childhood home but they have shaped the person I am today. There is some background information you should know before I delve into my experiences. I lived with my mother, grandma and grandpa in a large two story house in Manassas Virginia. We were located a stones throw away from the Bull Run Battlefield. Literally I could step off of my front porch and in ten strides be in the trails. Now the Battle of First Manassas or the First Battle of Bull Run was basically fought in my backyard and the surrounding woods. The Stonewall Jackson memorial was about a half mile down the road from our home as well as the old brick school building repurposed as a wartime hospital for injured soldiers. As a kid I would go with my grandpa metal detecting. Over the years in our backyard alone we found numerous spent bullets from muskets, buttons from confederate/union uniforms and loads of Native American arrow heads and old pottery.                                             &lt;/p&gt;\n\n&lt;p&gt;Now onto some of the creepy things my family, myself and a handful of our guests have witnessed/heard/felt. As a child I slept in my mother&amp;#39;s bed until I was thirteen and the only reason I stopped was because we moved away from that house. This is a story that is kind of creepy but honestly it gives me almost a sense of a guardian angel or something of the sorts. I don&amp;#39;t have any recollection of this but my mother just loves to retell this incident to me. Apparently I was about 4 years old and didn&amp;#39;t sneak into my mother&amp;#39;s room the night before. That morning she told me how proud she was that I slept in my own bed like a big girl. My response was &amp;quot;The nice man came and tucked me in and told me not to be afraid because he was watching over me.&amp;quot; She was a bit freaked out but it didn&amp;#39;t seem sinister unlike some of the other events in our home and didn&amp;#39;t push me for much info.                                   &lt;/p&gt;\n\n&lt;p&gt;I also used to hear my name called around the house and barn. It was almost like someone calling from far away. I remember asking my grandma if she&amp;#39;d been calling for me but she had not. She also confided in me that she heard her name called sometimes as well. Over the years we all heard ourselves being called but just tried to dismiss it.                                     &lt;/p&gt;\n\n&lt;p&gt;My mom and I had the downstairs to ourselves and my grandparents lived upstairs. They would go on trips a lot for stamp shows leaving my mother and I the run of the house. Almost every time they were gone for a few nights weird things would start happening. We would hear the tv and radio turn on upstairs but once we went to check it out there wouldn&amp;#39;t be anything on. We would also hear tons of footsteps going all through the upstairs as well as the toilets flushing. At night our dog would lay over our legs and continuously growl at the ceiling. It was so creepy seeing as she was a very sweet dog and hardly ever took to growling.&lt;/p&gt;\n\n&lt;p&gt;My mom and her three siblings had lived in the house as kids/teenagers and had tons of creepy stuff happen. My uncle was sleeping downstairs in bed and woke to a man standing at the end of his bed. He literally had to run past this &amp;quot;man&amp;quot;, up the stairs and into his parents bedroom. He told my grandpa what he had seen. Grandpa grabbed an aluminum baseball bat and headed downstairs. Now the previous owners had a schizophrenic son so my grandpa assumed he was having an episode and made his way back to the house in a confused state. Once downstairs they checked all the rooms but to no avail. He then asked my uncle what the man looked like. His description was of a young man in a grey uniform with no hands or feet. His description closely resembled a confederate soldier. This was not the last time he was seen in the house. My grandpa used to be a HUGE skeptic and only believed in what could be explained by science and fact. Well he was reading the paper in bed one night only to look up from the paper and see the aforementioned man by the foot of the bed. He stood there for a moment and then slowly faded away. Well needless to say, this made my grandpa rethink a few things. He also saw him many years later when walking by the opened guest bedroom upstairs. The solider was just sort of hovering over the bed and disappeared. My grandpa is now a strong believer in spirits.                                             &lt;/p&gt;\n\n&lt;p&gt;This story, told to me by my aunt brings tears to my eyes every time I retell it or think about it. She was a young teenager and loved to take her horse out for night rides in the national park next to our house. Well she was in an open field surrounded by trees riding her horse in large circles when he began to freak out. She thought at first that maybe he spotted a bobcat or cougar but quickly dismissed that theory when an overwhelming sense of dread washed over her. It was then that she spotted it. A hulking black figure the branches of a tree between her and the trail home. She described it as being like a huge man but completely shrouded in blackness with a glare she could feel piercing through her. His presence was of pure evil. She decided to nope the fuck out of there and rode as quickly as possible past it. When she arrived in our front yard it was there waiting for her in the fruit trees on the property. My aunt had her horse race to the barn and she put him out to pasture bridle and all. She never saw the figure again but it still shakes her to the bone to even talk about it.&lt;/p&gt;\n\n&lt;p&gt;Now growing up, my uncle was a bit of a hooligan and frequently snuck people in his bedroom window. One night he heard two men having a conversation outside of his bedroom. I should add that his room was on the lower floor of the house and there was gravel outside of the window covering the ground. As he listens to these men he hears footsteps in the gravel and someone drop keys. He decided to open the window and tell whichever of his friends were out there to get inside and quiet down. Well when he looked out there was no one there. He thought someone was messing with him and told them to basically fuck off or show themselves. He heard nothing in response and figures it was one of his friends being a dick. He eventually went back to bed only to hear the conversation start up again. At this point he started to feel freaked. He got a gun and went outside only to find nothing. Well I guess he thought it was over and life moved on. Over time though, every year around fall I think this same event would take place. The conversation, the footsteps in gravel and the keys dropping. He apparently just got used to it somehow! Once I was born my uncle had already moved out and low and behold that became my room! I never heard the keys but on multiple occasions I did hear footsteps in the gravel and both my mom and I heard a conversation on the downstairs porch. It was a man and a woman this time. We figured it was my grandparents outside enjoying the nice night. That morning when we asked them about it they were insistent that at the time we though we herd them, they were sleeping in bed. We were freaked out! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4a81o", "score_hidden": false, "stickied": false, "created": 1491947905.0, "created_utc": 1491919105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4moj5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ArrVeeAyThrowWay", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I'm generally a skeptic, but can't resist passing on some Virginia ghostliness that I've had brushes with. My family has been in the Richmond area since the 1600s. I have lived in VA most of my life, the majority in Richmond.\n\nFirst, a story that has been told many times in my family - My mom, grandma and grandpa lived in a house in the 50s that had been built overtop the area formerly occupied by the notorious Libby Prison. My grandpa was a huge skeptic and pooh-poohed any notion of paranormal activity. He bought the house for a very low price because it apparently had a reputation. \n\nMy mom told me that the real estate agent showed them a closet in the house that had an old timey walking stick/cane in it. They were told never to touch or move it. They would hear the cane rattling around in the closet the whole time they lived there. Other things happened- my mom was a child, and the main thing that freaked her out was hearing marching, drums, soldiers etc going through the downstairs living room at night and of course when they went to look, no one was there.\n\nFast forward to the recent past- I lived literally right next to Hollywood Cemetary. We had a loose spot in the chain link fence surrounding the cemetery and were able to easily get in or out anytime, so much exploring was done. The creepiest thing I noticed was in the confederate soldiers monument. That's the big pyramid made of rocks that are fitted together. Sometimes even on a hot day there are cold spots around those rocks.\n\nThe weirdest thing that happened to me personally occurred while living near the cemetery. I was asleep in bed, and woke up around 2am for no reason. I looked up and there was a young man dressed as a soldier standing at the foot of my bed looking at me. He was clearly wearing a uniform but the clothes were really raggy looking. He had strips of cloth wrapped around his lower legs, he just looked really beat. I was totally speechless. I couldn't manage to say anything or yell, but as soon as he noticed me noticing him, he turned and ran towards my door. As he was running, he faded away. \n\nOnce I pulled myself together from seeing that, I was really frightened. I think I was too shocked to be scared while it was happening. I didn't turn the light off or sleep for the rest of the night.\n\nCurrently I live in a late 1800s house just north of downtown. We all routinely hear people talking when nobody else is home, or hear what sounds like people moving around. Our kids spent most of their childhoods here and there is a spot downstairs they avoided their whole lives. They've always just insisted it was \"creepy.\" This is not typical behavior for them. Our daughter is almost in her 20s and still won't go in that room alone at night. We also noticed there's a spot upstairs that the dog fixates on- she stares and circles around what looks like nothing.\n\nSo there's my little VA contribution.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m generally a skeptic, but can&amp;#39;t resist passing on some Virginia ghostliness that I&amp;#39;ve had brushes with. My family has been in the Richmond area since the 1600s. I have lived in VA most of my life, the majority in Richmond.&lt;/p&gt;\n\n&lt;p&gt;First, a story that has been told many times in my family - My mom, grandma and grandpa lived in a house in the 50s that had been built overtop the area formerly occupied by the notorious Libby Prison. My grandpa was a huge skeptic and pooh-poohed any notion of paranormal activity. He bought the house for a very low price because it apparently had a reputation. &lt;/p&gt;\n\n&lt;p&gt;My mom told me that the real estate agent showed them a closet in the house that had an old timey walking stick/cane in it. They were told never to touch or move it. They would hear the cane rattling around in the closet the whole time they lived there. Other things happened- my mom was a child, and the main thing that freaked her out was hearing marching, drums, soldiers etc going through the downstairs living room at night and of course when they went to look, no one was there.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to the recent past- I lived literally right next to Hollywood Cemetary. We had a loose spot in the chain link fence surrounding the cemetery and were able to easily get in or out anytime, so much exploring was done. The creepiest thing I noticed was in the confederate soldiers monument. That&amp;#39;s the big pyramid made of rocks that are fitted together. Sometimes even on a hot day there are cold spots around those rocks.&lt;/p&gt;\n\n&lt;p&gt;The weirdest thing that happened to me personally occurred while living near the cemetery. I was asleep in bed, and woke up around 2am for no reason. I looked up and there was a young man dressed as a soldier standing at the foot of my bed looking at me. He was clearly wearing a uniform but the clothes were really raggy looking. He had strips of cloth wrapped around his lower legs, he just looked really beat. I was totally speechless. I couldn&amp;#39;t manage to say anything or yell, but as soon as he noticed me noticing him, he turned and ran towards my door. As he was running, he faded away. &lt;/p&gt;\n\n&lt;p&gt;Once I pulled myself together from seeing that, I was really frightened. I think I was too shocked to be scared while it was happening. I didn&amp;#39;t turn the light off or sleep for the rest of the night.&lt;/p&gt;\n\n&lt;p&gt;Currently I live in a late 1800s house just north of downtown. We all routinely hear people talking when nobody else is home, or hear what sounds like people moving around. Our kids spent most of their childhoods here and there is a spot downstairs they avoided their whole lives. They&amp;#39;ve always just insisted it was &amp;quot;creepy.&amp;quot; This is not typical behavior for them. Our daughter is almost in her 20s and still won&amp;#39;t go in that room alone at night. We also noticed there&amp;#39;s a spot upstairs that the dog fixates on- she stares and circles around what looks like nothing.&lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s my little VA contribution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4moj5", "score_hidden": false, "stickied": false, "created": 1491961938.0, "created_utc": 1491933138.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4d3qx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "themissus_c", "parent_id": "t1_dg49mad", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I live in henrico but spend a lot of time at Yorktown beach during the summer and that cave always gives me the creeps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live in henrico but spend a lot of time at Yorktown beach during the summer and that cave always gives me the creeps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4d3qx", "score_hidden": false, "stickied": false, "created": 1491951397.0, "created_utc": 1491922597.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49mad", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "evanj88", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Head in to Colonial Williamsburg, they have plenty of stories in there. I've heard of many people having experiences in Historic Yorktown and the battlefields but have none myself. Lee Hall manor also.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Head in to Colonial Williamsburg, they have plenty of stories in there. I&amp;#39;ve heard of many people having experiences in Historic Yorktown and the battlefields but have none myself. Lee Hall manor also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg49mad", "score_hidden": false, "stickied": false, "created": 1491947113.0, "created_utc": 1491918313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4bxps", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CaptnCheerio", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I keep a running log on Reddit of the weird happenings at my house. It's a mid 1800s plantation home up in Fauquier County. Check my submission history to find it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I keep a running log on Reddit of the weird happenings at my house. It&amp;#39;s a mid 1800s plantation home up in Fauquier County. Check my submission history to find it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4bxps", "score_hidden": false, "stickied": false, "created": 1491950051.0, "created_utc": 1491921251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg5cw6q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "robrown511", "parent_id": "t1_dg5cqu5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I did a ghost tour in Savannah and they said most haunted go Gettysburg, Savannah, then Fredericksburg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did a ghost tour in Savannah and they said most haunted go Gettysburg, Savannah, then Fredericksburg&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5cw6q", "score_hidden": false, "stickied": false, "created": 1491993901.0, "created_utc": 1491965101.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5cqu5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "moviequote88", "parent_id": "t1_dg4c5nf", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Seriously? I've never heard that. My mom lives there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously? I&amp;#39;ve never heard that. My mom lives there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5cqu5", "score_hidden": false, "stickied": false, "created": 1491993695.0, "created_utc": 1491964895.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4c5nf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "robrown511", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Try Fredericksburg, I heard it is one if the most haunted cities in America", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try Fredericksburg, I heard it is one if the most haunted cities in America&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4c5nf", "score_hidden": false, "stickied": false, "created": 1491950308.0, "created_utc": 1491921508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4a8k6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nagatos", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I'm from Virginia as well, but further north than you (Alexandria).  We have lots of ghost stories in that area.  If you're ever in the area, check out Old Town, which is full of historical buildings.\n\n\nAs for where you are, I'd recommend going to Williamsburg.  Kind of a classic area, and if you can talk to students from William and Mary, you might be able to learn some more local urban legends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m from Virginia as well, but further north than you (Alexandria).  We have lots of ghost stories in that area.  If you&amp;#39;re ever in the area, check out Old Town, which is full of historical buildings.&lt;/p&gt;\n\n&lt;p&gt;As for where you are, I&amp;#39;d recommend going to Williamsburg.  Kind of a classic area, and if you can talk to students from William and Mary, you might be able to learn some more local urban legends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4a8k6", "score_hidden": false, "stickied": false, "created": 1491947923.0, "created_utc": 1491919123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4dpcl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kittysue804", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "There are a lot of good spots in Richmond, and a really interesting walking haunted tour. The laser quest in Richmond, has a \"blood spot\" in one of the party rooms, that they cant get rid of, tried painting over it sanding it down ect. The story goes that the building used to be used as a hospital during the civil war (no shortage of old buildings here) and that's where the spot came from. I always heard the place was haunted, I used to work at the other laser quest, and all the employees in the city location said so. There's also Hollywood cemetery, which has a ton of its own stories, BUT no one is allowed after dark. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of good spots in Richmond, and a really interesting walking haunted tour. The laser quest in Richmond, has a &amp;quot;blood spot&amp;quot; in one of the party rooms, that they cant get rid of, tried painting over it sanding it down ect. The story goes that the building used to be used as a hospital during the civil war (no shortage of old buildings here) and that&amp;#39;s where the spot came from. I always heard the place was haunted, I used to work at the other laser quest, and all the employees in the city location said so. There&amp;#39;s also Hollywood cemetery, which has a ton of its own stories, BUT no one is allowed after dark. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4dpcl", "score_hidden": false, "stickied": false, "created": 1491952086.0, "created_utc": 1491923286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4la53", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OldDemon", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I knew a guy who did war reenactments  from Yorktown. He said it wasn't uncommon at all for there to be weird things happening in some of the houses they used. Williamsburg had some interesting history in the supernatural, but the ghost tours won't do it justice, it's best to make your own tour, Black beards crew was hanged there. In southern Virginia its hard to find a town where there isn't some sort of a legend about haunted houses or bridges or what have you. There's a bridge they call \"Satans bridge\" also known as Berryhill Bridge. I go there often. It's always got something going on, whether it be paranormal, or some sort of cult. West VA is definitely a good place for it. Basically all I'm saying is you have to know where to look and who to talk to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I knew a guy who did war reenactments  from Yorktown. He said it wasn&amp;#39;t uncommon at all for there to be weird things happening in some of the houses they used. Williamsburg had some interesting history in the supernatural, but the ghost tours won&amp;#39;t do it justice, it&amp;#39;s best to make your own tour, Black beards crew was hanged there. In southern Virginia its hard to find a town where there isn&amp;#39;t some sort of a legend about haunted houses or bridges or what have you. There&amp;#39;s a bridge they call &amp;quot;Satans bridge&amp;quot; also known as Berryhill Bridge. I go there often. It&amp;#39;s always got something going on, whether it be paranormal, or some sort of cult. West VA is definitely a good place for it. Basically all I&amp;#39;m saying is you have to know where to look and who to talk to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4la53", "score_hidden": false, "stickied": false, "created": 1491960417.0, "created_utc": 1491931617.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg4n3z6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Donvito757", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "This is all really great! I'm so glad to know that there is even a small community in my state that has a passion or at least an interest in the paranormal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is all really great! I&amp;#39;m so glad to know that there is even a small community in my state that has a passion or at least an interest in the paranormal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4n3z6", "score_hidden": false, "stickied": false, "created": 1491962412.0, "created_utc": 1491933612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64qo5w", "likes": null, "replies": "", "user_reports": [], "id": "dg5hdgj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "simplejack66", "parent_id": "t3_64qo5w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Elbow Road in Va Bch...quite creepy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Elbow Road in Va Bch...quite creepy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5hdgj", "score_hidden": false, "stickied": false, "created": 1492000944.0, "created_utc": 1491972144.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]