[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m still not convinced, but here&amp;#39;s my story:&lt;/p&gt;\n\n&lt;p&gt;Saturday morning, I was woken up by my phone vibrating and the screen illuminating.  I&amp;#39;m a very deep sleeper and if someone tries to call me while I&amp;#39;m asleep, they need to call at least twice, in rapid succession, in order to wake me up enough to realize my phone is ringing.  Owing to the fact that my phone is on &amp;quot;Do Not Disturb&amp;quot; when I&amp;#39;m asleep, I immediately thought someone on my white list was calling me in the middle of the night, which could only mean there&amp;#39;s some sort of emergency.  &lt;/p&gt;\n\n&lt;p&gt;I picked up my phone and saw that, not only did I not have a missed call, but my phone was in fact in &amp;quot;Do Not Disturb&amp;quot; mode and there weren&amp;#39;t any recent notifications.  I looked at the time and it was 3:33.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t think much of it, other than maybe it was a faulty connection to power.  My phone vibrates twice and the screen illuminates briefly when it&amp;#39;s connected to power to let you know that it&amp;#39;s charging.  &lt;/p&gt;\n\n&lt;p&gt;I tried to go back to sleep, but I had an overwhelming feeling that I was being watched.  I propped up on my elbows to look at my bedroom door, thinking all the commotion had summoned my dog to this part of the house, but my door was closed that night.  I looked around the room, but I didn&amp;#39;t see anything out of the ordinary.  I laid back down and still couldn&amp;#39;t shake the feeling that I was being watched.  I, embarrassingly (because I&amp;#39;m in my 30s) pulled the covers over my head, and willed myself to go back to sleep.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t wake up again until 10:00, and I got up, showered, got dressed, and set out to run a few errands before coming back home to a day of nothing (TV and Chinese delivery).  &lt;/p&gt;\n\n&lt;p&gt;When I came home, my better half was still sleeping, so I turned on the TV to wait for her to wake up.  She doesn&amp;#39;t get to sleep in often so I figured I&amp;#39;d cut her a break.  She got up, got in the shower, and went to the bedroom to get dressed.  I got up and went to the bedroom to tell her about my experience in the wee hours of the morning.  &lt;/p&gt;\n\n&lt;p&gt;As I was recounting everything that had happened, I stopped mid-sentence and said, &amp;quot;You know what?  Today would&amp;#39;ve been my grandfather&amp;#39;s 90th birthday!&amp;quot;  I immediately got goosebumps.  My grandfather and I were very close - I spent most of my childhood growing up with my grandparents due to a somewhat turbulent childhood.  I was the first grandchild and was often considered the seventh child since they did a lot of the childrearing where I was concerned.  &lt;/p&gt;\n\n&lt;p&gt;Now whether or not it was a technical malfunction on my phone, or if 3:33 has some sort of significance, or if it was really my grandfather trying to say hi, I don&amp;#39;t know.  I don&amp;#39;t believe in coincidence, but just because I don&amp;#39;t believe in something doesn&amp;#39;t mean it doesn&amp;#39;t exist.&lt;/p&gt;\n\n&lt;p&gt;One last caveat: my three year old son had been complaining that his room is &amp;quot;too scary&amp;quot; most of last week.  Nothing had changed in his room and he&amp;#39;s never said anything about his room being even a tiny bit scary before.  My daughter used to talk in her room when she was around two and I asked her who she was talking to thinking she&amp;#39;d tell me she was talking to her bear or something, but to my surprise, she told me she was talking to &amp;quot;Abo&amp;quot; (pronounced &amp;quot;AH-boh&amp;quot;).  When she said that, about three years ago, we were living in a different house and we were downstairs when she told me that.  I asked her, &amp;quot;Can you see Abo right now?&amp;quot;  She said, &amp;quot;Yes.&amp;quot;  I asked, &amp;quot;Where?&amp;quot; Trying to not make a big deal out of it, and she pointed to a picture hanging on the wall of my grandfather (abuelo - &amp;quot;grandfather&amp;quot; in Spanish).  &lt;/p&gt;\n\n&lt;p&gt;So has my grandfather been ramping up the week before and my son is the only one who&amp;#39;s been able to see or sense him?  Or is this all just coincidence?  Or am I bending the facts to fit my narrative?  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm still not convinced, but here's my story:\n\nSaturday morning, I was woken up by my phone vibrating and the screen illuminating.  I'm a very deep sleeper and if someone tries to call me while I'm asleep, they need to call at least twice, in rapid succession, in order to wake me up enough to realize my phone is ringing.  Owing to the fact that my phone is on \"Do Not Disturb\" when I'm asleep, I immediately thought someone on my white list was calling me in the middle of the night, which could only mean there's some sort of emergency.  \n\nI picked up my phone and saw that, not only did I not have a missed call, but my phone was in fact in \"Do Not Disturb\" mode and there weren't any recent notifications.  I looked at the time and it was 3:33.\n\nI didn't think much of it, other than maybe it was a faulty connection to power.  My phone vibrates twice and the screen illuminates briefly when it's connected to power to let you know that it's charging.  \n\nI tried to go back to sleep, but I had an overwhelming feeling that I was being watched.  I propped up on my elbows to look at my bedroom door, thinking all the commotion had summoned my dog to this part of the house, but my door was closed that night.  I looked around the room, but I didn't see anything out of the ordinary.  I laid back down and still couldn't shake the feeling that I was being watched.  I, embarrassingly (because I'm in my 30s) pulled the covers over my head, and willed myself to go back to sleep.\n\nI didn't wake up again until 10:00, and I got up, showered, got dressed, and set out to run a few errands before coming back home to a day of nothing (TV and Chinese delivery).  \n\nWhen I came home, my better half was still sleeping, so I turned on the TV to wait for her to wake up.  She doesn't get to sleep in often so I figured I'd cut her a break.  She got up, got in the shower, and went to the bedroom to get dressed.  I got up and went to the bedroom to tell her about my experience in the wee hours of the morning.  \n\nAs I was recounting everything that had happened, I stopped mid-sentence and said, \"You know what?  Today would've been my grandfather's 90th birthday!\"  I immediately got goosebumps.  My grandfather and I were very close - I spent most of my childhood growing up with my grandparents due to a somewhat turbulent childhood.  I was the first grandchild and was often considered the seventh child since they did a lot of the childrearing where I was concerned.  \n\nNow whether or not it was a technical malfunction on my phone, or if 3:33 has some sort of significance, or if it was really my grandfather trying to say hi, I don't know.  I don't believe in coincidence, but just because I don't believe in something doesn't mean it doesn't exist.\n\nOne last caveat: my three year old son had been complaining that his room is \"too scary\" most of last week.  Nothing had changed in his room and he's never said anything about his room being even a tiny bit scary before.  My daughter used to talk in her room when she was around two and I asked her who she was talking to thinking she'd tell me she was talking to her bear or something, but to my surprise, she told me she was talking to \"Abo\" (pronounced \"AH-boh\").  When she said that, about three years ago, we were living in a different house and we were downstairs when she told me that.  I asked her, \"Can you see Abo right now?\"  She said, \"Yes.\"  I asked, \"Where?\" Trying to not make a big deal out of it, and she pointed to a picture hanging on the wall of my grandfather (abuelo - \"grandfather\" in Spanish).  \n\nSo has my grandfather been ramping up the week before and my son is the only one who's been able to see or sense him?  Or is this all just coincidence?  Or am I bending the facts to fit my narrative?  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Experience ", "id": "64rz0c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "Gay4BillKaulitz", "saved": false, "mod_reports": [], "name": "t3_64rz0c", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": "d", "author_flair_css_class": "g", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64rz0c/a_visit_from_my_late_grandfather_long/", "num_reports": null, "locked": false, "stickied": false, "created": 1491957588.0, "url": "https://www.reddit.com/r/Paranormal/comments/64rz0c/a_visit_from_my_late_grandfather_long/", "author_flair_text": "The truth is out there", "quarantine": false, "title": "A visit from my late grandfather? [long]", "created_utc": 1491928788.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64rz0c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64rz0c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64rz0c", "likes": null, "replies": "", "user_reports": [], "id": "dg4mcpj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Gnawgie", "parent_id": "t1_dg4l4nz", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "He might still be jumpy from what he saw before. No harm in smudging again- even if it just to reassure your son ;).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He might still be jumpy from what he saw before. No harm in smudging again- even if it just to reassure your son ;).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4mcpj", "score_hidden": false, "stickied": false, "created": 1491961580.0, "created_utc": 1491932780.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4l4nz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Gay4BillKaulitz", "parent_id": "t1_dg4kfro", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I smudged his room and he was okay for a few days after that, but then about four days after I smudged his room, he said his room was too scary again. \n\nI used \"monster spray\" (water and lavender oil) around his room and told him it was all better and he could go to sleep and he did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I smudged his room and he was okay for a few days after that, but then about four days after I smudged his room, he said his room was too scary again. &lt;/p&gt;\n\n&lt;p&gt;I used &amp;quot;monster spray&amp;quot; (water and lavender oil) around his room and told him it was all better and he could go to sleep and he did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4l4nz", "score_hidden": false, "stickied": false, "created": 1491960249.0, "created_utc": 1491931449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kfro", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Gnawgie", "parent_id": "t3_64rz0c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "There's a good chance that your grandfather is in the house but it could be something else. It was a good sign that your daughter was not afraid of the spirit she spoke with earlier. \nHowever, it is a bit weird that you and your son felt afraid of the spirit's presense. I'd be cautious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a good chance that your grandfather is in the house but it could be something else. It was a good sign that your daughter was not afraid of the spirit she spoke with earlier. \nHowever, it is a bit weird that you and your son felt afraid of the spirit&amp;#39;s presense. I&amp;#39;d be cautious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4kfro", "score_hidden": false, "stickied": false, "created": 1491959488.0, "created_utc": 1491930688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64rz0c", "likes": null, "replies": "", "user_reports": [], "id": "dg4z7x2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mcc86", "parent_id": "t3_64rz0c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "little kids are so awesome the pineal gland is in full swing and they see so much that we dont.\ni also had monster spray for my little 4 yr old... \nI got her a little Bible for children and would read her some verses before sleep. That calmed her a lot", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;little kids are so awesome the pineal gland is in full swing and they see so much that we dont.\ni also had monster spray for my little 4 yr old... \nI got her a little Bible for children and would read her some verses before sleep. That calmed her a lot&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg4z7x2", "score_hidden": false, "stickied": false, "created": 1491975887.0, "created_utc": 1491947087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64rz0c", "likes": null, "replies": "", "user_reports": [], "id": "dg5mrzt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fortevn", "parent_id": "t3_64rz0c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "3:33 AM is one of the time when the otherworld is most active. However it does depend on where you live. For some countries, it's exactly 0:00, for others, 1:21 and so on.\n\nAlso 3 years old is the age that the easiest to be affected by the otherworld. Or that's what people say. Can't say it as fact, but most stories about children doing creepy things are at that age. Coincidence? Maybe. Haha.\n\nAnyway, gender does matter in this kinda world. Male tends to resist, and female goes along. So it's possible that your son and daughter are seeing the same thing, but they act differently due to the nature of their own. Hopefully it is your gramps. But at the same time it's not that nice for a passed-away to linger. Time changes things. Maybe go to your religious church (or temple, or shrine, whatever you believe in) and ask to pay respect to your gramps and the way to let him really pass on. (Go to heaven, or reborn anew, again depends on your religion)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;3:33 AM is one of the time when the otherworld is most active. However it does depend on where you live. For some countries, it&amp;#39;s exactly 0:00, for others, 1:21 and so on.&lt;/p&gt;\n\n&lt;p&gt;Also 3 years old is the age that the easiest to be affected by the otherworld. Or that&amp;#39;s what people say. Can&amp;#39;t say it as fact, but most stories about children doing creepy things are at that age. Coincidence? Maybe. Haha.&lt;/p&gt;\n\n&lt;p&gt;Anyway, gender does matter in this kinda world. Male tends to resist, and female goes along. So it&amp;#39;s possible that your son and daughter are seeing the same thing, but they act differently due to the nature of their own. Hopefully it is your gramps. But at the same time it&amp;#39;s not that nice for a passed-away to linger. Time changes things. Maybe go to your religious church (or temple, or shrine, whatever you believe in) and ask to pay respect to your gramps and the way to let him really pass on. (Go to heaven, or reborn anew, again depends on your religion)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5mrzt", "score_hidden": false, "stickied": false, "created": 1492013730.0, "created_utc": 1491984930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64rz0c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64rz0c", "likes": null, "replies": "", "user_reports": [], "id": "dgdj28v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sansabina", "parent_id": "t1_dgcvid7", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I notice you posting quite a few of these \"rescues\". How did you gain all this knowledge about the truth nature of the world?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I notice you posting quite a few of these &amp;quot;rescues&amp;quot;. How did you gain all this knowledge about the truth nature of the world?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdj28v", "score_hidden": false, "stickied": false, "created": 1492467463.0, "created_utc": 1492438663.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvid7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rainbowcanada", "parent_id": "t3_64rz0c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "This is spiritual /psychic message for you:\n\"Abo\" is not your grandfather/abuelo. Your grandfather crossed over successfully. He is not trapped in our world.\n\n It's too bad ghost hunters still assume paranormal activity is the ghost of a dead person. Since 2015, wandering ghosts are regularly rounded up by elementals (divine agents) &amp; helped to cross over. This has meant fewer hauntings by former human beings. Now almost all paranormal activity involves a nonhuman entity, properly called an elemental.\n\nElementals at work on Earth as 5D dragons are invisible, unless compromised as part of a curse. The word \"demon\" suggests they become viscious. But many compromised elementals are gentle... &amp; hoping to return to their normal duties. They want to be rescued. So they talk to children who are more open (soulful, psychic) &amp; adults with psychic abilities, especially Star Volunteers.\n\n Abo is an elemental seeking help from your children. Your daughter &amp; son are both Indigo star volunteers who will one day be advanced psychics &amp; paranormal responders (like me). Abo is being removed from the earthly plane today.\n\nAbo's full name is Bacalu. The Bacalu is a type of elemental resembling a white cat with wings. (It appears darker if used in a curse.) The word \"bachelor\" &amp; \"bacalaureate\" arise from this class of elemental, whose job has to do with Star Volunteers. All Star Volunteers (people ensouled by Rainbow, Crystal, Indigo &amp; Thrice-Great angels) are supposed to earn a Bachelor's degree. This requirement is part of their soul path &amp; is regulated by the flying cat -- the Bacalu (back-ah-loo).\n\nANYONE bothered by the presence of an elemental, just ask Archangel Michael to take it away. Or Post it on r/Paranormal &amp; I'll ask the angels on your behalf, plus explain what it was. Angels of a higher rank than the archangels are here to teach humanity about the End Times program. It's the End of ignorance, NOT the end of the world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is spiritual /psychic message for you:\n&amp;quot;Abo&amp;quot; is not your grandfather/abuelo. Your grandfather crossed over successfully. He is not trapped in our world.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s too bad ghost hunters still assume paranormal activity is the ghost of a dead person. Since 2015, wandering ghosts are regularly rounded up by elementals (divine agents) &amp;amp; helped to cross over. This has meant fewer hauntings by former human beings. Now almost all paranormal activity involves a nonhuman entity, properly called an elemental.&lt;/p&gt;\n\n&lt;p&gt;Elementals at work on Earth as 5D dragons are invisible, unless compromised as part of a curse. The word &amp;quot;demon&amp;quot; suggests they become viscious. But many compromised elementals are gentle... &amp;amp; hoping to return to their normal duties. They want to be rescued. So they talk to children who are more open (soulful, psychic) &amp;amp; adults with psychic abilities, especially Star Volunteers.&lt;/p&gt;\n\n&lt;p&gt;Abo is an elemental seeking help from your children. Your daughter &amp;amp; son are both Indigo star volunteers who will one day be advanced psychics &amp;amp; paranormal responders (like me). Abo is being removed from the earthly plane today.&lt;/p&gt;\n\n&lt;p&gt;Abo&amp;#39;s full name is Bacalu. The Bacalu is a type of elemental resembling a white cat with wings. (It appears darker if used in a curse.) The word &amp;quot;bachelor&amp;quot; &amp;amp; &amp;quot;bacalaureate&amp;quot; arise from this class of elemental, whose job has to do with Star Volunteers. All Star Volunteers (people ensouled by Rainbow, Crystal, Indigo &amp;amp; Thrice-Great angels) are supposed to earn a Bachelor&amp;#39;s degree. This requirement is part of their soul path &amp;amp; is regulated by the flying cat -- the Bacalu (back-ah-loo).&lt;/p&gt;\n\n&lt;p&gt;ANYONE bothered by the presence of an elemental, just ask Archangel Michael to take it away. Or Post it on &lt;a href=\"/r/Paranormal\"&gt;r/Paranormal&lt;/a&gt; &amp;amp; I&amp;#39;ll ask the angels on your behalf, plus explain what it was. Angels of a higher rank than the archangels are here to teach humanity about the End Times program. It&amp;#39;s the End of ignorance, NOT the end of the world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgcvid7", "score_hidden": false, "stickied": false, "created": 1492420055.0, "created_utc": 1492391255.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]