[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before I begin, I have to first explain a few things about myself. I grew up in a strict Christian household and was pretty isolated for my first eighteen years of life. My dad was very emotionally abusive but never beat me aside from the occasional spanking. After two and a half years of college and three suicide attempts, I&amp;#39;ve been diagnosed with Major Depressive Disorder with psychotic features (because of these hallucinations) and ADD. I spent some time in a mental hospital after my last suicide attempt and when I told the doctors what I&amp;#39;m about to tell you now, it confused them a bit and they said it doesn&amp;#39;t make sense that I would have such vivid hallucinations as I don&amp;#39;t exhibit any other symptoms of being schizophrenic or psychotic.\nMy current therapist is of no help. She is a Christian and she believes that my visions are real and that I&amp;#39;m just sensitive to the world of demons and angels. I&amp;#39;m not so quick to believe her. I&amp;#39;m looking for a different therapist as I type this.\nI really need help. I&amp;#39;m losing my grip on reality. I need to know if there was a possible misdiagnosis, if my medication is doing this, if I&amp;#39;m just throwing myself into a panic over nothing, or if I really am seeing spirits.\nThe earliest hallucinations I remember having were when I was in elementary school. At night I would regularly see thousands of tarantulas slowly crawling up the walls of my bedroom. Sometimes there were fewer that disappeared when I looked directly at them, then reappeared in my peripheral vision, and sometimes they would just sit there and do nothing. I wasn&amp;#39;t always scared of these tarantulas, but ever curious as to whether I was imagining them or not.\nAnother time I remember riding in the backseat of my mom&amp;#39;s car on the way home from school. I was in the fourth grade and thinking about space for some reason, when everything around me suddenly fell away and I lost almost all sense of my physical self. I had a vision of space and I felt as though I had become a star.\nWhen I was eighteen, the summer before I left for college, I had to take care of my grandpa at his house 24/7 because of his dementia and my parents couldn&amp;#39;t afford a nurse. I was watching TV in my room one night, with a baby monitor on so I could hear my grandpa and make sure he didn&amp;#39;t fall out of bed, when suddenly I get this intense pressure in my chest as if I was being sat on. At first I thought it was just because of how I was laying on the bed, but when I got up the pressure just increased. It didn&amp;#39;t feel like it was coming from inside me as cramps usually do, but outside. It was then, for no apparent reason, that I experienced my first panic attack. I felt very paranoid and was sure I was being watched. I had a hard time sleeping that night.\nThe next night the same thing happened, but this time my locked door began to shake as though someone had grabbed it by the sides and shook it up and down. I thought it was my grandpa at first and called out his name, but he wouldn&amp;#39;t respond. He tends to drag his feet when he walks so it isn&amp;#39;t really hard to hear his socks or slippers scraping against the tile floor. I heard nothing. I felt a whoosh come in through the closed door and the feeling of paranoia and fear of being watched increased. I kept telling myself that I was just making myself anxious for no reason and that there were no demons because Jesus was protecting me. (I was still a Christian at the time) The feelings increased as I rolled on to my right side. I closed my eyes and focused on trying to calm myself down, when an image involuntarily surfaced into my head of a large dark figure: broad shoulders, round shape as though it were covered in a cloak of some sort, long horns curving upward, and a human skull for a face. This creature stood about eight feet tall and was very blurry and mostly black, the only detail I was really sure of was its white skull face. I prayed and began reading my Bible out loud, and as I did the sound of claws scraping against the tile came from where I felt the entity was standing. I tried reading aloud some more, but when I tried I heard a loud snake hiss from all directions. We didn&amp;#39;t have snakes in our city.\nThe third night was the weirdest. I had managed to push those negative feelings away the previous night and had fallen asleep. It was around midnight or 1am, and I had to get up and use the hall bathroom. The house was very dark, and as soon as I stepped out of my room those feelings returned, much more powerful than before. I looked into the dark hallway and could almost make out several dark, round figures with beady little eyes trying to fit through the hallway to get a good look at me. I don&amp;#39;t know if I imagined it or not. I felt better after shouting some Bible verses at them. I went into the bathroom and brushed my teeth, and happened to look over at a window above the bathtub. Now, from where this window is positioned outside, there would be no way to look into it because there is a pipe that runs right in front of it. Not to mention it&amp;#39;s a small window that&amp;#39;s about seven feet away from the ground. What I saw confuses me to this day. I clearly, very clearly saw a white face looking at me through the window. The face was unnaturally wide, with huge black sockets where its eyes should have been, and a wide black smile that reached from ear to ear. It almost looked like a cartoon. I closed the shower curtain and ran back to my room. I heard my grandpa crying through the baby monitor. The way he was wailing told me he was still asleep, as he&amp;#39;s been known to talk in his sleep sometimes. I didn&amp;#39;t think anything of it until the cries got worse, to the point he was almost screaming. I couldn&amp;#39;t wake him up and I was very scared, so I called my mother over. Things seemed to calm down a bit when she came, and she was able to wake my grandpa up. He was very upset and kept saying &amp;quot;there&amp;#39;s someone in the house!&amp;quot; over and over again. She eventually got him back to sleep and came over to comfort me. I was still very tense but I was able to sleep that night.\nI have many other stories similar to these, I just don&amp;#39;t have the time to write them all right now. I will continue to post them when I find the time. But seriously, if anyone has any kind of idea of what might be going on, please help me. Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Before I begin, I have to first explain a few things about myself. I grew up in a strict Christian household and was pretty isolated for my first eighteen years of life. My dad was very emotionally abusive but never beat me aside from the occasional spanking. After two and a half years of college and three suicide attempts, I've been diagnosed with Major Depressive Disorder with psychotic features (because of these hallucinations) and ADD. I spent some time in a mental hospital after my last suicide attempt and when I told the doctors what I'm about to tell you now, it confused them a bit and they said it doesn't make sense that I would have such vivid hallucinations as I don't exhibit any other symptoms of being schizophrenic or psychotic.\nMy current therapist is of no help. She is a Christian and she believes that my visions are real and that I'm just sensitive to the world of demons and angels. I'm not so quick to believe her. I'm looking for a different therapist as I type this.\nI really need help. I'm losing my grip on reality. I need to know if there was a possible misdiagnosis, if my medication is doing this, if I'm just throwing myself into a panic over nothing, or if I really am seeing spirits.\nThe earliest hallucinations I remember having were when I was in elementary school. At night I would regularly see thousands of tarantulas slowly crawling up the walls of my bedroom. Sometimes there were fewer that disappeared when I looked directly at them, then reappeared in my peripheral vision, and sometimes they would just sit there and do nothing. I wasn't always scared of these tarantulas, but ever curious as to whether I was imagining them or not.\nAnother time I remember riding in the backseat of my mom's car on the way home from school. I was in the fourth grade and thinking about space for some reason, when everything around me suddenly fell away and I lost almost all sense of my physical self. I had a vision of space and I felt as though I had become a star.\nWhen I was eighteen, the summer before I left for college, I had to take care of my grandpa at his house 24/7 because of his dementia and my parents couldn't afford a nurse. I was watching TV in my room one night, with a baby monitor on so I could hear my grandpa and make sure he didn't fall out of bed, when suddenly I get this intense pressure in my chest as if I was being sat on. At first I thought it was just because of how I was laying on the bed, but when I got up the pressure just increased. It didn't feel like it was coming from inside me as cramps usually do, but outside. It was then, for no apparent reason, that I experienced my first panic attack. I felt very paranoid and was sure I was being watched. I had a hard time sleeping that night.\nThe next night the same thing happened, but this time my locked door began to shake as though someone had grabbed it by the sides and shook it up and down. I thought it was my grandpa at first and called out his name, but he wouldn't respond. He tends to drag his feet when he walks so it isn't really hard to hear his socks or slippers scraping against the tile floor. I heard nothing. I felt a whoosh come in through the closed door and the feeling of paranoia and fear of being watched increased. I kept telling myself that I was just making myself anxious for no reason and that there were no demons because Jesus was protecting me. (I was still a Christian at the time) The feelings increased as I rolled on to my right side. I closed my eyes and focused on trying to calm myself down, when an image involuntarily surfaced into my head of a large dark figure: broad shoulders, round shape as though it were covered in a cloak of some sort, long horns curving upward, and a human skull for a face. This creature stood about eight feet tall and was very blurry and mostly black, the only detail I was really sure of was its white skull face. I prayed and began reading my Bible out loud, and as I did the sound of claws scraping against the tile came from where I felt the entity was standing. I tried reading aloud some more, but when I tried I heard a loud snake hiss from all directions. We didn't have snakes in our city.\nThe third night was the weirdest. I had managed to push those negative feelings away the previous night and had fallen asleep. It was around midnight or 1am, and I had to get up and use the hall bathroom. The house was very dark, and as soon as I stepped out of my room those feelings returned, much more powerful than before. I looked into the dark hallway and could almost make out several dark, round figures with beady little eyes trying to fit through the hallway to get a good look at me. I don't know if I imagined it or not. I felt better after shouting some Bible verses at them. I went into the bathroom and brushed my teeth, and happened to look over at a window above the bathtub. Now, from where this window is positioned outside, there would be no way to look into it because there is a pipe that runs right in front of it. Not to mention it's a small window that's about seven feet away from the ground. What I saw confuses me to this day. I clearly, very clearly saw a white face looking at me through the window. The face was unnaturally wide, with huge black sockets where its eyes should have been, and a wide black smile that reached from ear to ear. It almost looked like a cartoon. I closed the shower curtain and ran back to my room. I heard my grandpa crying through the baby monitor. The way he was wailing told me he was still asleep, as he's been known to talk in his sleep sometimes. I didn't think anything of it until the cries got worse, to the point he was almost screaming. I couldn't wake him up and I was very scared, so I called my mother over. Things seemed to calm down a bit when she came, and she was able to wake my grandpa up. He was very upset and kept saying \"there's someone in the house!\" over and over again. She eventually got him back to sleep and came over to comfort me. I was still very tense but I was able to sleep that night.\nI have many other stories similar to these, I just don't have the time to write them all right now. I will continue to post them when I find the time. But seriously, if anyone has any kind of idea of what might be going on, please help me. Thank you.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sy92", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "theoneclandestinekid", "saved": false, "mod_reports": [], "name": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64sy92/im_losing_my_grip_on_reality/", "num_reports": null, "locked": false, "stickied": false, "created": 1491966340.0, "url": "https://www.reddit.com/r/Paranormal/comments/64sy92/im_losing_my_grip_on_reality/", "author_flair_text": null, "quarantine": false, "title": "I'm losing my grip on reality", "created_utc": 1491937540.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 29, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg5imex", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "vitisrotundifolia", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "That is really scary, I'm sorry you've had to deal with this. Seek trusted, spiritual counseling, as it could be an entity. But Id also suggest a secular therapist that you feel comfortable with, it could take time but is worth the effort. \nI am praying for you.\nSurround yourself with your loved ones and be gentle and patient with yourself... Sounds like you dealt with some rough stuff \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is really scary, I&amp;#39;m sorry you&amp;#39;ve had to deal with this. Seek trusted, spiritual counseling, as it could be an entity. But Id also suggest a secular therapist that you feel comfortable with, it could take time but is worth the effort. \nI am praying for you.\nSurround yourself with your loved ones and be gentle and patient with yourself... Sounds like you dealt with some rough stuff &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5imex", "score_hidden": false, "stickied": false, "created": 1492003295.0, "created_utc": 1491974495.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg6p5cv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg6p23g", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Well my therapist today said it's very likely that it's my subconscious projecting and indicating I still have a lot of unresolved issues from the trauma I've experienced growing up. He made the comparison to convicts who recently were released from prison, sometimes they experience similar types of hallucinations. I was very isolated growing up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well my therapist today said it&amp;#39;s very likely that it&amp;#39;s my subconscious projecting and indicating I still have a lot of unresolved issues from the trauma I&amp;#39;ve experienced growing up. He made the comparison to convicts who recently were released from prison, sometimes they experience similar types of hallucinations. I was very isolated growing up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6p5cv", "score_hidden": false, "stickied": false, "created": 1492065886.0, "created_utc": 1492037086.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6p23g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RainyDayHaze", "parent_id": "t1_dg68oxh", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "So if you don't believe in the existence of anything paranormal is there something else you're leaning towards in terms of what you are experiencing?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So if you don&amp;#39;t believe in the existence of anything paranormal is there something else you&amp;#39;re leaning towards in terms of what you are experiencing?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6p23g", "score_hidden": false, "stickied": false, "created": 1492065776.0, "created_utc": 1492036976.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68oxh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg5bukh", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Because there has been so scientific evidence for the existence of the paranormal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because there has been so scientific evidence for the existence of the paranormal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg68oxh", "score_hidden": false, "stickied": false, "created": 1492048010.0, "created_utc": 1492019210.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5bukh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RainyDayHaze", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I don't know what's going on with you but I do believe you if it's any consolation. You said your therapist believes you &amp; thinks it has to do with angels &amp; demons but is no help. What makes you think it isn't something demonic?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what&amp;#39;s going on with you but I do believe you if it&amp;#39;s any consolation. You said your therapist believes you &amp;amp; thinks it has to do with angels &amp;amp; demons but is no help. What makes you think it isn&amp;#39;t something demonic?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5bukh", "score_hidden": false, "stickied": false, "created": 1491992451.0, "created_utc": 1491963651.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg68s97", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg5cc8c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thank you very much. \nI've been on 20mg of Prozac for about eight months, and when I was in the hospital they had put me on Abilify but my doctor gave me permission to stop taking it when it made me gain weight and stopped being effective. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much. \nI&amp;#39;ve been on 20mg of Prozac for about eight months, and when I was in the hospital they had put me on Abilify but my doctor gave me permission to stop taking it when it made me gain weight and stopped being effective. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg68s97", "score_hidden": false, "stickied": false, "created": 1492048100.0, "created_utc": 1492019300.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5cc8c", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "echmoth", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Interesting account, just as a first point, as you're already doing please find a new therapist/psychologist/psychiatrist, I'm assuming you may already be on some medication since you mentioned it in passing, can you share what it is and how long you've been on it? \n\nGet to a good Psychiatrist/Psychologist, I think that's really the first course of action here to help you out and provide you some clarity and peace of mind that you're really looking for. Be open with them and maybe even make sure they know you're looking for a secular or medical based approach for the focus of it. \n\n**Word of warning** Never stop any medication without first consulting your doctor/psychiatrist, it can have some super bad, negative effects and you may not be able to see this occurring objectively.  \n\nBest of luck, and please let us know how you go. Don't fear, don't be afraid, and seek the help you deserve. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting account, just as a first point, as you&amp;#39;re already doing please find a new therapist/psychologist/psychiatrist, I&amp;#39;m assuming you may already be on some medication since you mentioned it in passing, can you share what it is and how long you&amp;#39;ve been on it? &lt;/p&gt;\n\n&lt;p&gt;Get to a good Psychiatrist/Psychologist, I think that&amp;#39;s really the first course of action here to help you out and provide you some clarity and peace of mind that you&amp;#39;re really looking for. Be open with them and maybe even make sure they know you&amp;#39;re looking for a secular or medical based approach for the focus of it. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Word of warning&lt;/strong&gt; Never stop any medication without first consulting your doctor/psychiatrist, it can have some super bad, negative effects and you may not be able to see this occurring objectively.  &lt;/p&gt;\n\n&lt;p&gt;Best of luck, and please let us know how you go. Don&amp;#39;t fear, don&amp;#39;t be afraid, and seek the help you deserve. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5cc8c", "score_hidden": false, "stickied": false, "created": 1491993128.0, "created_utc": 1491964328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg7rkjh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg7f640", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "It does help, even though there seems to be no rhyme or reason to these things. Thanks for the help :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It does help, even though there seems to be no rhyme or reason to these things. Thanks for the help :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7rkjh", "score_hidden": false, "stickied": false, "created": 1492128407.0, "created_utc": 1492099607.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7f640", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CinzTheKitteh", "parent_id": "t1_dg7ezvx", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Sorry this sounds so clinical. I usually babble but I thought I'd reel it in rather than bombard you :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry this sounds so clinical. I usually babble but I thought I&amp;#39;d reel it in rather than bombard you :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7f640", "score_hidden": false, "stickied": false, "created": 1492111730.0, "created_utc": 1492082930.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ezvx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CinzTheKitteh", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "These do sound like hallucinations to me. I'm not saying they're not terrifying. You must feel so tormented. Losing your grip on reality is also part of psychotic episodes. Those visions are so real and make you feel REAL fear. It's difficult to deny the reality of something so scary. \n\n\n\nYou seem to have a negative past and you had a lot to deal with. Sometimes instead of just feeling shitty, those issues take the form of waking nightmares like yours. It's the way your brain chemistry works. \n\nThat said, you don't seem to rule out the possibility of the paranormal. I wouldn't rule it out either even though I've done my postgrad in  psychology! You need to be a Christian to believe in spirits anyway. The occurrence with your grandad is one thing that makes me pause. If you both sensed something at the same time, to me it's more likely to be paranormal (shared hallucinations are supposedly possible in psychotic episodes, but even that seems paranormal). \n\n Does speaking to people on subs like this help ground you? If you do get that feeling, I'm sure they can help you to investigate whether these visions are yours or the manifestation of another entity. \n\nI'm no expert but from my paranormally uneducated point of view I would want to know whether these visions only occur in certain places? Do they only occur in certain situations? Do any of the beings or creatures in your experiences have any sort of symbolism to you or are they just always generally scary things ?\n\n\nThis must be terribly frustrating because both explanations are valid if you believe in spirits. I hope you'll find your way to a sense of peace and hope to see more posts from you, if you're comfortable with it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These do sound like hallucinations to me. I&amp;#39;m not saying they&amp;#39;re not terrifying. You must feel so tormented. Losing your grip on reality is also part of psychotic episodes. Those visions are so real and make you feel REAL fear. It&amp;#39;s difficult to deny the reality of something so scary. &lt;/p&gt;\n\n&lt;p&gt;You seem to have a negative past and you had a lot to deal with. Sometimes instead of just feeling shitty, those issues take the form of waking nightmares like yours. It&amp;#39;s the way your brain chemistry works. &lt;/p&gt;\n\n&lt;p&gt;That said, you don&amp;#39;t seem to rule out the possibility of the paranormal. I wouldn&amp;#39;t rule it out either even though I&amp;#39;ve done my postgrad in  psychology! You need to be a Christian to believe in spirits anyway. The occurrence with your grandad is one thing that makes me pause. If you both sensed something at the same time, to me it&amp;#39;s more likely to be paranormal (shared hallucinations are supposedly possible in psychotic episodes, but even that seems paranormal). &lt;/p&gt;\n\n&lt;p&gt;Does speaking to people on subs like this help ground you? If you do get that feeling, I&amp;#39;m sure they can help you to investigate whether these visions are yours or the manifestation of another entity. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m no expert but from my paranormally uneducated point of view I would want to know whether these visions only occur in certain places? Do they only occur in certain situations? Do any of the beings or creatures in your experiences have any sort of symbolism to you or are they just always generally scary things ?&lt;/p&gt;\n\n&lt;p&gt;This must be terribly frustrating because both explanations are valid if you believe in spirits. I hope you&amp;#39;ll find your way to a sense of peace and hope to see more posts from you, if you&amp;#39;re comfortable with it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7ezvx", "score_hidden": false, "stickied": false, "created": 1492111332.0, "created_utc": 1492082532.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg69879", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg5jkgj", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Definitely will when I get the time later this week. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely will when I get the time later this week. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg69879", "score_hidden": false, "stickied": false, "created": 1492048550.0, "created_utc": 1492019750.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jkgj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "teokil", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Would be very curious about your other experiences. You can message me if that makes you comfortable. I am sorry you have to deal with that. I hope it isn't anything spiritual and u can find the solution. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would be very curious about your other experiences. You can message me if that makes you comfortable. I am sorry you have to deal with that. I hope it isn&amp;#39;t anything spiritual and u can find the solution. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5jkgj", "score_hidden": false, "stickied": false, "created": 1492005244.0, "created_utc": 1491976444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg5ujpd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aguynamedmason", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I'm sorry you are going through that. While I may not be of much help, I can tell you that the pressure on your chest sounds almost exactly like sleep paralysis, other than the fact you were able to sit up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you are going through that. While I may not be of much help, I can tell you that the pressure on your chest sounds almost exactly like sleep paralysis, other than the fact you were able to sit up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5ujpd", "score_hidden": false, "stickied": false, "created": 1492032202.0, "created_utc": 1492003402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg69bpg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg61dhf", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Will do, thank you very much ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Will do, thank you very much &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg69bpg", "score_hidden": false, "stickied": false, "created": 1492048648.0, "created_utc": 1492019848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61dhf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "endlessmus48", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "The best thing to do is seek someone new. It is best to get talk to someone about this and receive help with the depression, as I know what that feels like. And you are not going crazy. Although at this time, you make think so because of your Christian background and the experiences, the best option is to think about it objectively. Disregard what you have been taught at this moment and just record your experiences. Right things down. Is there a pattern? What things occur? It's better to write some of what you are going through to get the thoughts of your head because those thoughts circulating with what you are already feeling and going through will make it worse. This way, you can look at it rationally, and perhaps share it with the therapist, or some spiritual helper. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best thing to do is seek someone new. It is best to get talk to someone about this and receive help with the depression, as I know what that feels like. And you are not going crazy. Although at this time, you make think so because of your Christian background and the experiences, the best option is to think about it objectively. Disregard what you have been taught at this moment and just record your experiences. Right things down. Is there a pattern? What things occur? It&amp;#39;s better to write some of what you are going through to get the thoughts of your head because those thoughts circulating with what you are already feeling and going through will make it worse. This way, you can look at it rationally, and perhaps share it with the therapist, or some spiritual helper. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg61dhf", "score_hidden": false, "stickied": false, "created": 1492040400.0, "created_utc": 1492011600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg65yw7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GhostsOnly", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I think I absorbed something from you -- a soul piece of my demon husband.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I absorbed something from you -- a soul piece of my demon husband.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg65yw7", "score_hidden": false, "stickied": false, "created": 1492045272.0, "created_utc": 1492016472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg76nz5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg7643d", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Definitely will, thank you very much :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely will, thank you very much :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg76nz5", "score_hidden": false, "stickied": false, "created": 1492089066.0, "created_utc": 1492060266.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7643d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "-ultraviolence-", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thank you for sharing these experiences and I encourage you to continue reaching out. I wish I had more answers for you but I believe there are so many people here, someone has to have some helpful insight for you. \n\n\nI was scared just reading about these things especially the face. I can't imagine how hard it was to actually experience that. \n\n\nIf anything, maybe these will make you braver. I hope so. I hope you don't live in fear. But I could understand how easy it would be to do so after having experiences like that. \n\nCan you please share more stories and stay in touch? Im genuinely concerned and curious about your situation. Please keep us posted ans continuw to share with reddit and any other outlets.\n\nIf you want to message me you can. I'm here. I have never had anything like this happen but I do have MDD and a panic disorder Co existing with add. So we do have some things in common. \n\nHope to see you around or hear from you soon. I really hope you get some answers. Sending you love from one Internet stranger to another. Be brave and know that you will get through this with more knowledge of the world around you and your own mind. With that said maybe cross post to r/Thetruthishere ", "edited": 1492059717.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing these experiences and I encourage you to continue reaching out. I wish I had more answers for you but I believe there are so many people here, someone has to have some helpful insight for you. &lt;/p&gt;\n\n&lt;p&gt;I was scared just reading about these things especially the face. I can&amp;#39;t imagine how hard it was to actually experience that. &lt;/p&gt;\n\n&lt;p&gt;If anything, maybe these will make you braver. I hope so. I hope you don&amp;#39;t live in fear. But I could understand how easy it would be to do so after having experiences like that. &lt;/p&gt;\n\n&lt;p&gt;Can you please share more stories and stay in touch? Im genuinely concerned and curious about your situation. Please keep us posted ans continuw to share with reddit and any other outlets.&lt;/p&gt;\n\n&lt;p&gt;If you want to message me you can. I&amp;#39;m here. I have never had anything like this happen but I do have MDD and a panic disorder Co existing with add. So we do have some things in common. &lt;/p&gt;\n\n&lt;p&gt;Hope to see you around or hear from you soon. I really hope you get some answers. Sending you love from one Internet stranger to another. Be brave and know that you will get through this with more knowledge of the world around you and your own mind. With that said maybe cross post to &lt;a href=\"/r/Thetruthishere\"&gt;r/Thetruthishere&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7643d", "score_hidden": false, "stickied": false, "created": 1492088113.0, "created_utc": 1492059313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg7ropd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg7e86z", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thank you, this is very helpful. There isn't much I can do to help him, he's in a nursing home now and his Alzheimer's has gotten pretty bad. Lately I haven't been able to interact with them much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, this is very helpful. There isn&amp;#39;t much I can do to help him, he&amp;#39;s in a nursing home now and his Alzheimer&amp;#39;s has gotten pretty bad. Lately I haven&amp;#39;t been able to interact with them much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7ropd", "score_hidden": false, "stickied": false, "created": 1492128533.0, "created_utc": 1492099733.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e86z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fortevn", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Hi, as many other threads I'd like to thank you for the detailed story. And I'm sorry if whatever I'm about to post seems ignorant or unfriendly. \n\nFirstly, since this is a very huge post, I'll assume all you've said is true and move from there.\n\nAs some pointed out, you stated that you already had a lot of uneasiness of mind from the start. These could very well be the reason of all this. You know, \"you imagined them\".\n\nHowever, your grandfather crying part doesn't fit in that conclusion. This is where things got complex. What he said fit what you saw. So it is possible that everything wasn't your imagination. \n\nThe first appearance you saw, a black body with a skull with horns. It's a typical appearance of a demon. The next, beasts' eyes, several of them, means it's a lesser being in a group. And the last, white face. This is the most disturbing one. It can't be defined. \n\nHuman is especially good at seeing faces. If you're creative and look at something long enough, you can see faces everywhere, from the patterns of your sweater to a random water traces on a window. Because it's extremely important for survival.\n\nSeeing such a face means serious trouble. A smiling face means it knew you, it has a purpose, it's gonna \"have fun\" and you have little chance against it. And to be honest, its game doesn't limit to just you, either.\n\nThere is a very high chance that you possess the ability of seeing them. Which means, you might (might only, ok?) also possess the ability of interacting with them. If you can touch them (as they can touch you), then you can \"fight\". Of course I wouldn't advise it, violence won't ever be the answer unless it's the last resort. And I do NOT want to tell you to act violently at all. But I think you should take it into consideration, just... in case.\n\nNow. I'm being very serious here and I hope this will help you: you are not (yet) vulnerable. That night, they could get you. But they didn't. The eyes looked at you yet did nothing. The face smiled at you but did nothing. EVEN AFTER YOU FALL ASLEEP. This is important. They made sure you knew their presence but didn't do anything to you. \n\nInstead, your grandfather reacted. \n\nSo get someone to be with your gramps, maybe yourself. As you are seemingly the only one that can see them, and hopefully, protect your gramps from them. \n\nWith all that being said. I hope this isn't a game... their game... waiting to start.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, as many other threads I&amp;#39;d like to thank you for the detailed story. And I&amp;#39;m sorry if whatever I&amp;#39;m about to post seems ignorant or unfriendly. &lt;/p&gt;\n\n&lt;p&gt;Firstly, since this is a very huge post, I&amp;#39;ll assume all you&amp;#39;ve said is true and move from there.&lt;/p&gt;\n\n&lt;p&gt;As some pointed out, you stated that you already had a lot of uneasiness of mind from the start. These could very well be the reason of all this. You know, &amp;quot;you imagined them&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;However, your grandfather crying part doesn&amp;#39;t fit in that conclusion. This is where things got complex. What he said fit what you saw. So it is possible that everything wasn&amp;#39;t your imagination. &lt;/p&gt;\n\n&lt;p&gt;The first appearance you saw, a black body with a skull with horns. It&amp;#39;s a typical appearance of a demon. The next, beasts&amp;#39; eyes, several of them, means it&amp;#39;s a lesser being in a group. And the last, white face. This is the most disturbing one. It can&amp;#39;t be defined. &lt;/p&gt;\n\n&lt;p&gt;Human is especially good at seeing faces. If you&amp;#39;re creative and look at something long enough, you can see faces everywhere, from the patterns of your sweater to a random water traces on a window. Because it&amp;#39;s extremely important for survival.&lt;/p&gt;\n\n&lt;p&gt;Seeing such a face means serious trouble. A smiling face means it knew you, it has a purpose, it&amp;#39;s gonna &amp;quot;have fun&amp;quot; and you have little chance against it. And to be honest, its game doesn&amp;#39;t limit to just you, either.&lt;/p&gt;\n\n&lt;p&gt;There is a very high chance that you possess the ability of seeing them. Which means, you might (might only, ok?) also possess the ability of interacting with them. If you can touch them (as they can touch you), then you can &amp;quot;fight&amp;quot;. Of course I wouldn&amp;#39;t advise it, violence won&amp;#39;t ever be the answer unless it&amp;#39;s the last resort. And I do NOT want to tell you to act violently at all. But I think you should take it into consideration, just... in case.&lt;/p&gt;\n\n&lt;p&gt;Now. I&amp;#39;m being very serious here and I hope this will help you: you are not (yet) vulnerable. That night, they could get you. But they didn&amp;#39;t. The eyes looked at you yet did nothing. The face smiled at you but did nothing. EVEN AFTER YOU FALL ASLEEP. This is important. They made sure you knew their presence but didn&amp;#39;t do anything to you. &lt;/p&gt;\n\n&lt;p&gt;Instead, your grandfather reacted. &lt;/p&gt;\n\n&lt;p&gt;So get someone to be with your gramps, maybe yourself. As you are seemingly the only one that can see them, and hopefully, protect your gramps from them. &lt;/p&gt;\n\n&lt;p&gt;With all that being said. I hope this isn&amp;#39;t a game... their game... waiting to start.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7e86z", "score_hidden": false, "stickied": false, "created": 1492109371.0, "created_utc": 1492080571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg8zk5c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "7367Network", "parent_id": "t1_dg76nds", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Try editing it on your laptop again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try editing it on your laptop again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg8zk5c", "score_hidden": false, "stickied": false, "created": 1492194265.0, "created_utc": 1492165465.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76nds", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg73tgf", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "But I did that...? I know I did. I just wrote it on my laptop instead of my phone like I'm on now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But I did that...? I know I did. I just wrote it on my laptop instead of my phone like I&amp;#39;m on now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg76nds", "score_hidden": false, "stickied": false, "created": 1492089035.0, "created_utc": 1492060235.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73tgf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "7367Network", "parent_id": "t1_dg68ycf", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Just press RETURN or ENTER every 4 or 5 sentences. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just press RETURN or ENTER every 4 or 5 sentences. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg73tgf", "score_hidden": false, "stickied": false, "created": 1492084465.0, "created_utc": 1492055665.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68ycf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg5idsg", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "how? I've never used Reddit before", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;how? I&amp;#39;ve never used Reddit before&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg68ycf", "score_hidden": false, "stickied": false, "created": 1492048269.0, "created_utc": 1492019469.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5idsg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "7367Network", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Write in paragraphs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Write in paragraphs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5idsg", "score_hidden": false, "stickied": false, "created": 1492002833.0, "created_utc": 1491974033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg59k4e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Theguymandudefella", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Walllllllll of text", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Walllllllll of text&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg59k4e", "score_hidden": false, "stickied": false, "created": 1491989394.0, "created_utc": 1491960594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg6wnpa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theoneclandestinekid", "parent_id": "t1_dg6vc8h", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thank you so much :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6wnpa", "score_hidden": false, "stickied": false, "created": 1492075089.0, "created_utc": 1492046289.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vc8h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RainyDayHaze", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Interesting. I hope whatever it is that it's able to be resolved. I'm so sorry that you suffered trauma &amp; isolation as a child. The thought of anyone, especially children, having trauma, abuse, whatever the case may be just breaks my heart. If you every want to inbox me to vent feel free.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. I hope whatever it is that it&amp;#39;s able to be resolved. I&amp;#39;m so sorry that you suffered trauma &amp;amp; isolation as a child. The thought of anyone, especially children, having trauma, abuse, whatever the case may be just breaks my heart. If you every want to inbox me to vent feel free.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6vc8h", "score_hidden": false, "stickied": false, "created": 1492073467.0, "created_utc": 1492044667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64sy92", "likes": null, "replies": "", "user_reports": [], "id": "dg727sm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RainyDayHaze", "parent_id": "t3_64sy92", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Of course :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg727sm", "score_hidden": false, "stickied": false, "created": 1492082150.0, "created_utc": 1492053350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]