[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A little more than a week ago I posted the story of my abnormal experiences in my house. Today I&amp;#39;m just going to talk about a few things that have happened since that time. Right after publishing the post I got up and my sister came into my room to tell me something. An this day I was wearing a rather loose shirt that the back part had somehow gotten into my shorts. As my sister was telling me something I felt someone or something pull my shirt from my shorts. I was confused as I turned around and saw nothing. I was standing right in front of a big mirror and hadn&amp;#39;t seen anyone there. A couple days later I started having weird coincidences happening to me. Whether it  be me singing a song in my head and my friend or family starting to sing the song or me thinking of a topic I hadn&amp;#39;t thought about in years and suddenly seeing an ad or someone talking about it. I had never heard anything about this happening to people who have been going through paranormal stuff. I&amp;#39;ve kind of just brushed it off, but it&amp;#39;s still in the back of my mind.  I&amp;#39;ve still had trouble falling asleep and hearing noises in my house. However the loud crashes have suddenly stopped. I don&amp;#39;t know whether to be relieved or scared. I also haven&amp;#39;t been waking up at weird hours of the night. This past week has been pretty uneventful compared to the previous weeks, which I know can be a bad sign. I still however feel like someone is watching me, but not as much as before. I&amp;#39;ll keep you guys updated if everything dies down or if I&amp;#39;m barely in the eye of the storm.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A little more than a week ago I posted the story of my abnormal experiences in my house. Today I'm just going to talk about a few things that have happened since that time. Right after publishing the post I got up and my sister came into my room to tell me something. An this day I was wearing a rather loose shirt that the back part had somehow gotten into my shorts. As my sister was telling me something I felt someone or something pull my shirt from my shorts. I was confused as I turned around and saw nothing. I was standing right in front of a big mirror and hadn't seen anyone there. A couple days later I started having weird coincidences happening to me. Whether it  be me singing a song in my head and my friend or family starting to sing the song or me thinking of a topic I hadn't thought about in years and suddenly seeing an ad or someone talking about it. I had never heard anything about this happening to people who have been going through paranormal stuff. I've kind of just brushed it off, but it's still in the back of my mind.  I've still had trouble falling asleep and hearing noises in my house. However the loud crashes have suddenly stopped. I don't know whether to be relieved or scared. I also haven't been waking up at weird hours of the night. This past week has been pretty uneventful compared to the previous weeks, which I know can be a bad sign. I still however feel like someone is watching me, but not as much as before. I'll keep you guys updated if everything dies down or if I'm barely in the eye of the storm.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ukj3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "aimeeluna", "saved": false, "mod_reports": [], "name": "t3_64ukj3", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64ukj3/paranormal_experiences_in_my_house_update/", "num_reports": null, "locked": false, "stickied": false, "created": 1491982239.0, "url": "https://www.reddit.com/r/Paranormal/comments/64ukj3/paranormal_experiences_in_my_house_update/", "author_flair_text": null, "quarantine": false, "title": "Paranormal Experiences in my House Update", "created_utc": 1491953439.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ukj3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ukj3", "likes": null, "replies": "", "user_reports": [], "id": "dg72avf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aimeeluna", "parent_id": "t1_dg5iugl", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "It has been switching between weathers here in SF, however the bangs and creaking is a year round thing and has been ever since I moved into this house around 7 years ago ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It has been switching between weathers here in SF, however the bangs and creaking is a year round thing and has been ever since I moved into this house around 7 years ago &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg72avf", "score_hidden": false, "stickied": false, "created": 1492082265.0, "created_utc": 1492053465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5iugl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Philario", "parent_id": "t3_64ukj3", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Here in the mid-Atlantic US it's finally getting warmer.  If the weather is changing in your area, the bangs could be the house settling.\n\nMy parents' house was built in 1975, so it's (believe it or not) considered modern.  Sometimes it sounded like something fell on the roof.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here in the mid-Atlantic US it&amp;#39;s finally getting warmer.  If the weather is changing in your area, the bangs could be the house settling.&lt;/p&gt;\n\n&lt;p&gt;My parents&amp;#39; house was built in 1975, so it&amp;#39;s (believe it or not) considered modern.  Sometimes it sounded like something fell on the roof.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5iugl", "score_hidden": false, "stickied": false, "created": 1492003737.0, "created_utc": 1491974937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ukj3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ukj3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ukj3", "likes": null, "replies": "", "user_reports": [], "id": "dg7q6a1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hapi27", "parent_id": "t1_dg72gi8", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "That is very true as well, been there and have had to take measures on it. However,  it depends on the entity you're ignoring as well and what they want. Some will go away, some will get nasty, and some will just hang around, some do other things. It all depends but, ignoring them is still a choice you can make. Communication can be just as annoying on the other hand. Depending on how you go about it, and what you say and do, you could still be opening the same can of worms. Both sides have risk, and being aware of that is important.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is very true as well, been there and have had to take measures on it. However,  it depends on the entity you&amp;#39;re ignoring as well and what they want. Some will go away, some will get nasty, and some will just hang around, some do other things. It all depends but, ignoring them is still a choice you can make. Communication can be just as annoying on the other hand. Depending on how you go about it, and what you say and do, you could still be opening the same can of worms. Both sides have risk, and being aware of that is important.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7q6a1", "score_hidden": false, "stickied": false, "created": 1492126917.0, "created_utc": 1492098117.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72gi8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "StormWing0", "parent_id": "t1_dg66o86", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "There's a problem with the idea of ignoring certain entities.  They can sometimes make dead sure that you can't ignore them.  Most will just leave you be if you put them on ignore though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a problem with the idea of ignoring certain entities.  They can sometimes make dead sure that you can&amp;#39;t ignore them.  Most will just leave you be if you put them on ignore though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg72gi8", "score_hidden": false, "stickied": false, "created": 1492082488.0, "created_utc": 1492053688.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ukj3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64ukj3", "likes": null, "replies": "", "user_reports": [], "id": "dg7prm6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hapi27", "parent_id": "t1_dg72h55", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "It's possible for abilities to run in families. My family are all seers and can see and hear spirits mostly women but some of the men have it too. Also, the abilities can manifest at any point in your life, I was a young kid but there are also people who don't experience things until they are full adults. Its possible that the abilities just became more noticeable as you've gotten older as well. Sidenote: Happy Birthday.\n\nIt would be entirely up to you to communicate with the spirit and yeah, there is a chance it could be harmful. With that in mind, I'd do some research on protection, before doing anything. I wouldn't recommend any spirit boarding or anything like that. Maybe just try talking, and I do mean out loud. Acknowledge them and see what they want. Look into spirit protection first though, talismans are helpful in this so if you're religious in any faith that can be used as one or you could make one. Doesn't have to be anything fancy.\n ", "edited": 1492098255.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s possible for abilities to run in families. My family are all seers and can see and hear spirits mostly women but some of the men have it too. Also, the abilities can manifest at any point in your life, I was a young kid but there are also people who don&amp;#39;t experience things until they are full adults. Its possible that the abilities just became more noticeable as you&amp;#39;ve gotten older as well. Sidenote: Happy Birthday.&lt;/p&gt;\n\n&lt;p&gt;It would be entirely up to you to communicate with the spirit and yeah, there is a chance it could be harmful. With that in mind, I&amp;#39;d do some research on protection, before doing anything. I wouldn&amp;#39;t recommend any spirit boarding or anything like that. Maybe just try talking, and I do mean out loud. Acknowledge them and see what they want. Look into spirit protection first though, talismans are helpful in this so if you&amp;#39;re religious in any faith that can be used as one or you could make one. Doesn&amp;#39;t have to be anything fancy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7prm6", "score_hidden": false, "stickied": false, "created": 1492126488.0, "created_utc": 1492097688.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72h55", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aimeeluna", "parent_id": "t1_dg66o86", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "With the mention of the physic abilities, is it possible to be passed down? I know my mom often has dreams and then her dreams will become reality soon enough. I had never had these experiences in my life and I find it weird that it's barely happening now that I just recently (two months ago) turned 16. I have also often noticed that most of the time I am the only one noticing weird things. And only one of my friends have felt the same feeling of something or someone being present at my house. Would trying to communicate with the possible spirits be harmful?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With the mention of the physic abilities, is it possible to be passed down? I know my mom often has dreams and then her dreams will become reality soon enough. I had never had these experiences in my life and I find it weird that it&amp;#39;s barely happening now that I just recently (two months ago) turned 16. I have also often noticed that most of the time I am the only one noticing weird things. And only one of my friends have felt the same feeling of something or someone being present at my house. Would trying to communicate with the possible spirits be harmful?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg72h55", "score_hidden": false, "stickied": false, "created": 1492082513.0, "created_utc": 1492053713.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66o86", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hapi27", "parent_id": "t3_64ukj3", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Have you considered the possibility that you're just more sensitive to the experiences than others? In the case of your coincidences you may be able to more clearly sense these things, and may just be experiencing the manifestations of your psychic abilities. I would recommend looking into it. In your house however, its possible someone is trying to communicate with you, some spirits can be aware of your awareness. Its up to you whether you want to talk to them or not. You could always ignore them, but I would look into your psychic experiences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered the possibility that you&amp;#39;re just more sensitive to the experiences than others? In the case of your coincidences you may be able to more clearly sense these things, and may just be experiencing the manifestations of your psychic abilities. I would recommend looking into it. In your house however, its possible someone is trying to communicate with you, some spirits can be aware of your awareness. Its up to you whether you want to talk to them or not. You could always ignore them, but I would look into your psychic experiences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg66o86", "score_hidden": false, "stickied": false, "created": 1492045986.0, "created_utc": 1492017186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]