[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this happened when I was around 13, I told my family and my friends about it at the time and they still bring it up occasionally, but I&amp;#39;ve generally tried to forget it and still question if what I think I saw was real. &lt;/p&gt;\n\n&lt;p&gt;Okay so at the time, in the street I lived in, there was this abandoned police station. It had offices and a brake room and even cells. And as early teenagers, my friends and I went wild and transformed the derelict into our club house, moving couches and games in and drawing all over the walls. There were a lot of other children in my street and as the police station was so close it became the default hang out for us; if you wanted to hang out you&amp;#39;d just walk to the station rather then to one of your friends houses. The building was very dark as it had no power and most of its windows were smashed, it was a dump, but none of us were ever scared or paranoid there as we were so used to it. &lt;/p&gt;\n\n&lt;p&gt;So this insistent happened, like I said, when I was around 13. One morning at around 10 I walked to the abandoned police station to see if my friends were already there. When I arrived I called out and looked through the building, but it was empty. For a while I screwed around in one room at the back which was our main hangout with the couches. After I&amp;#39;d been in the building for maybe 5 minutes I heard some sort of creaking shifting sound, like floorboards straining or your house creaking in the wind. It was coming from the front of the building and I immediately assumed it was my friends arriving. I followed the noise towards some small office rooms near the main entrance.&lt;/p&gt;\n\n&lt;p&gt;When I turned into the room I was met with a shadow person, textbook definition; figure of a human, no details, blacker then black. However unlike most shadow person encounters it wasn&amp;#39;t hidden in my peripheral vision, it was standing, perfectly still, about two meters in front of me. It was very tall and although it had no face I felt like it was looking at me. I was so shocked that I seemed to freeze, just staring at it for what felt like minutes but would have only been a handful of seconds. At this point my eyes were watering out of fear, I snapped out of my shocked daze when the shadow person moved its leg and started to step towards me. With this I instantly turned and fled, sprinting through the derelict and not looking back. Once I was outside I looked back and saw it standing just inside the doorway, in this entrance foyer. It was still and facing me like it was before. &lt;/p&gt;\n\n&lt;p&gt;I went strait to my main friend&amp;#39;s place and told him, slept there the night too. Most of my friends believed me but plenty said I was full of shit. My mother could see I was scarred but just thought I&amp;#39;d gotten myself paranoid. My friends and I went back to the building eventually, and we didn&amp;#39;t find anything out of the ordinary, a few years later it was brought and renovated into a home. To this day I doubt what happened, thinking logically I tell myself I was just an overly imaginative child, but it felt so real and vivid and out of the blue. &lt;/p&gt;\n\n&lt;p&gt;Another thing I distinctly remember was this feeling I got when I looked at it. It was a feeling of personhood, I was terrified and horrified but IT gave me this feeling that it was, or used to be, human. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this happened when I was around 13, I told my family and my friends about it at the time and they still bring it up occasionally, but I've generally tried to forget it and still question if what I think I saw was real. \n\nOkay so at the time, in the street I lived in, there was this abandoned police station. It had offices and a brake room and even cells. And as early teenagers, my friends and I went wild and transformed the derelict into our club house, moving couches and games in and drawing all over the walls. There were a lot of other children in my street and as the police station was so close it became the default hang out for us; if you wanted to hang out you'd just walk to the station rather then to one of your friends houses. The building was very dark as it had no power and most of its windows were smashed, it was a dump, but none of us were ever scared or paranoid there as we were so used to it. \n\nSo this insistent happened, like I said, when I was around 13. One morning at around 10 I walked to the abandoned police station to see if my friends were already there. When I arrived I called out and looked through the building, but it was empty. For a while I screwed around in one room at the back which was our main hangout with the couches. After I'd been in the building for maybe 5 minutes I heard some sort of creaking shifting sound, like floorboards straining or your house creaking in the wind. It was coming from the front of the building and I immediately assumed it was my friends arriving. I followed the noise towards some small office rooms near the main entrance.\n\nWhen I turned into the room I was met with a shadow person, textbook definition; figure of a human, no details, blacker then black. However unlike most shadow person encounters it wasn't hidden in my peripheral vision, it was standing, perfectly still, about two meters in front of me. It was very tall and although it had no face I felt like it was looking at me. I was so shocked that I seemed to freeze, just staring at it for what felt like minutes but would have only been a handful of seconds. At this point my eyes were watering out of fear, I snapped out of my shocked daze when the shadow person moved its leg and started to step towards me. With this I instantly turned and fled, sprinting through the derelict and not looking back. Once I was outside I looked back and saw it standing just inside the doorway, in this entrance foyer. It was still and facing me like it was before. \n\nI went strait to my main friend's place and told him, slept there the night too. Most of my friends believed me but plenty said I was full of shit. My mother could see I was scarred but just thought I'd gotten myself paranoid. My friends and I went back to the building eventually, and we didn't find anything out of the ordinary, a few years later it was brought and renovated into a home. To this day I doubt what happened, thinking logically I tell myself I was just an overly imaginative child, but it felt so real and vivid and out of the blue. \n\nAnother thing I distinctly remember was this feeling I got when I looked at it. It was a feeling of personhood, I was terrified and horrified but IT gave me this feeling that it was, or used to be, human. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64win0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 48, "report_reasons": null, "author": "MarcelusWalrus", "saved": false, "mod_reports": [], "name": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492092064.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64win0/childhood_encounter_with_a_shadow_person/", "num_reports": null, "locked": false, "stickied": false, "created": 1492007269.0, "url": "https://www.reddit.com/r/Paranormal/comments/64win0/childhood_encounter_with_a_shadow_person/", "author_flair_text": null, "quarantine": false, "title": "Childhood encounter with a shadow person", "created_utc": 1491978469.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 30, "visited": false, "subreddit_type": "public", "ups": 48}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7c03a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "alwystired", "parent_id": "t1_dg7bk14", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I understand. I had to suspend my total disbelief in my case. Even Though I prefer to dismiss things that have other possible explanations, and there is a slim chance I hallucinated. It becomes extremely improbable because of my having never hallucinated, to my knowledge, before or since.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand. I had to suspend my total disbelief in my case. Even Though I prefer to dismiss things that have other possible explanations, and there is a slim chance I hallucinated. It becomes extremely improbable because of my having never hallucinated, to my knowledge, before or since.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7c03a", "score_hidden": false, "stickied": false, "created": 1492102705.0, "created_utc": 1492073905.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bk14", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg5o7i1", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "My experience also dramatically changed what I believe to be true, however I have not been as strongly convinced as you. I believe that I did see what I saw, I just question if what I saw was actually true. After this I am still an atheist and while the experience stoped be from being a sceptic I still do not fully believe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My experience also dramatically changed what I believe to be true, however I have not been as strongly convinced as you. I believe that I did see what I saw, I just question if what I saw was actually true. After this I am still an atheist and while the experience stoped be from being a sceptic I still do not fully believe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7bk14", "score_hidden": false, "stickied": false, "created": 1492101337.0, "created_utc": 1492072537.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5o7i1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "alwystired", "parent_id": "t1_dg5la2c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I saw one, straight on in a fairly well lit room. I was looking right at it for an extended period of time. I didn't see mine move, but it was a man shaped shadow that appeared and eventually disappeared. That encounter is what changed me from a hard-core skeptic to a believer. I'm an atheist and I did not believe these thing existed, if science can't explain it I was sure it didn't exist. I was wrong ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw one, straight on in a fairly well lit room. I was looking right at it for an extended period of time. I didn&amp;#39;t see mine move, but it was a man shaped shadow that appeared and eventually disappeared. That encounter is what changed me from a hard-core skeptic to a believer. I&amp;#39;m an atheist and I did not believe these thing existed, if science can&amp;#39;t explain it I was sure it didn&amp;#39;t exist. I was wrong &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5o7i1", "score_hidden": false, "stickied": false, "created": 1492018244.0, "created_utc": 1491989444.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7b62j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg5ubj8", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I can imagine how horrifying that would be, in greatfull that my encounter didn't happen in my home. Thank you for sharing your story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can imagine how horrifying that would be, in greatfull that my encounter didn&amp;#39;t happen in my home. Thank you for sharing your story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7b62j", "score_hidden": false, "stickied": false, "created": 1492100179.0, "created_utc": 1492071379.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg6jiud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "uncanny27", "parent_id": "t1_dg5ubj8", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 1, "body": "Dyslexia doesn't prevent the use of punctuation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dyslexia doesn&amp;#39;t prevent the use of punctuation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6jiud", "score_hidden": false, "stickied": false, "created": 1492059161.0, "created_utc": 1492030361.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ubj8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "So72surreal", "parent_id": "t1_dg5la2c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Iv had three encounters with shadow people the third time was the worst I told my bf there was there he couldn't see them I was panicking so I said let's go walk our dogs to get out the house it was bout 2am so when I got back from the walk with dogs the shadow people are still in my bedroom an six hours later there were gone this is 100 true sorry bout my spelling im dyslexic I was and still am shocked they was still there when I got back I hope I never see shadow people ever again", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Iv had three encounters with shadow people the third time was the worst I told my bf there was there he couldn&amp;#39;t see them I was panicking so I said let&amp;#39;s go walk our dogs to get out the house it was bout 2am so when I got back from the walk with dogs the shadow people are still in my bedroom an six hours later there were gone this is 100 true sorry bout my spelling im dyslexic I was and still am shocked they was still there when I got back I hope I never see shadow people ever again&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5ubj8", "score_hidden": false, "stickied": false, "created": 1492031872.0, "created_utc": 1492003072.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7b8i3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg6prjq", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Wow that would be horrific to have them latch onto you and follow such distances. \nThat description matches what I saw quite well, and I find the demon argument very compelling as I remember the feeling of dread and evil I felt when I looked at it. \nBut to have multiple entities follow you and actively abuse you would be so debilitating, I'm glad your free of that now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow that would be horrific to have them latch onto you and follow such distances. \nThat description matches what I saw quite well, and I find the demon argument very compelling as I remember the feeling of dread and evil I felt when I looked at it. \nBut to have multiple entities follow you and actively abuse you would be so debilitating, I&amp;#39;m glad your free of that now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7b8i3", "score_hidden": false, "stickied": false, "created": 1492100380.0, "created_utc": 1492071580.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6prjq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jinalaska", "parent_id": "t1_dg5la2c", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I apologize for the choppy nature of this comment, I just don't like to dwell in case I accidentally kinda invite them back or whatever, but for about two years (from 14 until almost seventeen) there were probably at least three that tended to follow me around. They were in both my schools (I got kicked out and moved to Alaska so they followed across state lines even), followed me to work, and obviously were home with me in both homes. My step mother (a few months before they went away) said she never saw them, but she dreamt about them a lot and they touched her and she felt heir presence. They were not nice. They'd taunt me, shake my bed to the point other people heard it (sometimes they wouldn't), 'punk'-shove me, hold parts of my body, and be generally threatening to me and those around me. I saw them day and night and they weren't scared to be seen. They generally looked like No-Face from Spirited away, but only if No-Face wore no mask. They had no features and their arms/legs would kinda go back into their shadowy body. The last time I noticed them I was in my bedroom trying to sleep and they got really bad, but then a fourth entity (I had my eyes closed and didn't want to look) started getting very close to me and felt as though it was trying to hold/comfort me. I fell asleep shortly after trying to ignore the fourth one, and they didn't come back after that I can distinctly recall. \n\nMy step-mother believed they were demons that either chose not to fully manifest, or couldn't properly. And no, I did not play with a ouija board or anything like that, I was just in a very dark part, just as most angsty 15 year old girls are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I apologize for the choppy nature of this comment, I just don&amp;#39;t like to dwell in case I accidentally kinda invite them back or whatever, but for about two years (from 14 until almost seventeen) there were probably at least three that tended to follow me around. They were in both my schools (I got kicked out and moved to Alaska so they followed across state lines even), followed me to work, and obviously were home with me in both homes. My step mother (a few months before they went away) said she never saw them, but she dreamt about them a lot and they touched her and she felt heir presence. They were not nice. They&amp;#39;d taunt me, shake my bed to the point other people heard it (sometimes they wouldn&amp;#39;t), &amp;#39;punk&amp;#39;-shove me, hold parts of my body, and be generally threatening to me and those around me. I saw them day and night and they weren&amp;#39;t scared to be seen. They generally looked like No-Face from Spirited away, but only if No-Face wore no mask. They had no features and their arms/legs would kinda go back into their shadowy body. The last time I noticed them I was in my bedroom trying to sleep and they got really bad, but then a fourth entity (I had my eyes closed and didn&amp;#39;t want to look) started getting very close to me and felt as though it was trying to hold/comfort me. I fell asleep shortly after trying to ignore the fourth one, and they didn&amp;#39;t come back after that I can distinctly recall. &lt;/p&gt;\n\n&lt;p&gt;My step-mother believed they were demons that either chose not to fully manifest, or couldn&amp;#39;t properly. And no, I did not play with a ouija board or anything like that, I was just in a very dark part, just as most angsty 15 year old girls are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6prjq", "score_hidden": false, "stickied": false, "created": 1492066643.0, "created_utc": 1492037843.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5la2c", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "If anyone else has had experiences with shadowpeople were they were chased or the shadowperson wasn't hidden I'd love to hear about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If anyone else has had experiences with shadowpeople were they were chased or the shadowperson wasn&amp;#39;t hidden I&amp;#39;d love to hear about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5la2c", "score_hidden": false, "stickied": false, "created": 1492009446.0, "created_utc": 1491980646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7bpdd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "itsxsasha", "parent_id": "t1_dg7b9ec", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Yeah they can be quite persistent when they wanna be. Also they can be menacing which is a pain because you never know how long they'll hang around for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah they can be quite persistent when they wanna be. Also they can be menacing which is a pain because you never know how long they&amp;#39;ll hang around for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7bpdd", "score_hidden": false, "stickied": false, "created": 1492101798.0, "created_utc": 1492072998.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b9ec", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg5n67n", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "God having an entity follow you or abuse you is such a scary prospect, this makes me greatful I only experienced a one off encounter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God having an entity follow you or abuse you is such a scary prospect, this makes me greatful I only experienced a one off encounter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7b9ec", "score_hidden": false, "stickied": false, "created": 1492100456.0, "created_utc": 1492071656.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5n67n", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "itsxsasha", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "My experiences with shadow people were frequent at university. I found them to be very invasive in a passive way. My experience with them wasn't as clear as your describing (standing clear as day in front of you) but instead the standing in a corner, watching you, moving slowly towards you. Mine have always happened at night time and unfortunately due to my university campus being a hot bed of strange activity was usually hard to know if they were drawn to me or just so happened to be the area. Since moving to a larger city I haven't had any experiences with shadow people here. But one did follow my flatmate back to Canada.. which was difficult for her because it was very insistent on being awful to her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My experiences with shadow people were frequent at university. I found them to be very invasive in a passive way. My experience with them wasn&amp;#39;t as clear as your describing (standing clear as day in front of you) but instead the standing in a corner, watching you, moving slowly towards you. Mine have always happened at night time and unfortunately due to my university campus being a hot bed of strange activity was usually hard to know if they were drawn to me or just so happened to be the area. Since moving to a larger city I haven&amp;#39;t had any experiences with shadow people here. But one did follow my flatmate back to Canada.. which was difficult for her because it was very insistent on being awful to her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5n67n", "score_hidden": false, "stickied": false, "created": 1492014957.0, "created_utc": 1491986157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7bac3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg60l3i", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "This really interests me, were you given any specifics as to why they were dangerous or what would happen if you were to get involved with them?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This really interests me, were you given any specifics as to why they were dangerous or what would happen if you were to get involved with them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7bac3", "score_hidden": false, "stickied": false, "created": 1492100531.0, "created_utc": 1492071731.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60l3i", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DJysyed", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I had a dream I was friends with a Shadow person. The advice I received from numerous mediums and psychics was: don't get yourself involved with them", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a dream I was friends with a Shadow person. The advice I received from numerous mediums and psychics was: don&amp;#39;t get yourself involved with them&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg60l3i", "score_hidden": false, "stickied": false, "created": 1492039535.0, "created_utc": 1492010735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg67oe8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "georgeananda", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Good story. So many good shadow person stories in the human experience that I am a believer in the likelihood that it is indeed something from the ghostly realm.\n\nGot to love this universe of ours!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good story. So many good shadow person stories in the human experience that I am a believer in the likelihood that it is indeed something from the ghostly realm.&lt;/p&gt;\n\n&lt;p&gt;Got to love this universe of ours!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg67oe8", "score_hidden": false, "stickied": false, "created": 1492046993.0, "created_utc": 1492018193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7jh4f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rangermatthias", "parent_id": "t1_dg603r5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Oh yeah, I've read quite a bit on hat men and shadow people. Very interesting stuff. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yeah, I&amp;#39;ve read quite a bit on hat men and shadow people. Very interesting stuff. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7jh4f", "score_hidden": false, "stickied": false, "created": 1492119081.0, "created_utc": 1492090281.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg603r5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "chiefoftheworld", "parent_id": "t1_dg5vq1x", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "What your uncle had in his house is what is commonly known as \"Hat Man\". There are many stories on this sub about Hat Man you could read if you're interested. Also I love your idea about OP going back to the house that was built on the old police station and talking with the new owners. If they're having shadow people experiences and they don't know what they're dealing with it might bring them some comfort knowing they are not crazy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What your uncle had in his house is what is commonly known as &amp;quot;Hat Man&amp;quot;. There are many stories on this sub about Hat Man you could read if you&amp;#39;re interested. Also I love your idea about OP going back to the house that was built on the old police station and talking with the new owners. If they&amp;#39;re having shadow people experiences and they don&amp;#39;t know what they&amp;#39;re dealing with it might bring them some comfort knowing they are not crazy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg603r5", "score_hidden": false, "stickied": false, "created": 1492039007.0, "created_utc": 1492010207.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7bc8j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg5vq1x", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I actually casually know the son that lives there now, although I haven't  spoken to him since high school. I'm considering contacting him about this, good idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually casually know the son that lives there now, although I haven&amp;#39;t  spoken to him since high school. I&amp;#39;m considering contacting him about this, good idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7bc8j", "score_hidden": false, "stickied": false, "created": 1492100682.0, "created_utc": 1492071882.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vq1x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Rangermatthias", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Have you attempted to contact the people who live there now?\n\nYou might be just the person to answer some weird questions they may be having.\n\nMy uncles house had a shadow person in it. I saw it twice - looked like it wore a trench coat or robe, maybe a large cape. And wore something like a fedora.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you attempted to contact the people who live there now?&lt;/p&gt;\n\n&lt;p&gt;You might be just the person to answer some weird questions they may be having.&lt;/p&gt;\n\n&lt;p&gt;My uncles house had a shadow person in it. I saw it twice - looked like it wore a trench coat or robe, maybe a large cape. And wore something like a fedora.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5vq1x", "score_hidden": false, "stickied": false, "created": 1492033823.0, "created_utc": 1492005023.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg6d5ob", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sailordoom21", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "When i was a little girl i woke up early (i dont know why) for school. I was just laying in bed so my bed was infront of the door. I was laying there for a while just staring down the hallway and i see these two figures one a male and the other a female. They were walking down the hallway toward me. They were walking really slow but i remember i couldnt move. They were super close to my doorway just walking toward me and as soon as they got to my door way my dad came out of his room, turned the hall light on and woke me up for school. I've been seeing some shit since age 4 ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When i was a little girl i woke up early (i dont know why) for school. I was just laying in bed so my bed was infront of the door. I was laying there for a while just staring down the hallway and i see these two figures one a male and the other a female. They were walking down the hallway toward me. They were walking really slow but i remember i couldnt move. They were super close to my doorway just walking toward me and as soon as they got to my door way my dad came out of his room, turned the hall light on and woke me up for school. I&amp;#39;ve been seeing some shit since age 4 &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6d5ob", "score_hidden": false, "stickied": false, "created": 1492052587.0, "created_utc": 1492023787.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7bgsq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg6n7k8", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thanks for linking to the story of your encounters. From the research I've done I also think that 'multidimensional beings that feed off fear' is the strongest explanation. \nWhat makes me curious is how what we think of a 'shadow people' can vary so much in appearance. The one entity I saw did not have visible eyes like yours, and others still describe what's called 'the hat man' with clear clothing. I wonder what this means and if these are the same beings and how they are related. \nI'm glad to hear your not being harassed by them any longer.", "edited": 1492091706.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for linking to the story of your encounters. From the research I&amp;#39;ve done I also think that &amp;#39;multidimensional beings that feed off fear&amp;#39; is the strongest explanation. \nWhat makes me curious is how what we think of a &amp;#39;shadow people&amp;#39; can vary so much in appearance. The one entity I saw did not have visible eyes like yours, and others still describe what&amp;#39;s called &amp;#39;the hat man&amp;#39; with clear clothing. I wonder what this means and if these are the same beings and how they are related. \nI&amp;#39;m glad to hear your not being harassed by them any longer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7bgsq", "score_hidden": false, "stickied": false, "created": 1492101061.0, "created_utc": 1492072261.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6n7k8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jackjmil64", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I have had related experiences.  See my post Red Eyes Rising in r/shadowpeople.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have had related experiences.  See my post Red Eyes Rising in &lt;a href=\"/r/shadowpeople\"&gt;r/shadowpeople&lt;/a&gt;.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6n7k8", "score_hidden": false, "stickied": false, "created": 1492063472.0, "created_utc": 1492034672.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg72mv6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pliny79", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've never seen one myself, but my wife has twice in the same house that we use to live in. She saw what looked like a tall man, but with no features, look into the room she was in. As soon as she turned to look at it, it would move back out into the hallway. One of my sisters was visiting and saw it once too. We didn't tell her about it till she told us about her experience. Wish I could have seen it. Like I said never did, but I sure did hear a lot in that house. Creepy place! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never seen one myself, but my wife has twice in the same house that we use to live in. She saw what looked like a tall man, but with no features, look into the room she was in. As soon as she turned to look at it, it would move back out into the hallway. One of my sisters was visiting and saw it once too. We didn&amp;#39;t tell her about it till she told us about her experience. Wish I could have seen it. Like I said never did, but I sure did hear a lot in that house. Creepy place! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg72mv6", "score_hidden": false, "stickied": false, "created": 1492082734.0, "created_utc": 1492053934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg7b523", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarcelusWalrus", "parent_id": "t1_dg7586w", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Yeah no I didn't have a traumatic childhood and never experienced anything else legitimately paranormal, so it's not like I manifested it out of trauma or anything. \n\nAnd yeah 10am. I took note of that because it was such an unusual time for paranormal activity. I can't bring any specifics of the wether to mind but I tried at the time to commit the details to memory so that makes me think that is anything the wether was normal and unremarkable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah no I didn&amp;#39;t have a traumatic childhood and never experienced anything else legitimately paranormal, so it&amp;#39;s not like I manifested it out of trauma or anything. &lt;/p&gt;\n\n&lt;p&gt;And yeah 10am. I took note of that because it was such an unusual time for paranormal activity. I can&amp;#39;t bring any specifics of the wether to mind but I tried at the time to commit the details to memory so that makes me think that is anything the wether was normal and unremarkable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7b523", "score_hidden": false, "stickied": false, "created": 1492100096.0, "created_utc": 1492071296.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7586w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fortevn", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "From your story I don't feel like it was you being paranoid or any kind of imagination. Those would need a foundation and a trigger. What you said that you were perfectly fine, having a normal past so it shouldn't be easy for your brain to shoot that up randomly.\n\nBut 10 AM? That is weird, can you remember the weather back then? The only way I can think of it to be possible is it to be extremely sunny.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From your story I don&amp;#39;t feel like it was you being paranoid or any kind of imagination. Those would need a foundation and a trigger. What you said that you were perfectly fine, having a normal past so it shouldn&amp;#39;t be easy for your brain to shoot that up randomly.&lt;/p&gt;\n\n&lt;p&gt;But 10 AM? That is weird, can you remember the weather back then? The only way I can think of it to be possible is it to be extremely sunny.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7586w", "score_hidden": false, "stickied": false, "created": 1492086631.0, "created_utc": 1492057831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg96r8x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dudareeno", "parent_id": "t1_dg7kh7o", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "What is this hat man? I've seen these shadows but not really in the shape of people, just when they're lurking away into the shadows. I have seen them up close, can't tell if it's liquid or smoke, but in unhuman shapes. I have seen a shadow man with a wide brim hat. Woke up and he was in my room, he didn't give me any bad feelings though. He was darker than the darkness but seemed to be well dressed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is this hat man? I&amp;#39;ve seen these shadows but not really in the shape of people, just when they&amp;#39;re lurking away into the shadows. I have seen them up close, can&amp;#39;t tell if it&amp;#39;s liquid or smoke, but in unhuman shapes. I have seen a shadow man with a wide brim hat. Woke up and he was in my room, he didn&amp;#39;t give me any bad feelings though. He was darker than the darkness but seemed to be well dressed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg96r8x", "score_hidden": false, "stickied": false, "created": 1492208576.0, "created_utc": 1492179776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kh7o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jackjmil64", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thanks!  Yes it's very interesting how they seem to have around three possible forms they take. From what I've read – and I've read a lot – hat man seems to be more senior in ranking. When people see multiple types at once the hat man will take the lead and sometimes even direct the others.  In terms of the red eyes, those seem to be the exception. Most people just see the dark form.  My guess is that they're definitely related but of course I have no idea for sure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!  Yes it&amp;#39;s very interesting how they seem to have around three possible forms they take. From what I&amp;#39;ve read – and I&amp;#39;ve read a lot – hat man seems to be more senior in ranking. When people see multiple types at once the hat man will take the lead and sometimes even direct the others.  In terms of the red eyes, those seem to be the exception. Most people just see the dark form.  My guess is that they&amp;#39;re definitely related but of course I have no idea for sure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7kh7o", "score_hidden": false, "stickied": false, "created": 1492120397.0, "created_utc": 1492091597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg5uqt7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "So72surreal", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "They are very real they must be why would  I have seen these creepy Id say evil dark shadow I never want to see again three times is enough to fuck your head up", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They are very real they must be why would  I have seen these creepy Id say evil dark shadow I never want to see again three times is enough to fuck your head up&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg5uqt7", "score_hidden": false, "stickied": false, "created": 1492032485.0, "created_utc": 1492003685.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg977lf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dudareeno", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "When I was young I was tortured by something. Wasn't until I was 13 I decided to believe in myself and ignore the asshole adults that never believed me. I remember it, what happened, there are no explanations in mainstream but I am not crazy or have an over-active imagination or whatever bs other people tried to make me believe because of their fear or doubt. A shadow used to come in to my room at night. It changed in sizes but was always in the shape of a diamond. It would float but moved like ink under water. I could never tell if it was smoke or water, more like a balance of black ink-water-smoke that would ripple and catch light oddly from a source not in the room. It seemed almost like smokey velvet. It would fk with me during the day, it was pretty bold but usually only bothered me and would usually only show himself at night. After we moved out of that house from when I was 4-8 the house made the paper 3 months after we moved. It made the front page, it had almost burned down and the only room that burned was my room. I can never forget, it's really traumatizing, believe kids if they tell you these things. Especially if they're crying their guts out and screaming, don't be slow to act like my parents. He enjoyed my fear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was young I was tortured by something. Wasn&amp;#39;t until I was 13 I decided to believe in myself and ignore the asshole adults that never believed me. I remember it, what happened, there are no explanations in mainstream but I am not crazy or have an over-active imagination or whatever bs other people tried to make me believe because of their fear or doubt. A shadow used to come in to my room at night. It changed in sizes but was always in the shape of a diamond. It would float but moved like ink under water. I could never tell if it was smoke or water, more like a balance of black ink-water-smoke that would ripple and catch light oddly from a source not in the room. It seemed almost like smokey velvet. It would fk with me during the day, it was pretty bold but usually only bothered me and would usually only show himself at night. After we moved out of that house from when I was 4-8 the house made the paper 3 months after we moved. It made the front page, it had almost burned down and the only room that burned was my room. I can never forget, it&amp;#39;s really traumatizing, believe kids if they tell you these things. Especially if they&amp;#39;re crying their guts out and screaming, don&amp;#39;t be slow to act like my parents. He enjoyed my fear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg977lf", "score_hidden": false, "stickied": false, "created": 1492209176.0, "created_utc": 1492180376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64win0", "likes": null, "replies": "", "user_reports": [], "id": "dg9n2zh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NightPhoenix35", "parent_id": "t3_64win0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've had three: one was when I was very young, probably around 5 or 6? I saw two shadows in my bedroom and heard them talking, they were looking for something, but that's all I remember.  Another time, I was asleep, and woke up to one standing in my closet...I thought it was my husband so I asked what he was doing in the closet...I freaked when he answered from right next to me in bed and the shadow disappeared immediately after.  Both in the same room btw, the second story was about 20 years later visiting my parents.  The last is a bit darker: this was about 3 years ago, I had just found out I was pregnant, and I started seeing shadows out of the corner of my eye...shortly after, I lost the pregnancy and fell into depression.  I'm still skeptical of my experiences, I'm not entirely convinced since the first two could be explained by some kind of dream (I do have sleep paralysis after all), and the third could have been my imagination plus coincidence.  I'm going to need better evidence to even convince myself, but these are my experiences with the shadows. ", "edited": 1492199367.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had three: one was when I was very young, probably around 5 or 6? I saw two shadows in my bedroom and heard them talking, they were looking for something, but that&amp;#39;s all I remember.  Another time, I was asleep, and woke up to one standing in my closet...I thought it was my husband so I asked what he was doing in the closet...I freaked when he answered from right next to me in bed and the shadow disappeared immediately after.  Both in the same room btw, the second story was about 20 years later visiting my parents.  The last is a bit darker: this was about 3 years ago, I had just found out I was pregnant, and I started seeing shadows out of the corner of my eye...shortly after, I lost the pregnancy and fell into depression.  I&amp;#39;m still skeptical of my experiences, I&amp;#39;m not entirely convinced since the first two could be explained by some kind of dream (I do have sleep paralysis after all), and the third could have been my imagination plus coincidence.  I&amp;#39;m going to need better evidence to even convince myself, but these are my experiences with the shadows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg9n2zh", "score_hidden": false, "stickied": false, "created": 1492227876.0, "created_utc": 1492199076.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]