[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this happen to me about 10 years ago and stays with me vividly as one of the weirdest things i have experienced and i don&amp;#39;t usually believe in paranormal things . \nOur family were renovating a very old house in rural Australia (about 100yrs old) which we where about halfway through the renovation, we were staying in another small outhouse while doing the renovations but we had family and friends coming to stay with us so i had to forfeit my normal bedroom and stay in the main house in a tent as it was no where near ready to sleep in. All was well for most of the night until i woke around 3am to our working dogs about 200m away from the house going absolutely nuts barking at something but i usually didn&amp;#39;t pay much attention to them as kangaroos often jump near there kennels and set them off some nights. As there barking eventually come to a stop i could faintly hear a clear and crisp footsteps out of the room i was in and down the hallway getting louder and clearer slowly making its way towards my room, i didn&amp;#39;t think much of it at first but the direction the noise was coming from was so clear. The footsteps slowly made there way up the hallway and stopped what i thought to be the doorway to the room. I was locked up in complete fear as to what the F*3K was standing there in the door way and trying to figure what i could do and then it started moving again only this time straight towards my tent and stopped right next to it and i was waiting for the tent to start shaking but it only stopped for a brief second then walked into the corner of the room and stopped. The fear i felt at that moment kept me paralysed for what seemed an hour shitting myself and sweating as i had a blanket over me and was too afraid to move. After a while i eventually calmed down enough to get my light i had with me, open the zippers of the tent and look out to which i found nothing in the room so i climbed back into the tent and somehow managed to get back to sleep as i never heard anything more. In the morning i woke up fairly early and went back over to the little outhouse and tell my parents my story and asked them if they were just messing with me but they were adamant they didn&amp;#39;t do anything. To add to the strange noise of the footsteps there was loose floorboards all over the hallway floor drying out spaced tightly together getting ready to be put down in the coming weeks, so i decide to try and replicate the footstep noise but couldn&amp;#39;t as all the boards on the floor would move and make a completely different noise and couldn&amp;#39;t get any consistency to any of my steps. To this day i am still not sure what it was or if it was just my head playing tricks on me either way i now live in the house and have never heard anything similar since that night.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this happen to me about 10 years ago and stays with me vividly as one of the weirdest things i have experienced and i don't usually believe in paranormal things . \nOur family were renovating a very old house in rural Australia (about 100yrs old) which we where about halfway through the renovation, we were staying in another small outhouse while doing the renovations but we had family and friends coming to stay with us so i had to forfeit my normal bedroom and stay in the main house in a tent as it was no where near ready to sleep in. All was well for most of the night until i woke around 3am to our working dogs about 200m away from the house going absolutely nuts barking at something but i usually didn't pay much attention to them as kangaroos often jump near there kennels and set them off some nights. As there barking eventually come to a stop i could faintly hear a clear and crisp footsteps out of the room i was in and down the hallway getting louder and clearer slowly making its way towards my room, i didn't think much of it at first but the direction the noise was coming from was so clear. The footsteps slowly made there way up the hallway and stopped what i thought to be the doorway to the room. I was locked up in complete fear as to what the F*3K was standing there in the door way and trying to figure what i could do and then it started moving again only this time straight towards my tent and stopped right next to it and i was waiting for the tent to start shaking but it only stopped for a brief second then walked into the corner of the room and stopped. The fear i felt at that moment kept me paralysed for what seemed an hour shitting myself and sweating as i had a blanket over me and was too afraid to move. After a while i eventually calmed down enough to get my light i had with me, open the zippers of the tent and look out to which i found nothing in the room so i climbed back into the tent and somehow managed to get back to sleep as i never heard anything more. In the morning i woke up fairly early and went back over to the little outhouse and tell my parents my story and asked them if they were just messing with me but they were adamant they didn't do anything. To add to the strange noise of the footsteps there was loose floorboards all over the hallway floor drying out spaced tightly together getting ready to be put down in the coming weeks, so i decide to try and replicate the footstep noise but couldn't as all the boards on the floor would move and make a completely different noise and couldn't get any consistency to any of my steps. To this day i am still not sure what it was or if it was just my head playing tricks on me either way i now live in the house and have never heard anything similar since that night.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wwzi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "Sprocketj2k", "saved": false, "mod_reports": [], "name": "t3_64wwzi", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64wwzi/footsteps/", "num_reports": null, "locked": false, "stickied": false, "created": 1492014476.0, "url": "https://www.reddit.com/r/Paranormal/comments/64wwzi/footsteps/", "author_flair_text": null, "quarantine": false, "title": "Footsteps", "created_utc": 1491985676.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]