[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I started playing guitar two years ago and in particular, play metal. I&amp;#39;ve noticed that over these two years, I&amp;#39;ve become angrier and darker. In addition, I&amp;#39;ve had dreams where I feel that Jinns are after me and I met a few Jinns (human form but dressed up as soldiers from american revolution and were really friendly). I play incantations in the house whenever I feel like there is a demon in my house and it helps a lot since I feel normal for the next few months.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I started playing guitar two years ago and in particular, play metal. I've noticed that over these two years, I've become angrier and darker. In addition, I've had dreams where I feel that Jinns are after me and I met a few Jinns (human form but dressed up as soldiers from american revolution and were really friendly). I play incantations in the house whenever I feel like there is a demon in my house and it helps a lot since I feel normal for the next few months.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64yvpn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "DJysyed", "saved": false, "mod_reports": [], "name": "t3_64yvpn", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "c", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/64yvpn/correlation_between_paranormal_activity_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492040017.0, "url": "https://www.reddit.com/r/Paranormal/comments/64yvpn/correlation_between_paranormal_activity_and/", "author_flair_text": "Ghost Hunter", "quarantine": false, "title": "Correlation between paranormal activity and amount of music one plays?", "created_utc": 1492011217.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg6cr3d", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "reclusive_bob", "parent_id": "t1_dg66zkp", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "You're basically telling yourself that you aren't worthy of affection when you pretend you are someone you're not. I think you should seek professional help. Talking to someone can be very beneficial. I mean no disrespect but I've fought depression on my own -- hardest thing I've ever done. In hindsight, I should have asked for help. \n\nI wish you the best OP!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re basically telling yourself that you aren&amp;#39;t worthy of affection when you pretend you are someone you&amp;#39;re not. I think you should seek professional help. Talking to someone can be very beneficial. I mean no disrespect but I&amp;#39;ve fought depression on my own -- hardest thing I&amp;#39;ve ever done. In hindsight, I should have asked for help. &lt;/p&gt;\n\n&lt;p&gt;I wish you the best OP!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6cr3d", "score_hidden": false, "stickied": false, "created": 1492052167.0, "created_utc": 1492023367.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg679qf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EighthManBound", "parent_id": "t1_dg66zkp", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I don't have an easy answer for that, I'm afraid. But it sounds like you need to find a way to be with people who are more your type of people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have an easy answer for that, I&amp;#39;m afraid. But it sounds like you need to find a way to be with people who are more your type of people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg679qf", "score_hidden": false, "stickied": false, "created": 1492046587.0, "created_utc": 1492017787.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg7d7xe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fortevn", "parent_id": "t1_dg66zkp", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "How bad are they? The world isn't lack of people like you, who thought they're outcasts and wear disguises when interacting with others. There are chances that a portion of your social life is similar to you. Reveal bit by bit and see if anyone catch your signal. \n\nWhat /u/EighthManBound said was true. Although there are also cases that the music carries abnormal things, but it's usually very specific music that requires tons of factor to be met and shouldn't surface that easily. Something like \"Gloomy Sunday\", have you heard of that tale? In today time it doesn't do anything even if you're really listening, understanding and feeling the core of that song.\n\nMusic linked deeply to our mind, heart and soul. It's a tool that we've mastered the good uses. It's hard to get stray from that path, because humanity had trained themselves to seal it away. So play it with peace, and find positive things from it. Express your good feelings, even if they're tiny, like having a good drink. Amplify it with music, and be contented. \n\nI don't know about the Jinns to mention, are they from Islam? But you said they were friendly, so you for now shouldn't try to block them from your mind. But don't get too into them either. Keep a distance, like you would with other real people. When it comes to these beings, regardless if they're real or just imaginary, caution should be taken seriously.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How bad are they? The world isn&amp;#39;t lack of people like you, who thought they&amp;#39;re outcasts and wear disguises when interacting with others. There are chances that a portion of your social life is similar to you. Reveal bit by bit and see if anyone catch your signal. &lt;/p&gt;\n\n&lt;p&gt;What &lt;a href=\"/u/EighthManBound\"&gt;/u/EighthManBound&lt;/a&gt; said was true. Although there are also cases that the music carries abnormal things, but it&amp;#39;s usually very specific music that requires tons of factor to be met and shouldn&amp;#39;t surface that easily. Something like &amp;quot;Gloomy Sunday&amp;quot;, have you heard of that tale? In today time it doesn&amp;#39;t do anything even if you&amp;#39;re really listening, understanding and feeling the core of that song.&lt;/p&gt;\n\n&lt;p&gt;Music linked deeply to our mind, heart and soul. It&amp;#39;s a tool that we&amp;#39;ve mastered the good uses. It&amp;#39;s hard to get stray from that path, because humanity had trained themselves to seal it away. So play it with peace, and find positive things from it. Express your good feelings, even if they&amp;#39;re tiny, like having a good drink. Amplify it with music, and be contented. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know about the Jinns to mention, are they from Islam? But you said they were friendly, so you for now shouldn&amp;#39;t try to block them from your mind. But don&amp;#39;t get too into them either. Keep a distance, like you would with other real people. When it comes to these beings, regardless if they&amp;#39;re real or just imaginary, caution should be taken seriously.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7d7xe", "score_hidden": false, "stickied": false, "created": 1492106447.0, "created_utc": 1492077647.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66zkp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DJysyed", "parent_id": "t1_dg660e2", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Yeah my social life is great because I'm faking my personality and interests and what not. Haven't been able to reveal my true self to anyone and when I do, immediate social suicide", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah my social life is great because I&amp;#39;m faking my personality and interests and what not. Haven&amp;#39;t been able to reveal my true self to anyone and when I do, immediate social suicide&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg66zkp", "score_hidden": false, "stickied": false, "created": 1492046307.0, "created_utc": 1492017507.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg660e2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "EighthManBound", "parent_id": "t3_64yvpn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I remain neutral as to whether some of these things come from your mind or are attracted to something, but it will be you - not the music - that they're attracted to.\n\nIn metal terms, take Geezer Butler's experiences in the early days of Black Sabbath. He was the one deliberately dabbling in black magic, and he was the only one having the experiences. Music affects your state of mind. If you play music that gives you negative emotions, expect your negative state of mind to either attract entities or create negative mental experiences. Maybe play something that brings you joy as well.\n\nReally, though, I think some of these things ride on the back of depression. And it sounds like your general mental health isn't good right now. It might be a different factor in your life that you need to address to make you feel better, not the music.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remain neutral as to whether some of these things come from your mind or are attracted to something, but it will be you - not the music - that they&amp;#39;re attracted to.&lt;/p&gt;\n\n&lt;p&gt;In metal terms, take Geezer Butler&amp;#39;s experiences in the early days of Black Sabbath. He was the one deliberately dabbling in black magic, and he was the only one having the experiences. Music affects your state of mind. If you play music that gives you negative emotions, expect your negative state of mind to either attract entities or create negative mental experiences. Maybe play something that brings you joy as well.&lt;/p&gt;\n\n&lt;p&gt;Really, though, I think some of these things ride on the back of depression. And it sounds like your general mental health isn&amp;#39;t good right now. It might be a different factor in your life that you need to address to make you feel better, not the music.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg660e2", "score_hidden": false, "stickied": false, "created": 1492045315.0, "created_utc": 1492016515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg77t9a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "unsuscribe", "parent_id": "t3_64yvpn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "no, you just got older. Stop watching TV and read news and you will be much happier.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no, you just got older. Stop watching TV and read news and you will be much happier.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg77t9a", "score_hidden": false, "stickied": false, "created": 1492091401.0, "created_utc": 1492062601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg65xgf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hapi27", "parent_id": "t3_64yvpn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Music can affect your spirit, and its not a bad thing to get into your music. Its when you let the energy of the music you play get into you that poses a problem. You doing incantations to disperse the negative energies (it sounds like that's what you do at home) isn't a bad thing, it's a good idea actually. However, having a long term warding to keep the negative energy out could help this for longer periods of time. You could do something as simple as putting obsidian and fire agate (look up protection crystals) in the corners and window corners of your house. As for you, wear a protection talisman for a while and see if that helps keep those emotions at bay. \n\nMusic is quite spiritual, it makes you feel and can make you vulnerable to what you feel and react. Its a reason why trance is so effective while dancing to music or simply meditating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Music can affect your spirit, and its not a bad thing to get into your music. Its when you let the energy of the music you play get into you that poses a problem. You doing incantations to disperse the negative energies (it sounds like that&amp;#39;s what you do at home) isn&amp;#39;t a bad thing, it&amp;#39;s a good idea actually. However, having a long term warding to keep the negative energy out could help this for longer periods of time. You could do something as simple as putting obsidian and fire agate (look up protection crystals) in the corners and window corners of your house. As for you, wear a protection talisman for a while and see if that helps keep those emotions at bay. &lt;/p&gt;\n\n&lt;p&gt;Music is quite spiritual, it makes you feel and can make you vulnerable to what you feel and react. Its a reason why trance is so effective while dancing to music or simply meditating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg65xgf", "score_hidden": false, "stickied": false, "created": 1492045229.0, "created_utc": 1492016429.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg7k0kl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_64yvpn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "You play incantations?  What sorts of incantations? Because it has always been my understanding that incantations are used to conjure things up, and banishment spells are used to get rid of things.  I'm not criticizing, I really don't know if there's a difference here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You play incantations?  What sorts of incantations? Because it has always been my understanding that incantations are used to conjure things up, and banishment spells are used to get rid of things.  I&amp;#39;m not criticizing, I really don&amp;#39;t know if there&amp;#39;s a difference here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg7k0kl", "score_hidden": false, "stickied": false, "created": 1492119801.0, "created_utc": 1492091001.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg6sbqv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chiefoftheworld", "parent_id": "t1_dg6chi9", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I also believe Angels are musical beings. I have also read somewhere that the Angel Lucifer was created with musical instruments literally built into his body. At least before \"The Fall\", I don't know about now. He no longer goes by that name, but I would assume he still has musical talent. Maybe that would explain Ozzy and all the other \"satanic\" type bands. Just a thought. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also believe Angels are musical beings. I have also read somewhere that the Angel Lucifer was created with musical instruments literally built into his body. At least before &amp;quot;The Fall&amp;quot;, I don&amp;#39;t know about now. He no longer goes by that name, but I would assume he still has musical talent. Maybe that would explain Ozzy and all the other &amp;quot;satanic&amp;quot; type bands. Just a thought. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6sbqv", "score_hidden": false, "stickied": false, "created": 1492069813.0, "created_utc": 1492041013.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6chi9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "isthatyourmonkey", "parent_id": "t3_64yvpn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Angels are very musical beings, their love for it is proverbial. No reason not to expect the fallen ones to have musical interests too, but appealing to the baser emotions, rather than the higher.\n\nThe one time I used a ghost box, I was alone and drunk on the patio, grilling some steaks and listening to country music. I turned off the music, and turned on the ghost box; it immediately said loud-and-clear \"play the music.\" So I did, and we had a good time.\n\nI suggest you look into brainwave entrainment as a mood therapy.  I use Immrama Institute's Insight CD with good results; it's supposed to reintegrate the hemispheres of the brain. Just be sure the tracks you get are true stereo, and not joint stereo, and you listen with headphones worn correctly. The first time I used it while meditating, I heard a young boy say quite clearly \"I don't like this.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Angels are very musical beings, their love for it is proverbial. No reason not to expect the fallen ones to have musical interests too, but appealing to the baser emotions, rather than the higher.&lt;/p&gt;\n\n&lt;p&gt;The one time I used a ghost box, I was alone and drunk on the patio, grilling some steaks and listening to country music. I turned off the music, and turned on the ghost box; it immediately said loud-and-clear &amp;quot;play the music.&amp;quot; So I did, and we had a good time.&lt;/p&gt;\n\n&lt;p&gt;I suggest you look into brainwave entrainment as a mood therapy.  I use Immrama Institute&amp;#39;s Insight CD with good results; it&amp;#39;s supposed to reintegrate the hemispheres of the brain. Just be sure the tracks you get are true stereo, and not joint stereo, and you listen with headphones worn correctly. The first time I used it while meditating, I heard a young boy say quite clearly &amp;quot;I don&amp;#39;t like this.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg6chi9", "score_hidden": false, "stickied": false, "created": 1492051887.0, "created_utc": 1492023087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_64yvpn", "likes": null, "replies": "", "user_reports": [], "id": "dg66a7h", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "GhostsOnly", "parent_id": "t3_64yvpn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Maybe you're in a Pluto transit ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you&amp;#39;re in a Pluto transit &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dg66a7h", "score_hidden": false, "stickied": false, "created": 1492045590.0, "created_utc": 1492016790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]