[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay, one more story then I&amp;#39;ll have a short break. I fear this subreddit will become saturated by my stories :D&lt;/p&gt;\n\n&lt;p&gt;This happened two years ago during the summer, when I had joined my brothers family for a summer trip through the country.&lt;/p&gt;\n\n&lt;p&gt;My brother had searched for a rest house where we could rest for a few nights. The price was relatively cheap and we would have the whole apartment for ourselves.&lt;/p&gt;\n\n&lt;p&gt;Upon entering the apartment, I immediately thought,&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay... If there ever is an atmosphere of a haunted house, this has to be it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The air was so thick and heavy, almost oppressive! I&amp;#39;m sure there was some sort of a mold problem in the house. My brothers partner felt the heavy air too and she even had some small areas that had turned red at her wrist, indicative of a skin reaction to a possible mold problem.\n&amp;quot;Whatever. We&amp;#39;re here only for a few nights and we will then leave.&amp;quot;, I thought. I really didn&amp;#39;t entertaint the idea of spending nights in a house with a possible mold problem.&lt;/p&gt;\n\n&lt;p&gt;I put my baggage bag to a wardrobe in my room and shut it (it had a vintage locking mechanism), because I didn&amp;#39;t want my 2 year old nephew to start searching for things in it. After all, I had my medicines and also my cheap, market-value one-use safety razor there.&lt;/p&gt;\n\n&lt;p&gt;We opened the windows to get some breeze into the apartment - it helped nothing. At any rate it was time to head out so we left the bathroom window open. I decided to put a small bathroom porcelain decorative piece there to hold the window slightly open. My brother came to look what I was doing and commented,&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You sure you want to put that one there?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I looked at the fragile porcelain piece.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re right.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;We decided to put a wooden piece instead there, a bit sturdier one. I have to mention that it was a quiet suburban area of a small city and the window was situated at the back of the house. It was relatively safe for us to assume no burglars would enter the house. Besides, the window was too small for an adult to fit through.&lt;/p&gt;\n\n&lt;p&gt;When we returned from our trip out several hours later, the window was wide open and the wooden piece was laying at the corner of the room, rolled there by the impact of the window having been opened full wide and the wooden piece having dropped to the floor and rolled to the corner.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Must&amp;#39;ve been the wind...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I told you not to use the porcelain piece.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Everything was normal in the house (even the heavy atmosphere hadn&amp;#39;t shifted anywhere) but I noticed that the wardrobe door in my room was slightly open. I was sure that I had closed it earlier. But hey, old locking mechanisms are old locking mechanisms. Right?&lt;/p&gt;\n\n&lt;p&gt;Night came and we started to sleep. But in truth, I found it really hard to fall asleep with the heavy atmosphere. That&amp;#39;s when I started to hear it.&lt;/p&gt;\n\n&lt;p&gt;There was an old school, wooden dish rack in the kitchen where some decorative dishes were stored in a vertical position. These dishes had started to make sound, like someone was shaking the rack. And if I recall correctly, a faint thumping sound could also be heard from the basement. A large gathering of birds flew into air from the trees near the house, making a distress sound.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What the hell is going on here? Is there some kind of a machine going on in the basement? Is there an earthquake?&amp;quot;, I thought.  I had no idea since the basement door was locked and I didn&amp;#39;t dare to go investigate the kitchen area. Also, the country where we live has earthquakes extremely rarely (It&amp;#39;s situated at one of the seismically most non active areas in the world) and there isn&amp;#39;t even a highway near the house so a passing highway truck couldn&amp;#39;t have affected the ground.&lt;/p&gt;\n\n&lt;p&gt;20 - 30 minutes later the sounds stopped and everything became quiet. I really needed to visit the toilet, which was right next to my room. Both of these were overlooking the kitchen area. I felt quite anxious while visiting it but didn&amp;#39;t think more of it. I then returned to my room and eventually fell asleep.&lt;/p&gt;\n\n&lt;p&gt;The next day was surprisingly normal. We spent most of the day outside and only came back to the apartment at evening. The next night was also normal since by now I had gotten used to the heavy air, so I fell asleep relatively quickly. By the way, my nephew never showed any signs of not liking the house.&lt;/p&gt;\n\n&lt;p&gt;Upon leaving at the third day, I browsed through the quest book but found no referencing to anything out of the ordinary. I asked the owners about the house. I discovered that the owners parents had originally built it and he and his wife had turned it into a rest house after their death.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It is the most delightful place.&amp;quot;, the wife commented in a proud tone.&lt;/p&gt;\n\n&lt;p&gt;I dared not to mention of the weird things having happened there as I didn&amp;#39;t want to be disrespectful towards their memory. Besides, surely it all had a logical explanation.&lt;/p&gt;\n\n&lt;p&gt;Upon returning home, I started to unbag my baggage. That&amp;#39;s when I realized to my shock that the safety razor in my baggage bag was missing its safety lid. The lid was found in another pocket altogether. For me this was the last straw - there was no way I would put a f*cking safety razor into my bag without the lid! And why in the hell would I put the safety lid into ANOTHER pocket?&lt;/p&gt;\n\n&lt;p&gt;The worst thing is that my nephew could&amp;#39;ve browsed the bag and hurt himself to this razor. I was glad to have stored it far away from him.\nBut I couldn&amp;#39;t have commented about this to my brother either, because he would&amp;#39;ve just burst laughing, judge me for being careless AND stupid to even think of the razor blade safety lid having moved by itself. He thought of nothing about the happenings at the apartment. He and his partner simply laughed about it when I talked to him of the happenings during the first night.&lt;/p&gt;\n\n&lt;p&gt;Anyways, that&amp;#39;s my story. Lots of weird little things happening, but nothing conclusive if you ask me. For me, the whole experience reminded me of a stereotypical, even a cliché haunted house experience.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Okay, one more story then I'll have a short break. I fear this subreddit will become saturated by my stories :D\n\nThis happened two years ago during the summer, when I had joined my brothers family for a summer trip through the country.\n\nMy brother had searched for a rest house where we could rest for a few nights. The price was relatively cheap and we would have the whole apartment for ourselves.\n\nUpon entering the apartment, I immediately thought,\n\n\"Okay... If there ever is an atmosphere of a haunted house, this has to be it.\"\n\nThe air was so thick and heavy, almost oppressive! I'm sure there was some sort of a mold problem in the house. My brothers partner felt the heavy air too and she even had some small areas that had turned red at her wrist, indicative of a skin reaction to a possible mold problem.\n\"Whatever. We're here only for a few nights and we will then leave.\", I thought. I really didn't entertaint the idea of spending nights in a house with a possible mold problem.\n\nI put my baggage bag to a wardrobe in my room and shut it (it had a vintage locking mechanism), because I didn't want my 2 year old nephew to start searching for things in it. After all, I had my medicines and also my cheap, market-value one-use safety razor there.\n\nWe opened the windows to get some breeze into the apartment - it helped nothing. At any rate it was time to head out so we left the bathroom window open. I decided to put a small bathroom porcelain decorative piece there to hold the window slightly open. My brother came to look what I was doing and commented,\n\n\"You sure you want to put that one there?\"\n\nI looked at the fragile porcelain piece.\n\n\"You're right.\"\n\nWe decided to put a wooden piece instead there, a bit sturdier one. I have to mention that it was a quiet suburban area of a small city and the window was situated at the back of the house. It was relatively safe for us to assume no burglars would enter the house. Besides, the window was too small for an adult to fit through.\n\nWhen we returned from our trip out several hours later, the window was wide open and the wooden piece was laying at the corner of the room, rolled there by the impact of the window having been opened full wide and the wooden piece having dropped to the floor and rolled to the corner.\n\n\"Must've been the wind...\"\n\n\"I told you not to use the porcelain piece.\"\n\nEverything was normal in the house (even the heavy atmosphere hadn't shifted anywhere) but I noticed that the wardrobe door in my room was slightly open. I was sure that I had closed it earlier. But hey, old locking mechanisms are old locking mechanisms. Right?\n\nNight came and we started to sleep. But in truth, I found it really hard to fall asleep with the heavy atmosphere. That's when I started to hear it.\n\nThere was an old school, wooden dish rack in the kitchen where some decorative dishes were stored in a vertical position. These dishes had started to make sound, like someone was shaking the rack. And if I recall correctly, a faint thumping sound could also be heard from the basement. A large gathering of birds flew into air from the trees near the house, making a distress sound.\n\n\"What the hell is going on here? Is there some kind of a machine going on in the basement? Is there an earthquake?\", I thought.  I had no idea since the basement door was locked and I didn't dare to go investigate the kitchen area. Also, the country where we live has earthquakes extremely rarely (It's situated at one of the seismically most non active areas in the world) and there isn't even a highway near the house so a passing highway truck couldn't have affected the ground.\n\n20 - 30 minutes later the sounds stopped and everything became quiet. I really needed to visit the toilet, which was right next to my room. Both of these were overlooking the kitchen area. I felt quite anxious while visiting it but didn't think more of it. I then returned to my room and eventually fell asleep.\n\nThe next day was surprisingly normal. We spent most of the day outside and only came back to the apartment at evening. The next night was also normal since by now I had gotten used to the heavy air, so I fell asleep relatively quickly. By the way, my nephew never showed any signs of not liking the house.\n\nUpon leaving at the third day, I browsed through the quest book but found no referencing to anything out of the ordinary. I asked the owners about the house. I discovered that the owners parents had originally built it and he and his wife had turned it into a rest house after their death.\n\n\"It is the most delightful place.\", the wife commented in a proud tone.\n\nI dared not to mention of the weird things having happened there as I didn't want to be disrespectful towards their memory. Besides, surely it all had a logical explanation.\n\nUpon returning home, I started to unbag my baggage. That's when I realized to my shock that the safety razor in my baggage bag was missing its safety lid. The lid was found in another pocket altogether. For me this was the last straw - there was no way I would put a f*cking safety razor into my bag without the lid! And why in the hell would I put the safety lid into ANOTHER pocket?\n\nThe worst thing is that my nephew could've browsed the bag and hurt himself to this razor. I was glad to have stored it far away from him.\nBut I couldn't have commented about this to my brother either, because he would've just burst laughing, judge me for being careless AND stupid to even think of the razor blade safety lid having moved by itself. He thought of nothing about the happenings at the apartment. He and his partner simply laughed about it when I talked to him of the happenings during the first night.\n\nAnyways, that's my story. Lots of weird little things happening, but nothing conclusive if you ask me. For me, the whole experience reminded me of a stereotypical, even a cliché haunted house experience.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6506ez", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "itsacrazylife", "saved": false, "mod_reports": [], "name": "t3_6506ez", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492033797.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/6506ez/the_haunted_rest_house/", "num_reports": null, "locked": false, "stickied": false, "created": 1492052098.0, "url": "https://www.reddit.com/r/Paranormal/comments/6506ez/the_haunted_rest_house/", "author_flair_text": null, "quarantine": false, "title": "The haunted rest house", "created_utc": 1492023298.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]