[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this takes place on April 1, 2016. I remember because I told everyone this and they thought I was joking (April fools). But I just got reddit so here I am sharing this. Any explanations to what you think happened are welcome. &lt;/p&gt;\n\n&lt;p&gt;I was in high school and me and my friend Elise had just started hanging out in the mornings before school to pick up something to eat and just hangout. I would drive 15 minutes outside of my city and I would pick her up at her house in the neighboring town and we would go to the gas station in Olmito, TX to pick up breakfast tacos to eat in my car and just listen to music. This time we did exactly that and after we finished our food, she told me about a place her friend had shown her a few weeks prior. She described it as a huge pile of burnt DVD&amp;#39;s next to an abandoned warehouse. We had 30 minutes to kill and she said it was right down the road so I thought why not. To give you an idea of the area, there are a lot of fields and open space in and around Olmito. Anyways we drive about 8 minutes down some backroad and we reach the warehouse and this huge pile of burnt DVD&amp;#39;s exactly how she described it. The warehouse was pretty large and had graffiti all over it. It Looked like it had been abandoned for nearly 20 years by how run down it was. After looking around the pile we had killed enough time so we had to go to school, but we promised each other we would be back later after school to go inside the warehouse, just for fun. \nFast forward to the end of the day at 4:00 pm and Elise and me got in my car but this time accompanied by my friend Sofia who wanted to explore the warehouse with us. We drove out again, and once we get there we immediately go to a door of the warehouse facing the giant pile of burnt DVD&amp;#39;s and discuss how we are going to do this. Me being the gentleman I am, volunteer myself to be the guy that opens the door and walks inside first, the two girls following me once the coast was clear. So, I turn on the flashlight on my phone and I reach for the door. The knob was easy to turn but I had to pull with all of my body weight. Once the door swung open I immediately back away a few steps, surprised at how pitch black it was inside. Being 4:00 pm and no cloud in the sky I would expect to see some sort of light but It was impossible to see anything further than right in front of me. Anyways, I moved slowly towards the door and the girls were totally quiet about 10 feet behind me just waiting. Right before I reached the threshold crossing from the outside to having my right foot inside the warehouse, I heard one of the most unexplainable things I&amp;#39;ve ever heard. An incredibly deep noise (I won&amp;#39;t say voice because quite frankly, in my opinion, I don&amp;#39;t think a human voice can be that low and guttural) that gives me chills just thinking about it. What made it possibly human was that it was a LAUGH. an audible noise that sounded like somebody chuckling. Looking back, it was as if that thing was laughing at us for trying to check out the area. But like I said it probably wasn&amp;#39;t human. So, I looked over to my friends whose eyes where huge and I have never ran so fucking fast In my life. We got in the car and I sped off. We are all freaking out about how demonic that noise sounded like while I&amp;#39;m speeding on the backroad to get to the expressway to go back to my friend’s house. We get on the expressway and by this point we had calmed down but we were still in shock. Now I don&amp;#39;t know what to think of this but ill include it anyways. We were inches away from being hit by a car that suddenly swerved out of their lane into mine for no reason (There was no one else on the expressway). This freaked me out more but we made it to my friend’s house safely. When we made it, we plopped on the living room couches in Elise&amp;#39;s house and tried coming up with any explanation for what happened at the warehouse. This is where things start taking a turn for some bad juju that is following us around, and could possibly explain the near miss on the expressway??? While we are sitting there on the couches, Elise&amp;#39;s mom&amp;#39;s bedroom door Slams. Her Mom isn&amp;#39;t home, and no, it was not a draft of air. It was like someone angrily and forcefully slammed the door. We left the house immediately because of that and went out to eat just so we wouldn&amp;#39;t be at her house. By the time, we came back to my friend’s house it was starting to get dark outside and Sofia had just gotten picked up, so it was just me and Elise. Now the only occurrence that happened later was that a tennis ball that was tucked behind her three trophies on a small shelf somehow got out and rolled all the way across the room. Sounds stupid but really, it’s like a car going through door, it can&amp;#39;t happen. The trophies were still in their places, lined up next to each other with no space in between. So, I go home safely even though I was worried something might happen, and I just try to not think about that stuff when I go to bed. For the next three days, I wake up facing my closet that is wide open. The door to my room is closed and no one came in to mess with my closet door. It’s always shut tightly and I can&amp;#39;t explain that either. And of course, as if it was a horror movie, I wake up on the third day,in a cold sweat, at what time???? 3:00 AM.... :). A lot of people don&amp;#39;t believe this part, which is understandable because it sounds like a cliché but I swear this is all the truth. After the third day I prayed, which I don&amp;#39;t do because I consider myself an agnostic and I don&amp;#39;t really believe in a higher power. But after the prayer it all ended. Now if only one or maybe two of these things happened to me then it probably would be forgettable, but all of these things happened to me on that one day and the days following and it really just makes me think that maybe there is some evil stuff out there because honestly, I can&amp;#39;t explain all of these things coinciding all in one day.Any thoughts, explanations, or maybe stories that are similar???&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this takes place on April 1, 2016. I remember because I told everyone this and they thought I was joking (April fools). But I just got reddit so here I am sharing this. Any explanations to what you think happened are welcome. \n\n I was in high school and me and my friend Elise had just started hanging out in the mornings before school to pick up something to eat and just hangout. I would drive 15 minutes outside of my city and I would pick her up at her house in the neighboring town and we would go to the gas station in Olmito, TX to pick up breakfast tacos to eat in my car and just listen to music. This time we did exactly that and after we finished our food, she told me about a place her friend had shown her a few weeks prior. She described it as a huge pile of burnt DVD's next to an abandoned warehouse. We had 30 minutes to kill and she said it was right down the road so I thought why not. To give you an idea of the area, there are a lot of fields and open space in and around Olmito. Anyways we drive about 8 minutes down some backroad and we reach the warehouse and this huge pile of burnt DVD's exactly how she described it. The warehouse was pretty large and had graffiti all over it. It Looked like it had been abandoned for nearly 20 years by how run down it was. After looking around the pile we had killed enough time so we had to go to school, but we promised each other we would be back later after school to go inside the warehouse, just for fun. \nFast forward to the end of the day at 4:00 pm and Elise and me got in my car but this time accompanied by my friend Sofia who wanted to explore the warehouse with us. We drove out again, and once we get there we immediately go to a door of the warehouse facing the giant pile of burnt DVD's and discuss how we are going to do this. Me being the gentleman I am, volunteer myself to be the guy that opens the door and walks inside first, the two girls following me once the coast was clear. So, I turn on the flashlight on my phone and I reach for the door. The knob was easy to turn but I had to pull with all of my body weight. Once the door swung open I immediately back away a few steps, surprised at how pitch black it was inside. Being 4:00 pm and no cloud in the sky I would expect to see some sort of light but It was impossible to see anything further than right in front of me. Anyways, I moved slowly towards the door and the girls were totally quiet about 10 feet behind me just waiting. Right before I reached the threshold crossing from the outside to having my right foot inside the warehouse, I heard one of the most unexplainable things I've ever heard. An incredibly deep noise (I won't say voice because quite frankly, in my opinion, I don't think a human voice can be that low and guttural) that gives me chills just thinking about it. What made it possibly human was that it was a LAUGH. an audible noise that sounded like somebody chuckling. Looking back, it was as if that thing was laughing at us for trying to check out the area. But like I said it probably wasn't human. So, I looked over to my friends whose eyes where huge and I have never ran so fucking fast In my life. We got in the car and I sped off. We are all freaking out about how demonic that noise sounded like while I'm speeding on the backroad to get to the expressway to go back to my friend’s house. We get on the expressway and by this point we had calmed down but we were still in shock. Now I don't know what to think of this but ill include it anyways. We were inches away from being hit by a car that suddenly swerved out of their lane into mine for no reason (There was no one else on the expressway). This freaked me out more but we made it to my friend’s house safely. When we made it, we plopped on the living room couches in Elise's house and tried coming up with any explanation for what happened at the warehouse. This is where things start taking a turn for some bad juju that is following us around, and could possibly explain the near miss on the expressway??? While we are sitting there on the couches, Elise's mom's bedroom door Slams. Her Mom isn't home, and no, it was not a draft of air. It was like someone angrily and forcefully slammed the door. We left the house immediately because of that and went out to eat just so we wouldn't be at her house. By the time, we came back to my friend’s house it was starting to get dark outside and Sofia had just gotten picked up, so it was just me and Elise. Now the only occurrence that happened later was that a tennis ball that was tucked behind her three trophies on a small shelf somehow got out and rolled all the way across the room. Sounds stupid but really, it’s like a car going through door, it can't happen. The trophies were still in their places, lined up next to each other with no space in between. So, I go home safely even though I was worried something might happen, and I just try to not think about that stuff when I go to bed. For the next three days, I wake up facing my closet that is wide open. The door to my room is closed and no one came in to mess with my closet door. It’s always shut tightly and I can't explain that either. And of course, as if it was a horror movie, I wake up on the third day,in a cold sweat, at what time???? 3:00 AM.... :). A lot of people don't believe this part, which is understandable because it sounds like a cliché but I swear this is all the truth. After the third day I prayed, which I don't do because I consider myself an agnostic and I don't really believe in a higher power. But after the prayer it all ended. Now if only one or maybe two of these things happened to me then it probably would be forgettable, but all of these things happened to me on that one day and the days following and it really just makes me think that maybe there is some evil stuff out there because honestly, I can't explain all of these things coinciding all in one day.Any thoughts, explanations, or maybe stories that are similar???\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65eulg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "joel_marcus", "saved": false, "mod_reports": [], "name": "t3_65eulg", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492228075.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65eulg/my_only_paranormal_experience_that_really_makes/", "num_reports": null, "locked": false, "stickied": false, "created": 1492228935.0, "url": "https://www.reddit.com/r/Paranormal/comments/65eulg/my_only_paranormal_experience_that_really_makes/", "author_flair_text": null, "quarantine": false, "title": "My only paranormal experience that really makes me question my beliefs.", "created_utc": 1492200135.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65eulg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65eulg", "likes": null, "replies": "", "user_reports": [], "id": "dga8j0j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "joel_marcus", "parent_id": "t1_dga7j0d", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "definitely some good points you made. I feel like the most common thing is to smell a random unexplained perfume/cologne of somebody you once knew. happens to me sometimes. But going back to whatever was in the warehouse, it definitely felt horribly evil and I get very uneasy when I go within a few miles of the place now. I still stand by the point that it really was NOT human. Crazy stuff dude.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;definitely some good points you made. I feel like the most common thing is to smell a random unexplained perfume/cologne of somebody you once knew. happens to me sometimes. But going back to whatever was in the warehouse, it definitely felt horribly evil and I get very uneasy when I go within a few miles of the place now. I still stand by the point that it really was NOT human. Crazy stuff dude.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dga8j0j", "score_hidden": false, "stickied": false, "created": 1492256601.0, "created_utc": 1492227801.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7j0d", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "0LouisxLestat0", "parent_id": "t3_65eulg", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've had several experiences that cannot be logically explained, so I don't doubt any of this. There is a 200 year old cemetery behind my house and I've seen objects move right in front of me. I've also smelt cologne and perfume out of nowhere and have seen spirits in my dreams.\n\n I fully believe that while our bodies may die, our energy or essence lives on. Spirits may communicate out of curiosity or to make themselves known. Others can serve as guides or to give support. Some energies, on the other hand, may be of a lower vibration and manifest themselves in more aggressive ways, sometimes intentionally, to scare others away. Especially if they're strongly attached to the place they occupy. \n\nIt sounds to me like whatever was at the warehouse was of a lower vibration and wanted to be left alone. I truly believe in the power of positive intention, in this case, prayer, to heal and uplift. \n\nHopefully this helps answer to your question or give some clarity! Just my 2 cents :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had several experiences that cannot be logically explained, so I don&amp;#39;t doubt any of this. There is a 200 year old cemetery behind my house and I&amp;#39;ve seen objects move right in front of me. I&amp;#39;ve also smelt cologne and perfume out of nowhere and have seen spirits in my dreams.&lt;/p&gt;\n\n&lt;p&gt;I fully believe that while our bodies may die, our energy or essence lives on. Spirits may communicate out of curiosity or to make themselves known. Others can serve as guides or to give support. Some energies, on the other hand, may be of a lower vibration and manifest themselves in more aggressive ways, sometimes intentionally, to scare others away. Especially if they&amp;#39;re strongly attached to the place they occupy. &lt;/p&gt;\n\n&lt;p&gt;It sounds to me like whatever was at the warehouse was of a lower vibration and wanted to be left alone. I truly believe in the power of positive intention, in this case, prayer, to heal and uplift. &lt;/p&gt;\n\n&lt;p&gt;Hopefully this helps answer to your question or give some clarity! Just my 2 cents :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dga7j0d", "score_hidden": false, "stickied": false, "created": 1492255009.0, "created_utc": 1492226209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65eulg", "likes": null, "replies": "", "user_reports": [], "id": "dgaeosl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_65eulg", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Most stories we are told, read, or watch are about the never-ending war between good and evil.  There's a reason for this, in my opinion.  I was raised Catholic and the nuns warned us to be wary of Satan and his minions, who were always lurking in hopes of the opportunity to lead one of us astray.  Granted that was a good way for them to keep the class in order, but as I got older I continued believing it.  Why?  Because almost everything in nature, on earth, and in the universe is balanced.  For every action there is an equal and opposite reaction, correct?  So it stands to reason that for every *good* action there is the possibility for an *evil* action to occur.\n\nAngels and demons, mirror images of good and evil.  God and Satan, same thing (except God is stronger since He's the one Who created Satan in the first place!)  My point is that if a person believes in a higher power that acts for our benefit they must at least consider the possibility that an opposite power acting for our detriment has to exist also.  Therefore I do believe you when you say you sensed that whatever was in that abandoned warehouse was evil.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most stories we are told, read, or watch are about the never-ending war between good and evil.  There&amp;#39;s a reason for this, in my opinion.  I was raised Catholic and the nuns warned us to be wary of Satan and his minions, who were always lurking in hopes of the opportunity to lead one of us astray.  Granted that was a good way for them to keep the class in order, but as I got older I continued believing it.  Why?  Because almost everything in nature, on earth, and in the universe is balanced.  For every action there is an equal and opposite reaction, correct?  So it stands to reason that for every &lt;em&gt;good&lt;/em&gt; action there is the possibility for an &lt;em&gt;evil&lt;/em&gt; action to occur.&lt;/p&gt;\n\n&lt;p&gt;Angels and demons, mirror images of good and evil.  God and Satan, same thing (except God is stronger since He&amp;#39;s the one Who created Satan in the first place!)  My point is that if a person believes in a higher power that acts for our benefit they must at least consider the possibility that an opposite power acting for our detriment has to exist also.  Therefore I do believe you when you say you sensed that whatever was in that abandoned warehouse was evil.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgaeosl", "score_hidden": false, "stickied": false, "created": 1492268763.0, "created_utc": 1492239963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65eulg", "likes": null, "replies": "", "user_reports": [], "id": "dgaj2jf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gdbunit", "parent_id": "t3_65eulg", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Good thing you didn't look in with a flashlight. You would have seen me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good thing you didn&amp;#39;t look in with a flashlight. You would have seen me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgaj2jf", "score_hidden": false, "stickied": false, "created": 1492281951.0, "created_utc": 1492253151.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65eulg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65eulg", "likes": null, "replies": "", "user_reports": [], "id": "dgb2d36", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "joel_marcus", "parent_id": "t1_dgas84m", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "no no I don't have anymore experiences anymore with it. it ended a few days after the incident one year ago. but for that moment I guess you could say I was possibly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no no I don&amp;#39;t have anymore experiences anymore with it. it ended a few days after the incident one year ago. but for that moment I guess you could say I was possibly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgb2d36", "score_hidden": false, "stickied": false, "created": 1492313746.0, "created_utc": 1492284946.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas84m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ZiShuDo", "parent_id": "t3_65eulg", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "You have a demon following you around. Do you still have nightmares of being chased? DJ you still see black shadows dashing in side vision?\n\nWhat are your dreams like?\nI have heard and recorded voices that don't sound humans.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have a demon following you around. Do you still have nightmares of being chased? DJ you still see black shadows dashing in side vision?&lt;/p&gt;\n\n&lt;p&gt;What are your dreams like?\nI have heard and recorded voices that don&amp;#39;t sound humans.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgas84m", "score_hidden": false, "stickied": false, "created": 1492299880.0, "created_utc": 1492271080.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]