[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a kid, my dad had a bunch of encounters with ghosts, and such. One I&amp;#39;m gonna tell all of you. Please comment what you think it is..\nWhen my dad was about 10, he moved to Oklahoma. He got a fairly small house, a floor + attic. His relatives were visiting for a few days, and they slept in my dad&amp;#39;s parent&amp;#39;s room on an air-mattress (I suck at spelling) and they heard tapping in the attic. They asked my dad&amp;#39;s parents if they had cats or rats, and they said no, they put rat poison up there and I&amp;#39;m sure cats wouldn&amp;#39;t magically appear up there. A few hours pass, and my dad&amp;#39;s father woke up to the bathroom light on. He figured it was my dad, and tried to sleep. An hour or two pass, and he goes and checks it. He turns off the light, and then goes to lay down. It turns back on. This happens a few times, until it just, well, stops. Meanwhile, my dad woke up a few times to a ghostly figure sitting at the end of his bed, saying &amp;quot;Be good (my dad&amp;#39;s name, not telling cause private reasons), be good..&amp;quot; a few times. He didn&amp;#39;t feel scared, though. He felt.. comforted.. like a mother. But it wasn&amp;#39;t his mother. This figure had blonde hair, and his mother had brown-ish black hair. He also described this woman at the end of the bed to be glowing. He went back to sleep. This all happened for a week or two, I believe. Also, while this was happening, the front door also was opening in the middle of the night, even though they had a bolt lock on it, and they locked it tight. Once they even moved a chair infront of it, and the next day the chair was accross the room and the door was wide open. A few weeks went by and they moved out. Any explaination of what the f*** this is? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As a kid, my dad had a bunch of encounters with ghosts, and such. One I'm gonna tell all of you. Please comment what you think it is..\nWhen my dad was about 10, he moved to Oklahoma. He got a fairly small house, a floor + attic. His relatives were visiting for a few days, and they slept in my dad's parent's room on an air-mattress (I suck at spelling) and they heard tapping in the attic. They asked my dad's parents if they had cats or rats, and they said no, they put rat poison up there and I'm sure cats wouldn't magically appear up there. A few hours pass, and my dad's father woke up to the bathroom light on. He figured it was my dad, and tried to sleep. An hour or two pass, and he goes and checks it. He turns off the light, and then goes to lay down. It turns back on. This happens a few times, until it just, well, stops. Meanwhile, my dad woke up a few times to a ghostly figure sitting at the end of his bed, saying \"Be good (my dad's name, not telling cause private reasons), be good..\" a few times. He didn't feel scared, though. He felt.. comforted.. like a mother. But it wasn't his mother. This figure had blonde hair, and his mother had brown-ish black hair. He also described this woman at the end of the bed to be glowing. He went back to sleep. This all happened for a week or two, I believe. Also, while this was happening, the front door also was opening in the middle of the night, even though they had a bolt lock on it, and they locked it tight. Once they even moved a chair infront of it, and the next day the chair was accross the room and the door was wide open. A few weeks went by and they moved out. Any explaination of what the f*** this is? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65g8z2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "XenMorph", "saved": false, "mod_reports": [], "name": "t3_65g8z2", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492267910.0, "link_flair_css_class": null, "author_flair_css_class": "g", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65g8z2/weird_experience_from_my_dad_as_a_kid/", "num_reports": null, "locked": false, "stickied": false, "created": 1492244556.0, "url": "https://www.reddit.com/r/Paranormal/comments/65g8z2/weird_experience_from_my_dad_as_a_kid/", "author_flair_text": "The truth is out there", "quarantine": false, "title": "Weird experience from my dad as a kid.", "created_utc": 1492215756.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65g8z2", "likes": null, "replies": "", "user_reports": [], "id": "dga9pc1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "0LouisxLestat0", "parent_id": "t3_65g8z2", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "This reminds me of a story my dad told me once. My dad lived in a lot of different places as he grew up. One of them was a funeral home, where him and his family would hear footsteps coming from the attic. They tried to explain it, thinking it could be rats, but obviously it wasn't. My dad had the covers pulled off of him on several occasions when trying to sleep. There was knocking or scratching on doors. Apparitions would appear. A lot of unexplainable things happened. Having experienced the paranormal myself, I believe some spirits have the ability and enough energetic force  to control the physical environment around them. They may do it to be acknowledged or to 'defend their territory', so to speak. Some spirits are playful and do things as a means of communication. Others are not so friendly and push people away to reclaim their space or in other cases, latch onto people and sponge off their energy. From your story, it doesn't sound like a negative entity, but more so one that wanted to be acknowledged. Hope this helps explain it a bit!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This reminds me of a story my dad told me once. My dad lived in a lot of different places as he grew up. One of them was a funeral home, where him and his family would hear footsteps coming from the attic. They tried to explain it, thinking it could be rats, but obviously it wasn&amp;#39;t. My dad had the covers pulled off of him on several occasions when trying to sleep. There was knocking or scratching on doors. Apparitions would appear. A lot of unexplainable things happened. Having experienced the paranormal myself, I believe some spirits have the ability and enough energetic force  to control the physical environment around them. They may do it to be acknowledged or to &amp;#39;defend their territory&amp;#39;, so to speak. Some spirits are playful and do things as a means of communication. Others are not so friendly and push people away to reclaim their space or in other cases, latch onto people and sponge off their energy. From your story, it doesn&amp;#39;t sound like a negative entity, but more so one that wanted to be acknowledged. Hope this helps explain it a bit!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dga9pc1", "score_hidden": false, "stickied": false, "created": 1492258551.0, "created_utc": 1492229751.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65g8z2", "likes": null, "replies": "", "user_reports": [], "id": "dgaactc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ellychelle", "parent_id": "t3_65g8z2", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Wow that's crazy! When spirits are able to physically move things, it's referred to as poltergeist activity, but that doesn't mean it wasn't demonic. As for the attic, rat poison would have also killed any cats, or any other wildlife for that matter, including raccoons and opossums. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow that&amp;#39;s crazy! When spirits are able to physically move things, it&amp;#39;s referred to as poltergeist activity, but that doesn&amp;#39;t mean it wasn&amp;#39;t demonic. As for the attic, rat poison would have also killed any cats, or any other wildlife for that matter, including raccoons and opossums. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgaactc", "score_hidden": false, "stickied": false, "created": 1492259684.0, "created_utc": 1492230884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65g8z2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65g8z2", "likes": null, "replies": "", "user_reports": [], "id": "dgaq3j6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "XenMorph", "parent_id": "t1_dgadw9j", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Maybe.. that's a good explaination.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe.. that&amp;#39;s a good explaination.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgaq3j6", "score_hidden": false, "stickied": false, "created": 1492296818.0, "created_utc": 1492268018.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadw9j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_65g8z2", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Hmmm.....I wonder if the blond woman was his guardian angel?  It almost sounds like she was comforting him in the face of all the other activity -- ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmmm.....I wonder if the blond woman was his guardian angel?  It almost sounds like she was comforting him in the face of all the other activity -- ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgadw9j", "score_hidden": false, "stickied": false, "created": 1492266809.0, "created_utc": 1492238009.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]