[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a child I could answer questions I had no prior knowledge of. Like whats in the box, where is your brother and just random things like that. I knew secrets about people as well. Like my mom was cheating, even though I never saw him, and my dad smoked, even though I had never seen any evidence, knew no one else that did and thought it was a drug. That bothered me more than the cheating, as my parents weren&amp;#39;t very close. I knew several children that were being abused in various ways without being told. I couldn&amp;#39;t control it, but if I thought very hard about a particular person I could often learn things. As I got older at around puberty I realized I could predict simple things. Like playing cards, often knowing what the next card that would be drawn was. I just accepted it as it was, knew I was a little weird but that was it. As I got even older I stopped being able to do most of it. I can still learn secrets about people, but its only things that are bothering them actively. I had a friend that felt guilty about cheating on her fiance. We were drinking and I blurted it out and was sworn to secrecy on the matter. Honestly though, I hate that part. Always have. Knowing is not good if you cant help or say anything, it&amp;#39;s an issue I have always had with it. &lt;/p&gt;\n\n&lt;p&gt;My question is this, am I alone? Do children often display these traits and just grow out of them? Can I get it back?&lt;/p&gt;\n\n&lt;p&gt;Edit: I thought I should mention that i am not very smart, and normally pattern recognition is hard for me, so that idea seems far fetched.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As a child I could answer questions I had no prior knowledge of. Like whats in the box, where is your brother and just random things like that. I knew secrets about people as well. Like my mom was cheating, even though I never saw him, and my dad smoked, even though I had never seen any evidence, knew no one else that did and thought it was a drug. That bothered me more than the cheating, as my parents weren't very close. I knew several children that were being abused in various ways without being told. I couldn't control it, but if I thought very hard about a particular person I could often learn things. As I got older at around puberty I realized I could predict simple things. Like playing cards, often knowing what the next card that would be drawn was. I just accepted it as it was, knew I was a little weird but that was it. As I got even older I stopped being able to do most of it. I can still learn secrets about people, but its only things that are bothering them actively. I had a friend that felt guilty about cheating on her fiance. We were drinking and I blurted it out and was sworn to secrecy on the matter. Honestly though, I hate that part. Always have. Knowing is not good if you cant help or say anything, it's an issue I have always had with it. \n\nMy question is this, am I alone? Do children often display these traits and just grow out of them? Can I get it back?\n\nEdit: I thought I should mention that i am not very smart, and normally pattern recognition is hard for me, so that idea seems far fetched.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gvck", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "Chickenbones369", "saved": false, "mod_reports": [], "name": "t3_65gvck", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492226308.0, "link_flair_css_class": null, "author_flair_css_class": "e", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65gvck/psychic_phenomena_in_children/", "num_reports": null, "locked": false, "stickied": false, "created": 1492252734.0, "url": "https://www.reddit.com/r/Paranormal/comments/65gvck/psychic_phenomena_in_children/", "author_flair_text": "Skeptic", "quarantine": false, "title": "Psychic phenomena in children.", "created_utc": 1492223934.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65gvck", "likes": null, "replies": "", "user_reports": [], "id": "dgaeaxt", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_65gvck", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "You are certainly not at all alone, my dear!!  I believe we all start out being open and receptive to knowledge and other things that our main five senses cannot detect.  I know this from experience as most of the kids in my family were very psychic until their late teens.\n\nAs for getting it back I imagine it's like a muscle, you have to exercise it to make it stronger.  I've been trying to regain the abilities I once had myself so maybe we can be 'exercise buddies'?  LOL", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are certainly not at all alone, my dear!!  I believe we all start out being open and receptive to knowledge and other things that our main five senses cannot detect.  I know this from experience as most of the kids in my family were very psychic until their late teens.&lt;/p&gt;\n\n&lt;p&gt;As for getting it back I imagine it&amp;#39;s like a muscle, you have to exercise it to make it stronger.  I&amp;#39;ve been trying to regain the abilities I once had myself so maybe we can be &amp;#39;exercise buddies&amp;#39;?  LOL&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgaeaxt", "score_hidden": false, "stickied": false, "created": 1492267797.0, "created_utc": 1492238997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65gvck", "likes": null, "replies": "", "user_reports": [], "id": "dganovt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sunnyblizzard", "parent_id": "t3_65gvck", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Same here! I didn't realize how much I relied on my intuition until I felt like I lost it for a bit. I started meditating and learned to read tarot cards in order to get my intuition back. Now that it's back, I never want to lose it again! Think of it as a gift!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same here! I didn&amp;#39;t realize how much I relied on my intuition until I felt like I lost it for a bit. I started meditating and learned to read tarot cards in order to get my intuition back. Now that it&amp;#39;s back, I never want to lose it again! Think of it as a gift!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dganovt", "score_hidden": false, "stickied": false, "created": 1492292874.0, "created_utc": 1492264074.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65gvck", "likes": null, "replies": "", "user_reports": [], "id": "dgaxs24", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hapi27", "parent_id": "t3_65gvck", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Children are generally more receptive, some say it's because the child is so close to the other side due to their age but that really is up for debate. You're not alone, and yes you can get the abilities back and strengthen them with practice as well. I'd exercise more discretion and be mindful of what comes out though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Children are generally more receptive, some say it&amp;#39;s because the child is so close to the other side due to their age but that really is up for debate. You&amp;#39;re not alone, and yes you can get the abilities back and strengthen them with practice as well. I&amp;#39;d exercise more discretion and be mindful of what comes out though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgaxs24", "score_hidden": false, "stickied": false, "created": 1492307557.0, "created_utc": 1492278757.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]