[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The story I&amp;#39;m going to tell is 100% real. When my brother and I were young,my family was going through a rough time. My dad had cancer, and he had mental health issues that were destroying his relationship with my mother and us. He would go through these fits of Ill directed hatred and rage and he would say and do terrible things to us. There was a lot of negative energy in our house. I was a teenager and my home life problems manifested themselves into my already bad lifelong depressive/anxiety disorder and resulted in me being a very moody, rebellious teen girl.&lt;/p&gt;\n\n&lt;p&gt;I would have terrible dreams at night. I had vivid dreams of my world in a parallel universe that resembled hell. In the morning, my back hurt and I felt heaviness in my shoulders that I couldn&amp;#39;t relieve. I started having dreams of a demon on my shoulder whipsering bad thoughts to me throughout the day. &lt;/p&gt;\n\n&lt;p&gt;I also constantly dreamt of a little girl with empty eye sockets, decaying skin, and matted long hair who stood on top of my bed in the corner of my room and whispered bad phrases into my ear which manifested themselves into my dream. It was as if I astrally projected and saw myself sleep as this little girl scared me. I KNEW she was aware, like she had been planning it.One night, as I woke up from a nightmare, I got up and went to the kitchen to get a drink of water. When I reached my room I saw the shillouette of the little girl in the corner of my bed. I couldn&amp;#39;t believe it. I turned on my light and she was gone. I turned my light off and she was there again. I ran into my parents room and told my dad. He followed me to my room and there was nothing. He just went back to his room in a haze&lt;/p&gt;\n\n&lt;p&gt;The next day my dad and I had a conversation about the girl and he told me he believed me because he had dreams of a little girl walking towards him that turned into a black wolf when it got a few feet away. He said this wolf would tell him terrible things and that he would repeat them, unable to escape the wolf. As if he were hypnotized.&lt;/p&gt;\n\n&lt;p&gt;Around this time my family was experiencing paranormal activity in my house. New light bulbs would blow out violently, the tv would turn on and off, the radio would increase in volume slowly to the highest setting, things would disappear and reappear in random places,  etc. We got electricians to check out our house and repair guys to look at our electronics but they said nothing was wrong with our house or appliances. It was truly bizarre. &lt;/p&gt;\n\n&lt;p&gt;I think the scariest part of this story is the White Man. My little brother was very young at the time that a lot of this was happening. He would wake up screaming at 3 am. When my parents would ask him what was wrong, he would say that &amp;quot;the white man&amp;quot; was on the wall or cieling, watching him. We asked him to draw the white man and his description was alarming. The thing looked like naked slender man with jagged limbs. He claimed the white man made him say mean things about us. One time I was playing with him and he told me &amp;quot;the white man doesn&amp;#39;t like you or mommy and daddy and he said you&amp;#39;re gonna die&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Several times, any member of my family that slept with my little brother after he had woken up from a nightmare also had dreams of the &amp;quot;white man&amp;quot;. The scariest episodes of the white man i remember we&amp;#39;re when we were out in public with my brother. He would fixate on a spot on the wall, the ceiling, or into the distance and then suddenly go into hysterics, claiming the white man was here. He was inconsolable until the white man disppeared. This happened a couple times at church as well. &lt;/p&gt;\n\n&lt;p&gt;Everything ended when my grandma, a deeply religious person came to visit us. She said she felt a great heaviness in our house and she became physically ill with a sickness the doctors couldn&amp;#39;t diagnose. She called for some priests to come bless our house and they did multiple times. After this, my mother kept calling them back to bless the house every so often and the activity eventually faded. My dad&amp;#39;s physical and mental health restored itself, everyones nightmares went away, and we went back to being our old happy family.&lt;/p&gt;\n\n&lt;p&gt;I very much believe that our paranormal experience was demonic and that those entities fed off of my fathers ailing health and my mental health issues as well as the fear the paranormal activity caused. I think there are definitely other beings out there and I know that they are not all good. Don&amp;#39;t be afraid to seek help!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The story I'm going to tell is 100% real. When my brother and I were young,my family was going through a rough time. My dad had cancer, and he had mental health issues that were destroying his relationship with my mother and us. He would go through these fits of Ill directed hatred and rage and he would say and do terrible things to us. There was a lot of negative energy in our house. I was a teenager and my home life problems manifested themselves into my already bad lifelong depressive/anxiety disorder and resulted in me being a very moody, rebellious teen girl.\n\nI would have terrible dreams at night. I had vivid dreams of my world in a parallel universe that resembled hell. In the morning, my back hurt and I felt heaviness in my shoulders that I couldn't relieve. I started having dreams of a demon on my shoulder whipsering bad thoughts to me throughout the day. \n\nI also constantly dreamt of a little girl with empty eye sockets, decaying skin, and matted long hair who stood on top of my bed in the corner of my room and whispered bad phrases into my ear which manifested themselves into my dream. It was as if I astrally projected and saw myself sleep as this little girl scared me. I KNEW she was aware, like she had been planning it.One night, as I woke up from a nightmare, I got up and went to the kitchen to get a drink of water. When I reached my room I saw the shillouette of the little girl in the corner of my bed. I couldn't believe it. I turned on my light and she was gone. I turned my light off and she was there again. I ran into my parents room and told my dad. He followed me to my room and there was nothing. He just went back to his room in a haze\n\nThe next day my dad and I had a conversation about the girl and he told me he believed me because he had dreams of a little girl walking towards him that turned into a black wolf when it got a few feet away. He said this wolf would tell him terrible things and that he would repeat them, unable to escape the wolf. As if he were hypnotized.\n\nAround this time my family was experiencing paranormal activity in my house. New light bulbs would blow out violently, the tv would turn on and off, the radio would increase in volume slowly to the highest setting, things would disappear and reappear in random places,  etc. We got electricians to check out our house and repair guys to look at our electronics but they said nothing was wrong with our house or appliances. It was truly bizarre. \n\nI think the scariest part of this story is the White Man. My little brother was very young at the time that a lot of this was happening. He would wake up screaming at 3 am. When my parents would ask him what was wrong, he would say that \"the white man\" was on the wall or cieling, watching him. We asked him to draw the white man and his description was alarming. The thing looked like naked slender man with jagged limbs. He claimed the white man made him say mean things about us. One time I was playing with him and he told me \"the white man doesn't like you or mommy and daddy and he said you're gonna die\". \n\nSeveral times, any member of my family that slept with my little brother after he had woken up from a nightmare also had dreams of the \"white man\". The scariest episodes of the white man i remember we're when we were out in public with my brother. He would fixate on a spot on the wall, the ceiling, or into the distance and then suddenly go into hysterics, claiming the white man was here. He was inconsolable until the white man disppeared. This happened a couple times at church as well. \n\nEverything ended when my grandma, a deeply religious person came to visit us. She said she felt a great heaviness in our house and she became physically ill with a sickness the doctors couldn't diagnose. She called for some priests to come bless our house and they did multiple times. After this, my mother kept calling them back to bless the house every so often and the activity eventually faded. My dad's physical and mental health restored itself, everyones nightmares went away, and we went back to being our old happy family.\n\nI very much believe that our paranormal experience was demonic and that those entities fed off of my fathers ailing health and my mental health issues as well as the fear the paranormal activity caused. I think there are definitely other beings out there and I know that they are not all good. Don't be afraid to seek help!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hpd9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "VladaVamp", "saved": false, "mod_reports": [], "name": "t3_65hpd9", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65hpd9/the_white_man/", "num_reports": null, "locked": false, "stickied": false, "created": 1492265532.0, "url": "https://www.reddit.com/r/Paranormal/comments/65hpd9/the_white_man/", "author_flair_text": null, "quarantine": false, "title": "The White Man", "created_utc": 1492236732.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65hpd9", "likes": null, "replies": "", "user_reports": [], "id": "dgadvg9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "annaroseloades", "parent_id": "t3_65hpd9", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Wow what an experience for you and your family!\n\nDefinitely sounds like a poltergeist to me (commonly demonic hauntings) that usually manifest in family homes where there is distress, trauma and unrest. Unfortunately, it sounds as if your family environment were ticking these boxes at the time. \n\nIt was such a blessing that grandmothe came to stay, having such a strong spiritual connection. People like this pick up on these poltergeist energies very quickly and I'm so pleased you all took action before things got even worse.\n\nUnfortunately, poltergeists are the most unfriendly of entities. They prey on the weak and vulnerable and manifest in times of great heartache and trauma. The experience of denomic like behaviour, noises,  scary dreams and visions are super common in these circumstances and you are absolutely right, they are not good!\n\nI am truly sorry you and your family experienced this but rest assured that you are not alone.\n\nOut of pure interest, not intending to be too personal, how are you guys? Are you living else where or are your parents still in the same house. Please watch out for your brother- having experienced this \"white man\" he is more vulnerable to future hauntings of this nature. \n\nTake care.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow what an experience for you and your family!&lt;/p&gt;\n\n&lt;p&gt;Definitely sounds like a poltergeist to me (commonly demonic hauntings) that usually manifest in family homes where there is distress, trauma and unrest. Unfortunately, it sounds as if your family environment were ticking these boxes at the time. &lt;/p&gt;\n\n&lt;p&gt;It was such a blessing that grandmothe came to stay, having such a strong spiritual connection. People like this pick up on these poltergeist energies very quickly and I&amp;#39;m so pleased you all took action before things got even worse.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, poltergeists are the most unfriendly of entities. They prey on the weak and vulnerable and manifest in times of great heartache and trauma. The experience of denomic like behaviour, noises,  scary dreams and visions are super common in these circumstances and you are absolutely right, they are not good!&lt;/p&gt;\n\n&lt;p&gt;I am truly sorry you and your family experienced this but rest assured that you are not alone.&lt;/p&gt;\n\n&lt;p&gt;Out of pure interest, not intending to be too personal, how are you guys? Are you living else where or are your parents still in the same house. Please watch out for your brother- having experienced this &amp;quot;white man&amp;quot; he is more vulnerable to future hauntings of this nature. &lt;/p&gt;\n\n&lt;p&gt;Take care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgadvg9", "score_hidden": false, "stickied": false, "created": 1492266756.0, "created_utc": 1492237956.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65hpd9", "likes": null, "replies": "", "user_reports": [], "id": "dgadzd2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_65hpd9", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I agree that it was demonic, and that it was drawn by the negativity in your home.  I'm so glad your grandmother came!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that it was demonic, and that it was drawn by the negativity in your home.  I&amp;#39;m so glad your grandmother came!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgadzd2", "score_hidden": false, "stickied": false, "created": 1492267013.0, "created_utc": 1492238213.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65hpd9", "likes": null, "replies": "", "user_reports": [], "id": "dgb6nbc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jackjmil64", "parent_id": "t3_65hpd9", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Great post!  I totally agree with your interpretation as I have had similar ones.  See my post 'Red Eyes Rising' in r/shadowpeople for my take. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post!  I totally agree with your interpretation as I have had similar ones.  See my post &amp;#39;Red Eyes Rising&amp;#39; in &lt;a href=\"/r/shadowpeople\"&gt;r/shadowpeople&lt;/a&gt; for my take. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgb6nbc", "score_hidden": false, "stickied": false, "created": 1492319612.0, "created_utc": 1492290812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]