[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I grew up in a Christian home, my mom goes to church, my auntie is the pastor of her own church, very strong Christian woman I might add. Her sister as well, that&amp;#39;ll become relevant later on. First of all I wanna say that what I&amp;#39;m about to say absolutely happened.\nA few weeks ago I was a very sinful man. I am still am but I pray now and renounce my sinful ways. I started having nightmares of my wife and son turning into demons or being chased by one, and I&amp;#39;d always hear music too. Like as if grey and black had a sound, I can&amp;#39;t explain it. Then I started feeling pokes on my back, the same spot over and over, at the time I thought it was a muscle spasm. Then I&amp;#39;d have a sore back, for no reason whatsoever. I&amp;#39;m a very fit guy too, I ran 3 miles with a 30 pound vest 3 days ago and I&amp;#39;m fine. \nSo I get into a fight with my wife and She tells me to leave because I&amp;#39;m being a dick more so than usual (haha) doing that I take 10$ to go have a toke. I know what you&amp;#39;re thinking. &amp;quot;Hurrr normie is having a THC freakout&amp;quot; \nThe way I used weed was to explore my subconscious mind, figure out stuff my sober self wouldn&amp;#39;t and I would better myself through that. Anyways, me and my pals are trying out the new bong one of my mates bought. I take the fattest hit ever and i start having a bad trip, probably because of the environment and my situation at home with the the wife. I start overthinking shit and how I&amp;#39;m such a bad fucking person. So I walk over to my moms house, keep in mind I live in a small town with 3 stores, 1 clinic, 2 schools, 3 churches and a whole lotta drug dealers. I walk in my moms house and I start confessing everything to her, all my secrets I&amp;#39;ve held onto for so many years, about cheating, stealing, lying, self fornicating. \nI ask her to start praying but I feel like it doesn&amp;#39;t work, so I ask if we can go see my auntie (the one who runs the local church as mentioned earlier.) she has more authority over these things. But what luck, she&amp;#39;s not at home or the church, so we go look for her at her sisters, which is 5km away. The thing too was nature wasn&amp;#39;t nice that day, we live on a swamp so half our roads are dirt and the snow was just melting. \nOn the ride there i start getting scared, like the most scared I have ever been in my entire life. I didn&amp;#39;t want to look in the mirror because I felt something behind me, I started praying, asking for forgiveness and whatnot. That&amp;#39;s when my vision started getting disoriented, and my speech skills were almost like someone with Tourette&amp;#39;s. Everytime I tried talk to my mom about something during the ride to my aunties I&amp;#39;d swear every 2 seconds. I couldn&amp;#39;t help it, like I was being hijacked. \nBy the time we got to my aunties house we started talking about my confessions and what I was feeling at that very moment. We started praying, all three of us, and it was so surreal. I started twitching, and my vision made my mom look like her nose was longer and eyes smaller. I swear for one second I seen holes on my hands, which felt really blasphemous. \nThis is where it gets good. Something inside my started getting angry, because I felt angry and I never felt a hate so ugly that day. The poking at my back became rapid fast, like it was trying to get my attention, so my auntie started praying in tongues. \nI still get tears thinking about this moment, because when she started doing so I felt like I was being fought over. Like I was being tugged on both arms. I&amp;#39;ve never felt so hated and so loved at the same time. I wish I could say something excited happened after that, like I started floating up in the air, or having my head spin in circles. Instead what happened was, whatever loved me, won. I had tears running down my face, I no longer felt the poking on my back, I didn&amp;#39;t feel so hated or ugly anymore. &lt;/p&gt;\n\n&lt;p&gt;I pray and read the bible now, and I&amp;#39;m working on being a better husband and father. It was scary back then but it&amp;#39;s actually something cool to think about now. I don&amp;#39;t expect none of you to believe me, but I felt like I should tell you fellas my experience. Thanks for reading and god bless.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I grew up in a Christian home, my mom goes to church, my auntie is the pastor of her own church, very strong Christian woman I might add. Her sister as well, that'll become relevant later on. First of all I wanna say that what I'm about to say absolutely happened.\nA few weeks ago I was a very sinful man. I am still am but I pray now and renounce my sinful ways. I started having nightmares of my wife and son turning into demons or being chased by one, and I'd always hear music too. Like as if grey and black had a sound, I can't explain it. Then I started feeling pokes on my back, the same spot over and over, at the time I thought it was a muscle spasm. Then I'd have a sore back, for no reason whatsoever. I'm a very fit guy too, I ran 3 miles with a 30 pound vest 3 days ago and I'm fine. \nSo I get into a fight with my wife and She tells me to leave because I'm being a dick more so than usual (haha) doing that I take 10$ to go have a toke. I know what you're thinking. \"Hurrr normie is having a THC freakout\" \nThe way I used weed was to explore my subconscious mind, figure out stuff my sober self wouldn't and I would better myself through that. Anyways, me and my pals are trying out the new bong one of my mates bought. I take the fattest hit ever and i start having a bad trip, probably because of the environment and my situation at home with the the wife. I start overthinking shit and how I'm such a bad fucking person. So I walk over to my moms house, keep in mind I live in a small town with 3 stores, 1 clinic, 2 schools, 3 churches and a whole lotta drug dealers. I walk in my moms house and I start confessing everything to her, all my secrets I've held onto for so many years, about cheating, stealing, lying, self fornicating. \nI ask her to start praying but I feel like it doesn't work, so I ask if we can go see my auntie (the one who runs the local church as mentioned earlier.) she has more authority over these things. But what luck, she's not at home or the church, so we go look for her at her sisters, which is 5km away. The thing too was nature wasn't nice that day, we live on a swamp so half our roads are dirt and the snow was just melting. \nOn the ride there i start getting scared, like the most scared I have ever been in my entire life. I didn't want to look in the mirror because I felt something behind me, I started praying, asking for forgiveness and whatnot. That's when my vision started getting disoriented, and my speech skills were almost like someone with Tourette's. Everytime I tried talk to my mom about something during the ride to my aunties I'd swear every 2 seconds. I couldn't help it, like I was being hijacked. \nBy the time we got to my aunties house we started talking about my confessions and what I was feeling at that very moment. We started praying, all three of us, and it was so surreal. I started twitching, and my vision made my mom look like her nose was longer and eyes smaller. I swear for one second I seen holes on my hands, which felt really blasphemous. \nThis is where it gets good. Something inside my started getting angry, because I felt angry and I never felt a hate so ugly that day. The poking at my back became rapid fast, like it was trying to get my attention, so my auntie started praying in tongues. \nI still get tears thinking about this moment, because when she started doing so I felt like I was being fought over. Like I was being tugged on both arms. I've never felt so hated and so loved at the same time. I wish I could say something excited happened after that, like I started floating up in the air, or having my head spin in circles. Instead what happened was, whatever loved me, won. I had tears running down my face, I no longer felt the poking on my back, I didn't feel so hated or ugly anymore. \n\nI pray and read the bible now, and I'm working on being a better husband and father. It was scary back then but it's actually something cool to think about now. I don't expect none of you to believe me, but I felt like I should tell you fellas my experience. Thanks for reading and god bless.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65i096", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "Dad_left", "saved": false, "mod_reports": [], "name": "t3_65i096", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65i096/it_was_angry/", "num_reports": null, "locked": false, "stickied": false, "created": 1492271355.0, "url": "https://www.reddit.com/r/Paranormal/comments/65i096/it_was_angry/", "author_flair_text": null, "quarantine": false, "title": "It was angry", "created_utc": 1492242555.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65i096", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65i096", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65i096", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65i096", "likes": null, "replies": "", "user_reports": [], "id": "dgcoj9o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dad_left", "parent_id": "t1_dgc0jsa", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Yeah same here. My mind was very violent and inappropriate because of it. I was very ashamed to confess everything but I'm glad I did ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah same here. My mind was very violent and inappropriate because of it. I was very ashamed to confess everything but I&amp;#39;m glad I did &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgcoj9o", "score_hidden": false, "stickied": false, "created": 1492410583.0, "created_utc": 1492381783.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0jsa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "patssister1960", "parent_id": "t1_dgbimte", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I didn't mean to be flip, sorry.  I'm very, very glad you were able to beat the demon and get rid of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t mean to be flip, sorry.  I&amp;#39;m very, very glad you were able to beat the demon and get rid of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgc0jsa", "score_hidden": false, "stickied": false, "created": 1492377477.0, "created_utc": 1492348677.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbimte", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dad_left", "parent_id": "t1_dgaoh2k", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thanks pal ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks pal &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgbimte", "score_hidden": false, "stickied": false, "created": 1492336692.0, "created_utc": 1492307892.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoh2k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_65i096", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Glad you're back and working on bettering yourself!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad you&amp;#39;re back and working on bettering yourself!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgaoh2k", "score_hidden": false, "stickied": false, "created": 1492294235.0, "created_utc": 1492265435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65i096", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65i096", "likes": null, "replies": "", "user_reports": [], "id": "dgbimie", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dad_left", "parent_id": "t1_dgax50e", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I think so too lol ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think so too lol &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgbimie", "score_hidden": false, "stickied": false, "created": 1492336681.0, "created_utc": 1492307881.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgax50e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DJysyed", "parent_id": "t3_65i096", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "You got possessed", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You got possessed&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgax50e", "score_hidden": false, "stickied": false, "created": 1492306688.0, "created_utc": 1492277888.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]