[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mentioned being chased in my friends car, by whatever it was that was in that house. Well, I guess I&amp;#39;ll explain how that happened. To start with, I mentioned before that this was a row home in the Parkwood section of Philadelphia. It has three floors, the bottom floor being a garage that was converted into a living space/laundry room. My in-laws use it as their living room, and completely ignore the actual living room upstairs. Because it use to be a garage, there is a door in the front that leads out into the driveway and onto the road.&lt;/p&gt;\n\n&lt;p&gt;This particular night, my wife and I (dating at the time) were out with my mother and a couple of her friends, to see a movie. When the movie ended, my mothers friend offered to drive my wife home since he was taking me and my mom home as well. They all knew that my wife&amp;#39;s parents house was haunted at this point but it was the first time they had actually seen the place.&lt;/p&gt;\n\n&lt;p&gt;Like I said, the bottom floor, being the former garage, had two doors that led out into the driveway. My mother in law has curtains hanging over those doors. When we pulled up next to the house, we all saw the curtains being pulled back, like something was peering out at us. The thing is that nobody in the house was awake at that moment and the basement was pitch black. You could see the curtains pulled aside but beyond them, you could see nothing because it was so dark inside...as we got out of the car, the curtains moved back into place, like whoever had been holding them let them go. It gets worse from there.&lt;/p&gt;\n\n&lt;p&gt;I walked my wife to the front door and when she put the key in it got stuck. It wouldn&amp;#39;t turn at all and she couldn&amp;#39;t remove it either. She was pulling at the key and pushing at the door, doing all kinds of things to try and get it to either turn or pull free from the lock...nothing. Finally after five minutes of struggling, she got the key out and when she pulled it out and she was about to lose her patience, the door just opened on it&amp;#39;s own. And when I say it opened on it&amp;#39;s own, I mean the door knob turned right in front of us and the door just slowly opened.&lt;/p&gt;\n\n&lt;p&gt;We were both completely stunned and very freaked out at this point but she wasn&amp;#39;t allowed to stay out of the house overnight at that point in time, so she had no choice but to go in and call it a night despite not wanting to be there. So I kissed her goodnight and made my way back to the car. I told my mom and her friends what happened (her friends are both wiccan) and everyone in the car agreed, they could feel something watching them from the window.&lt;/p&gt;\n\n&lt;p&gt;So this is where shit gets real (excuse my language lol)&lt;/p&gt;\n\n&lt;p&gt;We were parked alongside the driveway. My mom&amp;#39;s friend didn&amp;#39;t want to pull in, because he didn&amp;#39;t want to make my wife&amp;#39;s parents angry for using their driveway or whatever. So we&amp;#39;re about to pull off and onto the highway (her house runs along side the highway) When these headlights that are so bright, you can&amp;#39;t even see the car behind them, come out of nowhere. So my mom&amp;#39;s friend starts driving and these lights are following behind us, nothing out of the ordinary at first.&lt;/p&gt;\n\n&lt;p&gt;As we&amp;#39;re coming up the ramp onto the highway the lights start getting closer to us. At this time of the night (it was like 1:00 in the morning) there was no one else up there but us. The &amp;quot;vehicle&amp;quot; behind us began moving so fast that my mom&amp;#39;s friend had to step on the gas and start moving faster. The faster we moved, the faster this &amp;quot;vehicle&amp;quot; moved. Now at first we thought, this was just some douche bag probably drunk and trying to start trouble by riding our ass the whole way. We get up on the highway and we&amp;#39;re speeding at this point. We had to have been going at least 100 miles per hour trying to get away from these lights and they just stayed right on top of us, the entire way.&lt;/p&gt;\n\n&lt;p&gt;The direction we were going leads to a dead end. Once you reach the end of the stretch, it leads into this big yard full of trucks that belongs to a warehouse or something, I think. We passed the last exit and these lights are still right on top of us. We get to the end of the stretch and my mom&amp;#39;s friend obviously has no choice but to stop the car. So we come to basically a screeching halt and move to turn around, since the end of the line loops around so you can get back on the highway and go back the opposite direction.&lt;/p&gt;\n\n&lt;p&gt;As we come to a stop and start looping back around...the lights are gone. There&amp;#39;s no car behind us, there is no car near us, there are NO cars ANYWHERE In that general area. There&amp;#39;s no indication that ANYONE or ANYTHING was following us, at all. Had it actually been a car, it still should have been behind us even when we reached the end of the stretch, because we had passed the last exit and it was still behind us after that final exit...so where the hell did it go? We were all stunned and completely freaked at this point.&lt;/p&gt;\n\n&lt;p&gt;My mom&amp;#39;s friend had to pull over to the side of the road (he didn&amp;#39;t want to pull into the truck yard, because it was pitch black and surrounded by trees) and take a few minutes before he could drive again. He was too shaken up to move for about fifteen minutes. &lt;/p&gt;\n\n&lt;p&gt;When we got home I looked up my wife&amp;#39;s house on google maps and zoomed in to street view. I moved along the map from her house up onto the highway and followed it, to the point where we had stopped just to see what was there. Alongside the truck yard was a road that you could continue driving down, but it&amp;#39;s pitch black and surrounded by woods. I don&amp;#39;t know where that leads too but I&amp;#39;m glad this thing did not chase us further down there.&lt;/p&gt;\n\n&lt;p&gt;I should note that the entire time this thing was chasing us, we had this very dominating feeling of impending doom. It was suffocating and we ALL felt it. I remember we had the windows down. I remember the sound of the wind blasting in my ears because like I said, we must have been going at least 100 miles per hour. I remember my mom trying to yell something about what was happening, but none of us could make out what she was saying over the wind. All I could hear was my own heart pounding. It was seriously like something out of a horror movie.&lt;/p&gt;\n\n&lt;p&gt;I called my wife when I got home and told her what had happened. She told me that since we had left her there, she had been hearing nothing but banging on her closet door and her cat was sitting right in front of it and hissing. Her parents kept yelling at her because they thought she was banging on the walls and making the noise herself, but obviously it wasn&amp;#39;t her. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s probably one of the most terrifying experiences I&amp;#39;ve had, involving that house. The other time was when I&amp;#39;m pretty sure my wife was either temporarily possessed, or at the very least, under some sort of control from whatever was in the house. I&amp;#39;ll talk about that in my next post. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t say for sure that it was related to the experience we&amp;#39;d had, but the very next morning, I woke up sick as a dog. I barely slept that night and I got out of bed at around 8:00 in the morning and spent half the day throwing up with a very high fever. Again, I can&amp;#39;t say for sure it had anything to do with what had happened the night before, but I know some people say that these things can effect your health and what not...so who knows. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I mentioned being chased in my friends car, by whatever it was that was in that house. Well, I guess I'll explain how that happened. To start with, I mentioned before that this was a row home in the Parkwood section of Philadelphia. It has three floors, the bottom floor being a garage that was converted into a living space/laundry room. My in-laws use it as their living room, and completely ignore the actual living room upstairs. Because it use to be a garage, there is a door in the front that leads out into the driveway and onto the road.\n\nThis particular night, my wife and I (dating at the time) were out with my mother and a couple of her friends, to see a movie. When the movie ended, my mothers friend offered to drive my wife home since he was taking me and my mom home as well. They all knew that my wife's parents house was haunted at this point but it was the first time they had actually seen the place.\n\nLike I said, the bottom floor, being the former garage, had two doors that led out into the driveway. My mother in law has curtains hanging over those doors. When we pulled up next to the house, we all saw the curtains being pulled back, like something was peering out at us. The thing is that nobody in the house was awake at that moment and the basement was pitch black. You could see the curtains pulled aside but beyond them, you could see nothing because it was so dark inside...as we got out of the car, the curtains moved back into place, like whoever had been holding them let them go. It gets worse from there.\n\nI walked my wife to the front door and when she put the key in it got stuck. It wouldn't turn at all and she couldn't remove it either. She was pulling at the key and pushing at the door, doing all kinds of things to try and get it to either turn or pull free from the lock...nothing. Finally after five minutes of struggling, she got the key out and when she pulled it out and she was about to lose her patience, the door just opened on it's own. And when I say it opened on it's own, I mean the door knob turned right in front of us and the door just slowly opened.\n\nWe were both completely stunned and very freaked out at this point but she wasn't allowed to stay out of the house overnight at that point in time, so she had no choice but to go in and call it a night despite not wanting to be there. So I kissed her goodnight and made my way back to the car. I told my mom and her friends what happened (her friends are both wiccan) and everyone in the car agreed, they could feel something watching them from the window.\n\nSo this is where shit gets real (excuse my language lol)\n\nWe were parked alongside the driveway. My mom's friend didn't want to pull in, because he didn't want to make my wife's parents angry for using their driveway or whatever. So we're about to pull off and onto the highway (her house runs along side the highway) When these headlights that are so bright, you can't even see the car behind them, come out of nowhere. So my mom's friend starts driving and these lights are following behind us, nothing out of the ordinary at first.\n\nAs we're coming up the ramp onto the highway the lights start getting closer to us. At this time of the night (it was like 1:00 in the morning) there was no one else up there but us. The \"vehicle\" behind us began moving so fast that my mom's friend had to step on the gas and start moving faster. The faster we moved, the faster this \"vehicle\" moved. Now at first we thought, this was just some douche bag probably drunk and trying to start trouble by riding our ass the whole way. We get up on the highway and we're speeding at this point. We had to have been going at least 100 miles per hour trying to get away from these lights and they just stayed right on top of us, the entire way.\n\nThe direction we were going leads to a dead end. Once you reach the end of the stretch, it leads into this big yard full of trucks that belongs to a warehouse or something, I think. We passed the last exit and these lights are still right on top of us. We get to the end of the stretch and my mom's friend obviously has no choice but to stop the car. So we come to basically a screeching halt and move to turn around, since the end of the line loops around so you can get back on the highway and go back the opposite direction.\n\nAs we come to a stop and start looping back around...the lights are gone. There's no car behind us, there is no car near us, there are NO cars ANYWHERE In that general area. There's no indication that ANYONE or ANYTHING was following us, at all. Had it actually been a car, it still should have been behind us even when we reached the end of the stretch, because we had passed the last exit and it was still behind us after that final exit...so where the hell did it go? We were all stunned and completely freaked at this point.\n\nMy mom's friend had to pull over to the side of the road (he didn't want to pull into the truck yard, because it was pitch black and surrounded by trees) and take a few minutes before he could drive again. He was too shaken up to move for about fifteen minutes. \n\nWhen we got home I looked up my wife's house on google maps and zoomed in to street view. I moved along the map from her house up onto the highway and followed it, to the point where we had stopped just to see what was there. Alongside the truck yard was a road that you could continue driving down, but it's pitch black and surrounded by woods. I don't know where that leads too but I'm glad this thing did not chase us further down there.\n\nI should note that the entire time this thing was chasing us, we had this very dominating feeling of impending doom. It was suffocating and we ALL felt it. I remember we had the windows down. I remember the sound of the wind blasting in my ears because like I said, we must have been going at least 100 miles per hour. I remember my mom trying to yell something about what was happening, but none of us could make out what she was saying over the wind. All I could hear was my own heart pounding. It was seriously like something out of a horror movie.\n\nI called my wife when I got home and told her what had happened. She told me that since we had left her there, she had been hearing nothing but banging on her closet door and her cat was sitting right in front of it and hissing. Her parents kept yelling at her because they thought she was banging on the walls and making the noise herself, but obviously it wasn't her. \n\nThat's probably one of the most terrifying experiences I've had, involving that house. The other time was when I'm pretty sure my wife was either temporarily possessed, or at the very least, under some sort of control from whatever was in the house. I'll talk about that in my next post. \n\nI can't say for sure that it was related to the experience we'd had, but the very next morning, I woke up sick as a dog. I barely slept that night and I got out of bed at around 8:00 in the morning and spent half the day throwing up with a very high fever. Again, I can't say for sure it had anything to do with what had happened the night before, but I know some people say that these things can effect your health and what not...so who knows. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65jx8o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "Flyersfan1989", "saved": false, "mod_reports": [], "name": "t3_65jx8o", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492273674.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65jx8o/i_got_a_lot_of_comments_on_my_last_post_about_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492302253.0, "url": "https://www.reddit.com/r/Paranormal/comments/65jx8o/i_got_a_lot_of_comments_on_my_last_post_about_my/", "author_flair_text": null, "quarantine": false, "title": "I got a lot of comments on my last post, about my wife's parents house and the experiences she had growing up there. I was going to wait to post another one but, a lot of people are interested in seeing more so I figured I'll do it now.", "created_utc": 1492273453.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65jx8o", "likes": null, "replies": "", "user_reports": [], "id": "dgbg8db", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Infectt", "parent_id": "t3_65jx8o", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Annnnnddd I don't want to sleep anymore. I'll keep the lights on tonight I guess. \nI read both stories of yours and even though I'm a skeptical, I must admit that paranormal occurrences seriously freak me out (shivers, small tears, etc). \nI sincerely hope the situation improved since that happened, I wouldn't be able to live with something like this around me all the time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Annnnnddd I don&amp;#39;t want to sleep anymore. I&amp;#39;ll keep the lights on tonight I guess. \nI read both stories of yours and even though I&amp;#39;m a skeptical, I must admit that paranormal occurrences seriously freak me out (shivers, small tears, etc). \nI sincerely hope the situation improved since that happened, I wouldn&amp;#39;t be able to live with something like this around me all the time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgbg8db", "score_hidden": false, "stickied": false, "created": 1492333226.0, "created_utc": 1492304426.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65jx8o", "likes": null, "replies": "", "user_reports": [], "id": "dgboxtj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JordanThaGod", "parent_id": "t3_65jx8o", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Great stories you have mate , probably some of my favorite.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great stories you have mate , probably some of my favorite.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgboxtj", "score_hidden": false, "stickied": false, "created": 1492346495.0, "created_utc": 1492317695.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65jx8o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65jx8o", "likes": null, "replies": "", "user_reports": [], "id": "dgcgoo9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Flyersfan1989", "parent_id": "t1_dgcg68a", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Actually yes, I have. There were native Americans there back in the 1700s i believe. The Quakers pretty much forced them out, as the Indians didn't agree with their way of life. I believe it was the lenape tribe (hope I spelled that right) the theory is they may have cursed the land, before they left. I know other people who live in that neighborhood and they too, have had encounters in their homes...im confident it's associated with that whole area and not just that particular house. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually yes, I have. There were native Americans there back in the 1700s i believe. The Quakers pretty much forced them out, as the Indians didn&amp;#39;t agree with their way of life. I believe it was the lenape tribe (hope I spelled that right) the theory is they may have cursed the land, before they left. I know other people who live in that neighborhood and they too, have had encounters in their homes...im confident it&amp;#39;s associated with that whole area and not just that particular house. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgcgoo9", "score_hidden": false, "stickied": false, "created": 1492400310.0, "created_utc": 1492371510.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcg68a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_65jx8o", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Thanks for  posting!!  That would scare the shit outta me too, man.  Have you done any research into that area of the city, or that suburb, or just the row of houses containing the haunted one?  Just curious.  Can't wait to hear more, keep 'em coming! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for  posting!!  That would scare the shit outta me too, man.  Have you done any research into that area of the city, or that suburb, or just the row of houses containing the haunted one?  Just curious.  Can&amp;#39;t wait to hear more, keep &amp;#39;em coming! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgcg68a", "score_hidden": false, "stickied": false, "created": 1492399648.0, "created_utc": 1492370848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65jx8o", "likes": null, "replies": "", "user_reports": [], "id": "dgclzgb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chiefoftheworld", "parent_id": "t3_65jx8o", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Oh man, that sounds terrifying! I'm glad you guys didn't end up getting in an accident while trying to evade the \"ghost car\". But I can't wait to read your next post! Thanks for sharing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man, that sounds terrifying! I&amp;#39;m glad you guys didn&amp;#39;t end up getting in an accident while trying to evade the &amp;quot;ghost car&amp;quot;. But I can&amp;#39;t wait to read your next post! Thanks for sharing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgclzgb", "score_hidden": false, "stickied": false, "created": 1492407194.0, "created_utc": 1492378394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65jx8o", "likes": null, "replies": "", "user_reports": [], "id": "dgdsaok", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GhostsOnly", "parent_id": "t3_65jx8o", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've puked before from spirit but to me it was part of getting an energetic upgrade, so I wasn't freaked out about it. I was more like, \"This sucks but it's really cool because it means SOMETHING'S HAPPENING!\" It meant I was evolving.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve puked before from spirit but to me it was part of getting an energetic upgrade, so I wasn&amp;#39;t freaked out about it. I was more like, &amp;quot;This sucks but it&amp;#39;s really cool because it means SOMETHING&amp;#39;S HAPPENING!&amp;quot; It meant I was evolving.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdsaok", "score_hidden": false, "stickied": false, "created": 1492478344.0, "created_utc": 1492449544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]