[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not good at formatting, so bare with me please...&lt;/p&gt;\n\n&lt;p&gt;Back when I was a fifth-grader, my grandparents bought a house for my uncle and his family.  He was in the military and his wife worked as a house cleaner. They didn&amp;#39;t have much income, hence my grandparents purchasing the house for them.  It was an 80&amp;#39;s (i think) split-level home with stairs as soon as you walked inside the front door. The upstairs held the sitting room to the right and a hallway to the left. Straight ahead was the kitchen and small attached dining area with sliding glass doors. The sliding glass doors opened to a room that had been added on, which we called the &amp;quot;window room&amp;quot;. It was wall to wall windows, used as the main living area.  Going back down the hallway, you come to two bedrooms at the end and one bedroom to the left. One bathroom was there also, on the right. The bathroom was strange. From the very moment I visited the house and walked into that bathroom for the first time I got creeped out. It had mirrors covering every wall that had a gold flake marble effect on it. Something about it was just weird, ugly too.  My uncle had three sons which were, at the time, aged 11, 10 and 4. These cousins were like my brothers. I was the only girl cousin in the whole familial generation but they were always very good with me and more sensitive than maybe your average males.  I&amp;#39;m kind of rambling, so I&amp;#39;ll just get to it.\nThe basement was basically the kid&amp;#39;s hangout. We always hung out down there, and slept down there during sleepovers. They had a sofa on one side of the living area and another sofa that was a pull-out bed on the other wall.  As kids, you don&amp;#39;t notice much, especially with a gang of kids around at all times.  A consistent event though was that people would think they were being hit in their sleep. This happened to multiple people over a few years but I always assumed my cousins were pranking each other until I was accused of hitting someone. I personally never got hit in my sleep but on the night I was accused we had five people staying over. I shared the pull out bed with a boy named Andrew. I had just dozed off when he jerked straight up yelling at me for slapping him in the face! I insisted that I hadn&amp;#39;t but he didn&amp;#39;t believe me. Like I said, though, as kids you brush things off. \nNow I&amp;#39;m going to flash forward to adulthood. I was pregnant at 19. My boyfriend and I lived together with my mom. She was in the midst of a troubled marriage to my step-father and one day decided to leave him. My uncle had moved out of the house my grandparents owned maybe a week before, so that is where we went.  We ended up living in this house for several years after that.  My relationship with my boyfriend had been a little bit of a struggle for the past four years when we moved in, but we were on the mend and planning to marry.  Almost immediately after moving into the house though, things took a turn for the worst.  My boyfriend began to get violent with me on a regular basis. It started with pushing and small things like that and eventually escalated to choking and threats that prompted neighbors to call police. Yes, this was during pregnancy and yes, I did leave him when my son was 2. My uncle and his wife had faced a similar fate previously. My once benign uncle had become a drunken hermit, holding a gun to his head and threatening to commit suicide several times a year.  Moving on to when my son was three, I met a new guy. Because he was a loser, he immediately moved into the house with me. A fate quite similar awaited us. Things took a weird turn and I felt like this boyfriend, whom I had known since second grade was suddenly a person I couldn&amp;#39;t recognize.  He however had different type of violent outbursts which happened in his sleep. He would later be diagnosed with R.E.M. sleep disorder. It doesn&amp;#39;t affect him anymore. In fact, upon moving out of the house it stopped all together.  While you may be thinking you&amp;#39;d wish I&amp;#39;s stop rambling and just get to all the paranormal stuff, this really sets the tone for how things were for those who lived in the house. Life took a dismal turn for people living there. I soon figured out though, that maybe it wasn&amp;#39;t just our house. The street was small, maybe 50 houses total. Typical middle-class subdivision in small-town KY. So, in the time span that my uncle and I lived in the house, here were some of the things that happened on our street:&lt;/p&gt;\n\n&lt;p&gt;Husband stabs wife to death in home, 2 young daughters returning after school get off and find their mother dead in the house.&lt;/p&gt;\n\n&lt;p&gt;Man only 30 years old, dies of a burst (yes burst) heart after using coke.&lt;/p&gt;\n\n&lt;p&gt;Boy, 8 years dies of asthma attack &lt;/p&gt;\n\n&lt;p&gt;woman, 38 dies from a fall down the basement stairs and stays there for a couple weeks until she is discovered.&lt;/p&gt;\n\n&lt;p&gt;Man, middle aged, two doors to the right of us hangs himself in backyard. He was a preacher. I was standing outside my house smoking a cigarette when his wife found him. Her screams will never exit my mind.&lt;/p&gt;\n\n&lt;p&gt;These are just a few of the things that happened on our street! Crazy, right? If people seriously want verification, I will try my best to find public records. &lt;/p&gt;\n\n&lt;p&gt;Have you ever been dozing off and heard words whispered in your ear? I had two instances of that. One was a man who strangely said, &amp;quot;I&amp;#39;m stinking. I&amp;#39;ve been working with the horses all day.&amp;quot; and the other was a female voices spitting out pure profanity, &amp;quot;fucking bitch, kill yourself, hahaha, ugly fucking whore, etc...&amp;quot; It was really scary, but I pretty much brushed those off as some kind of dream induced state.&lt;br/&gt;\nAnother thing that happened, and for some reason the most scary, was one late night, 3am or so I was in the kitchen washing baby bottles. My kitchen had a window just above the sink which looked out into the back yard.  You can see the kitchen in the outline behind you when you&amp;#39;re in front of that window at night due to the poor light reflection.  As I&amp;#39;m washing bottles I see my boyfriend walk into the kitchen and stand behind me, leaning against the wall. I began to talk about something which I don&amp;#39;t remember but I got to a point in speaking where I had asked a question.  When I garnered no response I turned around being an asshole and said, &amp;quot;Hello!&amp;quot; and as you can probably guess, nobody was there. I checked the bedroom and he and my son were fast asleep. Whatever it was was just standing there watching me. \nAnother time, my boyfriend and I were sleeping and his computer suddenly started blaring old music...like 1800&amp;#39;s bluegrass. we ran in the adjacent room to turn off the computer so it wouldn&amp;#39;t wake our son, but the screen was still off. The music stopped just as it had started, suddenly.  This was in year 2003, before the likes of pandora and similar music streaming sites. The music was something I had never heard and sounded like it was being played in one of those big horn-looking things from back in the day. This happened a total of three times, each time the same song. We never did find the source.  &lt;/p&gt;\n\n&lt;p&gt;one night, I&amp;#39;m lying in bed waiting on my boyfriend to get home from his second shift job. It&amp;#39;s about 11pm and I hear him trying to get into the bedroom. Our door frame was messed up due to a previous bout of violence from a fight in which he kicked the locked door in. It would occasionally get stuck and you&amp;#39;d have to rattle it to get it open.  I leaned over to the door and as soon as my hand met the knob it stopped rattling.  I opened the door and yeah, nobody. He hasn&amp;#39;t gotten home yet.  &lt;/p&gt;\n\n&lt;p&gt;I have so many small stories like this but I couldn&amp;#39;t possibly type them all now. I will finish with the mother of all of them...\nI saw a man. I was lying bed and got up to turn my light off and just as i looked out the bedroom door and man was walking down the hall.  He was silent, no creaking footsteps like you&amp;#39;d usually hear from someone walking down the hall.  He didn&amp;#39;t look my way, just kept walking. He turned the corner to go into that creepy bathroom until he was out of sight.  I saw a man! I was freaking out some, but not as much as I had imagined I would if something like that ever happened to me.  He was probably about 55-60. Grey hair, wrinkled face, thin to medium build, short only about 5&amp;quot;7&amp;#39; and was wearing a blue work uniform like a mechanic or something. I guess the only thing I didn&amp;#39;t see were his feet.  He looked sad.  &lt;/p&gt;\n\n&lt;p&gt;As I said, I have so many small stories that I couldn&amp;#39;t possibly list them all here but here&amp;#39;s something I found in doing some research years after moving out:&lt;/p&gt;\n\n&lt;p&gt;Our house along with most in our neighborhood had been built using recycled bricks from a prison in our town that was shut down in the 70&amp;#39;s (I think, maybe early 80&amp;quot;s).  In the south side of our city we had an underground prison...these were the bricks.  I thought maybe it could explain all the bad juju on our street. Who knows.  If anybody has any questions or wants to hear further stores, just let me know. Hopefully my poor writing skills didn&amp;#39;t put you to sleep. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not good at formatting, so bare with me please...\n\nBack when I was a fifth-grader, my grandparents bought a house for my uncle and his family.  He was in the military and his wife worked as a house cleaner. They didn't have much income, hence my grandparents purchasing the house for them.  It was an 80's (i think) split-level home with stairs as soon as you walked inside the front door. The upstairs held the sitting room to the right and a hallway to the left. Straight ahead was the kitchen and small attached dining area with sliding glass doors. The sliding glass doors opened to a room that had been added on, which we called the \"window room\". It was wall to wall windows, used as the main living area.  Going back down the hallway, you come to two bedrooms at the end and one bedroom to the left. One bathroom was there also, on the right. The bathroom was strange. From the very moment I visited the house and walked into that bathroom for the first time I got creeped out. It had mirrors covering every wall that had a gold flake marble effect on it. Something about it was just weird, ugly too.  My uncle had three sons which were, at the time, aged 11, 10 and 4. These cousins were like my brothers. I was the only girl cousin in the whole familial generation but they were always very good with me and more sensitive than maybe your average males.  I'm kind of rambling, so I'll just get to it.\nThe basement was basically the kid's hangout. We always hung out down there, and slept down there during sleepovers. They had a sofa on one side of the living area and another sofa that was a pull-out bed on the other wall.  As kids, you don't notice much, especially with a gang of kids around at all times.  A consistent event though was that people would think they were being hit in their sleep. This happened to multiple people over a few years but I always assumed my cousins were pranking each other until I was accused of hitting someone. I personally never got hit in my sleep but on the night I was accused we had five people staying over. I shared the pull out bed with a boy named Andrew. I had just dozed off when he jerked straight up yelling at me for slapping him in the face! I insisted that I hadn't but he didn't believe me. Like I said, though, as kids you brush things off. \nNow I'm going to flash forward to adulthood. I was pregnant at 19. My boyfriend and I lived together with my mom. She was in the midst of a troubled marriage to my step-father and one day decided to leave him. My uncle had moved out of the house my grandparents owned maybe a week before, so that is where we went.  We ended up living in this house for several years after that.  My relationship with my boyfriend had been a little bit of a struggle for the past four years when we moved in, but we were on the mend and planning to marry.  Almost immediately after moving into the house though, things took a turn for the worst.  My boyfriend began to get violent with me on a regular basis. It started with pushing and small things like that and eventually escalated to choking and threats that prompted neighbors to call police. Yes, this was during pregnancy and yes, I did leave him when my son was 2. My uncle and his wife had faced a similar fate previously. My once benign uncle had become a drunken hermit, holding a gun to his head and threatening to commit suicide several times a year.  Moving on to when my son was three, I met a new guy. Because he was a loser, he immediately moved into the house with me. A fate quite similar awaited us. Things took a weird turn and I felt like this boyfriend, whom I had known since second grade was suddenly a person I couldn't recognize.  He however had different type of violent outbursts which happened in his sleep. He would later be diagnosed with R.E.M. sleep disorder. It doesn't affect him anymore. In fact, upon moving out of the house it stopped all together.  While you may be thinking you'd wish I's stop rambling and just get to all the paranormal stuff, this really sets the tone for how things were for those who lived in the house. Life took a dismal turn for people living there. I soon figured out though, that maybe it wasn't just our house. The street was small, maybe 50 houses total. Typical middle-class subdivision in small-town KY. So, in the time span that my uncle and I lived in the house, here were some of the things that happened on our street:\n\nHusband stabs wife to death in home, 2 young daughters returning after school get off and find their mother dead in the house.\n\nMan only 30 years old, dies of a burst (yes burst) heart after using coke.\n\nBoy, 8 years dies of asthma attack \n\nwoman, 38 dies from a fall down the basement stairs and stays there for a couple weeks until she is discovered.\n\nMan, middle aged, two doors to the right of us hangs himself in backyard. He was a preacher. I was standing outside my house smoking a cigarette when his wife found him. Her screams will never exit my mind.\n\nThese are just a few of the things that happened on our street! Crazy, right? If people seriously want verification, I will try my best to find public records. \n\nHave you ever been dozing off and heard words whispered in your ear? I had two instances of that. One was a man who strangely said, \"I'm stinking. I've been working with the horses all day.\" and the other was a female voices spitting out pure profanity, \"fucking bitch, kill yourself, hahaha, ugly fucking whore, etc...\" It was really scary, but I pretty much brushed those off as some kind of dream induced state.  \nAnother thing that happened, and for some reason the most scary, was one late night, 3am or so I was in the kitchen washing baby bottles. My kitchen had a window just above the sink which looked out into the back yard.  You can see the kitchen in the outline behind you when you're in front of that window at night due to the poor light reflection.  As I'm washing bottles I see my boyfriend walk into the kitchen and stand behind me, leaning against the wall. I began to talk about something which I don't remember but I got to a point in speaking where I had asked a question.  When I garnered no response I turned around being an asshole and said, \"Hello!\" and as you can probably guess, nobody was there. I checked the bedroom and he and my son were fast asleep. Whatever it was was just standing there watching me. \nAnother time, my boyfriend and I were sleeping and his computer suddenly started blaring old music...like 1800's bluegrass. we ran in the adjacent room to turn off the computer so it wouldn't wake our son, but the screen was still off. The music stopped just as it had started, suddenly.  This was in year 2003, before the likes of pandora and similar music streaming sites. The music was something I had never heard and sounded like it was being played in one of those big horn-looking things from back in the day. This happened a total of three times, each time the same song. We never did find the source.  \n\none night, I'm lying in bed waiting on my boyfriend to get home from his second shift job. It's about 11pm and I hear him trying to get into the bedroom. Our door frame was messed up due to a previous bout of violence from a fight in which he kicked the locked door in. It would occasionally get stuck and you'd have to rattle it to get it open.  I leaned over to the door and as soon as my hand met the knob it stopped rattling.  I opened the door and yeah, nobody. He hasn't gotten home yet.  \n\nI have so many small stories like this but I couldn't possibly type them all now. I will finish with the mother of all of them...\nI saw a man. I was lying bed and got up to turn my light off and just as i looked out the bedroom door and man was walking down the hall.  He was silent, no creaking footsteps like you'd usually hear from someone walking down the hall.  He didn't look my way, just kept walking. He turned the corner to go into that creepy bathroom until he was out of sight.  I saw a man! I was freaking out some, but not as much as I had imagined I would if something like that ever happened to me.  He was probably about 55-60. Grey hair, wrinkled face, thin to medium build, short only about 5\"7' and was wearing a blue work uniform like a mechanic or something. I guess the only thing I didn't see were his feet.  He looked sad.  \n\nAs I said, I have so many small stories that I couldn't possibly list them all here but here's something I found in doing some research years after moving out:\n\nOur house along with most in our neighborhood had been built using recycled bricks from a prison in our town that was shut down in the 70's (I think, maybe early 80\"s).  In the south side of our city we had an underground prison...these were the bricks.  I thought maybe it could explain all the bad juju on our street. Who knows.  If anybody has any questions or wants to hear further stores, just let me know. Hopefully my poor writing skills didn't put you to sleep. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65lgk4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "powerofsoulphoto", "saved": false, "mod_reports": [], "name": "t3_65lgk4", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65lgk4/my_haunted_house_experiences/", "num_reports": null, "locked": false, "stickied": false, "created": 1492319474.0, "url": "https://www.reddit.com/r/Paranormal/comments/65lgk4/my_haunted_house_experiences/", "author_flair_text": null, "quarantine": false, "title": "My Haunted House Experiences.", "created_utc": 1492290674.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65lgk4", "likes": null, "replies": "", "user_reports": [], "id": "dgbsmzg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crwilso6", "parent_id": "t3_65lgk4", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Sounds like that dead dude had some bomb coke", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like that dead dude had some bomb coke&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgbsmzg", "score_hidden": false, "stickied": false, "created": 1492354300.0, "created_utc": 1492325500.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65lgk4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65lgk4", "likes": null, "replies": "", "user_reports": [], "id": "dgcyz5p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "powerofsoulphoto", "parent_id": "t1_dgcfcqn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "It was so terrifying! I don't tell many people about my experiences there for fear of looking like an attention seeker. My mom even had a few strange experiences there and she isn't the type to ever claim anything like that. NOBODY stayed the night there without some strange experience. I'm in agreement with you on the subject of used materials. I think that some energy can transfer. I will see if I can post a picture of the old prison...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was so terrifying! I don&amp;#39;t tell many people about my experiences there for fear of looking like an attention seeker. My mom even had a few strange experiences there and she isn&amp;#39;t the type to ever claim anything like that. NOBODY stayed the night there without some strange experience. I&amp;#39;m in agreement with you on the subject of used materials. I think that some energy can transfer. I will see if I can post a picture of the old prison...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgcyz5p", "score_hidden": false, "stickied": false, "created": 1492424727.0, "created_utc": 1492395927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65lgk4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65lgk4", "likes": null, "replies": "", "user_reports": [], "id": "dgddges", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "patssister1960", "parent_id": "t1_dgczlgj", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Oh, wow?!  Thanks for the pics, they really convey the kind of darkness and negativity places like that absorb over time.  NO WONDER the house is so nasty!?!  It's too bad they can't just pull down the whole place and start over with all new materials for all the homes...what a shame.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, wow?!  Thanks for the pics, they really convey the kind of darkness and negativity places like that absorb over time.  NO WONDER the house is so nasty!?!  It&amp;#39;s too bad they can&amp;#39;t just pull down the whole place and start over with all new materials for all the homes...what a shame.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgddges", "score_hidden": false, "stickied": false, "created": 1492457280.0, "created_utc": 1492428480.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczlgj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "powerofsoulphoto", "parent_id": "t1_dgcfcqn", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Old Frankfort prison https://imgur.com/gallery/rxrjU", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Old Frankfort prison &lt;a href=\"https://imgur.com/gallery/rxrjU\"&gt;https://imgur.com/gallery/rxrjU&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgczlgj", "score_hidden": false, "stickied": false, "created": 1492425608.0, "created_utc": 1492396808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfcqn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "patssister1960", "parent_id": "t3_65lgk4", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Y'know, I've wondered if re-using building materials in an effort to cut down on waste is such a good idea....?  I  think I have my answer.  Thanks for sharing, it sounds terrifying!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Y&amp;#39;know, I&amp;#39;ve wondered if re-using building materials in an effort to cut down on waste is such a good idea....?  I  think I have my answer.  Thanks for sharing, it sounds terrifying!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgcfcqn", "score_hidden": false, "stickied": false, "created": 1492398563.0, "created_utc": 1492369763.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]