[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So it was 2012 and I was faced with the prospects of leaving the semesters end and living with my grandparents or staying with a few friends in a house. I opted to stay with my grandparents as I was feeling very home sick. The house they were living in was originally built by my great great grandfather when they settled in the United States so the place has some history. My great grandmother lived in the house for a number of years but did not end up passing in the house, though she did pass in 2008. Her husband passed many years prior to her death.&lt;/p&gt;\n\n&lt;p&gt;One night after having been there for a month I was laying in my bed upstairs in the evening, at this point I was quite awake and not tired at all. I had my laptop on my torso and was kind of laying on my back just typing away to some friends in a chat when I noticed a faint shadow at the bottom of the bed that seemed to be moving. Nothing in the room to my knowledge at that point could have been casting the shadow, it seemed out of place and seemed to be shaped human-like. I had one very bright lamp on that was clearly illuminating the room well. At this point I started squinting and wiped my eyes to make sure my eyes weren&amp;#39;t playing tricks on me or something and noticed it moving even more clearly.&lt;/p&gt;\n\n&lt;p&gt;Having an open mind I decided that this was probably an entity or something similar because I fully believe in energies and spirits. I did not feel intense fear at the point but.. now this part is going to sound weird, but I tried to use my minds eye (thoughts) to say &amp;quot;show yourself&amp;quot; (i shouted it in my head) and to my disbelief a full apparition of a woman appeared in her late 20s to early 30s, styled not of this era. She was in a full gown and had her hair bunned tightly and was wearing a set of wire framed glasses that seemed very antiquated. She never made eye contact with me and seemed to be busy moving her hands around at the foot of my bed folding clothes or sheets, something similar, but of course there were no sheets or clothes to be folded. She approached a dresser that was a few feet from the foot of the bed to (I assume) put away clothes. A few seconds after approaching the dresser (maybe 10 seconds or so) she dissipated/faded from my sight for lack of better words. &lt;/p&gt;\n\n&lt;p&gt;During the entire event I didn&amp;#39;t feel intense fear or anything which is quite weird in retrospect, maybe arguably weirder and more difficult to process than what I had witnessed but instead I felt more of a warmth and peace.&lt;/p&gt;\n\n&lt;p&gt;After the event I used my minds eye or thoughts, to attempt to thank her but I don&amp;#39;t know if she ever got that message. After the event I shut my laptop completely and set it to the side, and went downstairs to ask my grandmother to see some photo albums because I wanted to know what I saw. At this point I thought it could likely be someone that lived there prior within the family given the history of the house. Of course I never mentioned the sighting to my grandmother but she was always happy to flip through a photo album. I was completely stunned with what I saw, it was my great grandmother at a younger age (during a time I never knew her because I wasn&amp;#39;t alive yet) with the exact same glasses and hair styling, the same facial features, everything. I knew her when she was well advanced in age so I definitely did not recognize her as she appeared that night.&lt;/p&gt;\n\n&lt;p&gt;To this day I have never told anyone about it, not even my grandmother or grandfather (both have since passed so i kind of regret not mentioning it) for fear of being called crazy, especially considering I actively communicated with her spirit. I think it&amp;#39;s one thing to say you may have saw something, but I imagine even people here are fairly skeptical about the prospects of communication.&lt;/p&gt;\n\n&lt;p&gt;Has anyone here heard of anything or experienced anything similar regarding the communication aspect that went on between my great grandmother&amp;#39;s apparition and I?&lt;/p&gt;\n\n&lt;p&gt;Edit: *grammar&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So it was 2012 and I was faced with the prospects of leaving the semesters end and living with my grandparents or staying with a few friends in a house. I opted to stay with my grandparents as I was feeling very home sick. The house they were living in was originally built by my great great grandfather when they settled in the United States so the place has some history. My great grandmother lived in the house for a number of years but did not end up passing in the house, though she did pass in 2008. Her husband passed many years prior to her death.\n\nOne night after having been there for a month I was laying in my bed upstairs in the evening, at this point I was quite awake and not tired at all. I had my laptop on my torso and was kind of laying on my back just typing away to some friends in a chat when I noticed a faint shadow at the bottom of the bed that seemed to be moving. Nothing in the room to my knowledge at that point could have been casting the shadow, it seemed out of place and seemed to be shaped human-like. I had one very bright lamp on that was clearly illuminating the room well. At this point I started squinting and wiped my eyes to make sure my eyes weren't playing tricks on me or something and noticed it moving even more clearly.\n\nHaving an open mind I decided that this was probably an entity or something similar because I fully believe in energies and spirits. I did not feel intense fear at the point but.. now this part is going to sound weird, but I tried to use my minds eye (thoughts) to say \"show yourself\" (i shouted it in my head) and to my disbelief a full apparition of a woman appeared in her late 20s to early 30s, styled not of this era. She was in a full gown and had her hair bunned tightly and was wearing a set of wire framed glasses that seemed very antiquated. She never made eye contact with me and seemed to be busy moving her hands around at the foot of my bed folding clothes or sheets, something similar, but of course there were no sheets or clothes to be folded. She approached a dresser that was a few feet from the foot of the bed to (I assume) put away clothes. A few seconds after approaching the dresser (maybe 10 seconds or so) she dissipated/faded from my sight for lack of better words. \n\nDuring the entire event I didn't feel intense fear or anything which is quite weird in retrospect, maybe arguably weirder and more difficult to process than what I had witnessed but instead I felt more of a warmth and peace.\n\nAfter the event I used my minds eye or thoughts, to attempt to thank her but I don't know if she ever got that message. After the event I shut my laptop completely and set it to the side, and went downstairs to ask my grandmother to see some photo albums because I wanted to know what I saw. At this point I thought it could likely be someone that lived there prior within the family given the history of the house. Of course I never mentioned the sighting to my grandmother but she was always happy to flip through a photo album. I was completely stunned with what I saw, it was my great grandmother at a younger age (during a time I never knew her because I wasn't alive yet) with the exact same glasses and hair styling, the same facial features, everything. I knew her when she was well advanced in age so I definitely did not recognize her as she appeared that night.\n\nTo this day I have never told anyone about it, not even my grandmother or grandfather (both have since passed so i kind of regret not mentioning it) for fear of being called crazy, especially considering I actively communicated with her spirit. I think it's one thing to say you may have saw something, but I imagine even people here are fairly skeptical about the prospects of communication.\n\nHas anyone here heard of anything or experienced anything similar regarding the communication aspect that went on between my great grandmother's apparition and I?\n\nEdit: *grammar", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65n6ot", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "seenstrangerthings", "saved": false, "mod_reports": [], "name": "t3_65n6ot", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492318951.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65n6ot/recently_started_lurking_here_wanted_to_share_an/", "num_reports": null, "locked": false, "stickied": false, "created": 1492341973.0, "url": "https://www.reddit.com/r/Paranormal/comments/65n6ot/recently_started_lurking_here_wanted_to_share_an/", "author_flair_text": null, "quarantine": false, "title": "Recently started lurking here, wanted to share an experience regarding a ghost sighting I had in spring of 2012. (kind of long)", "created_utc": 1492313173.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65n6ot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65n6ot", "likes": null, "replies": "", "user_reports": [], "id": "dgcauaf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "seenstrangerthings", "parent_id": "t1_dgc9x9a", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I have not had any encounters recently. A few years prior to this event I did see another though. My neighbor had an old chevy that he took care of and detailed frequently, he was older in his late 60s with white hair and as always wearing a polo and some blue jeans.. I went out onto my deck and saw him standing around his car just looking at it dressed as usual but didn't seem to be doing much else which wasn't too out of the ordinary because he was a bit obsessive about that car. \n\nAt this point in time I was living with my mother and she would actually keep in touch with the neighbors, when she came home she told me that his wife told her he had died in the hospital after contracting a deadly anti-biotic resistant strain of MRSA (after an operation that took place some days prior) the night before. The MRSA infection was detected in recovery so he never made it home after his surgery. There was no way he could have been there alive anyways.\n\nBarring the guy having an identical twin I was never aware of, I'm fairly sure it was an encounter. This also happened in broad daylight so I am sure it wasn't related to not being able to see well and building an ambiguous representation of the person there or anything. I saw his face as plain as day. Unlike my other encounter I was not particularly close to this person at any point in my life. \n\nI don't doubt your fathers encounter much, I've heard a few similar encounters from people that I know and trust well shortly after someone close passing. ", "edited": 1492364200.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have not had any encounters recently. A few years prior to this event I did see another though. My neighbor had an old chevy that he took care of and detailed frequently, he was older in his late 60s with white hair and as always wearing a polo and some blue jeans.. I went out onto my deck and saw him standing around his car just looking at it dressed as usual but didn&amp;#39;t seem to be doing much else which wasn&amp;#39;t too out of the ordinary because he was a bit obsessive about that car. &lt;/p&gt;\n\n&lt;p&gt;At this point in time I was living with my mother and she would actually keep in touch with the neighbors, when she came home she told me that his wife told her he had died in the hospital after contracting a deadly anti-biotic resistant strain of MRSA (after an operation that took place some days prior) the night before. The MRSA infection was detected in recovery so he never made it home after his surgery. There was no way he could have been there alive anyways.&lt;/p&gt;\n\n&lt;p&gt;Barring the guy having an identical twin I was never aware of, I&amp;#39;m fairly sure it was an encounter. This also happened in broad daylight so I am sure it wasn&amp;#39;t related to not being able to see well and building an ambiguous representation of the person there or anything. I saw his face as plain as day. Unlike my other encounter I was not particularly close to this person at any point in my life. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t doubt your fathers encounter much, I&amp;#39;ve heard a few similar encounters from people that I know and trust well shortly after someone close passing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgcauaf", "score_hidden": false, "stickied": false, "created": 1492392550.0, "created_utc": 1492363750.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9x9a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FollowTheHopeless", "parent_id": "t3_65n6ot", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Hmmm... Strange, my dad told me that whenever his grandmother died when he got back from the funeral, he ran into his bedroom crying and he told me that he saw a spirit of his grandmother. I forgot what she told him.\n\nDo you still see things every once in a while like a Spirit?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmmm... Strange, my dad told me that whenever his grandmother died when he got back from the funeral, he ran into his bedroom crying and he told me that he saw a spirit of his grandmother. I forgot what she told him.&lt;/p&gt;\n\n&lt;p&gt;Do you still see things every once in a while like a Spirit?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgc9x9a", "score_hidden": false, "stickied": false, "created": 1492391338.0, "created_utc": 1492362538.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65n6ot", "likes": null, "replies": "", "user_reports": [], "id": "dgenlbu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aussie-vault-girl", "parent_id": "t3_65n6ot", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I haven't but I think that's sweet that she visited you. If any of my relatives choose to, I hope they realize I'm easily scared lol. Although I do think my aunt has intentionally visited my dreams after she passed away, I'm less fearful in them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t but I think that&amp;#39;s sweet that she visited you. If any of my relatives choose to, I hope they realize I&amp;#39;m easily scared lol. Although I do think my aunt has intentionally visited my dreams after she passed away, I&amp;#39;m less fearful in them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgenlbu", "score_hidden": false, "stickied": false, "created": 1492516122.0, "created_utc": 1492487322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]