[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How can both exist in the same universe?&lt;/p&gt;\n\n&lt;p&gt;Two days ago I had this dream where I was having a conversation with some sort of spiritual mentor. I don&amp;#39;t remember how the conversation went but I know one lesson was about the absence of direction in my life and the lack of concrete positive repercussions I&amp;#39;ve had in this world. The last image of the dream was of a person next to a huge white dog. The next day when I was walking my dog I came face to face with another person walking their dog, and it was the biggest white dog I&amp;#39;ve ever seen. Not only that, but they were also at the same spot where I saw it in my dream the night before. It felt like someone was trying to tell me that it was a real message I received in my dream, a real life lesson from a real spiritual mentor. It was saying look! This is real! Remember this!&lt;/p&gt;\n\n&lt;p&gt;Yesterday I had another dream where one of my comments on Reddit was repeated a couple of times in the same thread, I don&amp;#39;t know why. Well not an hour ago one of my replies was a copy-paste with only a small change to the original comment to make a point. I guess that small incident counts as another premonition that came true?&lt;/p&gt;\n\n&lt;p&gt;So if premonitions like this exist, just how much free will do we really have? Are destinies real? I&amp;#39;m starting to think life is like a multiple choice test, where we can choose our path, but the journey and the destination are set in stone.&lt;/p&gt;\n\n&lt;p&gt;Thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "How can both exist in the same universe?\n\nTwo days ago I had this dream where I was having a conversation with some sort of spiritual mentor. I don't remember how the conversation went but I know one lesson was about the absence of direction in my life and the lack of concrete positive repercussions I've had in this world. The last image of the dream was of a person next to a huge white dog. The next day when I was walking my dog I came face to face with another person walking their dog, and it was the biggest white dog I've ever seen. Not only that, but they were also at the same spot where I saw it in my dream the night before. It felt like someone was trying to tell me that it was a real message I received in my dream, a real life lesson from a real spiritual mentor. It was saying look! This is real! Remember this!\n\nYesterday I had another dream where one of my comments on Reddit was repeated a couple of times in the same thread, I don't know why. Well not an hour ago one of my replies was a copy-paste with only a small change to the original comment to make a point. I guess that small incident counts as another premonition that came true?\n\nSo if premonitions like this exist, just how much free will do we really have? Are destinies real? I'm starting to think life is like a multiple choice test, where we can choose our path, but the journey and the destination are set in stone.\n\nThoughts?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65u0vm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "____dim____", "saved": false, "mod_reports": [], "name": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": 1492414466.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65u0vm/premonitions_vs_free_will/", "num_reports": null, "locked": false, "stickied": false, "created": 1492439868.0, "url": "https://www.reddit.com/r/Paranormal/comments/65u0vm/premonitions_vs_free_will/", "author_flair_text": null, "quarantine": false, "title": "Premonitions vs. Free Will", "created_utc": 1492411068.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgdalux", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ghostfarce", "parent_id": "t1_dgd9qvj", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Speaking as a religious person, I think premonitions either randomly happen or don't. There are some people who pray(and/or are spiritual) and have never experienced premonitions of any kind. While others have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Speaking as a religious person, I think premonitions either randomly happen or don&amp;#39;t. There are some people who pray(and/or are spiritual) and have never experienced premonitions of any kind. While others have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdalux", "score_hidden": false, "stickied": false, "created": 1492448202.0, "created_utc": 1492419402.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9qvj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "____dim____", "parent_id": "t1_dgd8zrk", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Do you remember if your premonitions happened during a spiritual moment in your life? In my case I just started to pray a little again. Last time I had made a prayer was years ago. So naturally I wonder if maybe spirituality opens our \"third eye\" and grants us visions we would normally not see.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you remember if your premonitions happened during a spiritual moment in your life? In my case I just started to pray a little again. Last time I had made a prayer was years ago. So naturally I wonder if maybe spirituality opens our &amp;quot;third eye&amp;quot; and grants us visions we would normally not see.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgd9qvj", "score_hidden": false, "stickied": false, "created": 1492445273.0, "created_utc": 1492416473.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8zrk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "gunsof", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've had precognitive or \"psychic\" seeming dreams before too and it's made me wonder the same thing. Even some things that wouldn't happen till months in the future.\n\nIt doesn't make any sense to me how or why they work. Especially as most of them aren't over significant things. Why would the universe somehow \"break\" and show you something trivial that would happen in your life? Why do they rarely show major things? What does it say about the nature of free will? It doesn't make any sense to me and yet I believe there's something at work as I know my experiences are real.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had precognitive or &amp;quot;psychic&amp;quot; seeming dreams before too and it&amp;#39;s made me wonder the same thing. Even some things that wouldn&amp;#39;t happen till months in the future.&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t make any sense to me how or why they work. Especially as most of them aren&amp;#39;t over significant things. Why would the universe somehow &amp;quot;break&amp;quot; and show you something trivial that would happen in your life? Why do they rarely show major things? What does it say about the nature of free will? It doesn&amp;#39;t make any sense to me and yet I believe there&amp;#39;s something at work as I know my experiences are real.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgd8zrk", "score_hidden": false, "stickied": false, "created": 1492442967.0, "created_utc": 1492414167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgd9qc4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "WintersSolace", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Premonitions you have of near future events are usually because you are on a path towards that happening regardless, because of the way you think and react in daily life. In other words, the odds of you doing something that you have a premonition of are quite high. You see it because you are prone to doing it anyway. Does this make sense? It does have to do with free will, it's just more based on your habitual way of life, thinking habits, that have been brought on by your free will to form such habits in the first place.\n\nYou can change your destiny, but that would mean you'd have to change your mindset to where it changes your daily routine in some way. And gives new perspectives. The destination may be set in stone, yet the journey is how you make it out to be. BAsed on decisions influenced by many sources and by your daily environment. Naturally, you are a product of your own environment after all. \n\nEDIT: I will say, not all premonitions are like this, of course. As there is such a thing called fate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Premonitions you have of near future events are usually because you are on a path towards that happening regardless, because of the way you think and react in daily life. In other words, the odds of you doing something that you have a premonition of are quite high. You see it because you are prone to doing it anyway. Does this make sense? It does have to do with free will, it&amp;#39;s just more based on your habitual way of life, thinking habits, that have been brought on by your free will to form such habits in the first place.&lt;/p&gt;\n\n&lt;p&gt;You can change your destiny, but that would mean you&amp;#39;d have to change your mindset to where it changes your daily routine in some way. And gives new perspectives. The destination may be set in stone, yet the journey is how you make it out to be. BAsed on decisions influenced by many sources and by your daily environment. Naturally, you are a product of your own environment after all. &lt;/p&gt;\n\n&lt;p&gt;EDIT: I will say, not all premonitions are like this, of course. As there is such a thing called fate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgd9qc4", "score_hidden": false, "stickied": false, "created": 1492445224.0, "created_utc": 1492416424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgdbca7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "annaroseloades", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Here are two understandings of premonition dreams and  ways you can use this prior knowledge to your advantage.\n\nThe occurrence of the dream state in the physical realm could be the universe's acknowledgement that you are on the right track in life. It can be as simple as your example of walking the dog or can go deeper into dreams that are of a more predictive nature, like how someone might die or an event that later materialises. \n\nPremonition dreams involvimg human interaction and communication in depth, may later play out in the physical realm and so are important to pay attention to them. It is likely that your spirit-self is drawing your attention to something or warning you. \n\nMost commonly, it's giving you prior knowledge about an occurrence in order for you to be prepared for a future encounter so that your intuition can kick in, enabling you to make a decision that is wise and right for you.\n\nIt's very difficult to know what to pay attention to so the best way keep track is to take time to reflect on your dreams, particular vivid ones. Also be mindful in acknowledging the partcular time in your life these dreams occur during or at what point in your life these dreams may be relevant.\n\nI hope this sheds some light and is helpful.\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here are two understandings of premonition dreams and  ways you can use this prior knowledge to your advantage.&lt;/p&gt;\n\n&lt;p&gt;The occurrence of the dream state in the physical realm could be the universe&amp;#39;s acknowledgement that you are on the right track in life. It can be as simple as your example of walking the dog or can go deeper into dreams that are of a more predictive nature, like how someone might die or an event that later materialises. &lt;/p&gt;\n\n&lt;p&gt;Premonition dreams involvimg human interaction and communication in depth, may later play out in the physical realm and so are important to pay attention to them. It is likely that your spirit-self is drawing your attention to something or warning you. &lt;/p&gt;\n\n&lt;p&gt;Most commonly, it&amp;#39;s giving you prior knowledge about an occurrence in order for you to be prepared for a future encounter so that your intuition can kick in, enabling you to make a decision that is wise and right for you.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s very difficult to know what to pay attention to so the best way keep track is to take time to reflect on your dreams, particular vivid ones. Also be mindful in acknowledging the partcular time in your life these dreams occur during or at what point in your life these dreams may be relevant.&lt;/p&gt;\n\n&lt;p&gt;I hope this sheds some light and is helpful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdbca7", "score_hidden": false, "stickied": false, "created": 1492450765.0, "created_utc": 1492421965.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgdfpr7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GhostsOnly", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "From my perspective it's all destiny, but people who are uncomfortable with the spirit world have to think they have free will or they go insane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From my perspective it&amp;#39;s all destiny, but people who are uncomfortable with the spirit world have to think they have free will or they go insane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdfpr7", "score_hidden": false, "stickied": false, "created": 1492462190.0, "created_utc": 1492433390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgdg3y7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sansabina", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "In the Block Universe theory, everything in time already exists (past, present and future). Time isn't linear. So you've already lived your life, and maybe premonitions are just some space-time glitch where you just see what you will do. You're not pre-destined to do it, you've exercised free-will and already done it.\n\nhttp://www.dailymail.co.uk/sciencetech/article-2932870/Is-future-decided-New-theory-time-suggests-past-present-future-exist-universe.html", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the Block Universe theory, everything in time already exists (past, present and future). Time isn&amp;#39;t linear. So you&amp;#39;ve already lived your life, and maybe premonitions are just some space-time glitch where you just see what you will do. You&amp;#39;re not pre-destined to do it, you&amp;#39;ve exercised free-will and already done it.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.dailymail.co.uk/sciencetech/article-2932870/Is-future-decided-New-theory-time-suggests-past-present-future-exist-universe.html\"&gt;http://www.dailymail.co.uk/sciencetech/article-2932870/Is-future-decided-New-theory-time-suggests-past-present-future-exist-universe.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdg3y7", "score_hidden": false, "stickied": false, "created": 1492462892.0, "created_utc": 1492434092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgdfpr9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GhostsOnly", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "From my perspective it's all destiny, but people who are uncomfortable with the spirit world have to think they have free will or they go insane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From my perspective it&amp;#39;s all destiny, but people who are uncomfortable with the spirit world have to think they have free will or they go insane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdfpr9", "score_hidden": false, "stickied": false, "created": 1492462190.0, "created_utc": 1492433390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgdnbwl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "endlessmus48", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I have had premonition dreams since I was young. Many of my dreams would come true and there would be this overwhelming sense of deja vu when I was experiencing what I had dreamed about, like I had been through it already. Sometimes it will be months, years even before experiencing them, and sometimes it will happen almost every day for a week. It will usually be about menial things, but sometimes it'll be about a major life choice. \n\nI firmly believe that those dreams are telling me I am on the right track. A type of guidance, if you will.\n\nAnd I think there are many choices available to us, and sometimes are \"instincts\" (with or without the dreams) know what decisions may lead us down multiple paths, even when we do choose the \"wrong\" choice. It will eventually get us to where we are fated to go. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have had premonition dreams since I was young. Many of my dreams would come true and there would be this overwhelming sense of deja vu when I was experiencing what I had dreamed about, like I had been through it already. Sometimes it will be months, years even before experiencing them, and sometimes it will happen almost every day for a week. It will usually be about menial things, but sometimes it&amp;#39;ll be about a major life choice. &lt;/p&gt;\n\n&lt;p&gt;I firmly believe that those dreams are telling me I am on the right track. A type of guidance, if you will.&lt;/p&gt;\n\n&lt;p&gt;And I think there are many choices available to us, and sometimes are &amp;quot;instincts&amp;quot; (with or without the dreams) know what decisions may lead us down multiple paths, even when we do choose the &amp;quot;wrong&amp;quot; choice. It will eventually get us to where we are fated to go. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdnbwl", "score_hidden": false, "stickied": false, "created": 1492472775.0, "created_utc": 1492443975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgdv6j8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rebuttlah", "parent_id": "t1_dgduyhk", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "it's important to remember, that no controlled test of precognitive or psychic ability has ever held up to scrutiny. What we do often have though, are schemas or scripts. We can predict outcomes based on experience and probability. When you move beyond the realm of normal human experience however, we become very very bad at this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s important to remember, that no controlled test of precognitive or psychic ability has ever held up to scrutiny. What we do often have though, are schemas or scripts. We can predict outcomes based on experience and probability. When you move beyond the realm of normal human experience however, we become very very bad at this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdv6j8", "score_hidden": false, "stickied": false, "created": 1492481528.0, "created_utc": 1492452728.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgduyhk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rebuttlah", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Sam Harris - a well known atheist who often argues for secular spirituality - wrote a book simply titled \"Free Will\". It's a very short book, and a relatively quick argument against the popular conception of free will. Basically it flows like this: I can choose to do something, or not to do something. However, I can't choose the feelings, likes, dislikes, or emotions that led me to those choices in the first place. \n\nExample: a former neo nazi sees the error of his ways, and becomes a campaigner for equality. he chose to become a campaigner, right? or did he? he didn't chose to absorb the piece(s) of information that changed his mind. He didn't choose to care, or how strongly he cared, he just cared. his choice to fight for equality flowed in proportion to how badly he felt. if he didn't feel as bad, he probably wouldn't have made that choice.\n\ntherefore, we seem to have a capacity for choice, but it's far more limited than we tend think. studies have shown that we are born with our temperament (heavily genetically loaded), and temperament in childhood is highly predictive of personality in adulthood. so we have choices, but we're limited to a selection that is more or less pre-loaded based on our genes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sam Harris - a well known atheist who often argues for secular spirituality - wrote a book simply titled &amp;quot;Free Will&amp;quot;. It&amp;#39;s a very short book, and a relatively quick argument against the popular conception of free will. Basically it flows like this: I can choose to do something, or not to do something. However, I can&amp;#39;t choose the feelings, likes, dislikes, or emotions that led me to those choices in the first place. &lt;/p&gt;\n\n&lt;p&gt;Example: a former neo nazi sees the error of his ways, and becomes a campaigner for equality. he chose to become a campaigner, right? or did he? he didn&amp;#39;t chose to absorb the piece(s) of information that changed his mind. He didn&amp;#39;t choose to care, or how strongly he cared, he just cared. his choice to fight for equality flowed in proportion to how badly he felt. if he didn&amp;#39;t feel as bad, he probably wouldn&amp;#39;t have made that choice.&lt;/p&gt;\n\n&lt;p&gt;therefore, we seem to have a capacity for choice, but it&amp;#39;s far more limited than we tend think. studies have shown that we are born with our temperament (heavily genetically loaded), and temperament in childhood is highly predictive of personality in adulthood. so we have choices, but we&amp;#39;re limited to a selection that is more or less pre-loaded based on our genes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgduyhk", "score_hidden": false, "stickied": false, "created": 1492481276.0, "created_utc": 1492452476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65u0vm", "likes": null, "replies": "", "user_reports": [], "id": "dgeji06", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BLKmetalPontoonCapt", "parent_id": "t3_65u0vm", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "It may sound odd but i have had dreams come to reality later, but in the same manner it has never been anything significant and i guess i recognized it playing out and realized that if i said this or did this the small the dream would happen as i dreampt it and if i deviated a differnt version would obviously ensue. I dont think there is mutiple choice so much as multiverse. There is no pre determined course, only perhaps every possible course playing out simultaneously. Idk on second thought maybe that is multiple choice lol. But the point is i guess that we have free will to decide and the outcomes are limitless and beyond perhaps our full ability to fathom. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It may sound odd but i have had dreams come to reality later, but in the same manner it has never been anything significant and i guess i recognized it playing out and realized that if i said this or did this the small the dream would happen as i dreampt it and if i deviated a differnt version would obviously ensue. I dont think there is mutiple choice so much as multiverse. There is no pre determined course, only perhaps every possible course playing out simultaneously. Idk on second thought maybe that is multiple choice lol. But the point is i guess that we have free will to decide and the outcomes are limitless and beyond perhaps our full ability to fathom. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgeji06", "score_hidden": false, "stickied": false, "created": 1492510806.0, "created_utc": 1492482006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]