[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;These stories are based on my family&amp;#39;s experienced of the paranormals. These are all 100% true.&lt;/p&gt;\n\n&lt;p&gt;Apartment #1\nOur family had lived on this first haunted apartment for almost 5yrs. I was 10 years old back then. The first 4 years was good and there&amp;#39;s no paranormal activities back then. It just started when a friend of my sister lived in our house. She is a close friend and co-worker of my sister, my sister invited her to our house because her hometown are faraway from the city and it&amp;#39;s holyweek that week. It was one evening night and everyone are asleep, when they heard my sister screaming on the top of her voice. I&amp;#39;m a heavy sleeper btw, my father just woke up and told me there&amp;#39;s a man outside the house and he wants me to go to my sister room to check them out. He wants to chase the man my sister saw outside the window. I&amp;#39;m from Southeast Asia btw, we always open the window whenever we go to sleep, specially on summer season because of the heat. When I checked them out, my sister&amp;#39;s friend told me she saw a man pulling my sister&amp;#39;s foot. She woke up my sister and told her that someone is pulling her foot outside the window. My sister kicked that man&amp;#39;s hand while screaming. They screamed louder after they saw that man. They said that his skin color is so black, it&amp;#39;s like color of the night and they just know it&amp;#39;s a man because of his silhoutte and he&amp;#39;s growling while pulling my sister&amp;#39;s foot, his eyes are so red. So,  I just thought maybe that man is just a drug addict who wants to rob something. They told my father that a man is pulling my sister&amp;#39;s foot outside the window. My father woke me up and told me to check them out. I saw him took off with a big knife on his hand. My sister&amp;#39;s friend told my father where the man ran to. She kept pointing at the tree and said that the man ran there. My father stopped and asked again. &amp;quot;Where?&amp;quot; he got confused because my sister&amp;#39;s friend kept pointing at the small tree inside our backyard. It was a custard apple tree, it&amp;#39;s an 8 ft high and maybe as thick of an adult&amp;#39;s arm. Even a a malnourished child could never fit in there even if he wants to. He went outside because he thought that my sister&amp;#39;s friend is pointing at our neighbor&amp;#39;s backyard because that&amp;#39;s the only place where the guy can hide to, because there&amp;#39;s too many banana trees inside our neighbor&amp;#39;s backyard. My father even woke up our neighbor and told them that there&amp;#39;s a guy hiding on their backyard, they even helped my father to look for the guy. I went outside and tried to see if they found the guy. I just saw them roaming around the backyard with their flashlight on. Our neighbor&amp;#39;s backyard is big and there&amp;#39;s too many banana trees on their backyard. My sister&amp;#39;s friend called me and told to me to go back inside, I know she&amp;#39;s still scared because she kept signing me to go back while calling my name. So, I went back inside. After 15mins my father and our neighbors came back but they never found the guy. When my father came back, my sister&amp;#39;s friend told us to come to the living room. She said that the guy never went to our neighbor&amp;#39;s backyard, what she said still gives me chills to my bone. She said that the guy is hiding in the custard apple tree inside our backyard. She even saw the man peeking  when I was outside. I was beside the custard apple when I went outside to check our neighbor&amp;#39;s backyard. She said that&amp;#39;s why she kept on calling me and told me to go inside. It still give chills to my bones because whenever I have to pee, I always peed on that tree. &lt;/p&gt;\n\n&lt;p&gt;The paranormal in our family started to happened only after she had lived with us. She asked us if there&amp;#39;s a paranormal happened before she came to us. We said no, after that she said that maybe the spirits are attracted to her because her third eye is already opened. She even told us when she was a kid, her grandmother always test her and her siblings about the real statues of virgin mary. Whenever they picked wrong they will be punished.  She still sometimes visit us and even though she did not live with us after we moved out. We still experienced some paranormal activities, because the other sister of mine got her third eye opened.&lt;/p&gt;\n\n&lt;p&gt;This is just the Apartment #1 there will be #2 and #3. It started to happened after that incident. I still got a story on Apartment #1. I&amp;#39;ll share it when I have a free time. I still got goosebumps after writing the last part of my story.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "These stories are based on my family's experienced of the paranormals. These are all 100% true.\n\nApartment #1\nOur family had lived on this first haunted apartment for almost 5yrs. I was 10 years old back then. The first 4 years was good and there's no paranormal activities back then. It just started when a friend of my sister lived in our house. She is a close friend and co-worker of my sister, my sister invited her to our house because her hometown are faraway from the city and it's holyweek that week. It was one evening night and everyone are asleep, when they heard my sister screaming on the top of her voice. I'm a heavy sleeper btw, my father just woke up and told me there's a man outside the house and he wants me to go to my sister room to check them out. He wants to chase the man my sister saw outside the window. I'm from Southeast Asia btw, we always open the window whenever we go to sleep, specially on summer season because of the heat. When I checked them out, my sister's friend told me she saw a man pulling my sister's foot. She woke up my sister and told her that someone is pulling her foot outside the window. My sister kicked that man's hand while screaming. They screamed louder after they saw that man. They said that his skin color is so black, it's like color of the night and they just know it's a man because of his silhoutte and he's growling while pulling my sister's foot, his eyes are so red. So,  I just thought maybe that man is just a drug addict who wants to rob something. They told my father that a man is pulling my sister's foot outside the window. My father woke me up and told me to check them out. I saw him took off with a big knife on his hand. My sister's friend told my father where the man ran to. She kept pointing at the tree and said that the man ran there. My father stopped and asked again. \"Where?\" he got confused because my sister's friend kept pointing at the small tree inside our backyard. It was a custard apple tree, it's an 8 ft high and maybe as thick of an adult's arm. Even a a malnourished child could never fit in there even if he wants to. He went outside because he thought that my sister's friend is pointing at our neighbor's backyard because that's the only place where the guy can hide to, because there's too many banana trees inside our neighbor's backyard. My father even woke up our neighbor and told them that there's a guy hiding on their backyard, they even helped my father to look for the guy. I went outside and tried to see if they found the guy. I just saw them roaming around the backyard with their flashlight on. Our neighbor's backyard is big and there's too many banana trees on their backyard. My sister's friend called me and told to me to go back inside, I know she's still scared because she kept signing me to go back while calling my name. So, I went back inside. After 15mins my father and our neighbors came back but they never found the guy. When my father came back, my sister's friend told us to come to the living room. She said that the guy never went to our neighbor's backyard, what she said still gives me chills to my bone. She said that the guy is hiding in the custard apple tree inside our backyard. She even saw the man peeking  when I was outside. I was beside the custard apple when I went outside to check our neighbor's backyard. She said that's why she kept on calling me and told me to go inside. It still give chills to my bones because whenever I have to pee, I always peed on that tree. \n\nThe paranormal in our family started to happened only after she had lived with us. She asked us if there's a paranormal happened before she came to us. We said no, after that she said that maybe the spirits are attracted to her because her third eye is already opened. She even told us when she was a kid, her grandmother always test her and her siblings about the real statues of virgin mary. Whenever they picked wrong they will be punished.  She still sometimes visit us and even though she did not live with us after we moved out. We still experienced some paranormal activities, because the other sister of mine got her third eye opened.\n\nThis is just the Apartment #1 there will be #2 and #3. It started to happened after that incident. I still got a story on Apartment #1. I'll share it when I have a free time. I still got goosebumps after writing the last part of my story.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vbuy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "RagingAdobo", "saved": false, "mod_reports": [], "name": "t3_65vbuy", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65vbuy/haunted_apartments/", "num_reports": null, "locked": false, "stickied": false, "created": 1492461977.0, "url": "https://www.reddit.com/r/Paranormal/comments/65vbuy/haunted_apartments/", "author_flair_text": null, "quarantine": false, "title": "Haunted Apartments.", "created_utc": 1492433177.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65vbuy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65vbuy", "likes": null, "replies": "", "user_reports": [], "id": "dge8kq3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RagingAdobo", "parent_id": "t1_dgdslp0", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Yes it is, she said spirits are the most mysterious beings in this world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes it is, she said spirits are the most mysterious beings in this world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dge8kq3", "score_hidden": false, "stickied": false, "created": 1492497085.0, "created_utc": 1492468285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdslp0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "georgeananda", "parent_id": "t3_65vbuy", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Interesting story. Wow. It is a strange universe we live in for sure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting story. Wow. It is a strange universe we live in for sure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdslp0", "score_hidden": false, "stickied": false, "created": 1492478685.0, "created_utc": 1492449885.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65vbuy", "likes": null, "replies": "", "user_reports": [], "id": "dgenao2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ellychelle", "parent_id": "t3_65vbuy", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "That's interesting about the \"true Virgin Mary statues,\" I've never heard of that. How does that work?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s interesting about the &amp;quot;true Virgin Mary statues,&amp;quot; I&amp;#39;ve never heard of that. How does that work?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgenao2", "score_hidden": false, "stickied": false, "created": 1492515697.0, "created_utc": 1492486897.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]