[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To preface, I&amp;#39;m on mobile, so I apologize in advance for any grammar or formatting errors. I&amp;#39;ll fix any of these when I get to my PC.&lt;/p&gt;\n\n&lt;p&gt;Here we go! &lt;/p&gt;\n\n&lt;p&gt;This takes place back when I was around 9-10. For backstory, my mother and I were living in a dingy apartment in a not so great town. For example, there were a lot of drugs, violent people, etc... so the whole place was just stagnating with bad energy. The tension between me and my mother didn&amp;#39;t help, as we both had serious emotional problems at the time. (I won&amp;#39;t get into that, just know we gave off tons of bad vibes.) Anyway, many think bad energy attracts bad entities, as they can feed off of it. Now, to the actual story... I was attempting to sleep, I think the day after was school. My bed was very low to the ground, just a matress in the box and not the stand. My hands are under my side beneath the covers and my face is half covered by the pillow since I sleep on my side. As I finally relax all my muscles, I hear a SLAP across my cheek... then the stinging comes. I heard the smack before I felt it. I jolt up and think it was my mom. She isn&amp;#39;t there, so I look upwards to see if something fell: Nothing. That&amp;#39;s when I freak out, and I run out of the hall and into the main room where my mom was. I&amp;#39;m screaming and crying, telling her someone slapped me. She tries to console me by checking my mouth, but that doesn&amp;#39;t help, because one: she starts to see my cheek redden, and two: she sees my cheek bleeding from where it smacked up against one of my teeth. (They&amp;#39;re crooked.) We couldn&amp;#39;t come up with any explanations no matter what. &lt;/p&gt;\n\n&lt;p&gt;This takes place in the same apartment. Again, I was laying down to sleep. When my muscles relax again (I&amp;#39;m not in the half asleep/half awake stage yet) I feel someone sit down on the edge of my bed. Thinking it&amp;#39;s mom again, since we don&amp;#39;t have any pets and we didn&amp;#39;t live with anyone else/have any guests. Once I look up, I see a boy in a white t-shirt and khaki cargo shorts with brown, medium length hair sitting facing away from me. In the moments this took to register, I realized this wasn&amp;#39;t right. Not only because the boy was out of place, but becausee he felt... fake. I remember feeling like it was something pretending to be what it wasn&amp;#39;t as dread hit me like a sack of bricks. Again, I run out to my mom who is watching tv in the living room (I remember the show being Ghost Hunters, which is ironic lol.) screaming and crying. She has to make a pile of blankets for me next to herr bed for me to sleep on until she moves my bed into her room. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s it for now. Please let me know what you think, and also if you would like me to share some more. I have lots of experiences not limited to the apartment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To preface, I'm on mobile, so I apologize in advance for any grammar or formatting errors. I'll fix any of these when I get to my PC.\n\nHere we go! \n\nThis takes place back when I was around 9-10. For backstory, my mother and I were living in a dingy apartment in a not so great town. For example, there were a lot of drugs, violent people, etc... so the whole place was just stagnating with bad energy. The tension between me and my mother didn't help, as we both had serious emotional problems at the time. (I won't get into that, just know we gave off tons of bad vibes.) Anyway, many think bad energy attracts bad entities, as they can feed off of it. Now, to the actual story... I was attempting to sleep, I think the day after was school. My bed was very low to the ground, just a matress in the box and not the stand. My hands are under my side beneath the covers and my face is half covered by the pillow since I sleep on my side. As I finally relax all my muscles, I hear a SLAP across my cheek... then the stinging comes. I heard the smack before I felt it. I jolt up and think it was my mom. She isn't there, so I look upwards to see if something fell: Nothing. That's when I freak out, and I run out of the hall and into the main room where my mom was. I'm screaming and crying, telling her someone slapped me. She tries to console me by checking my mouth, but that doesn't help, because one: she starts to see my cheek redden, and two: she sees my cheek bleeding from where it smacked up against one of my teeth. (They're crooked.) We couldn't come up with any explanations no matter what. \n\nThis takes place in the same apartment. Again, I was laying down to sleep. When my muscles relax again (I'm not in the half asleep/half awake stage yet) I feel someone sit down on the edge of my bed. Thinking it's mom again, since we don't have any pets and we didn't live with anyone else/have any guests. Once I look up, I see a boy in a white t-shirt and khaki cargo shorts with brown, medium length hair sitting facing away from me. In the moments this took to register, I realized this wasn't right. Not only because the boy was out of place, but becausee he felt... fake. I remember feeling like it was something pretending to be what it wasn't as dread hit me like a sack of bricks. Again, I run out to my mom who is watching tv in the living room (I remember the show being Ghost Hunters, which is ironic lol.) screaming and crying. She has to make a pile of blankets for me next to herr bed for me to sleep on until she moves my bed into her room. \n\nThat's it for now. Please let me know what you think, and also if you would like me to share some more. I have lots of experiences not limited to the apartment.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Experience ", "id": "65wj4q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "mundayverbal", "saved": false, "mod_reports": [], "name": "t3_65wj4q", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": "d", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65wj4q/two_of_my_experiences_longish_includes_me_trying/", "num_reports": null, "locked": false, "stickied": false, "created": 1492474683.0, "url": "https://www.reddit.com/r/Paranormal/comments/65wj4q/two_of_my_experiences_longish_includes_me_trying/", "author_flair_text": null, "quarantine": false, "title": "Two of my experiences. (Long-ish, includes me trying to debunk and stuff like that, chock full of spooky stuff.)", "created_utc": 1492445883.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65wj4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65wj4q", "likes": null, "replies": "", "user_reports": [], "id": "dgdse7x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mundayverbal", "parent_id": "t1_dgdryci", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Well I'm not 9-10 anymore lol, so... lost his chance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;m not 9-10 anymore lol, so... lost his chance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdse7x", "score_hidden": false, "stickied": false, "created": 1492478453.0, "created_utc": 1492449653.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdryci", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DJysyed", "parent_id": "t3_65wj4q", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've heard that this is fairly common (Friends at a mosque for a visit and got slapped during the middle of the night when they were sleeping in the back). It's not a mean spirit but a slightly mischievous one. Most likely is around your age and wants to communicate with you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard that this is fairly common (Friends at a mosque for a visit and got slapped during the middle of the night when they were sleeping in the back). It&amp;#39;s not a mean spirit but a slightly mischievous one. Most likely is around your age and wants to communicate with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgdryci", "score_hidden": false, "stickied": false, "created": 1492477966.0, "created_utc": 1492449166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65wj4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65wj4q", "likes": null, "replies": "", "user_reports": [], "id": "dgen7ip", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mundayverbal", "parent_id": "t1_dgemif9", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Gotchya, I'll post some when I get a chance tomorrow!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gotchya, I&amp;#39;ll post some when I get a chance tomorrow!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgen7ip", "score_hidden": false, "stickied": false, "created": 1492515566.0, "created_utc": 1492486766.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemif9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ellychelle", "parent_id": "t3_65wj4q", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Well, since no one else has said it... More, please!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, since no one else has said it... More, please!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgemif9", "score_hidden": false, "stickied": false, "created": 1492514593.0, "created_utc": 1492485793.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]