[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First, I&amp;#39;m a huge skeptic and don&amp;#39;t believe in the paranormal. Usually. My wife, on the other hand, was burning sage in our house yesterday because a lot of bad luck has been coming our way financially. And she thought it couldn&amp;#39;t hurt. During this, she claims to have seen a shadow person at our front door - a man sized indistinct figure in the doorway.&lt;/p&gt;\n\n&lt;p&gt;Entirely coincidentally, I was reading about shadow people Reddit last night (because of a horror script I&amp;#39;m working on) and got so spooked at 1:30 a.m. that I could hardly walk up the stairs to bed.&lt;/p&gt;\n\n&lt;p&gt;Now, and this is true but is going to sound fucking crazy, the man who lived in the house before us was 92 and died in the very room where I&amp;#39;m typing this. The house is 90+ years old and we did an extensive remodel after buying it. I have a wife and two kids. He had a wife and two kids and moved in during the 60s I believe when his kids were approx the same age as my kids. Also a boy and girl. Kids grew up and moved out. Wife died. And he lived here a few years, very healthy and happy until he died in the house at 92.&lt;/p&gt;\n\n&lt;p&gt;In fact, I had completely forgotten he died in the house until I started this post. It wasn&amp;#39;t even the reason I started it.&lt;/p&gt;\n\n&lt;p&gt;Instead, I started it because my wife&amp;#39;s story reminded me of a story an ex told me 20 years ago. She was an extremely rational person, didn&amp;#39;t believe in ghosts or astrology or anything. But told me such a creepy story that when we reconnected on FB, I asked her to write it up so I could see if it&amp;#39;s what I remembered. It was. And here it is, in her own words. Just wondering if anybody&amp;#39;s had similar experiences:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I was in my apartment about 1 week when I started noticing something out of the corner of my eye. I would do a double take, but nothing was there. This continued for a few weeks. I kept noticing I would think I saw something out of the corner of my eye, but again, nothing was there. My attitude about it was not defensive or a scared feeling, I was indifferent to it with an “Oh well” attitude. Since I decided I was not afraid of the possibility of a potential entity I call “shadows”, I just went about my business and life seeing the shadows from the corner of my eye. Over time, the shadows allowed me to actually see them. No longer from the corner of my eye, but I could stare right at them moving around. These shadows were light grey in color and about the size of a small fist. They moved around the edges of my coffee table and end tables at a fairly fast pace.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The shadows definitely stayed moving around specific pieces of furniture. They started around a large coffee table I had. This table was built for me (along with corresponding end table pieces) buy a family friend’s son in High Scholl woodshop. Over time they stayed the same size but multiplied and expanded their movement to other pieces of my furniture but only in my living room. Over the next year or so, the shadows started blending together becoming larger and slower and became a slightly darker grey color. This still did not bother me, I lived alone and kind of felt they were watching over me. This lasted for the entire time I lived at my apartment which was about 4 years.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Because I was going back to school to obtain my Undergraduate degree, I moved back into my child hood home with my parents. I had two bedrooms to myself, one in which I had as my living room with my living room furniture, TV etc. I was somewhat surprised when after I settled in to my new living space, my shadows were back still moving around the living room furniture, nowhere else in the house. I did notice that they were bigger and darker from when I was at the apartment.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Because I was busy with work and school, not being home too much, I did not pay a lot of attention to the shadows nor did I think about them much. I was still not bothered by them. After a while (approx. 1 year) I noticed the shadows moved with me between the little living room I had and my bedroom staying along sharp edges of furniture and walls. I still was not worried. They did start getting darker and larger. This kind of made me feel a bit nervous. One day in a causal conversation with a couple of friends, I mentioned my shadows. One was interested and one was angry with me and felt I needed to stop acknowledging and accepting them. Shortly after this discussion the shadow(s) started forming into one large very dark shape and would stand at the foot of my bed in the middle of the night. At this point the small grey shadows were not longer, just the larger shape at the foot of my bed. Every night I would wake up and it would be there. Each night it seemed to be larger than the night before. This kind of scared me. The large size and dark color was not as comforting as the small grey shapes were. The shape grew larger, darker and appeared to take on a blurred human outline.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I was not sure what the intent of the shape was or what I should do about it. It seemed that the shape was growing and changes were happening rapidly. I talked to a counselor about this and she recommended that I confront the shape as to what it wanted.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I finally worked up the nerve to confront the large dark shape at the end of my bed one night. I sat up and looked directly at it and loudly asked, “What do you want?” “Leave me alone.” I lied back down with my heart racing. It took me what seemed like an hour to look up again to see if it was still there. It was gone. It never did come back. No other shadows remained. They were all gone and I never saw anything like them again.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I should also point out, that just like this girl, my wife told me this morning that she was not at all afraid of the shadow person. But just hearing about it weirded me out.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: Wife says she saw shadow person in our house yesterday. A house that happens to be 90 years old and we bought after the last guy who lived here died in it. Ex also saw shadow person. Have you?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First, I'm a huge skeptic and don't believe in the paranormal. Usually. My wife, on the other hand, was burning sage in our house yesterday because a lot of bad luck has been coming our way financially. And she thought it couldn't hurt. During this, she claims to have seen a shadow person at our front door - a man sized indistinct figure in the doorway.\n\nEntirely coincidentally, I was reading about shadow people Reddit last night (because of a horror script I'm working on) and got so spooked at 1:30 a.m. that I could hardly walk up the stairs to bed.\n\nNow, and this is true but is going to sound fucking crazy, the man who lived in the house before us was 92 and died in the very room where I'm typing this. The house is 90+ years old and we did an extensive remodel after buying it. I have a wife and two kids. He had a wife and two kids and moved in during the 60s I believe when his kids were approx the same age as my kids. Also a boy and girl. Kids grew up and moved out. Wife died. And he lived here a few years, very healthy and happy until he died in the house at 92.\n\nIn fact, I had completely forgotten he died in the house until I started this post. It wasn't even the reason I started it.\n\nInstead, I started it because my wife's story reminded me of a story an ex told me 20 years ago. She was an extremely rational person, didn't believe in ghosts or astrology or anything. But told me such a creepy story that when we reconnected on FB, I asked her to write it up so I could see if it's what I remembered. It was. And here it is, in her own words. Just wondering if anybody's had similar experiences:\n\n*I was in my apartment about 1 week when I started noticing something out of the corner of my eye. I would do a double take, but nothing was there. This continued for a few weeks. I kept noticing I would think I saw something out of the corner of my eye, but again, nothing was there. My attitude about it was not defensive or a scared feeling, I was indifferent to it with an “Oh well” attitude. Since I decided I was not afraid of the possibility of a potential entity I call “shadows”, I just went about my business and life seeing the shadows from the corner of my eye. Over time, the shadows allowed me to actually see them. No longer from the corner of my eye, but I could stare right at them moving around. These shadows were light grey in color and about the size of a small fist. They moved around the edges of my coffee table and end tables at a fairly fast pace.*\n\n*The shadows definitely stayed moving around specific pieces of furniture. They started around a large coffee table I had. This table was built for me (along with corresponding end table pieces) buy a family friend’s son in High Scholl woodshop. Over time they stayed the same size but multiplied and expanded their movement to other pieces of my furniture but only in my living room. Over the next year or so, the shadows started blending together becoming larger and slower and became a slightly darker grey color. This still did not bother me, I lived alone and kind of felt they were watching over me. This lasted for the entire time I lived at my apartment which was about 4 years.*\n\n*Because I was going back to school to obtain my Undergraduate degree, I moved back into my child hood home with my parents. I had two bedrooms to myself, one in which I had as my living room with my living room furniture, TV etc. I was somewhat surprised when after I settled in to my new living space, my shadows were back still moving around the living room furniture, nowhere else in the house. I did notice that they were bigger and darker from when I was at the apartment.*\n\n*Because I was busy with work and school, not being home too much, I did not pay a lot of attention to the shadows nor did I think about them much. I was still not bothered by them. After a while (approx. 1 year) I noticed the shadows moved with me between the little living room I had and my bedroom staying along sharp edges of furniture and walls. I still was not worried. They did start getting darker and larger. This kind of made me feel a bit nervous. One day in a causal conversation with a couple of friends, I mentioned my shadows. One was interested and one was angry with me and felt I needed to stop acknowledging and accepting them. Shortly after this discussion the shadow(s) started forming into one large very dark shape and would stand at the foot of my bed in the middle of the night. At this point the small grey shadows were not longer, just the larger shape at the foot of my bed. Every night I would wake up and it would be there. Each night it seemed to be larger than the night before. This kind of scared me. The large size and dark color was not as comforting as the small grey shapes were. The shape grew larger, darker and appeared to take on a blurred human outline.*\n\n*I was not sure what the intent of the shape was or what I should do about it. It seemed that the shape was growing and changes were happening rapidly. I talked to a counselor about this and she recommended that I confront the shape as to what it wanted.*\n\n*I finally worked up the nerve to confront the large dark shape at the end of my bed one night. I sat up and looked directly at it and loudly asked, “What do you want?” “Leave me alone.” I lied back down with my heart racing. It took me what seemed like an hour to look up again to see if it was still there. It was gone. It never did come back. No other shadows remained. They were all gone and I never saw anything like them again.*\n\n**I should also point out, that just like this girl, my wife told me this morning that she was not at all afraid of the shadow person. But just hearing about it weirded me out.**\n\n**TL;DR: Wife says she saw shadow person in our house yesterday. A house that happens to be 90 years old and we bought after the last guy who lived here died in it. Ex also saw shadow person. Have you?**\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ykbc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "waitshhhhhh", "saved": false, "mod_reports": [], "name": "t3_65ykbc", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65ykbc/wife_claims_she_saw_a_shadow_man_yesterday_in_our/", "num_reports": null, "locked": false, "stickied": false, "created": 1492493974.0, "url": "https://www.reddit.com/r/Paranormal/comments/65ykbc/wife_claims_she_saw_a_shadow_man_yesterday_in_our/", "author_flair_text": null, "quarantine": false, "title": "Wife claims she saw a shadow man yesterday in our house, which reminded me of a similar story that an ex of mine told me years ago. Anyone know anything about this or can direct me to more info?", "created_utc": 1492465174.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65ykbc", "likes": null, "replies": "", "user_reports": [], "id": "dgek2mj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ravenously_red", "parent_id": "t3_65ykbc", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Interesting encounters. \n\nThe age of your house has nothing to do with the shadow people coming and giving you a visit. I've seen them in old houses, and newly built houses/apartments. \n\nTypically they have shown up during times of stress/anxiety in my personal life. I'm not sure if there is anything external you can do to keep them away (although burning sage, putting mustard seeds above your windows and doors are the go to methods for a lot of people).\n\nShadow people are a real and fairly popular phenomenon. You might get lucky and see one some day.\n\nMy friend's father refused to believe that his house was haunted for the longest time. Everybody else saw the ghost of the man who formerly lived there, and would share their stories with him and he wouldn't believe anything about it. One night they were all playing cards at the table, and having a nice night in. Then suddenly his face went pure white. He said he saw the man peeking out at him from around the living room archway. \n\nJust because you haven't had an experience yet, it doesn't mean it'll never happen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting encounters. &lt;/p&gt;\n\n&lt;p&gt;The age of your house has nothing to do with the shadow people coming and giving you a visit. I&amp;#39;ve seen them in old houses, and newly built houses/apartments. &lt;/p&gt;\n\n&lt;p&gt;Typically they have shown up during times of stress/anxiety in my personal life. I&amp;#39;m not sure if there is anything external you can do to keep them away (although burning sage, putting mustard seeds above your windows and doors are the go to methods for a lot of people).&lt;/p&gt;\n\n&lt;p&gt;Shadow people are a real and fairly popular phenomenon. You might get lucky and see one some day.&lt;/p&gt;\n\n&lt;p&gt;My friend&amp;#39;s father refused to believe that his house was haunted for the longest time. Everybody else saw the ghost of the man who formerly lived there, and would share their stories with him and he wouldn&amp;#39;t believe anything about it. One night they were all playing cards at the table, and having a nice night in. Then suddenly his face went pure white. He said he saw the man peeking out at him from around the living room archway. &lt;/p&gt;\n\n&lt;p&gt;Just because you haven&amp;#39;t had an experience yet, it doesn&amp;#39;t mean it&amp;#39;ll never happen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgek2mj", "score_hidden": false, "stickied": false, "created": 1492511481.0, "created_utc": 1492482681.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65ykbc", "likes": null, "replies": "", "user_reports": [], "id": "dgelj3z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "seenstrangerthings", "parent_id": "t3_65ykbc", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I shared my shadow person experience on this subreddit a day ago, turned out to be a relative. Feel free to [read over it here](https://www.reddit.com/r/Paranormal/comments/65n6ot/recently_started_lurking_here_wanted_to_share_an/).\n\nI wasn't really aware that this was a very common thing and it's been great exploring these encounters, your ex's included. Thanks for sharing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I shared my shadow person experience on this subreddit a day ago, turned out to be a relative. Feel free to &lt;a href=\"https://www.reddit.com/r/Paranormal/comments/65n6ot/recently_started_lurking_here_wanted_to_share_an/\"&gt;read over it here&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t really aware that this was a very common thing and it&amp;#39;s been great exploring these encounters, your ex&amp;#39;s included. Thanks for sharing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgelj3z", "score_hidden": false, "stickied": false, "created": 1492513327.0, "created_utc": 1492484527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]