[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paranormal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s it like?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What's it like?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zig5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "bigbobsbeepers1999", "saved": false, "mod_reports": [], "name": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "approved_by": null, "over_18": false, "domain": "self.Paranormal", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qjxn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paranormal/comments/65zig5/does_anyone_suffer_from_sleep_paralysis/", "num_reports": null, "locked": false, "stickied": false, "created": 1492504095.0, "url": "https://www.reddit.com/r/Paranormal/comments/65zig5/does_anyone_suffer_from_sleep_paralysis/", "author_flair_text": null, "quarantine": false, "title": "Does anyone suffer from sleep paralysis?", "created_utc": 1492475295.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": "", "user_reports": [], "id": "dgeg1n3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "conbass91", "parent_id": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I get it all the time. Started happening a couple years ago. The first few times are really scary. You can't move, but you can see. I would try to yell out and nothing happens. At most, an almost silent groan as I try with everything in me just to speak or yell out. There is always what appears to be a figure hovering over you. I feel like its staring at me. For me its usually kinda white/gray in color. When it would happen while my TV was on, I would have the light from the TV to help me not be so frightened, but the sound from the TV doesn't sound like a show playing. At first its not understandable at all, and really scary sounding. Like spirits trying to talk or like the sound is playing at such a slow speed it sounds demonic. Your brain doesn't understand whats going on.\n\nIt has happened to me so often at this point, I can break it down really logically and calmly wait it out until I'm able to move and talk again. Sometimes (rarely) it happens as I'm falling asleep, and I'll start to feel my body go tingly and numb and my brain just feels it coming on. So if I can catch it and break out of it in time before the paralysis, I'm left with a pounding heart, not wanting to go back to sleep. If I don't catch it, I just have to deal with it until its over. I think it has to do with certain ways you're positioned while laying down or something. Only happens if I'm on my back with a thin pillow under my head (my preferred way to sleep).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get it all the time. Started happening a couple years ago. The first few times are really scary. You can&amp;#39;t move, but you can see. I would try to yell out and nothing happens. At most, an almost silent groan as I try with everything in me just to speak or yell out. There is always what appears to be a figure hovering over you. I feel like its staring at me. For me its usually kinda white/gray in color. When it would happen while my TV was on, I would have the light from the TV to help me not be so frightened, but the sound from the TV doesn&amp;#39;t sound like a show playing. At first its not understandable at all, and really scary sounding. Like spirits trying to talk or like the sound is playing at such a slow speed it sounds demonic. Your brain doesn&amp;#39;t understand whats going on.&lt;/p&gt;\n\n&lt;p&gt;It has happened to me so often at this point, I can break it down really logically and calmly wait it out until I&amp;#39;m able to move and talk again. Sometimes (rarely) it happens as I&amp;#39;m falling asleep, and I&amp;#39;ll start to feel my body go tingly and numb and my brain just feels it coming on. So if I can catch it and break out of it in time before the paralysis, I&amp;#39;m left with a pounding heart, not wanting to go back to sleep. If I don&amp;#39;t catch it, I just have to deal with it until its over. I think it has to do with certain ways you&amp;#39;re positioned while laying down or something. Only happens if I&amp;#39;m on my back with a thin pillow under my head (my preferred way to sleep).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgeg1n3", "score_hidden": false, "stickied": false, "created": 1492506634.0, "created_utc": 1492477834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": "", "user_reports": [], "id": "dgeh2gx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TwinPeaksandSunny", "parent_id": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "There's actually a sleep paralysis subreddit if you want to check it out. When I have an episode, it's usually during the day when I'm napping. For me, most of the time it feels like I'm moving but I'm not. I've had times where I'm panicking because I think I'm moving but realize I'm not, and I can't open my eyes but I \"reach\" for my phone and have even thought that I've texted someone for help. When I came out of it, my phone is across the room on a table. I've tried to yell before to wake up my boyfriend and I can't. My mouth feels clenched shut. I thankfully haven't had too many terrifying visions. Once I thought I heard someone come in my room and stood there breathing and watching me but it didn't happen. Another time I thought I saw a van pull up in my yard (which wasn't possible because the yard was completely fenced in), right up to the door and a dude got out and stared in the window at me. Another time I was babysitting and I took a nap while the kid was asleep and I think I was stressed the parents were going to come home and get mad at me so I kept trying to wake myself up but couldn't. I thought I had gotten up and walked out of the room all slumped over and talked to the kid's mom. When I woke up for real, none of that happened. Kid was still asleep. Parents weren't home. It's some really weird shit to experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s actually a sleep paralysis subreddit if you want to check it out. When I have an episode, it&amp;#39;s usually during the day when I&amp;#39;m napping. For me, most of the time it feels like I&amp;#39;m moving but I&amp;#39;m not. I&amp;#39;ve had times where I&amp;#39;m panicking because I think I&amp;#39;m moving but realize I&amp;#39;m not, and I can&amp;#39;t open my eyes but I &amp;quot;reach&amp;quot; for my phone and have even thought that I&amp;#39;ve texted someone for help. When I came out of it, my phone is across the room on a table. I&amp;#39;ve tried to yell before to wake up my boyfriend and I can&amp;#39;t. My mouth feels clenched shut. I thankfully haven&amp;#39;t had too many terrifying visions. Once I thought I heard someone come in my room and stood there breathing and watching me but it didn&amp;#39;t happen. Another time I thought I saw a van pull up in my yard (which wasn&amp;#39;t possible because the yard was completely fenced in), right up to the door and a dude got out and stared in the window at me. Another time I was babysitting and I took a nap while the kid was asleep and I think I was stressed the parents were going to come home and get mad at me so I kept trying to wake myself up but couldn&amp;#39;t. I thought I had gotten up and walked out of the room all slumped over and talked to the kid&amp;#39;s mom. When I woke up for real, none of that happened. Kid was still asleep. Parents weren&amp;#39;t home. It&amp;#39;s some really weird shit to experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgeh2gx", "score_hidden": false, "stickied": false, "created": 1492507924.0, "created_utc": 1492479124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": "", "user_reports": [], "id": "dgefu9x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aimease", "parent_id": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've been experiencing sleep paralysis since I was 10. 20 years now. Just had an episode this afternoon taking a nap. I'd like to say I'm \"used to it\" but it's still an awful experience, even though I've found mechanisms to ease myself out/calm myself down. \nIt's like being trapped in your body but being able to see your surroundings (or what appears to be in front of your eyes). Sometimes it's clear other times can be hazy and a strain to see (like underwater). Always a constant push and struggle against your physical self to move or wake up! Wake up! Sometimes it feels like someone is standing on your head with your cheek down on the pillow and if you freak out too much....you feel you might suffocate. The best thing for me to come out of it is to not resist. Close my \"eyes\", breath very long full breaths and try and \"go back to sleep\". A lot of times this transitions to lucid dreaming. Or the great moment of being able to move my body again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been experiencing sleep paralysis since I was 10. 20 years now. Just had an episode this afternoon taking a nap. I&amp;#39;d like to say I&amp;#39;m &amp;quot;used to it&amp;quot; but it&amp;#39;s still an awful experience, even though I&amp;#39;ve found mechanisms to ease myself out/calm myself down. \nIt&amp;#39;s like being trapped in your body but being able to see your surroundings (or what appears to be in front of your eyes). Sometimes it&amp;#39;s clear other times can be hazy and a strain to see (like underwater). Always a constant push and struggle against your physical self to move or wake up! Wake up! Sometimes it feels like someone is standing on your head with your cheek down on the pillow and if you freak out too much....you feel you might suffocate. The best thing for me to come out of it is to not resist. Close my &amp;quot;eyes&amp;quot;, breath very long full breaths and try and &amp;quot;go back to sleep&amp;quot;. A lot of times this transitions to lucid dreaming. Or the great moment of being able to move my body again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgefu9x", "score_hidden": false, "stickied": false, "created": 1492506380.0, "created_utc": 1492477580.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": "", "user_reports": [], "id": "dgegua6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wendyinneverland", "parent_id": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "I've had it for 7 years. Not as much lately though. Never since I've started sleeping in the same bed as my boyfriend all the time. \nI've learnt to ease myself out of it. I refuse to open my eyes and try to focus on moving a finger or my toes. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had it for 7 years. Not as much lately though. Never since I&amp;#39;ve started sleeping in the same bed as my boyfriend all the time. \nI&amp;#39;ve learnt to ease myself out of it. I refuse to open my eyes and try to focus on moving a finger or my toes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgegua6", "score_hidden": false, "stickied": false, "created": 1492507639.0, "created_utc": 1492478839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": "", "user_reports": [], "id": "dgemaaa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EighthManBound", "parent_id": "t1_dgelf2f", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "&gt;One night suddenly I was just awake with the TV on (I sleep with it off) and my fiance entered the room telling me that I was screaming my head off for ten minutes.\n\nI'm curious as to why the TV was on, now. Or was the whole thing, including your fiance, a hallucination?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One night suddenly I was just awake with the TV on (I sleep with it off) and my fiance entered the room telling me that I was screaming my head off for ten minutes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m curious as to why the TV was on, now. Or was the whole thing, including your fiance, a hallucination?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgemaaa", "score_hidden": false, "stickied": false, "created": 1492514283.0, "created_utc": 1492485483.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgelf2f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SparkleFritz", "parent_id": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "For me it's hypnagogic hallucinations. I'll be falling asleep when I'll notice something in the room. Sometimes it's a physical thing or other times it's a noise. Sometimes it's just a feeling. I'll feel like I'm in the half-asleep state when it happens.\n\nThe noises and the feelings aren't that scary. An example of the feeling is when I'll get a nervous feeling, like someone is watching me or standing in the room, but when I open my eyes there's nothing there. The noises are normally sounds of something clearly falling over in the room and hitting the floor but there's never anything there. I thought it was someone living in my closet when I was younger and when I got older I thought it was ghosts.\n\nThe visions that turn into night terrors are the worst. When I was four years old I used to see spiders crawling down the walls and I'd scream for my parents but they could never see them. When I started getting older it would be random objects. I used to charge my laptop next to my bed and once I looked over to see it smashed into a bunch of pieces. Other times I'll see lights or pieces of paper flying through the air.\n\nWhen I got into my twenties they turned into full out terrors. I'd awake to people standing at the foot of my bed, or running at me from the corner of the room. One night suddenly I was just awake with the TV on (I sleep with it off) and my fiance entered the room telling me that I was screaming my head off for ten minutes. The worst was when I was sleeping alone in bed and when I rolled over there was someone crawling into my bed at a fast pace and they got right next to my face before I \"woke up\". My throat hurt from the screaming.\n\nFor me, it's a narcolepsy thing, but my recent test came up inconclusive due to my sleep timings. I once found a short YouTube horror story that portrayed sleep paralysis and night terrors perfectly but I can't remember what it was. If I find it I'll edit it into the post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me it&amp;#39;s hypnagogic hallucinations. I&amp;#39;ll be falling asleep when I&amp;#39;ll notice something in the room. Sometimes it&amp;#39;s a physical thing or other times it&amp;#39;s a noise. Sometimes it&amp;#39;s just a feeling. I&amp;#39;ll feel like I&amp;#39;m in the half-asleep state when it happens.&lt;/p&gt;\n\n&lt;p&gt;The noises and the feelings aren&amp;#39;t that scary. An example of the feeling is when I&amp;#39;ll get a nervous feeling, like someone is watching me or standing in the room, but when I open my eyes there&amp;#39;s nothing there. The noises are normally sounds of something clearly falling over in the room and hitting the floor but there&amp;#39;s never anything there. I thought it was someone living in my closet when I was younger and when I got older I thought it was ghosts.&lt;/p&gt;\n\n&lt;p&gt;The visions that turn into night terrors are the worst. When I was four years old I used to see spiders crawling down the walls and I&amp;#39;d scream for my parents but they could never see them. When I started getting older it would be random objects. I used to charge my laptop next to my bed and once I looked over to see it smashed into a bunch of pieces. Other times I&amp;#39;ll see lights or pieces of paper flying through the air.&lt;/p&gt;\n\n&lt;p&gt;When I got into my twenties they turned into full out terrors. I&amp;#39;d awake to people standing at the foot of my bed, or running at me from the corner of the room. One night suddenly I was just awake with the TV on (I sleep with it off) and my fiance entered the room telling me that I was screaming my head off for ten minutes. The worst was when I was sleeping alone in bed and when I rolled over there was someone crawling into my bed at a fast pace and they got right next to my face before I &amp;quot;woke up&amp;quot;. My throat hurt from the screaming.&lt;/p&gt;\n\n&lt;p&gt;For me, it&amp;#39;s a narcolepsy thing, but my recent test came up inconclusive due to my sleep timings. I once found a short YouTube horror story that portrayed sleep paralysis and night terrors perfectly but I can&amp;#39;t remember what it was. If I find it I&amp;#39;ll edit it into the post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgelf2f", "score_hidden": false, "stickied": false, "created": 1492513173.0, "created_utc": 1492484373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": "", "user_reports": [], "id": "dgenh3k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "embug102116", "parent_id": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "My mother had a period of time where she experienced sleep paralysis. She would open her eyes and feel completely paralyzed. She could look around but couldn't speak or move. Every time it happened she would see a man with an orange sweater pushing a wheelbarrow through their bedroom. She said it was terrifying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mother had a period of time where she experienced sleep paralysis. She would open her eyes and feel completely paralyzed. She could look around but couldn&amp;#39;t speak or move. Every time it happened she would see a man with an orange sweater pushing a wheelbarrow through their bedroom. She said it was terrifying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgenh3k", "score_hidden": false, "stickied": false, "created": 1492515956.0, "created_utc": 1492487156.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjxn", "removal_reason": null, "link_id": "t3_65zig5", "likes": null, "replies": "", "user_reports": [], "id": "dgenks5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Quasimodo6", "parent_id": "t3_65zig5", "subreddit_name_prefixed": "r/Paranormal", "controversiality": 0, "body": "Yes I have. The horrible feeling of being partially awake but unable to move. Terrifying. Horrible nightmares. One nightmare where I was floating over my sleeping body observing myself sleeping. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I have. The horrible feeling of being partially awake but unable to move. Terrifying. Horrible nightmares. One nightmare where I was floating over my sleeping body observing myself sleeping. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paranormal", "name": "t1_dgenks5", "score_hidden": false, "stickied": false, "created": 1492516100.0, "created_utc": 1492487300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]