[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "college", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in my second year of chemical engineering and majors are being introduced. I failed two subjects last sem and now I&amp;#39;m delayed for one semester (and could possibly be a year because I will fail this semester). The thing is, my family supports me in changing my course but I&amp;#39;m not sure if I want to give up on this. It does, sadly, affect my mental health badly. &lt;/p&gt;\n\n&lt;p&gt;The school that I&amp;#39;m transferring to doesn&amp;#39;t offer ChE. I&amp;#39;m losing my shit while studying. I&amp;#39;m getting more and more depressed. I&amp;#39;m failing most of my classes. &lt;/p&gt;\n\n&lt;p&gt;I just don&amp;#39;t know what to do anymore. ChE job offers makes me want to stay but I don&amp;#39;t know if I would have a future because I fail something every semester.&lt;/p&gt;\n\n&lt;p&gt;Why I want to stay: the course is good, it&amp;#39;s interesting, my salary would be good, I&amp;#39;m already in my second year, I have no idea where I&amp;#39;ll shift because I don&amp;#39;t see myself anywhere (even in ChE), every other course I think of seems to be inferior compared to ChE&lt;/p&gt;\n\n&lt;p&gt;Why I want to leave: It&amp;#39;s bad for my health, I don&amp;#39;t understand anything anymore, it feels suffocating everyday, it drains me just by thinking about it, I keep failing thus affecting my record &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm in my second year of chemical engineering and majors are being introduced. I failed two subjects last sem and now I'm delayed for one semester (and could possibly be a year because I will fail this semester). The thing is, my family supports me in changing my course but I'm not sure if I want to give up on this. It does, sadly, affect my mental health badly. \n\nThe school that I'm transferring to doesn't offer ChE. I'm losing my shit while studying. I'm getting more and more depressed. I'm failing most of my classes. \n\nI just don't know what to do anymore. ChE job offers makes me want to stay but I don't know if I would have a future because I fail something every semester.\n\nWhy I want to stay: the course is good, it's interesting, my salary would be good, I'm already in my second year, I have no idea where I'll shift because I don't see myself anywhere (even in ChE), every other course I think of seems to be inferior compared to ChE\n\nWhy I want to leave: It's bad for my health, I don't understand anything anymore, it feels suffocating everyday, it drains me just by thinking about it, I keep failing thus affecting my record ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64y3lm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "LynCross", "saved": false, "mod_reports": [], "name": "t3_64y3lm", "subreddit_name_prefixed": "r/college", "approved_by": null, "over_18": false, "domain": "self.college", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3z", "edited": 1492003951.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/college/comments/64y3lm/torn_between_dropping_che_or_continuing/", "num_reports": null, "locked": false, "stickied": false, "created": 1492032122.0, "url": "https://www.reddit.com/r/college/comments/64y3lm/torn_between_dropping_che_or_continuing/", "author_flair_text": null, "quarantine": false, "title": "Torn between dropping ChE or continuing", "created_utc": 1492003322.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_64y3lm", "likes": null, "replies": "", "user_reports": [], "id": "dg5y2oa", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "CrimsonElf22", "parent_id": "t3_64y3lm", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "You should maybe consider taking a semester off or something, especially if you are already delayed.  It sounds like you find the fundamentals of the major very interesting, but you're getting so lost at this point it's not worth it for you or your health.  If you continue failing, it's not a bad idea to switch.  The job offers are good, but if your GPA is plummeting then there are tons of other ChE majors who are going to get the jobs.  \n\nI've been having my own problems too w/ major-related stuff.  Just try and make yourself happier, whatever that may be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should maybe consider taking a semester off or something, especially if you are already delayed.  It sounds like you find the fundamentals of the major very interesting, but you&amp;#39;re getting so lost at this point it&amp;#39;s not worth it for you or your health.  If you continue failing, it&amp;#39;s not a bad idea to switch.  The job offers are good, but if your GPA is plummeting then there are tons of other ChE majors who are going to get the jobs.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been having my own problems too w/ major-related stuff.  Just try and make yourself happier, whatever that may be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dg5y2oa", "score_hidden": false, "stickied": false, "created": 1492036711.0, "created_utc": 1492007911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_64y3lm", "likes": null, "replies": "", "user_reports": [], "id": "dg5z6vg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rawrasaurous101", "parent_id": "t3_64y3lm", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "ChE is hard. There is no way around that, and it sounds like it is beating you. It sounds like you are interested in the material but just can't keep up with the work for a variety of reasons.\n\n\nBefore I go into suggestions for keeping up with the work, I'm going to ask if you have thought about what you will do with ChE after college. Because when you first start ChE they tell you \"ChemEs can work in any industry! The world is your oyster!\" Not to be a complete debbie downer, but you find out when you actually look at job prospects that what you were told is absolute BS. Yes ChE can get you into almost any science-y feild, but most of the jobs are in manufacturing. If working in a manufacturing plant doesn't sound interesting to you, please do some hard research into the other prospects because they are not as easy to get into. Or, look at what you want to do after college and find a different major that you can get there with. If manufacturing is your dream, you are in the right major!\n\n\nIf you do really think you want to be a chemical engineer after college:\n\n\n I am not great at addressing issues with mental health, but I would suggest talking to a councilor/mental health professional. Your mental health seems to be suffering quite a bit and I think they could help you a lot.\n\nGo to your professors and talk to them. It sounds like you are suffering in silence and just expecting to get the material on your own. Most professors want you to succeed and will give you help. Please talk to them. \n\n\nMy personal opinion is that you don't see yourself in ChE and you are clearly suffering. It may not be the right choice for you.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ChE is hard. There is no way around that, and it sounds like it is beating you. It sounds like you are interested in the material but just can&amp;#39;t keep up with the work for a variety of reasons.&lt;/p&gt;\n\n&lt;p&gt;Before I go into suggestions for keeping up with the work, I&amp;#39;m going to ask if you have thought about what you will do with ChE after college. Because when you first start ChE they tell you &amp;quot;ChemEs can work in any industry! The world is your oyster!&amp;quot; Not to be a complete debbie downer, but you find out when you actually look at job prospects that what you were told is absolute BS. Yes ChE can get you into almost any science-y feild, but most of the jobs are in manufacturing. If working in a manufacturing plant doesn&amp;#39;t sound interesting to you, please do some hard research into the other prospects because they are not as easy to get into. Or, look at what you want to do after college and find a different major that you can get there with. If manufacturing is your dream, you are in the right major!&lt;/p&gt;\n\n&lt;p&gt;If you do really think you want to be a chemical engineer after college:&lt;/p&gt;\n\n&lt;p&gt;I am not great at addressing issues with mental health, but I would suggest talking to a councilor/mental health professional. Your mental health seems to be suffering quite a bit and I think they could help you a lot.&lt;/p&gt;\n\n&lt;p&gt;Go to your professors and talk to them. It sounds like you are suffering in silence and just expecting to get the material on your own. Most professors want you to succeed and will give you help. Please talk to them. &lt;/p&gt;\n\n&lt;p&gt;My personal opinion is that you don&amp;#39;t see yourself in ChE and you are clearly suffering. It may not be the right choice for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dg5z6vg", "score_hidden": false, "stickied": false, "created": 1492037984.0, "created_utc": 1492009184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]