[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "college", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a bit torn between which of the following two schools would be a better fit. I got in to both and deadline for accepting is April 15th.&lt;/p&gt;\n\n&lt;p&gt;Background information: I currently live in Charlotte with my significant other and work a full time job. I graduated from Chapel Hill last year as a pre-med student but have since changed courses and am now going into Masters in Health Administration.&lt;/p&gt;\n\n&lt;p&gt;Considerations- Chapel Hill is about 10 grand more over the course of two years than Charlotte. This matters, but it is not the biggest concern. I will be paying with student loans.\nChapel Hill is consistently a top 5 school for the MHA degree while Charlotte is more middle of the pack.\nChapel Hill is an all online course, which provides me with more flexibility, however detracts from benefits of getting to know professors, networking, and in person learning.\nI plan on staying in Charlotte after I graduate and finding work here and I feel like UNC Charlotte would provide more valuable connections to finding work in my community.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s pretty much it. The main internal debate I am having is which route would provide me with the better likelihood of getting the better job: having the name recognition of UNC or having the in person local connections I assume will be easier to make in Charlotte. I would rather go to Chapel Hill, but I&amp;#39;ve been given the advice that the extra cost isn&amp;#39;t worth it for the name recognition because most jobs will care more about your work experience than where you graduated from, and I will start entry level position no matter where I graduate from.\nFor those who don&amp;#39;t know, Chapel Hill is about 2 and a half hours from Charlotte, so I just don&amp;#39;t feel very confident with what connections/networking opportunities I will get from there or what kind of recommendations I will get if they never get to know me in person. I am an excellent student, but in my experience the professors who have stuck out the most for me weren&amp;#39;t the ones I did best in their class but the ones who I got to know in person the best.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am a bit torn between which of the following two schools would be a better fit. I got in to both and deadline for accepting is April 15th.\n\nBackground information: I currently live in Charlotte with my significant other and work a full time job. I graduated from Chapel Hill last year as a pre-med student but have since changed courses and am now going into Masters in Health Administration.\n\nConsiderations- Chapel Hill is about 10 grand more over the course of two years than Charlotte. This matters, but it is not the biggest concern. I will be paying with student loans.\nChapel Hill is consistently a top 5 school for the MHA degree while Charlotte is more middle of the pack.\nChapel Hill is an all online course, which provides me with more flexibility, however detracts from benefits of getting to know professors, networking, and in person learning.\nI plan on staying in Charlotte after I graduate and finding work here and I feel like UNC Charlotte would provide more valuable connections to finding work in my community.\n\nThat's pretty much it. The main internal debate I am having is which route would provide me with the better likelihood of getting the better job: having the name recognition of UNC or having the in person local connections I assume will be easier to make in Charlotte. I would rather go to Chapel Hill, but I've been given the advice that the extra cost isn't worth it for the name recognition because most jobs will care more about your work experience than where you graduated from, and I will start entry level position no matter where I graduate from.\nFor those who don't know, Chapel Hill is about 2 and a half hours from Charlotte, so I just don't feel very confident with what connections/networking opportunities I will get from there or what kind of recommendations I will get if they never get to know me in person. I am an excellent student, but in my experience the professors who have stuck out the most for me weren't the ones I did best in their class but the ones who I got to know in person the best.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6514gz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Keldez2815", "saved": false, "mod_reports": [], "name": "t3_6514gz", "subreddit_name_prefixed": "r/college", "approved_by": null, "over_18": false, "domain": "self.college", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3z", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/college/comments/6514gz/unc_chapel_hill_or_unc_charlotte_for_grad_school/", "num_reports": null, "locked": false, "stickied": false, "created": 1492061064.0, "url": "https://www.reddit.com/r/college/comments/6514gz/unc_chapel_hill_or_unc_charlotte_for_grad_school/", "author_flair_text": null, "quarantine": false, "title": "UNC Chapel Hill or UNC Charlotte for Grad School?", "created_utc": 1492032264.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_6514gz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_6514gz", "likes": null, "replies": "", "user_reports": [], "id": "dg6u2uk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Keldez2815", "parent_id": "t1_dg6pvo9", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Chapel Hill offers what they call an executive MHA program that is almost all online with 14 days of in person training spread out through the 2 year program. Are you saying the advantages of Chapel Hill's MHA over Charlotte's are lost when you do the Executive MHA? Moving to Chapel Hill to attend the in person MHA program is not an option for me at this time. \n\nHope that clarifies and I appreciate your insight!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chapel Hill offers what they call an executive MHA program that is almost all online with 14 days of in person training spread out through the 2 year program. Are you saying the advantages of Chapel Hill&amp;#39;s MHA over Charlotte&amp;#39;s are lost when you do the Executive MHA? Moving to Chapel Hill to attend the in person MHA program is not an option for me at this time. &lt;/p&gt;\n\n&lt;p&gt;Hope that clarifies and I appreciate your insight!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dg6u2uk", "score_hidden": false, "stickied": false, "created": 1492071994.0, "created_utc": 1492043194.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pvo9", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "posed2", "parent_id": "t3_6514gz", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Hi there.  Former senior administrator at Chapel Hill, and expert in the higher ed enterprise more generally.  First, a clarifying question.  At one point, you say the Chapel Hill option is \"all online.\"  This is VERY different than attending the graduate program at Chapel Hill.  If you are considering attending Chapel Hill in person, and working in NC, I would tend to recommend Chapel Hill. The alum community statewide is so highly connected and influential, you could expect great networking and job prospects.  If you're talking about an online degree....no so much.  If your world and your life and your future is in Charlotte, I'd STILL recommend Chapel Hill, if you hope for the best opportunities in public health.  Any followup questions, please feel free to ask.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there.  Former senior administrator at Chapel Hill, and expert in the higher ed enterprise more generally.  First, a clarifying question.  At one point, you say the Chapel Hill option is &amp;quot;all online.&amp;quot;  This is VERY different than attending the graduate program at Chapel Hill.  If you are considering attending Chapel Hill in person, and working in NC, I would tend to recommend Chapel Hill. The alum community statewide is so highly connected and influential, you could expect great networking and job prospects.  If you&amp;#39;re talking about an online degree....no so much.  If your world and your life and your future is in Charlotte, I&amp;#39;d STILL recommend Chapel Hill, if you hope for the best opportunities in public health.  Any followup questions, please feel free to ask.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dg6pvo9", "score_hidden": false, "stickied": false, "created": 1492066789.0, "created_utc": 1492037989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}]