[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "college", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ve seen a few different articles and posts on this subject but I had some specific questions.that I haven&amp;#39;t gotten answered.&lt;/p&gt;\n\n&lt;p&gt;I went to school for 3 years and in that time just gradually dropped my grades due to some mental health issues, and decided to take a gap year to sort myself out. I&amp;#39;ve decided that I want to change my major. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m still enrolled in my university, but I&amp;#39;m on &amp;quot;academic leave&amp;quot; and with my grades, I can&amp;#39;t change my major if I come back. As it stands, I think I have to go to a CC and then go back into a 4-year. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m here to ask questions because I tried to contact my transfer advisor and she ignored my emails (yes, really) and I would really like some advice. &lt;/p&gt;\n\n&lt;p&gt;Basically, here are my questions-&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Since I do have some salvageable classes that would work for general credit, would it be possible to transfer those to my CC when I go, so I don&amp;#39;t have to retake the classes that I did well in? I&amp;#39;ve only heard of transferring the other way around. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;How concerned do I have to be about reaching a unit limit? When attending my 4-year I know there was a maximum amount of units you could take during your attendance, but I don&amp;#39;t know how this sort of thing works with transfers. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If I show significant academic progress while at the CC, is it possible to make up for my past mistakes? I&amp;#39;m terrified that I won&amp;#39;t be accepted into another 4-year after what happened. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Thank you for any advice you can give. I&amp;#39;ll be talking to the staff at the transfer center of my local CC, but I feel like they won&amp;#39;t have time to go over things as slowly as I&amp;#39;d like so I want to go in with some prior knowledge. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I've seen a few different articles and posts on this subject but I had some specific questions.that I haven't gotten answered.\n\nI went to school for 3 years and in that time just gradually dropped my grades due to some mental health issues, and decided to take a gap year to sort myself out. I've decided that I want to change my major. \n\nI'm still enrolled in my university, but I'm on \"academic leave\" and with my grades, I can't change my major if I come back. As it stands, I think I have to go to a CC and then go back into a 4-year. \n\nI'm here to ask questions because I tried to contact my transfer advisor and she ignored my emails (yes, really) and I would really like some advice. \n\nBasically, here are my questions-\n\n1. Since I do have some salvageable classes that would work for general credit, would it be possible to transfer those to my CC when I go, so I don't have to retake the classes that I did well in? I've only heard of transferring the other way around. \n\n2. How concerned do I have to be about reaching a unit limit? When attending my 4-year I know there was a maximum amount of units you could take during your attendance, but I don't know how this sort of thing works with transfers. \n\n3. If I show significant academic progress while at the CC, is it possible to make up for my past mistakes? I'm terrified that I won't be accepted into another 4-year after what happened. \n\nThank you for any advice you can give. I'll be talking to the staff at the transfer center of my local CC, but I feel like they won't have time to go over things as slowly as I'd like so I want to go in with some prior knowledge. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ad6k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "lionleo20", "saved": false, "mod_reports": [], "name": "t3_65ad6k", "subreddit_name_prefixed": "r/college", "approved_by": null, "over_18": false, "domain": "self.college", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3z", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/college/comments/65ad6k/how_do_i_restart_college_after_almost_failing_out/", "num_reports": null, "locked": false, "stickied": false, "created": 1492170406.0, "url": "https://www.reddit.com/r/college/comments/65ad6k/how_do_i_restart_college_after_almost_failing_out/", "author_flair_text": null, "quarantine": false, "title": "How do I restart college after (almost) failing out?", "created_utc": 1492141606.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65ad6k", "likes": null, "replies": "", "user_reports": [], "id": "dg9hlz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "INTJ_Hokie", "parent_id": "t3_65ad6k", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "1. I cannot imagine a situation where you cannot transfer your courses to CC. You haven't heard of it because it's just not that common. I believe it is called a reverse transfer. Just send your transcripts to the registrar or whoever.\n\n2. This would likely depend on the college/state's policies. I would imagine that credits that don't transfer (incompatible material or because they do not meet min. grade requirements) do not apply to the college's maximum limit of attempted courses. It could impact financial aid. \n\n3. Depends on what college you are applying to. I know people who left 4 years, went to CC, then went to the same or a different 4 year, it's certainly not impossible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I cannot imagine a situation where you cannot transfer your courses to CC. You haven&amp;#39;t heard of it because it&amp;#39;s just not that common. I believe it is called a reverse transfer. Just send your transcripts to the registrar or whoever.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This would likely depend on the college/state&amp;#39;s policies. I would imagine that credits that don&amp;#39;t transfer (incompatible material or because they do not meet min. grade requirements) do not apply to the college&amp;#39;s maximum limit of attempted courses. It could impact financial aid. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Depends on what college you are applying to. I know people who left 4 years, went to CC, then went to the same or a different 4 year, it&amp;#39;s certainly not impossible. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dg9hlz4", "score_hidden": false, "stickied": false, "created": 1492221318.0, "created_utc": 1492192518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]