[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "college", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m thinking about transferring, but I&amp;#39;m just worried if I will feel out place/not at home. I&amp;#39;ve moved schools alot during highschool and it was hard for me to make friends, so I&amp;#39;m not sure if I should look to do it in college. Who could tell me their experience with transferring schools?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm thinking about transferring, but I'm just worried if I will feel out place/not at home. I've moved schools alot during highschool and it was hard for me to make friends, so I'm not sure if I should look to do it in college. Who could tell me their experience with transferring schools?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65esrq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Collegesecondchance", "saved": false, "mod_reports": [], "name": "t3_65esrq", "subreddit_name_prefixed": "r/college", "approved_by": null, "over_18": false, "domain": "self.college", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3z", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/college/comments/65esrq/experience_as_a_transfer/", "num_reports": null, "locked": false, "stickied": false, "created": 1492228434.0, "url": "https://www.reddit.com/r/college/comments/65esrq/experience_as_a_transfer/", "author_flair_text": null, "quarantine": false, "title": "Experience as a transfer?", "created_utc": 1492199634.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65esrq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65esrq", "likes": null, "replies": "", "user_reports": [], "id": "dgahkig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ukani", "parent_id": "t1_dg9syuw", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Spot on. I transferred from a CC to a state school and have had a similar experience. \n\nI had no idea what the \"College Experience\" actually meant until I transferred to state university and discovered that I had totally missed the \"College Experience\". Students love to complain about being stuck in a tiny dorm with a stranger, and all that shit, but in truth its that shared experience that all freshmen in university have that helps them all bond and develop strong networks over their 4 years. When I transferred to university it was a huge culture shock to me (and still is  starting my senior year). I just don't have the same experiences all my peers have to relate too. I often feel like to my peers college is their life. Its everything to them. But to me its just this little side thing Im doing. Im having a hard time really allowing \"college experience\" to become my life. I mean I get good grades (3.4gpa), but that's not enough. People (other students and professors) expect you to think and act a certain way, and if you don't it makes it really hard to get internships, connections, and jobs.\n\nOther students eat, sleep, and breath college. Literally from the moment they get up at 7:00am to the moment they go to bed everything they do is related to their college experience. For me college doesn't begin until I hit my first class at 11:00am and it ends with I get home at 7:00pm. To me college is like a bubble that I enter and leave every day. Its like a separate world.\n\nSorry for rambling. Just wanted to get that off my chest. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Spot on. I transferred from a CC to a state school and have had a similar experience. &lt;/p&gt;\n\n&lt;p&gt;I had no idea what the &amp;quot;College Experience&amp;quot; actually meant until I transferred to state university and discovered that I had totally missed the &amp;quot;College Experience&amp;quot;. Students love to complain about being stuck in a tiny dorm with a stranger, and all that shit, but in truth its that shared experience that all freshmen in university have that helps them all bond and develop strong networks over their 4 years. When I transferred to university it was a huge culture shock to me (and still is  starting my senior year). I just don&amp;#39;t have the same experiences all my peers have to relate too. I often feel like to my peers college is their life. Its everything to them. But to me its just this little side thing Im doing. Im having a hard time really allowing &amp;quot;college experience&amp;quot; to become my life. I mean I get good grades (3.4gpa), but that&amp;#39;s not enough. People (other students and professors) expect you to think and act a certain way, and if you don&amp;#39;t it makes it really hard to get internships, connections, and jobs.&lt;/p&gt;\n\n&lt;p&gt;Other students eat, sleep, and breath college. Literally from the moment they get up at 7:00am to the moment they go to bed everything they do is related to their college experience. For me college doesn&amp;#39;t begin until I hit my first class at 11:00am and it ends with I get home at 7:00pm. To me college is like a bubble that I enter and leave every day. Its like a separate world.&lt;/p&gt;\n\n&lt;p&gt;Sorry for rambling. Just wanted to get that off my chest. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgahkig", "score_hidden": false, "stickied": false, "created": 1492277134.0, "created_utc": 1492248334.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9syuw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "razorchant", "parent_id": "t3_65esrq", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I go to school in California, so the most common transfer route people take are California City Colleges (CCC) to UC/CSU. I dicked around too much in high school and was too cocking applying when I was a senior, so when I finally got admissions letters from schools, it turned out that I didn't get into anywhere I applied (albeit only a bunch of UCs and CSUs). I was fortunate enough to be in the top 20% of California students academically speaking, so I was guaranteed a spot at a UC. I ended up getting an acceptance letter from the one UC I didn't apply to - UC Merced. After spending a semester there, I started to make new plans to transfer out since I was not enjoying my time at UC Merced. I ended up withdrawing after completing one semester, and going to school at city college in my home town. Here, I spent about a year and a half, and wound up applying to transfer out to another UC. Despite having switched majors (from bio-sci/premed to engineering), I ended up getting accepted into UC Irvine. I have so far spent two years here now.\n\nNow, enough of the background information. I would say that a lot of the time, I look back and regretted spending too much time doing shit that led me to be stuck at a university without any choice. Time doesn't stand still while you get your life together, everything just kinda keeps moving on. While my friends were all developing their close relationships with other 1st and 2nd years, and having these new college experiences, I was busy just going to school and trying to figure out where I was going. When I finally got out of the city college system, I found that transferring into a new school was no walk in the park socially. It took me a while to get my feet under me, and it was a little weird meeting new people, because I didn't have things like hall mates or special freshmen-oriented programs. It took me a while to finally find my place within the social hierarchy. It was hard and I've spent a while thinking about those things. Being a transfer can feel so wildly different than being a freshman at a new school.\n\nI know you're worried about not feeling at home and not feeling like you have a place if you transfer, and I would say that it will depend on a lot of things how things will end up. Everybody is different, and every school is different. For me, it was tough to find a place when I transferred and I had to spend a lot of time working on myself and forcing myself to go out and expose myself to experiences where I could meet people that I could relate to and form relationships with. Not everyone will have these challenges, but it was certainly an obstacle I had to overcome when I went through the transfer process.\n\nAs a final note, i will just say that if you plan on transferring, I'd be very serious about the steps you intend on taking to get where you want to go. If you're not feeling academically challenged enough at your current school, and you have aspirations to go to a more academically-elite institution, be sure that you know the requirements and the logistics of getting you from here to there. Participate in any clubs or extracurricular activities that will bolster your transfer application. Take your school work seriously. Make sure you're fulfilling the transfer requirements for the program you're in for the university you plan on transferring to. There are dozens of resources all over the internet that help with students looking to transfer - you just need to know where to look. At the same time, don't rob yourself of the first two years of college. Go out and try to experience new things. Have some fun, and spend some time working on yourself. \n\nI wish you the best of luck with whatever decision you end up making! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I go to school in California, so the most common transfer route people take are California City Colleges (CCC) to UC/CSU. I dicked around too much in high school and was too cocking applying when I was a senior, so when I finally got admissions letters from schools, it turned out that I didn&amp;#39;t get into anywhere I applied (albeit only a bunch of UCs and CSUs). I was fortunate enough to be in the top 20% of California students academically speaking, so I was guaranteed a spot at a UC. I ended up getting an acceptance letter from the one UC I didn&amp;#39;t apply to - UC Merced. After spending a semester there, I started to make new plans to transfer out since I was not enjoying my time at UC Merced. I ended up withdrawing after completing one semester, and going to school at city college in my home town. Here, I spent about a year and a half, and wound up applying to transfer out to another UC. Despite having switched majors (from bio-sci/premed to engineering), I ended up getting accepted into UC Irvine. I have so far spent two years here now.&lt;/p&gt;\n\n&lt;p&gt;Now, enough of the background information. I would say that a lot of the time, I look back and regretted spending too much time doing shit that led me to be stuck at a university without any choice. Time doesn&amp;#39;t stand still while you get your life together, everything just kinda keeps moving on. While my friends were all developing their close relationships with other 1st and 2nd years, and having these new college experiences, I was busy just going to school and trying to figure out where I was going. When I finally got out of the city college system, I found that transferring into a new school was no walk in the park socially. It took me a while to get my feet under me, and it was a little weird meeting new people, because I didn&amp;#39;t have things like hall mates or special freshmen-oriented programs. It took me a while to finally find my place within the social hierarchy. It was hard and I&amp;#39;ve spent a while thinking about those things. Being a transfer can feel so wildly different than being a freshman at a new school.&lt;/p&gt;\n\n&lt;p&gt;I know you&amp;#39;re worried about not feeling at home and not feeling like you have a place if you transfer, and I would say that it will depend on a lot of things how things will end up. Everybody is different, and every school is different. For me, it was tough to find a place when I transferred and I had to spend a lot of time working on myself and forcing myself to go out and expose myself to experiences where I could meet people that I could relate to and form relationships with. Not everyone will have these challenges, but it was certainly an obstacle I had to overcome when I went through the transfer process.&lt;/p&gt;\n\n&lt;p&gt;As a final note, i will just say that if you plan on transferring, I&amp;#39;d be very serious about the steps you intend on taking to get where you want to go. If you&amp;#39;re not feeling academically challenged enough at your current school, and you have aspirations to go to a more academically-elite institution, be sure that you know the requirements and the logistics of getting you from here to there. Participate in any clubs or extracurricular activities that will bolster your transfer application. Take your school work seriously. Make sure you&amp;#39;re fulfilling the transfer requirements for the program you&amp;#39;re in for the university you plan on transferring to. There are dozens of resources all over the internet that help with students looking to transfer - you just need to know where to look. At the same time, don&amp;#39;t rob yourself of the first two years of college. Go out and try to experience new things. Have some fun, and spend some time working on yourself. &lt;/p&gt;\n\n&lt;p&gt;I wish you the best of luck with whatever decision you end up making! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dg9syuw", "score_hidden": false, "stickied": false, "created": 1492235116.0, "created_utc": 1492206316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]