[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "college", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m transferring to UCSB and move in either September or June/July if i take summer classes (most likely not). To pay rent at the Univ apartments, pay for food, and books (along with hopefully luxuries) i want to find a job, work 3 or 4 days a week like i do now, and take a full schedule (which is usually 3 classes i hear) in order to keep my Grant. A part time job (hopefully on campus) and a full unit schedule are non-negotiable for me, i need to be able to pay the bulk of my expenses without a lot of financial help from my parents.&lt;/p&gt;\n\n&lt;p&gt;But how many meeting per class are in a week? On a semester system at my CC it&amp;#39;s usually 2 meetings, each 1.5 hrs, or 1 meeting at 3 hrs (depending on units of course). I want to be able to have a job mostly working on the weekends and maybe once during the school week while also having a day for myself to relax from work/school and staying fit (which i do now, i have fridays off for intramurals)&lt;/p&gt;\n\n&lt;p&gt;My parents are planning to give me the same deal they gave my older sister when she went to her Univ, $100 a month to help pay for food. I won&amp;#39;t be taking my car as that&amp;#39;ll increase my costs to at least $150 a month, $500 for a permit, so i&amp;#39;ll be buying a bike (any suggestions on bike locks?).&lt;/p&gt;\n\n&lt;p&gt;Finally, what jobs can i look for when at a UC? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm transferring to UCSB and move in either September or June/July if i take summer classes (most likely not). To pay rent at the Univ apartments, pay for food, and books (along with hopefully luxuries) i want to find a job, work 3 or 4 days a week like i do now, and take a full schedule (which is usually 3 classes i hear) in order to keep my Grant. A part time job (hopefully on campus) and a full unit schedule are non-negotiable for me, i need to be able to pay the bulk of my expenses without a lot of financial help from my parents.\n\nBut how many meeting per class are in a week? On a semester system at my CC it's usually 2 meetings, each 1.5 hrs, or 1 meeting at 3 hrs (depending on units of course). I want to be able to have a job mostly working on the weekends and maybe once during the school week while also having a day for myself to relax from work/school and staying fit (which i do now, i have fridays off for intramurals)\n\nMy parents are planning to give me the same deal they gave my older sister when she went to her Univ, $100 a month to help pay for food. I won't be taking my car as that'll increase my costs to at least $150 a month, $500 for a permit, so i'll be buying a bike (any suggestions on bike locks?).\n\nFinally, what jobs can i look for when at a UC? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65r6hl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "HalaMadrid97", "saved": false, "mod_reports": [], "name": "t3_65r6hl", "subreddit_name_prefixed": "r/college", "approved_by": null, "over_18": false, "domain": "self.college", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3z", "edited": 1492374565.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/college/comments/65r6hl/how_do_most_classes_on_a_quarter_system_look_like/", "num_reports": null, "locked": false, "stickied": false, "created": 1492402837.0, "url": "https://www.reddit.com/r/college/comments/65r6hl/how_do_most_classes_on_a_quarter_system_look_like/", "author_flair_text": null, "quarantine": false, "title": "How do most classes on a quarter system look like throughout the week?", "created_utc": 1492374037.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65r6hl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65r6hl", "likes": null, "replies": "", "user_reports": [], "id": "dgd8xn2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "the_myleg_fish", "parent_id": "t1_dgd8l65", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I would make a note to OP that though you're taking a full load, full time status is met at 12 units, and with each class being usually 4 units, that means OP can take 3 classes and that would be easier to deal with a part-time job compared to 19 units. :) Though an academic advisor still wouldn't hurt since this is their first time dealing with the quarter system. It goes by quick, as classes are only 10 weeks. Lol ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would make a note to OP that though you&amp;#39;re taking a full load, full time status is met at 12 units, and with each class being usually 4 units, that means OP can take 3 classes and that would be easier to deal with a part-time job compared to 19 units. :) Though an academic advisor still wouldn&amp;#39;t hurt since this is their first time dealing with the quarter system. It goes by quick, as classes are only 10 weeks. Lol &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgd8xn2", "score_hidden": false, "stickied": false, "created": 1492442799.0, "created_utc": 1492413999.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8l65", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "globalstudiesnooblet", "parent_id": "t3_65r6hl", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "My boyfriend currently goes to UCSB, and I'm at a quarter system CC, so I can tell you about our scheduling. My bf has class everyday. All of his courses meet for an 1hr - 1.5hrs, with labs being around 3 - 4 hours. He usually has around 3 classes/day. He currently is during a full load (19 units), and definitely does not have time for a job or too much of a social life. (This could also be because he's a STEM major, however).\n\nI'm also taking a full load (19 units). I have class M, W, and F. I have about 2 classes/day. All of my courses are 2 hours long. Until recently, I was also doing a part-time job, which was about 19 hours/week. I also didn't have much time for socializing. (I'm a non-STEM major btw).\n\nThe takeaway: If you decide to pursue a full schedule while doing a part-time job 3 - 4 days a week, prepare to be pretty stressed and not have time for much else. You also need to be very organized and on top of your work. If you slack off too much, it will come to bite you very very quickly. I honestly wouldn't recommend anyone do this unless there's some special reason they want to (i.e., I want to finish CC early and do a study abroad before I go to 4 year). Summer is especially tricky because everything is half as long, and I know the withdraw deadlines come up much faster.\n\nI would talk to an academic advisor about all of this as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My boyfriend currently goes to UCSB, and I&amp;#39;m at a quarter system CC, so I can tell you about our scheduling. My bf has class everyday. All of his courses meet for an 1hr - 1.5hrs, with labs being around 3 - 4 hours. He usually has around 3 classes/day. He currently is during a full load (19 units), and definitely does not have time for a job or too much of a social life. (This could also be because he&amp;#39;s a STEM major, however).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also taking a full load (19 units). I have class M, W, and F. I have about 2 classes/day. All of my courses are 2 hours long. Until recently, I was also doing a part-time job, which was about 19 hours/week. I also didn&amp;#39;t have much time for socializing. (I&amp;#39;m a non-STEM major btw).&lt;/p&gt;\n\n&lt;p&gt;The takeaway: If you decide to pursue a full schedule while doing a part-time job 3 - 4 days a week, prepare to be pretty stressed and not have time for much else. You also need to be very organized and on top of your work. If you slack off too much, it will come to bite you very very quickly. I honestly wouldn&amp;#39;t recommend anyone do this unless there&amp;#39;s some special reason they want to (i.e., I want to finish CC early and do a study abroad before I go to 4 year). Summer is especially tricky because everything is half as long, and I know the withdraw deadlines come up much faster.&lt;/p&gt;\n\n&lt;p&gt;I would talk to an academic advisor about all of this as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgd8l65", "score_hidden": false, "stickied": false, "created": 1492441873.0, "created_utc": 1492413073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65r6hl", "likes": null, "replies": "", "user_reports": [], "id": "dgeymt3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "boredpanda93", "parent_id": "t3_65r6hl", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I'm a transfer too but to UCSD. The quarter system is pretty brutal. I would advice you to really just take 12 units fall quarter and adjust to the schedule.\n\nYou will have class everyday. UCSD has things call discussions and I think most UC schools do. You attend a 50 minute lecture on MWF and an 80 minute lecture on TTh. You'll have sections or discussions that last 50 minutes. Labs can last from 1.5 hrs to 3 hours. Depending on your class, you would definitely need to allocate at least 2-4 hours of study time a day. Sections/discussion are really annoying because sometimes you can't switch out to go to a different section for the same class. \n\nYou have week 0 fall quarter and then week 1 to week 3 to get your life together. Week 4 and 5 are midterms and you get week 6 to breathe then week 7 and 8 are the second round of midterms. Week 9 and week 10 are basically the last two weeks of instructions and then finals week. Sometimes you might have a midterm every week. That happened to me from week 3 to week 8. Winter and Spring quarter doesn't have week 0. You enter the quarter and you hit the ground running. Also, not all classes follow the nice format of CC where you literally only spend 8 hours max. I had an upper division course that took up at least an extra 4 hours everyday, reading academic journals and writing summaries plus attending extra credit seminars. \n\nI worked one part-time job and focused on my studies at UCSD because once you fall off, it's hard to catch up. I had friends who has to quit their jobs to stay afloat. I also has friends who had a job, volunteered at a hospital, was an undergraduate researcher and was president of 3 orgs while maintaining a 3.5 GPA. \n\nAll in all, it's dependent on your time management skills and organizational skills. Good luck and I hope UCSB isn't as horrible as UCSD. \n\n", "edited": 1492513778.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a transfer too but to UCSD. The quarter system is pretty brutal. I would advice you to really just take 12 units fall quarter and adjust to the schedule.&lt;/p&gt;\n\n&lt;p&gt;You will have class everyday. UCSD has things call discussions and I think most UC schools do. You attend a 50 minute lecture on MWF and an 80 minute lecture on TTh. You&amp;#39;ll have sections or discussions that last 50 minutes. Labs can last from 1.5 hrs to 3 hours. Depending on your class, you would definitely need to allocate at least 2-4 hours of study time a day. Sections/discussion are really annoying because sometimes you can&amp;#39;t switch out to go to a different section for the same class. &lt;/p&gt;\n\n&lt;p&gt;You have week 0 fall quarter and then week 1 to week 3 to get your life together. Week 4 and 5 are midterms and you get week 6 to breathe then week 7 and 8 are the second round of midterms. Week 9 and week 10 are basically the last two weeks of instructions and then finals week. Sometimes you might have a midterm every week. That happened to me from week 3 to week 8. Winter and Spring quarter doesn&amp;#39;t have week 0. You enter the quarter and you hit the ground running. Also, not all classes follow the nice format of CC where you literally only spend 8 hours max. I had an upper division course that took up at least an extra 4 hours everyday, reading academic journals and writing summaries plus attending extra credit seminars. &lt;/p&gt;\n\n&lt;p&gt;I worked one part-time job and focused on my studies at UCSD because once you fall off, it&amp;#39;s hard to catch up. I had friends who has to quit their jobs to stay afloat. I also has friends who had a job, volunteered at a hospital, was an undergraduate researcher and was president of 3 orgs while maintaining a 3.5 GPA. &lt;/p&gt;\n\n&lt;p&gt;All in all, it&amp;#39;s dependent on your time management skills and organizational skills. Good luck and I hope UCSB isn&amp;#39;t as horrible as UCSD. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgeymt3", "score_hidden": false, "stickied": false, "created": 1492542106.0, "created_utc": 1492513306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]