[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "college", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys, right now I&amp;#39;m thinking that I will be joining Franklin &amp;amp; Marshall College&amp;#39;s class of 2021! According to US News and Princeton Review and the like, some other schools I got into, for example, Brandeis, Lafayette, and Northeastern, are more presitigous, but I&amp;#39;ve gotten to the point where I can say fuck rankings. I&amp;#39;m very lucky that cost isn&amp;#39;t an issue, and my major is undecided, but I&amp;#39;d likely study Politics or Business. None of that is holding me back from F&amp;amp;M. But this is. &lt;/p&gt;\n\n&lt;p&gt;God, I feel so shitty for saying this, but it&amp;#39;s my best friend, aka my twin sister. She got into F&amp;amp;M too, and I know it&amp;#39;s been one of her tops for awhile. Coming from a small town and a small school, we did most of the same activities and thus have most of the same friends. In college, there&amp;#39;s no doubt that we&amp;#39;d be studying completely different things, and we&amp;#39;ve already talked about the fact that we&amp;#39;d NEVER room together after 17 years of sharing a room. We would even request to live in different dorms. I&amp;#39;m more outgoing with strangers, and she&amp;#39;s more outgoing with people she knows, so I&amp;#39;m afraid that she&amp;#39;d rely on me to make friends freshman year. I don&amp;#39;t want to be thought of as a package anymore. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m prone to major anxiety, so while having her at school to continue supporting me would be a huge plus, this decision is causing me some major anxiety itself. So do I attend Brandeis or NEU because she didn&amp;#39;t get in? Do I commit to F&amp;amp;M, or wait for her to make her decision first? &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re fraternal but both girls, and I&amp;#39;m fucking sick and tired of being twin lumped - being considered half of one person rather than an individual. People this weird fascination with twins, like we have superpowers or something.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m afraid that going to F&amp;amp;M together would be doing exactly what everyone expects us to do. Yet, I think that I need to make this decision based not off of her, but based off of me which school is the best fit. Is that so wrong? &lt;/p&gt;\n\n&lt;p&gt;My parents are pretty much the only people that think we should go to school together. Everyone knows how frustrated we are by the twin lumping, and my friends have a point by saying that going to different schools would completely avoid that issue continuing in college. My parents say that we just would need to actively work to have &amp;quot;separate experiences together&amp;quot;, but I fear the judgement from everyone else around me. &lt;/p&gt;\n\n&lt;p&gt;Any twins in the same boat? Can anyone give me some advice here, or tips for going to school with a sibling? I&amp;#39;m so anxious about all of this. Thank you. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys, right now I'm thinking that I will be joining Franklin &amp; Marshall College's class of 2021! According to US News and Princeton Review and the like, some other schools I got into, for example, Brandeis, Lafayette, and Northeastern, are more presitigous, but I've gotten to the point where I can say fuck rankings. I'm very lucky that cost isn't an issue, and my major is undecided, but I'd likely study Politics or Business. None of that is holding me back from F&amp;M. But this is. \n\nGod, I feel so shitty for saying this, but it's my best friend, aka my twin sister. She got into F&amp;M too, and I know it's been one of her tops for awhile. Coming from a small town and a small school, we did most of the same activities and thus have most of the same friends. In college, there's no doubt that we'd be studying completely different things, and we've already talked about the fact that we'd NEVER room together after 17 years of sharing a room. We would even request to live in different dorms. I'm more outgoing with strangers, and she's more outgoing with people she knows, so I'm afraid that she'd rely on me to make friends freshman year. I don't want to be thought of as a package anymore. \n\nI'm prone to major anxiety, so while having her at school to continue supporting me would be a huge plus, this decision is causing me some major anxiety itself. So do I attend Brandeis or NEU because she didn't get in? Do I commit to F&amp;M, or wait for her to make her decision first? \n\nWe're fraternal but both girls, and I'm fucking sick and tired of being twin lumped - being considered half of one person rather than an individual. People this weird fascination with twins, like we have superpowers or something.\n\nI'm afraid that going to F&amp;M together would be doing exactly what everyone expects us to do. Yet, I think that I need to make this decision based not off of her, but based off of me which school is the best fit. Is that so wrong? \n\nMy parents are pretty much the only people that think we should go to school together. Everyone knows how frustrated we are by the twin lumping, and my friends have a point by saying that going to different schools would completely avoid that issue continuing in college. My parents say that we just would need to actively work to have \"separate experiences together\", but I fear the judgement from everyone else around me. \n\nAny twins in the same boat? Can anyone give me some advice here, or tips for going to school with a sibling? I'm so anxious about all of this. Thank you. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65u77j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 34, "report_reasons": null, "author": "elenarobo", "saved": false, "mod_reports": [], "name": "t3_65u77j", "subreddit_name_prefixed": "r/college", "approved_by": null, "over_18": false, "domain": "self.college", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3z", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/college/comments/65u77j/going_to_college_with_my_twin/", "num_reports": null, "locked": false, "stickied": false, "created": 1492443013.0, "url": "https://www.reddit.com/r/college/comments/65u77j/going_to_college_with_my_twin/", "author_flair_text": null, "quarantine": false, "title": "Going to college with my twin?", "created_utc": 1492414213.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 34}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdacvm", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "Amierra", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Talk to her and see what she thinks. It's likely she has similar concerns.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to her and see what she thinks. It&amp;#39;s likely she has similar concerns.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdacvm", "score_hidden": false, "stickied": false, "created": 1492447323.0, "created_utc": 1492418523.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgd9sro", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "davidwave4", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "My twin sister and I go to the same school, and barely see each other. It's nice having someone to go to, but honestly y'all will probably find your own friends and clubs and such. I'd say just go to the same school and have fun. There's really no downside, unless you really wanted to go to one of your other choices. Really just pick the school for you, and whatever follows follows. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My twin sister and I go to the same school, and barely see each other. It&amp;#39;s nice having someone to go to, but honestly y&amp;#39;all will probably find your own friends and clubs and such. I&amp;#39;d say just go to the same school and have fun. There&amp;#39;s really no downside, unless you really wanted to go to one of your other choices. Really just pick the school for you, and whatever follows follows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgd9sro", "score_hidden": false, "stickied": false, "created": 1492445441.0, "created_utc": 1492416641.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgddlgo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MarinatedBulldog", "parent_id": "t1_dgddktd", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "No but really do what you want to do. College = the beginning of being an adult, and that means making some hard decisions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No but really do what you want to do. College = the beginning of being an adult, and that means making some hard decisions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgddlgo", "score_hidden": false, "stickied": false, "created": 1492457628.0, "created_utc": 1492428828.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddktd", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "MarinatedBulldog", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "If you have lumps, you should see a doctor", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you have lumps, you should see a doctor&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgddktd", "score_hidden": false, "stickied": false, "created": 1492457583.0, "created_utc": 1492428783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgden80", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ecklesweb", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "No advice on the twin thing, but congrats on F&amp;M - I worked there for a couple of years and it's a legit place. \n\nAnd double congrats on getting to the \"fuck rankings\" stage. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No advice on the twin thing, but congrats on F&amp;amp;M - I worked there for a couple of years and it&amp;#39;s a legit place. &lt;/p&gt;\n\n&lt;p&gt;And double congrats on getting to the &amp;quot;fuck rankings&amp;quot; stage. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgden80", "score_hidden": false, "stickied": false, "created": 1492460082.0, "created_utc": 1492431282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdiqo8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "NoSpice4Me", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I would say talk to your twin, but my gut vibe from reading this tells me that you should consider another school. School fit matters, as does being able to carve out an individual identity for yourself.\n\nI go to a college roughly the size of F&amp;M, a little bit smaller, and I know a few sets of twins. One set in particular does literally NOTHING apart. Same major/minor combination, same schedules, same jobs, same extracurriculars, they live together (they started off in adjacent rooms, then gave up the ruse), and this year they're both abroad for a year...in the SAME PROGRAM. I've had classes with them and they never talk, and you could easily mistake them for the other/them having one personality. It's horrifying.\n\nOf course, the fact that everyone at my college knows twins as a \"set\" can tell you a little bit about how people see it. Yes, people are weirdly fascinated by twins, no matter how fraternal or separate they are.\n\nI also think that going to a different college will make both of your lives more interesting. You'll get to have different experiences and share that with one another, which is really special. Distance may do a lot of good things for your relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say talk to your twin, but my gut vibe from reading this tells me that you should consider another school. School fit matters, as does being able to carve out an individual identity for yourself.&lt;/p&gt;\n\n&lt;p&gt;I go to a college roughly the size of F&amp;amp;M, a little bit smaller, and I know a few sets of twins. One set in particular does literally NOTHING apart. Same major/minor combination, same schedules, same jobs, same extracurriculars, they live together (they started off in adjacent rooms, then gave up the ruse), and this year they&amp;#39;re both abroad for a year...in the SAME PROGRAM. I&amp;#39;ve had classes with them and they never talk, and you could easily mistake them for the other/them having one personality. It&amp;#39;s horrifying.&lt;/p&gt;\n\n&lt;p&gt;Of course, the fact that everyone at my college knows twins as a &amp;quot;set&amp;quot; can tell you a little bit about how people see it. Yes, people are weirdly fascinated by twins, no matter how fraternal or separate they are.&lt;/p&gt;\n\n&lt;p&gt;I also think that going to a different college will make both of your lives more interesting. You&amp;#39;ll get to have different experiences and share that with one another, which is really special. Distance may do a lot of good things for your relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdiqo8", "score_hidden": false, "stickied": false, "created": 1492467025.0, "created_utc": 1492438225.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdipt6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TwinTimeKey", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Both my twin sister and I were accepted to Spelman college and already committed. I've had a lot of similar concerns actually. I would say attend the same school if that's the school you really want. At first i thought of going to a separate solely for some independence but in the end decided I'd go to the same school and when it come down to it I'll differentiate myself as soon as we get there. People do see twins as a package deal and expect you to do the same things but fuck them. You can go to the same school and still be independent. Besides college is such a huge transition that I'm sure you'll come to appreciate having a familiar face. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Both my twin sister and I were accepted to Spelman college and already committed. I&amp;#39;ve had a lot of similar concerns actually. I would say attend the same school if that&amp;#39;s the school you really want. At first i thought of going to a separate solely for some independence but in the end decided I&amp;#39;d go to the same school and when it come down to it I&amp;#39;ll differentiate myself as soon as we get there. People do see twins as a package deal and expect you to do the same things but fuck them. You can go to the same school and still be independent. Besides college is such a huge transition that I&amp;#39;m sure you&amp;#39;ll come to appreciate having a familiar face. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdipt6", "score_hidden": false, "stickied": false, "created": 1492466993.0, "created_utc": 1492438193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdmgne", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "trancez", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I am a twin, when I was in college - after a year being away from my brother in college I missed him and he felt the same way.\n\nWhile the quirks of being a twin are annoying, it's nice to not be alone, especially if you're in a competitive or independent environment like college where it can feel like a free-for-all (if you don't develop support groups or make a close knit group of friends).\n\nI luckily had very close friends and ended up dating someone (who I am still with) throughout that experience, which made it a lot easier - he did not fair the same way. He loved socializing and meeting new people, kept bouncing to new friends and social groups but eventually ended up settling with his hometown friends after college was over (hint, sometimes long term friendships can triumph over fleeting college ones).\n\nYou can choose your path, but at the same time If one of you are not having a good time at your future college - you might be 'reflecting on who's having the better time' and someone might be feeling grass was greener. It happens, however, if you feel that you want to be away from your twin and be independent - go for it.\n\nHowever, I felt that having double the social network in high school and post-college was far greater than what I experienced in college - this was because you're in a large social setting and having a twin is just like having a second best friend, which makes you standout in a way larger crowd than high school was.", "edited": 1492443163.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a twin, when I was in college - after a year being away from my brother in college I missed him and he felt the same way.&lt;/p&gt;\n\n&lt;p&gt;While the quirks of being a twin are annoying, it&amp;#39;s nice to not be alone, especially if you&amp;#39;re in a competitive or independent environment like college where it can feel like a free-for-all (if you don&amp;#39;t develop support groups or make a close knit group of friends).&lt;/p&gt;\n\n&lt;p&gt;I luckily had very close friends and ended up dating someone (who I am still with) throughout that experience, which made it a lot easier - he did not fair the same way. He loved socializing and meeting new people, kept bouncing to new friends and social groups but eventually ended up settling with his hometown friends after college was over (hint, sometimes long term friendships can triumph over fleeting college ones).&lt;/p&gt;\n\n&lt;p&gt;You can choose your path, but at the same time If one of you are not having a good time at your future college - you might be &amp;#39;reflecting on who&amp;#39;s having the better time&amp;#39; and someone might be feeling grass was greener. It happens, however, if you feel that you want to be away from your twin and be independent - go for it.&lt;/p&gt;\n\n&lt;p&gt;However, I felt that having double the social network in high school and post-college was far greater than what I experienced in college - this was because you&amp;#39;re in a large social setting and having a twin is just like having a second best friend, which makes you standout in a way larger crowd than high school was.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdmgne", "score_hidden": false, "stickied": false, "created": 1492471776.0, "created_utc": 1492442976.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdofiw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tombokai", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I'd suggest to ignore what your twin may do and pick the school that fits best with you. If you have questions about NEU let me know, I'm a third year there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d suggest to ignore what your twin may do and pick the school that fits best with you. If you have questions about NEU let me know, I&amp;#39;m a third year there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdofiw", "score_hidden": false, "stickied": false, "created": 1492474037.0, "created_utc": 1492445237.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdc84j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "teresajs", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "It sounds like you need the distance.  It might be better to choose a different school since you have some great options.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you need the distance.  It might be better to choose a different school since you have some great options.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdc84j", "score_hidden": false, "stickied": false, "created": 1492453709.0, "created_utc": 1492424909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdj116", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Happy_SAP", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "My sisters went through the same thing. One decided to defer for a year and that allowed them to develop different friend groups. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sisters went through the same thing. One decided to defer for a year and that allowed them to develop different friend groups. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdj116", "score_hidden": false, "stickied": false, "created": 1492467417.0, "created_utc": 1492438617.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdle53", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gillprod123", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Wow I can relate perfectly lol, I also had to make the decision of going to a different school from my fraternal twin last year haha.\n\nSo for me, as much I love my bro, I used to always think in high school that it would be cool going to a different university from him to sort of be more independent. But honestly, now I've realized how much I miss him and I really wish that we would have gone to the same school. Maybe don't room with her but go to the same school for sure, you did say she was your best friend after all.\n\n\nAlso, I know what you mean by the twin lumping thing but this year I've realized that it was like 10x easier to make friends that way lol, it's sort of hard by myself but with a twin people always approach you first. It's also always good to have your twin for emotional support when you need them. This is just my two cents, hope I helped.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow I can relate perfectly lol, I also had to make the decision of going to a different school from my fraternal twin last year haha.&lt;/p&gt;\n\n&lt;p&gt;So for me, as much I love my bro, I used to always think in high school that it would be cool going to a different university from him to sort of be more independent. But honestly, now I&amp;#39;ve realized how much I miss him and I really wish that we would have gone to the same school. Maybe don&amp;#39;t room with her but go to the same school for sure, you did say she was your best friend after all.&lt;/p&gt;\n\n&lt;p&gt;Also, I know what you mean by the twin lumping thing but this year I&amp;#39;ve realized that it was like 10x easier to make friends that way lol, it&amp;#39;s sort of hard by myself but with a twin people always approach you first. It&amp;#39;s also always good to have your twin for emotional support when you need them. This is just my two cents, hope I helped.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdle53", "score_hidden": false, "stickied": false, "created": 1492470498.0, "created_utc": 1492441698.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdo3qk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "napoleonicbonerparty", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "My twin and I go to the same school as well. She was definitely very against going to school with me for the same reason you are but as it turns out, it's pretty easy to be your own person in college. My sister and I have completely different friend groups, live far from each other and only see each other about once a week. Some of my friends didn't even know I had a twin. Its definitely possible to brach out from being lumped with your twin as long as you make the effort to actually live separate lives.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My twin and I go to the same school as well. She was definitely very against going to school with me for the same reason you are but as it turns out, it&amp;#39;s pretty easy to be your own person in college. My sister and I have completely different friend groups, live far from each other and only see each other about once a week. Some of my friends didn&amp;#39;t even know I had a twin. Its definitely possible to brach out from being lumped with your twin as long as you make the effort to actually live separate lives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdo3qk", "score_hidden": false, "stickied": false, "created": 1492473662.0, "created_utc": 1492444862.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgdwdv6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sugarpeas", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "At 15,000 students at that University I think being twin lumped won't be as much of an issue if you both carve your own path. I would go where you want to go academically - and live separately and only mingle on occasion. I'm not a twin myself but my brother and I attended the same University - he's two years younger though so the experience is entirely different. Anyways, we lived separate, I introduced him to *some* of my friends and we had other friends that were separate. \n\nIn general majors end up having more separated experiences - you'll form study groups, join different clubs, and make different friends. I knew a girl in my undergrad that actually had an identical twin sister attending at the same time at the same Uni - *never knew!* the university was huge and they were in different majors. Their schedules didn't align really so they were always considered separate people with some occasional odd meetings when someone thought they were their sibling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At 15,000 students at that University I think being twin lumped won&amp;#39;t be as much of an issue if you both carve your own path. I would go where you want to go academically - and live separately and only mingle on occasion. I&amp;#39;m not a twin myself but my brother and I attended the same University - he&amp;#39;s two years younger though so the experience is entirely different. Anyways, we lived separate, I introduced him to &lt;em&gt;some&lt;/em&gt; of my friends and we had other friends that were separate. &lt;/p&gt;\n\n&lt;p&gt;In general majors end up having more separated experiences - you&amp;#39;ll form study groups, join different clubs, and make different friends. I knew a girl in my undergrad that actually had an identical twin sister attending at the same time at the same Uni - &lt;em&gt;never knew!&lt;/em&gt; the university was huge and they were in different majors. Their schedules didn&amp;#39;t align really so they were always considered separate people with some occasional odd meetings when someone thought they were their sibling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdwdv6", "score_hidden": false, "stickied": false, "created": 1492482881.0, "created_utc": 1492454081.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dge2p05", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dishonoreduser", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "/u/elenarobo you absolutely should to go to the same college with your sister. \n\n1) she will always be someone you can talk to \n\n2) if you need anything, she'll be close by\n\n3) free place to crash if your own roommate is being annoying\n\n4) you can make extra connections through your sister", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/elenarobo\"&gt;/u/elenarobo&lt;/a&gt; you absolutely should to go to the same college with your sister. &lt;/p&gt;\n\n&lt;p&gt;1) she will always be someone you can talk to &lt;/p&gt;\n\n&lt;p&gt;2) if you need anything, she&amp;#39;ll be close by&lt;/p&gt;\n\n&lt;p&gt;3) free place to crash if your own roommate is being annoying&lt;/p&gt;\n\n&lt;p&gt;4) you can make extra connections through your sister&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dge2p05", "score_hidden": false, "stickied": false, "created": 1492489995.0, "created_utc": 1492461195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgebgxx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reofsxnshine", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I promise, people don't give as much of a fuck as you think they do. Sure, you'll be seen as a \"set\", that's a given. But you're going to be able to be independent if that's what you want. I know a set of twins that barely talk to anyone but themselves, have all the same classes, and (get this) wear the SAME DAMN OUTFIT. So of course people look at them like drones. They skulk around like the twins from The Shining. But if you have different personalities, and you're truly your own people, no one of intelligence is going to treat you like you're half a person when you go to college.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I promise, people don&amp;#39;t give as much of a fuck as you think they do. Sure, you&amp;#39;ll be seen as a &amp;quot;set&amp;quot;, that&amp;#39;s a given. But you&amp;#39;re going to be able to be independent if that&amp;#39;s what you want. I know a set of twins that barely talk to anyone but themselves, have all the same classes, and (get this) wear the SAME DAMN OUTFIT. So of course people look at them like drones. They skulk around like the twins from The Shining. But if you have different personalities, and you&amp;#39;re truly your own people, no one of intelligence is going to treat you like you&amp;#39;re half a person when you go to college.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgebgxx", "score_hidden": false, "stickied": false, "created": 1492500880.0, "created_utc": 1492472080.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgehjwl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Honeycombs98", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "College is so big that if you don't want to see her, you won't have to. Saying to her that you wanna hatch away a bit is probably needed, but if you love H&amp;M go there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;College is so big that if you don&amp;#39;t want to see her, you won&amp;#39;t have to. Saying to her that you wanna hatch away a bit is probably needed, but if you love H&amp;amp;M go there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgehjwl", "score_hidden": false, "stickied": false, "created": 1492508516.0, "created_utc": 1492479716.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65u77j", "likes": null, "replies": "", "user_reports": [], "id": "dgekbox", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Blucove", "parent_id": "t3_65u77j", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I know two friends that are twins and they do everything together. Joined the same frat, have the same friends, LIVE TOGETHER in the same room. They always say they're trying to have independent identities but it doesn't really seem that way.\n\nFrom what I can tell, rooming together has caused some problems for them so I wouldn't recommend that, but keep in mind that some random roommate assignments can be much worse than rooming with someone you've roomed with for 17 years. \n\nHowever, it might be nice to have someone to talk to and hang out with freshman year, at least until you each find the things you like to do (club-wise). Don't completely shut eachother out, but also spend some time to find the things you each like to do apart from each other. Having a twin in college is hard when you're trying to make friends, but it's also not the worst thing in the world when making friends and finding things to do is difficult. :)\n\nBest of luck, and congrats on your acceptance!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know two friends that are twins and they do everything together. Joined the same frat, have the same friends, LIVE TOGETHER in the same room. They always say they&amp;#39;re trying to have independent identities but it doesn&amp;#39;t really seem that way.&lt;/p&gt;\n\n&lt;p&gt;From what I can tell, rooming together has caused some problems for them so I wouldn&amp;#39;t recommend that, but keep in mind that some random roommate assignments can be much worse than rooming with someone you&amp;#39;ve roomed with for 17 years. &lt;/p&gt;\n\n&lt;p&gt;However, it might be nice to have someone to talk to and hang out with freshman year, at least until you each find the things you like to do (club-wise). Don&amp;#39;t completely shut eachother out, but also spend some time to find the things you each like to do apart from each other. Having a twin in college is hard when you&amp;#39;re trying to make friends, but it&amp;#39;s also not the worst thing in the world when making friends and finding things to do is difficult. :)&lt;/p&gt;\n\n&lt;p&gt;Best of luck, and congrats on your acceptance!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgekbox", "score_hidden": false, "stickied": false, "created": 1492511791.0, "created_utc": 1492482991.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]