[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "college", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, I&amp;#39;m currently a high school senior who is about to head into college and am probably going to be a philosophy major(I can already hear the gasps... I want to go into law). I want to know what a typical philosophy class from the lower as well as higher tier courses are like. What should I expect? How will I likely be graded?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello, I'm currently a high school senior who is about to head into college and am probably going to be a philosophy major(I can already hear the gasps... I want to go into law). I want to know what a typical philosophy class from the lower as well as higher tier courses are like. What should I expect? How will I likely be graded?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wqwb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "Solsticeoftherevered", "saved": false, "mod_reports": [], "name": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "approved_by": null, "over_18": false, "domain": "self.college", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3z", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/college/comments/65wqwb/what_is_a_college_philosophy_class_like_day_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492476701.0, "url": "https://www.reddit.com/r/college/comments/65wqwb/what_is_a_college_philosophy_class_like_day_to/", "author_flair_text": null, "quarantine": false, "title": "What is a college philosophy class like day to day? What is the coursework like? The HW and tests?", "created_utc": 1492447901.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgdrltf", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Tnrftw", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I took a philosophy class that could be taken in place for a math course (for certain majors) at my university. As expected, it was a hard course but not unmanageable. There were about 250 people in the class, quite small for a school of over 30k. We had 3 exams and weekly homework which was done on an online textbook platform. The professor was a TA. Lots of reading, the lectures were sort of interesting, but that's relative. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took a philosophy class that could be taken in place for a math course (for certain majors) at my university. As expected, it was a hard course but not unmanageable. There were about 250 people in the class, quite small for a school of over 30k. We had 3 exams and weekly homework which was done on an online textbook platform. The professor was a TA. Lots of reading, the lectures were sort of interesting, but that&amp;#39;s relative. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdrltf", "score_hidden": false, "stickied": false, "created": 1492477576.0, "created_utc": 1492448776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgdscsz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MRo9600", "parent_id": "t1_dgdsc1p", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "That's good then.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s good then.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdscsz", "score_hidden": false, "stickied": false, "created": 1492478410.0, "created_utc": 1492449610.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgefepj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ReadySetGonads", "parent_id": "t1_dgdsc1p", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Awesome dude, but just know that I had a coworker at a pizza place that majored in philosophy and ended up working as a delivery driver along side me lol. You can always study English, which imo is the better and more creatively balanced option.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome dude, but just know that I had a coworker at a pizza place that majored in philosophy and ended up working as a delivery driver along side me lol. You can always study English, which imo is the better and more creatively balanced option.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgefepj", "score_hidden": false, "stickied": false, "created": 1492505848.0, "created_utc": 1492477048.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsc1p", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Solsticeoftherevered", "parent_id": "t1_dgdrjom", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I'm pretty sure I'll enjoy it. I read philosophy in my non-gaming free time so I think I might generally enjoy the substance of the classes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure I&amp;#39;ll enjoy it. I read philosophy in my non-gaming free time so I think I might generally enjoy the substance of the classes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdsc1p", "score_hidden": false, "stickied": false, "created": 1492478386.0, "created_utc": 1492449586.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrjom", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MRo9600", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Just making sure you know that if you don't enjoy philosophy, you don't have to major in it to get into law school.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just making sure you know that if you don&amp;#39;t enjoy philosophy, you don&amp;#39;t have to major in it to get into law school.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdrjom", "score_hidden": false, "stickied": false, "created": 1492477507.0, "created_utc": 1492448707.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dge3ap6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "seb_fisher", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I took intro to philosophy at community college, one of my favorite courses so far. Explained historical philosophy concepts, terminology, and philosophers... lots of discussion and essay questions. All the exams were essays. Overall pretty cool subject I wouldn't mind majoring in. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took intro to philosophy at community college, one of my favorite courses so far. Explained historical philosophy concepts, terminology, and philosophers... lots of discussion and essay questions. All the exams were essays. Overall pretty cool subject I wouldn&amp;#39;t mind majoring in. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dge3ap6", "score_hidden": false, "stickied": false, "created": 1492490673.0, "created_utc": 1492461873.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgfc918", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cullf", "parent_id": "t1_dgey73m", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "My advice on Wittgenstein is to start on his early philosophy. Reading the PI, which is a direct response to his earlier work, by itself is just going to leave you utterly confused. I went to a talk my first year where the professor spent two hours on a page on of the PI and it made absolutely zero sense. \n\nQuestions of race, gender, or sexuality come up in the philosophical sense when you do the philosophy of race, gender, or sexuality. How prevalent are these subfields for undergrads? Pretty rare if ever in my very limited experience. I've been exposed to the philosophy of race as a topic in a phil bio class. I haven't encounter the philosophy of gender or sexuality in any real depth besides maybe a Platonic dialogue of love. \n\nWith that being said, I do know that my school does offer an undergrad course on feminist philosophy, so opportunities do exist. It's just not going to as available to you as, say, philosophy of mind in the normal Anglo-American philosophy department.\n\nPhilosophy departments though, in the last ten years or so, have pretty much universally looked quite hard at the diversity of their departments, in terms of race and gender. In that sense, the people around you will probably discuss the issues of race, gender, and sexuality. \n\nEDIT: If the philosophy of race, gender, or sexuality interest you, definitely still read about them. An undergrad education in philosophy is meant to get you acquainted with the core topics and fields in contemporary, analytic philosophy. Unfortunately for you, philosophical questions of race, gender, and sexuality, I think, are considered non-\"mainstream\" questions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My advice on Wittgenstein is to start on his early philosophy. Reading the PI, which is a direct response to his earlier work, by itself is just going to leave you utterly confused. I went to a talk my first year where the professor spent two hours on a page on of the PI and it made absolutely zero sense. &lt;/p&gt;\n\n&lt;p&gt;Questions of race, gender, or sexuality come up in the philosophical sense when you do the philosophy of race, gender, or sexuality. How prevalent are these subfields for undergrads? Pretty rare if ever in my very limited experience. I&amp;#39;ve been exposed to the philosophy of race as a topic in a phil bio class. I haven&amp;#39;t encounter the philosophy of gender or sexuality in any real depth besides maybe a Platonic dialogue of love. &lt;/p&gt;\n\n&lt;p&gt;With that being said, I do know that my school does offer an undergrad course on feminist philosophy, so opportunities do exist. It&amp;#39;s just not going to as available to you as, say, philosophy of mind in the normal Anglo-American philosophy department.&lt;/p&gt;\n\n&lt;p&gt;Philosophy departments though, in the last ten years or so, have pretty much universally looked quite hard at the diversity of their departments, in terms of race and gender. In that sense, the people around you will probably discuss the issues of race, gender, and sexuality. &lt;/p&gt;\n\n&lt;p&gt;EDIT: If the philosophy of race, gender, or sexuality interest you, definitely still read about them. An undergrad education in philosophy is meant to get you acquainted with the core topics and fields in contemporary, analytic philosophy. Unfortunately for you, philosophical questions of race, gender, and sexuality, I think, are considered non-&amp;quot;mainstream&amp;quot; questions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgfc918", "score_hidden": false, "stickied": false, "created": 1492561064.0, "created_utc": 1492532264.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgey73m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Solsticeoftherevered", "parent_id": "t1_dger3ty", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Well, you're a reservoir of knowledge. Thank you for that. After looking at my college's website they specifically recommend double majoring for philosophy majors so I definitely will do that.\n\nAlso, the authors you mentioned actually are exactly some of the authors along with certain more contemporary ones(Zizek, Baudrillard even though he's dead, Agamben, etc) that got me interested in philosophy. Them not being present is a bit of a bummer for me. However I've somewhat recently been, as a result of The Partially Examined life podcast, trying to read Wittgenstein, and while I doubt I'm really getting the core of what he is trying to say I still very much enjoy the process of trying to get it. The Socratics do bore me though I will be honest.\n\nHow often would you say, if at all, do questions of race, gender, and sexuality come up in academic philosophy(for undergrad)? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, you&amp;#39;re a reservoir of knowledge. Thank you for that. After looking at my college&amp;#39;s website they specifically recommend double majoring for philosophy majors so I definitely will do that.&lt;/p&gt;\n\n&lt;p&gt;Also, the authors you mentioned actually are exactly some of the authors along with certain more contemporary ones(Zizek, Baudrillard even though he&amp;#39;s dead, Agamben, etc) that got me interested in philosophy. Them not being present is a bit of a bummer for me. However I&amp;#39;ve somewhat recently been, as a result of The Partially Examined life podcast, trying to read Wittgenstein, and while I doubt I&amp;#39;m really getting the core of what he is trying to say I still very much enjoy the process of trying to get it. The Socratics do bore me though I will be honest.&lt;/p&gt;\n\n&lt;p&gt;How often would you say, if at all, do questions of race, gender, and sexuality come up in academic philosophy(for undergrad)? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgey73m", "score_hidden": false, "stickied": false, "created": 1492541019.0, "created_utc": 1492512219.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dger3ty", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cullf", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I'm a philosophy/mathematics major about to finish their second year. I've taken courses at the 2000, 3000, and 5000 level at my university in philosophy. The numbering is relatively idiosyncratic, but I've taken courses at the intro level, the immediate/typical major level, and the advanced undergrad/intro grad level. Here comes a lot of unsolicited advice! \n\nMost philosophy classes for majors (so not your intro 1000-level classes) are going to be composed of 2-3 papers with something like 10% attendance/participation. Practically every philosophy department in the Anglo-American world will require a \"baby logic\" class. Expect a normal exercise set/midterm/final setup for this class. I've taken some more logic classes, with a similar grading scheme. \n\nWriting philosophy papers is hard. In my mind, it definitely requires practice and instruction for most people. This is a great guide by a philosophy professor to writing a philosophy paper: http://www.jimpryor.net/teaching/guidelines/writing.html\n\nGrading is going to be about how well you can track the arguments in your paper. Most undergraduate papers typically track the argumentative moves of a debate covered in lectures, explaining the nuances and complexities as charitably as possible. At the end,  you are expected to produce something original. This new contribution can come in the form of a novel refutation or a novel extension of an idea or something else. Usually this part is graded quite leniently. I've gotten As on papers in 3000-level classes with a terrible original refutation, but a decent exposition of the central issue.\n\nLower tier versus higher tier is really not going to change much in terms of what you read but YMMV on this one. It's mostly about how much the professor can expect out of the students. This will affect grading. Remember that there are graduate seminars and intro undergrad classes reading Plato's Republic. \n\nNote: Academic philosophy, at least in the Anglo-American world, is usually in the analytic tradition. With that in mind, the philosophers and philosophy you enjoy reading now might not ever appear in any of your undergraduate courses. In a typical analytic philosophy department, I doubt that you will get the chance to take classes where you read Heidegger, Husserl, Hegel, Camus, Sartre, Nietzsche (perhaps in a history of phil class?), or Foucault. I don't know what you're reading now that makes you excited about philosophy, but if it's these authors that pique your interest, I would recommend an English or Comparative Studies major. Comparative Studies especially if your interest is in non-Western philosophy, because that's where your non-Western philosophy experts are going to be.\n\nAlso, I would definitely double major. It's super easy to do so at most places and it will only help you philosophically. I have friends double majoring in chemistry, neuroscience, political science, economics, psychology, physics, and biology, over the top of my head. Definitely do it both for your philosophical growth and for being more employable. For law school, probably political science is the best \"fit\" for that, but literally anything works. Just explore what you're interested in philosophically and find a double major that matches with that!\n\nedit: HW is reading philosophy, usually papers or excerpts from primary sources. Reading philosophical texts takes time. Don't blow it off if you want your money's worth from the class. It is very easy to get left behind if you don't read, especially in a class where you might be reading authors that directly respond to one another. Doing the readings easily shows by your ability to engage/participate in the lecture and in your essays.\n\nedit: also /r/askphilosophy is a great place to ask questions!", "edited": 1492493396.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a philosophy/mathematics major about to finish their second year. I&amp;#39;ve taken courses at the 2000, 3000, and 5000 level at my university in philosophy. The numbering is relatively idiosyncratic, but I&amp;#39;ve taken courses at the intro level, the immediate/typical major level, and the advanced undergrad/intro grad level. Here comes a lot of unsolicited advice! &lt;/p&gt;\n\n&lt;p&gt;Most philosophy classes for majors (so not your intro 1000-level classes) are going to be composed of 2-3 papers with something like 10% attendance/participation. Practically every philosophy department in the Anglo-American world will require a &amp;quot;baby logic&amp;quot; class. Expect a normal exercise set/midterm/final setup for this class. I&amp;#39;ve taken some more logic classes, with a similar grading scheme. &lt;/p&gt;\n\n&lt;p&gt;Writing philosophy papers is hard. In my mind, it definitely requires practice and instruction for most people. This is a great guide by a philosophy professor to writing a philosophy paper: &lt;a href=\"http://www.jimpryor.net/teaching/guidelines/writing.html\"&gt;http://www.jimpryor.net/teaching/guidelines/writing.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Grading is going to be about how well you can track the arguments in your paper. Most undergraduate papers typically track the argumentative moves of a debate covered in lectures, explaining the nuances and complexities as charitably as possible. At the end,  you are expected to produce something original. This new contribution can come in the form of a novel refutation or a novel extension of an idea or something else. Usually this part is graded quite leniently. I&amp;#39;ve gotten As on papers in 3000-level classes with a terrible original refutation, but a decent exposition of the central issue.&lt;/p&gt;\n\n&lt;p&gt;Lower tier versus higher tier is really not going to change much in terms of what you read but YMMV on this one. It&amp;#39;s mostly about how much the professor can expect out of the students. This will affect grading. Remember that there are graduate seminars and intro undergrad classes reading Plato&amp;#39;s Republic. &lt;/p&gt;\n\n&lt;p&gt;Note: Academic philosophy, at least in the Anglo-American world, is usually in the analytic tradition. With that in mind, the philosophers and philosophy you enjoy reading now might not ever appear in any of your undergraduate courses. In a typical analytic philosophy department, I doubt that you will get the chance to take classes where you read Heidegger, Husserl, Hegel, Camus, Sartre, Nietzsche (perhaps in a history of phil class?), or Foucault. I don&amp;#39;t know what you&amp;#39;re reading now that makes you excited about philosophy, but if it&amp;#39;s these authors that pique your interest, I would recommend an English or Comparative Studies major. Comparative Studies especially if your interest is in non-Western philosophy, because that&amp;#39;s where your non-Western philosophy experts are going to be.&lt;/p&gt;\n\n&lt;p&gt;Also, I would definitely double major. It&amp;#39;s super easy to do so at most places and it will only help you philosophically. I have friends double majoring in chemistry, neuroscience, political science, economics, psychology, physics, and biology, over the top of my head. Definitely do it both for your philosophical growth and for being more employable. For law school, probably political science is the best &amp;quot;fit&amp;quot; for that, but literally anything works. Just explore what you&amp;#39;re interested in philosophically and find a double major that matches with that!&lt;/p&gt;\n\n&lt;p&gt;edit: HW is reading philosophy, usually papers or excerpts from primary sources. Reading philosophical texts takes time. Don&amp;#39;t blow it off if you want your money&amp;#39;s worth from the class. It is very easy to get left behind if you don&amp;#39;t read, especially in a class where you might be reading authors that directly respond to one another. Doing the readings easily shows by your ability to engage/participate in the lecture and in your essays.&lt;/p&gt;\n\n&lt;p&gt;edit: also &lt;a href=\"/r/askphilosophy\"&gt;/r/askphilosophy&lt;/a&gt; is a great place to ask questions!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dger3ty", "score_hidden": false, "stickied": false, "created": 1492521661.0, "created_utc": 1492492861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgdqy5l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "INTJ_Hokie", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I took some of the lower level ones. Lots of assigned readings, written assignments, and discussion in class. Mostly I encountered papers rather than exams.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took some of the lower level ones. Lots of assigned readings, written assignments, and discussion in class. Mostly I encountered papers rather than exams.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdqy5l", "score_hidden": false, "stickied": false, "created": 1492476841.0, "created_utc": 1492448041.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgdr7sy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deacon91", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Discussions, Quizzes, Exams, Papers.\n\nKeep up with the readings and it won't be all that difficult", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Discussions, Quizzes, Exams, Papers.&lt;/p&gt;\n\n&lt;p&gt;Keep up with the readings and it won&amp;#39;t be all that difficult&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgdr7sy", "score_hidden": false, "stickied": false, "created": 1492477140.0, "created_utc": 1492448340.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dge8nqu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MadManAndrew", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Intro to philosophy was just lots of reading and lots of writing. One book and a report over it ever 2 weeks or so. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Intro to philosophy was just lots of reading and lots of writing. One book and a report over it ever 2 weeks or so. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dge8nqu", "score_hidden": false, "stickied": false, "created": 1492497194.0, "created_utc": 1492468394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dged8ue", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zach_original", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I took intro to philosophy last semester. It was actually really interesting because it gave me a lot of different perspectives on things. It wasn't really that hard but in order to enjoy it and get something out of it, I highly recommend having an open mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took intro to philosophy last semester. It was actually really interesting because it gave me a lot of different perspectives on things. It wasn&amp;#39;t really that hard but in order to enjoy it and get something out of it, I highly recommend having an open mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dged8ue", "score_hidden": false, "stickied": false, "created": 1492503152.0, "created_utc": 1492474352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgefb0q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ReadySetGonads", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I took Philosophy 101. My professor was a cool old rich white guy who I think would fit easily into a toga like Socrates wore. It was mostly lecture on assigned reading and he talked about what it takes to be happy in life. We went over basic principles about reality, the \"demon\" vs free will thing, society and tolerance. One of my favorite classes for sure, got an A because I loved the subject. Even though it's not in my course load I really want to take a logic class.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took Philosophy 101. My professor was a cool old rich white guy who I think would fit easily into a toga like Socrates wore. It was mostly lecture on assigned reading and he talked about what it takes to be happy in life. We went over basic principles about reality, the &amp;quot;demon&amp;quot; vs free will thing, society and tolerance. One of my favorite classes for sure, got an A because I loved the subject. Even though it&amp;#39;s not in my course load I really want to take a logic class.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgefb0q", "score_hidden": false, "stickied": false, "created": 1492505724.0, "created_utc": 1492476924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgeg61t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Endraa", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I took three level 100 philosophy classes. One was the intro to logic, but I completely forgot what the other two were. The logic one was quite hard for me - it started off okay doing simple proofs, but it got harder with the last half of the classes spent mostly on translating sentences into logic symbols and whatnot. Probably a good one if you like math. But other than that, the other two that I took were okay - I wasn't that interested in the topic, but they were easy A's. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took three level 100 philosophy classes. One was the intro to logic, but I completely forgot what the other two were. The logic one was quite hard for me - it started off okay doing simple proofs, but it got harder with the last half of the classes spent mostly on translating sentences into logic symbols and whatnot. Probably a good one if you like math. But other than that, the other two that I took were okay - I wasn&amp;#39;t that interested in the topic, but they were easy A&amp;#39;s. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgeg61t", "score_hidden": false, "stickied": false, "created": 1492506789.0, "created_utc": 1492477989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgekrwq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "leakleaf", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I've heard awful things about the intro class at my school from a handful of people, witch sucked because I was interested in taking the course ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard awful things about the intro class at my school from a handful of people, witch sucked because I was interested in taking the course &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgekrwq", "score_hidden": false, "stickied": false, "created": 1492512354.0, "created_utc": 1492483554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgemuj8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "spaceeprincess", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "I took Intro to Philosophy at community college a few years ago. It was by far one of my favorite classes! That was largely due to the professor being very charismatic and passionate about the material, but it was an interesting class either way. We learned a lot about different concepts and philosophers. Most of the class time was spent discussing things (it was a 3 hour class one night a week) and we often had to stop discussion because we were running out of time. I don't think we had any essays, just a couple of multiple choice tests, but of course that varies from class to class. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took Intro to Philosophy at community college a few years ago. It was by far one of my favorite classes! That was largely due to the professor being very charismatic and passionate about the material, but it was an interesting class either way. We learned a lot about different concepts and philosophers. Most of the class time was spent discussing things (it was a 3 hour class one night a week) and we often had to stop discussion because we were running out of time. I don&amp;#39;t think we had any essays, just a couple of multiple choice tests, but of course that varies from class to class. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgemuj8", "score_hidden": false, "stickied": false, "created": 1492515054.0, "created_utc": 1492486254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3z", "removal_reason": null, "link_id": "t3_65wqwb", "likes": null, "replies": "", "user_reports": [], "id": "dgerv54", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yarny14", "parent_id": "t3_65wqwb", "subreddit_name_prefixed": "r/college", "controversiality": 0, "body": "Lots of essay writing and reading. Prof just talked about theories and applications of it in real life. Honestly a snooze fest", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of essay writing and reading. Prof just talked about theories and applications of it in real life. Honestly a snooze fest&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "college", "name": "t1_dgerv54", "score_hidden": false, "stickied": false, "created": 1492523117.0, "created_utc": 1492494317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]