[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fo4", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am mostly a settlements person so I never bothered with the survival mode. Though now I am craving a heavy story centered play-through. With that in mind, would settlements make the experience a bit too easy or should I tone it down a bit and kind of &amp;quot;neuter&amp;quot; myself with it.   &lt;/p&gt;\n\n&lt;p&gt;I also know the damage receiving/output is a bit unfair and there are some mods that change it for equal output, which mod does this the best? In general just looking for any mods that will keep everything lore-friendly and will generally enhance my experience. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am mostly a settlements person so I never bothered with the survival mode. Though now I am craving a heavy story centered play-through. With that in mind, would settlements make the experience a bit too easy or should I tone it down a bit and kind of \"neuter\" myself with it.   \n  \nI also know the damage receiving/output is a bit unfair and there are some mods that change it for equal output, which mod does this the best? In general just looking for any mods that will keep everything lore-friendly and will generally enhance my experience. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65b1bn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "Lightning1432", "saved": false, "mod_reports": [], "name": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "approved_by": null, "over_18": false, "domain": "self.fo4", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tzv4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fo4/comments/65b1bn/going_to_try_a_survival_run_but_need_mods_that/", "num_reports": null, "locked": false, "stickied": false, "created": 1492180487.0, "url": "https://www.reddit.com/r/fo4/comments/65b1bn/going_to_try_a_survival_run_but_need_mods_that/", "author_flair_text": null, "quarantine": false, "title": "Going to try a survival run but need mods that pair well with it, I'm on PC.", "created_utc": 1492151687.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg96yi2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "WyrdHarper", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Clean Soup is a nice one. And makes more sense in my opinion. It makes cooking recipes use clean water instead of dirty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Clean Soup is a nice one. And makes more sense in my opinion. It makes cooking recipes use clean water instead of dirty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg96yi2", "score_hidden": false, "stickied": false, "created": 1492208843.0, "created_utc": 1492180043.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg9kxnw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "WinterholdMage", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Settlements are, to me, essential to survival.  Mainly because they *can* offer shelter, food, water, and most importantly, safety.  Plus you get some items like the flare gun, which will summon a group of Minutemen to roll into battle with, or the artillery cannons (after you take the castle) which allow you to bomb a large area with heavy artillery.  Both of these rely on having settlements within range for these to be used.  So aligning all settlements to the minutemen will generally allow use of these abilities anywhere on the map.\n\nThat said, modding depends on what you want to enhance the experience.  What I use for survival are as follows:\n\n1. [True Storms](http://www.nexusmods.com/fallout4/mods/4472/?)- This one adds new weather types to the game as well as enhancing the current ones in game.  Probably my favorite addition is the radiation rain storms which bring with it ghouls coming up from the glowing sea.  You can customize much of the options on the fly in the game, so you customize your experience and disable things you don't really like.  Pulled from the mod page, here is a [video](https://www.youtube.com/watch?v=InJwn_Y71n8) from the author that goes into detail of the mod and what it provides. (Note, I used the Vanilla fog option when installing, since this mod's version of heavy fog tanks my FPS.  Depending on your setup, this may not be an issue).\n\n2. [Campsite](http://www.nexusmods.com/fallout4/mods/11734/?)- This one allows you to craft tents, fires, cooking equipment, and bedrolls that allow you to set up camp anywhere.  The benefit is that not only is it immersive, it allows you to save since you'll be able to sleep.  This is a no-brainer since fast travel is disabled, meaning you might be a good ways away from real shelter and a place to save.  Because of this, you might find it unfair to be allowed to save anywhere, but it depends on your personal preferences.  I've played survival a good deal and the only thing that bugs me is the saving only when sleeping feature.  You gain a damage buff (Adrenaline) the more enemies you kill but gets reset every time you sleep, so there is that to think about.  At a base level, you deal .5x damage to enemies with no buffs while enemies deal 2x damage to you.  I don't feel it cheats the system because while you can now sleep anywhere in a practical, lore friendly manner, you lose any Adrenaline buff you've accumulated.\n\n3. [Lore Friendly Survival Chems](http://www.nexusmods.com/fallout4/mods/15275/?)- These are already in the vanilla game, but the modder simply remodeled and re-textured the in-game assets to look different than common drugs you'd find.  He's also added 2 new items; Serum and MRE's.  In the base game, there are a few different items which allow you to lower your risk of contracting certain diseases.  Serum is essentially all of these items rolled into one, craftable only if you have one of each already.  MRE's have a rare drop rate in containers but are also purchasable by some vendors.  They restore a good deal of health, temporarily increase your healing rate, and increase your resistance to fatigue for a short time.  I feel this is a good, balance item that fits right in on survival.\n\nSo that's really it for survival specific mods.  Some I find really add to the immersion though, are as follows.\n\n1. [Cinematic Sounds](http://www.nexusmods.com/fallout4/mods/6647/?)- Greatly improves the sounds of explosions and other things that go boom.\n\n2. [Reverb and Ambiance Overhaul](http://www.nexusmods.com/fallout4/mods/10189/?tab=1&amp;navtag=http%3A%2F%2Fwww.nexusmods.com%2Ffallout4%2Fajax%2Fmoddescription%2F%3Fid%3D10189%26preview%3D&amp;pUp=1)- This one does quite a bit with the sound system by mainly making sound more dynamic.  This is the one I suggest watching the video on the mod page to get an idea of what it's changing.  This mod comes with two sliders to allow you to adjust the level of ambience and reverb on the fly.\n\n3. [Interiors Enhanced](http://www.nexusmods.com/fallout4/mods/8768/?)- Makes interiors darker instead of being washed out by bright foggy effects.  The screenshots on the page show a great comparison between vanilla and the mod so you can decide if it's for you or not.  For me, it makes the lighting more immersive and realistic and he does this by actually manipulating the lighting data for each interior cell instead of messing with blanket \"fixes\" like so many other lighting mods do, which can make the game world itself darker than intended.\n\nThat's really it.  One thing you can do on your own is to disable character lighting, which is basically a fake light that makes any character \"glow\" in dark areas.  To get an idea of what I mean, take a look at the pictures OP posted on [this](https://www.reddit.com/r/fo4/comments/3uk43e/character_lighting_on_vs_off_is_there_an_in/) thread.  You can use a mod, but it's a really simple tweak.  Simply go into your Fallout4.ini file and under the [General] heading, put \"sStartingConsoleCommand=cl off\" at the bottom of the list, like [this](http://imgur.com/a/eFdKi).\n\nHave fun!", "edited": 1492196898.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Settlements are, to me, essential to survival.  Mainly because they &lt;em&gt;can&lt;/em&gt; offer shelter, food, water, and most importantly, safety.  Plus you get some items like the flare gun, which will summon a group of Minutemen to roll into battle with, or the artillery cannons (after you take the castle) which allow you to bomb a large area with heavy artillery.  Both of these rely on having settlements within range for these to be used.  So aligning all settlements to the minutemen will generally allow use of these abilities anywhere on the map.&lt;/p&gt;\n\n&lt;p&gt;That said, modding depends on what you want to enhance the experience.  What I use for survival are as follows:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"http://www.nexusmods.com/fallout4/mods/4472/?\"&gt;True Storms&lt;/a&gt;- This one adds new weather types to the game as well as enhancing the current ones in game.  Probably my favorite addition is the radiation rain storms which bring with it ghouls coming up from the glowing sea.  You can customize much of the options on the fly in the game, so you customize your experience and disable things you don&amp;#39;t really like.  Pulled from the mod page, here is a &lt;a href=\"https://www.youtube.com/watch?v=InJwn_Y71n8\"&gt;video&lt;/a&gt; from the author that goes into detail of the mod and what it provides. (Note, I used the Vanilla fog option when installing, since this mod&amp;#39;s version of heavy fog tanks my FPS.  Depending on your setup, this may not be an issue).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"http://www.nexusmods.com/fallout4/mods/11734/?\"&gt;Campsite&lt;/a&gt;- This one allows you to craft tents, fires, cooking equipment, and bedrolls that allow you to set up camp anywhere.  The benefit is that not only is it immersive, it allows you to save since you&amp;#39;ll be able to sleep.  This is a no-brainer since fast travel is disabled, meaning you might be a good ways away from real shelter and a place to save.  Because of this, you might find it unfair to be allowed to save anywhere, but it depends on your personal preferences.  I&amp;#39;ve played survival a good deal and the only thing that bugs me is the saving only when sleeping feature.  You gain a damage buff (Adrenaline) the more enemies you kill but gets reset every time you sleep, so there is that to think about.  At a base level, you deal .5x damage to enemies with no buffs while enemies deal 2x damage to you.  I don&amp;#39;t feel it cheats the system because while you can now sleep anywhere in a practical, lore friendly manner, you lose any Adrenaline buff you&amp;#39;ve accumulated.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"http://www.nexusmods.com/fallout4/mods/15275/?\"&gt;Lore Friendly Survival Chems&lt;/a&gt;- These are already in the vanilla game, but the modder simply remodeled and re-textured the in-game assets to look different than common drugs you&amp;#39;d find.  He&amp;#39;s also added 2 new items; Serum and MRE&amp;#39;s.  In the base game, there are a few different items which allow you to lower your risk of contracting certain diseases.  Serum is essentially all of these items rolled into one, craftable only if you have one of each already.  MRE&amp;#39;s have a rare drop rate in containers but are also purchasable by some vendors.  They restore a good deal of health, temporarily increase your healing rate, and increase your resistance to fatigue for a short time.  I feel this is a good, balance item that fits right in on survival.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;So that&amp;#39;s really it for survival specific mods.  Some I find really add to the immersion though, are as follows.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"http://www.nexusmods.com/fallout4/mods/6647/?\"&gt;Cinematic Sounds&lt;/a&gt;- Greatly improves the sounds of explosions and other things that go boom.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"http://www.nexusmods.com/fallout4/mods/10189/?tab=1&amp;amp;navtag=http%3A%2F%2Fwww.nexusmods.com%2Ffallout4%2Fajax%2Fmoddescription%2F%3Fid%3D10189%26preview%3D&amp;amp;pUp=1\"&gt;Reverb and Ambiance Overhaul&lt;/a&gt;- This one does quite a bit with the sound system by mainly making sound more dynamic.  This is the one I suggest watching the video on the mod page to get an idea of what it&amp;#39;s changing.  This mod comes with two sliders to allow you to adjust the level of ambience and reverb on the fly.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"http://www.nexusmods.com/fallout4/mods/8768/?\"&gt;Interiors Enhanced&lt;/a&gt;- Makes interiors darker instead of being washed out by bright foggy effects.  The screenshots on the page show a great comparison between vanilla and the mod so you can decide if it&amp;#39;s for you or not.  For me, it makes the lighting more immersive and realistic and he does this by actually manipulating the lighting data for each interior cell instead of messing with blanket &amp;quot;fixes&amp;quot; like so many other lighting mods do, which can make the game world itself darker than intended.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;That&amp;#39;s really it.  One thing you can do on your own is to disable character lighting, which is basically a fake light that makes any character &amp;quot;glow&amp;quot; in dark areas.  To get an idea of what I mean, take a look at the pictures OP posted on &lt;a href=\"https://www.reddit.com/r/fo4/comments/3uk43e/character_lighting_on_vs_off_is_there_an_in/\"&gt;this&lt;/a&gt; thread.  You can use a mod, but it&amp;#39;s a really simple tweak.  Simply go into your Fallout4.ini file and under the [General] heading, put &amp;quot;sStartingConsoleCommand=cl off&amp;quot; at the bottom of the list, like &lt;a href=\"http://imgur.com/a/eFdKi\"&gt;this&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Have fun!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg9kxnw", "score_hidden": false, "stickied": false, "created": 1492225283.0, "created_utc": 1492196483.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg9hmsc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mullsong21", "parent_id": "t1_dg9an7k", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Sleep or save is usually a must since the random crashes can set you back hours worth of progress. Grab campsite as well and you can leave little camps to rest at all around the map", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sleep or save is usually a must since the random crashes can set you back hours worth of progress. Grab campsite as well and you can leave little camps to rest at all around the map&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg9hmsc", "score_hidden": false, "stickied": false, "created": 1492221343.0, "created_utc": 1492192543.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9an7k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jacknbox", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "[Sleep or Save](http://www.nexusmods.com/fallout4/mods/12262/?) is pretty essential for me.  It lets you choose whether to save or sleep at a bed, so you don't have to constantly take 1-hour naps.  You can configure it to do more \"cheaty\" things, but I think the default is super convenient without breaking the \"I really have to find a bed\" experience.\n\nI would not recommend messing with the damage.  It's tough at first but eventually becomes easier than Very Hard.  If you nerf the damage settings then it's going to be way too easy and not fun.\n\n&gt; With that in mind, would settlements make the experience a bit too easy or should I tone it down a bit and kind of \"neuter\" myself with it.\n\nHaving settlements makes things a lot more convenient in Survival.  Not sure I'd call it \"easier\" in terms of game difficulty, though.  Supply lines and especially workbenches are a bigger deal because you can't fast travel.  Having a bed to save in key locations is also big.  I often have settlements with 0 population with just a bed in them.\n\nI think this is good, because it forces you to seriously consider getting Local Leader, Cap Collector, etc. early on, which forces you to sacrifice other things like survivability or damage.  I don't think \"neutering\" them would really do anything except make things more tedious for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.nexusmods.com/fallout4/mods/12262/?\"&gt;Sleep or Save&lt;/a&gt; is pretty essential for me.  It lets you choose whether to save or sleep at a bed, so you don&amp;#39;t have to constantly take 1-hour naps.  You can configure it to do more &amp;quot;cheaty&amp;quot; things, but I think the default is super convenient without breaking the &amp;quot;I really have to find a bed&amp;quot; experience.&lt;/p&gt;\n\n&lt;p&gt;I would not recommend messing with the damage.  It&amp;#39;s tough at first but eventually becomes easier than Very Hard.  If you nerf the damage settings then it&amp;#39;s going to be way too easy and not fun.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;With that in mind, would settlements make the experience a bit too easy or should I tone it down a bit and kind of &amp;quot;neuter&amp;quot; myself with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Having settlements makes things a lot more convenient in Survival.  Not sure I&amp;#39;d call it &amp;quot;easier&amp;quot; in terms of game difficulty, though.  Supply lines and especially workbenches are a bigger deal because you can&amp;#39;t fast travel.  Having a bed to save in key locations is also big.  I often have settlements with 0 population with just a bed in them.&lt;/p&gt;\n\n&lt;p&gt;I think this is good, because it forces you to seriously consider getting Local Leader, Cap Collector, etc. early on, which forces you to sacrifice other things like survivability or damage.  I don&amp;#39;t think &amp;quot;neutering&amp;quot; them would really do anything except make things more tedious for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg9an7k", "score_hidden": false, "stickied": false, "created": 1492213404.0, "created_utc": 1492184604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg96zc9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SIowAndLow", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Those damage mods just end up messing the game up more than they help. \n\nThey don't account for the effects/spells/buffs you get from survival and you end up being really OP really early and then loose the need to use any of the other cool chems/perks/ etc", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those damage mods just end up messing the game up more than they help. &lt;/p&gt;\n\n&lt;p&gt;They don&amp;#39;t account for the effects/spells/buffs you get from survival and you end up being really OP really early and then loose the need to use any of the other cool chems/perks/ etc&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg96zc9", "score_hidden": false, "stickied": false, "created": 1492208873.0, "created_utc": 1492180073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg9htj1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bunktavious", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Nothing wrong with focus on settlements in Survival. Actually makes them have much more of a purpose. Since areas don't respawn nearly as quickly, you have a lot less sources of easy to find scrap. You really need to setup farms for supplying cutting fluid and adhesive. Plus the need for safe beds and water.\n\nI would recommend not going nuts on the Water Baron/Jet Dealer thing though if you are planning on a challenging and balanced play through.\n\nMods - Id stick to cosmetics, convenient settlement building ones, and other things that don't mess with game balance much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing wrong with focus on settlements in Survival. Actually makes them have much more of a purpose. Since areas don&amp;#39;t respawn nearly as quickly, you have a lot less sources of easy to find scrap. You really need to setup farms for supplying cutting fluid and adhesive. Plus the need for safe beds and water.&lt;/p&gt;\n\n&lt;p&gt;I would recommend not going nuts on the Water Baron/Jet Dealer thing though if you are planning on a challenging and balanced play through.&lt;/p&gt;\n\n&lt;p&gt;Mods - Id stick to cosmetics, convenient settlement building ones, and other things that don&amp;#39;t mess with game balance much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg9htj1", "score_hidden": false, "stickied": false, "created": 1492221558.0, "created_utc": 1492192758.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg9qngq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Vinccius", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Changing the damage output to 1:1 is not a good idea, your upgraded/legendary gear and all those bonus from perks will make you one shot every enemies around midgame.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Changing the damage output to 1:1 is not a good idea, your upgraded/legendary gear and all those bonus from perks will make you one shot every enemies around midgame.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg9qngq", "score_hidden": false, "stickied": false, "created": 1492232175.0, "created_utc": 1492203375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg9irwo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MobsDeep", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "It's all about horizons ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s all about horizons &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg9irwo", "score_hidden": false, "stickied": false, "created": 1492222692.0, "created_utc": 1492193892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65b1bn", "likes": null, "replies": "", "user_reports": [], "id": "dg9jwuk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rick_Venus", "parent_id": "t3_65b1bn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Unofficial patch, settlement management system. Might try that camping one but there are places to sleep everywhere already so not really needed IMO. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unofficial patch, settlement management system. Might try that camping one but there are places to sleep everywhere already so not really needed IMO. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dg9jwuk", "score_hidden": false, "stickied": false, "created": 1492224053.0, "created_utc": 1492195253.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]