[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fo4", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have almost 1000 hours on fallout 4 but i have never played survival mode, so i&amp;#39;m doing an unmodded play-through now. It&amp;#39;s like a whole other game, and actually ties up the game much better, each vendor becomes individually useful, settlement building becomes more than just aesthetics, great so far! &lt;/p&gt;\n\n&lt;p&gt;I am confused a lot by the system though. I&amp;#39;m hungry and thirsty all the time.. What are your solutions? To fill hunger should i be eating rubbish foods or good foods? Is it a waste to eat good food when hungry? &lt;/p&gt;\n\n&lt;p&gt;Also i get &amp;quot;ill&amp;quot; a lot where i need antibiotics / a doctor to cure me. Does this actually kill you eventually? It happens seemingly randomly.&lt;/p&gt;\n\n&lt;p&gt;Also any other tips?&lt;/p&gt;\n\n&lt;p&gt;Was planning on making a whole bunch of muttfruit farms for some caps. &lt;/p&gt;\n\n&lt;p&gt;Edit: What are the must pick up items out there? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have almost 1000 hours on fallout 4 but i have never played survival mode, so i'm doing an unmodded play-through now. It's like a whole other game, and actually ties up the game much better, each vendor becomes individually useful, settlement building becomes more than just aesthetics, great so far! \n\nI am confused a lot by the system though. I'm hungry and thirsty all the time.. What are your solutions? To fill hunger should i be eating rubbish foods or good foods? Is it a waste to eat good food when hungry? \n\nAlso i get \"ill\" a lot where i need antibiotics / a doctor to cure me. Does this actually kill you eventually? It happens seemingly randomly.\n\nAlso any other tips?\n\nWas planning on making a whole bunch of muttfruit farms for some caps. \n\nEdit: What are the must pick up items out there? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65knd4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "aimouse", "saved": false, "mod_reports": [], "name": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "approved_by": null, "over_18": false, "domain": "self.fo4", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tzv4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fo4/comments/65knd4/what_are_your_survival_mode_tips_for_me/", "num_reports": null, "locked": false, "stickied": false, "created": 1492310179.0, "url": "https://www.reddit.com/r/fo4/comments/65knd4/what_are_your_survival_mode_tips_for_me/", "author_flair_text": null, "quarantine": false, "title": "What are your survival mode tips for me?", "created_utc": 1492281379.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb0738", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "8bitHandyman", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "- Collect the book from Sunshine Tidings and cook meat you get from killing animals. This largely covers hunger since there are animals in every area and you only need to eat 2 small pieces maximum at Peckish to be full. It's a hidden counter that increases as time passes and after combat but only updates once every in game hour or when you use an item like Radaway to force it to update. You can save larger animal meat for when you have to pop a RadAway or something.\n\n- Getting ill is a result of RNG but it's triggered by things like eating contaminated food, walking around in irradiated water, sleeping in dirty beds, injecting chems and getting hit by irradiated enemies. Most animals and ghouls fall under irradiated enemies. It stacks so eventually you will be ill even if you keep beating the rolls. There are different effects and not all of them will kill you but most of them are deadly on Survival in one way or another. \n\n**EDIT:** I should add the strategies I come up with for Survival were born from not wanting to maintain a settlement so I aim to be entirely self sufficient in everything.", "edited": 1492283058.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Collect the book from Sunshine Tidings and cook meat you get from killing animals. This largely covers hunger since there are animals in every area and you only need to eat 2 small pieces maximum at Peckish to be full. It&amp;#39;s a hidden counter that increases as time passes and after combat but only updates once every in game hour or when you use an item like Radaway to force it to update. You can save larger animal meat for when you have to pop a RadAway or something.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Getting ill is a result of RNG but it&amp;#39;s triggered by things like eating contaminated food, walking around in irradiated water, sleeping in dirty beds, injecting chems and getting hit by irradiated enemies. Most animals and ghouls fall under irradiated enemies. It stacks so eventually you will be ill even if you keep beating the rolls. There are different effects and not all of them will kill you but most of them are deadly on Survival in one way or another. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT:&lt;/strong&gt; I should add the strategies I come up with for Survival were born from not wanting to maintain a settlement so I aim to be entirely self sufficient in everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb0738", "score_hidden": false, "stickied": false, "created": 1492310869.0, "created_utc": 1492282069.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb0qtm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "bythehomeworld", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Clean (cooked) food, clean water, and decent length of sleep in a *clean* bed. A light, reliable source of both food and water on survival is noodles. It's just razorgrain and dirty water. You need to eat and drink a lot because the time scale for the game is crazy high for an immersive survival game. \n\nMost illnesses just suck, they don't directly kill you but give you a hand on the way. The one that does health damage, the infection can't *directly* kill you but it will bring your health down to 1hp. You can out-heal it, but it lasts a fair while. It is the only one that truly needs an antibiotic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Clean (cooked) food, clean water, and decent length of sleep in a &lt;em&gt;clean&lt;/em&gt; bed. A light, reliable source of both food and water on survival is noodles. It&amp;#39;s just razorgrain and dirty water. You need to eat and drink a lot because the time scale for the game is crazy high for an immersive survival game. &lt;/p&gt;\n\n&lt;p&gt;Most illnesses just suck, they don&amp;#39;t directly kill you but give you a hand on the way. The one that does health damage, the infection can&amp;#39;t &lt;em&gt;directly&lt;/em&gt; kill you but it will bring your health down to 1hp. You can out-heal it, but it lasts a fair while. It is the only one that truly needs an antibiotic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb0qtm", "score_hidden": false, "stickied": false, "created": 1492311604.0, "created_utc": 1492282804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb2v4o", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "jacksclevername", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "A lot of good stuff in the other comments.\n\nMy main suggestions after you sort out food/health are:\n\n* You can't really charge in guns blazing in survival, so stealth and stealth perks are super valuable. I think my survival character does  like 5x damage with silenced weapons with all relevant perks. \n* Think a bit more about your weapons, since you can't carry every bit of ammo you come across. I use the Deliverer (tons of 10mm ammo lying around), the Gainer and a legendary .50 rifle (Scrounger perks mean plenty of ammo).\n* Ally with the BOS when you can so you can get access to vertibirds, which basically amount to fast-travel. \n* Take a bit of time to set up each settlement so you can minimize running across the entire map. Make sure each has a water pump, scrap stations, etc. Pick a central one liek Hangman's Alley to use as home-base.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of good stuff in the other comments.&lt;/p&gt;\n\n&lt;p&gt;My main suggestions after you sort out food/health are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You can&amp;#39;t really charge in guns blazing in survival, so stealth and stealth perks are super valuable. I think my survival character does  like 5x damage with silenced weapons with all relevant perks. &lt;/li&gt;\n&lt;li&gt;Think a bit more about your weapons, since you can&amp;#39;t carry every bit of ammo you come across. I use the Deliverer (tons of 10mm ammo lying around), the Gainer and a legendary .50 rifle (Scrounger perks mean plenty of ammo).&lt;/li&gt;\n&lt;li&gt;Ally with the BOS when you can so you can get access to vertibirds, which basically amount to fast-travel. &lt;/li&gt;\n&lt;li&gt;Take a bit of time to set up each settlement so you can minimize running across the entire map. Make sure each has a water pump, scrap stations, etc. Pick a central one liek Hangman&amp;#39;s Alley to use as home-base.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb2v4o", "score_hidden": false, "stickied": false, "created": 1492314418.0, "created_utc": 1492285618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb5j5j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "coffeebum", "parent_id": "t1_dgb2bsn", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Very good points, I did not think all the way through that answer. I do think melons are a good cash crop with Lucy buying, but you are right about the other health and xp benefits.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good points, I did not think all the way through that answer. I do think melons are a good cash crop with Lucy buying, but you are right about the other health and xp benefits.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb5j5j", "score_hidden": false, "stickied": false, "created": 1492318061.0, "created_utc": 1492289261.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2bsn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nomedable", "parent_id": "t1_dgb0lg2", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Melons aren't the greatest crop. Yes they fulfill hunger and thirst, but you get radiation and they cannot be used in any crafting recipes. Plus they seem to be the largest hitbox and planting them take up a ton of space, where other crops could be clustered better. It pays off better to have multiple crop types that can all be used in recipes for food or materials, rather than one large crop plantation.\n\nI could have a massive melon farm and eat two melons to fill one point hunger and water. Or I could just plant a few razorgrain crops and make noodles with dirty water that have the same nutrition, 4X the HP restored, no radiation and the benefit of XP from cooking it. Combine that with the diversity of planting the corn, carrots, razorgrain, gourds, tatos, etc. you'll have a steady influx of crops to cook or sell and you'll avoid accumulating radiation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Melons aren&amp;#39;t the greatest crop. Yes they fulfill hunger and thirst, but you get radiation and they cannot be used in any crafting recipes. Plus they seem to be the largest hitbox and planting them take up a ton of space, where other crops could be clustered better. It pays off better to have multiple crop types that can all be used in recipes for food or materials, rather than one large crop plantation.&lt;/p&gt;\n\n&lt;p&gt;I could have a massive melon farm and eat two melons to fill one point hunger and water. Or I could just plant a few razorgrain crops and make noodles with dirty water that have the same nutrition, 4X the HP restored, no radiation and the benefit of XP from cooking it. Combine that with the diversity of planting the corn, carrots, razorgrain, gourds, tatos, etc. you&amp;#39;ll have a steady influx of crops to cook or sell and you&amp;#39;ll avoid accumulating radiation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb2bsn", "score_hidden": false, "stickied": false, "created": 1492313698.0, "created_utc": 1492284898.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0lg2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "coffeebum", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "I was in the same boat my friend, vanilla survival after many many hours of modded gameplay. Hunger, thirst, illnesses, weight restrictions, sleep requirements, no fast travel, boosted damage... more that I didn't mention lol. You just have to get used to the game again. Melons are better than any other crop, satisfying hunger and thirst at the same time. You can set up melon farms in Sanctuary and Red Rocket, and sell excess to Lucy Abernathy. Passing her speech check will get you more caps, and she does not seem to run out of money. Making your own antibiotics is extremely useful, and makes going out at night hunting glowing mushrooms a thing. Sneaking around, marking enemies with a recon scope, avoiding conflicts, running away from enemies, yeah it is different lol. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in the same boat my friend, vanilla survival after many many hours of modded gameplay. Hunger, thirst, illnesses, weight restrictions, sleep requirements, no fast travel, boosted damage... more that I didn&amp;#39;t mention lol. You just have to get used to the game again. Melons are better than any other crop, satisfying hunger and thirst at the same time. You can set up melon farms in Sanctuary and Red Rocket, and sell excess to Lucy Abernathy. Passing her speech check will get you more caps, and she does not seem to run out of money. Making your own antibiotics is extremely useful, and makes going out at night hunting glowing mushrooms a thing. Sneaking around, marking enemies with a recon scope, avoiding conflicts, running away from enemies, yeah it is different lol. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb0lg2", "score_hidden": false, "stickied": false, "created": 1492311407.0, "created_utc": 1492282607.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb1tlw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nomedable", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "When you get the status of being hungry, or starving, etc. Eating food will not give you any of the stat bonuses that it would normally provide, this doesn't mean only eat junk food when you are hungry as higher quality foods seem to fulfill more hunger. I suggest carrying around a nice bit of food, water and food that contains water (soups, stews, noodles, etc.) Try to have enough food for a few days out on the road and store the rest at home/settlements.\n\nIllness is somewhat random, but being fed, hydrated, healthy seems to *lessen* the occurrences and speed recoveries *somewhat*. Poor living, sleeping in nasty places, eating rotted irradiated foods, touching nasty infested mutated creatures all increase your chances of falling ill. For the most part illness' are just debuffs, less stamina, health, carryweight, etc. Odds are they won't kill you directly, but they may contribute to an untimely demise. Doctors are cheap enough to provide medical aid and part way through the game you should have a stockpile of anti-biotics and/or the materials to make them.\n\nTips for radiation. Since radiation drops your max health and survival mode also makes all those hit points a thousand times more valuable as everything (including you) is deadly, you'll want to manage your radiation carefully and cleverly. Rad-Away now has a debuff that is fairly severe, you get quite hungry and thirsty and tired and the game makes you weaker and more susceptible to illness. Rad-X does not have a debuff, use Rad-x to mitigate radiation accumulation and if you have the dlc's build a decontamination arch in a settlement, it removes all radiation, *without the debuff*.\n\nFarming can help make caps, muttfruit will work, water purifiers will work as well. Selling weapons you don't want and **don't need the materials from** will earn some nice caps as well.\n\nBuilding up settlements with food and water surplus and Defense to spare will make life easier. Think of them as rest points and safe havens. Getting late? Feeling peckish and wish to rest? Having a port in the storm with a soft bed, warm meal and a room temperature beverage is essential to mastering survival.\n\nLastly take it slow. You are squishy, your average enemy is too, but since you can't just reload that quicksave from five seconds ago, take it slow. This doesn't mean sit on that hilltop with your rifle and pitch a tent, assess the situation, what do you see, are you familiar with what enemies spawn there, know when to rush, use hit and run guerilla tactics, fight from the shadows, strike and blend in to the surrounds and when the enemy is weakened bring pain upon them in your assault. This may mean *I'm level 35 and haven't been to Diamond City*, but that's fine you were preparing. Oh and that power armor, I suggest taking it with you if you ever become uncomfortable about entering an area, or if you go into a city past Lexington, not a necessity, but having it ca be a godsend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you get the status of being hungry, or starving, etc. Eating food will not give you any of the stat bonuses that it would normally provide, this doesn&amp;#39;t mean only eat junk food when you are hungry as higher quality foods seem to fulfill more hunger. I suggest carrying around a nice bit of food, water and food that contains water (soups, stews, noodles, etc.) Try to have enough food for a few days out on the road and store the rest at home/settlements.&lt;/p&gt;\n\n&lt;p&gt;Illness is somewhat random, but being fed, hydrated, healthy seems to &lt;em&gt;lessen&lt;/em&gt; the occurrences and speed recoveries &lt;em&gt;somewhat&lt;/em&gt;. Poor living, sleeping in nasty places, eating rotted irradiated foods, touching nasty infested mutated creatures all increase your chances of falling ill. For the most part illness&amp;#39; are just debuffs, less stamina, health, carryweight, etc. Odds are they won&amp;#39;t kill you directly, but they may contribute to an untimely demise. Doctors are cheap enough to provide medical aid and part way through the game you should have a stockpile of anti-biotics and/or the materials to make them.&lt;/p&gt;\n\n&lt;p&gt;Tips for radiation. Since radiation drops your max health and survival mode also makes all those hit points a thousand times more valuable as everything (including you) is deadly, you&amp;#39;ll want to manage your radiation carefully and cleverly. Rad-Away now has a debuff that is fairly severe, you get quite hungry and thirsty and tired and the game makes you weaker and more susceptible to illness. Rad-X does not have a debuff, use Rad-x to mitigate radiation accumulation and if you have the dlc&amp;#39;s build a decontamination arch in a settlement, it removes all radiation, &lt;em&gt;without the debuff&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Farming can help make caps, muttfruit will work, water purifiers will work as well. Selling weapons you don&amp;#39;t want and &lt;strong&gt;don&amp;#39;t need the materials from&lt;/strong&gt; will earn some nice caps as well.&lt;/p&gt;\n\n&lt;p&gt;Building up settlements with food and water surplus and Defense to spare will make life easier. Think of them as rest points and safe havens. Getting late? Feeling peckish and wish to rest? Having a port in the storm with a soft bed, warm meal and a room temperature beverage is essential to mastering survival.&lt;/p&gt;\n\n&lt;p&gt;Lastly take it slow. You are squishy, your average enemy is too, but since you can&amp;#39;t just reload that quicksave from five seconds ago, take it slow. This doesn&amp;#39;t mean sit on that hilltop with your rifle and pitch a tent, assess the situation, what do you see, are you familiar with what enemies spawn there, know when to rush, use hit and run guerilla tactics, fight from the shadows, strike and blend in to the surrounds and when the enemy is weakened bring pain upon them in your assault. This may mean &lt;em&gt;I&amp;#39;m level 35 and haven&amp;#39;t been to Diamond City&lt;/em&gt;, but that&amp;#39;s fine you were preparing. Oh and that power armor, I suggest taking it with you if you ever become uncomfortable about entering an area, or if you go into a city past Lexington, not a necessity, but having it ca be a godsend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb1tlw", "score_hidden": false, "stickied": false, "created": 1492313021.0, "created_utc": 1492284221.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgdv0wb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KadenKaden", "parent_id": "t1_dgbazk0", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Funny and helpful!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Funny and helpful!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgdv0wb", "score_hidden": false, "stickied": false, "created": 1492481353.0, "created_utc": 1492452553.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbazk0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bugme143", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Never be afraid to retreat, heal, snort some jet, and come back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never be afraid to retreat, heal, snort some jet, and come back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgbazk0", "score_hidden": false, "stickied": false, "created": 1492325755.0, "created_utc": 1492296955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb07xy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rick_Venus", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "water pumps at settlements help.  fill all the empty bottles you find at water pumps.\n\nkill and cook to eat, sell prepackaged food.\n\npay attention to the hp/weight ratio for food and carry efficient food.  Iguana on a stick is good.  \n\nI kill a lot of dogs and roast the meat until I get a stash of Iguana built up.\n\nGet that chemist perk to make your own antibiotics.  \n\nRefreshing Beverage makes survival into easy mode after about level 37-38.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;water pumps at settlements help.  fill all the empty bottles you find at water pumps.&lt;/p&gt;\n\n&lt;p&gt;kill and cook to eat, sell prepackaged food.&lt;/p&gt;\n\n&lt;p&gt;pay attention to the hp/weight ratio for food and carry efficient food.  Iguana on a stick is good.  &lt;/p&gt;\n\n&lt;p&gt;I kill a lot of dogs and roast the meat until I get a stash of Iguana built up.&lt;/p&gt;\n\n&lt;p&gt;Get that chemist perk to make your own antibiotics.  &lt;/p&gt;\n\n&lt;p&gt;Refreshing Beverage makes survival into easy mode after about level 37-38.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb07xy", "score_hidden": false, "stickied": false, "created": 1492310901.0, "created_utc": 1492282101.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb76uy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mafyuuu", "parent_id": "t1_dgb1cke", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "An alternative doctor which I would say is closer is the covenant doctor, though the route can sometimes bring you past dangerous enemies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An alternative doctor which I would say is closer is the covenant doctor, though the route can sometimes bring you past dangerous enemies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb76uy", "score_hidden": false, "stickied": false, "created": 1492320373.0, "created_utc": 1492291573.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1cke", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Agrippa911", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Illness was the biggest factor for me starting off. But once I hit the teens and had enough caps to setup a doctor's station in Sanctuary, I had an easy location to get cured (before it was making the trek from Sanctuary and then Starlight to Diamond City to get cured). Once you hit your twenties, you'll have enough health and stockpiled mess that illness won't be as debilitating. \n\nThe other advice is good, always travel with a stockpile of cooked food and water.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Illness was the biggest factor for me starting off. But once I hit the teens and had enough caps to setup a doctor&amp;#39;s station in Sanctuary, I had an easy location to get cured (before it was making the trek from Sanctuary and then Starlight to Diamond City to get cured). Once you hit your twenties, you&amp;#39;ll have enough health and stockpiled mess that illness won&amp;#39;t be as debilitating. &lt;/p&gt;\n\n&lt;p&gt;The other advice is good, always travel with a stockpile of cooked food and water.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb1cke", "score_hidden": false, "stickied": false, "created": 1492312396.0, "created_utc": 1492283596.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb31n4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ares6", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "My top tip. Get an auto save mod. The game can crash, your power can go out, you can walk a long way and die wasting 30 minutes. It dordny matter the point is it's worth it. \n\nNow get a mod to enable console commands and edit the timescales. Or you can get the NAC mod and edit it from the holotape menu. \n\nCollect empty bottles and fill it with water from water sources, farm and collect razorgrain. Now you can make noodles, it fulfilles thirst and hunger. \n\nIf you can scrap enough stuff build the  water purifrr in your settlement you only need one. It'll automatically fill your settlement inventory with purified water. Now you never have to worry about water cause you'll get tons. \n\nUse sneak mode a lot. It'll tell you if there are enemies nearby. Also it does more damage when you attack. \n\nPick your fights wisely. \n\nStrength, endurance and charisma are so important. \n\nWhen you first start, getting to diamond city will be hell. Everything can kill you. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My top tip. Get an auto save mod. The game can crash, your power can go out, you can walk a long way and die wasting 30 minutes. It dordny matter the point is it&amp;#39;s worth it. &lt;/p&gt;\n\n&lt;p&gt;Now get a mod to enable console commands and edit the timescales. Or you can get the NAC mod and edit it from the holotape menu. &lt;/p&gt;\n\n&lt;p&gt;Collect empty bottles and fill it with water from water sources, farm and collect razorgrain. Now you can make noodles, it fulfilles thirst and hunger. &lt;/p&gt;\n\n&lt;p&gt;If you can scrap enough stuff build the  water purifrr in your settlement you only need one. It&amp;#39;ll automatically fill your settlement inventory with purified water. Now you never have to worry about water cause you&amp;#39;ll get tons. &lt;/p&gt;\n\n&lt;p&gt;Use sneak mode a lot. It&amp;#39;ll tell you if there are enemies nearby. Also it does more damage when you attack. &lt;/p&gt;\n\n&lt;p&gt;Pick your fights wisely. &lt;/p&gt;\n\n&lt;p&gt;Strength, endurance and charisma are so important. &lt;/p&gt;\n\n&lt;p&gt;When you first start, getting to diamond city will be hell. Everything can kill you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb31n4", "score_hidden": false, "stickied": false, "created": 1492314657.0, "created_utc": 1492285857.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb3mye", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kaarous", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Do NOT go Cannibal.  From the information available to you in game, you might think \"hey I can eat people, so I won't have to worry about food.\"  \n\nNope.  It gives you a debuff that makes you only able to satiate hunger from corpses, and you have to eat frequently.  It pretty much turns you into a serial killer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do NOT go Cannibal.  From the information available to you in game, you might think &amp;quot;hey I can eat people, so I won&amp;#39;t have to worry about food.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;Nope.  It gives you a debuff that makes you only able to satiate hunger from corpses, and you have to eat frequently.  It pretty much turns you into a serial killer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb3mye", "score_hidden": false, "stickied": false, "created": 1492315480.0, "created_utc": 1492286680.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb7c1g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Agrippa911", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "True dat. I just keep forgetting about place. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True dat. I just keep forgetting about place. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb7c1g", "score_hidden": false, "stickied": false, "created": 1492320568.0, "created_utc": 1492291768.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgbbbd7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Xiccarph", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Search this reddit for the term \"survival tips\" and you will find a dozen or more posts with them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Search this reddit for the term &amp;quot;survival tips&amp;quot; and you will find a dozen or more posts with them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgbbbd7", "score_hidden": false, "stickied": false, "created": 1492326234.0, "created_utc": 1492297434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgbg8th", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "number__ten", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Save any kind of empty glass bottle. This includes colored bottles, Nuka cola bottles, milk bottles, etc. You can fill them (or drink) at any of hose run of the mill blue water pumps at your settlements. You can also add drinking fountains to your settlements to fill or drink from. Refreshing beverages are super useful if you have the resources to make them since they fix thirst and cure rads. Mirelurk omelets are the best bang for the weight when it comes to food. Install a decontamination arch at your settlements. Make sure your settlements are well defended so that you don't have to keep running around the map to protect them. Only carry ammo for what you need since it now weighs something. Fusion cores are ridiculously heavy so only carry one at a time. Utilize the companion carry weight bug that let's them carry any amount (tell them to pick things up instead of trading to them-they never run out of capacity). This can be particularly useful because you can cover your companions in heavy armor and have them mule huge hauls until you hit vendors. Stick with the railroad long enough to get ballistic weave. You will probably want to wait until you are up to level 20-25 to attempt to approach downtown Boston though as you will die instantly otherwise. A lot. Focus your gun skills on one or two things max. Pistol/semi auto rifle is a good combo because you won't carry a ton of ammo and the guns aren't too heavy. Get chemist 1 because that will let you make antibiotics. Grow corn, mutfruit, carrots, and razorgrain. This lets you make various soups as well as adhesive.\n\nIf you are planning on modding I highly recommend one of the mods that allows you to craft a sleeping bag that you can carry and place wherever. Having to find mattresses got a little annoying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Save any kind of empty glass bottle. This includes colored bottles, Nuka cola bottles, milk bottles, etc. You can fill them (or drink) at any of hose run of the mill blue water pumps at your settlements. You can also add drinking fountains to your settlements to fill or drink from. Refreshing beverages are super useful if you have the resources to make them since they fix thirst and cure rads. Mirelurk omelets are the best bang for the weight when it comes to food. Install a decontamination arch at your settlements. Make sure your settlements are well defended so that you don&amp;#39;t have to keep running around the map to protect them. Only carry ammo for what you need since it now weighs something. Fusion cores are ridiculously heavy so only carry one at a time. Utilize the companion carry weight bug that let&amp;#39;s them carry any amount (tell them to pick things up instead of trading to them-they never run out of capacity). This can be particularly useful because you can cover your companions in heavy armor and have them mule huge hauls until you hit vendors. Stick with the railroad long enough to get ballistic weave. You will probably want to wait until you are up to level 20-25 to attempt to approach downtown Boston though as you will die instantly otherwise. A lot. Focus your gun skills on one or two things max. Pistol/semi auto rifle is a good combo because you won&amp;#39;t carry a ton of ammo and the guns aren&amp;#39;t too heavy. Get chemist 1 because that will let you make antibiotics. Grow corn, mutfruit, carrots, and razorgrain. This lets you make various soups as well as adhesive.&lt;/p&gt;\n\n&lt;p&gt;If you are planning on modding I highly recommend one of the mods that allows you to craft a sleeping bag that you can carry and place wherever. Having to find mattresses got a little annoying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgbg8th", "score_hidden": false, "stickied": false, "created": 1492333244.0, "created_utc": 1492304444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgby1vk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "huffpuff1337", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Make sure you hoard empty bottles. Nuka Cola, milk, beer, anything. Then fill them up at a CLEAN water source (i.e. water pump) for some easy purified water.\n\nAlso, Chemist rank 2 allows you to craft antibiotics which can cure illnesses without having to go to a doctor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make sure you hoard empty bottles. Nuka Cola, milk, beer, anything. Then fill them up at a CLEAN water source (i.e. water pump) for some easy purified water.&lt;/p&gt;\n\n&lt;p&gt;Also, Chemist rank 2 allows you to craft antibiotics which can cure illnesses without having to go to a doctor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgby1vk", "score_hidden": false, "stickied": false, "created": 1492371458.0, "created_utc": 1492342658.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgc5t1j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Just_a_NCR_Trooper", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Don't use shotguns. The shells weigh too much. \n\nBuild a water pump at every settlement you can, and collect empty bottles to fill them up. \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t use shotguns. The shells weigh too much. &lt;/p&gt;\n\n&lt;p&gt;Build a water pump at every settlement you can, and collect empty bottles to fill them up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgc5t1j", "score_hidden": false, "stickied": false, "created": 1492385877.0, "created_utc": 1492357077.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgc891d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tsarnie1", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Definitely have to invest in your weapons and armor for survival. \n\nAlso, fusion cores (for power armor) degrade a lot faster than in normal difficulty and way a lot, so use your power armor very very wisely. (I recommend getting 9 ranks in intelligence and getting the perk that slows down the decay). \n\nOberland Station and Hangman Alley make good base of operations early on. \n\nYou actually should go hunting and look for radstags although mirelurks+eggs make good food too. Cooked meats will full you up more than potato crisps.  \n\nBe sure to set up supply chains between your settlements so you aren't constantly running across the wasteland. \n\nSAVE OFTEN. If you see the chance to sleep anywhere, take it, especially in dungeons. \n\nYou don't need to carry more than 100 rounds for any semi automatic weapon. Scavenger is also a life send (chance to find 4 fusion core) and you can pretty much self sustain off that. \n\nDon't be afraid to go back to cleared areas and loot them. It may take four trips but it's worth it. \n\nDon't be a slave to your quest book. Explore, there is a lot out there, and take it slow (think Dark Souls). \n\nChemistry perk is invaluable. Refreshing Beverage and Antibiotic crafting will save you. \n\nWatch out for traps. \n\nMoltovs and most explosives can one shot you. Shoot them in VATS. \n\nDrugs are your friends. \n\nTry to not use stimpacks and radaway and instead use food to heal yourself (or nukacolas).\n\nPraise the Sun", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely have to invest in your weapons and armor for survival. &lt;/p&gt;\n\n&lt;p&gt;Also, fusion cores (for power armor) degrade a lot faster than in normal difficulty and way a lot, so use your power armor very very wisely. (I recommend getting 9 ranks in intelligence and getting the perk that slows down the decay). &lt;/p&gt;\n\n&lt;p&gt;Oberland Station and Hangman Alley make good base of operations early on. &lt;/p&gt;\n\n&lt;p&gt;You actually should go hunting and look for radstags although mirelurks+eggs make good food too. Cooked meats will full you up more than potato crisps.  &lt;/p&gt;\n\n&lt;p&gt;Be sure to set up supply chains between your settlements so you aren&amp;#39;t constantly running across the wasteland. &lt;/p&gt;\n\n&lt;p&gt;SAVE OFTEN. If you see the chance to sleep anywhere, take it, especially in dungeons. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need to carry more than 100 rounds for any semi automatic weapon. Scavenger is also a life send (chance to find 4 fusion core) and you can pretty much self sustain off that. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be afraid to go back to cleared areas and loot them. It may take four trips but it&amp;#39;s worth it. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be a slave to your quest book. Explore, there is a lot out there, and take it slow (think Dark Souls). &lt;/p&gt;\n\n&lt;p&gt;Chemistry perk is invaluable. Refreshing Beverage and Antibiotic crafting will save you. &lt;/p&gt;\n\n&lt;p&gt;Watch out for traps. &lt;/p&gt;\n\n&lt;p&gt;Moltovs and most explosives can one shot you. Shoot them in VATS. &lt;/p&gt;\n\n&lt;p&gt;Drugs are your friends. &lt;/p&gt;\n\n&lt;p&gt;Try to not use stimpacks and radaway and instead use food to heal yourself (or nukacolas).&lt;/p&gt;\n\n&lt;p&gt;Praise the Sun&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgc891d", "score_hidden": false, "stickied": false, "created": 1492389175.0, "created_utc": 1492360375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgcfxko", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sinister_One_920", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "As soon as you have the necessary materials, build a Decontamination Arch at your settlements. When powered on, it removes 100% radiation. \n\nSet up a medical store at every settlement. Even the lowest level one will cure your illnesses, addictions and heal you 100% for a very low amount of bottle caps.\n\nIdiot Savant perk randomly grants you 3x the amount of xp for anything. Leveled up it grants 5x xp. The lower your Intelligence is, the more frequently it will proc. \n\nSunshine Tidings Co-op has a magazine that permanently doubles the amount of meat you get from killing animals/bugs. \n\nVault 83 vendor sells the Overseer's Guardian (Two Shot rifle). Very useful, especially early on. Yes, it is expensive. Bring lots of stuff to sell like extra purified waters and chems. When you get to the vendor, use Grape Mentats and Beer to boost your charisma which lowers the vendor prices. I had mine boosted to 15 when I bought it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As soon as you have the necessary materials, build a Decontamination Arch at your settlements. When powered on, it removes 100% radiation. &lt;/p&gt;\n\n&lt;p&gt;Set up a medical store at every settlement. Even the lowest level one will cure your illnesses, addictions and heal you 100% for a very low amount of bottle caps.&lt;/p&gt;\n\n&lt;p&gt;Idiot Savant perk randomly grants you 3x the amount of xp for anything. Leveled up it grants 5x xp. The lower your Intelligence is, the more frequently it will proc. &lt;/p&gt;\n\n&lt;p&gt;Sunshine Tidings Co-op has a magazine that permanently doubles the amount of meat you get from killing animals/bugs. &lt;/p&gt;\n\n&lt;p&gt;Vault 83 vendor sells the Overseer&amp;#39;s Guardian (Two Shot rifle). Very useful, especially early on. Yes, it is expensive. Bring lots of stuff to sell like extra purified waters and chems. When you get to the vendor, use Grape Mentats and Beer to boost your charisma which lowers the vendor prices. I had mine boosted to 15 when I bought it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgcfxko", "score_hidden": false, "stickied": false, "created": 1492399327.0, "created_utc": 1492370527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tzv4", "removal_reason": null, "link_id": "t3_65knd4", "likes": null, "replies": "", "user_reports": [], "id": "dgb2bga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cynical_Cyclist", "parent_id": "t3_65knd4", "subreddit_name_prefixed": "r/fo4", "controversiality": 0, "body": "Build basic settlements. Few beds, general store, farmer with mutfruit, biggest water pump. 4 heavy turrets min. Maybe store ammo in workbenches, even not shared it's still nice to stock up close by.\n\nStealth, Overseers Guardian, ballistic weave. Spend level up points only where needed, levelling up is slower. Pick your fights. If on pc or don't care about console achievements, Unofficial Patch is glorious leader of mods.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Build basic settlements. Few beds, general store, farmer with mutfruit, biggest water pump. 4 heavy turrets min. Maybe store ammo in workbenches, even not shared it&amp;#39;s still nice to stock up close by.&lt;/p&gt;\n\n&lt;p&gt;Stealth, Overseers Guardian, ballistic weave. Spend level up points only where needed, levelling up is slower. Pick your fights. If on pc or don&amp;#39;t care about console achievements, Unofficial Patch is glorious leader of mods.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fo4", "name": "t1_dgb2bga", "score_hidden": false, "stickied": false, "created": 1492313685.0, "created_utc": 1492284885.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]