[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;this is my first post here. And I&amp;#39;m sorry about the wall of text you&amp;#39;re about to read.&lt;/p&gt;\n\n&lt;p&gt;My sister is a by the book narcissist. My mother, bless her, is an enabler. \nRecently my mother left my Nstep dad after almost 25 years of marriage. She had nowhere to go so she had to stay with nsister. I live in a rental with 5 other people and all the bedrooms are on the top floor, my mom cares for my oldest sister who has severe ceribral palsy and needs a 1st floor bedroom or she would&amp;#39;ve stayed with me.\nNsister has been pretty decent helping my mom get set up with a rental house, get moved in, etc. Like I was becoming impressed with her &amp;quot;selflessness&amp;quot;. She has my mom, disabled sister, step sister, and step sister&amp;#39;s kids all living in her house. And was relatively nice...for a few weeks. You know, really raking in those favors she was doing them to hold them over their heads until they die. \nAlong with this she had been demanding all mine and my fiancés free time. Every weekend. When asked to finish getting them all moved in, i was met with- No we can&amp;#39;t move the beds into the rental house! We have to unpack literally every box in this house before mom moves in! YOU MADE A PLAN???? HOW CAN YOU BE SUCH A HORRIBLE SELFISH PERSON?! this has gone on for a month. Fiance and I had made plans to spend two days together, he took off work just for me and it was hard as this is their busy season. She catches wind of it and boop I&amp;#39;m a lousy terrible person for even thinking of spending time not helping my poor mother (who has said she didn&amp;#39;t need help). \nSo the weekend before last she&amp;#39;s crying, screaming, just miserable- she needs these people out of her house. I tell her, hey why don&amp;#39;t we get the beds moved into the house the next weekend when her fiance is back from the oilfield and they can move into the house they&amp;#39;ve had for a month? Oh no we can&amp;#39;t do that, they are taking a trip to the beach. They&amp;#39;ll just have to wait to move into the house they have already been paying for for one more week.&lt;/p&gt;\n\n&lt;p&gt;So flash forward to that weekend. It&amp;#39;s Friday night, I haven&amp;#39;t really talked to her. I&amp;#39;ve talked to my mom, Saturday morning they are all going to my nephews soccer game and then when that&amp;#39;s over they are leaving for the beach. OK perfect, I can make plans! Not so fast!!! Again, Friday night, I get a call from nsister &amp;quot;what time are you coming over to move the beds tomorrow?&amp;quot; - what are you talking about, you&amp;#39;re going to the beach, you said we wouldn&amp;#39;t do this until next weekend? - &amp;quot;no you&amp;#39;re coming over tomorrow morning. I need them out of my house. What time are you gonna be here. I need you here as early as possible&amp;quot; - I made plans, but I guess I can be there like around 10. - &amp;quot;no. Not around 10. I need an exact time. What time will you be here.&amp;quot; - like I said, I guess around 10 am. I mean, we didn&amp;#39;t really plan on being there since you&amp;#39;re going to the beach. -&amp;quot;no. With you and fiance around 10 is noon and I need you here as early as possible. We&amp;#39;re not going to the beach until five. You&amp;#39;re coming over early and helping&amp;quot; she then went into a tirade about how stupid, lazy, unhelpful, etc I apparently am. Then she threatened to find someone who was less lazy and whatever insert here insult that I am to help and to just forget about it. While screaming, swearing, acting absolutely crazy.&lt;/p&gt;\n\n&lt;p&gt;So I said,  cool.  Have fun.  And I hung up.  Of course I knew she wanted me to beg to help but her verbal abuse at this point was just too much for me to deal with. If she wanted to call me horrible names and scream in my ear, she could do this herself. I had given up the last 4 weekends  and the last weekend I still don&amp;#39;t understand what I was needed for as all we did was sort the kids toys- something that couldve been done anytime.&lt;/p&gt;\n\n&lt;p&gt;So i ignore calls and abusive texts about what a terrible daughter I am. How selfish I am. Etc etc etc.&lt;/p&gt;\n\n&lt;p&gt;Sunday, after they get back from the beach she messages me on snap chat that I&amp;#39;m the laziest, most worthless person ever. She wants nothing to do with me and she&amp;#39;s never talking to me again. (I respond &amp;quot;fucking finally&amp;quot; because I&amp;#39;ve been trying to drop her abusive self from my life since adulthood) apparently I&amp;#39;m no longer family to her and she&amp;#39;s disowning me as a sister. Then she blocked me on all social media.&lt;/p&gt;\n\n&lt;p&gt;Guys, I think I might be free. I&amp;#39;ve never been so relieved. (As for my mother, my sister has already started using the &amp;quot;kindness&amp;quot; of helping her as a weapon.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "this is my first post here. And I'm sorry about the wall of text you're about to read.\n\n My sister is a by the book narcissist. My mother, bless her, is an enabler. \nRecently my mother left my Nstep dad after almost 25 years of marriage. She had nowhere to go so she had to stay with nsister. I live in a rental with 5 other people and all the bedrooms are on the top floor, my mom cares for my oldest sister who has severe ceribral palsy and needs a 1st floor bedroom or she would've stayed with me.\nNsister has been pretty decent helping my mom get set up with a rental house, get moved in, etc. Like I was becoming impressed with her \"selflessness\". She has my mom, disabled sister, step sister, and step sister's kids all living in her house. And was relatively nice...for a few weeks. You know, really raking in those favors she was doing them to hold them over their heads until they die. \nAlong with this she had been demanding all mine and my fiancés free time. Every weekend. When asked to finish getting them all moved in, i was met with- No we can't move the beds into the rental house! We have to unpack literally every box in this house before mom moves in! YOU MADE A PLAN???? HOW CAN YOU BE SUCH A HORRIBLE SELFISH PERSON?! this has gone on for a month. Fiance and I had made plans to spend two days together, he took off work just for me and it was hard as this is their busy season. She catches wind of it and boop I'm a lousy terrible person for even thinking of spending time not helping my poor mother (who has said she didn't need help). \nSo the weekend before last she's crying, screaming, just miserable- she needs these people out of her house. I tell her, hey why don't we get the beds moved into the house the next weekend when her fiance is back from the oilfield and they can move into the house they've had for a month? Oh no we can't do that, they are taking a trip to the beach. They'll just have to wait to move into the house they have already been paying for for one more week.\n\nSo flash forward to that weekend. It's Friday night, I haven't really talked to her. I've talked to my mom, Saturday morning they are all going to my nephews soccer game and then when that's over they are leaving for the beach. OK perfect, I can make plans! Not so fast!!! Again, Friday night, I get a call from nsister \"what time are you coming over to move the beds tomorrow?\" - what are you talking about, you're going to the beach, you said we wouldn't do this until next weekend? - \"no you're coming over tomorrow morning. I need them out of my house. What time are you gonna be here. I need you here as early as possible\" - I made plans, but I guess I can be there like around 10. - \"no. Not around 10. I need an exact time. What time will you be here.\" - like I said, I guess around 10 am. I mean, we didn't really plan on being there since you're going to the beach. -\"no. With you and fiance around 10 is noon and I need you here as early as possible. We're not going to the beach until five. You're coming over early and helping\" she then went into a tirade about how stupid, lazy, unhelpful, etc I apparently am. Then she threatened to find someone who was less lazy and whatever insert here insult that I am to help and to just forget about it. While screaming, swearing, acting absolutely crazy.\n\nSo I said,  cool.  Have fun.  And I hung up.  Of course I knew she wanted me to beg to help but her verbal abuse at this point was just too much for me to deal with. If she wanted to call me horrible names and scream in my ear, she could do this herself. I had given up the last 4 weekends  and the last weekend I still don't understand what I was needed for as all we did was sort the kids toys- something that couldve been done anytime.\n\nSo i ignore calls and abusive texts about what a terrible daughter I am. How selfish I am. Etc etc etc.\n\nSunday, after they get back from the beach she messages me on snap chat that I'm the laziest, most worthless person ever. She wants nothing to do with me and she's never talking to me again. (I respond \"fucking finally\" because I've been trying to drop her abusive self from my life since adulthood) apparently I'm no longer family to her and she's disowning me as a sister. Then she blocked me on all social media.\n\nGuys, I think I might be free. I've never been so relieved. (As for my mother, my sister has already started using the \"kindness\" of helping her as a weapon.)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qxsw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 144, "report_reasons": null, "author": "manny_bee", "saved": false, "mod_reports": [], "name": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/64qxsw/nsister_cutting_me_off_finally/", "num_reports": null, "locked": false, "stickied": false, "created": 1491947598.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/64qxsw/nsister_cutting_me_off_finally/", "author_flair_text": null, "quarantine": false, "title": "Nsister cutting me off- FINALLY", "created_utc": 1491918798.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 144}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4fvv1", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "throwawaynation-", "parent_id": "t1_dg4aakx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "**when they can no longer control the victim, they'll attempt to control the narrative**\n\n\nOf course she's running a smear campaign! Stay strong! \n\n\nI'm glad to hear you found happiness in your FOC", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;when they can no longer control the victim, they&amp;#39;ll attempt to control the narrative&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Of course she&amp;#39;s running a smear campaign! Stay strong! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad to hear you found happiness in your FOC&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4fvv1", "score_hidden": false, "stickied": false, "created": 1491954514.0, "created_utc": 1491925714.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4aakx", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "manny_bee", "parent_id": "t1_dg4a2ej", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She is. If it wasn't for my fiance I'd probably continue to give into her, but he just can't deal with it anymore. I know she's probably telling everyone withing earshot how terrible I am, but I've severed a lot of family ties in the last few years so I'm not too upset about it. They can think whatever they want about me. I'm happy with my chosen family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is. If it wasn&amp;#39;t for my fiance I&amp;#39;d probably continue to give into her, but he just can&amp;#39;t deal with it anymore. I know she&amp;#39;s probably telling everyone withing earshot how terrible I am, but I&amp;#39;ve severed a lot of family ties in the last few years so I&amp;#39;m not too upset about it. They can think whatever they want about me. I&amp;#39;m happy with my chosen family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4aakx", "score_hidden": false, "stickied": false, "created": 1491947996.0, "created_utc": 1491919196.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4ejnr", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "NorthOfUptownChi", "parent_id": "t1_dg4a2ej", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I love the phrase \"The trash took itself out.\" Ha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love the phrase &amp;quot;The trash took itself out.&amp;quot; Ha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4ejnr", "score_hidden": false, "stickied": false, "created": 1491953027.0, "created_utc": 1491924227.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4a2ej", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "throwawaynation-", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Your nsister sounds psychotic \n\nThe trash took itself out\n\nCongratulations! \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your nsister sounds psychotic &lt;/p&gt;\n\n&lt;p&gt;The trash took itself out&lt;/p&gt;\n\n&lt;p&gt;Congratulations! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4a2ej", "score_hidden": false, "stickied": false, "created": 1491947701.0, "created_utc": 1491918901.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4deum", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Ericplumrose", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "If she's​ blocked you on social media you need to block her back so she can't spy on you or decide to honour you by coming back into your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she&amp;#39;s​ blocked you on social media you need to block her back so she can&amp;#39;t spy on you or decide to honour you by coming back into your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4deum", "score_hidden": false, "stickied": false, "created": 1491951744.0, "created_utc": 1491922944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4icjy", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "manny_bee", "parent_id": "t1_dg4i3cf", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's what my fiance said. He's pretty adamant about us never having anything to do with her again. He's never had to deal with a N and my family is full of them. He's helped me realize this isn't normal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what my fiance said. He&amp;#39;s pretty adamant about us never having anything to do with her again. He&amp;#39;s never had to deal with a N and my family is full of them. He&amp;#39;s helped me realize this isn&amp;#39;t normal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4icjy", "score_hidden": false, "stickied": false, "created": 1491957211.0, "created_utc": 1491928411.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4i3cf", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "itsmeplumcake", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Be careful, your nsister may try to rope you back into this drama.  Stand firm and don't back down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be careful, your nsister may try to rope you back into this drama.  Stand firm and don&amp;#39;t back down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4i3cf", "score_hidden": false, "stickied": false, "created": 1491956925.0, "created_utc": 1491928125.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4i7ru", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Dracomax", "parent_id": "t1_dg4hni3", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Even if you did genuinely feel a desire to help, though, why on Earth would you *beg* for the privilege?\n\nIt's the kind of thing Ns expect, where they think that since they are the most important people in the world, helping them is a treat, I guess? In a non-N environment, Outside of Intern work, the idea is ludicrous. \n\nAnd if you don't want to do it anyway, the only real response is really what you did. and possibly ribald laughter, finger pointing, and possibly knee-slapping. It's the only response to such a ridiculous joke.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if you did genuinely feel a desire to help, though, why on Earth would you &lt;em&gt;beg&lt;/em&gt; for the privilege?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s the kind of thing Ns expect, where they think that since they are the most important people in the world, helping them is a treat, I guess? In a non-N environment, Outside of Intern work, the idea is ludicrous. &lt;/p&gt;\n\n&lt;p&gt;And if you don&amp;#39;t want to do it anyway, the only real response is really what you did. and possibly ribald laughter, finger pointing, and possibly knee-slapping. It&amp;#39;s the only response to such a ridiculous joke.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4i7ru", "score_hidden": false, "stickied": false, "created": 1491957062.0, "created_utc": 1491928262.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hni3", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "manny_bee", "parent_id": "t1_dg4hh18", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It wasn't something I wanted to do in the first place! I wanted to help my mom but she should know by now her very presence makes me miserable. A few times during moving she would say \"it's almost like you don't even want to be here!\"\n...really?? You think?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t something I wanted to do in the first place! I wanted to help my mom but she should know by now her very presence makes me miserable. A few times during moving she would say &amp;quot;it&amp;#39;s almost like you don&amp;#39;t even want to be here!&amp;quot;\n...really?? You think?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4hni3", "score_hidden": false, "stickied": false, "created": 1491956451.0, "created_utc": 1491927651.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hh18", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Dracomax", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;Of course I knew she wanted me to beg to help\n\nI'm guessing Ns don't understand that normal people never do this.\n\nOffer to help? sure. But if you have to beg to do something out of the goodness of your heart, it isn't going to happen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Of course I knew she wanted me to beg to help&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m guessing Ns don&amp;#39;t understand that normal people never do this.&lt;/p&gt;\n\n&lt;p&gt;Offer to help? sure. But if you have to beg to do something out of the goodness of your heart, it isn&amp;#39;t going to happen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4hh18", "score_hidden": false, "stickied": false, "created": 1491956257.0, "created_utc": 1491927457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4gzfq", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "pangalacticcourier", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Good riddance. You're free! Congrats!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good riddance. You&amp;#39;re free! Congrats!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4gzfq", "score_hidden": false, "stickied": false, "created": 1491955723.0, "created_utc": 1491926923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4n5yp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "peri_enitan", "parent_id": "t1_dg4k1qf", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "you know you have the right to just stop communicating with her at all right? You can block her number, fb, whatsapp thingymojaggy and simply live your life. Your call of course but I think some boundaries and grey rocking if not outright NC from your end might help you. Either way all the best!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you know you have the right to just stop communicating with her at all right? You can block her number, fb, whatsapp thingymojaggy and simply live your life. Your call of course but I think some boundaries and grey rocking if not outright NC from your end might help you. Either way all the best!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4n5yp", "score_hidden": false, "stickied": false, "created": 1491962471.0, "created_utc": 1491933671.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4k1qf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "manny_bee", "parent_id": "t1_dg4jejg", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Honestly, she's probably going to need me sooner rather than later. She's getting married in a  year and I was voluntold that I was a bridesmaid. Even after I told her I didn't want to be in her wedding at all. We'll see if she gets over her anger...I think I'm just going to keep bringing up this fight and how I'm \"no longer family\" to her to keep her angry at me. I like her hating me tbh, my life is calmer when she wants nothing to do with me. (Let's not mention that she picked 2018 as her year to get married when she got engaged in 2015,  after I chose 9/9/18 way before I was officially engaged on 4/4/16 ...but that's just what I expected and apparently being upset about it makes me a selfish bitch)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, she&amp;#39;s probably going to need me sooner rather than later. She&amp;#39;s getting married in a  year and I was voluntold that I was a bridesmaid. Even after I told her I didn&amp;#39;t want to be in her wedding at all. We&amp;#39;ll see if she gets over her anger...I think I&amp;#39;m just going to keep bringing up this fight and how I&amp;#39;m &amp;quot;no longer family&amp;quot; to her to keep her angry at me. I like her hating me tbh, my life is calmer when she wants nothing to do with me. (Let&amp;#39;s not mention that she picked 2018 as her year to get married when she got engaged in 2015,  after I chose 9/9/18 way before I was officially engaged on 4/4/16 ...but that&amp;#39;s just what I expected and apparently being upset about it makes me a selfish bitch)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4k1qf", "score_hidden": false, "stickied": false, "created": 1491959059.0, "created_utc": 1491930259.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jejg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "peri_enitan", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "my exfather disowned me too. After 2 years completely out of the blue he suddenly stood in my room while I was sleeping, wanting to talk. I hope your \"sister\" doesn't find any obscure need for a doormat to call on you anytime soon but I don't take their promises as far as I can throw them. Best of luck with your new drama free live!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;my exfather disowned me too. After 2 years completely out of the blue he suddenly stood in my room while I was sleeping, wanting to talk. I hope your &amp;quot;sister&amp;quot; doesn&amp;#39;t find any obscure need for a doormat to call on you anytime soon but I don&amp;#39;t take their promises as far as I can throw them. Best of luck with your new drama free live!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4jejg", "score_hidden": false, "stickied": false, "created": 1491958359.0, "created_utc": 1491929559.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4egsg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AerisaFoxFeather", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Hope you mom and siblings managed to get out of there without too much trouble! Your sister sounds nasty", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hope you mom and siblings managed to get out of there without too much trouble! Your sister sounds nasty&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4egsg", "score_hidden": false, "stickied": false, "created": 1491952940.0, "created_utc": 1491924140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg5bddd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "manny_bee", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Omg yall. This happened Sunday night and she just now tried to call me. I rejected the call, but still. I'm just over here laughing about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Omg yall. This happened Sunday night and she just now tried to call me. I rejected the call, but still. I&amp;#39;m just over here laughing about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5bddd", "score_hidden": false, "stickied": false, "created": 1491991797.0, "created_utc": 1491962997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg4txe5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vavamama", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "My NSis used to call and dissect my personality using much of the same verbiage as yours.  She initiated NC 8 years ago, thankfully! Nobody deserves to be dumped on that way, it felt awful. Another thing I don't miss!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My NSis used to call and dissect my personality using much of the same verbiage as yours.  She initiated NC 8 years ago, thankfully! Nobody deserves to be dumped on that way, it felt awful. Another thing I don&amp;#39;t miss!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4txe5", "score_hidden": false, "stickied": false, "created": 1491969769.0, "created_utc": 1491940969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64qxsw", "likes": null, "replies": "", "user_reports": [], "id": "dg5lc9d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jaded_as_a_gem", "parent_id": "t3_64qxsw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "be sure to block her back!!! she may try to love bomb you, guilt trip you, harass you, or snoop on you (depending on which social media you mean, like facebook unfriends as it blocks and she couldnt unblock and re-block for like 48 hours or something. but other platforms are different of course)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;be sure to block her back!!! she may try to love bomb you, guilt trip you, harass you, or snoop on you (depending on which social media you mean, like facebook unfriends as it blocks and she couldnt unblock and re-block for like 48 hours or something. but other platforms are different of course)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5lc9d", "score_hidden": false, "stickied": false, "created": 1492009609.0, "created_utc": 1491980809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]