[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone! I&amp;#39;ve just recently found this sub and I&amp;#39;m not sure yet if my mother is a narcissist. She does some of the things that narcissists do, but not all of them. I&amp;#39;m posting here to get some advice. &lt;/p&gt;\n\n&lt;p&gt;When I was 9 my father died. It was tough for my mother and I because we were all alone. Money was never an issue though. My mom had a good job that paid well and some apartments that she rented out too. I was going to a private school, she was buying luxury items, we had money. I know that now. But back then, I hadn&amp;#39;t realized how things worked and I was very afraid that we wouldn&amp;#39;t have enough money since dad wasn&amp;#39;t there anymore. My mom always told me it would be ok.&lt;/p&gt;\n\n&lt;p&gt;Then, when I was 10, we decided to go on a trip with some friends. I remember specifically my mom saying to me that if I wanted us to go I would have to give her my savings (about 1000 euros) so we would have enough money to afford this trip, because she could only afford half of the cost on her own. Now, I was ten, I didn&amp;#39;t have anything better to do with the money, I said yes, we went, we had a great time.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t think much of it until recently. I was having a conversation with my mother and she ended up telling me how much of a bad parent her brother is because he didn&amp;#39;t invest in his kids traveling abroad and how much of a good mother she is because she never thought of the money when it came to traveling and expanding horizons. As 99% of our conversations end up in the topic of how someone is a bad parent and how she is a great parent, I wasn&amp;#39;t paying much attention. I casually answered &amp;quot;well you did think of the money. You made me pay 1000 euros for that trip when I was 10.&amp;quot; to which she looked at me shocked and then answered &amp;quot;oh yeah? I don&amp;#39;t think so, I don&amp;#39;t remember that&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Honestly, I wouldn&amp;#39;t have given it much thought if it wasn&amp;#39;t for her response. I&amp;#39;m a 22 year old woman and it felt like she completely invalidated my memories because they didn&amp;#39;t fit into her being the perfect mom. Because that&amp;#39;s the most important. That&amp;#39;s what she always brags about. She brags about me being a good student because of the way she taught me to do my homework and she brags that I love reading books because she gave me a book when I was 6. I mean, she has played a huge role in me turning out pretty good despite the loss of my father and she did raise me on her own. I will forever be grateful for that.&lt;/p&gt;\n\n&lt;p&gt;But she&amp;#39;s not the perfect mother. She is cold and distant and sarcastic, she is cheap when it comes to anything but herself and she just invalidated my argument and my memory as if it didn&amp;#39;t matter. I wouldn&amp;#39;t even think that her making me give her my savings was a bad thing until she reacted the way she did. And that&amp;#39;s not the only time she has taken money from me.&lt;/p&gt;\n\n&lt;p&gt;How do I deal with the way I feel? I feel so angry that she doesn&amp;#39;t acknowledge that this is how things actually happened but I cannot talk to her about it because she acts as if nothing happened. As if I would make such a thing up. Every time I try to express a complain (usually about her controlling behavior) she ends up snapping and crying and telling me that I think she&amp;#39;s the worst mother in the world.&lt;/p&gt;\n\n&lt;p&gt;How do I deal with this? Do you think she is a narcissist?&lt;/p&gt;\n\n&lt;p&gt;Sorry for the long post, I guess I needed to vent.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everyone! I've just recently found this sub and I'm not sure yet if my mother is a narcissist. She does some of the things that narcissists do, but not all of them. I'm posting here to get some advice. \n\nWhen I was 9 my father died. It was tough for my mother and I because we were all alone. Money was never an issue though. My mom had a good job that paid well and some apartments that she rented out too. I was going to a private school, she was buying luxury items, we had money. I know that now. But back then, I hadn't realized how things worked and I was very afraid that we wouldn't have enough money since dad wasn't there anymore. My mom always told me it would be ok.\n\nThen, when I was 10, we decided to go on a trip with some friends. I remember specifically my mom saying to me that if I wanted us to go I would have to give her my savings (about 1000 euros) so we would have enough money to afford this trip, because she could only afford half of the cost on her own. Now, I was ten, I didn't have anything better to do with the money, I said yes, we went, we had a great time.\n\nI didn't think much of it until recently. I was having a conversation with my mother and she ended up telling me how much of a bad parent her brother is because he didn't invest in his kids traveling abroad and how much of a good mother she is because she never thought of the money when it came to traveling and expanding horizons. As 99% of our conversations end up in the topic of how someone is a bad parent and how she is a great parent, I wasn't paying much attention. I casually answered \"well you did think of the money. You made me pay 1000 euros for that trip when I was 10.\" to which she looked at me shocked and then answered \"oh yeah? I don't think so, I don't remember that\".\n\nHonestly, I wouldn't have given it much thought if it wasn't for her response. I'm a 22 year old woman and it felt like she completely invalidated my memories because they didn't fit into her being the perfect mom. Because that's the most important. That's what she always brags about. She brags about me being a good student because of the way she taught me to do my homework and she brags that I love reading books because she gave me a book when I was 6. I mean, she has played a huge role in me turning out pretty good despite the loss of my father and she did raise me on her own. I will forever be grateful for that.\n\nBut she's not the perfect mother. She is cold and distant and sarcastic, she is cheap when it comes to anything but herself and she just invalidated my argument and my memory as if it didn't matter. I wouldn't even think that her making me give her my savings was a bad thing until she reacted the way she did. And that's not the only time she has taken money from me.\n\nHow do I deal with the way I feel? I feel so angry that she doesn't acknowledge that this is how things actually happened but I cannot talk to her about it because she acts as if nothing happened. As if I would make such a thing up. Every time I try to express a complain (usually about her controlling behavior) she ends up snapping and crying and telling me that I think she's the worst mother in the world.\n\nHow do I deal with this? Do you think she is a narcissist?\n\nSorry for the long post, I guess I needed to vent.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Rant/Vent]", "id": "64tpr0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 176, "report_reasons": null, "author": "madamBookworm", "saved": false, "mod_reports": [], "name": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/64tpr0/my_mom_made_me_pay_half_for_a_family_trip_when_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1491973472.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/64tpr0/my_mom_made_me_pay_half_for_a_family_trip_when_i/", "author_flair_text": null, "quarantine": false, "title": "My mom made me pay half for a family trip when I was 10 and now acts like it never happened.", "created_utc": 1491944672.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 176}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg5e7zm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Monyssa", "parent_id": "t1_dg531q6", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I agree! That's not to say OP should necessarily cut her off cold- turkey. I'm sure we can all agree that dealing with them once you realize they are N is helpful in ways. It DOES prolong the emotional hardships, but it also reinforces the idea that the parent is incapable of change and that NC is probably best.\n\nI know the first time I attempted NC, I fell for the N attempts to be sweet and bring me back. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree! That&amp;#39;s not to say OP should necessarily cut her off cold- turkey. I&amp;#39;m sure we can all agree that dealing with them once you realize they are N is helpful in ways. It DOES prolong the emotional hardships, but it also reinforces the idea that the parent is incapable of change and that NC is probably best.&lt;/p&gt;\n\n&lt;p&gt;I know the first time I attempted NC, I fell for the N attempts to be sweet and bring me back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5e7zm", "score_hidden": false, "stickied": false, "created": 1491995795.0, "created_utc": 1491966995.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg531q6", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "reed79", "parent_id": "t1_dg52ba2", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm not going to attack you.  My perspective comes from understanding narcissism.  The only way you can even think of coexisting with a narcissist, with the least amount of conflict, is to placate them, and even then you have ignore, lie, and invalidate yourself to keep the harmony.   You have to exist in their idealized world that is not congruent with reality in many ways, while not disrupting it, or there will be conflict to which you will have no suitable resolution.   \n\n&gt;But presenting a black and white set of options to someone new to this sub seems like it may make it harder on them to make the right call.\n\nI disagree.  At a fundamental level, there is only two options in dealing with a narc. There are coping mechanisms you can use, but those mechanisms all feed into one of the two options, that is placate/ignore narc.  In other words, you have to change from what you would ordinary would do if faced with this type of behavior from a normal person with little to no recourse. \n\nNarcissism is not some kind of on/off switch that you just have to deal with in spurts. It's an ever present condition. ", "edited": 1491952176.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not going to attack you.  My perspective comes from understanding narcissism.  The only way you can even think of coexisting with a narcissist, with the least amount of conflict, is to placate them, and even then you have ignore, lie, and invalidate yourself to keep the harmony.   You have to exist in their idealized world that is not congruent with reality in many ways, while not disrupting it, or there will be conflict to which you will have no suitable resolution.   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But presenting a black and white set of options to someone new to this sub seems like it may make it harder on them to make the right call.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree.  At a fundamental level, there is only two options in dealing with a narc. There are coping mechanisms you can use, but those mechanisms all feed into one of the two options, that is placate/ignore narc.  In other words, you have to change from what you would ordinary would do if faced with this type of behavior from a normal person with little to no recourse. &lt;/p&gt;\n\n&lt;p&gt;Narcissism is not some kind of on/off switch that you just have to deal with in spurts. It&amp;#39;s an ever present condition. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg531q6", "score_hidden": false, "stickied": false, "created": 1491980768.0, "created_utc": 1491951968.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52ba2", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "iamthemorgs", "parent_id": "t1_dg4zs0e", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Not sure if I'm going to get attacked for this opinion but I'll say it anyway.\n\nI'm not sure OPs only options are to either let herself be manipulated or wash her hands of her mother completely. At least not at this point. If her relationship with her mother isn't causing her pain at the moment she doesn't need to walk away. I'd suggest keeping the mother's tendencies in mind and re-evaluating each time she attempts to manipulate or hurt. OP can grey rock if she's not feeling up to jumping into the discussion at that moment and then think it over later when her mother's not around to influence. \n\nI know for a lot of people there are no good memories, or simply not enough good at all in the narcs in their life, but OP specifically said she's not sure if her mother is a narc yet. From what's been told there definitely seem like there are some narc tendencies there, but OP needs to make that call for herself after careful consideration. If OP's mother is a narc, then going LC or NC is up to her, based on her own experiences and her own ability to handle her mother's ways. \n\nI'm not trying to advocate for the narcs in our lives. But presenting a black and white set of options to someone new to this sub seems like it may make it harder on them to make the right call. You can lessen the narcs ability to affect you or influence you without having to cut off all contact, if you feel like there is a reason to keep some form of contact. The last think OP needs to think is that deciding her mother is a narc means having to cut off all contact with her or resign herself to being manipulated/invalidated all the time. Setting boundaries is possible, and OP makes it sound like she still has at least a somewhat decent relationship with her mother that could still be managed in a healthy way.\n\nAgain, I'm not sticking up for any narcs! I'm just not sure of the black/white dynamic your response creates, and think that OP should put considerable thought into exactly how she wants to move forward with her mother. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure if I&amp;#39;m going to get attacked for this opinion but I&amp;#39;ll say it anyway.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure OPs only options are to either let herself be manipulated or wash her hands of her mother completely. At least not at this point. If her relationship with her mother isn&amp;#39;t causing her pain at the moment she doesn&amp;#39;t need to walk away. I&amp;#39;d suggest keeping the mother&amp;#39;s tendencies in mind and re-evaluating each time she attempts to manipulate or hurt. OP can grey rock if she&amp;#39;s not feeling up to jumping into the discussion at that moment and then think it over later when her mother&amp;#39;s not around to influence. &lt;/p&gt;\n\n&lt;p&gt;I know for a lot of people there are no good memories, or simply not enough good at all in the narcs in their life, but OP specifically said she&amp;#39;s not sure if her mother is a narc yet. From what&amp;#39;s been told there definitely seem like there are some narc tendencies there, but OP needs to make that call for herself after careful consideration. If OP&amp;#39;s mother is a narc, then going LC or NC is up to her, based on her own experiences and her own ability to handle her mother&amp;#39;s ways. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not trying to advocate for the narcs in our lives. But presenting a black and white set of options to someone new to this sub seems like it may make it harder on them to make the right call. You can lessen the narcs ability to affect you or influence you without having to cut off all contact, if you feel like there is a reason to keep some form of contact. The last think OP needs to think is that deciding her mother is a narc means having to cut off all contact with her or resign herself to being manipulated/invalidated all the time. Setting boundaries is possible, and OP makes it sound like she still has at least a somewhat decent relationship with her mother that could still be managed in a healthy way.&lt;/p&gt;\n\n&lt;p&gt;Again, I&amp;#39;m not sticking up for any narcs! I&amp;#39;m just not sure of the black/white dynamic your response creates, and think that OP should put considerable thought into exactly how she wants to move forward with her mother. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg52ba2", "score_hidden": false, "stickied": false, "created": 1491979799.0, "created_utc": 1491950999.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg6v6ea", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamBookworm", "parent_id": "t1_dg6uy0o", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I don't feel obligated exactly. I feel that it would be extremely ungrateful of me. Maybe it's a cultural thing. I am from Greece and being close to family is very important to us. That's why we fight all the time. :p", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t feel obligated exactly. I feel that it would be extremely ungrateful of me. Maybe it&amp;#39;s a cultural thing. I am from Greece and being close to family is very important to us. That&amp;#39;s why we fight all the time. :p&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6v6ea", "score_hidden": false, "stickied": false, "created": 1492073280.0, "created_utc": 1492044480.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6uy0o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reed79", "parent_id": "t1_dg6uefh", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;She is my mother and I love her, she raised me on her own and provided for me.\n\nI fell into the trap of loyalty for a long time. The idea that we have an obligation to our parents simply becasue they are our parents is an idea most of us now reject. \n\ni wish you the best. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She is my mother and I love her, she raised me on her own and provided for me.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I fell into the trap of loyalty for a long time. The idea that we have an obligation to our parents simply becasue they are our parents is an idea most of us now reject. &lt;/p&gt;\n\n&lt;p&gt;i wish you the best. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6uy0o", "score_hidden": false, "stickied": false, "created": 1492073013.0, "created_utc": 1492044213.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6uefh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamBookworm", "parent_id": "t1_dg4zs0e", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Thank you so much for your thoughtful response. The thing is, at least at this point, I wouldn't even consider the possibility of not having any contact with my mother. She is my mother and I love her, she raised me on her own and provided for me. I am going to try and be more observant from now on and figure out if she actually is a narcissist. It will be harder for her to guilt trip me too now. I will distance myself from her if necessary though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for your thoughtful response. The thing is, at least at this point, I wouldn&amp;#39;t even consider the possibility of not having any contact with my mother. She is my mother and I love her, she raised me on her own and provided for me. I am going to try and be more observant from now on and figure out if she actually is a narcissist. It will be harder for her to guilt trip me too now. I will distance myself from her if necessary though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6uefh", "score_hidden": false, "stickied": false, "created": 1492072377.0, "created_utc": 1492043577.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4zs0e", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "reed79", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Sounds like it.  \n\nIt seems like things are starting to line up and make sense to you, after being in a fog or a state of ignorance about your mothers behavior.  Almost as if you knew something was wrong, but could not put a finger on it, while doing everything you can to adjust to these personality quirks of your mother.  These realizations are devastating due to the ramifications they've had on you.  \n\nIf your mother is a narcissist, she is broken beyond repair.  Your feelings will always be invalidated at the expense of her needs.  She will always demand you to fit inside her idealized world, which you will always fail at in at least some respects.  \n\nNow that you realized her world is fake, and built upon distortions it will be much harder to conform to that made of fantasy of hers, i.e. she is the perfect mother.  For me, it lasted 37 years.    \n\nI outright ignored the absurdity of my mothers and fathers made of world and accepted their fucked up perceptions of reality that could never be challenged when I was around them, until I could not anymore.  \n\nReally there is two options.  The first one is, continue to conform to her way of thinking, ignoring her inability to take responsibility and allowing her to invalidate you, and allowing her to manipulate you with guilt, and basically living inside this fantasy world where she is perfect.\n\nThe other is to wash your hands of her.    \n\nNeither option is desirable, but its what you have. ", "edited": 1491948068.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like it.  &lt;/p&gt;\n\n&lt;p&gt;It seems like things are starting to line up and make sense to you, after being in a fog or a state of ignorance about your mothers behavior.  Almost as if you knew something was wrong, but could not put a finger on it, while doing everything you can to adjust to these personality quirks of your mother.  These realizations are devastating due to the ramifications they&amp;#39;ve had on you.  &lt;/p&gt;\n\n&lt;p&gt;If your mother is a narcissist, she is broken beyond repair.  Your feelings will always be invalidated at the expense of her needs.  She will always demand you to fit inside her idealized world, which you will always fail at in at least some respects.  &lt;/p&gt;\n\n&lt;p&gt;Now that you realized her world is fake, and built upon distortions it will be much harder to conform to that made of fantasy of hers, i.e. she is the perfect mother.  For me, it lasted 37 years.    &lt;/p&gt;\n\n&lt;p&gt;I outright ignored the absurdity of my mothers and fathers made of world and accepted their fucked up perceptions of reality that could never be challenged when I was around them, until I could not anymore.  &lt;/p&gt;\n\n&lt;p&gt;Really there is two options.  The first one is, continue to conform to her way of thinking, ignoring her inability to take responsibility and allowing her to invalidate you, and allowing her to manipulate you with guilt, and basically living inside this fantasy world where she is perfect.&lt;/p&gt;\n\n&lt;p&gt;The other is to wash your hands of her.    &lt;/p&gt;\n\n&lt;p&gt;Neither option is desirable, but its what you have. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg4zs0e", "score_hidden": false, "stickied": false, "created": 1491976567.0, "created_utc": 1491947767.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg54exj", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "throwawaycommaanothe", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's gaslighting.  The N's invalidate your memory, and expect you to replace your memory with their revised version.  Especially of things that they did that were crappy.  So yeah, of course she made you pay for your half of the vacation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s gaslighting.  The N&amp;#39;s invalidate your memory, and expect you to replace your memory with their revised version.  Especially of things that they did that were crappy.  So yeah, of course she made you pay for your half of the vacation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg54exj", "score_hidden": false, "stickied": false, "created": 1491982622.0, "created_utc": 1491953822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg6um88", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamBookworm", "parent_id": "t1_dg59w71", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Wow that was a lot of money. And she treated you very badly when you confronted her. I am so sorry for that. To be honest, I haven't felt abused by my mother. I think she is a cold and distant woman but I don't remember her ever being abusive towards me. I believe she loves me very much and so does your mother I am sure. They just have their own issues that don't allow them to behave the way they normally would.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow that was a lot of money. And she treated you very badly when you confronted her. I am so sorry for that. To be honest, I haven&amp;#39;t felt abused by my mother. I think she is a cold and distant woman but I don&amp;#39;t remember her ever being abusive towards me. I believe she loves me very much and so does your mother I am sure. They just have their own issues that don&amp;#39;t allow them to behave the way they normally would.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6um88", "score_hidden": false, "stickied": false, "created": 1492072624.0, "created_utc": 1492043824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59w71", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "username_16", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm in a similar situation. I've only just realised I was abused when growing up by my mother. I always knew she was horrible to me but never realised it was a systematic thing of setting me up to fail then making me feel bad about it, or even finding a way to make me feel bad about my achievements. \nWhen I was a teenager my parents were in a bit of a tight spot, the guy who owned my Dad's shop (which was rented) was going to be sold, so they needed to buy the building to keep it going. My mother had a conversation with me about borrowing money from my savings (life-savings, that were accumulated from generous birthday and Christmas cheques from my grandparents) so they could afford it. I was told I'd be paid back, of course. I gave her £7000,which was the vast majority of my money. About a year later I ask when I'm going to get my money back, and my mum angrily tells me that it was her money that she'd only put in my name to avoid tax. It was a lie of course, I knew that. What surprises me more every time I think about it is that if you're going to lie, why choose that one?! \nOf course, I never saw that money again, nor has it ever been mentioned. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in a similar situation. I&amp;#39;ve only just realised I was abused when growing up by my mother. I always knew she was horrible to me but never realised it was a systematic thing of setting me up to fail then making me feel bad about it, or even finding a way to make me feel bad about my achievements. \nWhen I was a teenager my parents were in a bit of a tight spot, the guy who owned my Dad&amp;#39;s shop (which was rented) was going to be sold, so they needed to buy the building to keep it going. My mother had a conversation with me about borrowing money from my savings (life-savings, that were accumulated from generous birthday and Christmas cheques from my grandparents) so they could afford it. I was told I&amp;#39;d be paid back, of course. I gave her £7000,which was the vast majority of my money. About a year later I ask when I&amp;#39;m going to get my money back, and my mum angrily tells me that it was her money that she&amp;#39;d only put in my name to avoid tax. It was a lie of course, I knew that. What surprises me more every time I think about it is that if you&amp;#39;re going to lie, why choose that one?! \nOf course, I never saw that money again, nor has it ever been mentioned. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg59w71", "score_hidden": false, "stickied": false, "created": 1491989828.0, "created_utc": 1491961028.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg5g1y9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Hippymomof6", "parent_id": "t1_dg5fn7u", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "When you said your mom will cry &amp; talk about what a bad mom she is... Classic my mom tactic. When I bring things up to her, I do it so we can talk about it, work through it, &amp; maybe she will realize this was something not cool that hurt me. It never works, however. She without fail will start talking about what a bad mom she is, making me feel bad for bringing it up. Or she will deny it. Or she will say I'm being mean/unfair/treating her like her own crazy mother (who had mental problems of her own, &amp; I'm sure was no picnic to live with). When I explain that this was not my intention, she further twists my words until I leave the conversation feeling like the bad guy. Now I just don't bring stuff up to her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you said your mom will cry &amp;amp; talk about what a bad mom she is... Classic my mom tactic. When I bring things up to her, I do it so we can talk about it, work through it, &amp;amp; maybe she will realize this was something not cool that hurt me. It never works, however. She without fail will start talking about what a bad mom she is, making me feel bad for bringing it up. Or she will deny it. Or she will say I&amp;#39;m being mean/unfair/treating her like her own crazy mother (who had mental problems of her own, &amp;amp; I&amp;#39;m sure was no picnic to live with). When I explain that this was not my intention, she further twists my words until I leave the conversation feeling like the bad guy. Now I just don&amp;#39;t bring stuff up to her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5g1y9", "score_hidden": false, "stickied": false, "created": 1491998649.0, "created_utc": 1491969849.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg6uyrb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamBookworm", "parent_id": "t1_dg5fn7u", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yeah I can't do no contact either. I mean, she has a lot of flaws but I love my mom and I would miss her terribly. Plus, as I mentioned, the woman raised me all on her own and I am a lot of things but ungrateful isn't one. I have my flaws as well and I'm sure I have caused her some distress from time to time. Limiting contact would be ideal for me right now, but unfortunately it is going to be hard. She is very controlling and wants to know where I am at all times. I actually worry when she doesn't call. I have tried to stop that habit of hers but she ends up crying telling me she doesn't ask for much and she has a right to know. It's easier for me to answer the phone and tell her than to have to fight. But I am going to try to. Now that I see the pattern I believe I can handle her better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I can&amp;#39;t do no contact either. I mean, she has a lot of flaws but I love my mom and I would miss her terribly. Plus, as I mentioned, the woman raised me all on her own and I am a lot of things but ungrateful isn&amp;#39;t one. I have my flaws as well and I&amp;#39;m sure I have caused her some distress from time to time. Limiting contact would be ideal for me right now, but unfortunately it is going to be hard. She is very controlling and wants to know where I am at all times. I actually worry when she doesn&amp;#39;t call. I have tried to stop that habit of hers but she ends up crying telling me she doesn&amp;#39;t ask for much and she has a right to know. It&amp;#39;s easier for me to answer the phone and tell her than to have to fight. But I am going to try to. Now that I see the pattern I believe I can handle her better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6uyrb", "score_hidden": false, "stickied": false, "created": 1492073036.0, "created_utc": 1492044236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fn7u", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Hippymomof6", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm trying to decide if my mom is a narc too, so I sympathize with you. From what you've said it does sound like she has some tendencies. I wonder if it's possible for someone to be a little bit narc &amp; a little something else. I'm wondering if this isn't the case with my mom. I understand where you're coming from about wondering what to do about your newfound realization. In my case, I can't do no contact. Someone said if you don't choose this option then you'll just be existing in the narc's world. I guess this is true to a point, but it seems like in mine and your case, where our moms are not full on crazy narcs &amp; just have some tendencies then going full no contact may not be the answer. For me, moving further away and limiting contact has helped a ton with feeling less trapped and controlled. Its also helped me to see that the problem truly is with her, &amp; not me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to decide if my mom is a narc too, so I sympathize with you. From what you&amp;#39;ve said it does sound like she has some tendencies. I wonder if it&amp;#39;s possible for someone to be a little bit narc &amp;amp; a little something else. I&amp;#39;m wondering if this isn&amp;#39;t the case with my mom. I understand where you&amp;#39;re coming from about wondering what to do about your newfound realization. In my case, I can&amp;#39;t do no contact. Someone said if you don&amp;#39;t choose this option then you&amp;#39;ll just be existing in the narc&amp;#39;s world. I guess this is true to a point, but it seems like in mine and your case, where our moms are not full on crazy narcs &amp;amp; just have some tendencies then going full no contact may not be the answer. For me, moving further away and limiting contact has helped a ton with feeling less trapped and controlled. Its also helped me to see that the problem truly is with her, &amp;amp; not me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5fn7u", "score_hidden": false, "stickied": false, "created": 1491997989.0, "created_utc": 1491969189.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg5f47u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "annarchy8", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I am so very sorry that your mother is like that. I am so very sorry you have to deal with all of this shit. You will always be more mature than your mother is capable of being. Keep that in mind. You can try to take the high road and forgive her and try to love her and have a relationship with her while continuing to keep forgiving her and comprising yourself and that may work for you. You can try to grey rock her and become more emotionally distant from her to protect yourself while seeming to appease her, which may work for you. You can try to cut her out of your life while working to repair the damage she has done to you and distancing yourself from her completely so she can't do more damage to you and that may work for you. And there are other options I haven't thought of yet that may work for you. \n\nChoose what works for you and what helps you. Take care of yourself. Get therapy if and when you are ready. That will help. We are here for you, too. Remember that there are always people who understand and believe you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so very sorry that your mother is like that. I am so very sorry you have to deal with all of this shit. You will always be more mature than your mother is capable of being. Keep that in mind. You can try to take the high road and forgive her and try to love her and have a relationship with her while continuing to keep forgiving her and comprising yourself and that may work for you. You can try to grey rock her and become more emotionally distant from her to protect yourself while seeming to appease her, which may work for you. You can try to cut her out of your life while working to repair the damage she has done to you and distancing yourself from her completely so she can&amp;#39;t do more damage to you and that may work for you. And there are other options I haven&amp;#39;t thought of yet that may work for you. &lt;/p&gt;\n\n&lt;p&gt;Choose what works for you and what helps you. Take care of yourself. Get therapy if and when you are ready. That will help. We are here for you, too. Remember that there are always people who understand and believe you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5f47u", "score_hidden": false, "stickied": false, "created": 1491997154.0, "created_utc": 1491968354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg5he7x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "puss_parkerswidow", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "(Edit, removed some words I think were unnecessary)\n\nLots of people display some narcissistic traits. In fact, most people do to some extent. \n\nThe money thing is weird. \n\nMy mom does and says weird shit too, but she isn't horrible or particularly harmful to me these days. I did move thousands of miles away from her and age, so that's been a factor - time and distance. Being near my family when I was younger was very harmful to my well being.\n\nMy mom is more of a has narcissistic traits but isn't full blown narcissistic. \n\nAn actual narcissistic personality pretty much  never displays other traits. Empathy isn't their thing. Others are merely obstacles or tools. \n\nI can't diagnose anyone, because I'm unqualified.\n\n I can tell you my in-laws were toxic people because of how they impacted my life and more importantly, my husband's life. I didn't have to know them for as long as he did, and I was not a vulnerable child when I did meet them.\n\nRead the side bar resources and decide for yourself how toxic your mom may be to you. It doesn't really matter if she's a textbook narcissist or not. What matters is how she impacts your life and what boundaries you need to set for your safety.\n\n", "edited": 1491995746.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Edit, removed some words I think were unnecessary)&lt;/p&gt;\n\n&lt;p&gt;Lots of people display some narcissistic traits. In fact, most people do to some extent. &lt;/p&gt;\n\n&lt;p&gt;The money thing is weird. &lt;/p&gt;\n\n&lt;p&gt;My mom does and says weird shit too, but she isn&amp;#39;t horrible or particularly harmful to me these days. I did move thousands of miles away from her and age, so that&amp;#39;s been a factor - time and distance. Being near my family when I was younger was very harmful to my well being.&lt;/p&gt;\n\n&lt;p&gt;My mom is more of a has narcissistic traits but isn&amp;#39;t full blown narcissistic. &lt;/p&gt;\n\n&lt;p&gt;An actual narcissistic personality pretty much  never displays other traits. Empathy isn&amp;#39;t their thing. Others are merely obstacles or tools. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t diagnose anyone, because I&amp;#39;m unqualified.&lt;/p&gt;\n\n&lt;p&gt;I can tell you my in-laws were toxic people because of how they impacted my life and more importantly, my husband&amp;#39;s life. I didn&amp;#39;t have to know them for as long as he did, and I was not a vulnerable child when I did meet them.&lt;/p&gt;\n\n&lt;p&gt;Read the side bar resources and decide for yourself how toxic your mom may be to you. It doesn&amp;#39;t really matter if she&amp;#39;s a textbook narcissist or not. What matters is how she impacts your life and what boundaries you need to set for your safety.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5he7x", "score_hidden": false, "stickied": false, "created": 1492000983.0, "created_utc": 1491972183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg7n0i0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cherish_Dipp", "parent_id": "t1_dg6vg8i", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "But complains when you spend money of any form on yourself? What if she spends money on what *she wants* but *you need* something?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But complains when you spend money of any form on yourself? What if she spends money on what &lt;em&gt;she wants&lt;/em&gt; but &lt;em&gt;you need&lt;/em&gt; something?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg7n0i0", "score_hidden": false, "stickied": false, "created": 1492123461.0, "created_utc": 1492094661.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vg8i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamBookworm", "parent_id": "t1_dg5z338", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She's definitely weird with money. She likes spending it on herself and I can't blame her for it, it is her money. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s definitely weird with money. She likes spending it on herself and I can&amp;#39;t blame her for it, it is her money. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6vg8i", "score_hidden": false, "stickied": false, "created": 1492073602.0, "created_utc": 1492044802.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5z338", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cherish_Dipp", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "At the *least* N tendencies. She seems to use a lot of the tactics here to get her own way, even attempt to change history. Another N thing she's doing is making your accomplishments, hers. You can inherit certain things from your parents but N's tend to...take the cake, so to speak. I bet if you did anything bad in her eyes, that's you, something you didn't get from her.\n\nWho the fuck gets a 10 year old to pay for a holiday trip to another country? N's always get weird with money.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At the &lt;em&gt;least&lt;/em&gt; N tendencies. She seems to use a lot of the tactics here to get her own way, even attempt to change history. Another N thing she&amp;#39;s doing is making your accomplishments, hers. You can inherit certain things from your parents but N&amp;#39;s tend to...take the cake, so to speak. I bet if you did anything bad in her eyes, that&amp;#39;s you, something you didn&amp;#39;t get from her.&lt;/p&gt;\n\n&lt;p&gt;Who the fuck gets a 10 year old to pay for a holiday trip to another country? N&amp;#39;s always get weird with money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5z338", "score_hidden": false, "stickied": false, "created": 1492037861.0, "created_utc": 1492009061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg5oikz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CSQUITO", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "yh when I was 11 my parents took all of my money and spent it on groceries. It wasn't much, about £500 but they took it all and pretended they would pay it back. I never mentioned it or complained bc I just assumed they had no money. However, now (you might see a post which is like :\"things I realiise were'nt true\", it's clear that they weren't dirt poor or anything.\n\nI have never been paid back. I'm 17, I never get pocket money, and I have never been paid back. On the other hand my younger brother has been allowed to keep all of his money (he's 12 now). He's been made extremely selfish and narcissistic already. We were buying joint birthday presents, and we were spending about £15 on 10 people so not much. He was complaining the whole time because he wanted to buy some game for himslef (£40) and his budget was running out.  Because I literally only had a £20, he paid most of it. \n\nThen he went home crying to my NMum saying that I took all his money. My mum started saying \"how could you do that? You have to pay him back\", as if i took all his money and spent it on drugs or something. I was buying presents for God's sake... including a present for her. \n\nThen I reminded her that I had literally NO MONEY now, and that she could easily pay him back seeing as she had an income, I'm not allowed to work, and I recieve no money from my parents. AND the fact that she took my money 7 yrs ago (that was the first time I mentioned that moeny). \n\nShe paid the money back to my brother so he could buy himself a christmas present, and never paid me back.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yh when I was 11 my parents took all of my money and spent it on groceries. It wasn&amp;#39;t much, about £500 but they took it all and pretended they would pay it back. I never mentioned it or complained bc I just assumed they had no money. However, now (you might see a post which is like :&amp;quot;things I realiise were&amp;#39;nt true&amp;quot;, it&amp;#39;s clear that they weren&amp;#39;t dirt poor or anything.&lt;/p&gt;\n\n&lt;p&gt;I have never been paid back. I&amp;#39;m 17, I never get pocket money, and I have never been paid back. On the other hand my younger brother has been allowed to keep all of his money (he&amp;#39;s 12 now). He&amp;#39;s been made extremely selfish and narcissistic already. We were buying joint birthday presents, and we were spending about £15 on 10 people so not much. He was complaining the whole time because he wanted to buy some game for himslef (£40) and his budget was running out.  Because I literally only had a £20, he paid most of it. &lt;/p&gt;\n\n&lt;p&gt;Then he went home crying to my NMum saying that I took all his money. My mum started saying &amp;quot;how could you do that? You have to pay him back&amp;quot;, as if i took all his money and spent it on drugs or something. I was buying presents for God&amp;#39;s sake... including a present for her. &lt;/p&gt;\n\n&lt;p&gt;Then I reminded her that I had literally NO MONEY now, and that she could easily pay him back seeing as she had an income, I&amp;#39;m not allowed to work, and I recieve no money from my parents. AND the fact that she took my money 7 yrs ago (that was the first time I mentioned that moeny). &lt;/p&gt;\n\n&lt;p&gt;She paid the money back to my brother so he could buy himself a christmas present, and never paid me back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg5oikz", "score_hidden": false, "stickied": false, "created": 1492019218.0, "created_utc": 1491990418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_64tpr0", "likes": null, "replies": "", "user_reports": [], "id": "dg6vlq4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamBookworm", "parent_id": "t1_dg6m4bg", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I was quite surprised and reminded her of some details of our dialogue and of me giving her the money. She acted indifferently. She didn't want to talk about it anymore; she wanted to keep talking about her brother being a bad parent. So she kept doing that and I have been collecting anger ever since.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was quite surprised and reminded her of some details of our dialogue and of me giving her the money. She acted indifferently. She didn&amp;#39;t want to talk about it anymore; she wanted to keep talking about her brother being a bad parent. So she kept doing that and I have been collecting anger ever since.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6vlq4", "score_hidden": false, "stickied": false, "created": 1492073784.0, "created_utc": 1492044984.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m4bg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BigHeroSix1993", "parent_id": "t3_64tpr0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "What did you say to her after she said she didn't remember that ever happening?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What did you say to her after she said she didn&amp;#39;t remember that ever happening?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6m4bg", "score_hidden": false, "stickied": false, "created": 1492062157.0, "created_utc": 1492033357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]