[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Word of &lt;a href=\"https://www.reddit.com/r/TrollXChromosomes/comments/64y63i/jesus_fucking_christ_cosmo/\"&gt;this disgusting Cosmopolitan article&lt;/a&gt; triggered a memory of a &amp;quot;funny&amp;quot; little story about my Nmom. I actually got a lot of this story second-hand from my brother because I have only vague fuzzy recollections of large chunks of it. May I present this small nugget of disgustingly self-serving criminal insanity;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Years ago in the mystical days of the mid &amp;#39;90s, I was a young single parent living in a small apartment. One day I contracted a very serious case of the flu. I had never had the flu before and I had never felt so sick in my entire life. For days I couldn&amp;#39;t keep anything down, not even water. By the time another family member noticed how bad I was (I was delirious and not responding to simple questions) and took me to the hospital, I had lost around 10 pounds and was so severely dehydrated that it could have killed me. What was the reason it took so long for someone to drag me to the hospital? Oh, it&amp;#39;s because NMom told everyone I was faking or over-blowing my illness for attention, and because I was lazy and wanted to lounge in bed all day eating bonbons while she stayed over and took care of me and my daughter like a slave.&lt;/p&gt;\n\n&lt;p&gt;So, my brother thought this sounded fishy. He knew I would not take several days off from work and give over care of my kid to this woman unless it was something serious. He finally came over one evening (she had been talking him out of it) to see how I was doing, insisted on peeking his head into the bedroom (she tried to prevent this) to say hello to me and see if I needed anything, and noticed almost immediately that things were very very bad. He insisted they take me to the ER. She argued long and stridently against this, called me a manipulative hypochondriac, but he was having none of it and half-carried/half-dragged me out to the car while she orbited us like a small and noisy moon. So off to the sterile land of sane and caring people I finally went. &lt;/p&gt;\n\n&lt;p&gt;After a quick stop in the ER where several people asked why we took so long before seeking medical attention, I was admitted and got a nice quiet room and lots of helpful and concerned medical professionals. The next morning, while I was helplessly lying there in bed connected to an IV and in pain, a nurse noticed my mother kept persistently trying to hover and fuss around me (while refusing to wear a mask) and she asked her if she&amp;#39;d had a flu shot yet. My mother&amp;#39;s reply was &lt;em&gt;&amp;quot;No way, I&amp;#39;m actually hoping to catch the bug off her so I can lose a few pounds myself. I&amp;#39;ve been trying for days.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I can only describe that nurse&amp;#39;s reaction as &lt;em&gt;super-ultra-mega-pissed&lt;/em&gt;. She told her that I should have gotten medical attention days ago and that she could have killed me, then very efficiently kicked her right out and (with my complete approval) banned her from seeing me for the rest of my stay. I had some sweet peace and quiet while I recovered.&lt;/p&gt;\n\n&lt;p&gt;And yes, my wonderful momma knew perfectly well how sick I was all along, though she would never ever admit such a thing. I had a fever. I was in such pain that I couldn&amp;#39;t even bear being touched. I vomited when food was so much as &lt;em&gt;mentioned&lt;/em&gt;. I eventually became delirious. When I asked her several times to take me to a doctor she just kept insisting my illness was no big deal, she&amp;#39;d seen it before, and there was nothing to be done but to wait for it to blow over. She actively prevented people from seeing me so that she could stay over my apartment, play the long-suffering martyr while &amp;quot;looking after&amp;quot; me and my child, and try to contract my influenza so that she could lose a few pounds. Well, it didn&amp;#39;t work and she still carries those pounds and more to this day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "*Word of [this disgusting Cosmopolitan article](https://www.reddit.com/r/TrollXChromosomes/comments/64y63i/jesus_fucking_christ_cosmo/) triggered a memory of a \"funny\" little story about my Nmom. I actually got a lot of this story second-hand from my brother because I have only vague fuzzy recollections of large chunks of it. May I present this small nugget of disgustingly self-serving criminal insanity;*\n\nYears ago in the mystical days of the mid '90s, I was a young single parent living in a small apartment. One day I contracted a very serious case of the flu. I had never had the flu before and I had never felt so sick in my entire life. For days I couldn't keep anything down, not even water. By the time another family member noticed how bad I was (I was delirious and not responding to simple questions) and took me to the hospital, I had lost around 10 pounds and was so severely dehydrated that it could have killed me. What was the reason it took so long for someone to drag me to the hospital? Oh, it's because NMom told everyone I was faking or over-blowing my illness for attention, and because I was lazy and wanted to lounge in bed all day eating bonbons while she stayed over and took care of me and my daughter like a slave.\n\nSo, my brother thought this sounded fishy. He knew I would not take several days off from work and give over care of my kid to this woman unless it was something serious. He finally came over one evening (she had been talking him out of it) to see how I was doing, insisted on peeking his head into the bedroom (she tried to prevent this) to say hello to me and see if I needed anything, and noticed almost immediately that things were very very bad. He insisted they take me to the ER. She argued long and stridently against this, called me a manipulative hypochondriac, but he was having none of it and half-carried/half-dragged me out to the car while she orbited us like a small and noisy moon. So off to the sterile land of sane and caring people I finally went. \n\nAfter a quick stop in the ER where several people asked why we took so long before seeking medical attention, I was admitted and got a nice quiet room and lots of helpful and concerned medical professionals. The next morning, while I was helplessly lying there in bed connected to an IV and in pain, a nurse noticed my mother kept persistently trying to hover and fuss around me (while refusing to wear a mask) and she asked her if she'd had a flu shot yet. My mother's reply was *\"No way, I'm actually hoping to catch the bug off her so I can lose a few pounds myself. I've been trying for days.\"*\n\nI can only describe that nurse's reaction as *super-ultra-mega-pissed*. She told her that I should have gotten medical attention days ago and that she could have killed me, then very efficiently kicked her right out and (with my complete approval) banned her from seeing me for the rest of my stay. I had some sweet peace and quiet while I recovered.\n\nAnd yes, my wonderful momma knew perfectly well how sick I was all along, though she would never ever admit such a thing. I had a fever. I was in such pain that I couldn't even bear being touched. I vomited when food was so much as *mentioned*. I eventually became delirious. When I asked her several times to take me to a doctor she just kept insisting my illness was no big deal, she'd seen it before, and there was nothing to be done but to wait for it to blow over. She actively prevented people from seeing me so that she could stay over my apartment, play the long-suffering martyr while \"looking after\" me and my child, and try to contract my influenza so that she could lose a few pounds. Well, it didn't work and she still carries those pounds and more to this day.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Media]", "id": "65185z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 81, "report_reasons": null, "author": "Gorilla1969", "saved": false, "mod_reports": [], "name": "t3_65185z", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65185z/how_nmom_attempted_to_use_my_serious_illness_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492062083.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65185z/how_nmom_attempted_to_use_my_serious_illness_for/", "author_flair_text": null, "quarantine": false, "title": "How NMom attempted to use my serious illness for her own weight loss", "created_utc": 1492033283.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 81}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": "", "user_reports": [], "id": "dg71ju5", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "ChairOFLamp", "parent_id": "t1_dg6mp5v", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Wooo, that pain extends 3 generations. Wow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wooo, that pain extends 3 generations. Wow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg71ju5", "score_hidden": false, "stickied": false, "created": 1492081253.0, "created_utc": 1492052453.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mp5v", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "Gorilla1969", "parent_id": "t1_dg6mdfs", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm very LC with her. I don't contact her directly, but my daughter has a new baby of her own now, so of course great-grandma is constantly gate-crashing their house, and I've lately been seeing a lot more of her than I'd like. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very LC with her. I don&amp;#39;t contact her directly, but my daughter has a new baby of her own now, so of course great-grandma is constantly gate-crashing their house, and I&amp;#39;ve lately been seeing a lot more of her than I&amp;#39;d like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6mp5v", "score_hidden": false, "stickied": false, "created": 1492062856.0, "created_utc": 1492034056.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mdfs", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "silveredfoxen", "parent_id": "t3_65185z", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Please tell me you're NC with her. For your own safety and sanity... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please tell me you&amp;#39;re NC with her. For your own safety and sanity... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6mdfs", "score_hidden": false, "stickied": false, "created": 1492062462.0, "created_utc": 1492033662.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": "", "user_reports": [], "id": "dg71n70", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ChairOFLamp", "parent_id": "t1_dg6saft", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Some are just the same as Ns or can be religiously worse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some are just the same as Ns or can be religiously worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg71n70", "score_hidden": false, "stickied": false, "created": 1492081374.0, "created_utc": 1492052574.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6saft", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "throwawaycommaanothe", "parent_id": "t3_65185z", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Gotta love professional nurses.  They've seen it all and you don't have to explain it to them.  They just know.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gotta love professional nurses.  They&amp;#39;ve seen it all and you don&amp;#39;t have to explain it to them.  They just know.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg6saft", "score_hidden": false, "stickied": false, "created": 1492069769.0, "created_utc": 1492040969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": "", "user_reports": [], "id": "dg805ki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gorilla1969", "parent_id": "t1_dg7q0f7", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Holy crap, that's horrible! I think if I would have gotten to the point of *vomiting blood* even my asshole of a mother would have called an ambulance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy crap, that&amp;#39;s horrible! I think if I would have gotten to the point of &lt;em&gt;vomiting blood&lt;/em&gt; even my asshole of a mother would have called an ambulance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg805ki", "score_hidden": false, "stickied": false, "created": 1492137535.0, "created_utc": 1492108735.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7q0f7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "cpeezi", "parent_id": "t3_65185z", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This seriously gave me chills to read because something similar happened with a good friend of mine's fiancee recently. \n\nOne of my best friends has a mother who I am almost *certain* is N. She has done questionable things, like buying my friend &amp; his fiancee a \"wedding gift\" of concert tickets but then demanding that they pay the ticket cost back and that it wasn't truly a gift, but a loan of some sort. That's just one small example of the weird control my friend's mother likes to elicit over him and his fiancee.\n\nAnyways, a couple of months ago my friend's fiancee got very sick with some version of the flu and was throwing up, to the point of calling out of work which she *never* does (my SO works with her in a small office and told me what was going on)... To give a little perspective, my friend works a very intensely physical labor job building stages and setting up event lighting and whatnot, so he works &gt;100 hours per week consistently, sometimes 18+ hour shifts and when he would get home, his fiancee would try to make it seem like she was OK in order to spend a little positive time with him before he had to go to sleep from exhaustion. \n\nFast forward a week and my friend's fiancee is **still** unwell, even after days of bed-rest. She can't take herself to the doctor so finally my friend calls his mother to take care of her, or take her to the ER if it's bad enough. This is where it gets bad.\n\nMy friend had a couple of very long shifts at work in a row, he was barely home, and when he was he would go to sleep after his mother assured him that his fiancee was doing well, or was asleep herself. He finally checked with his fiancee directly to discover that she had been vomiting blood. She was too weak to stand on her own, hadn't eaten anything for days, lost color in her skin and could barely stay awake. All the while his mother had been telling everyone she was doing well, she had posted on Facebook that she was taking care of her son's sweet fiancee and had even been responding to messages and calls from my friend's fiancee's MOTHER asking how she was doing by advising that she was \"feeling better\". When my friend realized what was going on he rushed her to the ER. \n\nThey discovered that her kidneys had nearly shut down completely and that she would have died had she not received care when she did. I was **ENRAGED**. My friend understands how bad it was, but makes excuses for his mother because ... well, because she's his mother. I've never been able to look at her the same and neither has my friend's finacee. Sorry for the long post. \n\n^Edited ^for ^clarity ^&amp; ^to ^fix ^some ^grammar ^stuff. ", "edited": 1492098133.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This seriously gave me chills to read because something similar happened with a good friend of mine&amp;#39;s fiancee recently. &lt;/p&gt;\n\n&lt;p&gt;One of my best friends has a mother who I am almost &lt;em&gt;certain&lt;/em&gt; is N. She has done questionable things, like buying my friend &amp;amp; his fiancee a &amp;quot;wedding gift&amp;quot; of concert tickets but then demanding that they pay the ticket cost back and that it wasn&amp;#39;t truly a gift, but a loan of some sort. That&amp;#39;s just one small example of the weird control my friend&amp;#39;s mother likes to elicit over him and his fiancee.&lt;/p&gt;\n\n&lt;p&gt;Anyways, a couple of months ago my friend&amp;#39;s fiancee got very sick with some version of the flu and was throwing up, to the point of calling out of work which she &lt;em&gt;never&lt;/em&gt; does (my SO works with her in a small office and told me what was going on)... To give a little perspective, my friend works a very intensely physical labor job building stages and setting up event lighting and whatnot, so he works &amp;gt;100 hours per week consistently, sometimes 18+ hour shifts and when he would get home, his fiancee would try to make it seem like she was OK in order to spend a little positive time with him before he had to go to sleep from exhaustion. &lt;/p&gt;\n\n&lt;p&gt;Fast forward a week and my friend&amp;#39;s fiancee is &lt;strong&gt;still&lt;/strong&gt; unwell, even after days of bed-rest. She can&amp;#39;t take herself to the doctor so finally my friend calls his mother to take care of her, or take her to the ER if it&amp;#39;s bad enough. This is where it gets bad.&lt;/p&gt;\n\n&lt;p&gt;My friend had a couple of very long shifts at work in a row, he was barely home, and when he was he would go to sleep after his mother assured him that his fiancee was doing well, or was asleep herself. He finally checked with his fiancee directly to discover that she had been vomiting blood. She was too weak to stand on her own, hadn&amp;#39;t eaten anything for days, lost color in her skin and could barely stay awake. All the while his mother had been telling everyone she was doing well, she had posted on Facebook that she was taking care of her son&amp;#39;s sweet fiancee and had even been responding to messages and calls from my friend&amp;#39;s fiancee&amp;#39;s MOTHER asking how she was doing by advising that she was &amp;quot;feeling better&amp;quot;. When my friend realized what was going on he rushed her to the ER. &lt;/p&gt;\n\n&lt;p&gt;They discovered that her kidneys had nearly shut down completely and that she would have died had she not received care when she did. I was &lt;strong&gt;ENRAGED&lt;/strong&gt;. My friend understands how bad it was, but makes excuses for his mother because ... well, because she&amp;#39;s his mother. I&amp;#39;ve never been able to look at her the same and neither has my friend&amp;#39;s finacee. Sorry for the long post. &lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Edited&lt;/sup&gt; &lt;sup&gt;for&lt;/sup&gt; &lt;sup&gt;clarity&lt;/sup&gt; &lt;sup&gt;&amp;amp;&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;fix&lt;/sup&gt; &lt;sup&gt;some&lt;/sup&gt; &lt;sup&gt;grammar&lt;/sup&gt; &lt;sup&gt;stuff.&lt;/sup&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg7q0f7", "score_hidden": false, "stickied": false, "created": 1492126747.0, "created_utc": 1492097947.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": "", "user_reports": [], "id": "dg7k5kj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "macaroniinapan", "parent_id": "t1_dg79ugt", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Can confirm.  This happened to me.  It wasn't anybody's fault - just a bad combination of circumstances - but it really sucked and was really scary.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can confirm.  This happened to me.  It wasn&amp;#39;t anybody&amp;#39;s fault - just a bad combination of circumstances - but it really sucked and was really scary.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg7k5kj", "score_hidden": false, "stickied": false, "created": 1492119980.0, "created_utc": 1492091180.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79ugt", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Caribbean_Queen_1985", "parent_id": "t3_65185z", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She was playing a dangerous game. If you get too dehydrated, your kidneys start to  shutdown", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She was playing a dangerous game. If you get too dehydrated, your kidneys start to  shutdown&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg79ugt", "score_hidden": false, "stickied": false, "created": 1492096415.0, "created_utc": 1492067615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": "", "user_reports": [], "id": "dg7m9cj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "poundsoffat", "parent_id": "t3_65185z", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; \"No way, I'm actually hoping to catch the bug off her so I can lose a few pounds myself. I've been trying for days.\"\nI can only describe that nurse's reaction as super-ultra-mega-pissed.\n\nLet her have it and don't give her help. We don't need more stupid people in hospital doing ridiculous things to get there.\n\n&gt;it didn't work and she still carries those pounds and more to this day.\n\nThe best kind of fuck you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;No way, I&amp;#39;m actually hoping to catch the bug off her so I can lose a few pounds myself. I&amp;#39;ve been trying for days.&amp;quot;\nI can only describe that nurse&amp;#39;s reaction as super-ultra-mega-pissed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Let her have it and don&amp;#39;t give her help. We don&amp;#39;t need more stupid people in hospital doing ridiculous things to get there.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;it didn&amp;#39;t work and she still carries those pounds and more to this day.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The best kind of fuck you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg7m9cj", "score_hidden": false, "stickied": false, "created": 1492122579.0, "created_utc": 1492093779.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65185z", "likes": null, "replies": "", "user_reports": [], "id": "dg9owbi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pornographicnihilism", "parent_id": "t3_65185z", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is chilling to read. Influenza almost never causes vomiting in adults (it's pretty common in children though). For you to be vomiting, that's a sign that you were EXTREMELY sick and that your case was DANGEROUS on its own. Adding the medical neglect, your mom could have killed you. *-shiver-* \n\nAnd ironically, if she had caught it off you, odds are good that she'd only have ended up with the gross coughing and nasal discharge and fever, but no vomiting and therefore no weight loss anyway. No wonder the nurse was pissed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is chilling to read. Influenza almost never causes vomiting in adults (it&amp;#39;s pretty common in children though). For you to be vomiting, that&amp;#39;s a sign that you were EXTREMELY sick and that your case was DANGEROUS on its own. Adding the medical neglect, your mom could have killed you. &lt;em&gt;-shiver-&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;And ironically, if she had caught it off you, odds are good that she&amp;#39;d only have ended up with the gross coughing and nasal discharge and fever, but no vomiting and therefore no weight loss anyway. No wonder the nurse was pissed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dg9owbi", "score_hidden": false, "stickied": false, "created": 1492230055.0, "created_utc": 1492201255.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]