[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, here&amp;#39;s the deal. I&amp;#39;m 33 and NC with my abusive NStep-Father (NSF from here) and VVVLC with my EMom, we talk briefly on the phone for birthdays. I lived with them from 13/14 years old until I graduated at 18. By 19, I was NC with NSF. While growing up, I dealt with kidnapping (custody drama, 1st grade), physical beatings, mental, emotional and spiritual abuse, high likelihood of sexual abuse (2 different investigations) even though I have massive chucks of memory that aren&amp;#39;t there. I have a younger sibling, a sister, 4 years younger than me. I spent my entire life protecting her from the brunt of the abuse, both from them and from my NStep-Mother before my father passed away when I was 12 (also permanently NC with). &lt;/p&gt;\n\n&lt;p&gt;As I grew into an adult, got married and reached &amp;quot;maybe I want babies&amp;quot; age, I called my mother and told her that when they happen, she has ONE MORE CHANCE to choose her children over her piece of shit ex-husband. My children will never EVER be exposed to the nasty abuse that I was. My younger sister is of the same vein. Since then, I have decided I am childfree (lots of genetic bullshit that I don&amp;#39;t want passed on).&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s so much background shit that I don&amp;#39;t even know where to begin. They have decided that they are going to try to adopt children, likely a baby. My sister and I were put on the list of people to speak to about recommending their home for a child. I&amp;#39;m not sure exactly what they think I&amp;#39;m going to be saying, as I was VERY blunt with my mother that my potential children will NEVER even lay eyes on my NSF. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got so many nightmarish stories, tales of the daily horrors of counting down the minutes until this car door slams and he&amp;#39;s home, not knowing how badly he&amp;#39;ll toss my room while I&amp;#39;m at school certain to find non-existing drugs and shit in my stuff (Literally was 24 the first time I had more than an ibuprofin). If he found notes, I&amp;#39;d get thrown to the floor of the living room and screamed at for hours, once even overnight that resulted in him pulling me from school one morning. I&amp;#39;ve told that story, forever ago, about how one day I was just broken and couldn&amp;#39;t cry, so after 7 hours of screaming and throwing and breaking my things, he drove me to school, stopped in a parking lot, and asked my I wouldn&amp;#39;t just cry for him, and that if I did, this would all be over. I never cried for him again. The note he found in my room? It was asking for a friend of mine to watch another friend, because she was cutting again. He touched my ass almost every time he passed me from behind from 13/14 through moving out at 18. He did the same to my younger sister until she hit him and told him to never touch her again, so he threw her out and wouldn&amp;#39;t let her see our mother.&lt;/p&gt;\n\n&lt;p&gt;At 14, I was having trouble with a chemistry chapter and brought home a C grade. I tried to tell him that I needed help and didn&amp;#39;t understand the material, but that he wouldn&amp;#39;t let me stay after school to get tutoring. He told me if I didn&amp;#39;t get my act together, I&amp;#39;d be 16 walking the street corners for crack, dragging two kids behind me. When I turned 16, I told him clearly that wasn&amp;#39;t in the cards for me. He told me not to worry, there was still plenty of time to hit the streets. When I graduated 3rd place in my class, he asked me why I wasn&amp;#39;t 1st place, and assured me that I could even find the cure for cancer and he&amp;#39;d still never be proud of me because I&amp;#39;m a lazy fuck who will never try hard enough.&lt;/p&gt;\n\n&lt;p&gt;He starved me out of college. I started freshman year at 127. I left at 96 lbs after my first year. My Bio-father&amp;#39;s disability checks had been saved for my college fund for 4 years by that point, deliberately to be used for college. First year folks on campus must have a meal plan. I have scholarships but they would not cover the plan. I worked part time but with a 24 hour course-load, pushed my my parents, and still couldn&amp;#39;t pay the monthly bill. I called home to ask for help and my NSF told me if I called for money one more time, I&amp;#39;d never see a dime of it, and he&amp;#39;d cut off any communication to my Emom and YS. So I starved. I was hospitalized twice for malnutrition that year. &lt;/p&gt;\n\n&lt;p&gt;I have so many stories... But my YS called to let me know about the adoption proceedings and that they might call me. So now I have to answer the phone for a strange number and tell a stranger about the years of abuse I suffered and please don&amp;#39;t put a small, defenseless child back into their home. He&amp;#39;s already driven one to drugs and gang violence with beatings, another legit became a prostitute because it was better than being at his home. I know these kids, he DROVE them to those things. He had my dog murdered because my mom separated from him when I was in high school. He ran over one of the cats. &lt;/p&gt;\n\n&lt;p&gt;So I guess I&amp;#39;m trying to find out what to do. Where do we go from here? Should I compile these stories somewhere? Should I only highlight certain ones? Will there even be time to talk about most of them? I&amp;#39;ve never had to take a call like this before. Someone is going to ask me questions and I&amp;#39;m going to give answers and their job is to listen. Finally, someone who&amp;#39;s job is to listen to these stories. But if they record them, it&amp;#39;s suddenly real. And what if this blows up in my face? It&amp;#39;s not like I have much bio family to lose, but I&amp;#39;m terrified. Help!&lt;/p&gt;\n\n&lt;p&gt;EDIT TO UPDATE: I&amp;#39;ve read everyone&amp;#39;s comments, and thank you all so very much. From what I&amp;#39;ve been able to gather, they are trying to adopt through the state agency. I&amp;#39;m going to go on the hunt for contact information on Monday and see if I can find someone to talk to. I&amp;#39;ve put together a list of some of the abuses I&amp;#39;ve suffered at his hands, and they stretch from ages 5/6 (divorce/custody battle, complete with KIDNAPPING us) through ages 22/23. Again, thank everyone very much for input and direction. My head&amp;#39;s just been spinning, but I think I have a grasp on what to do next. It&amp;#39;s good to know that I&amp;#39;m not alone, and to be reassured that I am not powerless anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, here's the deal. I'm 33 and NC with my abusive NStep-Father (NSF from here) and VVVLC with my EMom, we talk briefly on the phone for birthdays. I lived with them from 13/14 years old until I graduated at 18. By 19, I was NC with NSF. While growing up, I dealt with kidnapping (custody drama, 1st grade), physical beatings, mental, emotional and spiritual abuse, high likelihood of sexual abuse (2 different investigations) even though I have massive chucks of memory that aren't there. I have a younger sibling, a sister, 4 years younger than me. I spent my entire life protecting her from the brunt of the abuse, both from them and from my NStep-Mother before my father passed away when I was 12 (also permanently NC with). \n\nAs I grew into an adult, got married and reached \"maybe I want babies\" age, I called my mother and told her that when they happen, she has ONE MORE CHANCE to choose her children over her piece of shit ex-husband. My children will never EVER be exposed to the nasty abuse that I was. My younger sister is of the same vein. Since then, I have decided I am childfree (lots of genetic bullshit that I don't want passed on).\n\nThere's so much background shit that I don't even know where to begin. They have decided that they are going to try to adopt children, likely a baby. My sister and I were put on the list of people to speak to about recommending their home for a child. I'm not sure exactly what they think I'm going to be saying, as I was VERY blunt with my mother that my potential children will NEVER even lay eyes on my NSF. \n\nI've got so many nightmarish stories, tales of the daily horrors of counting down the minutes until this car door slams and he's home, not knowing how badly he'll toss my room while I'm at school certain to find non-existing drugs and shit in my stuff (Literally was 24 the first time I had more than an ibuprofin). If he found notes, I'd get thrown to the floor of the living room and screamed at for hours, once even overnight that resulted in him pulling me from school one morning. I've told that story, forever ago, about how one day I was just broken and couldn't cry, so after 7 hours of screaming and throwing and breaking my things, he drove me to school, stopped in a parking lot, and asked my I wouldn't just cry for him, and that if I did, this would all be over. I never cried for him again. The note he found in my room? It was asking for a friend of mine to watch another friend, because she was cutting again. He touched my ass almost every time he passed me from behind from 13/14 through moving out at 18. He did the same to my younger sister until she hit him and told him to never touch her again, so he threw her out and wouldn't let her see our mother.\n\nAt 14, I was having trouble with a chemistry chapter and brought home a C grade. I tried to tell him that I needed help and didn't understand the material, but that he wouldn't let me stay after school to get tutoring. He told me if I didn't get my act together, I'd be 16 walking the street corners for crack, dragging two kids behind me. When I turned 16, I told him clearly that wasn't in the cards for me. He told me not to worry, there was still plenty of time to hit the streets. When I graduated 3rd place in my class, he asked me why I wasn't 1st place, and assured me that I could even find the cure for cancer and he'd still never be proud of me because I'm a lazy fuck who will never try hard enough.\n\nHe starved me out of college. I started freshman year at 127. I left at 96 lbs after my first year. My Bio-father's disability checks had been saved for my college fund for 4 years by that point, deliberately to be used for college. First year folks on campus must have a meal plan. I have scholarships but they would not cover the plan. I worked part time but with a 24 hour course-load, pushed my my parents, and still couldn't pay the monthly bill. I called home to ask for help and my NSF told me if I called for money one more time, I'd never see a dime of it, and he'd cut off any communication to my Emom and YS. So I starved. I was hospitalized twice for malnutrition that year. \n\nI have so many stories... But my YS called to let me know about the adoption proceedings and that they might call me. So now I have to answer the phone for a strange number and tell a stranger about the years of abuse I suffered and please don't put a small, defenseless child back into their home. He's already driven one to drugs and gang violence with beatings, another legit became a prostitute because it was better than being at his home. I know these kids, he DROVE them to those things. He had my dog murdered because my mom separated from him when I was in high school. He ran over one of the cats. \n\nSo I guess I'm trying to find out what to do. Where do we go from here? Should I compile these stories somewhere? Should I only highlight certain ones? Will there even be time to talk about most of them? I've never had to take a call like this before. Someone is going to ask me questions and I'm going to give answers and their job is to listen. Finally, someone who's job is to listen to these stories. But if they record them, it's suddenly real. And what if this blows up in my face? It's not like I have much bio family to lose, but I'm terrified. Help!\n\nEDIT TO UPDATE: I've read everyone's comments, and thank you all so very much. From what I've been able to gather, they are trying to adopt through the state agency. I'm going to go on the hunt for contact information on Monday and see if I can find someone to talk to. I've put together a list of some of the abuses I've suffered at his hands, and they stretch from ages 5/6 (divorce/custody battle, complete with KIDNAPPING us) through ages 22/23. Again, thank everyone very much for input and direction. My head's just been spinning, but I think I have a grasp on what to do next. It's good to know that I'm not alone, and to be reassured that I am not powerless anymore.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gklv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 497, "report_reasons": null, "author": "anarashka", "saved": false, "mod_reports": [], "name": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": 1492292914.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65gklv/my_nsd_and_emom_want_to_adopt_they_put_my_info/", "num_reports": null, "locked": false, "stickied": false, "created": 1492248734.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65gklv/my_nsd_and_emom_want_to_adopt_they_put_my_info/", "author_flair_text": null, "quarantine": false, "title": "My NSD and EMom want to adopt. They put my info down on the application as references. This will not go how they think it will.", "created_utc": 1492219934.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 27, "visited": false, "subreddit_type": "public", "ups": 497}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgahiie", "gilded": 0, "archived": false, "score": 72, "report_reasons": null, "author": "Jovet_Hunter", "parent_id": "t1_dga4pac", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yes.  IANAL, but I may add to make sure to only include things from your point of view.  Things done to you or directly witnessed, not told to you or assumed from a situation.  Be careful to keep the details as simple and curt as possible, and invite the person interviewing you to ask for clarification if necessary.  People tend to embellish these things and clean, simple details are most helpful and appreciated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes.  IANAL, but I may add to make sure to only include things from your point of view.  Things done to you or directly witnessed, not told to you or assumed from a situation.  Be careful to keep the details as simple and curt as possible, and invite the person interviewing you to ask for clarification if necessary.  People tend to embellish these things and clean, simple details are most helpful and appreciated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgahiie", "score_hidden": false, "stickied": false, "created": 1492276961.0, "created_utc": 1492248161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 72}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgasxys", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "keatonpotat0es", "parent_id": "t1_dgakudb", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Your first paragraph is spot on. I used to work with CPS and to them, written documentation is EVERYTHING. If there were ever any police reports, hospitalization/doctor visits, etc documenting any abuse (or even suspected abuse), this would help tremendously. A written letter or email to the caseworker detailing some of these events is a great way to go, that way the caseworker has something tangible to pass along to their supervisor or even a judge to prove that these assholes are NOT fit to raise another child. \n\nI'm so sorry, OP. It's clear your parents are looking for a do-over baby so they have another small thing to control now that you and your sis are gone. They're horrible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your first paragraph is spot on. I used to work with CPS and to them, written documentation is EVERYTHING. If there were ever any police reports, hospitalization/doctor visits, etc documenting any abuse (or even suspected abuse), this would help tremendously. A written letter or email to the caseworker detailing some of these events is a great way to go, that way the caseworker has something tangible to pass along to their supervisor or even a judge to prove that these assholes are NOT fit to raise another child. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so sorry, OP. It&amp;#39;s clear your parents are looking for a do-over baby so they have another small thing to control now that you and your sis are gone. They&amp;#39;re horrible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgasxys", "score_hidden": false, "stickied": false, "created": 1492300889.0, "created_utc": 1492272089.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgb57ka", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Raveynfyre", "parent_id": "t1_dgb2n4n", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That is what I was attempting to provide (if a bit harshly). They are victims too, but they *choose* which side they're on, and it's often not the one their children are on. Otherwise they wouldn't be enablers, they would be labelled survivors and parents instead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is what I was attempting to provide (if a bit harshly). They are victims too, but they &lt;em&gt;choose&lt;/em&gt; which side they&amp;#39;re on, and it&amp;#39;s often not the one their children are on. Otherwise they wouldn&amp;#39;t be enablers, they would be labelled survivors and parents instead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgb57ka", "score_hidden": false, "stickied": false, "created": 1492317625.0, "created_utc": 1492288825.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2n4n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgakudb", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgb2n4n", "score_hidden": false, "stickied": false, "created": 1492314119.0, "created_utc": 1492285319.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakudb", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Raveynfyre", "parent_id": "t1_dga4pac", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "/u/anarashka could also ask for a mailing (pr eMail) address for the person who calls. They can then  send a written statement to the person who calls from the agency, if there are stories that they don't want to discuss verbally, but should be taken into account for the evaluation. Privacy can be requested during the call to try and get the information to the agency, so it won't be shared back to their abusers.\n\n/u/anarashka, I'm very sorry for what you have gone through, but it is very important that you tell this person absolutely everything you can so that NSF doesn't get the chance to hurt someone new. You're already aware of NSF's potential to hurt another child and fuckup another life, it's within your power to ensure that it doesn't happen again.\n\nYou have your sister's contact information, so he can't cut you off from her, as she is also an adult at this point. He can only cut you off from your EMom, and I'm sorry to say this, but she has made her own bed. She has repeatedly chosen NSF over you and your sisters well-being. She failed you and your sister as a parent and a mother, and you barely speak with her now currently. How much of a difference in your life would it really be, to not speak with her again if you only talk to her a few times a year, for a few minutes? You wouldn't be losing anyone that I personally would consider family at this point if NSF cuts you off from her. \n\nI'm sorry if my words are blunt or hurtful, but she doesn't deserve to be part of your life anymore, no matter how insignificant a role that she has in your life now as it stands. She could have saved you and your sister, she had a **responsibility** to do this as your mother, and she failed you. She has made her bed, and she's ***STILL*** lying in it when she has had every opportunity to leave. She's made her choice, it's best that you make sure that **both** of these \"people\" never have another chance to hurt another child ever again.      ", "edited": 1492258734.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/anarashka\"&gt;/u/anarashka&lt;/a&gt; could also ask for a mailing (pr eMail) address for the person who calls. They can then  send a written statement to the person who calls from the agency, if there are stories that they don&amp;#39;t want to discuss verbally, but should be taken into account for the evaluation. Privacy can be requested during the call to try and get the information to the agency, so it won&amp;#39;t be shared back to their abusers.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/u/anarashka\"&gt;/u/anarashka&lt;/a&gt;, I&amp;#39;m very sorry for what you have gone through, but it is very important that you tell this person absolutely everything you can so that NSF doesn&amp;#39;t get the chance to hurt someone new. You&amp;#39;re already aware of NSF&amp;#39;s potential to hurt another child and fuckup another life, it&amp;#39;s within your power to ensure that it doesn&amp;#39;t happen again.&lt;/p&gt;\n\n&lt;p&gt;You have your sister&amp;#39;s contact information, so he can&amp;#39;t cut you off from her, as she is also an adult at this point. He can only cut you off from your EMom, and I&amp;#39;m sorry to say this, but she has made her own bed. She has repeatedly chosen NSF over you and your sisters well-being. She failed you and your sister as a parent and a mother, and you barely speak with her now currently. How much of a difference in your life would it really be, to not speak with her again if you only talk to her a few times a year, for a few minutes? You wouldn&amp;#39;t be losing anyone that I personally would consider family at this point if NSF cuts you off from her. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry if my words are blunt or hurtful, but she doesn&amp;#39;t deserve to be part of your life anymore, no matter how insignificant a role that she has in your life now as it stands. She could have saved you and your sister, she had a &lt;strong&gt;responsibility&lt;/strong&gt; to do this as your mother, and she failed you. She has made her bed, and she&amp;#39;s &lt;strong&gt;&lt;em&gt;STILL&lt;/em&gt;&lt;/strong&gt; lying in it when she has had every opportunity to leave. She&amp;#39;s made her choice, it&amp;#39;s best that you make sure that &lt;strong&gt;both&lt;/strong&gt; of these &amp;quot;people&amp;quot; never have another chance to hurt another child ever again.      &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgakudb", "score_hidden": false, "stickied": false, "created": 1492286928.0, "created_utc": 1492258128.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4pac", "gilded": 0, "archived": false, "score": 252, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dga4pac", "score_hidden": false, "stickied": false, "created": 1492250879.0, "created_utc": 1492222079.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 252}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgat4ac", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "keatonpotat0es", "parent_id": "t1_dga8jkg", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;In that same vein, if you suspect your dad might get someone he knows to call you and say \"My name is [XYZ] from [Adoption Agency], tell me all you know\", ask to meet at the agency as an added precaution.\n\nThis is a great suggestion. I think most caseworkers would prefer to meet in person anyway, so be very wary of any calls of this nature. OP, do you know if they are pursing adoption through a private agency or through state foster care? If it's the former, I would highly recommend making a report to CPS to get them involved in the process ASAP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In that same vein, if you suspect your dad might get someone he knows to call you and say &amp;quot;My name is [XYZ] from [Adoption Agency], tell me all you know&amp;quot;, ask to meet at the agency as an added precaution.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a great suggestion. I think most caseworkers would prefer to meet in person anyway, so be very wary of any calls of this nature. OP, do you know if they are pursing adoption through a private agency or through state foster care? If it&amp;#39;s the former, I would highly recommend making a report to CPS to get them involved in the process ASAP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgat4ac", "score_hidden": false, "stickied": false, "created": 1492301125.0, "created_utc": 1492272325.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dga8jkg", "gilded": 0, "archived": false, "score": 81, "report_reasons": null, "author": "DrFrankly", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yes, make a list of all these things and if you can, who investigated the sexual abuse claims, because that's definitely something they'll want to look in to.\n\nAt the end of it all, ask for a reference number or a contact number of the person handling the application so if you need to call the cops (e.g. if the application looks like its going to go through unchecked, or NSD threatens you over what you said), you have the names and numbers of those who didn't do their job properly.\n\nThough frankly with the stories you have, I'd be proactive and call them before they can call you. I've put people down as references for resumes and not a single person has been called. I doubt that'd be the same as an adoption application, but you never know. On top of which, he might have given the wrong number, and had someone he knows answer and say \"Oh anarashka's stepdad? Top fellow! Nicest guy you'll ever meet! Definitely isn't a sexual harassing violent and unreasonable scumbag who deserves to be lonely and miserable for all of eternity!\"\n\nIn that same vein, if you suspect your dad might get someone he knows to call you and say \"My name is [XYZ] from [Adoption Agency], tell me all you know\", ask to meet at the agency as an added precaution.\n\nFinally, might be worth looking up the adoption process works, and what laws and procedures there are when it comes to things like calling up references. You'll want to hold the agency accountable if they give your NSD another living breathing human being.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, make a list of all these things and if you can, who investigated the sexual abuse claims, because that&amp;#39;s definitely something they&amp;#39;ll want to look in to.&lt;/p&gt;\n\n&lt;p&gt;At the end of it all, ask for a reference number or a contact number of the person handling the application so if you need to call the cops (e.g. if the application looks like its going to go through unchecked, or NSD threatens you over what you said), you have the names and numbers of those who didn&amp;#39;t do their job properly.&lt;/p&gt;\n\n&lt;p&gt;Though frankly with the stories you have, I&amp;#39;d be proactive and call them before they can call you. I&amp;#39;ve put people down as references for resumes and not a single person has been called. I doubt that&amp;#39;d be the same as an adoption application, but you never know. On top of which, he might have given the wrong number, and had someone he knows answer and say &amp;quot;Oh anarashka&amp;#39;s stepdad? Top fellow! Nicest guy you&amp;#39;ll ever meet! Definitely isn&amp;#39;t a sexual harassing violent and unreasonable scumbag who deserves to be lonely and miserable for all of eternity!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In that same vein, if you suspect your dad might get someone he knows to call you and say &amp;quot;My name is [XYZ] from [Adoption Agency], tell me all you know&amp;quot;, ask to meet at the agency as an added precaution.&lt;/p&gt;\n\n&lt;p&gt;Finally, might be worth looking up the adoption process works, and what laws and procedures there are when it comes to things like calling up references. You&amp;#39;ll want to hold the agency accountable if they give your NSD another living breathing human being.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dga8jkg", "score_hidden": false, "stickied": false, "created": 1492256628.0, "created_utc": 1492227828.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 81}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgaehs9", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "kittymctacoyo", "parent_id": "t1_dga7n2f", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Express this to them. Be sure this info is not to be repeated to your parents. They will not disclose WHY they chose not to place a child. I've worked with clients who were adopting and this can def be confidential. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Express this to them. Be sure this info is not to be repeated to your parents. They will not disclose WHY they chose not to place a child. I&amp;#39;ve worked with clients who were adopting and this can def be confidential. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgaehs9", "score_hidden": false, "stickied": false, "created": 1492268263.0, "created_utc": 1492239463.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgajpp8", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "MoogleFortuneCookie", "parent_id": "t1_dgahboy", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Also it could all just be a show. Your NSD might just have a friend doing this for whatever reason. Like to find out how much you are actually willing to talk about. With someone that violent I would take every precaution. Crazier things have happened. I'd ask to meet in person with the adoption agency or whatever. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also it could all just be a show. Your NSD might just have a friend doing this for whatever reason. Like to find out how much you are actually willing to talk about. With someone that violent I would take every precaution. Crazier things have happened. I&amp;#39;d ask to meet in person with the adoption agency or whatever. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgajpp8", "score_hidden": false, "stickied": false, "created": 1492283914.0, "created_utc": 1492255114.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahboy", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Spinner1975", "parent_id": "t1_dga7n2f", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Maybe I'm just paranoid, but I would definitely document it as a statement on paper. Possibly even have a solicitor issue it. You have no idea who is on the other side with the note pad, they could be some dumb or ignorant fool who's been charmed by your narcs and already approved them to adopt pending formalities. They may side with them and undermine and invalidate you and leave you feeling worse off.\n\n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe I&amp;#39;m just paranoid, but I would definitely document it as a statement on paper. Possibly even have a solicitor issue it. You have no idea who is on the other side with the note pad, they could be some dumb or ignorant fool who&amp;#39;s been charmed by your narcs and already approved them to adopt pending formalities. They may side with them and undermine and invalidate you and leave you feeling worse off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgahboy", "score_hidden": false, "stickied": false, "created": 1492276358.0, "created_utc": 1492247558.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgajj9r", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "estrangedjane", "parent_id": "t1_dga7n2f", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "But it is real, friend. No one can make it more real for you. And maybe starting to let go of the shame of what happened; accepting it had nothing to do with you and everything to do with them. Maybe this can help you start to let go of the secrecy of your abuse, and to talk about what you've endured. It isn't easy. It's scary as hell. But it's also cathartic. Relieving. Stop carrying this burden in your heart. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But it is real, friend. No one can make it more real for you. And maybe starting to let go of the shame of what happened; accepting it had nothing to do with you and everything to do with them. Maybe this can help you start to let go of the secrecy of your abuse, and to talk about what you&amp;#39;ve endured. It isn&amp;#39;t easy. It&amp;#39;s scary as hell. But it&amp;#39;s also cathartic. Relieving. Stop carrying this burden in your heart. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgajj9r", "score_hidden": false, "stickied": false, "created": 1492283384.0, "created_utc": 1492254584.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgaktbq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Geek_with_a_UV2k", "parent_id": "t1_dga7n2f", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Remember, you're a grown man. You can chose to act as though you have no fear. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember, you&amp;#39;re a grown man. You can chose to act as though you have no fear. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgaktbq", "score_hidden": false, "stickied": false, "created": 1492286855.0, "created_utc": 1492258055.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7n2f", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "anarashka", "parent_id": "t1_dga6ety", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Somehow, having someone official writing it all down makes it so much more real. And I have no idea the fallout if my testimony is what keeps them from adopting. I don't even know if they will keep my info confidential. My sister is in the same boat as I am, but I managed to protect her from the brunt of it before I made my escape. \n\nI'm fucking terrified. It's not like I haven't told these stories, but now I'm talking to someone with a notepad on the other side, who's job it is to keep these things from happening to other kids. What about my family? What about the home I've put together, the sanctuary I've spent years building? This is fucking crazy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Somehow, having someone official writing it all down makes it so much more real. And I have no idea the fallout if my testimony is what keeps them from adopting. I don&amp;#39;t even know if they will keep my info confidential. My sister is in the same boat as I am, but I managed to protect her from the brunt of it before I made my escape. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m fucking terrified. It&amp;#39;s not like I haven&amp;#39;t told these stories, but now I&amp;#39;m talking to someone with a notepad on the other side, who&amp;#39;s job it is to keep these things from happening to other kids. What about my family? What about the home I&amp;#39;ve put together, the sanctuary I&amp;#39;ve spent years building? This is fucking crazy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dga7n2f", "score_hidden": false, "stickied": false, "created": 1492255183.0, "created_utc": 1492226383.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6ety", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "Bravadu", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm sorry that you had to grow up with those jerks, but now you have the ability to share (and be listened to). Protect any potential adopted child the way you would protect your young self.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry that you had to grow up with those jerks, but now you have the ability to share (and be listened to). Protect any potential adopted child the way you would protect your young self.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dga6ety", "score_hidden": false, "stickied": false, "created": 1492253344.0, "created_utc": 1492224544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgar8bn", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "OdinsValkyrie", "parent_id": "t1_dgacz2i", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I just wanted to tell you how impressed I am (and proud, if you will) with what you did. That tool an enormous amount of courage to do. Reliving painful memories is always hard, but you did it for the sake of someone you'll never even meet. That takes a lot of compassion. \n\nAs a side note, I'm always amazed at the beautiful, kind, self-sacrificing people that come from terrible situations. I hope OP reads your post and finds the strength I know they have to do what you did. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just wanted to tell you how impressed I am (and proud, if you will) with what you did. That tool an enormous amount of courage to do. Reliving painful memories is always hard, but you did it for the sake of someone you&amp;#39;ll never even meet. That takes a lot of compassion. &lt;/p&gt;\n\n&lt;p&gt;As a side note, I&amp;#39;m always amazed at the beautiful, kind, self-sacrificing people that come from terrible situations. I hope OP reads your post and finds the strength I know they have to do what you did. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgar8bn", "score_hidden": false, "stickied": false, "created": 1492298474.0, "created_utc": 1492269674.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacz2i", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "MissMarthaHayden", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I did a similar thing recently and it was all completely confidential. I live in the UK though so I don't know if YMMV where you are.\n\nIn my case I was asked to fill in a reference form for my Edad to support his application to foster teenagers. It had boxes I could tick to say 'I [give/refuse] consent for the information on this form to be shared with the applicant'. I ticked the refusal and put the form in the post along with a ten page letter of horror stories about all the times he'd enabled and participated in abuse towards me and my younger relatives, due to his chronic inability to say No the the various Ns in our family.\n\nTwo months later somebody from the fostering services called me up to say thank you for sharing my experiences, that I'd done the right thing, and they'd declined Edad's application. She said they simply told him that they'd reviewed all the information provided by himself and his references, and decided he wasn't in a position to meet the needs of a foster teen. There was also a professional reference from his boss and a medical reference from his doctor. When Edad told me he'd been turned down, he said he reckoned it was because of his age and medical issues, and it was a shame but there you go.\n\nI hope it goes the same way for you. If you think talking about it with a stranger would be traumatic and writing would be easier, maybe mention that there was abuse and ask if you can send them a letter with more details, and confirm they will keep it confidential from your NSF and Emom? You could largely copy/paste content you've posted on RBN that way if you wanted.\n\nAll the best with this, I'll be thinking of you and checking back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did a similar thing recently and it was all completely confidential. I live in the UK though so I don&amp;#39;t know if YMMV where you are.&lt;/p&gt;\n\n&lt;p&gt;In my case I was asked to fill in a reference form for my Edad to support his application to foster teenagers. It had boxes I could tick to say &amp;#39;I [give/refuse] consent for the information on this form to be shared with the applicant&amp;#39;. I ticked the refusal and put the form in the post along with a ten page letter of horror stories about all the times he&amp;#39;d enabled and participated in abuse towards me and my younger relatives, due to his chronic inability to say No the the various Ns in our family.&lt;/p&gt;\n\n&lt;p&gt;Two months later somebody from the fostering services called me up to say thank you for sharing my experiences, that I&amp;#39;d done the right thing, and they&amp;#39;d declined Edad&amp;#39;s application. She said they simply told him that they&amp;#39;d reviewed all the information provided by himself and his references, and decided he wasn&amp;#39;t in a position to meet the needs of a foster teen. There was also a professional reference from his boss and a medical reference from his doctor. When Edad told me he&amp;#39;d been turned down, he said he reckoned it was because of his age and medical issues, and it was a shame but there you go.&lt;/p&gt;\n\n&lt;p&gt;I hope it goes the same way for you. If you think talking about it with a stranger would be traumatic and writing would be easier, maybe mention that there was abuse and ask if you can send them a letter with more details, and confirm they will keep it confidential from your NSF and Emom? You could largely copy/paste content you&amp;#39;ve posted on RBN that way if you wanted.&lt;/p&gt;\n\n&lt;p&gt;All the best with this, I&amp;#39;ll be thinking of you and checking back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgacz2i", "score_hidden": false, "stickied": false, "created": 1492264755.0, "created_utc": 1492235955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgab0wd", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Lanna29", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Give the adoption agencies a pre-emptive call (if you know the agencies) and share a few sample stories of the worst behavior.  Go where it feels best to go - share a lot or a little.\n\nI'd recommend writing it all down (as much as you can without betraying your sisters confidences), and offering to email or send a thumb drive to the adoption agencies.\n\nYou are in a unique position of being able to save a child from a life of abuse - good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Give the adoption agencies a pre-emptive call (if you know the agencies) and share a few sample stories of the worst behavior.  Go where it feels best to go - share a lot or a little.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d recommend writing it all down (as much as you can without betraying your sisters confidences), and offering to email or send a thumb drive to the adoption agencies.&lt;/p&gt;\n\n&lt;p&gt;You are in a unique position of being able to save a child from a life of abuse - good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgab0wd", "score_hidden": false, "stickied": false, "created": 1492260856.0, "created_utc": 1492232056.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgadeof", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Mohoyorodo", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm really proud of you for protecting the child(ren) they might have adopted by sharing your abuse with a stranger. It's not going to be fun but you're saving these kids from so much suffering. Thank you. \n\nI would organize your memories and try to put a date, location, and specific details to them. Details help make your memories feel as real to the other person as you and administrative folks like concrete information. I would also include how these events made you feel and react as a child and what their legacy has been for you and your siblings. Just make a list with each event, if it will help you focus. I know that's a potentially painful aspect of doing this. \n\nIf you have a pediatrician, teachers, coaches, a police department, neighbors or a therapist who can corroborate your experiences, I would ask them if you can share their contact information with the adoption agency. \n\nFinally I would ask the adoption agency what they would do to prevent abuse of the children they might place with your family. How would the agency protect these children if there is evidence of abuse? What if the abuse is covert and concealed? I would do this to bring the point home that you expect this abuse to continue. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really proud of you for protecting the child(ren) they might have adopted by sharing your abuse with a stranger. It&amp;#39;s not going to be fun but you&amp;#39;re saving these kids from so much suffering. Thank you. &lt;/p&gt;\n\n&lt;p&gt;I would organize your memories and try to put a date, location, and specific details to them. Details help make your memories feel as real to the other person as you and administrative folks like concrete information. I would also include how these events made you feel and react as a child and what their legacy has been for you and your siblings. Just make a list with each event, if it will help you focus. I know that&amp;#39;s a potentially painful aspect of doing this. &lt;/p&gt;\n\n&lt;p&gt;If you have a pediatrician, teachers, coaches, a police department, neighbors or a therapist who can corroborate your experiences, I would ask them if you can share their contact information with the adoption agency. &lt;/p&gt;\n\n&lt;p&gt;Finally I would ask the adoption agency what they would do to prevent abuse of the children they might place with your family. How would the agency protect these children if there is evidence of abuse? What if the abuse is covert and concealed? I would do this to bring the point home that you expect this abuse to continue. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgadeof", "score_hidden": false, "stickied": false, "created": 1492265703.0, "created_utc": 1492236903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgamo6j", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Faedan", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "First things first. That man is an irredeemable piece of shit. \n\nSecondly when and if they call, be honest. Make sure you have a list of points to be made and only discuss things that have happened to you personally. Also you said he was investigated for sexual abuse? \n\nTELL THEM. If he was investigated at all, this will be on a record. And you said twice. Both will be on record. They will not hand over a baby to a man who keeps getting flagged as a potential sexual predator.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First things first. That man is an irredeemable piece of shit. &lt;/p&gt;\n\n&lt;p&gt;Secondly when and if they call, be honest. Make sure you have a list of points to be made and only discuss things that have happened to you personally. Also you said he was investigated for sexual abuse? &lt;/p&gt;\n\n&lt;p&gt;TELL THEM. If he was investigated at all, this will be on a record. And you said twice. Both will be on record. They will not hand over a baby to a man who keeps getting flagged as a potential sexual predator.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgamo6j", "score_hidden": false, "stickied": false, "created": 1492290957.0, "created_utc": 1492262157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgaq7bc", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "BlushingDragon", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Please be sure to keep an eye out to make sure your parents don't adopt without you being contacted. It has, unfortunately, happened. \n\nThis is a news story from a few years ago, but it's still relevant: 4 adult children wouldn't let their abusive parents even see their grandchildren. Parents adopted a baby from a private agency (note: private agencies make money only when adoption happens, so some lousy ones aren't exactly invested in making sure home is safe for baby). 2 of the grown children spoke out publicaly, 2 privately about the abuse. Baby was removed from abusive home, hopefully before harm happened. If the adult children hadn't spoken out, that baby would have been completely unprotected.\n\nBut no one thought to ask the adult children anything, or they wouldn't have gotten baby in first place.\n\nSo just keep an eye/ear out to make sure adoption doesn't happen, and if it does, contact CPS.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please be sure to keep an eye out to make sure your parents don&amp;#39;t adopt without you being contacted. It has, unfortunately, happened. &lt;/p&gt;\n\n&lt;p&gt;This is a news story from a few years ago, but it&amp;#39;s still relevant: 4 adult children wouldn&amp;#39;t let their abusive parents even see their grandchildren. Parents adopted a baby from a private agency (note: private agencies make money only when adoption happens, so some lousy ones aren&amp;#39;t exactly invested in making sure home is safe for baby). 2 of the grown children spoke out publicaly, 2 privately about the abuse. Baby was removed from abusive home, hopefully before harm happened. If the adult children hadn&amp;#39;t spoken out, that baby would have been completely unprotected.&lt;/p&gt;\n\n&lt;p&gt;But no one thought to ask the adult children anything, or they wouldn&amp;#39;t have gotten baby in first place.&lt;/p&gt;\n\n&lt;p&gt;So just keep an eye/ear out to make sure adoption doesn&amp;#39;t happen, and if it does, contact CPS.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgaq7bc", "score_hidden": false, "stickied": false, "created": 1492296979.0, "created_utc": 1492268179.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgasmkq", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Lexanye", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "From the perspective of a kid who was adopted by an abusive Narc family, and it could've been prevented, do. everything you can to ensure there won't be another victim.\n\nI'm sorry for what you went through, and I hope you never have to go through that again.\n\nHell, even figure out where the case was presented and leave an anonymous note about them, I've done it about prospective foster to adoptive parents I was put with.\n\nI hope all goes well for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From the perspective of a kid who was adopted by an abusive Narc family, and it could&amp;#39;ve been prevented, do. everything you can to ensure there won&amp;#39;t be another victim.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry for what you went through, and I hope you never have to go through that again.&lt;/p&gt;\n\n&lt;p&gt;Hell, even figure out where the case was presented and leave an anonymous note about them, I&amp;#39;ve done it about prospective foster to adoptive parents I was put with.&lt;/p&gt;\n\n&lt;p&gt;I hope all goes well for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgasmkq", "score_hidden": false, "stickied": false, "created": 1492300446.0, "created_utc": 1492271646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgakg26", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Smokesalottapottamus", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I think you have more of an obligation to save their future victims than a relationship that amounts to 1 short phone call a year.  What's the worst he can do to you now besides scream and act like he's always acted?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you have more of an obligation to save their future victims than a relationship that amounts to 1 short phone call a year.  What&amp;#39;s the worst he can do to you now besides scream and act like he&amp;#39;s always acted?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgakg26", "score_hidden": false, "stickied": false, "created": 1492285921.0, "created_utc": 1492257121.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgajuvn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "missrainbow12", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I think you are being incredibly brave, and you are totally doing the right thing. They can not harm any more children. Also writing it all down and having someone like a social working saying \"This is abuse\" could be incredibly cathartic for you. Good luck. And check back in, we are all here for you xx\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are being incredibly brave, and you are totally doing the right thing. They can not harm any more children. Also writing it all down and having someone like a social working saying &amp;quot;This is abuse&amp;quot; could be incredibly cathartic for you. Good luck. And check back in, we are all here for you xx&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgajuvn", "score_hidden": false, "stickied": false, "created": 1492284334.0, "created_utc": 1492255534.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgalwcn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Birdy1001", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Very sorry you had to suffer so much.  I swear they are delusional about their treatment of their children.  You do not have to tell everything, to spare yourself just abuse, abuse, abuse. The man who married my Nmom use to try and touch me, or back into me or lean in. If you just tell that!!!!!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very sorry you had to suffer so much.  I swear they are delusional about their treatment of their children.  You do not have to tell everything, to spare yourself just abuse, abuse, abuse. The man who married my Nmom use to try and touch me, or back into me or lean in. If you just tell that!!!!!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgalwcn", "score_hidden": false, "stickied": false, "created": 1492289342.0, "created_utc": 1492260542.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgarwaf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ChloeKittyMtF", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Be entirely open and honest. Don't allow them to ruin another person's childhood &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be entirely open and honest. Don&amp;#39;t allow them to ruin another person&amp;#39;s childhood &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgarwaf", "score_hidden": false, "stickied": false, "created": 1492299419.0, "created_utc": 1492270619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgbrf03", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "randyguptill", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "If you're 33, I'm hoping that the state will count them as too old to adopt. I have heard that they will often not accept older people. However, I still think you are smart to tell them what happened to you. I'm sorry you were treated this way. It was wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re 33, I&amp;#39;m hoping that the state will count them as too old to adopt. I have heard that they will often not accept older people. However, I still think you are smart to tell them what happened to you. I&amp;#39;m sorry you were treated this way. It was wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbrf03", "score_hidden": false, "stickied": false, "created": 1492351340.0, "created_utc": 1492322540.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65gklv", "likes": null, "replies": "", "user_reports": [], "id": "dgb6na8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wordtoyourmother8", "parent_id": "t1_dgaiuwo", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Comment removed for being nonsense. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Comment removed for being nonsense. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgb6na8", "score_hidden": false, "stickied": false, "created": 1492319611.0, "created_utc": 1492290811.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaiuwo", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65gklv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgaiuwo", "score_hidden": false, "stickied": false, "created": 1492281279.0, "created_utc": 1492252479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]