[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is just a little story from a few years ago. I&amp;#39;m NC but sometimes remember things like this and find them funny, but at the time I was terrified&lt;/p&gt;\n\n&lt;p&gt;See, nmom would do this thing. If there was a minor thing someone did that annoyed her (leave the cupboard open, leave toothpaste in the sink without washing it, dirty plate on the counter) she&amp;#39;d put the house on lockdown. The kids went to our rooms and weren&amp;#39;t allowed to come out while she&amp;#39;d scream at each of us in turns threatening different stuff (grounded for x amount of months, take your bed away, no meals) until someone took the blame. The thing is these were very minor things, often the result of someone forgetting something so even the person who did it wouldn&amp;#39;t remember (and im pretty sure her or her ebf were guilty of a few). The result was each time one of us kids volunteered to be the scapegoat.&lt;/p&gt;\n\n&lt;p&gt;Either way, as the title indicated, one time it was floss left in the sink. She went to the bathroom during diner, saw it, and interrupted the meal to do her thing.  After a while, she takes me and tells me she knows i did it and starts screaming in my face. I run to my room and lock myself in. She goes absolutely berserk. I kid you not, full 28 days later. Screeching incomprehensible things, arms flailing. She starts to punch my door (i say punch, not knock. She was actually trying to tear it down) and tears up a poster i had on it. Ebf comes to restrain her (yes, RESTRAIN) after a while, she comes to my door and yells that she&amp;#39;ll call the cops on me and they&amp;#39;ll take me to juvenile detention. Then she actually does it. Keep in mind i never even touched her yet she tells them i&amp;#39;m being violent. They come and talk to me, i try to explain what&amp;#39;s going on but i&amp;#39;m really scared. After that, they talk to her and leave. She goes to bed.&lt;/p&gt;\n\n&lt;p&gt;While i&amp;#39;m at it, i guess i&amp;#39;ll talk more about the general situation since it feels good to vent. A thing she&amp;#39;d do, and it drove me to a lot of self hate, is that she&amp;#39;d buy these &amp;quot;how to deal with your teenager&amp;quot; books and leave them lying around. Also talked about them to others (including our friends) while im within hearing distance. &lt;/p&gt;\n\n&lt;p&gt;Also, each time id be alone with her she&amp;#39;d stare at me. Id ask what s happening and she&amp;#39;d just start screaming in my face for being a &amp;quot;failure who doesn&amp;#39;t do anything with his time and treats her badly&amp;quot;. Which surprised me since i was the most active of all my siblings, being in a theatre club and jrotc. Sorry if the free time i had i chose to spend playing video games. My siblings spent their time with friends so maybe she saw that as more valuable. Of course i&amp;#39;d cry then she&amp;#39;d tell me something along the lines of &amp;quot;don&amp;#39;t you dare cry&amp;quot;. At least i didn&amp;#39;t get punished for crying like my sister. Worst part is, she&amp;#39;d just walk into my room and stare at me, then have outbursts. Even when other people were in the house. Then she&amp;#39;d laugh about it with her friends (making them very uncomfortable) calling those moments me throwing fits.&lt;/p&gt;\n\n&lt;p&gt;It got more frequent as i was soon to be leaving for college. Up to once a night she&amp;#39;d do it. Leading to her kicking me out maybe 2 weeks before. Thankfully my dad rushed over to help from another town over even though he wasn&amp;#39;t supposed to have us for a week. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll keep ranting more in other posts but this is enough for now&lt;/p&gt;\n\n&lt;p&gt;The main story happened in the summer of 2012. I&amp;#39;ve been NC for almost a year and a half and no regrets. I&amp;#39;m studying and have a great job, great friends that help with my self esteem and overall doing the most stable i&amp;#39;ve ever been. Only thing i need to fix is my love life but i guess you cant have everything xD&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is just a little story from a few years ago. I'm NC but sometimes remember things like this and find them funny, but at the time I was terrified\n\nSee, nmom would do this thing. If there was a minor thing someone did that annoyed her (leave the cupboard open, leave toothpaste in the sink without washing it, dirty plate on the counter) she'd put the house on lockdown. The kids went to our rooms and weren't allowed to come out while she'd scream at each of us in turns threatening different stuff (grounded for x amount of months, take your bed away, no meals) until someone took the blame. The thing is these were very minor things, often the result of someone forgetting something so even the person who did it wouldn't remember (and im pretty sure her or her ebf were guilty of a few). The result was each time one of us kids volunteered to be the scapegoat.\n\nEither way, as the title indicated, one time it was floss left in the sink. She went to the bathroom during diner, saw it, and interrupted the meal to do her thing.  After a while, she takes me and tells me she knows i did it and starts screaming in my face. I run to my room and lock myself in. She goes absolutely berserk. I kid you not, full 28 days later. Screeching incomprehensible things, arms flailing. She starts to punch my door (i say punch, not knock. She was actually trying to tear it down) and tears up a poster i had on it. Ebf comes to restrain her (yes, RESTRAIN) after a while, she comes to my door and yells that she'll call the cops on me and they'll take me to juvenile detention. Then she actually does it. Keep in mind i never even touched her yet she tells them i'm being violent. They come and talk to me, i try to explain what's going on but i'm really scared. After that, they talk to her and leave. She goes to bed.\n\nWhile i'm at it, i guess i'll talk more about the general situation since it feels good to vent. A thing she'd do, and it drove me to a lot of self hate, is that she'd buy these \"how to deal with your teenager\" books and leave them lying around. Also talked about them to others (including our friends) while im within hearing distance. \n\nAlso, each time id be alone with her she'd stare at me. Id ask what s happening and she'd just start screaming in my face for being a \"failure who doesn't do anything with his time and treats her badly\". Which surprised me since i was the most active of all my siblings, being in a theatre club and jrotc. Sorry if the free time i had i chose to spend playing video games. My siblings spent their time with friends so maybe she saw that as more valuable. Of course i'd cry then she'd tell me something along the lines of \"don't you dare cry\". At least i didn't get punished for crying like my sister. Worst part is, she'd just walk into my room and stare at me, then have outbursts. Even when other people were in the house. Then she'd laugh about it with her friends (making them very uncomfortable) calling those moments me throwing fits.\n\nIt got more frequent as i was soon to be leaving for college. Up to once a night she'd do it. Leading to her kicking me out maybe 2 weeks before. Thankfully my dad rushed over to help from another town over even though he wasn't supposed to have us for a week. \n\nI'll keep ranting more in other posts but this is enough for now\n\nThe main story happened in the summer of 2012. I've been NC for almost a year and a half and no regrets. I'm studying and have a great job, great friends that help with my self esteem and overall doing the most stable i've ever been. Only thing i need to fix is my love life but i guess you cant have everything xD", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Rant/Vent]", "id": "65k8ad", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 87, "report_reasons": null, "author": "metro_dweller", "saved": false, "mod_reports": [], "name": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65k8ad/nmom_called_the_cops_on_me_because_of_dental_floss/", "num_reports": null, "locked": false, "stickied": false, "created": 1492305594.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65k8ad/nmom_called_the_cops_on_me_because_of_dental_floss/", "author_flair_text": null, "quarantine": false, "title": "Nmom called the cops on me because of dental floss", "created_utc": 1492276794.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 87}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgbekxp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "encatidated", "parent_id": "t1_dgb1l6n", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I know we don't diagnose here, but my bet is untreated Borderline. My friend's mom had the same rages and bizarre outbursts. In front of non-family and everything. She even went off on me once. Add some N traits to my friend's mom and the result would totally look like OP's mom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know we don&amp;#39;t diagnose here, but my bet is untreated Borderline. My friend&amp;#39;s mom had the same rages and bizarre outbursts. In front of non-family and everything. She even went off on me once. Add some N traits to my friend&amp;#39;s mom and the result would totally look like OP&amp;#39;s mom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbekxp", "score_hidden": false, "stickied": false, "created": 1492330857.0, "created_utc": 1492302057.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1l6n", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "Mohoyorodo", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "What the fuck? I really want to know what is wrong with her. This is very extreme and so creepy. Was it narcissistic rage? Does she have some other issues too? I feel like she was about to snap on you. I'm glad you're out! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What the fuck? I really want to know what is wrong with her. This is very extreme and so creepy. Was it narcissistic rage? Does she have some other issues too? I feel like she was about to snap on you. I&amp;#39;m glad you&amp;#39;re out! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgb1l6n", "score_hidden": false, "stickied": false, "created": 1492312714.0, "created_utc": 1492283914.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgbzc8g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "angstyart", "parent_id": "t1_dgbso35", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm sorry. It sucks ass. Especially when you have normal disagreements between friends and freeze up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry. It sucks ass. Especially when you have normal disagreements between friends and freeze up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbzc8g", "score_hidden": false, "stickied": false, "created": 1492374862.0, "created_utc": 1492346062.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbso35", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WarriorQueenofM45", "parent_id": "t1_dgb5bt9", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Jesus Jeep Cherokee Christ, this resonates with my teenhood.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus Jeep Cherokee Christ, this resonates with my teenhood.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbso35", "score_hidden": false, "stickied": false, "created": 1492354379.0, "created_utc": 1492325579.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5bt9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "angstyart", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm really glad you've gone NC. Your mom sounds terrifying. It seems like it's been really good for you. Has she tried to contact you since then? My mom bought a bunch of self-help books for \"bratty teenagers\" too. They're still on the bookshelves. Of course, they're all by popular whack-jobs and not by real psychologists. I used to read them when I ran out of reading material in the house. One of them refers to children as \"buzzards,\" like a loving parent should. \n\nI also used get called out for crying. Not even crying, just facial expressions that \"conveyed disrespect\" like a tight jaw or anything that wasn't a blank stare. Smiling and saying \"yes ma'am\" was also disrespectful. This hasn't changed, but I no longer cry and I try to avoid making facial expressions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really glad you&amp;#39;ve gone NC. Your mom sounds terrifying. It seems like it&amp;#39;s been really good for you. Has she tried to contact you since then? My mom bought a bunch of self-help books for &amp;quot;bratty teenagers&amp;quot; too. They&amp;#39;re still on the bookshelves. Of course, they&amp;#39;re all by popular whack-jobs and not by real psychologists. I used to read them when I ran out of reading material in the house. One of them refers to children as &amp;quot;buzzards,&amp;quot; like a loving parent should. &lt;/p&gt;\n\n&lt;p&gt;I also used get called out for crying. Not even crying, just facial expressions that &amp;quot;conveyed disrespect&amp;quot; like a tight jaw or anything that wasn&amp;#39;t a blank stare. Smiling and saying &amp;quot;yes ma&amp;#39;am&amp;quot; was also disrespectful. This hasn&amp;#39;t changed, but I no longer cry and I try to avoid making facial expressions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgb5bt9", "score_hidden": false, "stickied": false, "created": 1492317781.0, "created_utc": 1492288981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgb9p9w", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "IAmBaconsaur", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Man, N's love their self-help books that are oriented for other people. My Nmom is basically allergic to technology, so I set up an Amazon account, she bought a book called \"You're Already Amazing: Embracing Who You Are, Becoming All God Created You To Be\" and then \"Living with a Passive-Aggressive Man: Coping with Hidden Aggression - From the Bedroom to the Boardroom\". Ego and projection right there. She's the crazy passive-aggressive one.\n\nCongrats on going NC and making something of yourself. Remember, your N's ideas of who you are, area really her projecting on you. Great friends who can show you who you really are are so valuable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, N&amp;#39;s love their self-help books that are oriented for other people. My Nmom is basically allergic to technology, so I set up an Amazon account, she bought a book called &amp;quot;You&amp;#39;re Already Amazing: Embracing Who You Are, Becoming All God Created You To Be&amp;quot; and then &amp;quot;Living with a Passive-Aggressive Man: Coping with Hidden Aggression - From the Bedroom to the Boardroom&amp;quot;. Ego and projection right there. She&amp;#39;s the crazy passive-aggressive one.&lt;/p&gt;\n\n&lt;p&gt;Congrats on going NC and making something of yourself. Remember, your N&amp;#39;s ideas of who you are, area really her projecting on you. Great friends who can show you who you really are are so valuable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgb9p9w", "score_hidden": false, "stickied": false, "created": 1492323861.0, "created_utc": 1492295061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgb6oi2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TylerJaden24", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "My nmom did and still does the same thing. She called  the cops on me over a tea box. The other day she stood outside my door yelling at  me for touching one of her things. Mind you, 5 mins before that she had admitted she threw my food in the trash...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My nmom did and still does the same thing. She called  the cops on me over a tea box. The other day she stood outside my door yelling at  me for touching one of her things. Mind you, 5 mins before that she had admitted she threw my food in the trash...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgb6oi2", "score_hidden": false, "stickied": false, "created": 1492319659.0, "created_utc": 1492290859.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgbi087", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "drimmie", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm sorry. Aside from calling the cops, this sounds exactly like my mother..with the way she would become so unhinged over the stupidest shit. I remember this one time about 20 years ago...back then I was 16 years old. I was on my computer and had moved the telephone (landline phone) closer to my desk so I could talk to my friend while I was finishing up my work. A few minutes later I walked across the street to visit my friend and hang out with him on his porch. Soon after, my mom comes flying out the door, wailing and screaming at the top of her lungs over how I moved the phone (4 inches). She ran to her car, started it and drove off down the road (still screaming like a maniac). This happened in broad daylight in front of all the kids in my small town. I was extremely embarrassed. My friend and his sister looked at me in shock. It was their first time seeing her act like this. To me, it was just another day. I've been in VLC with her since 2000. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry. Aside from calling the cops, this sounds exactly like my mother..with the way she would become so unhinged over the stupidest shit. I remember this one time about 20 years ago...back then I was 16 years old. I was on my computer and had moved the telephone (landline phone) closer to my desk so I could talk to my friend while I was finishing up my work. A few minutes later I walked across the street to visit my friend and hang out with him on his porch. Soon after, my mom comes flying out the door, wailing and screaming at the top of her lungs over how I moved the phone (4 inches). She ran to her car, started it and drove off down the road (still screaming like a maniac). This happened in broad daylight in front of all the kids in my small town. I was extremely embarrassed. My friend and his sister looked at me in shock. It was their first time seeing her act like this. To me, it was just another day. I&amp;#39;ve been in VLC with her since 2000. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbi087", "score_hidden": false, "stickied": false, "created": 1492335773.0, "created_utc": 1492306973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgbmk6p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cheeto_si_dos", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is disturbingly similar to my experience.  I wonder if your mom is like mine and thinks she can communicate with people telepathically.  It would explain the staring followed by outbursts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is disturbingly similar to my experience.  I wonder if your mom is like mine and thinks she can communicate with people telepathically.  It would explain the staring followed by outbursts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbmk6p", "score_hidden": false, "stickied": false, "created": 1492342557.0, "created_utc": 1492313757.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgbeke0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NikkitheChocoholic", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Please tell me that the police didn't charge you with anything or do anything to you ;-; ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please tell me that the police didn&amp;#39;t charge you with anything or do anything to you ;-; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbeke0", "score_hidden": false, "stickied": false, "created": 1492330833.0, "created_utc": 1492302033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgc3ewl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MyTitsAreRustled", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That is a whole lot of crazy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is a whole lot of crazy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc3ewl", "score_hidden": false, "stickied": false, "created": 1492382403.0, "created_utc": 1492353603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65k8ad", "likes": null, "replies": "", "user_reports": [], "id": "dgc4xo0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "press-n-seal", "parent_id": "t3_65k8ad", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Your mom and my mom are kindred spirits on the rage over small things front. I remember my mom found crumbs on the counter once (I made a sammich and didn't wipe the counter). She went into a full rage and started dumping things on the counter \"if we're going to live like pigs I might as well...\". Globs of mayo, handfuls of cereal, ketchup, bread chunks...all slathered over all of the kitchen counters. Then she stormed off and my dad cleaned up. Sigh.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mom and my mom are kindred spirits on the rage over small things front. I remember my mom found crumbs on the counter once (I made a sammich and didn&amp;#39;t wipe the counter). She went into a full rage and started dumping things on the counter &amp;quot;if we&amp;#39;re going to live like pigs I might as well...&amp;quot;. Globs of mayo, handfuls of cereal, ketchup, bread chunks...all slathered over all of the kitchen counters. Then she stormed off and my dad cleaned up. Sigh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc4xo0", "score_hidden": false, "stickied": false, "created": 1492384672.0, "created_utc": 1492355872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]