[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Context: Edad had a first marriage that produced my sibling before he married my nmom. Sibling is ten years older than me. Long story.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s so much to say to explain the situation, the back story, but basically nmom hates my sibling and claims all these things that are not true about sibling. Sibling experienced a lot of trauma as a child and my nmom makes herself the victim of it in every story, she is the martyr that &amp;quot;had to care for&amp;quot; sibling. When in reality, my parents treated sibling very poorly, to the point my grandparent had to step in and tell the court to give sibling to their bio mom, and from there ended up being raised by our grandparents. Because my parents were too inept to do it effectively and nmom was convinced sibling was a devil child (sibling wasn&amp;#39;t. multiple therapists confirmed sibling was fine, nmom didn&amp;#39;t believe them.)&lt;/p&gt;\n\n&lt;p&gt;All that time, sibling was holding out for me. They revealed a lot of my early raising fell on them, as a child!!, because I would for example be crying in my playpen to be fed or cleaned and edad would just sit there. Nmom has the legitimate excuse of being deathly ill and also working 100 hour weeks at the time (after switching doctors years later, one finally realized an organ was failing and a surgery put an end to the illness). But she told the courts sibling &amp;quot;didn&amp;#39;t help out at home&amp;quot; when in reality sibling was raising me. Welp.&lt;/p&gt;\n\n&lt;p&gt;Sibling has been holding out for me this whole time even though they were essentially NC with nmom and VLC with edad. I mentioned my current summer plans and how I was stressing how to pay for my own cell phone plan and how I eventually have to pay my parents back for my car if I want the title in my name. Sibling offered to not only get me a second secret phone and add it to the bundle they&amp;#39;re already paying for their household (they have one unused line they&amp;#39;re paying for in their bundle and nobody&amp;#39;s using it) and also offered to let me use an old car of theirs if parents go super narc and take away my car.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just really stunned. Because I cannot stress enough, nmom brainwashed me growing up to think my sibling was a drug addict and/or dealer, that if I got in the car with them we could get pulled over and they&amp;#39;d find marijuana and I would go to jail for association (which is true in our state). Turns out sibling can&amp;#39;t smoke pot... they projectile vomit in response to it!! The shit nmom was exaggerating is that sibling got into cigarettes one time. Nmom lied about every single thing about my sibling and always told me to be careful around them, and if I ever stood up to nmom she&amp;#39;d accuse sibling of brainwashing &lt;em&gt;me&lt;/em&gt;! &lt;/p&gt;\n\n&lt;p&gt;Nope, nmom hates them because my sibling, in their own words, &amp;quot;won&amp;#39;t take shit and haven&amp;#39;t taken it since I was 10&amp;quot;. Sibling would talk back and defend themselves shamelessly because they knew nmom was abusing them. To this day, nmom will tell her sob story of the devil child and claim that even as an adult, sibling &amp;quot;cheats on guys and bounces from guy to guy and is never faithful&amp;quot; etc even when they haven&amp;#39;t talked to sibling directly in at least a year.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so mind boggling but reality makes so much more sense with all these details filled in.&lt;/p&gt;\n\n&lt;p&gt;Anyway, tl;dr, I have a backup plan if all hell breaks loose before or shortly after I get my degrees. I learned some sick, cruel things nmom did when I was little that help to explain the cruel and abusive things she does now. Doesn&amp;#39;t make them okay, but certainly helps explain the &amp;quot;where did &lt;em&gt;that&lt;/em&gt; come from??&amp;quot; stuff. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Context: Edad had a first marriage that produced my sibling before he married my nmom. Sibling is ten years older than me. Long story.\n\nThere's so much to say to explain the situation, the back story, but basically nmom hates my sibling and claims all these things that are not true about sibling. Sibling experienced a lot of trauma as a child and my nmom makes herself the victim of it in every story, she is the martyr that \"had to care for\" sibling. When in reality, my parents treated sibling very poorly, to the point my grandparent had to step in and tell the court to give sibling to their bio mom, and from there ended up being raised by our grandparents. Because my parents were too inept to do it effectively and nmom was convinced sibling was a devil child (sibling wasn't. multiple therapists confirmed sibling was fine, nmom didn't believe them.)\n\nAll that time, sibling was holding out for me. They revealed a lot of my early raising fell on them, as a child!!, because I would for example be crying in my playpen to be fed or cleaned and edad would just sit there. Nmom has the legitimate excuse of being deathly ill and also working 100 hour weeks at the time (after switching doctors years later, one finally realized an organ was failing and a surgery put an end to the illness). But she told the courts sibling \"didn't help out at home\" when in reality sibling was raising me. Welp.\n\nSibling has been holding out for me this whole time even though they were essentially NC with nmom and VLC with edad. I mentioned my current summer plans and how I was stressing how to pay for my own cell phone plan and how I eventually have to pay my parents back for my car if I want the title in my name. Sibling offered to not only get me a second secret phone and add it to the bundle they're already paying for their household (they have one unused line they're paying for in their bundle and nobody's using it) and also offered to let me use an old car of theirs if parents go super narc and take away my car.\n\nI'm just really stunned. Because I cannot stress enough, nmom brainwashed me growing up to think my sibling was a drug addict and/or dealer, that if I got in the car with them we could get pulled over and they'd find marijuana and I would go to jail for association (which is true in our state). Turns out sibling can't smoke pot... they projectile vomit in response to it!! The shit nmom was exaggerating is that sibling got into cigarettes one time. Nmom lied about every single thing about my sibling and always told me to be careful around them, and if I ever stood up to nmom she'd accuse sibling of brainwashing *me*! \n\nNope, nmom hates them because my sibling, in their own words, \"won't take shit and haven't taken it since I was 10\". Sibling would talk back and defend themselves shamelessly because they knew nmom was abusing them. To this day, nmom will tell her sob story of the devil child and claim that even as an adult, sibling \"cheats on guys and bounces from guy to guy and is never faithful\" etc even when they haven't talked to sibling directly in at least a year.\n\nIt's so mind boggling but reality makes so much more sense with all these details filled in.\n\nAnyway, tl;dr, I have a backup plan if all hell breaks loose before or shortly after I get my degrees. I learned some sick, cruel things nmom did when I was little that help to explain the cruel and abusive things she does now. Doesn't make them okay, but certainly helps explain the \"where did *that* come from??\" stuff. \n\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Progress]", "id": "65nr0d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 76, "report_reasons": null, "author": "temporaryspider", "saved": false, "mod_reports": [], "name": "t3_65nr0d", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65nr0d/progress_thank_god_for_adult_siblings_that_hold/", "num_reports": null, "locked": false, "stickied": false, "created": 1492351031.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65nr0d/progress_thank_god_for_adult_siblings_that_hold/", "author_flair_text": null, "quarantine": false, "title": "[Progress] Thank god for adult siblings that hold out for you and wait for you to realize the narcness.", "created_utc": 1492322231.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 76}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65nr0d", "likes": null, "replies": "", "user_reports": [], "id": "dgbvf3w", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "reality_or_a_dream", "parent_id": "t3_65nr0d", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Your sibling is a wonderful person, please remind him/her of that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your sibling is a wonderful person, please remind him/her of that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbvf3w", "score_hidden": false, "stickied": false, "created": 1492362646.0, "created_utc": 1492333846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65nr0d", "likes": null, "replies": "", "user_reports": [], "id": "dgbzq5f", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "afavorcaptain", "parent_id": "t3_65nr0d", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm so glad your sibling is in a position to help you and you are able to see past your N's smear campaign and brainwashing. You guys are stronger together - the N wants you to be divided.\n\nThis post gives me a bit of hope that my younger siblings may reach out to me one day when they are older. I'm the oldest and the SG. I'm NC with everyone right now and my Ndad and Nstepmom are leading a horrible smear campaign at the moment. My siblings truly believe I hate them and tried to hurt them (in reality, I did the best thing for them - calling cps. Too bad it didn't go anywhere). They all believe I am following Satan's path to the letter and going to hell. All I want is for them to be free of Ndad. I'd drop everything in a heartbeat to help my siblings escape him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so glad your sibling is in a position to help you and you are able to see past your N&amp;#39;s smear campaign and brainwashing. You guys are stronger together - the N wants you to be divided.&lt;/p&gt;\n\n&lt;p&gt;This post gives me a bit of hope that my younger siblings may reach out to me one day when they are older. I&amp;#39;m the oldest and the SG. I&amp;#39;m NC with everyone right now and my Ndad and Nstepmom are leading a horrible smear campaign at the moment. My siblings truly believe I hate them and tried to hurt them (in reality, I did the best thing for them - calling cps. Too bad it didn&amp;#39;t go anywhere). They all believe I am following Satan&amp;#39;s path to the letter and going to hell. All I want is for them to be free of Ndad. I&amp;#39;d drop everything in a heartbeat to help my siblings escape him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbzq5f", "score_hidden": false, "stickied": false, "created": 1492375760.0, "created_utc": 1492346960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65nr0d", "likes": null, "replies": "", "user_reports": [], "id": "dgc6dy1", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "poundsoffat", "parent_id": "t3_65nr0d", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;I eventually have to pay my parents back for my car if I want the title in my name\n\nAny parent who does this is a disgusting human being and doesn't deserve to have children in their care at all. You don't have children to make them pay you back that's the wrong idea.\n\n&gt; if I ever stood up to nmom she'd accuse sibling of brainwashing me\n\nShe's so obsessed with keeping control that anything that opposes her must be someone else's work. Never her own, deluded foolish idiots like this must be avoided at all costs.\n\nIn any case awesome stuff that you found out that your sibling stuck out there til the end, it's good to have siblings who can see the truth just like you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I eventually have to pay my parents back for my car if I want the title in my name&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Any parent who does this is a disgusting human being and doesn&amp;#39;t deserve to have children in their care at all. You don&amp;#39;t have children to make them pay you back that&amp;#39;s the wrong idea.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;if I ever stood up to nmom she&amp;#39;d accuse sibling of brainwashing me&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She&amp;#39;s so obsessed with keeping control that anything that opposes her must be someone else&amp;#39;s work. Never her own, deluded foolish idiots like this must be avoided at all costs.&lt;/p&gt;\n\n&lt;p&gt;In any case awesome stuff that you found out that your sibling stuck out there til the end, it&amp;#39;s good to have siblings who can see the truth just like you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc6dy1", "score_hidden": false, "stickied": false, "created": 1492386668.0, "created_utc": 1492357868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65nr0d", "likes": null, "replies": "", "user_reports": [], "id": "dgd04fv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "indyj9", "parent_id": "t3_65nr0d", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I hope that when I can move out, I will be able to have a decent enough financial situation like your sibling to support my younger brother (6 year difference) if he needs help", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope that when I can move out, I will be able to have a decent enough financial situation like your sibling to support my younger brother (6 year difference) if he needs help&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd04fv", "score_hidden": false, "stickied": false, "created": 1492426328.0, "created_utc": 1492397528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]