[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if this is the right sub or not but I&amp;#39;ve been lurking for a while and I don&amp;#39;t know where else to ask for advice about this. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m an only child and my mother has a history of being emotionally unstable. &lt;/p&gt;\n\n&lt;p&gt;For example....When I was a child and teenager she would regularly sob in her closet for hours over various things; she still has episodes of crying over inappropriate things in public; over the course of my life she has constantly put me in situations where I feel responsible for her emotional (and sometimes physical) health.&lt;/p&gt;\n\n&lt;p&gt;As a child my parents&amp;#39; relationship wasn&amp;#39;t great so my dad would sleep in a separate room and I&amp;#39;d sleep with my mom. This went on for FAR too long (like, well into junior high). As an adult she still tries to orchestrate situations where I will sleep next to her because it &amp;quot;comforts her&amp;quot; and it has become increasingly awkward for me.  &lt;/p&gt;\n\n&lt;p&gt;IMPORTANT --&amp;gt; My mother has never touched me inappropriately/sexually during these co-sleeping incidents or at any other time. I&amp;#39;m sure a lot of you were wondering so thought I would get that established early on. &lt;/p&gt;\n\n&lt;p&gt;Anyway, I grew up thinking there was nothing weird about this. Now I know better. I spent so many years feeling guilty and thinking I was a bad daughter, simply because I hated the whole arrangement and it made me feel very uncomfortable. Fortunately, I&amp;#39;ve lived with my SO for the past 5 years and haven&amp;#39;t had to deal with this issue nearly as much. &lt;/p&gt;\n\n&lt;p&gt;Flash forward to present day. My SO and I are each temporarily (for 1 month) staying with our mothers (who are both divorced from our fathers and remarried now) in our neighboring home towns while we look for a new place. He just got a job transfer and we had to move cross country back to our home state. &lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m staying with my mom and step dad. Yesterday I had a UC flare up and was sick all day. My mom was concerned and super helpful about it. As evening approaches she informs me that myself and my dog will be sleeping in her bed with her that night and her husband will be sleeping on the couch. &lt;/p&gt;\n\n&lt;p&gt;Now, firstly, I have my own wing in their house with bedroom and bathroom so this is absolutely unnecessary. And secondly, it makes me very uncomfortable. Thirdly, it makes me feel awkward because she said it was my step dad&amp;#39;s idea and  framed it like he should be thanked for sacrificing his bed for us. &lt;/p&gt;\n\n&lt;p&gt;God this is so fucking weird and I&amp;#39;m cringing as I type. &lt;/p&gt;\n\n&lt;p&gt;So I look at her with what I&amp;#39;m sure was visible  horror and try to get out of it. She acts like I&amp;#39;m just trying to be polite and keeps saying &amp;quot;No it&amp;#39;s really ok. I promise he doesn&amp;#39;t mind.&amp;quot; And I kept thinking, &amp;quot;But I mind! I mind a LOT.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So I say OK and the afternoon progresses. I&amp;#39;m thinking about whether it&amp;#39;s worth it to rock the boat and just refuse to sleep with her or whether I should just suck it up and do it to avoid having to deal with her having an emotional breakdown. &lt;/p&gt;\n\n&lt;p&gt;In the end I decide that absolutely no fucking way am I—a 30-year old woman—going to sleep in the same bed as my mother when there are plenty of other beds to go around. &lt;/p&gt;\n\n&lt;p&gt;I tell her and she gets upset. Starts asking me if it&amp;#39;s because I&amp;#39;m mad at her. Or my stepdad. Then she says, (with a deeply wounded tone) &amp;quot;Do you just not want to sleep with me?&amp;quot; And I say that no, I don&amp;#39;t. She looks like she&amp;#39;s about to cry and lose it so I say, &amp;quot;it&amp;#39;s not you. It&amp;#39;s just that [dog] gets up at all hours and I like being on the other side of the house so I can let her out without waking anyone else up. Also I have UC and having my own bathroom is a major plus. &lt;/p&gt;\n\n&lt;p&gt;She then says, &amp;quot;because you know it was really for me. Because I need it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And I just had no response. WTF&lt;/p&gt;\n\n&lt;p&gt;It makes me angry just thinking about it and typing it here. How dare she try and guilt trip me for not wanting to be her emotional crutch and participate in culturally inappropriate things like co-sleeping with your mother as an adult?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only recently been looking back on my childhood and realizing how fucked up and unhealthy it was. But I feel immensely guilty about that because my mother has always drilled it into my head (not in a mean way at all, but still) that she sacrificed everything for me and that the entire and only reason she is alive is for me and that if I died she would kill herself. She&amp;#39;s always talking about how she devoted her entire life to raising me right and not repeating mistakes her abusive parents made (worth noting that my grandmother, her mother, has weird boundary crossing issues like this, too. But that&amp;#39;s another post) so when I look back and start questioning how things she&amp;#39;s done have damaged me, it makes me feel ungrateful. &lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s this logical side of my mind saying &amp;quot;no, she is weird and you are normal for feeling uncomfortable. Do not feel guilty about this!&amp;quot; And then there&amp;#39;s the conditioned part of my mind saying, &amp;quot;How dare you be so ungrateful to her? She sacrificed everything for you and now she needs you and you won&amp;#39;t even do a little thing like sleep with her because it makes her happy?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I have so many more stories like this but wanted to start here because it just happened and I don&amp;#39;t know what to do about it. Also trying to gauge if I really am a selfish ungrateful shit for feeling this way or not. &lt;/p&gt;\n\n&lt;p&gt;UPDATE: \nFirstly, thank you for all the responses. I feel very lucky to have found this sub and the Reddit community in general. &lt;/p&gt;\n\n&lt;p&gt;After reading my initial post I wanted to clarify that this is not the only emotionally odd/needy thing my mother has done to me. This behavior goes way back to my early childhood and manifests in so many more areas of my life than just sleeping arrangements. &lt;/p&gt;\n\n&lt;p&gt;For reference...&lt;/p&gt;\n\n&lt;p&gt;We live in an area prone to hurricanes. A few years ago a minor hurricane was predicted to pass over us and we all expected to lose power for a few days. I lived with my SO about 45 minutes away from my then-single mother. She lived in the town I attended HS in and had tons of friends there. At least 3 of her couple friends and 2 family members invited her personally to &amp;quot;ride out&amp;quot; the hurricane with them. &lt;/p&gt;\n\n&lt;p&gt;Riding out a minor storm can actually be a lot of fun, granted you&amp;#39;re staying with the right people, no one gets hurt, and major disaster is averted. My SO and I lived in a 900 sq ft 1 bedroom 1 bathroom condo in the city. We had already invited a few of his foreign co-residents to hang with us during the storm because they had no family in the states. We were planning a pretty sweet hurricane party. &lt;/p&gt;\n\n&lt;p&gt;A day or so before the storm my mom calls me and asks to come and stay with me and SO. I was taken aback and asked her if she could stay with our family or any of her friends in her town, since we had ONE bed and we&amp;#39;re already inviting other people over to stay. &lt;/p&gt;\n\n&lt;p&gt;She immediately got upset and started crying, asking why I was rejecting her and saying she didn&amp;#39;t want to be alone with her dog during the storm and that [for absolutely no good reason] these other invitations from friends and family just weren&amp;#39;t viable options. She was bawling about how I don&amp;#39;t love her and how could I just leave her like that? And she was so scared to be alone and I&amp;#39;m abandoning her and...you get the idea. &lt;/p&gt;\n\n&lt;p&gt;**PLEASE understand that I would never refuse my mother if she had no where else to go and needed to stay with us. Neither would my SO. But in this situation she had, by her own admission, SEVERAL other offers from friends and family who didn&amp;#39;t want her to be alone during the storm. Yet she preferred to travel 45 minutes and make one of us sleep on the couch/floor just to inconvenience me and SO instead of just driving 5 minutes down the road to stay with friends in a huge house with plenty of extra bedrooms. I just found the whole thing unnecessary.&lt;/p&gt;\n\n&lt;p&gt;Her behavior made me angry because I felt manipulated and guilted into doing something that was abnormal. Like, why is she begging her 26 year old (at the time) daughter to stay with her during a hurricane? Shouldn&amp;#39;t she be the one calling me to make sure I have a safe place to go?&lt;/p&gt;\n\n&lt;p&gt;She even enlisted my grandparents to call me and try to guilt me into letting her stay with us. Thankfully my SO helped me to stay strong and rebuff all of these attempts to manipulate me. It&amp;#39;s like I knew it was tucked up and unhealthy and just having him there to confirm it made me resolute. &lt;/p&gt;\n\n&lt;p&gt;Well I&amp;#39;m sure you can guess what happened. My mother refused all invitations  and rode out the storm alone, in her house, with her dog. &lt;/p&gt;\n\n&lt;p&gt;It took weeks for her to stop bringing it up randomly and crying uncontrollably about it (usually in public).and my grandparents blamed me because of course they did. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t regret saying no, but it hasn&amp;#39;t done anything to make her respect my boundaries. It&amp;#39;s like shoveling snow in a blizzard. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not sure if this is the right sub or not but I've been lurking for a while and I don't know where else to ask for advice about this. \n\nI'm an only child and my mother has a history of being emotionally unstable. \n\nFor example....When I was a child and teenager she would regularly sob in her closet for hours over various things; she still has episodes of crying over inappropriate things in public; over the course of my life she has constantly put me in situations where I feel responsible for her emotional (and sometimes physical) health.\n\nAs a child my parents' relationship wasn't great so my dad would sleep in a separate room and I'd sleep with my mom. This went on for FAR too long (like, well into junior high). As an adult she still tries to orchestrate situations where I will sleep next to her because it \"comforts her\" and it has become increasingly awkward for me.  \n\nIMPORTANT --&gt; My mother has never touched me inappropriately/sexually during these co-sleeping incidents or at any other time. I'm sure a lot of you were wondering so thought I would get that established early on. \n\nAnyway, I grew up thinking there was nothing weird about this. Now I know better. I spent so many years feeling guilty and thinking I was a bad daughter, simply because I hated the whole arrangement and it made me feel very uncomfortable. Fortunately, I've lived with my SO for the past 5 years and haven't had to deal with this issue nearly as much. \n\nFlash forward to present day. My SO and I are each temporarily (for 1 month) staying with our mothers (who are both divorced from our fathers and remarried now) in our neighboring home towns while we look for a new place. He just got a job transfer and we had to move cross country back to our home state. \n\nSo I'm staying with my mom and step dad. Yesterday I had a UC flare up and was sick all day. My mom was concerned and super helpful about it. As evening approaches she informs me that myself and my dog will be sleeping in her bed with her that night and her husband will be sleeping on the couch. \n\nNow, firstly, I have my own wing in their house with bedroom and bathroom so this is absolutely unnecessary. And secondly, it makes me very uncomfortable. Thirdly, it makes me feel awkward because she said it was my step dad's idea and  framed it like he should be thanked for sacrificing his bed for us. \n\nGod this is so fucking weird and I'm cringing as I type. \n\nSo I look at her with what I'm sure was visible  horror and try to get out of it. She acts like I'm just trying to be polite and keeps saying \"No it's really ok. I promise he doesn't mind.\" And I kept thinking, \"But I mind! I mind a LOT.\"\n\nSo I say OK and the afternoon progresses. I'm thinking about whether it's worth it to rock the boat and just refuse to sleep with her or whether I should just suck it up and do it to avoid having to deal with her having an emotional breakdown. \n\nIn the end I decide that absolutely no fucking way am I—a 30-year old woman—going to sleep in the same bed as my mother when there are plenty of other beds to go around. \n\nI tell her and she gets upset. Starts asking me if it's because I'm mad at her. Or my stepdad. Then she says, (with a deeply wounded tone) \"Do you just not want to sleep with me?\" And I say that no, I don't. She looks like she's about to cry and lose it so I say, \"it's not you. It's just that [dog] gets up at all hours and I like being on the other side of the house so I can let her out without waking anyone else up. Also I have UC and having my own bathroom is a major plus. \n\nShe then says, \"because you know it was really for me. Because I need it.\"\n\nAnd I just had no response. WTF\n\nIt makes me angry just thinking about it and typing it here. How dare she try and guilt trip me for not wanting to be her emotional crutch and participate in culturally inappropriate things like co-sleeping with your mother as an adult?\n\nI've only recently been looking back on my childhood and realizing how fucked up and unhealthy it was. But I feel immensely guilty about that because my mother has always drilled it into my head (not in a mean way at all, but still) that she sacrificed everything for me and that the entire and only reason she is alive is for me and that if I died she would kill herself. She's always talking about how she devoted her entire life to raising me right and not repeating mistakes her abusive parents made (worth noting that my grandmother, her mother, has weird boundary crossing issues like this, too. But that's another post) so when I look back and start questioning how things she's done have damaged me, it makes me feel ungrateful. \n\nSo there's this logical side of my mind saying \"no, she is weird and you are normal for feeling uncomfortable. Do not feel guilty about this!\" And then there's the conditioned part of my mind saying, \"How dare you be so ungrateful to her? She sacrificed everything for you and now she needs you and you won't even do a little thing like sleep with her because it makes her happy?\"\n\nI have so many more stories like this but wanted to start here because it just happened and I don't know what to do about it. Also trying to gauge if I really am a selfish ungrateful shit for feeling this way or not. \n\nUPDATE: \nFirstly, thank you for all the responses. I feel very lucky to have found this sub and the Reddit community in general. \n\nAfter reading my initial post I wanted to clarify that this is not the only emotionally odd/needy thing my mother has done to me. This behavior goes way back to my early childhood and manifests in so many more areas of my life than just sleeping arrangements. \n\nFor reference...\n\nWe live in an area prone to hurricanes. A few years ago a minor hurricane was predicted to pass over us and we all expected to lose power for a few days. I lived with my SO about 45 minutes away from my then-single mother. She lived in the town I attended HS in and had tons of friends there. At least 3 of her couple friends and 2 family members invited her personally to \"ride out\" the hurricane with them. \n\nRiding out a minor storm can actually be a lot of fun, granted you're staying with the right people, no one gets hurt, and major disaster is averted. My SO and I lived in a 900 sq ft 1 bedroom 1 bathroom condo in the city. We had already invited a few of his foreign co-residents to hang with us during the storm because they had no family in the states. We were planning a pretty sweet hurricane party. \n\nA day or so before the storm my mom calls me and asks to come and stay with me and SO. I was taken aback and asked her if she could stay with our family or any of her friends in her town, since we had ONE bed and we're already inviting other people over to stay. \n\nShe immediately got upset and started crying, asking why I was rejecting her and saying she didn't want to be alone with her dog during the storm and that [for absolutely no good reason] these other invitations from friends and family just weren't viable options. She was bawling about how I don't love her and how could I just leave her like that? And she was so scared to be alone and I'm abandoning her and...you get the idea. \n\n**PLEASE understand that I would never refuse my mother if she had no where else to go and needed to stay with us. Neither would my SO. But in this situation she had, by her own admission, SEVERAL other offers from friends and family who didn't want her to be alone during the storm. Yet she preferred to travel 45 minutes and make one of us sleep on the couch/floor just to inconvenience me and SO instead of just driving 5 minutes down the road to stay with friends in a huge house with plenty of extra bedrooms. I just found the whole thing unnecessary.\n\nHer behavior made me angry because I felt manipulated and guilted into doing something that was abnormal. Like, why is she begging her 26 year old (at the time) daughter to stay with her during a hurricane? Shouldn't she be the one calling me to make sure I have a safe place to go?\n\nShe even enlisted my grandparents to call me and try to guilt me into letting her stay with us. Thankfully my SO helped me to stay strong and rebuff all of these attempts to manipulate me. It's like I knew it was tucked up and unhealthy and just having him there to confirm it made me resolute. \n\nWell I'm sure you can guess what happened. My mother refused all invitations  and rode out the storm alone, in her house, with her dog. \n\n\nIt took weeks for her to stop bringing it up randomly and crying uncontrollably about it (usually in public).and my grandparents blamed me because of course they did. \n\nI don't regret saying no, but it hasn't done anything to make her respect my boundaries. It's like shoveling snow in a blizzard. \n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Question]", "id": "65omh0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 80, "report_reasons": null, "author": "Shignabis", "saved": false, "mod_reports": [], "name": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": 1492360419.0, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65omh0/mother_wants_me_30year_old_woman_to_sleep_in_same/", "num_reports": null, "locked": false, "stickied": false, "created": 1492369824.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65omh0/mother_wants_me_30year_old_woman_to_sleep_in_same/", "author_flair_text": null, "quarantine": false, "title": "Mother wants me (30-year old woman) to sleep in same bed as her. Cries when I won't. Why do I feel guilty??", "created_utc": 1492341024.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 42, "visited": false, "subreddit_type": "public", "ups": 80}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgbz4of", "gilded": 0, "archived": false, "score": 59, "report_reasons": null, "author": "HappinessIsAPotato", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;only reason she is alive is for me and that if I died she would kill herself\n\nRUN AWAY!! Classic sign of emotional abuse!! She is definitely in the wrong here, you are not crazy and you are NOT the selfish one here!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;only reason she is alive is for me and that if I died she would kill herself&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;RUN AWAY!! Classic sign of emotional abuse!! She is definitely in the wrong here, you are not crazy and you are NOT the selfish one here!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbz4of", "score_hidden": false, "stickied": false, "created": 1492374356.0, "created_utc": 1492345556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 59}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc3kk6", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "ZLMom", "parent_id": "t1_dgbxp3v", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;  She's asking for something from you without giving you anything in return.\n\nShe's asking for something *completely inappropriate* from you... there's nothing to give in return.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She&amp;#39;s asking for something from you without giving you anything in return.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She&amp;#39;s asking for something &lt;em&gt;completely inappropriate&lt;/em&gt; from you... there&amp;#39;s nothing to give in return.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc3kk6", "score_hidden": false, "stickied": false, "created": 1492382648.0, "created_utc": 1492353848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxp3v", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "not_staying_long_hi", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "You're not being selfish. She's asking for something from you without giving you anything in return.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not being selfish. She&amp;#39;s asking for something from you without giving you anything in return.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbxp3v", "score_hidden": false, "stickied": false, "created": 1492370392.0, "created_utc": 1492341592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgbxvj7", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Ficulinean", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I have older siblings. I think the last time my oldest brother slept in bed with my mom is when he picked me up in the middle of the night from my bed and put me in hers. We *all* disliked it, but wanted to comfort her, what with dad working out of town and her having nightmares. She continued asking me to sleep with her, directly, during junior high. Even now, it's only once every few months that she really presses the issue--or anytime I'm in her room when she's going to bed--and begs me to \"just stay here, you don't have to sleep here all night. You can just fall asleep here. I'll sleep, you watch tv.\"\n\nShe used to cling to my back. I remember thinking I had a goblin next to me and nearly falling off the bed. No, NO, normal parent should be so f**king oblivious to their child's comfort that they use their child as a soother.\n\nIt is not selfish or any mode of unreasonable to decide who sleeps in a bed with you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have older siblings. I think the last time my oldest brother slept in bed with my mom is when he picked me up in the middle of the night from my bed and put me in hers. We &lt;em&gt;all&lt;/em&gt; disliked it, but wanted to comfort her, what with dad working out of town and her having nightmares. She continued asking me to sleep with her, directly, during junior high. Even now, it&amp;#39;s only once every few months that she really presses the issue--or anytime I&amp;#39;m in her room when she&amp;#39;s going to bed--and begs me to &amp;quot;just stay here, you don&amp;#39;t have to sleep here all night. You can just fall asleep here. I&amp;#39;ll sleep, you watch tv.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She used to cling to my back. I remember thinking I had a goblin next to me and nearly falling off the bed. No, NO, normal parent should be so f**king oblivious to their child&amp;#39;s comfort that they use their child as a soother.&lt;/p&gt;\n\n&lt;p&gt;It is not selfish or any mode of unreasonable to decide who sleeps in a bed with you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgbxvj7", "score_hidden": false, "stickied": false, "created": 1492370940.0, "created_utc": 1492342140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc3s93", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "ZLMom", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;She's always talking about how she devoted her entire life to raising me right and not repeating mistakes her abusive parents made\n\nWell if she's still trying to force you into her bed so that *she* feels comfortable, she is *definitely* making abusive \"mistakes\". \n\nShe's saying one thing and doing another. She's crossing all sorts of emotional boundaries. It is not, nor has it ever been, *YOUR* job to \"help\" your mother with her emotional issues - like comforting her in her sleep!!! Or *keeping her alive* - if she's suicidal, it's *NOT YOUR JOB*, as her child - particularly when you were an underage child!!! - to keep her alive FFS. Even as an adult, if she's suicidal she needs professional help - it is *not your place* to do *anything* other than call 911 and have the professionals deal with her.\n\nThat guilt you feel when you set up a boundary like \"I will not sleep in your bed\" is extremely unhealthy. I strongly urge you to seek some counselling to tease out your feelings and learn to stand up for yourself. She has placed an enormous burden upon your shoulders that you should never have had. Her love of you is conditional upon you *sacrificing your wants, needs, and bodily autonomy* for her. Unreasonable in the extreme.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She&amp;#39;s always talking about how she devoted her entire life to raising me right and not repeating mistakes her abusive parents made&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well if she&amp;#39;s still trying to force you into her bed so that &lt;em&gt;she&lt;/em&gt; feels comfortable, she is &lt;em&gt;definitely&lt;/em&gt; making abusive &amp;quot;mistakes&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s saying one thing and doing another. She&amp;#39;s crossing all sorts of emotional boundaries. It is not, nor has it ever been, &lt;em&gt;YOUR&lt;/em&gt; job to &amp;quot;help&amp;quot; your mother with her emotional issues - like comforting her in her sleep!!! Or &lt;em&gt;keeping her alive&lt;/em&gt; - if she&amp;#39;s suicidal, it&amp;#39;s &lt;em&gt;NOT YOUR JOB&lt;/em&gt;, as her child - particularly when you were an underage child!!! - to keep her alive FFS. Even as an adult, if she&amp;#39;s suicidal she needs professional help - it is &lt;em&gt;not your place&lt;/em&gt; to do &lt;em&gt;anything&lt;/em&gt; other than call 911 and have the professionals deal with her.&lt;/p&gt;\n\n&lt;p&gt;That guilt you feel when you set up a boundary like &amp;quot;I will not sleep in your bed&amp;quot; is extremely unhealthy. I strongly urge you to seek some counselling to tease out your feelings and learn to stand up for yourself. She has placed an enormous burden upon your shoulders that you should never have had. Her love of you is conditional upon you &lt;em&gt;sacrificing your wants, needs, and bodily autonomy&lt;/em&gt; for her. Unreasonable in the extreme.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc3s93", "score_hidden": false, "stickied": false, "created": 1492382975.0, "created_utc": 1492354175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc4soy", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "herculaneum", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; that she sacrificed everything for me\n\nWhich is her job.\n\n&gt; the entire and only reason she is alive is for me and that if I died she would kill herself.\n\nWhich is completely and utterly messed up.\n\nThis is not normal, and it's not on you to make her feel secure. Sleep in your own bed without excuses. If she starts to make a scene, ask her where in life or in literature/movies/whatever she has ever seen an adult daughter sleep with her mother. It's not normal. If she \"needs it,\" that's a deficiency in herself or her relationship and has nothing to do with you.\n\nShe is off, and the fact that you feel uncomfortable is your psyche sending you warning messages.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;that she sacrificed everything for me&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Which is her job.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the entire and only reason she is alive is for me and that if I died she would kill herself.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Which is completely and utterly messed up.&lt;/p&gt;\n\n&lt;p&gt;This is not normal, and it&amp;#39;s not on you to make her feel secure. Sleep in your own bed without excuses. If she starts to make a scene, ask her where in life or in literature/movies/whatever she has ever seen an adult daughter sleep with her mother. It&amp;#39;s not normal. If she &amp;quot;needs it,&amp;quot; that&amp;#39;s a deficiency in herself or her relationship and has nothing to do with you.&lt;/p&gt;\n\n&lt;p&gt;She is off, and the fact that you feel uncomfortable is your psyche sending you warning messages.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc4soy", "score_hidden": false, "stickied": false, "created": 1492384479.0, "created_utc": 1492355679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc9xwd", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Ficulinean", "parent_id": "t1_dgc75oc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I can picture that. That is why big confrontations are on my avoid list. Oh, going to apologize in five minutes for a decade of neglect, an apology brought on by two hours of shouting yesterday, and not apologize for the verbal abuse, and then tell me that I need to do better too--when standing up to the neglect is what got me verbally abused to begin with, and was as much as a child could do to do better. Yep, I'll hug you because you are crying. It's not worth it. Her getting assurance that everything is better, and nothing ever changing.\n\nYou know her behaviour well, you don't need to confront her if not doing so is not holding you back from getting better.", "edited": 1492363797.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can picture that. That is why big confrontations are on my avoid list. Oh, going to apologize in five minutes for a decade of neglect, an apology brought on by two hours of shouting yesterday, and not apologize for the verbal abuse, and then tell me that I need to do better too--when standing up to the neglect is what got me verbally abused to begin with, and was as much as a child could do to do better. Yep, I&amp;#39;ll hug you because you are crying. It&amp;#39;s not worth it. Her getting assurance that everything is better, and nothing ever changing.&lt;/p&gt;\n\n&lt;p&gt;You know her behaviour well, you don&amp;#39;t need to confront her if not doing so is not holding you back from getting better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc9xwd", "score_hidden": false, "stickied": false, "created": 1492391362.0, "created_utc": 1492362562.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcd5h3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "skippedrecord", "parent_id": "t1_dgc75oc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is very much my mom. The trying to sleep in my bed even though I'm in my 30s (also brush my hair), crying over abandoning her, using me as a therapist, constantly lamenting the abuse her mom piled on her. Everything!\n\nI also had the same deal with seeing my dad as evil and mom as a saint. Eventually, I saw too that this wasn't true. My mom's abuse was just more subtle.\n\nFeel free to stalk some of my submitted posts, I got some great advice in the comments.\n\nI'm NC now and for me, the changes have been remarkable and life altering. I'm happy with my choice, it was absolutely the right one for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is very much my mom. The trying to sleep in my bed even though I&amp;#39;m in my 30s (also brush my hair), crying over abandoning her, using me as a therapist, constantly lamenting the abuse her mom piled on her. Everything!&lt;/p&gt;\n\n&lt;p&gt;I also had the same deal with seeing my dad as evil and mom as a saint. Eventually, I saw too that this wasn&amp;#39;t true. My mom&amp;#39;s abuse was just more subtle.&lt;/p&gt;\n\n&lt;p&gt;Feel free to stalk some of my submitted posts, I got some great advice in the comments.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m NC now and for me, the changes have been remarkable and life altering. I&amp;#39;m happy with my choice, it was absolutely the right one for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcd5h3", "score_hidden": false, "stickied": false, "created": 1492395611.0, "created_utc": 1492366811.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc75oc", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Shignabis", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Thanks for saying that. \n\nYou hit the nail on the head several times. She definitely does behave like a small child (emotionally) and is incredibly needy. She always encouraged me to get therapy as a child and teen. I had anxiety and a few years of depression issues as a teen and saw a LCSW weekly for a while in addition to a psychiatrist. I still see the psychiatrist and am waiting for better insurance to start doing cognitive behavioral therapy weekly again. It really helped me sort through issues I had with my dad. \n\nIt's funny because I always positioned my dad as the bad guy and my mom as the saint when, in reality, they both have their own unique successes and failures as parents. My dad tried to be my friend gave me drugs and alcohol and low to no supervision during high school, while my mom was the polar opposite. It took me a while to realize that neither extreme is a good way to be. \n\nThe ironic part to me, is that my mom always talks about how her mother screwed her up by using her (my mom) as a therapist to discuss personal issues—but my mother does EXACTLY that. Exactly. And ALL the time. I hate it. My boyfriend hates my mom for all of these reasons. His family is far from perfect but he could still see all of this abnormal behavior clear as day. He is also a physician who deals with abuse situations sometimes and so he always has sound advice for me when I bring any of this up. \n\nMy mom can sense that he cants stand her and she has no idea why. She keeps asking me to explain it and I just don't want to tell her the truth because then I'll have to deal with anther emotional explosion and, in the end, it won't get any better because she will just go right back to her old ways. My SO wants me to confront her but I just don't think it's my responsibility to try and change her any more. I tried so many times in the past and it's just exhausting and I won't make myself do it anymore. \n\nShe has our relationship backwards. She effectively mothers me in many ways, but emotionally she is just a fucking train wreck. Picture your mom bawling on the phone because she thinks you're going to \"abandon\" her. \n\nIt's fucking awful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for saying that. &lt;/p&gt;\n\n&lt;p&gt;You hit the nail on the head several times. She definitely does behave like a small child (emotionally) and is incredibly needy. She always encouraged me to get therapy as a child and teen. I had anxiety and a few years of depression issues as a teen and saw a LCSW weekly for a while in addition to a psychiatrist. I still see the psychiatrist and am waiting for better insurance to start doing cognitive behavioral therapy weekly again. It really helped me sort through issues I had with my dad. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s funny because I always positioned my dad as the bad guy and my mom as the saint when, in reality, they both have their own unique successes and failures as parents. My dad tried to be my friend gave me drugs and alcohol and low to no supervision during high school, while my mom was the polar opposite. It took me a while to realize that neither extreme is a good way to be. &lt;/p&gt;\n\n&lt;p&gt;The ironic part to me, is that my mom always talks about how her mother screwed her up by using her (my mom) as a therapist to discuss personal issues—but my mother does EXACTLY that. Exactly. And ALL the time. I hate it. My boyfriend hates my mom for all of these reasons. His family is far from perfect but he could still see all of this abnormal behavior clear as day. He is also a physician who deals with abuse situations sometimes and so he always has sound advice for me when I bring any of this up. &lt;/p&gt;\n\n&lt;p&gt;My mom can sense that he cants stand her and she has no idea why. She keeps asking me to explain it and I just don&amp;#39;t want to tell her the truth because then I&amp;#39;ll have to deal with anther emotional explosion and, in the end, it won&amp;#39;t get any better because she will just go right back to her old ways. My SO wants me to confront her but I just don&amp;#39;t think it&amp;#39;s my responsibility to try and change her any more. I tried so many times in the past and it&amp;#39;s just exhausting and I won&amp;#39;t make myself do it anymore. &lt;/p&gt;\n\n&lt;p&gt;She has our relationship backwards. She effectively mothers me in many ways, but emotionally she is just a fucking train wreck. Picture your mom bawling on the phone because she thinks you&amp;#39;re going to &amp;quot;abandon&amp;quot; her. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s fucking awful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc75oc", "score_hidden": false, "stickied": false, "created": 1492387717.0, "created_utc": 1492358917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc568p", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "UrbanCowgirl79", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; she sacrificed everything for me \n\nNo she didn't. She chose to get married and have children. Depending on culture and geography she could have easily made different life choices. But she didn't. Even if she *was* forced into an arranged marriage, that's not a reason to punish you for decades and make you her emotional servant.\n\n&gt; that if I died she would kill herself. \n\nShe said that? Or implied it? Because it's purely a manipulation tactic that she's using against you. Don't feel guilty here and don't alter your behavior to \"make her not kill herself.\" She sounds like a very disturbed person, and extremely manipulative.\n\n&gt; mistakes her abusive parents made\n\nI'm sorry for whatever she experienced but just because she was abused, doesn't mean it's okay for her to abuse you. She sees you emotionally as her mother. That's why your father and stepfather didn't satisfy her emotional needs to co-sleep with her or whatever else. In her twisted mind, she is the daughter, you are the mother, you're supposed to emotionally care for her and cater to her needs. And it's been this way since you were a kid, since she had you sleeping with her back then too. If you are 30 I assume she's at least 50? Take a step back and look how emotionally immature she is at 50. She sounds like a small child, not a middle aged adult. That's not normal.\n\nIt was completely inappropriate, and emotional incest, for her to make you sleep with her as a kid. It is likewise inappropriate and emotional incest for her to do this now. She needs to understand that she needs help and make a strong commitment to therapy to work through her issues. If it's even possible with therapy for her to get better, I don't know. Good for you for saying no to her about sleeping with her now, but can you leave earlier than planned? Would your partner's family let you stay with them until you find a new home of your own?\n\nIt sounds like you made it out of this nightmare family pretty well adjusted and with healthy ideas of boundaries, even if sometimes she manipulates you into breaking those boundaries. Kudos to you, for becoming a healthy, functioning adult in a long term relationship after being raised by such fucked up people.\n\n", "edited": 1492356393.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she sacrificed everything for me &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No she didn&amp;#39;t. She chose to get married and have children. Depending on culture and geography she could have easily made different life choices. But she didn&amp;#39;t. Even if she &lt;em&gt;was&lt;/em&gt; forced into an arranged marriage, that&amp;#39;s not a reason to punish you for decades and make you her emotional servant.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;that if I died she would kill herself. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She said that? Or implied it? Because it&amp;#39;s purely a manipulation tactic that she&amp;#39;s using against you. Don&amp;#39;t feel guilty here and don&amp;#39;t alter your behavior to &amp;quot;make her not kill herself.&amp;quot; She sounds like a very disturbed person, and extremely manipulative.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;mistakes her abusive parents made&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m sorry for whatever she experienced but just because she was abused, doesn&amp;#39;t mean it&amp;#39;s okay for her to abuse you. She sees you emotionally as her mother. That&amp;#39;s why your father and stepfather didn&amp;#39;t satisfy her emotional needs to co-sleep with her or whatever else. In her twisted mind, she is the daughter, you are the mother, you&amp;#39;re supposed to emotionally care for her and cater to her needs. And it&amp;#39;s been this way since you were a kid, since she had you sleeping with her back then too. If you are 30 I assume she&amp;#39;s at least 50? Take a step back and look how emotionally immature she is at 50. She sounds like a small child, not a middle aged adult. That&amp;#39;s not normal.&lt;/p&gt;\n\n&lt;p&gt;It was completely inappropriate, and emotional incest, for her to make you sleep with her as a kid. It is likewise inappropriate and emotional incest for her to do this now. She needs to understand that she needs help and make a strong commitment to therapy to work through her issues. If it&amp;#39;s even possible with therapy for her to get better, I don&amp;#39;t know. Good for you for saying no to her about sleeping with her now, but can you leave earlier than planned? Would your partner&amp;#39;s family let you stay with them until you find a new home of your own?&lt;/p&gt;\n\n&lt;p&gt;It sounds like you made it out of this nightmare family pretty well adjusted and with healthy ideas of boundaries, even if sometimes she manipulates you into breaking those boundaries. Kudos to you, for becoming a healthy, functioning adult in a long term relationship after being raised by such fucked up people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc568p", "score_hidden": false, "stickied": false, "created": 1492385004.0, "created_utc": 1492356204.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcv4zz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "disbelief12", "parent_id": "t1_dgckke9", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; I am allowed to say no simply because I don't want to.\n\nTHIS. This comment is absolutely on point.  It has taken me a long time to stop JADEing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I am allowed to say no simply because I don&amp;#39;t want to.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;THIS. This comment is absolutely on point.  It has taken me a long time to stop JADEing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcv4zz", "score_hidden": false, "stickied": false, "created": 1492419571.0, "created_utc": 1492390771.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcyqye", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Shignabis", "parent_id": "t1_dgckke9", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Thank you! I hadn't even realized I was doing that, but I definitely was. And you're right. There does not need to be a reason at all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I hadn&amp;#39;t even realized I was doing that, but I definitely was. And you&amp;#39;re right. There does not need to be a reason at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcyqye", "score_hidden": false, "stickied": false, "created": 1492424414.0, "created_utc": 1492395614.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckke9", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "rubix_cubes", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "You already have so much good advice here. I just noticed something that I don't see if anyone has addressed or not. \n\nYou seem to be making an effort to come up with good reasons for telling her no. Almost like if you can't find a really good reason to say no that it makes the no invalid.  It has taken me a while to convince myself that I am allowed to say no simply because I don't want to. If you are uncomfortable with the arrangement or just feel like being by yourself or think it's weird (which forcing your adult daughter to sleep with you does fall under that category in my book) you are allowed to just say no. It's valid, it's real, and it should be honored. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You already have so much good advice here. I just noticed something that I don&amp;#39;t see if anyone has addressed or not. &lt;/p&gt;\n\n&lt;p&gt;You seem to be making an effort to come up with good reasons for telling her no. Almost like if you can&amp;#39;t find a really good reason to say no that it makes the no invalid.  It has taken me a while to convince myself that I am allowed to say no simply because I don&amp;#39;t want to. If you are uncomfortable with the arrangement or just feel like being by yourself or think it&amp;#39;s weird (which forcing your adult daughter to sleep with you does fall under that category in my book) you are allowed to just say no. It&amp;#39;s valid, it&amp;#39;s real, and it should be honored. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgckke9", "score_hidden": false, "stickied": false, "created": 1492405346.0, "created_utc": 1492376546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcbszl", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Malachite6", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "\"I am not your blankie.\"\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I am not your blankie.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcbszl", "score_hidden": false, "stickied": false, "created": 1492393818.0, "created_utc": 1492365018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc4mts", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Williamsburg41", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She cray. \n\n/thread", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She cray. &lt;/p&gt;\n\n&lt;p&gt;/thread&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc4mts", "score_hidden": false, "stickied": false, "created": 1492384243.0, "created_utc": 1492355443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc79ie", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Shignabis", "parent_id": "t1_dgc5zef", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I don't know, he has his own set of issues. But yes, I told my boyfriend I want to go and stay with him and his family in neighboring town. Will likely head there this coming weekend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know, he has his own set of issues. But yes, I told my boyfriend I want to go and stay with him and his family in neighboring town. Will likely head there this coming weekend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc79ie", "score_hidden": false, "stickied": false, "created": 1492387858.0, "created_utc": 1492359058.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5zef", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "dragonet2", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Your mother is mentally ill. She needs help. You need to get your ass out of there. Is your step dad in on this? If so he should know just how wrong it is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mother is mentally ill. She needs help. You need to get your ass out of there. Is your step dad in on this? If so he should know just how wrong it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc5zef", "score_hidden": false, "stickied": false, "created": 1492386116.0, "created_utc": 1492357316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc7y72", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MyTitsAreRustled", "parent_id": "t1_dgc7gd7", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She could be a bit needy at times, but it was when she had a legitimate reason to be sad. I would cuddle with her in bed for some time when she was sick, or such but there were other times when she would come up and ask me (nicely/politely) for a hug. She was also a bit of a helicopter parent at times, though, and could also be a bit of an N - but nowhere near as bad as the N's I read about here. Her own mother was abusive to her and her siblings, with one of my uncles being the GC. So my mother could get a bit crazy sometimes. She has admitted to me that she was very warm/cuddly with us because she was trying to be the opposite of her own mother, so I've dealt with her more negative tendencies with a mix of gray rock and patience. Seeing some of the stories here made me feel lucky that my mother, despite whatever issues she has, was not the kind to try to force affection.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She could be a bit needy at times, but it was when she had a legitimate reason to be sad. I would cuddle with her in bed for some time when she was sick, or such but there were other times when she would come up and ask me (nicely/politely) for a hug. She was also a bit of a helicopter parent at times, though, and could also be a bit of an N - but nowhere near as bad as the N&amp;#39;s I read about here. Her own mother was abusive to her and her siblings, with one of my uncles being the GC. So my mother could get a bit crazy sometimes. She has admitted to me that she was very warm/cuddly with us because she was trying to be the opposite of her own mother, so I&amp;#39;ve dealt with her more negative tendencies with a mix of gray rock and patience. Seeing some of the stories here made me feel lucky that my mother, despite whatever issues she has, was not the kind to try to force affection.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc7y72", "score_hidden": false, "stickied": false, "created": 1492388778.0, "created_utc": 1492359978.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgd1kfb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "itgotyouthisfar", "parent_id": "t1_dgc7gd7", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It is absolutely the fact that you feel and felt uncomfortable that makes a difference. Also, having worked through my Ndad's abuse, I reflected on the times I had actually told him I was uncomfortable. He told me I was wrong, told me he needed it, and generally continued to be an N. It's clear your Nmom is not looking out for your best interest, and neither of you is capable of balancing each of your needs. That leaves you with the responsibility to always put yourself first when interacting with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is absolutely the fact that you feel and felt uncomfortable that makes a difference. Also, having worked through my Ndad&amp;#39;s abuse, I reflected on the times I had actually told him I was uncomfortable. He told me I was wrong, told me he needed it, and generally continued to be an N. It&amp;#39;s clear your Nmom is not looking out for your best interest, and neither of you is capable of balancing each of your needs. That leaves you with the responsibility to always put yourself first when interacting with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd1kfb", "score_hidden": false, "stickied": false, "created": 1492428398.0, "created_utc": 1492399598.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7gd7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Shignabis", "parent_id": "t1_dgc6u6k", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Your family situation sounds pretty normal to me, mainly because all participants were willing and comfortable. No one was coerced into anything and cuddling with family while watching a movie or whatever is completely normal in general. It also sounds like your mom was just affectionate, rather than emotionally needy. \n\nMy mom is emotionally needy and her requests make me feel uncomfortable because they cross boundaries and feel desperate. It's like a burden. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your family situation sounds pretty normal to me, mainly because all participants were willing and comfortable. No one was coerced into anything and cuddling with family while watching a movie or whatever is completely normal in general. It also sounds like your mom was just affectionate, rather than emotionally needy. &lt;/p&gt;\n\n&lt;p&gt;My mom is emotionally needy and her requests make me feel uncomfortable because they cross boundaries and feel desperate. It&amp;#39;s like a burden. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc7gd7", "score_hidden": false, "stickied": false, "created": 1492388111.0, "created_utc": 1492359311.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6u6k", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MyTitsAreRustled", "parent_id": "t1_dgc6d89", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "My mother was physically close to me and my siblings (not in a creepy or bad way) and when we were ill mom would sometimes lay/cuddle with us. We were used to being hugged, or giving our mother a hug if she held out her arms. There were times when we were younger and we'd be all in bed cuddling and watching a movie. That said, if my mother asked me to co-sleep with her just because she wanted to/felt like it, that's where I draw the line.\n\nI did take the cuddling for granted, but came to realize that not all families were so physically expressive in their affection. I saw that most mothers were not as cuddly or warm as mine was, but I don't know how I should feel about that because she's never forced her attention/affection on me.\n\nI don't know if it's because your mother just wants a warm body close to her, but in that case your stepdad should do just fine unless he has some annoying habit like snoring loudly or whatever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mother was physically close to me and my siblings (not in a creepy or bad way) and when we were ill mom would sometimes lay/cuddle with us. We were used to being hugged, or giving our mother a hug if she held out her arms. There were times when we were younger and we&amp;#39;d be all in bed cuddling and watching a movie. That said, if my mother asked me to co-sleep with her just because she wanted to/felt like it, that&amp;#39;s where I draw the line.&lt;/p&gt;\n\n&lt;p&gt;I did take the cuddling for granted, but came to realize that not all families were so physically expressive in their affection. I saw that most mothers were not as cuddly or warm as mine was, but I don&amp;#39;t know how I should feel about that because she&amp;#39;s never forced her attention/affection on me.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if it&amp;#39;s because your mother just wants a warm body close to her, but in that case your stepdad should do just fine unless he has some annoying habit like snoring loudly or whatever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc6u6k", "score_hidden": false, "stickied": false, "created": 1492387275.0, "created_utc": 1492358475.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcvabh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "disbelief12", "parent_id": "t1_dgc6d89", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; It's so odd how you can be raised in the most ridiculous of circumstances and just because you've never known anything else you assume that's the norm for life in general.\n\nDon't feel bad about this. Abuse gets normalized if that's all you know. It can take other people (friends, therapist, etc) pointing it out to you before you know that it's messed up. And then you go from there.\n\nI won't list all the things that I thought were normal before I started therapy. But my covert Nmom sounds an awful lot like yours. \"Abandonment\" is the chorus to every song.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s so odd how you can be raised in the most ridiculous of circumstances and just because you&amp;#39;ve never known anything else you assume that&amp;#39;s the norm for life in general.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t feel bad about this. Abuse gets normalized if that&amp;#39;s all you know. It can take other people (friends, therapist, etc) pointing it out to you before you know that it&amp;#39;s messed up. And then you go from there.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t list all the things that I thought were normal before I started therapy. But my covert Nmom sounds an awful lot like yours. &amp;quot;Abandonment&amp;quot; is the chorus to every song.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcvabh", "score_hidden": false, "stickied": false, "created": 1492419760.0, "created_utc": 1492390960.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6d89", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Shignabis", "parent_id": "t1_dgc4cif", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I haven't come right out and asked him if he thinks it's abnormal or not, but I've said things like, \"You don't mind this...?\" And he's always genuinely responded with something along the lines of \"No not at all. I'm very comfortable on the couch.\" (Which is not really what I meant, but, yeah).\n\nI agree there's nothing innately wrong with co-sleeping w a parent, it's more about the circumstances surrounding it. How old is the parent/child? What are the genders? Is there a history of inappropriate behavior? Are both people comfortable with it? Is it absolutely necessary / reasonable?\n\nThe odd part is that I am, in every other area of my life, a no nonsense individual with zero qualms regarding standing up for myself and extricating myself from uncomfortable situations. \n\nThat said, it has taken me 30 years to even realize this is a situation in which I NEED to stand up for myself. It never occurred to me before that this is a form of abuse. It's so odd how you can be raised in the most ridiculous of circumstances and just because you've never known anything else you assume that's the norm for life in general. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t come right out and asked him if he thinks it&amp;#39;s abnormal or not, but I&amp;#39;ve said things like, &amp;quot;You don&amp;#39;t mind this...?&amp;quot; And he&amp;#39;s always genuinely responded with something along the lines of &amp;quot;No not at all. I&amp;#39;m very comfortable on the couch.&amp;quot; (Which is not really what I meant, but, yeah).&lt;/p&gt;\n\n&lt;p&gt;I agree there&amp;#39;s nothing innately wrong with co-sleeping w a parent, it&amp;#39;s more about the circumstances surrounding it. How old is the parent/child? What are the genders? Is there a history of inappropriate behavior? Are both people comfortable with it? Is it absolutely necessary / reasonable?&lt;/p&gt;\n\n&lt;p&gt;The odd part is that I am, in every other area of my life, a no nonsense individual with zero qualms regarding standing up for myself and extricating myself from uncomfortable situations. &lt;/p&gt;\n\n&lt;p&gt;That said, it has taken me 30 years to even realize this is a situation in which I NEED to stand up for myself. It never occurred to me before that this is a form of abuse. It&amp;#39;s so odd how you can be raised in the most ridiculous of circumstances and just because you&amp;#39;ve never known anything else you assume that&amp;#39;s the norm for life in general. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc6d89", "score_hidden": false, "stickied": false, "created": 1492386642.0, "created_utc": 1492357842.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4cif", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MyTitsAreRustled", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I don't think there's anything wrong with co-sleeping with a parent if there are not enough beds to go around. That said, THIS is ridiculous. Have you ever asked your stepdad how he feels about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think there&amp;#39;s anything wrong with co-sleeping with a parent if there are not enough beds to go around. That said, THIS is ridiculous. Have you ever asked your stepdad how he feels about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc4cif", "score_hidden": false, "stickied": false, "created": 1492383825.0, "created_utc": 1492355025.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc6y8i", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "entropys_child", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; \"How dare you be so ungrateful to her? ~~She~~ **You** sacrificed everything for ~~you~~ **her** and now she needs you and you won't even do a little thing like sleep with her **while you are suffering a medical crisis** because it makes ~~her happy~~ **you very uncomfortable**?\"\n\nFTFY", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;How dare you be so ungrateful to her? &lt;del&gt;She&lt;/del&gt; &lt;strong&gt;You&lt;/strong&gt; sacrificed everything for &lt;del&gt;you&lt;/del&gt; &lt;strong&gt;her&lt;/strong&gt; and now she needs you and you won&amp;#39;t even do a little thing like sleep with her &lt;strong&gt;while you are suffering a medical crisis&lt;/strong&gt; because it makes &lt;del&gt;her happy&lt;/del&gt; &lt;strong&gt;you very uncomfortable&lt;/strong&gt;?&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;FTFY&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc6y8i", "score_hidden": false, "stickied": false, "created": 1492387434.0, "created_utc": 1492358634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc7k7f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "888frog", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She wants you to care for her like she is a child. NOPE. It's inappropriate. I would feel creeped out as well. You are not crazy. Just cause she gets upset, doesn't mean you did something wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She wants you to care for her like she is a child. NOPE. It&amp;#39;s inappropriate. I would feel creeped out as well. You are not crazy. Just cause she gets upset, doesn&amp;#39;t mean you did something wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc7k7f", "score_hidden": false, "stickied": false, "created": 1492388256.0, "created_utc": 1492359456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcdhjy", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "mmxcv", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Sounds like my mom honestly. She reminds me on a daily basis that she has sacrificed everything for me and that she has given up her life for me, and guilt trips me any time I need anything from her (emotional support, help with finances, an errand I can't possibly run like picking up my ADHD prescription because I work 9-5, etc.) She makes me feel as if having children was the biggest burden in her life. I can't even begin to express how much that hurts. I am 22 and it still kills me and I'm desperately trying to recover. I guess I don't have much advice, but just wanted to let you know you are not alone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like my mom honestly. She reminds me on a daily basis that she has sacrificed everything for me and that she has given up her life for me, and guilt trips me any time I need anything from her (emotional support, help with finances, an errand I can&amp;#39;t possibly run like picking up my ADHD prescription because I work 9-5, etc.) She makes me feel as if having children was the biggest burden in her life. I can&amp;#39;t even begin to express how much that hurts. I am 22 and it still kills me and I&amp;#39;m desperately trying to recover. I guess I don&amp;#39;t have much advice, but just wanted to let you know you are not alone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcdhjy", "score_hidden": false, "stickied": false, "created": 1492396057.0, "created_utc": 1492367257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc8pgj", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "BigHeroSix1993", "parent_id": "t1_dgc6lmx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's called gaslighting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s called gaslighting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc8pgj", "score_hidden": false, "stickied": false, "created": 1492389771.0, "created_utc": 1492360971.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcvcyg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "disbelief12", "parent_id": "t1_dgc6lmx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; It's like she literally rewrites history.\n\nThat's because she IS. 'Gaslighting' is telling you that your version of reality is wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s like she literally rewrites history.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s because she IS. &amp;#39;Gaslighting&amp;#39; is telling you that your version of reality is wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcvcyg", "score_hidden": false, "stickied": false, "created": 1492419859.0, "created_utc": 1492391059.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgddn5a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Patch_Ferntree", "parent_id": "t1_dgc6lmx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It sounds like she is over-identifying with you and has blurred the boundary between what is \"her\" and what is \"you\". Many toxics view their loved ones (especially their children) as extensions of themselves. It sounds like she has done this to the point that she thinks whatever she thinks or feels, you also think or feel the same. Therefore when she sobbed and sobbed, it was \"we\", not \"I\" in her mind. She has also parentified you and made you into her care-giver. She sounds quite disturbed and immature. You have every right to feel uncomfortable and to remove yourself. Her demands are unhealthy and she needs to grow up and address them as an adult instead of demanding her child deal with it for her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like she is over-identifying with you and has blurred the boundary between what is &amp;quot;her&amp;quot; and what is &amp;quot;you&amp;quot;. Many toxics view their loved ones (especially their children) as extensions of themselves. It sounds like she has done this to the point that she thinks whatever she thinks or feels, you also think or feel the same. Therefore when she sobbed and sobbed, it was &amp;quot;we&amp;quot;, not &amp;quot;I&amp;quot; in her mind. She has also parentified you and made you into her care-giver. She sounds quite disturbed and immature. You have every right to feel uncomfortable and to remove yourself. Her demands are unhealthy and she needs to grow up and address them as an adult instead of demanding her child deal with it for her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgddn5a", "score_hidden": false, "stickied": false, "created": 1492457745.0, "created_utc": 1492428945.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6lmx", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Shignabis", "parent_id": "t1_dgc4tth", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Good call. Now that I think about it I'm fairly certain she's framed it as if it's something that benefits me, rather than her. I've even noticed that when she retells or recalls times when she got very upset/emotionally inappropriate, she lumps me in with her. \n\nExample:\n\nMum: \"Remember when we found out [insert mildly upsetting situation] and we just sobbed and sobbed? It just felt so good to cry. We both just really needed to hold each other and cry.\"\n\nMe: [thinking] \"You mean when YOU sobbed and sobbed and SOBBED in public and I had to scramble to get you into the car so people would stop staring?\"\n\nIt's like she literally rewrites history. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good call. Now that I think about it I&amp;#39;m fairly certain she&amp;#39;s framed it as if it&amp;#39;s something that benefits me, rather than her. I&amp;#39;ve even noticed that when she retells or recalls times when she got very upset/emotionally inappropriate, she lumps me in with her. &lt;/p&gt;\n\n&lt;p&gt;Example:&lt;/p&gt;\n\n&lt;p&gt;Mum: &amp;quot;Remember when we found out [insert mildly upsetting situation] and we just sobbed and sobbed? It just felt so good to cry. We both just really needed to hold each other and cry.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Me: [thinking] &amp;quot;You mean when YOU sobbed and sobbed and SOBBED in public and I had to scramble to get you into the car so people would stop staring?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like she literally rewrites history. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc6lmx", "score_hidden": false, "stickied": false, "created": 1492386954.0, "created_utc": 1492358154.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4tth", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sock2014", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Print out this post and comments and show it to her husband. She may have told him a very different story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Print out this post and comments and show it to her husband. She may have told him a very different story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc4tth", "score_hidden": false, "stickied": false, "created": 1492384523.0, "created_utc": 1492355723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc5gkk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CaptKingston", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;She sacrificed everything for you\n\nShe didn't sacrifice a lot for your basic emotional need for healthy boundaries with an adult who had power over you when she needed a crutch.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She sacrificed everything for you&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She didn&amp;#39;t sacrifice a lot for your basic emotional need for healthy boundaries with an adult who had power over you when she needed a crutch.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc5gkk", "score_hidden": false, "stickied": false, "created": 1492385400.0, "created_utc": 1492356600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgc9bs6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "heartpatch", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "You have taken the first step away from this blatant emotional abuse. She is abusing basic boundaries and you now have clarity.  You are not 5 years old and need to sleep with Mummy. You are a grown woman. Guilt tripping you for her own placation is utterly twisted. Posting this here (I'm guessing) has cemented the reality further. Know that you have every right as an adult to decide where and how you sleep. Nobody, including and most especially your mother, should make you feel bad about your choice. If it feels wrong then it is wrong. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have taken the first step away from this blatant emotional abuse. She is abusing basic boundaries and you now have clarity.  You are not 5 years old and need to sleep with Mummy. You are a grown woman. Guilt tripping you for her own placation is utterly twisted. Posting this here (I&amp;#39;m guessing) has cemented the reality further. Know that you have every right as an adult to decide where and how you sleep. Nobody, including and most especially your mother, should make you feel bad about your choice. If it feels wrong then it is wrong. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgc9bs6", "score_hidden": false, "stickied": false, "created": 1492390565.0, "created_utc": 1492361765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcblmr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "louloucat", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "it is bizarre. If i was sick my nmum would want me to sleep with her but i stopped at about 8. i slept better in my own bed anyway and it weirded me out a bit. Nbro however still does it. Last time i went home for a few days before i went NC i popped into nmums rooms to get makeup remover. She was at work so i thought i wouldn't be disturbing anyone. Nbro was asleep in her bed. WTF he was 25. I asked him if he'd come in after she left and that he needed to stop doing this shit. He said he'd been there all night because he felt ill. EWWWWWWWW Norman Bates. When nmum went on holiday he slept in her room all week did the same thing when he was living at my dads. I think it was a power thing for him then making him feel like the most important person in the house. But when he is ill its a comfort thing. I asked nmum about it when she got home asked is she thought it was messed up \"but he was feeling poooooorrly\" i noped out and left them to it. Do not end up like my nbro. I am NC with nbro because he was physically abusive. It's been 7 years she still tries to pull something every now and again but it gets less and less now. My token response it \"actually this isn't about me or nbro its about you i will not hurt to make you happy you are being selfish\" this results in silence which is always nice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it is bizarre. If i was sick my nmum would want me to sleep with her but i stopped at about 8. i slept better in my own bed anyway and it weirded me out a bit. Nbro however still does it. Last time i went home for a few days before i went NC i popped into nmums rooms to get makeup remover. She was at work so i thought i wouldn&amp;#39;t be disturbing anyone. Nbro was asleep in her bed. WTF he was 25. I asked him if he&amp;#39;d come in after she left and that he needed to stop doing this shit. He said he&amp;#39;d been there all night because he felt ill. EWWWWWWWW Norman Bates. When nmum went on holiday he slept in her room all week did the same thing when he was living at my dads. I think it was a power thing for him then making him feel like the most important person in the house. But when he is ill its a comfort thing. I asked nmum about it when she got home asked is she thought it was messed up &amp;quot;but he was feeling poooooorrly&amp;quot; i noped out and left them to it. Do not end up like my nbro. I am NC with nbro because he was physically abusive. It&amp;#39;s been 7 years she still tries to pull something every now and again but it gets less and less now. My token response it &amp;quot;actually this isn&amp;#39;t about me or nbro its about you i will not hurt to make you happy you are being selfish&amp;quot; this results in silence which is always nice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcblmr", "score_hidden": false, "stickied": false, "created": 1492393554.0, "created_utc": 1492364754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcbsdv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Shignabis", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "High-five for recognizing this for what it is and getting out of it. It's sad that your little bro is left behind but he is not your responsibility (and of course the issues of past abuse by him make this even more true).\n\nIt's really hard to recognize, admit, and extricate yourself from something you were raised in your entire life. I really admire that you are able to go NC and do that effectively. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;High-five for recognizing this for what it is and getting out of it. It&amp;#39;s sad that your little bro is left behind but he is not your responsibility (and of course the issues of past abuse by him make this even more true).&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s really hard to recognize, admit, and extricate yourself from something you were raised in your entire life. I really admire that you are able to go NC and do that effectively. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcbsdv", "score_hidden": false, "stickied": false, "created": 1492393796.0, "created_utc": 1492364996.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgccgh2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kudzujean", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Sounds like she's highly manipulative and very much into guilt-tripping you.  \n\nGood for you not letting her guilt trip you into staying with her during the hurricane.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like she&amp;#39;s highly manipulative and very much into guilt-tripping you.  &lt;/p&gt;\n\n&lt;p&gt;Good for you not letting her guilt trip you into staying with her during the hurricane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgccgh2", "score_hidden": false, "stickied": false, "created": 1492394677.0, "created_utc": 1492365877.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgcsqbr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZenMommy", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She may not be sexually incestual, but she is very clearly being emotionally incestual and putting you in the place of a romantic partner Sheth it comes to comfort, safety, and feeling cared for. \n\nYour instincts are completely right: this is not normal or healthy. She shouldn't need you like this, and it's completely unfair that she's abused her position as a mother to mold you into someone that fills these needs in her. \n\nYou feel guilty, because she's TRAINED you this way. That's a hallmark of abuse. Next time you feel that guilt, tell yourself \"this is not my guilt, this is my mother's guilt. I reject this.\" \n\nIt's not yours. You are free. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She may not be sexually incestual, but she is very clearly being emotionally incestual and putting you in the place of a romantic partner Sheth it comes to comfort, safety, and feeling cared for. &lt;/p&gt;\n\n&lt;p&gt;Your instincts are completely right: this is not normal or healthy. She shouldn&amp;#39;t need you like this, and it&amp;#39;s completely unfair that she&amp;#39;s abused her position as a mother to mold you into someone that fills these needs in her. &lt;/p&gt;\n\n&lt;p&gt;You feel guilty, because she&amp;#39;s TRAINED you this way. That&amp;#39;s a hallmark of abuse. Next time you feel that guilt, tell yourself &amp;quot;this is not my guilt, this is my mother&amp;#39;s guilt. I reject this.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not yours. You are free. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcsqbr", "score_hidden": false, "stickied": false, "created": 1492416326.0, "created_utc": 1492387526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgd64rn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Shignabis", "parent_id": "t1_dgd2wfw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I think the most difficult part of taking this advice will be when she cries to me about something unrelated to me. For example, it's easier (for me) to shut her down when she's crying and telling me I'm abandoning her and don't love her, than it is to shut her down when she's crying about how she has no friends or how she feels taken for granted by her husband, etc. It's just so hard for me to shake that internal voice telling me \"you're heartless. You're actually going to leave her like this?\"\n\nBut I think it absolutely needs to be done. So thank you for pointing it out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the most difficult part of taking this advice will be when she cries to me about something unrelated to me. For example, it&amp;#39;s easier (for me) to shut her down when she&amp;#39;s crying and telling me I&amp;#39;m abandoning her and don&amp;#39;t love her, than it is to shut her down when she&amp;#39;s crying about how she has no friends or how she feels taken for granted by her husband, etc. It&amp;#39;s just so hard for me to shake that internal voice telling me &amp;quot;you&amp;#39;re heartless. You&amp;#39;re actually going to leave her like this?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;But I think it absolutely needs to be done. So thank you for pointing it out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd64rn", "score_hidden": false, "stickied": false, "created": 1492436406.0, "created_utc": 1492407606.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2wfw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iskarra", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "You're a human being with your own wants and feelings. Not a teddy bear, not an emotional crutch, not her best friend, not her spouse. There's nothing wrong with you wanting space.\n\nSome advice.. if she cries at you on the phone, just start hanging up. If she wants to talk to you, she can talk to you like an adult, and not use phone time to guilt trip you and hold you emotionally hostage. If she starts bawling on you in person, walk away. Leave the room. Whatever it takes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re a human being with your own wants and feelings. Not a teddy bear, not an emotional crutch, not her best friend, not her spouse. There&amp;#39;s nothing wrong with you wanting space.&lt;/p&gt;\n\n&lt;p&gt;Some advice.. if she cries at you on the phone, just start hanging up. If she wants to talk to you, she can talk to you like an adult, and not use phone time to guilt trip you and hold you emotionally hostage. If she starts bawling on you in person, walk away. Leave the room. Whatever it takes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd2wfw", "score_hidden": false, "stickied": false, "created": 1492430446.0, "created_utc": 1492401646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65omh0", "likes": null, "replies": "", "user_reports": [], "id": "dgd61a2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Shignabis", "parent_id": "t1_dgczufw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That is an excellent question. I think her \"sacrifices\" may be better frames as \"things she was afraid to do anyway but conveniently blamed on having a child.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is an excellent question. I think her &amp;quot;sacrifices&amp;quot; may be better frames as &amp;quot;things she was afraid to do anyway but conveniently blamed on having a child.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd61a2", "score_hidden": false, "stickied": false, "created": 1492436205.0, "created_utc": 1492407405.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczufw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Beatrixa", "parent_id": "t3_65omh0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "What did she actually sacrifice for you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What did she actually sacrifice for you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgczufw", "score_hidden": false, "stickied": false, "created": 1492425945.0, "created_utc": 1492397145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]