[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TW: anorexia&lt;/p&gt;\n\n&lt;p&gt;This is a something that I just remembered today. When I was 11 years old, my aunt was having a wedding, and I had a pretty dress that I couldn&amp;#39;t fit into because I was too chubby. My mom decided that I was too fat, and started to control what I ate. She&amp;#39;d dish out very little for me at dinner, and I&amp;#39;d go to sleep hungry. She also forced me to go brisk walking with her, which I wouldn&amp;#39;t have minded if she had slowed down a little for me since I had short legs and my stamina was terrible, but instead she shouted at me because I couldn&amp;#39;t keep up with her, and refused to ever stop for breaks. I often cried because I was so exhausted while running to try and keep up with her after we&amp;#39;d been going for an hour, and she would scream that I was lazy.&lt;/p&gt;\n\n&lt;p&gt;Come time for the wedding, I could fit into the dress, and my mom was happy. She stopped limiting my food intake but would still call me a pig or fat when she felt like I was eating too much.&lt;/p&gt;\n\n&lt;p&gt;Since the wedding incident, I would starve myself on and off to lose weight. I&amp;#39;d limit myself to 500 calories a day, but then in the end I&amp;#39;d give up and binge like crazy, so I&amp;#39;d gain it all back.&lt;/p&gt;\n\n&lt;p&gt;Years later when I was 18, I was chubby again, and I broke up with my first serious boyfriend. I was devastated because he cheated on me, and, driven purely by spite, I was determined to lose a ton of weight and look hotter than ever. I started exercising every day and eating about 700 calories a day. This continued for 2 months before my mother remarked that I was looking better than ever. However, after a while, people started to remark that I was losing weight too quickly. My mother only intervened when my grandfather (her dad) asked her if I was okay. I got a LONG lecture on healthy eating and not starving myself. Little does she know I&amp;#39;m only following the example she set when I was 11 years old. My ED and off/on, but I still haven&amp;#39;t fully recovered. When I mentioned the wedding to my mom and how she limited my food, she scolded me and told me she never would&amp;#39;ve done that. &lt;/p&gt;\n\n&lt;p&gt;Unfortunately for her, gaslighting stopped working on me years ago. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "TW: anorexia\n\nThis is a something that I just remembered today. When I was 11 years old, my aunt was having a wedding, and I had a pretty dress that I couldn't fit into because I was too chubby. My mom decided that I was too fat, and started to control what I ate. She'd dish out very little for me at dinner, and I'd go to sleep hungry. She also forced me to go brisk walking with her, which I wouldn't have minded if she had slowed down a little for me since I had short legs and my stamina was terrible, but instead she shouted at me because I couldn't keep up with her, and refused to ever stop for breaks. I often cried because I was so exhausted while running to try and keep up with her after we'd been going for an hour, and she would scream that I was lazy.\n\nCome time for the wedding, I could fit into the dress, and my mom was happy. She stopped limiting my food intake but would still call me a pig or fat when she felt like I was eating too much.\n\nSince the wedding incident, I would starve myself on and off to lose weight. I'd limit myself to 500 calories a day, but then in the end I'd give up and binge like crazy, so I'd gain it all back.\n\nYears later when I was 18, I was chubby again, and I broke up with my first serious boyfriend. I was devastated because he cheated on me, and, driven purely by spite, I was determined to lose a ton of weight and look hotter than ever. I started exercising every day and eating about 700 calories a day. This continued for 2 months before my mother remarked that I was looking better than ever. However, after a while, people started to remark that I was losing weight too quickly. My mother only intervened when my grandfather (her dad) asked her if I was okay. I got a LONG lecture on healthy eating and not starving myself. Little does she know I'm only following the example she set when I was 11 years old. My ED and off/on, but I still haven't fully recovered. When I mentioned the wedding to my mom and how she limited my food, she scolded me and told me she never would've done that. \n\nUnfortunately for her, gaslighting stopped working on me years ago. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pxrk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 63, "report_reasons": null, "author": "blueberrytarts", "saved": false, "mod_reports": [], "name": "t3_65pxrk", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65pxrk/nmom_controlled_my_food_intake_at_11_years_old/", "num_reports": null, "locked": false, "stickied": false, "created": 1492388729.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65pxrk/nmom_controlled_my_food_intake_at_11_years_old/", "author_flair_text": null, "quarantine": false, "title": "Nmom controlled my food intake at 11 years old because I was chubby, is shocked that I had an ED at 18", "created_utc": 1492359929.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 63}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65pxrk", "likes": null, "replies": "", "user_reports": [], "id": "dgcpuyh", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "krba201076", "parent_id": "t3_65pxrk", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "They never want to take responsibility for the shit that they've done to us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They never want to take responsibility for the shit that they&amp;#39;ve done to us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcpuyh", "score_hidden": false, "stickied": false, "created": 1492412411.0, "created_utc": 1492383611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65pxrk", "likes": null, "replies": "", "user_reports": [], "id": "dgcvnli", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ToxicMonsters", "parent_id": "t3_65pxrk", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's awful. I'm in my late 50's and still fight with my eating habits every day. I've pretty much found the balance to eat right and keep my weight down but it's still a struggle. My ndad used to sing the \"Too Fat Polka\" to me when I was about 15 and a little chubby. My nmom would say \"calories calories\" to me every time I put a morcel of food in my mouth. But then at meal time she would pile food on my plate. I'm so glad for NC.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s awful. I&amp;#39;m in my late 50&amp;#39;s and still fight with my eating habits every day. I&amp;#39;ve pretty much found the balance to eat right and keep my weight down but it&amp;#39;s still a struggle. My ndad used to sing the &amp;quot;Too Fat Polka&amp;quot; to me when I was about 15 and a little chubby. My nmom would say &amp;quot;calories calories&amp;quot; to me every time I put a morcel of food in my mouth. But then at meal time she would pile food on my plate. I&amp;#39;m so glad for NC.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcvnli", "score_hidden": false, "stickied": false, "created": 1492420241.0, "created_utc": 1492391441.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65pxrk", "likes": null, "replies": "", "user_reports": [], "id": "dgcsyfo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anonymoususer226", "parent_id": "t3_65pxrk", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm sorry you had to go through that. :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you had to go through that. :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcsyfo", "score_hidden": false, "stickied": false, "created": 1492416645.0, "created_utc": 1492387845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65pxrk", "likes": null, "replies": "", "user_reports": [], "id": "dgd2f4f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "runinjagal", "parent_id": "t3_65pxrk", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I also had an ED induced by my nmom. I really wish recovery programs fully explored this nparent induced eying disorder. I never realized how common it is with narcs. \n\nThey gaslight when you confront them with the truth of their actions. They never *remember* their actions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also had an ED induced by my nmom. I really wish recovery programs fully explored this nparent induced eying disorder. I never realized how common it is with narcs. &lt;/p&gt;\n\n&lt;p&gt;They gaslight when you confront them with the truth of their actions. They never &lt;em&gt;remember&lt;/em&gt; their actions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd2f4f", "score_hidden": false, "stickied": false, "created": 1492429673.0, "created_utc": 1492400873.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65pxrk", "likes": null, "replies": "", "user_reports": [], "id": "dgd9yxh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "katschmidt", "parent_id": "t3_65pxrk", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's incredibly similar to my experience with my mother. When I was 11 I was a little chubby but still a healthy weight for my age but my mum wasn't happy and used to measure my body and weigh me and track everything on an excel spreadsheet. She put me on a no sugar diet and we had a special word so if we were out and she didn't want me to eat something she would say it and I couldn't. She also used to have this phrase 'NWTC' (Not Worth The Calories) which she still uses to this day. I struggled with an eating disorder as a result for seven years until finally I've started to seek treatment​ this year at 18. My mum would just tell me I looked great and comment on how tiny my waist was and congratulate me when I was at my worst. I even had to suspend from university due to other mental health issues which may stem from my relationship with her. When I briefly mentioned what happened when I was eleven she got very upset and said she couldn't remember any of that and said sorry, which I took as remorse, but she hasn't mentioned it again or talked to me about it further. I'm too scared to bring it up again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s incredibly similar to my experience with my mother. When I was 11 I was a little chubby but still a healthy weight for my age but my mum wasn&amp;#39;t happy and used to measure my body and weigh me and track everything on an excel spreadsheet. She put me on a no sugar diet and we had a special word so if we were out and she didn&amp;#39;t want me to eat something she would say it and I couldn&amp;#39;t. She also used to have this phrase &amp;#39;NWTC&amp;#39; (Not Worth The Calories) which she still uses to this day. I struggled with an eating disorder as a result for seven years until finally I&amp;#39;ve started to seek treatment​ this year at 18. My mum would just tell me I looked great and comment on how tiny my waist was and congratulate me when I was at my worst. I even had to suspend from university due to other mental health issues which may stem from my relationship with her. When I briefly mentioned what happened when I was eleven she got very upset and said she couldn&amp;#39;t remember any of that and said sorry, which I took as remorse, but she hasn&amp;#39;t mentioned it again or talked to me about it further. I&amp;#39;m too scared to bring it up again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd9yxh", "score_hidden": false, "stickied": false, "created": 1492446022.0, "created_utc": 1492417222.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]