[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t give too much background info...but I&amp;#39;m an almost 33 year old adult living with my parents due to cultural reasons since I&amp;#39;m a woman and not married. &lt;/p&gt;\n\n&lt;p&gt;My parents have had issues since I was younger with me spending too much time in my room alone. When I was an undergrad in college my dad would get pissed at me when I shut the door to study. &lt;/p&gt;\n\n&lt;p&gt;We live in a very small and open formatted house and there isn&amp;#39;t tons of privacy. My mom is usually up every 5 minutes cleaning or doing something and my dad just sits in front of the satellite TV which is very loud. My tiny room is the only place I can be myself and have any peace (I feel very stress when I&amp;#39;m around my parents). &lt;/p&gt;\n\n&lt;p&gt;So today is Sunday...my mom knows most stores are closed so there isn&amp;#39;t really anywhere for me to go. Normally I sneak off to see my fiance on the weekends but today he has to work. I only got to see him for 3 hours yesterday (and for the week) because my mom decided to spring a last minute family dinner on me. I did go to that so I thought that was enough brownie points with my family this week. &lt;/p&gt;\n\n&lt;p&gt;I was wrong. My mom told me &amp;quot;it doesn&amp;#39;t look like you&amp;#39;re doing anything today so do you want to take me to the riverfront and we can have dessert or something like that&amp;quot;. I politely declined. Then she came to my room and asked me again. I told her no, I have things to do. She left the house for like 20 minutes, then came back to my room and asked again. I told her no...&lt;/p&gt;\n\n&lt;p&gt;Then she said &amp;quot;well you are always just in your room when you are home....&amp;quot; I started to get a bit irritated because she didn&amp;#39;t seem to back off so I told her that &amp;quot;I&amp;#39;m a 33 year old woman, so if I want to be in my room I can&amp;quot;. My younger teenage sister was home and started siding with my mom (as she always does) and started to say &amp;quot;oh there she goes being disrespectful again&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I just left after that. I feel like my mom is trying to get some information out of me. Her and my dad have been disapproving of my fiance because he isn&amp;#39;t &amp;quot;one of us&amp;quot;. She noticed I was a bit teary the other day and confronted me about it. She was upset I wouldn&amp;#39;t tell her what was going on. &lt;/p&gt;\n\n&lt;p&gt;Maybe she is hopefully I broke it off with my fiance and she doesn&amp;#39;t have to worry about that &amp;quot;problem&amp;quot; anymore. I barely tell her anything personal anymore and I think she is resenting it. &lt;/p&gt;\n\n&lt;p&gt;I just had to vent...I&amp;#39;m just super frustrated. I wanted to stay in my room and just clean and get my stuff together. Then I look like the odd one out because my younger siblings don&amp;#39;t stay in their room as much as me....so there must be an issue with me...not my parents according to them. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sad...but at this point I don&amp;#39;t think I&amp;#39;m going to be able to have a good relationship with my parents ever. I&amp;#39;m tired of living a double life and pretending to be Muslim so they won&amp;#39;t disown me and having to sneak to see my fiance since because we aren&amp;#39;t married it would be a sin for me to see him in private. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I won't give too much background info...but I'm an almost 33 year old adult living with my parents due to cultural reasons since I'm a woman and not married. \n\nMy parents have had issues since I was younger with me spending too much time in my room alone. When I was an undergrad in college my dad would get pissed at me when I shut the door to study. \n\nWe live in a very small and open formatted house and there isn't tons of privacy. My mom is usually up every 5 minutes cleaning or doing something and my dad just sits in front of the satellite TV which is very loud. My tiny room is the only place I can be myself and have any peace (I feel very stress when I'm around my parents). \n\nSo today is Sunday...my mom knows most stores are closed so there isn't really anywhere for me to go. Normally I sneak off to see my fiance on the weekends but today he has to work. I only got to see him for 3 hours yesterday (and for the week) because my mom decided to spring a last minute family dinner on me. I did go to that so I thought that was enough brownie points with my family this week. \n\nI was wrong. My mom told me \"it doesn't look like you're doing anything today so do you want to take me to the riverfront and we can have dessert or something like that\". I politely declined. Then she came to my room and asked me again. I told her no, I have things to do. She left the house for like 20 minutes, then came back to my room and asked again. I told her no...\n\nThen she said \"well you are always just in your room when you are home....\" I started to get a bit irritated because she didn't seem to back off so I told her that \"I'm a 33 year old woman, so if I want to be in my room I can\". My younger teenage sister was home and started siding with my mom (as she always does) and started to say \"oh there she goes being disrespectful again\". \n\nI just left after that. I feel like my mom is trying to get some information out of me. Her and my dad have been disapproving of my fiance because he isn't \"one of us\". She noticed I was a bit teary the other day and confronted me about it. She was upset I wouldn't tell her what was going on. \n\nMaybe she is hopefully I broke it off with my fiance and she doesn't have to worry about that \"problem\" anymore. I barely tell her anything personal anymore and I think she is resenting it. \n\nI just had to vent...I'm just super frustrated. I wanted to stay in my room and just clean and get my stuff together. Then I look like the odd one out because my younger siblings don't stay in their room as much as me....so there must be an issue with me...not my parents according to them. \n\nIt's sad...but at this point I don't think I'm going to be able to have a good relationship with my parents ever. I'm tired of living a double life and pretending to be Muslim so they won't disown me and having to sneak to see my fiance since because we aren't married it would be a sin for me to see him in private. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Rant/Vent]", "id": "65q7sj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 78, "report_reasons": null, "author": "ihmb24", "saved": false, "mod_reports": [], "name": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65q7sj/my_mom_doesnt_seem_to_be_responding_to_grey_rock/", "num_reports": null, "locked": false, "stickied": false, "created": 1492391976.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65q7sj/my_mom_doesnt_seem_to_be_responding_to_grey_rock/", "author_flair_text": null, "quarantine": false, "title": "My mom doesn't seem to be responding to \"grey rock\" that well", "created_utc": 1492363176.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 27, "visited": false, "subreddit_type": "public", "ups": 78}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgctrb1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgcteup", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yeah...I basically have to try and continue living my double life until we get married. The hard part is sneaking on the weekends to see my fiance...since my dad said I am \"forbidden\" to see him unless he comes to the house. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah...I basically have to try and continue living my double life until we get married. The hard part is sneaking on the weekends to see my fiance...since my dad said I am &amp;quot;forbidden&amp;quot; to see him unless he comes to the house. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgctrb1", "score_hidden": false, "stickied": false, "created": 1492417711.0, "created_utc": 1492388911.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcteup", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "suddenlymyself", "parent_id": "t1_dgcqca5", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;people in the \"community\" who married white people and now they are so screwed up\n\nGah I know exactly what you mean! NMom is Indian and my NDad was white. Any time someone (besides me) married a white guy or girl she wouldn't shut up about how they'll get divorced soon, or their kids are stupid, or the wife got fat and the husbamd cheated. She'd make stuff up about them, pretty sure she was the source of a lot of rumors about why a couple broke up etc.\n\nI guess just keep doing what you're doing until you can escape. There's not much else you can do except not rock the boat. It's up to you to stay even keel and not give into their insanity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;people in the &amp;quot;community&amp;quot; who married white people and now they are so screwed up&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Gah I know exactly what you mean! NMom is Indian and my NDad was white. Any time someone (besides me) married a white guy or girl she wouldn&amp;#39;t shut up about how they&amp;#39;ll get divorced soon, or their kids are stupid, or the wife got fat and the husbamd cheated. She&amp;#39;d make stuff up about them, pretty sure she was the source of a lot of rumors about why a couple broke up etc.&lt;/p&gt;\n\n&lt;p&gt;I guess just keep doing what you&amp;#39;re doing until you can escape. There&amp;#39;s not much else you can do except not rock the boat. It&amp;#39;s up to you to stay even keel and not give into their insanity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcteup", "score_hidden": false, "stickied": false, "created": 1492417251.0, "created_utc": 1492388451.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqca5", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgcl5yj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yeah...it seems like when I grey rock things get worse. I do an information diet where I don't really tell my parents much...but that pisses them off especially my mom (my dad never really seemed to care about my personal life as long as I stayed in line). \n\nIt's irritating just talking to my mom because when we do...the topic of religion seems to come up, and I feel like she tries to manipulate me in a round about way. \n\nFor example, my fiance is not Lebanese...and my mom (who is half white herself) and I were talking one day. The conversation somehow went to how she knows of people in the \"community\" who married white people and now they are so screwed up and their kids don't know their identity, etc. Stuff like that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah...it seems like when I grey rock things get worse. I do an information diet where I don&amp;#39;t really tell my parents much...but that pisses them off especially my mom (my dad never really seemed to care about my personal life as long as I stayed in line). &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s irritating just talking to my mom because when we do...the topic of religion seems to come up, and I feel like she tries to manipulate me in a round about way. &lt;/p&gt;\n\n&lt;p&gt;For example, my fiance is not Lebanese...and my mom (who is half white herself) and I were talking one day. The conversation somehow went to how she knows of people in the &amp;quot;community&amp;quot; who married white people and now they are so screwed up and their kids don&amp;#39;t know their identity, etc. Stuff like that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcqca5", "score_hidden": false, "stickied": false, "created": 1492413084.0, "created_utc": 1492384284.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcl5yj", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "suddenlymyself", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Some Ns escalate their abuse when you grey rock.\n\nIt worked with my Nmom but I wasn't living with her anymore, so it was all over text and phone. \n\nOther options are an information diet. Just enough info to keep her sated but nothing really personal or important to you. You can try rambling about something really boring.\n\n\"Well I went to run an errand but then the neighbor started talking to me, and I didn't want to be rude. So we started talking about her cat and how it's sick, and I just felt so bad you know? So I gave her some advice about blah blahblah....\" and that's your life to her now. Super boring, repetitive and inane. She'll still gossip or talk down to you, but now you know it's stupid stuff you don't care about.\n\nDo you work? Start saying you have to bring work home in the evenings and say you need quiet time. Close the door and continue grey rocking. \"I'm working, I can't do that right now.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some Ns escalate their abuse when you grey rock.&lt;/p&gt;\n\n&lt;p&gt;It worked with my Nmom but I wasn&amp;#39;t living with her anymore, so it was all over text and phone. &lt;/p&gt;\n\n&lt;p&gt;Other options are an information diet. Just enough info to keep her sated but nothing really personal or important to you. You can try rambling about something really boring.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well I went to run an errand but then the neighbor started talking to me, and I didn&amp;#39;t want to be rude. So we started talking about her cat and how it&amp;#39;s sick, and I just felt so bad you know? So I gave her some advice about blah blahblah....&amp;quot; and that&amp;#39;s your life to her now. Super boring, repetitive and inane. She&amp;#39;ll still gossip or talk down to you, but now you know it&amp;#39;s stupid stuff you don&amp;#39;t care about.&lt;/p&gt;\n\n&lt;p&gt;Do you work? Start saying you have to bring work home in the evenings and say you need quiet time. Close the door and continue grey rocking. &amp;quot;I&amp;#39;m working, I can&amp;#39;t do that right now.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcl5yj", "score_hidden": false, "stickied": false, "created": 1492406130.0, "created_utc": 1492377330.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgcxjka", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgcviwx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Oh...I see. Yeah the demands will keep coming. A date was set for May 15th but that was back in November. There are several Imams...none know my situation. My parents have not told too many people about it. Many of my close family members haven't even met him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh...I see. Yeah the demands will keep coming. A date was set for May 15th but that was back in November. There are several Imams...none know my situation. My parents have not told too many people about it. Many of my close family members haven&amp;#39;t even met him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcxjka", "score_hidden": false, "stickied": false, "created": 1492422728.0, "created_utc": 1492393928.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcviwx", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "floatyyellowalien", "parent_id": "t1_dgcq6b9", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Both of the men they married actually converted in front of an Imam per family demands.  And then the actual wedding ceremonies were done Pakistani style because nothing else could be fathomed. The demands will probably keep coming.  You both will still be married at the end though and if your family is like mine then that's the holy grail of independence. Was a date set?  Is the Imam of your mosque sympathetic to your situation? Perhaps if you frame it to the Imam that you are both just trying to be good Muslims and get married he can interfere on your behalf?", "edited": 1492391657.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Both of the men they married actually converted in front of an Imam per family demands.  And then the actual wedding ceremonies were done Pakistani style because nothing else could be fathomed. The demands will probably keep coming.  You both will still be married at the end though and if your family is like mine then that&amp;#39;s the holy grail of independence. Was a date set?  Is the Imam of your mosque sympathetic to your situation? Perhaps if you frame it to the Imam that you are both just trying to be good Muslims and get married he can interfere on your behalf?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcviwx", "score_hidden": false, "stickied": false, "created": 1492420073.0, "created_utc": 1492391273.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcq6b9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgcpobg", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's great news...I'm happy for your friends. My fiance actually had to fake convert to Islam. My parents would never even allow him to come over if he weren't Muslim. Although he took the shahada...and he has been to the mosque with my dad, my dad keeps making demands. He wants my fiance to formally convert in front of an Imam. And the list goes on of what my dad told my fiance he has to do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s great news...I&amp;#39;m happy for your friends. My fiance actually had to fake convert to Islam. My parents would never even allow him to come over if he weren&amp;#39;t Muslim. Although he took the shahada...and he has been to the mosque with my dad, my dad keeps making demands. He wants my fiance to formally convert in front of an Imam. And the list goes on of what my dad told my fiance he has to do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcq6b9", "score_hidden": false, "stickied": false, "created": 1492412849.0, "created_utc": 1492384049.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpobg", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "floatyyellowalien", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Um, hi.  I'm a 31 year old woman still living at home in a Muslim household because I'm unmarried. I sympathize with a lot of what you've said here.  You have every right to be frustrated. \n\nStay strong. A good friend of mine and her sister chose to marry non-muslim men and while the lead-up to the marriages was anything but awesome they are both immensely happy in their new lives.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Um, hi.  I&amp;#39;m a 31 year old woman still living at home in a Muslim household because I&amp;#39;m unmarried. I sympathize with a lot of what you&amp;#39;ve said here.  You have every right to be frustrated. &lt;/p&gt;\n\n&lt;p&gt;Stay strong. A good friend of mine and her sister chose to marry non-muslim men and while the lead-up to the marriages was anything but awesome they are both immensely happy in their new lives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcpobg", "score_hidden": false, "stickied": false, "created": 1492412154.0, "created_utc": 1492383354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgcgp6e", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Dreamsonly", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's a tough situation. Hopefully you can just hide from them until getting married and getting out of the house.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a tough situation. Hopefully you can just hide from them until getting married and getting out of the house.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcgp6e", "score_hidden": false, "stickied": false, "created": 1492400329.0, "created_utc": 1492371529.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgcttjh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgcsak9", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yeah...I have to keep practicing. She knows I'm hiding something and has used various techniques to get it out. She once wanted to talk to me and sat me down to let me know she had a dream that I was living a double life and wanted to know if it was true or not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah...I have to keep practicing. She knows I&amp;#39;m hiding something and has used various techniques to get it out. She once wanted to talk to me and sat me down to let me know she had a dream that I was living a double life and wanted to know if it was true or not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcttjh", "score_hidden": false, "stickied": false, "created": 1492417799.0, "created_utc": 1492388999.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsak9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Celera314", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Grey rock will aggravate a lot of narcissists, but that's not the point -- the point is that you are protecting pieces of who you are and what you want and what you care about by not putting them out there for her to attack.  If you do it right, she will think that you are just very boring and not that you are hiding things.   But that takes some practice and some luck. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Grey rock will aggravate a lot of narcissists, but that&amp;#39;s not the point -- the point is that you are protecting pieces of who you are and what you want and what you care about by not putting them out there for her to attack.  If you do it right, she will think that you are just very boring and not that you are hiding things.   But that takes some practice and some luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcsak9", "score_hidden": false, "stickied": false, "created": 1492415722.0, "created_utc": 1492386922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgejdho", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greymatter9296", "parent_id": "t1_dgeahae", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I say it's noble is because you want to compromise.  But let's not forget that there are 2 sides to every compromise and both parties should be ok with the terms.  With the Ns all it will ever be is sacrifice and it's not in their end. Ultimately it'll probably be a their way or the highway situation though.\n\nThe reason they are calling you selfish is because you aren't fitting in to their version of the perfect reality and it's by your choice. To them you are selfish because you want to marry a non-Muslim.  You are selfish because you want to spend time away from them.  But in all actuality you are just trying to be yourself.  Like I said in my original comment:  it's time for you to start living your life the way you want to live it.\n\nYou said you have family on your moms side in the states,  would you be able to get to them before your parents do? What their immigration status (if you don't want to share that's on you)? Would they be able to host you and your boyfriend?\n\nI'm not sure how your legal system is in Lebanon but there has to be some sort of anti harassment laws.  Even if your parents could find you,  they shouldn't be able to harm you because of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I say it&amp;#39;s noble is because you want to compromise.  But let&amp;#39;s not forget that there are 2 sides to every compromise and both parties should be ok with the terms.  With the Ns all it will ever be is sacrifice and it&amp;#39;s not in their end. Ultimately it&amp;#39;ll probably be a their way or the highway situation though.&lt;/p&gt;\n\n&lt;p&gt;The reason they are calling you selfish is because you aren&amp;#39;t fitting in to their version of the perfect reality and it&amp;#39;s by your choice. To them you are selfish because you want to marry a non-Muslim.  You are selfish because you want to spend time away from them.  But in all actuality you are just trying to be yourself.  Like I said in my original comment:  it&amp;#39;s time for you to start living your life the way you want to live it.&lt;/p&gt;\n\n&lt;p&gt;You said you have family on your moms side in the states,  would you be able to get to them before your parents do? What their immigration status (if you don&amp;#39;t want to share that&amp;#39;s on you)? Would they be able to host you and your boyfriend?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure how your legal system is in Lebanon but there has to be some sort of anti harassment laws.  Even if your parents could find you,  they shouldn&amp;#39;t be able to harm you because of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgejdho", "score_hidden": false, "stickied": false, "created": 1492510656.0, "created_utc": 1492481856.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeahae", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dge05rt", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's a really great quote! I'm going to put it up on my desk at work. \n\nMy immediate family is ultraconservative and none of them are supportive of my marriage. I'm the oldest of 4 children. My parents are not very close with our extended family members...but my mom's side of the family is well integrated into America society, thankfully. I have girl cousins over 10 years younger than me living on their own and have white boyfriends. \n\nThanks for saying it's \"noble\" of me...because my parents and one sibling all tell me I'm being selfish for not wanting to marry someone who is Lebanese. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a really great quote! I&amp;#39;m going to put it up on my desk at work. &lt;/p&gt;\n\n&lt;p&gt;My immediate family is ultraconservative and none of them are supportive of my marriage. I&amp;#39;m the oldest of 4 children. My parents are not very close with our extended family members...but my mom&amp;#39;s side of the family is well integrated into America society, thankfully. I have girl cousins over 10 years younger than me living on their own and have white boyfriends. &lt;/p&gt;\n\n&lt;p&gt;Thanks for saying it&amp;#39;s &amp;quot;noble&amp;quot; of me...because my parents and one sibling all tell me I&amp;#39;m being selfish for not wanting to marry someone who is Lebanese. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgeahae", "score_hidden": false, "stickied": false, "created": 1492499585.0, "created_utc": 1492470785.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge05rt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greymatter9296", "parent_id": "t1_dgdfg1i", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's quite noble of you to want to appease everyone but taking into consideration that you and your parents beliefs don't align there's going to be friction.  Hopefully the rest of your family isn't ultraconservative and push you out of their lives too when it finally comes out that you aren't of the Islamic faith and neither is your fiancé.  Take into consideration that while you care for your siblings it seems to me, with the given information from your original post, that your siblings are enabling your parents. \n\nI think it would be best to do what makes you happy and after the dust settles keep those who respect your decisions in your life.  \n\nUltimately it is up to you to decide what you do but I'd like to give you this little quote that I've used to determine who stays and who goes in my life:  Those who mind don't matter and those who matter don't mind\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s quite noble of you to want to appease everyone but taking into consideration that you and your parents beliefs don&amp;#39;t align there&amp;#39;s going to be friction.  Hopefully the rest of your family isn&amp;#39;t ultraconservative and push you out of their lives too when it finally comes out that you aren&amp;#39;t of the Islamic faith and neither is your fiancé.  Take into consideration that while you care for your siblings it seems to me, with the given information from your original post, that your siblings are enabling your parents. &lt;/p&gt;\n\n&lt;p&gt;I think it would be best to do what makes you happy and after the dust settles keep those who respect your decisions in your life.  &lt;/p&gt;\n\n&lt;p&gt;Ultimately it is up to you to decide what you do but I&amp;#39;d like to give you this little quote that I&amp;#39;ve used to determine who stays and who goes in my life:  Those who mind don&amp;#39;t matter and those who matter don&amp;#39;t mind&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge05rt", "score_hidden": false, "stickied": false, "created": 1492487162.0, "created_utc": 1492458362.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfg1i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgd303n", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Islamic-ally, as a woman, I basically am a piece of property (I'm not Muslim, but pretend to be...because if they found out I wasn't it would be bad). I can't get married without my father's permission no matter how old I am...if not my father than some sort of male \"guardian\" has to sign me off and basically give my ownership to my fiance. If I cut them out of my life I know they will find me. And if I cut them out...that means I'll loose my siblings and all my other family...which I don't want to do. So, I'm trying to sort of appease them not because I want my parents in my life...but because I don't want to loose my younger siblings. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Islamic-ally, as a woman, I basically am a piece of property (I&amp;#39;m not Muslim, but pretend to be...because if they found out I wasn&amp;#39;t it would be bad). I can&amp;#39;t get married without my father&amp;#39;s permission no matter how old I am...if not my father than some sort of male &amp;quot;guardian&amp;quot; has to sign me off and basically give my ownership to my fiance. If I cut them out of my life I know they will find me. And if I cut them out...that means I&amp;#39;ll loose my siblings and all my other family...which I don&amp;#39;t want to do. So, I&amp;#39;m trying to sort of appease them not because I want my parents in my life...but because I don&amp;#39;t want to loose my younger siblings. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdfg1i", "score_hidden": false, "stickied": false, "created": 1492461678.0, "created_utc": 1492432878.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd303n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "greymatter9296", "parent_id": "t1_dgcr02k", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Elope, forget trying to plan something with them.  It'll end up being their show not yours.  You're married you've satisfied their cultural beliefs.  I can't claim to understand what you have to deal with, I'm from the US and to me that whole you have to be married before you can move out stuff is utter bullshit to me.  You aren't a piece of property. Live YOUR life.  If they give you shit cut them out of YOUR life, they make you miserable anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Elope, forget trying to plan something with them.  It&amp;#39;ll end up being their show not yours.  You&amp;#39;re married you&amp;#39;ve satisfied their cultural beliefs.  I can&amp;#39;t claim to understand what you have to deal with, I&amp;#39;m from the US and to me that whole you have to be married before you can move out stuff is utter bullshit to me.  You aren&amp;#39;t a piece of property. Live YOUR life.  If they give you shit cut them out of YOUR life, they make you miserable anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd303n", "score_hidden": false, "stickied": false, "created": 1492430612.0, "created_utc": 1492401812.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgdfcpo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgd327d", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "When I get married I'd be in an apartment. We told my parents that was the plan after my dad ok'd us getting married. But my parents both won't agree to it. My mom says I'm too old to live in an apartment when I pointed out that she lived an apartment when she first got married to my dad. But that was ok for them because my mom was only 19 when she got married. So I think that may be why they are just pretending like the whole marriage thing isn't happening. May is coming up and no word from my parents. My mom may have wanted to talk to me about the marriage or just to see if we had finally succumbed to the stress and broke it off. But I decided not to talk to her because the last time I did she still made it clear my \"situation isn't ideal\"...and I'm like...this is freaking ridiculous. My fiance is a well educated smart man who treats me better than my dad ever treated my mom...but because he isn't Arab...my mom thinks he will \"disrespect\" me....she makes no sense. Plus he's a doctor. Obviously he's pretty stable if he made it through med school and almost through residency. I, on the other hand dropped out of medical school....so according to my parents I'm a fuck-up even though I just completed a master's degree and have  a good job. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I get married I&amp;#39;d be in an apartment. We told my parents that was the plan after my dad ok&amp;#39;d us getting married. But my parents both won&amp;#39;t agree to it. My mom says I&amp;#39;m too old to live in an apartment when I pointed out that she lived an apartment when she first got married to my dad. But that was ok for them because my mom was only 19 when she got married. So I think that may be why they are just pretending like the whole marriage thing isn&amp;#39;t happening. May is coming up and no word from my parents. My mom may have wanted to talk to me about the marriage or just to see if we had finally succumbed to the stress and broke it off. But I decided not to talk to her because the last time I did she still made it clear my &amp;quot;situation isn&amp;#39;t ideal&amp;quot;...and I&amp;#39;m like...this is freaking ridiculous. My fiance is a well educated smart man who treats me better than my dad ever treated my mom...but because he isn&amp;#39;t Arab...my mom thinks he will &amp;quot;disrespect&amp;quot; me....she makes no sense. Plus he&amp;#39;s a doctor. Obviously he&amp;#39;s pretty stable if he made it through med school and almost through residency. I, on the other hand dropped out of medical school....so according to my parents I&amp;#39;m a fuck-up even though I just completed a master&amp;#39;s degree and have  a good job. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdfcpo", "score_hidden": false, "stickied": false, "created": 1492461500.0, "created_utc": 1492432700.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd327d", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BobbleheadDwight", "parent_id": "t1_dgcr02k", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "When you get married, will you have an apartment, or live with his family, or something else? It almost seems like any living arrangement will be better than what you have currently. Hang in there, OP. You are strong, you deserve happiness, and you can do this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you get married, will you have an apartment, or live with his family, or something else? It almost seems like any living arrangement will be better than what you have currently. Hang in there, OP. You are strong, you deserve happiness, and you can do this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd327d", "score_hidden": false, "stickied": false, "created": 1492430708.0, "created_utc": 1492401908.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr02k", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgcqtok", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I don't know when we are going to get married. \n\nI kept the relationship a secret from my parents for 3 years...told them 2 years ago. I've been engaged for 4.5 years. We were supposed to get married last September. Then my fiance came over again with his parents to officially ask for my hand in marriage last November. We set the date for this May 15th, 2017. My dad said ok. It hasn't been brought up since December from my dad. \n\nSo my fiance and I were thinking maybe we should just wait till July 2018 when he is done with medical residency. I thought I could wait but that seems like a long time to deal with my parents every day till then. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know when we are going to get married. &lt;/p&gt;\n\n&lt;p&gt;I kept the relationship a secret from my parents for 3 years...told them 2 years ago. I&amp;#39;ve been engaged for 4.5 years. We were supposed to get married last September. Then my fiance came over again with his parents to officially ask for my hand in marriage last November. We set the date for this May 15th, 2017. My dad said ok. It hasn&amp;#39;t been brought up since December from my dad. &lt;/p&gt;\n\n&lt;p&gt;So my fiance and I were thinking maybe we should just wait till July 2018 when he is done with medical residency. I thought I could wait but that seems like a long time to deal with my parents every day till then. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcr02k", "score_hidden": false, "stickied": false, "created": 1492413993.0, "created_utc": 1492385193.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqtok", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "phantombumblebee", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That sounds like my parents. *eye roll* You go for not putting yourself out there. How long till you get married? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds like my parents. &lt;em&gt;eye roll&lt;/em&gt; You go for not putting yourself out there. How long till you get married? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcqtok", "score_hidden": false, "stickied": false, "created": 1492413748.0, "created_utc": 1492384948.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgcvgl2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LovelessDerivation", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Oh the comeuppance for little GC when the time is right.... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh the comeuppance for little GC when the time is right.... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcvgl2", "score_hidden": false, "stickied": false, "created": 1492419991.0, "created_utc": 1492391191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgdfoqj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgdbr5z", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I can usually stand up to my mom. Not sure if she is a true N or just a co-dependent. My dad...I'm pretty sure he is a true N and he will go into rages and get in my face....I'm really scared of him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can usually stand up to my mom. Not sure if she is a true N or just a co-dependent. My dad...I&amp;#39;m pretty sure he is a true N and he will go into rages and get in my face....I&amp;#39;m really scared of him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdfoqj", "score_hidden": false, "stickied": false, "created": 1492462139.0, "created_utc": 1492433339.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbr5z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nana_3", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It's kind of like a toddler training thing, honestly. Have you ever seen Super Nanny when she teaches kids to do time outs? The kid gets worse, worse, louder, angrier, then eventually will give up. After that, most protests against time outs will be given up quickly, because they know you'll keep firm.\n\nThe difference with N's is that their \"louder and angrier\" can actually have some power over you. So it's definitely a challenge and if your N's \"louder and angrier\" is too much to face, it might not be the best choice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s kind of like a toddler training thing, honestly. Have you ever seen Super Nanny when she teaches kids to do time outs? The kid gets worse, worse, louder, angrier, then eventually will give up. After that, most protests against time outs will be given up quickly, because they know you&amp;#39;ll keep firm.&lt;/p&gt;\n\n&lt;p&gt;The difference with N&amp;#39;s is that their &amp;quot;louder and angrier&amp;quot; can actually have some power over you. So it&amp;#39;s definitely a challenge and if your N&amp;#39;s &amp;quot;louder and angrier&amp;quot; is too much to face, it might not be the best choice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdbr5z", "score_hidden": false, "stickied": false, "created": 1492452176.0, "created_utc": 1492423376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgdt6w3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cantseeyounow", "parent_id": "t1_dgcz9fh", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm sorry:( It's hard when they suck you back in, but don't beat yourself up! Continue with grey rock and I'm sure you'll get there. Stay strong. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry:( It&amp;#39;s hard when they suck you back in, but don&amp;#39;t beat yourself up! Continue with grey rock and I&amp;#39;m sure you&amp;#39;ll get there. Stay strong. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdt6w3", "score_hidden": false, "stickied": false, "created": 1492479339.0, "created_utc": 1492450539.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcz9fh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TylerJaden24", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": ":(\n\nMy nmom isn't liking grey rock very much either. Today I made the mistake of venting to her. I feel like I've just been drained of all life. I've made a decision today: I don't ever want to talk with her about my feelings again. And I know now... She will never change. I'm just so tired.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:(&lt;/p&gt;\n\n&lt;p&gt;My nmom isn&amp;#39;t liking grey rock very much either. Today I made the mistake of venting to her. I feel like I&amp;#39;ve just been drained of all life. I&amp;#39;ve made a decision today: I don&amp;#39;t ever want to talk with her about my feelings again. And I know now... She will never change. I&amp;#39;m just so tired.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcz9fh", "score_hidden": false, "stickied": false, "created": 1492425131.0, "created_utc": 1492396331.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65q7sj", "likes": null, "replies": "", "user_reports": [], "id": "dgdfnbj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ihmb24", "parent_id": "t1_dgd8zas", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I suppose it's not even \"cultural\" reasons...it's religious reasons. No, I am not Muslim but my parents are and I just pretend because if they knew I wasn't Muslim it would be bad. I tried to get independence by going to medical school...that was the only other way I could leave the house. But my plan backfired on me in a big way...because I hated it and dropped out (probably a sign it wouldn't work out when I fainted my first day in anatomy lab...I get queezy). I want to move out but I really don't know how. My younger brother who got married 4 years ago lived in the family home up until the day he got married. My aunt (mom's sister) left the family home when she was in her 20s and was a nurse with a good job. Her father (my grandfather) disowned her for 4 years. She told me she felt like crap during that time period. My self-esteem is already in the hole so I don't know how much more I can take before I'm totally broken. I want to leave...but I just don't know how. One of my parents is ALWAYS home. My dad has his own business so is always in and out of the house...my mom doesn't work...she just cooks and cleans and maybe leaves the house for like a half hour a day. So they'll see if I am leaving. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suppose it&amp;#39;s not even &amp;quot;cultural&amp;quot; reasons...it&amp;#39;s religious reasons. No, I am not Muslim but my parents are and I just pretend because if they knew I wasn&amp;#39;t Muslim it would be bad. I tried to get independence by going to medical school...that was the only other way I could leave the house. But my plan backfired on me in a big way...because I hated it and dropped out (probably a sign it wouldn&amp;#39;t work out when I fainted my first day in anatomy lab...I get queezy). I want to move out but I really don&amp;#39;t know how. My younger brother who got married 4 years ago lived in the family home up until the day he got married. My aunt (mom&amp;#39;s sister) left the family home when she was in her 20s and was a nurse with a good job. Her father (my grandfather) disowned her for 4 years. She told me she felt like crap during that time period. My self-esteem is already in the hole so I don&amp;#39;t know how much more I can take before I&amp;#39;m totally broken. I want to leave...but I just don&amp;#39;t know how. One of my parents is ALWAYS home. My dad has his own business so is always in and out of the house...my mom doesn&amp;#39;t work...she just cooks and cleans and maybe leaves the house for like a half hour a day. So they&amp;#39;ll see if I am leaving. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdfnbj", "score_hidden": false, "stickied": false, "created": 1492462064.0, "created_utc": 1492433264.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8zas", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lila_liechtenstein", "parent_id": "t3_65q7sj", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "You live in the US. Start to adult. Move out. You can. Get a room with roommates. Do it now. Just moving from one close relationship (family) to another close relationship (marriage) is a dangerous path - your husband shouldn't be your saviour, you should gain some independence first. \"Cultural reasons\" are not good reasons, for anything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You live in the US. Start to adult. Move out. You can. Get a room with roommates. Do it now. Just moving from one close relationship (family) to another close relationship (marriage) is a dangerous path - your husband shouldn&amp;#39;t be your saviour, you should gain some independence first. &amp;quot;Cultural reasons&amp;quot; are not good reasons, for anything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd8zas", "score_hidden": false, "stickied": false, "created": 1492442930.0, "created_utc": 1492414130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]