[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just had an Easter lunch with immediate family and grandparents- my nmom dominated entire conversation, barely anyone else could get a word in- yelled at my 12 year old sister for something very minor at the table. I fucking hate it- it is so sad, the fact that I have lived with a mother who is incapable of loving her children. Anytime I&amp;#39;m near her I freeze up and become an emotional robot- A lot of times when she talks a lot I feel nauseous and want to throw up. After one fucking meal sitting next to her I feel drained and depressed as shit- fucking bitch. Sorry for the bad language but I&amp;#39;m angry- I think my mother may actually be evil- she feeds off the lifeforce of other people and can&amp;#39;t pick up on the fact that NOONE likes her&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just had an Easter lunch with immediate family and grandparents- my nmom dominated entire conversation, barely anyone else could get a word in- yelled at my 12 year old sister for something very minor at the table. I fucking hate it- it is so sad, the fact that I have lived with a mother who is incapable of loving her children. Anytime I'm near her I freeze up and become an emotional robot- A lot of times when she talks a lot I feel nauseous and want to throw up. After one fucking meal sitting next to her I feel drained and depressed as shit- fucking bitch. Sorry for the bad language but I'm angry- I think my mother may actually be evil- she feeds off the lifeforce of other people and can't pick up on the fact that NOONE likes her", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Question]", "id": "65r8qw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 152, "report_reasons": null, "author": "thinkofusername6969", "saved": false, "mod_reports": [], "name": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65r8qw/a_single_meal_with_mom_leaves_me_fucking_drained/", "num_reports": null, "locked": false, "stickied": false, "created": 1492403568.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65r8qw/a_single_meal_with_mom_leaves_me_fucking_drained/", "author_flair_text": null, "quarantine": false, "title": "A single meal with mom leaves me fucking drained!!", "created_utc": 1492374768.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 152}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dge8qsn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "norigirl88", "parent_id": "t1_dgdhpi0", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It was the same way for me. Got to be myself at school (I luckily had amazing friends all through school) and had to put on my mask when I got \"home\" (aka kitchen space in dad's gf's place since there wasn't enough space in the house. This also meant I  could never have people over as I wasn't allowed to say I lived in the kitchen.) I wasn't allowed to cry and any show of unjustified or negative emotion was seen as aggressive and worth punishing as I was overreacting in every situation. My friends and their parents kept me sane luckily and were able to give me the ability to see that what I was  going through was not normal or deserved. \n\nI hope your sister can get through it ok. She at least knows you're there for her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was the same way for me. Got to be myself at school (I luckily had amazing friends all through school) and had to put on my mask when I got &amp;quot;home&amp;quot; (aka kitchen space in dad&amp;#39;s gf&amp;#39;s place since there wasn&amp;#39;t enough space in the house. This also meant I  could never have people over as I wasn&amp;#39;t allowed to say I lived in the kitchen.) I wasn&amp;#39;t allowed to cry and any show of unjustified or negative emotion was seen as aggressive and worth punishing as I was overreacting in every situation. My friends and their parents kept me sane luckily and were able to give me the ability to see that what I was  going through was not normal or deserved. &lt;/p&gt;\n\n&lt;p&gt;I hope your sister can get through it ok. She at least knows you&amp;#39;re there for her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge8qsn", "score_hidden": false, "stickied": false, "created": 1492497305.0, "created_utc": 1492468505.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhpi0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thinkofusername6969", "parent_id": "t1_dgd3pa3", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Exactly- was never allowed to be a normal human growing up- and I had the same thing, a casing around my heart- any strong emotions that I ever had would be expressed in privacy- if they weren't private they would be used against me. Example: I rarely cry and consider myself to be a very tough person- after a period of a few months that I was going through some really rough challenges in life and a running injury (running was my greatest passion and one of my only feelings of autonomy while living at home)- I just finally gave in and closed my door and locked it and started crying, trying to not let anyone know- well my mom of course comes knocking on my door and becomes invasive asking what I'm doing and demands to be let in. She sees I'm crying and asks why I'm crying- I told her she would be mad if I explained all the reasons- she promised she wouldn't yet when I told her one of the reasons is living with a mother that is abusive in the ways that she is I ended up getting yelled at by both of my parents. Went from trying to cry alone out of sight from anyone to getting yelled at because I was sad. It is not safe for anyone besides my mom who has daily temper tantrums to have any kind of emotion in that house.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly- was never allowed to be a normal human growing up- and I had the same thing, a casing around my heart- any strong emotions that I ever had would be expressed in privacy- if they weren&amp;#39;t private they would be used against me. Example: I rarely cry and consider myself to be a very tough person- after a period of a few months that I was going through some really rough challenges in life and a running injury (running was my greatest passion and one of my only feelings of autonomy while living at home)- I just finally gave in and closed my door and locked it and started crying, trying to not let anyone know- well my mom of course comes knocking on my door and becomes invasive asking what I&amp;#39;m doing and demands to be let in. She sees I&amp;#39;m crying and asks why I&amp;#39;m crying- I told her she would be mad if I explained all the reasons- she promised she wouldn&amp;#39;t yet when I told her one of the reasons is living with a mother that is abusive in the ways that she is I ended up getting yelled at by both of my parents. Went from trying to cry alone out of sight from anyone to getting yelled at because I was sad. It is not safe for anyone besides my mom who has daily temper tantrums to have any kind of emotion in that house.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdhpi0", "score_hidden": false, "stickied": false, "created": 1492465498.0, "created_utc": 1492436698.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3pa3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "PattyIce32", "parent_id": "t1_dgcjszs", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "\"I feel dead when I'm at home- stopping all of my emotions was the only way to survive growing up.\"\n\nYup.  Age 9-19 that was me and then college was when I really started to become myself.  I always felt that I never had a childhood, I just had like a shell over my heart and soul that lasted until I got away from them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I feel dead when I&amp;#39;m at home- stopping all of my emotions was the only way to survive growing up.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Yup.  Age 9-19 that was me and then college was when I really started to become myself.  I always felt that I never had a childhood, I just had like a shell over my heart and soul that lasted until I got away from them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd3pa3", "score_hidden": false, "stickied": false, "created": 1492431771.0, "created_utc": 1492402971.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgdoycf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MemoryHauntsYou", "parent_id": "t1_dgcjszs", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I want to especially reply here to the part where you say that each conversation with your mom leaves you drained. \n\nWhen my mom broke contact with me (because I didn't want to obey an ultimatum she had given me), I was just married. My husband knew my mom but only had seen the top of the iceberg of the toxicity she was unleashing on me (and had been unleashing all my life, ever since I was a little child.) \n\nIn the beginning of the no-contact period, he, who comes from a very warm and loving family, had the opinion of: \"This really should be fixed, it's still your mother\". \n\nBut after a year or so, he admitted to me that I had become a completely different person without the toxic contact. He said that he had started to realise what a weight a short visit to my mom could put on me, that I had always been nervous and down after such a visit. That I had become a much more independent and stable woman after a year without contact. \n\nAnd as such he had learned that, even though for him it would be unthinkable to break contact with any of his own family, it was the right thing for me, because not all moms are like his mom. \n\nHis mom is fantastic, by the way, so is his dad. And as the years have gone by, I have started to appreciate more and more the warm nest they have given to their children and the wonderful man my husband has become. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to especially reply here to the part where you say that each conversation with your mom leaves you drained. &lt;/p&gt;\n\n&lt;p&gt;When my mom broke contact with me (because I didn&amp;#39;t want to obey an ultimatum she had given me), I was just married. My husband knew my mom but only had seen the top of the iceberg of the toxicity she was unleashing on me (and had been unleashing all my life, ever since I was a little child.) &lt;/p&gt;\n\n&lt;p&gt;In the beginning of the no-contact period, he, who comes from a very warm and loving family, had the opinion of: &amp;quot;This really should be fixed, it&amp;#39;s still your mother&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;But after a year or so, he admitted to me that I had become a completely different person without the toxic contact. He said that he had started to realise what a weight a short visit to my mom could put on me, that I had always been nervous and down after such a visit. That I had become a much more independent and stable woman after a year without contact. &lt;/p&gt;\n\n&lt;p&gt;And as such he had learned that, even though for him it would be unthinkable to break contact with any of his own family, it was the right thing for me, because not all moms are like his mom. &lt;/p&gt;\n\n&lt;p&gt;His mom is fantastic, by the way, so is his dad. And as the years have gone by, I have started to appreciate more and more the warm nest they have given to their children and the wonderful man my husband has become. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdoycf", "score_hidden": false, "stickied": false, "created": 1492474627.0, "created_utc": 1492445827.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjszs", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "thinkofusername6969", "parent_id": "t1_dgcjh60", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yeah my dad is here- mostly a very cool guy but he is whipped by my mom, my grandparents are a little weird but I think they see through the matrix of my mom- and they have told me shit about her that was totally contrary to the perfect image of herself that I was raised with. I feel really bad for my youngest sister bc I am away at college and have only been back a few weeks out of the year- she doesn't get a chance to have exposure to someone normal and my mom lives through my sister. In the times I tried to defend my sister( trying to stop my mom from fat shaming my sister- I.e. Calling her a pig, saying she's eating too much, even though my sister is a totally healthy weight) my mom exploded into a narc rage episode. I feel dead when I'm at home- stopping all of my emotions was the only way to survive growing up. But I'll be back at college with many loving and amazing friends by tomorrow- absolutely fucking dreading the car ride with my mom to my college though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah my dad is here- mostly a very cool guy but he is whipped by my mom, my grandparents are a little weird but I think they see through the matrix of my mom- and they have told me shit about her that was totally contrary to the perfect image of herself that I was raised with. I feel really bad for my youngest sister bc I am away at college and have only been back a few weeks out of the year- she doesn&amp;#39;t get a chance to have exposure to someone normal and my mom lives through my sister. In the times I tried to defend my sister( trying to stop my mom from fat shaming my sister- I.e. Calling her a pig, saying she&amp;#39;s eating too much, even though my sister is a totally healthy weight) my mom exploded into a narc rage episode. I feel dead when I&amp;#39;m at home- stopping all of my emotions was the only way to survive growing up. But I&amp;#39;ll be back at college with many loving and amazing friends by tomorrow- absolutely fucking dreading the car ride with my mom to my college though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcjszs", "score_hidden": false, "stickied": false, "created": 1492404347.0, "created_utc": 1492375547.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjh60", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "MemoryHauntsYou", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I remember that feeling, though it has been a long time since I last saw my mother. \n\nMay I offer you big hugs, or at least my support.\n\nI feel horrible for your little sister too. \n\nNo birthday, Easter, Christmas, New Year, you name it could pass without my mother having at least one meltdown. \n\nMay I ask - is there a father in the picture? And what are the rest of your family like? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember that feeling, though it has been a long time since I last saw my mother. &lt;/p&gt;\n\n&lt;p&gt;May I offer you big hugs, or at least my support.&lt;/p&gt;\n\n&lt;p&gt;I feel horrible for your little sister too. &lt;/p&gt;\n\n&lt;p&gt;No birthday, Easter, Christmas, New Year, you name it could pass without my mother having at least one meltdown. &lt;/p&gt;\n\n&lt;p&gt;May I ask - is there a father in the picture? And what are the rest of your family like? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcjh60", "score_hidden": false, "stickied": false, "created": 1492403925.0, "created_utc": 1492375125.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgd0o9r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "queensage77", "parent_id": "t1_dgcwfua", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It's funny because I read so many things on this thread that I didn't know other people even experienced. It's so awesome to know I'm not alone. I know that sounds so cheese but it's true. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s funny because I read so many things on this thread that I didn&amp;#39;t know other people even experienced. It&amp;#39;s so awesome to know I&amp;#39;m not alone. I know that sounds so cheese but it&amp;#39;s true. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd0o9r", "score_hidden": false, "stickied": false, "created": 1492427104.0, "created_utc": 1492398304.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwfua", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "badamant", "parent_id": "t1_dgcuiu5", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Me too. Thought id made it up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Me too. Thought id made it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcwfua", "score_hidden": false, "stickied": false, "created": 1492421235.0, "created_utc": 1492392435.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuiu5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "queensage77", "parent_id": "t1_dgcrhg2", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Totally I describe my mom this way to people so they will understand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally I describe my mom this way to people so they will understand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcuiu5", "score_hidden": false, "stickied": false, "created": 1492418748.0, "created_utc": 1492389948.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrhg2", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "skys-the-limit", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;she feeds off the lifeforce of other people\n\nThis is what Narcissists do:  they feed off your emotional energy / Life Force until they drain you.\n\nThey are Emotional Vampires.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she feeds off the lifeforce of other people&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is what Narcissists do:  they feed off your emotional energy / Life Force until they drain you.&lt;/p&gt;\n\n&lt;p&gt;They are Emotional Vampires.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcrhg2", "score_hidden": false, "stickied": false, "created": 1492414645.0, "created_utc": 1492385845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgcqk6g", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Schnauzerbutt", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Ugh. I haven't called my mom for a while and I get that feeling whenever I do. It's always about her depression and how everyone is awful to her but she won't fix it cause she's old. How does this still affect me so strongly? I'm sorry you get that sick feeling too. It's not pleasant. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh. I haven&amp;#39;t called my mom for a while and I get that feeling whenever I do. It&amp;#39;s always about her depression and how everyone is awful to her but she won&amp;#39;t fix it cause she&amp;#39;s old. How does this still affect me so strongly? I&amp;#39;m sorry you get that sick feeling too. It&amp;#39;s not pleasant. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcqk6g", "score_hidden": false, "stickied": false, "created": 1492413389.0, "created_utc": 1492384589.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgdjt6t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "crimestudent", "parent_id": "t1_dgd5f6d", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yes! I just couldn't believe it. I really thought I was crazy because she had it had always told me it was all me. It was all in my head. Then I found RBN and I saw the light. I knew for once in my life I was not alone. I knew it was not just me because her father use it admit to it all, before he moved in with her because of altzhimers. It took my husband 30min. What it took me 30years to figure out I was RBN. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! I just couldn&amp;#39;t believe it. I really thought I was crazy because she had it had always told me it was all me. It was all in my head. Then I found RBN and I saw the light. I knew for once in my life I was not alone. I knew it was not just me because her father use it admit to it all, before he moved in with her because of altzhimers. It took my husband 30min. What it took me 30years to figure out I was RBN. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdjt6t", "score_hidden": false, "stickied": false, "created": 1492468485.0, "created_utc": 1492439685.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5f6d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TylerJaden24", "parent_id": "t1_dgcu63q", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She called you draining?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She called you draining?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd5f6d", "score_hidden": false, "stickied": false, "created": 1492434957.0, "created_utc": 1492406157.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu63q", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "crimestudent", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "OMG I get it my last contact with nmom she called having a melt down. Asking for advice. When I went to set aside my emotions one more time to give her advice only this time I opened my mouth and actually said, \"setting aside all the shit you have done against me\" and that's all I got out before she lost it. She actually said to me, \"don't you think I feel bad enough for the way I treated you in your life?? Do you really need to remind me?? Don't you understand I already have night mares over it\" all I could say was \"then stop doing it\" at the top of my lungs. I text her apologising for my unreasonableness (I don't know why) which was met by \"I just can't deal with you any more you are just to draining\". I have been NC every since. My GCbrother moved out if country to get away from her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OMG I get it my last contact with nmom she called having a melt down. Asking for advice. When I went to set aside my emotions one more time to give her advice only this time I opened my mouth and actually said, &amp;quot;setting aside all the shit you have done against me&amp;quot; and that&amp;#39;s all I got out before she lost it. She actually said to me, &amp;quot;don&amp;#39;t you think I feel bad enough for the way I treated you in your life?? Do you really need to remind me?? Don&amp;#39;t you understand I already have night mares over it&amp;quot; all I could say was &amp;quot;then stop doing it&amp;quot; at the top of my lungs. I text her apologising for my unreasonableness (I don&amp;#39;t know why) which was met by &amp;quot;I just can&amp;#39;t deal with you any more you are just to draining&amp;quot;. I have been NC every since. My GCbrother moved out if country to get away from her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcu63q", "score_hidden": false, "stickied": false, "created": 1492418277.0, "created_utc": 1492389477.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgd2zw8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "iskarra", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I've heard n's described as 'emotional vampires' before for this very reason. They are just so draining.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard n&amp;#39;s described as &amp;#39;emotional vampires&amp;#39; before for this very reason. They are just so draining.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd2zw8", "score_hidden": false, "stickied": false, "created": 1492430603.0, "created_utc": 1492401803.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgd8zzw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thinkofusername6969", "parent_id": "t1_dgd8x35", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Unfortunately I'm 18 in college and went home for Easter break, trying to find any possible way to live away from home this summer and go home as little as possible", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately I&amp;#39;m 18 in college and went home for Easter break, trying to find any possible way to live away from home this summer and go home as little as possible&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd8zzw", "score_hidden": false, "stickied": false, "created": 1492442987.0, "created_utc": 1492414187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8x35", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "subspicious", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Feeling nauseous and wanting to throw up is often a physical reaction (one of many) to stress. And yeah, it's one of the ways my body reacts to stress so I'm well versed in feeling the onset.\n\nYou might find it easier (on the gut) to just do coffee with her where possible", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feeling nauseous and wanting to throw up is often a physical reaction (one of many) to stress. And yeah, it&amp;#39;s one of the ways my body reacts to stress so I&amp;#39;m well versed in feeling the onset.&lt;/p&gt;\n\n&lt;p&gt;You might find it easier (on the gut) to just do coffee with her where possible&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd8x35", "score_hidden": false, "stickied": false, "created": 1492442755.0, "created_utc": 1492413955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgd3muy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PattyIce32", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Sending you a big hug, I can feel the anger and rage in your post, you deserve better and the way she treated you is completly unacceptable.  Things will get better when you move out, I promise.\n\nI am actually getting a headache now because how you feel was exactly how I felt near my dad, grandma, sister, brother, aunt and a few cousins.  They really do feed off of others, offer nothing to the world but hate and try to be as negative as possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sending you a big hug, I can feel the anger and rage in your post, you deserve better and the way she treated you is completly unacceptable.  Things will get better when you move out, I promise.&lt;/p&gt;\n\n&lt;p&gt;I am actually getting a headache now because how you feel was exactly how I felt near my dad, grandma, sister, brother, aunt and a few cousins.  They really do feed off of others, offer nothing to the world but hate and try to be as negative as possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd3muy", "score_hidden": false, "stickied": false, "created": 1492431657.0, "created_utc": 1492402857.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65r8qw", "likes": null, "replies": "", "user_reports": [], "id": "dgdgtca", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wombatmagic", "parent_id": "t1_dgd9mrf", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Ours were always dry.  Nmum doesn't like anyone drinking.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ours were always dry.  Nmum doesn&amp;#39;t like anyone drinking.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdgtca", "score_hidden": false, "stickied": false, "created": 1492464084.0, "created_utc": 1492435284.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9mrf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "uniqueusername831", "parent_id": "t1_dgd6zyb", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is exactly like my family, everybody shows up cuz they will be made to feel bad if they don't, but nobody wants to be there. We always all end up getting drunk, and that just makes things worse ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is exactly like my family, everybody shows up cuz they will be made to feel bad if they don&amp;#39;t, but nobody wants to be there. We always all end up getting drunk, and that just makes things worse &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd9mrf", "score_hidden": false, "stickied": false, "created": 1492444899.0, "created_utc": 1492416099.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6zyb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thinkofusername6969", "parent_id": "t1_dgd6tj6", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Hell yeah she does- she makes sure that I have to \"eat with the family\" because if I don't I am abandoning all of them and harming them deeply (no one else even minds if I am busy and need to skip dinner or want to spend time with friends except her) the weird part is- the dinner is not enjoyable at all - well if my mom is there it's not enjoyable at all- she just sulks, criticizes eveyone, and stares at me for an uncomfortably long amount of time. I feel so physically tense when I'm at the table with her. How is this supposed to be enjoyable? No one wants to be there and she makes it really fucking clear that she doesn't either but guilts everyone to be there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hell yeah she does- she makes sure that I have to &amp;quot;eat with the family&amp;quot; because if I don&amp;#39;t I am abandoning all of them and harming them deeply (no one else even minds if I am busy and need to skip dinner or want to spend time with friends except her) the weird part is- the dinner is not enjoyable at all - well if my mom is there it&amp;#39;s not enjoyable at all- she just sulks, criticizes eveyone, and stares at me for an uncomfortably long amount of time. I feel so physically tense when I&amp;#39;m at the table with her. How is this supposed to be enjoyable? No one wants to be there and she makes it really fucking clear that she doesn&amp;#39;t either but guilts everyone to be there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd6zyb", "score_hidden": false, "stickied": false, "created": 1492438245.0, "created_utc": 1492409445.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6tj6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "uniqueusername831", "parent_id": "t3_65r8qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Does she guilt you into these family get togethers? That's what mine does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does she guilt you into these family get togethers? That&amp;#39;s what mine does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd6tj6", "score_hidden": false, "stickied": false, "created": 1492437857.0, "created_utc": 1492409057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]