[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A use r from my twoxchromosomes post told me to cross post this here. IAfter reading  a couple of other posts I definitely believe I belong in this sub.  Okay so my mom has always had an explosive temper. Little things will set her off like if I didnt wash the dishes &amp;quot;correctly&amp;quot; or I forgot something that was important to her but not me. This isn&amp;#39;t the first time she&amp;#39;s messed up my things but this is the first time she&amp;#39;s done this to all of my things. &lt;/p&gt;\n\n&lt;p&gt;I have an after school / weekend job babysitting 3 kids from 4 pm until their mom gets home. Sometimes she doesn&amp;#39;t get home until 9 pm or later. I get 150 a week for babysitting her kids. I&amp;#39;ve asked her before to give me an increase on payment but she always has some kind of excuse and she&amp;#39;s a single mom so I just let it go. A lot of time, I end up giving my mom half of what I earn, or even more because she never pays the bills on time. If it hadn&amp;#39;t been for me giving her my babysitting money two weeks ago, our power would have been shut off. My mom works..but she spends a lot of her money on going out and partying with her friends&lt;/p&gt;\n\n&lt;p&gt;Yesterday while I was baby sitting my mom texted me asking if I could &amp;quot;Loan&amp;quot; her money to pay her car payment when I received my little bit of money at the end of the night. I had to leave early because my family does Easter dinner the night before instead of Easter Sunday. I told my mom I couldnt because I wanted to pay for my prom ticket early at school on Monday and I needed to give my friend who gives me rides to school gas money. She didn&amp;#39;t say anything back and I thought it all was okay&lt;/p&gt;\n\n&lt;p&gt;I got home around 7 pm last night and my family was there. Just my mom, me, and my grandparents. My mom and grandma were making dinner and I tried to help but my mom called me useless and told me to get out of her kitchen. I knew she was angry but I didn&amp;#39;t think she would do what she did. When dinner was done, we were all sitting at the table and my grandma asked my mom how work was going. My mom said it would be more easier on her if I &amp;quot;pulled my weight around&amp;quot;. I didn&amp;#39;t say anything because I knew she ws angry at me not giving her money . My mom kept saying how I wasnt pulling my weight and my grandad said &amp;quot;Didnt you tell me a few weeks ago MyName helped you pay some bills? I think she;s pulling her weight just fine&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Well that just made my mom GO OFF. She said I was useless and I needed to be helping her more because I owe it to her and she deserves it. mY mom got up from the table and went into my room, I wanted to go afteer her but my granddad told me not to. sHE started throwing my things and messed up a lot of my makeup. I could hear glass breaking and then she went into our laundry room and started throwing bleach on my clothes hanging up in my closet. My grandma got up and tried to talk to her but she told my grandma to get fucked and get out of her house before she called the cops because she didnt need them telling them how to parent ,e&lt;/p&gt;\n\n&lt;p&gt;My grandparents left really wuickly after that while my mom was still going off. She ended u getting bleach on my blankets and al ot of my clothes hanging up in my closet now have bleach stains and are unwearable. I had to sleep on the couch last night because my room smelled so bad like bleach I couldnt sleep in my own room&lt;/p&gt;\n\n&lt;p&gt;My mom has been gone all day and I tried fixing my clothes as best i could but she really did a number on everything. I dont have a dresser so pretty much all of my clothing now has bleach on it. Im really mad at my grandparents for not doing anything while she was going off but theyve never been much help when she&amp;#39;s done this in the past. I feel so embarrassed and ashamed and angry but I don&amp;#39;t want this happening again. I dont know how to make this right with her except to give her my money but now I need to buy myself all new clothes &lt;/p&gt;\n\n&lt;p&gt;How do I make this rIght with her? Do I juat say sorry and give her my momey? I don&amp;#39;t want this happening again &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A use r from my twoxchromosomes post told me to cross post this here. IAfter reading  a couple of other posts I definitely believe I belong in this sub.  Okay so my mom has always had an explosive temper. Little things will set her off like if I didnt wash the dishes \"correctly\" or I forgot something that was important to her but not me. This isn't the first time she's messed up my things but this is the first time she's done this to all of my things. \n\n\n  I have an after school / weekend job babysitting 3 kids from 4 pm until their mom gets home. Sometimes she doesn't get home until 9 pm or later. I get 150 a week for babysitting her kids. I've asked her before to give me an increase on payment but she always has some kind of excuse and she's a single mom so I just let it go. A lot of time, I end up giving my mom half of what I earn, or even more because she never pays the bills on time. If it hadn't been for me giving her my babysitting money two weeks ago, our power would have been shut off. My mom works..but she spends a lot of her money on going out and partying with her friends\n\n\nYesterday while I was baby sitting my mom texted me asking if I could \"Loan\" her money to pay her car payment when I received my little bit of money at the end of the night. I had to leave early because my family does Easter dinner the night before instead of Easter Sunday. I told my mom I couldnt because I wanted to pay for my prom ticket early at school on Monday and I needed to give my friend who gives me rides to school gas money. She didn't say anything back and I thought it all was okay\n\nI got home around 7 pm last night and my family was there. Just my mom, me, and my grandparents. My mom and grandma were making dinner and I tried to help but my mom called me useless and told me to get out of her kitchen. I knew she was angry but I didn't think she would do what she did. When dinner was done, we were all sitting at the table and my grandma asked my mom how work was going. My mom said it would be more easier on her if I \"pulled my weight around\". I didn't say anything because I knew she ws angry at me not giving her money . My mom kept saying how I wasnt pulling my weight and my grandad said \"Didnt you tell me a few weeks ago MyName helped you pay some bills? I think she;s pulling her weight just fine\"\n\nWell that just made my mom GO OFF. She said I was useless and I needed to be helping her more because I owe it to her and she deserves it. mY mom got up from the table and went into my room, I wanted to go afteer her but my granddad told me not to. sHE started throwing my things and messed up a lot of my makeup. I could hear glass breaking and then she went into our laundry room and started throwing bleach on my clothes hanging up in my closet. My grandma got up and tried to talk to her but she told my grandma to get fucked and get out of her house before she called the cops because she didnt need them telling them how to parent ,e\n\nMy grandparents left really wuickly after that while my mom was still going off. She ended u getting bleach on my blankets and al ot of my clothes hanging up in my closet now have bleach stains and are unwearable. I had to sleep on the couch last night because my room smelled so bad like bleach I couldnt sleep in my own room\n\nMy mom has been gone all day and I tried fixing my clothes as best i could but she really did a number on everything. I dont have a dresser so pretty much all of my clothing now has bleach on it. Im really mad at my grandparents for not doing anything while she was going off but theyve never been much help when she's done this in the past. I feel so embarrassed and ashamed and angry but I don't want this happening again. I dont know how to make this right with her except to give her my money but now I need to buy myself all new clothes \n\nHow do I make this rIght with her? Do I juat say sorry and give her my momey? I don't want this happening again \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65sirc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 250, "report_reasons": null, "author": "throwaway81456b", "saved": false, "mod_reports": [], "name": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65sirc/my_mom_destroyed_all_of_my_makeup_and_clothes_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418930.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65sirc/my_mom_destroyed_all_of_my_makeup_and_clothes_in/", "author_flair_text": null, "quarantine": false, "title": "My mom destroyed all of my makeup and clothes in a fit of rage.", "created_utc": 1492390130.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 55, "visited": false, "subreddit_type": "public", "ups": 250}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdeuol", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wordtoyourmother8", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "A warning to commenters: Please do not offer to send OP money or gifts, that's not something we allow here. If you see comments that cross the line, please report them. Comments that offer gifts or money will be removed by the mods with or without comment. Thanks.\n\nEDIT: added words", "edited": 1492435338.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A warning to commenters: Please do not offer to send OP money or gifts, that&amp;#39;s not something we allow here. If you see comments that cross the line, please report them. Comments that offer gifts or money will be removed by the mods with or without comment. Thanks.&lt;/p&gt;\n\n&lt;p&gt;EDIT: added words&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdeuol", "score_hidden": true, "stickied": true, "created": 1492460508.0, "created_utc": 1492431708.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd4t0k", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Durbee", "parent_id": "t1_dgd2x27", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I thought this, as well.  I'd also look into a nanny arrangement with a good family, too.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought this, as well.  I&amp;#39;d also look into a nanny arrangement with a good family, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd4t0k", "score_hidden": false, "stickied": false, "created": 1492433744.0, "created_utc": 1492404944.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdivry", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "HerAirness", "parent_id": "t1_dgd2x27", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Maybe you can offer to get paid less to be allowed to live there.  I am LIVID reading your post OP.  Please PLEASE PLEASE make plans now to get out of there at 18.  I can't believe your grandparents left &amp; let her rage on you like that.  I am so angry for you. Ugh.  I don't want to sound like a jerk, but your grandparents are cowards, it sounds to me like no one is really looking out for you, so there is no reason for you to stick around after 18.  Hang in there.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you can offer to get paid less to be allowed to live there.  I am LIVID reading your post OP.  Please PLEASE PLEASE make plans now to get out of there at 18.  I can&amp;#39;t believe your grandparents left &amp;amp; let her rage on you like that.  I am so angry for you. Ugh.  I don&amp;#39;t want to sound like a jerk, but your grandparents are cowards, it sounds to me like no one is really looking out for you, so there is no reason for you to stick around after 18.  Hang in there.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdivry", "score_hidden": false, "stickied": false, "created": 1492467216.0, "created_utc": 1492438416.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd3ca3", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "BobbleheadDwight", "parent_id": "t1_dgd2x27", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is brilliant.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is brilliant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd3ca3", "score_hidden": false, "stickied": false, "created": 1492431162.0, "created_utc": 1492402362.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2x27", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "puss_parkerswidow", "parent_id": "t1_dgcv8xx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It's probably a long shot, but would the family you babysit consider letting you live there?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s probably a long shot, but would the family you babysit consider letting you live there?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd2x27", "score_hidden": false, "stickied": false, "created": 1492430474.0, "created_utc": 1492401674.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgcvopz", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "abbeykait", "parent_id": "t1_dgcv8xx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Thats really tough, again im so sorry you're having to deal with this would you be able to stay with a friend by any chance? I hate to say that your only option is leaving but, as someone who comes from a verbally and emotionally abusive household, that was the only thing that finally helped me. If you need to stay, I would record when things like this happen (take pictures, a short video on your phone, etc.) so that you have tangible proof of the things she is doing because if she has a habit of doing things like this you can (if you feel it necessary/appropriate) take this proof to the police and they can intervene. I know that seems extreme and she is your mom and you care about her and love her but it can be permanently damaging to your mental health being tense and walking on egg shells all the time at home. I know I personally have PTSD from my home life prior to moving out and I wish I had left before I turned 18, it probably would have prevented some of that. I hope this gets itself sorted out for you soon, if you need a baby step, try sitting down with her and talking about how this incident has mad you feel and don't let her turn it around or gaslight you, just have an adult discussion, if she cant do that and gets angry or becomes reactive then you really should try to get out asap. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thats really tough, again im so sorry you&amp;#39;re having to deal with this would you be able to stay with a friend by any chance? I hate to say that your only option is leaving but, as someone who comes from a verbally and emotionally abusive household, that was the only thing that finally helped me. If you need to stay, I would record when things like this happen (take pictures, a short video on your phone, etc.) so that you have tangible proof of the things she is doing because if she has a habit of doing things like this you can (if you feel it necessary/appropriate) take this proof to the police and they can intervene. I know that seems extreme and she is your mom and you care about her and love her but it can be permanently damaging to your mental health being tense and walking on egg shells all the time at home. I know I personally have PTSD from my home life prior to moving out and I wish I had left before I turned 18, it probably would have prevented some of that. I hope this gets itself sorted out for you soon, if you need a baby step, try sitting down with her and talking about how this incident has mad you feel and don&amp;#39;t let her turn it around or gaslight you, just have an adult discussion, if she cant do that and gets angry or becomes reactive then you really should try to get out asap. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcvopz", "score_hidden": false, "stickied": false, "created": 1492420283.0, "created_utc": 1492391483.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdio7p", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "selfsufficientnigga", "parent_id": "t1_dgcv8xx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This isn't just your mother being psychotic in the heat of the moment. She is calculatedly sabotaging you from being able to leave when you're 18, by making sure you don't have any savings (by slowly bleeding you dry whenever she knows you got some money), and by destroying things you own so you'll have to depend on her to get new stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t just your mother being psychotic in the heat of the moment. She is calculatedly sabotaging you from being able to leave when you&amp;#39;re 18, by making sure you don&amp;#39;t have any savings (by slowly bleeding you dry whenever she knows you got some money), and by destroying things you own so you&amp;#39;ll have to depend on her to get new stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdio7p", "score_hidden": false, "stickied": false, "created": 1492466929.0, "created_utc": 1492438129.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdshmh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jovet_Hunter", "parent_id": "t1_dgdjr16", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Some creepy person could try and use her info to get her fired from her job, her only escape.  Things like this have been known to happen.  It's unimaginable the things people do for kicks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some creepy person could try and use her info to get her fired from her job, her only escape.  Things like this have been known to happen.  It&amp;#39;s unimaginable the things people do for kicks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdshmh", "score_hidden": false, "stickied": false, "created": 1492478558.0, "created_utc": 1492449758.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjr16", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "wordtoyourmother8", "parent_id": "t1_dgdikmb", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "No, unfortunately a PO box won't help. We've had people scam users out of gifts, money, etc. We've also had users get info about posters and contact people those posters knew (their school, their work, etc.).   Sadly there are tons of people in the world that like to take money, resources and personal info from others in order to do bad things and they don't care who it hurts. By restricting this type of thing, we help prevent our users from being taken advantage of. If people need assistance, there are quite a lot of subs that can help out, including /r/RBNFavors, that can help them raise money, get food, get money loaned to them, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, unfortunately a PO box won&amp;#39;t help. We&amp;#39;ve had people scam users out of gifts, money, etc. We&amp;#39;ve also had users get info about posters and contact people those posters knew (their school, their work, etc.).   Sadly there are tons of people in the world that like to take money, resources and personal info from others in order to do bad things and they don&amp;#39;t care who it hurts. By restricting this type of thing, we help prevent our users from being taken advantage of. If people need assistance, there are quite a lot of subs that can help out, including &lt;a href=\"/r/RBNFavors\"&gt;/r/RBNFavors&lt;/a&gt;, that can help them raise money, get food, get money loaned to them, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdjr16", "score_hidden": false, "stickied": false, "created": 1492468406.0, "created_utc": 1492439606.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdikmb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TheQuinnBee", "parent_id": "t1_dgdgmqv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Just out of curiosity, what do the bad intentioned people do? Anything that could be avoided through the use of a p.o.box?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just out of curiosity, what do the bad intentioned people do? Anything that could be avoided through the use of a p.o.box?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdikmb", "score_hidden": false, "stickied": false, "created": 1492466788.0, "created_utc": 1492437988.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgmqv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "wordtoyourmother8", "parent_id": "t1_dgd9bjv", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Although I appreciate you trying to help OP,  we don't allow people to offer to send gifts or items to other users so your comment has been removed. Sadly, not everyone on reddit has good intentions and stopping this sort of thing helps to ensure our users don't get taken advantage of.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Although I appreciate you trying to help OP,  we don&amp;#39;t allow people to offer to send gifts or items to other users so your comment has been removed. Sadly, not everyone on reddit has good intentions and stopping this sort of thing helps to ensure our users don&amp;#39;t get taken advantage of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdgmqv", "score_hidden": false, "stickied": false, "created": 1492463793.0, "created_utc": 1492434993.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9bjv", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcv8xx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "[removed]", "edited": 1492445790.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd9bjv", "score_hidden": false, "stickied": false, "created": 1492443931.0, "created_utc": 1492415131.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd6atu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "cuneiformgraffiti", "parent_id": "t1_dgcv8xx", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That's rough, I'm sorry.  Maybe your grandparents would be willing to store some of your stuff so nmom can't destroy it?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s rough, I&amp;#39;m sorry.  Maybe your grandparents would be willing to store some of your stuff so nmom can&amp;#39;t destroy it?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd6atu", "score_hidden": false, "stickied": false, "created": 1492436756.0, "created_utc": 1492407956.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv8xx", "gilded": 0, "archived": false, "score": 68, "report_reasons": null, "author": "throwaway81456b", "parent_id": "t1_dgcv30w", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Im 17. I'll be 18 in september. Ive tried saving up to move out because this isnt the first time she's done this. Shes brokn my things before to \"teach me a lesson\" but  I dont have any other family besides my grandparents and I've asked them before if they could let me move in with them and they said no . I wish she weren't like this ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im 17. I&amp;#39;ll be 18 in september. Ive tried saving up to move out because this isnt the first time she&amp;#39;s done this. Shes brokn my things before to &amp;quot;teach me a lesson&amp;quot; but  I dont have any other family besides my grandparents and I&amp;#39;ve asked them before if they could let me move in with them and they said no . I wish she weren&amp;#39;t like this &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcv8xx", "score_hidden": false, "stickied": false, "created": 1492419712.0, "created_utc": 1492390912.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 68}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdrxmn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tauresa", "parent_id": "t1_dgcv30w", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "What a lovely comment.:)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a lovely comment.:)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdrxmn", "score_hidden": false, "stickied": false, "created": 1492477943.0, "created_utc": 1492449143.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv30w", "gilded": 0, "archived": false, "score": 90, "report_reasons": null, "author": "abbeykait", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Holy shit I'm so sorry that happened to you! How old are you? That is extremely abusive behavior and you really need to get out of that situation as quickly as possible. If you are a minor I feel awful because that makes it so much harder to remove yourself from that situation but honestly, go stay with a friend or family member. You cannot continue to be in a house with someone so volatile and abusive. Parents have to respect their children just as much as children should respect their parents, and she is far from respecting you. If you are not a minor, I would get out as fast as you can and never look back. I would not give her a dime, because thats telling her that treating you with such disrespect will get her what she wants.  I'm so sorry you're having to deal with this!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit I&amp;#39;m so sorry that happened to you! How old are you? That is extremely abusive behavior and you really need to get out of that situation as quickly as possible. If you are a minor I feel awful because that makes it so much harder to remove yourself from that situation but honestly, go stay with a friend or family member. You cannot continue to be in a house with someone so volatile and abusive. Parents have to respect their children just as much as children should respect their parents, and she is far from respecting you. If you are not a minor, I would get out as fast as you can and never look back. I would not give her a dime, because thats telling her that treating you with such disrespect will get her what she wants.  I&amp;#39;m so sorry you&amp;#39;re having to deal with this!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcv30w", "score_hidden": false, "stickied": false, "created": 1492419498.0, "created_utc": 1492390698.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 90}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd7l9n", "gilded": 0, "archived": false, "score": 74, "report_reasons": null, "author": "Gravitycon", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Since you are a minor, it should be less difficult to get removed from that household. Make sure you take A LOT of pictures of what she did (hopefully whatever glass broke) and write down the most detailed account you can of what happened. Then, if you are still in high school, TELL A TEACHER YOU TRUST!! If you have a school counselor or teacher you feel comfortable with, tell them immediately. They are required to report this to CPS, plus, you have someone on your side as opposed to calling CPS yourself. In my experience as a teacher, someone from CPS will most likely come to your school that day. If you show them the pictures and your written account of what happened, that should get you removed from her custody immediately. \n\nIf there are any other violent outbursts she's had in the past, write those down too. And most importantly, DO NOT GIVE HER ANY MONEY. Giving her money just reinforces her awful behavior and leaves you without a resource you need. \n\nMy parents have always taken my money at every opportunity, so I got in the habit of spending it as quickly as possible. This is terrible financial advice for managing and saving money, but you might want to do this and buy new clothes before she tries to take the money from you. \n\nGood luck and stay safe!! I hope you get out of there quickly!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since you are a minor, it should be less difficult to get removed from that household. Make sure you take A LOT of pictures of what she did (hopefully whatever glass broke) and write down the most detailed account you can of what happened. Then, if you are still in high school, TELL A TEACHER YOU TRUST!! If you have a school counselor or teacher you feel comfortable with, tell them immediately. They are required to report this to CPS, plus, you have someone on your side as opposed to calling CPS yourself. In my experience as a teacher, someone from CPS will most likely come to your school that day. If you show them the pictures and your written account of what happened, that should get you removed from her custody immediately. &lt;/p&gt;\n\n&lt;p&gt;If there are any other violent outbursts she&amp;#39;s had in the past, write those down too. And most importantly, DO NOT GIVE HER ANY MONEY. Giving her money just reinforces her awful behavior and leaves you without a resource you need. &lt;/p&gt;\n\n&lt;p&gt;My parents have always taken my money at every opportunity, so I got in the habit of spending it as quickly as possible. This is terrible financial advice for managing and saving money, but you might want to do this and buy new clothes before she tries to take the money from you. &lt;/p&gt;\n\n&lt;p&gt;Good luck and stay safe!! I hope you get out of there quickly!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd7l9n", "score_hidden": false, "stickied": false, "created": 1492439573.0, "created_utc": 1492410773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 74}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdxswe", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Shortacts", "parent_id": "t1_dgdilum", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It's possible. But, it's also a lot easier to hide those damaged spots on black fabric than it is to toss everything all at once and go on a shopping trip to replace everything all at once.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s possible. But, it&amp;#39;s also a lot easier to hide those damaged spots on black fabric than it is to toss everything all at once and go on a shopping trip to replace everything all at once.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdxswe", "score_hidden": false, "stickied": false, "created": 1492484485.0, "created_utc": 1492455685.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdilum", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "The_Optimistic_Otter", "parent_id": "t1_dgdb9ke", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "There may be holes in the clothes :/ bleach not only causes color damage, it causes structural damage to the clothes themselves (especially if her mom just poured straight bleach on it). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There may be holes in the clothes :/ bleach not only causes color damage, it causes structural damage to the clothes themselves (especially if her mom just poured straight bleach on it). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdilum", "score_hidden": false, "stickied": false, "created": 1492466838.0, "created_utc": 1492438038.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgderkz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "BawssNass", "parent_id": "t1_dgdb9ke", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is a good idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a good idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgderkz", "score_hidden": false, "stickied": false, "created": 1492460334.0, "created_utc": 1492431534.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdb9ke", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "Shortacts", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Buy black dye and salvage some of your clothes by dying them black. Rit dye works well. Also get Rit for synthetic fibers. Wash everything first to clear the bleach, then dye. You'll be rocking neo-goth threads for a minute, but at least they'll be wearable for the time being.\n\nGet a calendar, circle your 18th birthday and use this sub and other resources to plan your escape.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Buy black dye and salvage some of your clothes by dying them black. Rit dye works well. Also get Rit for synthetic fibers. Wash everything first to clear the bleach, then dye. You&amp;#39;ll be rocking neo-goth threads for a minute, but at least they&amp;#39;ll be wearable for the time being.&lt;/p&gt;\n\n&lt;p&gt;Get a calendar, circle your 18th birthday and use this sub and other resources to plan your escape.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdb9ke", "score_hidden": false, "stickied": false, "created": 1492450498.0, "created_utc": 1492421698.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdn9h7", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Raveynfyre", "parent_id": "t1_dgd18gb", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;This is completely not ok, and clearly an unsafe environment for any minor to be in.\n\nIt's not just unsafe for /u/throwaway81456b, if the fumes from the bleach are strong enough, it can cause permanent breathing problems and/ or lung damage.\n\nShe literally made the room a toxic environment and that is absolutely abuse that CPS will do something about.\n\nOP, you need to save your money for yourself. Giving her money will not magically make everything better and stop her from being like this. It will only slow her down for a little bit, then when she needs money again and you don't give it to her, she will do something like this all over again. Rinse-and-repeat. She is hurting you intentionally.\n\nThink about another similar situation and see if the logic of giving her money to win her affection would work. Lets use school bullies as an example. If you're being bullied at school, and the bully always takes your lunch money, do you think he's going to stop bullying you if you give him the lunch money first? Of course not. He's going to keep doing it to make himself feel better and to look like \"the big man on campus.\"", "edited": 1492444469.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This is completely not ok, and clearly an unsafe environment for any minor to be in.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not just unsafe for &lt;a href=\"/u/throwaway81456b\"&gt;/u/throwaway81456b&lt;/a&gt;, if the fumes from the bleach are strong enough, it can cause permanent breathing problems and/ or lung damage.&lt;/p&gt;\n\n&lt;p&gt;She literally made the room a toxic environment and that is absolutely abuse that CPS will do something about.&lt;/p&gt;\n\n&lt;p&gt;OP, you need to save your money for yourself. Giving her money will not magically make everything better and stop her from being like this. It will only slow her down for a little bit, then when she needs money again and you don&amp;#39;t give it to her, she will do something like this all over again. Rinse-and-repeat. She is hurting you intentionally.&lt;/p&gt;\n\n&lt;p&gt;Think about another similar situation and see if the logic of giving her money to win her affection would work. Lets use school bullies as an example. If you&amp;#39;re being bullied at school, and the bully always takes your lunch money, do you think he&amp;#39;s going to stop bullying you if you give him the lunch money first? Of course not. He&amp;#39;s going to keep doing it to make himself feel better and to look like &amp;quot;the big man on campus.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdn9h7", "score_hidden": false, "stickied": false, "created": 1492472698.0, "created_utc": 1492443898.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd18gb", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "Rhyzobius", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm so sorry you have to deal with that kind of BS. This is completely not ok, and clearly an unsafe environment for any minor to be in.\n\nI would recommend that you take thorough documentation of the damage and what she did. In my experience, even tho your (unhelpful) grandparents witnessed this fit they may capitulate and enable excuses and future rationalization. It's amazing how people can excuse themselves or others behavior. If you don't have any family you can stay with, or friends you can crash on the couch of, you may have to do what to can to mitigate your mom's rage and tread water until to turn 18.\n\nI would definitely say don't give in to her tantrum and do your best to save your money for the time being, it somewhat reinforces that she can intimidate/control you when you resist her demands, but that's very much up to whether it affects your personal safety. If she is willing to soak your room in toxic chemicals and destroy your stuff, I can't say how personally violent she might be and that's up to you to decide. But a room so drenched in bleach that your entire wardrobe is ruined and you can't stand to breathe inside it is abusive and dangerous.\n\nLook into where you can go after you're 18 now, try to keep enough money out of your mom's hands to cover the move-in costs and fees and protect what stuff you can while you can. It's all about sacking away a safety net she can't tear away, she's so focused on draining your funds now because she knows you're almost out of her control and she wants it for herself/wants to sabotage it. Good luck and stay safe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you have to deal with that kind of BS. This is completely not ok, and clearly an unsafe environment for any minor to be in.&lt;/p&gt;\n\n&lt;p&gt;I would recommend that you take thorough documentation of the damage and what she did. In my experience, even tho your (unhelpful) grandparents witnessed this fit they may capitulate and enable excuses and future rationalization. It&amp;#39;s amazing how people can excuse themselves or others behavior. If you don&amp;#39;t have any family you can stay with, or friends you can crash on the couch of, you may have to do what to can to mitigate your mom&amp;#39;s rage and tread water until to turn 18.&lt;/p&gt;\n\n&lt;p&gt;I would definitely say don&amp;#39;t give in to her tantrum and do your best to save your money for the time being, it somewhat reinforces that she can intimidate/control you when you resist her demands, but that&amp;#39;s very much up to whether it affects your personal safety. If she is willing to soak your room in toxic chemicals and destroy your stuff, I can&amp;#39;t say how personally violent she might be and that&amp;#39;s up to you to decide. But a room so drenched in bleach that your entire wardrobe is ruined and you can&amp;#39;t stand to breathe inside it is abusive and dangerous.&lt;/p&gt;\n\n&lt;p&gt;Look into where you can go after you&amp;#39;re 18 now, try to keep enough money out of your mom&amp;#39;s hands to cover the move-in costs and fees and protect what stuff you can while you can. It&amp;#39;s all about sacking away a safety net she can&amp;#39;t tear away, she&amp;#39;s so focused on draining your funds now because she knows you&amp;#39;re almost out of her control and she wants it for herself/wants to sabotage it. Good luck and stay safe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd18gb", "score_hidden": false, "stickied": false, "created": 1492427921.0, "created_utc": 1492399121.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd6pno", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "jaded_as_a_gem", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'd call CPS NOW while the evidence is still all there. what she did isnt okay....\n\nif you cant do that for some reason, then idk honestly. get proof of the damages, pictures, try and record her doing it next time. try and get your grandparents to give a fuck. i dont know what else to do beyond that, or to make your N calm down. im so sorry you have to deal with this :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d call CPS NOW while the evidence is still all there. what she did isnt okay....&lt;/p&gt;\n\n&lt;p&gt;if you cant do that for some reason, then idk honestly. get proof of the damages, pictures, try and record her doing it next time. try and get your grandparents to give a fuck. i dont know what else to do beyond that, or to make your N calm down. im so sorry you have to deal with this :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd6pno", "score_hidden": false, "stickied": false, "created": 1492437624.0, "created_utc": 1492408824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd6taw", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "thinkofusername6969", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I am so sorry about this. Pulling your weight? What in the fuck?? Your bitch mom isn't pulling her own weight and relying on her child to do shit she should be doing. My advice- do whatever you can to get THE FUCK OUT- I alway would go on service trips through my high school or did stuff like work as a camp counselor at a stay away camp to get the fuck away from my family- you do not deserve that treatment at all", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry about this. Pulling your weight? What in the fuck?? Your bitch mom isn&amp;#39;t pulling her own weight and relying on her child to do shit she should be doing. My advice- do whatever you can to get THE FUCK OUT- I alway would go on service trips through my high school or did stuff like work as a camp counselor at a stay away camp to get the fuck away from my family- you do not deserve that treatment at all&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd6taw", "score_hidden": false, "stickied": false, "created": 1492437842.0, "created_utc": 1492409042.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdjecx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "HerAirness", "parent_id": "t1_dgdbi6p", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is such great advice.  Congratulations Clenched-Jaw, this is amazing!  It sucks that most RBNers ultimately end up having to be the ones to take dramatic steps that they don't want to take, in order to be finally freed.  But that's usually it, we have to be the ones to rip off the figurative band-aid, because we can never expect the N to be the one to take control of their behavior &amp; act like a goddamned adult.  So yes, we're left to have to do the shitty, hard thing, usually years before our maturity would normally dictate.  \n\nThis whole post made me so angry, I just hope OP makes it out okay.  and SOON.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is such great advice.  Congratulations Clenched-Jaw, this is amazing!  It sucks that most RBNers ultimately end up having to be the ones to take dramatic steps that they don&amp;#39;t want to take, in order to be finally freed.  But that&amp;#39;s usually it, we have to be the ones to rip off the figurative band-aid, because we can never expect the N to be the one to take control of their behavior &amp;amp; act like a goddamned adult.  So yes, we&amp;#39;re left to have to do the shitty, hard thing, usually years before our maturity would normally dictate.  &lt;/p&gt;\n\n&lt;p&gt;This whole post made me so angry, I just hope OP makes it out okay.  and SOON.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdjecx", "score_hidden": false, "stickied": false, "created": 1492467929.0, "created_utc": 1492439129.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbi6p", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Clenched-Jaw", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Your story really reminded me of myself and my situation, so I'd like to share my thoughts and my actions and maybe it will help you. \n\nWhen I was in high school, my mom would do the exact same thing to me. I remember when She took every pair of clothing I had, including my underwear, bagged it all up and held it hostage for 8 WEEKS! I had nothing except the clothes on my back. And you wanna know what started the whole thing? I tried to wake her up when she fell asleep on the couch so that she could move to her bed and be able to get up on time for work the next day. Yup. That was it. Her twisted explanation for it was that I was trying to be the adult and tell her what to do. \n\nAfter the 100th time of her screaming at me, beating me, and then destroying my things, I left. I left and never went back. I moved out of my mom's house when I was 16 and stayed at 8 different friend's houses for my entire junior year until I finally moved 3 hours away with my aunt and uncle for my senior year. It was one of the hardest things I ever experienced. I completely started over. I lived in a whole new place and went to a completely new high school. But I soon made all new friends and got a job, and got along great with my aunt and uncle (who are not blood related, I just consider them my family). It was the best thing that ever happened. Sure it was really hard at the time. I thought I couldn't leave. Thought it would get better. I thought she would miss me and try to fix it, she never did. Well she missed her punching bag and the attention I was able to provide, but not actually me. \n\nPlease. PLEASE talk to some friends, try to ask for help. LEAVE! I did so horrible in school while I lived with my mom, I actually thought I was just stupid. Then when I moved, and the constant fear and anxiety of when the next rampage was going to happen was gone, I made all A's my senior year and was able to get into a great university. \n\nYou can have a normal life, but you have to know this: Your mom will most likely not be in that life. If you can find a way to make it work with her in it, please share it here! I feel like we're all looking for that \"magic cure\" (hah), but the only real solution is removing yourself. Please talk to some friends, trust me I know it's SO hard to explain to people that your mother is like this (normal people just don't get it sometimes) but you don't have to go into full details. Maybe just provide the details you feel comfortable sharing, but please talk to someone to get the heck out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your story really reminded me of myself and my situation, so I&amp;#39;d like to share my thoughts and my actions and maybe it will help you. &lt;/p&gt;\n\n&lt;p&gt;When I was in high school, my mom would do the exact same thing to me. I remember when She took every pair of clothing I had, including my underwear, bagged it all up and held it hostage for 8 WEEKS! I had nothing except the clothes on my back. And you wanna know what started the whole thing? I tried to wake her up when she fell asleep on the couch so that she could move to her bed and be able to get up on time for work the next day. Yup. That was it. Her twisted explanation for it was that I was trying to be the adult and tell her what to do. &lt;/p&gt;\n\n&lt;p&gt;After the 100th time of her screaming at me, beating me, and then destroying my things, I left. I left and never went back. I moved out of my mom&amp;#39;s house when I was 16 and stayed at 8 different friend&amp;#39;s houses for my entire junior year until I finally moved 3 hours away with my aunt and uncle for my senior year. It was one of the hardest things I ever experienced. I completely started over. I lived in a whole new place and went to a completely new high school. But I soon made all new friends and got a job, and got along great with my aunt and uncle (who are not blood related, I just consider them my family). It was the best thing that ever happened. Sure it was really hard at the time. I thought I couldn&amp;#39;t leave. Thought it would get better. I thought she would miss me and try to fix it, she never did. Well she missed her punching bag and the attention I was able to provide, but not actually me. &lt;/p&gt;\n\n&lt;p&gt;Please. PLEASE talk to some friends, try to ask for help. LEAVE! I did so horrible in school while I lived with my mom, I actually thought I was just stupid. Then when I moved, and the constant fear and anxiety of when the next rampage was going to happen was gone, I made all A&amp;#39;s my senior year and was able to get into a great university. &lt;/p&gt;\n\n&lt;p&gt;You can have a normal life, but you have to know this: Your mom will most likely not be in that life. If you can find a way to make it work with her in it, please share it here! I feel like we&amp;#39;re all looking for that &amp;quot;magic cure&amp;quot; (hah), but the only real solution is removing yourself. Please talk to some friends, trust me I know it&amp;#39;s SO hard to explain to people that your mother is like this (normal people just don&amp;#39;t get it sometimes) but you don&amp;#39;t have to go into full details. Maybe just provide the details you feel comfortable sharing, but please talk to someone to get the heck out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdbi6p", "score_hidden": false, "stickied": false, "created": 1492451327.0, "created_utc": 1492422527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd7vwu", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "messedupbeyondbelief", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "O.M.G.\n\nYour mother is a horrible BITCH. What kind of parent deliberately inflicts that toxic, destructive shit on a teenager? An NParent, of course.\n\nDon't give your NMom money. She isn't entitled to it. You don't mention your dad so I assume he is not in the picture or enables your NMom. I am disappointed that your grandparents did not support you more, granddad sounds like an enabler but at least grandma tried to do something.\n\nPlease get yourself away from that horrible mother of yours. She is toxic and doesn't deserve you. Is there a close friend or other relative you can stay with? You don't deserve that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;O.M.G.&lt;/p&gt;\n\n&lt;p&gt;Your mother is a horrible BITCH. What kind of parent deliberately inflicts that toxic, destructive shit on a teenager? An NParent, of course.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t give your NMom money. She isn&amp;#39;t entitled to it. You don&amp;#39;t mention your dad so I assume he is not in the picture or enables your NMom. I am disappointed that your grandparents did not support you more, granddad sounds like an enabler but at least grandma tried to do something.&lt;/p&gt;\n\n&lt;p&gt;Please get yourself away from that horrible mother of yours. She is toxic and doesn&amp;#39;t deserve you. Is there a close friend or other relative you can stay with? You don&amp;#39;t deserve that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd7vwu", "score_hidden": false, "stickied": false, "created": 1492440266.0, "created_utc": 1492411466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd65dc", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Alan_Smithee_", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I don't think you have anything to 'make right;' this is all on her.\n\nYou're also right to be angry at your grandparents, who really should have had your back. It's good they witnessed it, though. \n\nAny possibility of moving in with them?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you have anything to &amp;#39;make right;&amp;#39; this is all on her.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re also right to be angry at your grandparents, who really should have had your back. It&amp;#39;s good they witnessed it, though. &lt;/p&gt;\n\n&lt;p&gt;Any possibility of moving in with them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd65dc", "score_hidden": false, "stickied": false, "created": 1492436443.0, "created_utc": 1492407643.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgd5asd", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Darkchylde02", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I know this isn't the type of thing that should be condoned, but if you have a friend or somewhere safe you can stay, since you are 17 and almost 18, you more than likely won't be gone after by authorities of any sort. You are just too close to the legal age and as long as you aren't considered an endangered runaway, they will just let you age out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know this isn&amp;#39;t the type of thing that should be condoned, but if you have a friend or somewhere safe you can stay, since you are 17 and almost 18, you more than likely won&amp;#39;t be gone after by authorities of any sort. You are just too close to the legal age and as long as you aren&amp;#39;t considered an endangered runaway, they will just let you age out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgd5asd", "score_hidden": false, "stickied": false, "created": 1492434713.0, "created_utc": 1492405913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgddo6f", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Cupofteaanyone", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Talk to someone at school. Tell them what happened. Wear your bleach stained clothes out and tell people what happened and why they are bleached. Ask you gparents to take you in for a few months and move on. Your mother will drag you down with her if she can. \n\nJust remember that you should not feel ashamed about this situation because it isn't your fault. and you should not feel shame asking for help. Get all the help you can now and pay it back when you can. Your mom is toxic and doesn't deserve you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to someone at school. Tell them what happened. Wear your bleach stained clothes out and tell people what happened and why they are bleached. Ask you gparents to take you in for a few months and move on. Your mother will drag you down with her if she can. &lt;/p&gt;\n\n&lt;p&gt;Just remember that you should not feel ashamed about this situation because it isn&amp;#39;t your fault. and you should not feel shame asking for help. Get all the help you can now and pay it back when you can. Your mom is toxic and doesn&amp;#39;t deserve you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgddo6f", "score_hidden": false, "stickied": false, "created": 1492457819.0, "created_utc": 1492429019.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdglh6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Jkid", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is straight up criminal/property damage. Your Nmom needs to be in jail.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is straight up criminal/property damage. Your Nmom needs to be in jail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdglh6", "score_hidden": false, "stickied": false, "created": 1492463731.0, "created_utc": 1492434931.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdo0hm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ChloeKittyMtF", "parent_id": "t1_dgdmsp8", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "This is the only reason I still own jeans after an issue with bleach late last year. Lol ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the only reason I still own jeans after an issue with bleach late last year. Lol &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdo0hm", "score_hidden": false, "stickied": false, "created": 1492473557.0, "created_utc": 1492444757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmsp8", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Savvygirl011", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "BTW if it is on jeans, splatter or soak them in more bleach and distress. It'll look cute and save you cash on buying new ones.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;BTW if it is on jeans, splatter or soak them in more bleach and distress. It&amp;#39;ll look cute and save you cash on buying new ones.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdmsp8", "score_hidden": false, "stickied": false, "created": 1492472162.0, "created_utc": 1492443362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdn1sc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "baguette-baker2430", "parent_id": "t1_dgcy3qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Why would they let her? They sound like enablers to me. If I was treating my son this way, at 30 years old, my dad would tear me a new one. My Nmom would take it as an opportunity to swoop in and be the hero...but whatever. They are not her allies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would they let her? They sound like enablers to me. If I was treating my son this way, at 30 years old, my dad would tear me a new one. My Nmom would take it as an opportunity to swoop in and be the hero...but whatever. They are not her allies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdn1sc", "score_hidden": false, "stickied": false, "created": 1492472455.0, "created_utc": 1492443655.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdqsac", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cupfullabeetlejuice", "parent_id": "t1_dgcy3qw", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "She said they said wouldn't let her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She said they said wouldn&amp;#39;t let her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdqsac", "score_hidden": false, "stickied": false, "created": 1492476660.0, "created_utc": 1492447860.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcy3qw", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Caribbean_Queen_1985", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Can you live with your grandparents?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you live with your grandparents?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgcy3qw", "score_hidden": false, "stickied": false, "created": 1492423513.0, "created_utc": 1492394713.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdfnih", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "poundsoffat", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt;How do I make this rIght with her? Do I juat say sorry and give her my momey? \n\nI'm real sorry for your shitty situation but look here and understand this. You mum is a Narcissist. This means they will not change, they never will because it's their nature not to. They will continue abusing you and using you for whatever you have for the rest of your life if you choose to keep in contact and stay with them. Realise they'll keep pulling this bullshit and it'll never stop.\nYou do not make right with her because she is not right, it's like sympathising and trying to get on the good side of a cold blooded killer. You don't say sorry and give her money because then you're just obeying her commands and letting her control you with money. You say you don't want it happening again but it will. It's always going to happen and with this knowledge you plan your future try and move out asap and go No Contact and cut her off. Ignore anything and everything she tries. The fuck you to people like this is living successfully. You can do it without your disgusting pile of trash of a mum.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How do I make this rIght with her? Do I juat say sorry and give her my momey? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m real sorry for your shitty situation but look here and understand this. You mum is a Narcissist. This means they will not change, they never will because it&amp;#39;s their nature not to. They will continue abusing you and using you for whatever you have for the rest of your life if you choose to keep in contact and stay with them. Realise they&amp;#39;ll keep pulling this bullshit and it&amp;#39;ll never stop.\nYou do not make right with her because she is not right, it&amp;#39;s like sympathising and trying to get on the good side of a cold blooded killer. You don&amp;#39;t say sorry and give her money because then you&amp;#39;re just obeying her commands and letting her control you with money. You say you don&amp;#39;t want it happening again but it will. It&amp;#39;s always going to happen and with this knowledge you plan your future try and move out asap and go No Contact and cut her off. Ignore anything and everything she tries. The fuck you to people like this is living successfully. You can do it without your disgusting pile of trash of a mum.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdfnih", "score_hidden": false, "stickied": false, "created": 1492462074.0, "created_utc": 1492433274.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdgb26", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "cromez0", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I believe there's nothing to \"make right\" with her. She's the one who should be apologizing for her erratic behavior-and she has to find a better way to manage her money (since you've stated in another post that she drinks and parties with her friends). She needs to get  her own shit together. You're not responsible for making everything okay for her-you're not her parent.\n\nDo you have friends/acquaintances/anybody who would be willing to lend you clothes or help you to drive out to a store to get clothes?\n\nMaybe call a social worker? Not sure how the process goes, but people like your mother usually should be getting assistance from such professional who have experience and education with dealing with adults with problems, not her own child.\n\n\n", "edited": 1492434790.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe there&amp;#39;s nothing to &amp;quot;make right&amp;quot; with her. She&amp;#39;s the one who should be apologizing for her erratic behavior-and she has to find a better way to manage her money (since you&amp;#39;ve stated in another post that she drinks and parties with her friends). She needs to get  her own shit together. You&amp;#39;re not responsible for making everything okay for her-you&amp;#39;re not her parent.&lt;/p&gt;\n\n&lt;p&gt;Do you have friends/acquaintances/anybody who would be willing to lend you clothes or help you to drive out to a store to get clothes?&lt;/p&gt;\n\n&lt;p&gt;Maybe call a social worker? Not sure how the process goes, but people like your mother usually should be getting assistance from such professional who have experience and education with dealing with adults with problems, not her own child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdgb26", "score_hidden": false, "stickied": false, "created": 1492463235.0, "created_utc": 1492434435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdm8zp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Dogzillas_Mom", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Well, now you have a really good reason for not giving her any more money: You'll have to spend any future earnings on replacing your wardrobe. Next time she asks, you can say something like, \"Well, I would have but since you destroyed all my clothes, I need my money to replace them.\" \n\nIncidentally, you can find nice things for cheap at a Plato's Closet if there's in your city. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, now you have a really good reason for not giving her any more money: You&amp;#39;ll have to spend any future earnings on replacing your wardrobe. Next time she asks, you can say something like, &amp;quot;Well, I would have but since you destroyed all my clothes, I need my money to replace them.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Incidentally, you can find nice things for cheap at a Plato&amp;#39;s Closet if there&amp;#39;s in your city. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdm8zp", "score_hidden": false, "stickied": false, "created": 1492471526.0, "created_utc": 1492442726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdsyzd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jovet_Hunter", "parent_id": "t1_dgdmnkp", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Also, OP, keep your new clothes out of the house, in a locker or hidden in your garage until you can wash them.  See if your employers will let you use their laundry machines when sitting.  Get clothing that is wash and machine dry.  If you have anything you treasure, and anywhere you trust, start moving it out of the house now.  If that isn't possible, squirrel it away into boxes in areas that mother rarely goes - attic, basement, etc - that will be easy to grab when leaving at 18.  Remove anything that she can use against you from her reach, then she will have no power over you.\n\nAnd not one more dime.  If she bitches, you have a built in excuse:  \"Sorry, mom.  I have *so* many clothes to replace, and clothes are *so* expensive, and it's not like I could wait for sales since I had to replace *so* many in *such* a short time.  All my extra money is going to that.\"  (Shrug). \"Sorry.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, OP, keep your new clothes out of the house, in a locker or hidden in your garage until you can wash them.  See if your employers will let you use their laundry machines when sitting.  Get clothing that is wash and machine dry.  If you have anything you treasure, and anywhere you trust, start moving it out of the house now.  If that isn&amp;#39;t possible, squirrel it away into boxes in areas that mother rarely goes - attic, basement, etc - that will be easy to grab when leaving at 18.  Remove anything that she can use against you from her reach, then she will have no power over you.&lt;/p&gt;\n\n&lt;p&gt;And not one more dime.  If she bitches, you have a built in excuse:  &amp;quot;Sorry, mom.  I have &lt;em&gt;so&lt;/em&gt; many clothes to replace, and clothes are &lt;em&gt;so&lt;/em&gt; expensive, and it&amp;#39;s not like I could wait for sales since I had to replace &lt;em&gt;so&lt;/em&gt; many in &lt;em&gt;such&lt;/em&gt; a short time.  All my extra money is going to that.&amp;quot;  (Shrug). &amp;quot;Sorry.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdsyzd", "score_hidden": false, "stickied": false, "created": 1492479097.0, "created_utc": 1492450297.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmnkp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Savvygirl011", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Set you aside some cash and say you took a pay cut to help the lady out. Thay way she cannot touch that money. Maybe fifty a month and shop at Charlotte Russe or Rue 21 (they always have clothes for ten or less). Five or six shirts and two pairs of shoes and two pairs of jeans should do you till September. Goodwill shops and yardsales are good as well. Maybe ask friends for their castoffs? Good luck and hope you get out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Set you aside some cash and say you took a pay cut to help the lady out. Thay way she cannot touch that money. Maybe fifty a month and shop at Charlotte Russe or Rue 21 (they always have clothes for ten or less). Five or six shirts and two pairs of shoes and two pairs of jeans should do you till September. Goodwill shops and yardsales are good as well. Maybe ask friends for their castoffs? Good luck and hope you get out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdmnkp", "score_hidden": false, "stickied": false, "created": 1492471998.0, "created_utc": 1492443198.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdobgm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "thro-awey", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Okay so. I'm assuming that the grandparents in this situation are the parents of your mother.\n\nTypically, Narcissistic Personality Behavior originates with the parenting skills of the Narcissist. So when you mentioned that you were upset at your Grandparents for not stopping Nmom, there's a *reason* why. They never learned how to tell her no, they put her on a pedestal, they just let her run everyone's life. So in essence, you have a right to be upset at your Grandparents. NPD does not spring in whenever it wants, it's a personality disorder originating with a specific direction of bad parenting.\n\nAlso, when a Narcissist's \"cover\" is \"blown,\" they always go into a self-destructive state. When their lies have been exposed and they have nowhere to turn, they often tend to do destructive things, like destroying your makeup or throwing bleach on clothes. It might seem like in order to end all this suffering and destruction, you will have to give her your money. Spoiler: [Don't.](/sp \"Don't.\")\n\nWhat you need to start looking into is how to set boundaries. Ask yourself questions, like \"Do her personal choices really warrant her the right to take my money?\" \"Why do I give her access to my room?\" \"If I want to finally go independent, what steps do I need to take in order to differentiate myself from her?\" and then set your boundaries accordingly. \n\nIt can range anywhere from \"I know you are in need of money, but I really cannot afford to give money this time\" all the way to a solid, resounding, firm **NO.** The choice is yours.\n\nIn the long run, I strongly recommend going No Contact. This is a completely different animal, but don't expect Narcissists to change anytime soon. They believe there is nothing wrong with themselves, so they are not inclined to change or get help. NC is inevitable if you want to finally break free of this madness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay so. I&amp;#39;m assuming that the grandparents in this situation are the parents of your mother.&lt;/p&gt;\n\n&lt;p&gt;Typically, Narcissistic Personality Behavior originates with the parenting skills of the Narcissist. So when you mentioned that you were upset at your Grandparents for not stopping Nmom, there&amp;#39;s a &lt;em&gt;reason&lt;/em&gt; why. They never learned how to tell her no, they put her on a pedestal, they just let her run everyone&amp;#39;s life. So in essence, you have a right to be upset at your Grandparents. NPD does not spring in whenever it wants, it&amp;#39;s a personality disorder originating with a specific direction of bad parenting.&lt;/p&gt;\n\n&lt;p&gt;Also, when a Narcissist&amp;#39;s &amp;quot;cover&amp;quot; is &amp;quot;blown,&amp;quot; they always go into a self-destructive state. When their lies have been exposed and they have nowhere to turn, they often tend to do destructive things, like destroying your makeup or throwing bleach on clothes. It might seem like in order to end all this suffering and destruction, you will have to give her your money. Spoiler: &lt;a href=\"/sp\" title=\"Don&amp;#39;t.\"&gt;Don&amp;#39;t.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What you need to start looking into is how to set boundaries. Ask yourself questions, like &amp;quot;Do her personal choices really warrant her the right to take my money?&amp;quot; &amp;quot;Why do I give her access to my room?&amp;quot; &amp;quot;If I want to finally go independent, what steps do I need to take in order to differentiate myself from her?&amp;quot; and then set your boundaries accordingly. &lt;/p&gt;\n\n&lt;p&gt;It can range anywhere from &amp;quot;I know you are in need of money, but I really cannot afford to give money this time&amp;quot; all the way to a solid, resounding, firm &lt;strong&gt;NO.&lt;/strong&gt; The choice is yours.&lt;/p&gt;\n\n&lt;p&gt;In the long run, I strongly recommend going No Contact. This is a completely different animal, but don&amp;#39;t expect Narcissists to change anytime soon. They believe there is nothing wrong with themselves, so they are not inclined to change or get help. NC is inevitable if you want to finally break free of this madness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdobgm", "score_hidden": false, "stickied": false, "created": 1492473906.0, "created_utc": 1492445106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdkkbd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Svit_kona", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "The problem is that this isn't going to stop. She is blatantly abusing you. As the child, you shouldn't have to pay for the bills or for her car payment or anything that parents normally provide for children. That isn't your job. And you don't owe your mom anything. She's going to try to pull that crap wherever she can and with whomever she can. You're job right now is to get out. If she is getting that violent, it will turn to you eventually.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is that this isn&amp;#39;t going to stop. She is blatantly abusing you. As the child, you shouldn&amp;#39;t have to pay for the bills or for her car payment or anything that parents normally provide for children. That isn&amp;#39;t your job. And you don&amp;#39;t owe your mom anything. She&amp;#39;s going to try to pull that crap wherever she can and with whomever she can. You&amp;#39;re job right now is to get out. If she is getting that violent, it will turn to you eventually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdkkbd", "score_hidden": false, "stickied": false, "created": 1492469461.0, "created_utc": 1492440661.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdelq2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "wordtoyourmother8", "parent_id": "t1_dgdedbi", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Comment removed. If you have concerns about a user, report the content and send modmail, do not make comments like this, this is a support group.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Comment removed. If you have concerns about a user, report the content and send modmail, do not make comments like this, this is a support group.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdelq2", "score_hidden": false, "stickied": false, "created": 1492459995.0, "created_utc": 1492431195.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdedbi", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdedbi", "score_hidden": false, "stickied": false, "created": 1492459482.0, "created_utc": 1492430682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdrrxi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tauresa", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "You mum seems to have borderline personality disorder, these people cannot be told \"no\" because they go crazy. I am so sorry. Try and get out of her house as soon as possible.\nBy the way YOU should have called the police on your mum as she is abusing you.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You mum seems to have borderline personality disorder, these people cannot be told &amp;quot;no&amp;quot; because they go crazy. I am so sorry. Try and get out of her house as soon as possible.\nBy the way YOU should have called the police on your mum as she is abusing you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdrrxi", "score_hidden": false, "stickied": false, "created": 1492477765.0, "created_utc": 1492448965.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgdv3cm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sahmeiraa", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Oh hun, I've been there. I used to come home from college and find my clothes (generally my underwear) shredded and laying in the top of the kitchen trash bin. If I confronted her, she would tell me it was because I was a huge slut/whore/prostitute (despite never having sex, and wearing a purity ring for a reason). When I turned 18, I fled to my grandma's house.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh hun, I&amp;#39;ve been there. I used to come home from college and find my clothes (generally my underwear) shredded and laying in the top of the kitchen trash bin. If I confronted her, she would tell me it was because I was a huge slut/whore/prostitute (despite never having sex, and wearing a purity ring for a reason). When I turned 18, I fled to my grandma&amp;#39;s house.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdv3cm", "score_hidden": false, "stickied": false, "created": 1492481429.0, "created_utc": 1492452629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dge3oug", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tekhead001", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I suggest you talk to your grandparents. They saw the whole thing. Ask them if it is okay if you come to live with them for a while. If your grandparents agree, then I recommend speaking to a lawyer. Many public libraries will have one or two days a month in which lawyers will offer their services pro bono. Usually just informal consultations. Ask a lawyer about a restraining order against your mother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suggest you talk to your grandparents. They saw the whole thing. Ask them if it is okay if you come to live with them for a while. If your grandparents agree, then I recommend speaking to a lawyer. Many public libraries will have one or two days a month in which lawyers will offer their services pro bono. Usually just informal consultations. Ask a lawyer about a restraining order against your mother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge3oug", "score_hidden": false, "stickied": false, "created": 1492491109.0, "created_utc": 1492462309.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dge6kx6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Moondrala", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "As others have said, get out of there ASAP!  If I were you I'd either call CPS and tell them everything that she's done and for them to talk your Gparents too, or buy a little car and stay in itfor awhile.  As soon as you can live on your own, please don't let her manipulate/lure you in.  She doesn't deserve your respect if she doesn't give you any. Hang in there :(\n\nEdit:  I also wanted to add, you can get lots of good clothes for really cheap at thrift stores and Good Wills.  I shop there for clothes all the time and can get about 20+ items for $40-50 in CA, so it'd be great way for you to replenish your wardrobe.  So check those out if any are in your area!", "edited": 1492466554.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As others have said, get out of there ASAP!  If I were you I&amp;#39;d either call CPS and tell them everything that she&amp;#39;s done and for them to talk your Gparents too, or buy a little car and stay in itfor awhile.  As soon as you can live on your own, please don&amp;#39;t let her manipulate/lure you in.  She doesn&amp;#39;t deserve your respect if she doesn&amp;#39;t give you any. Hang in there :(&lt;/p&gt;\n\n&lt;p&gt;Edit:  I also wanted to add, you can get lots of good clothes for really cheap at thrift stores and Good Wills.  I shop there for clothes all the time and can get about 20+ items for $40-50 in CA, so it&amp;#39;d be great way for you to replenish your wardrobe.  So check those out if any are in your area!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge6kx6", "score_hidden": false, "stickied": false, "created": 1492494565.0, "created_utc": 1492465765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgea9w4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pwn493", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "My Nstepdad used to accuse me of not pulling my weight when I was 10. I hate it when Nrents do that. \n\nI think most of the useful advice has been given here, but I'd also suggest documenting this experience for your own purposes. Your mom won't remember this, but when you're older and she's asking to move in with you, remember this fear and anger you're feeling now, and flip her the bird and tell her she can go fuck herself. Then when she throws her tantrum, lock your doors and call the police. People like her deserve to live alone and miserable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My Nstepdad used to accuse me of not pulling my weight when I was 10. I hate it when Nrents do that. &lt;/p&gt;\n\n&lt;p&gt;I think most of the useful advice has been given here, but I&amp;#39;d also suggest documenting this experience for your own purposes. Your mom won&amp;#39;t remember this, but when you&amp;#39;re older and she&amp;#39;s asking to move in with you, remember this fear and anger you&amp;#39;re feeling now, and flip her the bird and tell her she can go fuck herself. Then when she throws her tantrum, lock your doors and call the police. People like her deserve to live alone and miserable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgea9w4", "score_hidden": false, "stickied": false, "created": 1492499314.0, "created_utc": 1492470514.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65sirc", "likes": null, "replies": "", "user_reports": [], "id": "dgedy5e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ArbitraryIndividual", "parent_id": "t3_65sirc", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I'm so sorry.  This is neglect and abuse and it really really burns me that other family members see it and do nothing.  Can you stay with your grandparents until you graduate and go to college? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry.  This is neglect and abuse and it really really burns me that other family members see it and do nothing.  Can you stay with your grandparents until you graduate and go to college? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgedy5e", "score_hidden": false, "stickied": false, "created": 1492504043.0, "created_utc": 1492475243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]