[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raisedbynarcissists", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My nCousin wasn&amp;#39;t always a narc. We grew up very close, but when her brother (a diagnosed sociopath) was sent to military school (and eventually a rehabilitation program for anger issues) everything completely changed. My aunt felt extreme embarrassment from having a &amp;quot;failure&amp;quot; of a son, so she pampered and doted on my cousin. My nCousin got EVERYTHING! New game cube, new TV for her room, new Nintendo DS, games, movies, designer clothes, makeup (at 10 years old!!), you get the point. My mom, on the other hand made me work for everything I wanted, and I appreciated her instilling a work ethic in me.&lt;/p&gt;\n\n&lt;p&gt;My nCousin began showing signs of narcissism when we were in middle school. It started off by taking any game or movie that she did not own, then she would try to gaslight me and say that I never owned it. My mom would make me &amp;quot;lend it to her&amp;quot; and I would never see it again... Then the stealing turned into physical bullying; she would pull my hair, pinch me, kick me, and punch me in the back of the head. I would cry and tell my mom, but she never believed me. What actually crossed the line was when my nCousin started emotionally harassing me. She would call me fat, a frog, spi*c (my dad is mexican, my mother is puerto rican). My mom would hear her harass me and would reprimand her, but my aunt never saw through my nCousins charade....&lt;/p&gt;\n\n&lt;p&gt;We ended up having limited contact up until I left to go to college. Unfortunately, my nCousin convinced my sweet aunt to be her flying monkey. My aunt would call weekly and ask how I was doing, then asked if I wanted to speak to nCousin. I was too polite to say no every single time. If I wasn&amp;#39;t at a family event, because I only come home for Christmas and summer vacation, she would say &amp;quot;nCousing misses you! Please don&amp;#39;t ignore family, she was the only one who was always there for you!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Last summer, my mom surprised me by flying my aunt and nCousin to stay with us for a few days. Those were the most miserable days of my life. I contemplated flying back to Michigan because I hated being around my nCousin, who HAD to be the center of attention. &lt;/p&gt;\n\n&lt;p&gt;Today, my aunt called and asked me if I could host my nCousin at my apartment the week after finals, because my nCousin had a track conference and didn&amp;#39;t want to pay for a hotel. I told her no, but she put my cousin on the phone before I could hang up. She knew my kryptonite was being a huge pushover whenever people need favors. nCousin expected me to bend over backwards for her, and she even had the audacity to ask if she could sleep in MY bed while I sleep on the sofa. I actually had visions of my sad childhood, and I only said three things to her before hanging up: &amp;quot;Sorry, but no&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I feel so proud of myself, I have never really stood up for myself. I usually just ran away and cried, or would lock myself in my room. I always thought that nobody would care or believe me, because I grew up believing that. Meeting my friends and my boyfriend really improved my self esteem, because they kept pushing me to get me to start saying &amp;quot;no&amp;quot; more often. I think this will mark the start of very low contact with my toxic cousin :) &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My nCousin wasn't always a narc. We grew up very close, but when her brother (a diagnosed sociopath) was sent to military school (and eventually a rehabilitation program for anger issues) everything completely changed. My aunt felt extreme embarrassment from having a \"failure\" of a son, so she pampered and doted on my cousin. My nCousin got EVERYTHING! New game cube, new TV for her room, new Nintendo DS, games, movies, designer clothes, makeup (at 10 years old!!), you get the point. My mom, on the other hand made me work for everything I wanted, and I appreciated her instilling a work ethic in me.\n\nMy nCousin began showing signs of narcissism when we were in middle school. It started off by taking any game or movie that she did not own, then she would try to gaslight me and say that I never owned it. My mom would make me \"lend it to her\" and I would never see it again... Then the stealing turned into physical bullying; she would pull my hair, pinch me, kick me, and punch me in the back of the head. I would cry and tell my mom, but she never believed me. What actually crossed the line was when my nCousin started emotionally harassing me. She would call me fat, a frog, spi*c (my dad is mexican, my mother is puerto rican). My mom would hear her harass me and would reprimand her, but my aunt never saw through my nCousins charade....\n\nWe ended up having limited contact up until I left to go to college. Unfortunately, my nCousin convinced my sweet aunt to be her flying monkey. My aunt would call weekly and ask how I was doing, then asked if I wanted to speak to nCousin. I was too polite to say no every single time. If I wasn't at a family event, because I only come home for Christmas and summer vacation, she would say \"nCousing misses you! Please don't ignore family, she was the only one who was always there for you!\"\n\n Last summer, my mom surprised me by flying my aunt and nCousin to stay with us for a few days. Those were the most miserable days of my life. I contemplated flying back to Michigan because I hated being around my nCousin, who HAD to be the center of attention. \n\nToday, my aunt called and asked me if I could host my nCousin at my apartment the week after finals, because my nCousin had a track conference and didn't want to pay for a hotel. I told her no, but she put my cousin on the phone before I could hang up. She knew my kryptonite was being a huge pushover whenever people need favors. nCousin expected me to bend over backwards for her, and she even had the audacity to ask if she could sleep in MY bed while I sleep on the sofa. I actually had visions of my sad childhood, and I only said three things to her before hanging up: \"Sorry, but no\"\n\nI feel so proud of myself, I have never really stood up for myself. I usually just ran away and cried, or would lock myself in my room. I always thought that nobody would care or believe me, because I grew up believing that. Meeting my friends and my boyfriend really improved my self esteem, because they kept pushing me to get me to start saying \"no\" more often. I think this will mark the start of very low contact with my toxic cousin :) ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65x0if", "gilded": 1, "secure_media_embed": {}, "clicked": false, "score": 180, "report_reasons": null, "author": "tiinymermaid", "saved": false, "mod_reports": [], "name": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "approved_by": null, "over_18": false, "domain": "self.raisedbynarcissists", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2we9n", "edited": 1492450586.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raisedbynarcissists/comments/65x0if/i_said_no_to_my_ncousin_for_the_first_time_in_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492479186.0, "url": "https://www.reddit.com/r/raisedbynarcissists/comments/65x0if/i_said_no_to_my_ncousin_for_the_first_time_in_my/", "author_flair_text": null, "quarantine": false, "title": "I said no to my nCousin for the first time in my life", "created_utc": 1492450386.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 180}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dgduhe9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wdjm", "parent_id": "t1_dgdtylt", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "&gt; It's because n's rarely hear the word \"no\" and if they do, they keep pushing until it turns into a reluctant yes.\n\nTo extend the analogy, this is like them testing the ground at the edge of the pool to see if it's stable. Is that a FIRM limit? If they can pester their way into another 'yes', then the ground wasn't firm at all and it won't save her from drowning.\n\nKeep saying no...but also remember to occasionally 'reward GOOD behavior' if you can. May not work and you may eventually have to give up for your own health and sanity. But change *is* possible...if your nCousin decides she wants to try.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s because n&amp;#39;s rarely hear the word &amp;quot;no&amp;quot; and if they do, they keep pushing until it turns into a reluctant yes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To extend the analogy, this is like them testing the ground at the edge of the pool to see if it&amp;#39;s stable. Is that a FIRM limit? If they can pester their way into another &amp;#39;yes&amp;#39;, then the ground wasn&amp;#39;t firm at all and it won&amp;#39;t save her from drowning.&lt;/p&gt;\n\n&lt;p&gt;Keep saying no...but also remember to occasionally &amp;#39;reward GOOD behavior&amp;#39; if you can. May not work and you may eventually have to give up for your own health and sanity. But change &lt;em&gt;is&lt;/em&gt; possible...if your nCousin decides she wants to try.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgduhe9", "score_hidden": false, "stickied": false, "created": 1492480751.0, "created_utc": 1492451951.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtylt", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "tiinymermaid", "parent_id": "t1_dgdtrjs", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "That was probably the best example of how I feel about my nCousin! Not many people in my life can comprehend why saying no or speaking up for yourself doesn't solve the problem. It's because n's rarely hear the word \"no\" and if they do, they keep pushing until it turns into a reluctant yes. My cousin is still young, we're barely 20 years old, and I hope that she can hopefully change her attitude if my mom and I start saying no to her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was probably the best example of how I feel about my nCousin! Not many people in my life can comprehend why saying no or speaking up for yourself doesn&amp;#39;t solve the problem. It&amp;#39;s because n&amp;#39;s rarely hear the word &amp;quot;no&amp;quot; and if they do, they keep pushing until it turns into a reluctant yes. My cousin is still young, we&amp;#39;re barely 20 years old, and I hope that she can hopefully change her attitude if my mom and I start saying no to her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdtylt", "score_hidden": false, "stickied": false, "created": 1492480185.0, "created_utc": 1492451385.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtrjs", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "wdjm", "parent_id": "t1_dgdta4l", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Don't feel bad. You have just given her exactly what she has been asking for for years - a limit. People - especially children - who push limits constantly are really just looking to find out where the limit IS. Her mother didn't give her any - and that makes a child feel insecure, so they push limits more and more, trying to figure out where they are.\n\nThink of it like swimming in the deep end of a pool vs in the middle of the ocean. You feel pretty safe in the pool because you know where the limit is - you can depend upon the sides of the pool to help you when you tire.  If you're in the middle of the ocean, you have no such security, so you might flail around, swimming further and further, trying to find some kind of security.\n\nWhat you just told your cousin (though I seriously doubt she recognizes it) is that if she gets TOO rude and abusive, you will not allow her to be around you. She can either keep 'swimming' or she can recognize that YOU know where the sides of the pool are and ask you for some direction. I'm afraid most true Ns choose to keep swimming. But at least she now has the option to get better - if she chooses to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t feel bad. You have just given her exactly what she has been asking for for years - a limit. People - especially children - who push limits constantly are really just looking to find out where the limit IS. Her mother didn&amp;#39;t give her any - and that makes a child feel insecure, so they push limits more and more, trying to figure out where they are.&lt;/p&gt;\n\n&lt;p&gt;Think of it like swimming in the deep end of a pool vs in the middle of the ocean. You feel pretty safe in the pool because you know where the limit is - you can depend upon the sides of the pool to help you when you tire.  If you&amp;#39;re in the middle of the ocean, you have no such security, so you might flail around, swimming further and further, trying to find some kind of security.&lt;/p&gt;\n\n&lt;p&gt;What you just told your cousin (though I seriously doubt she recognizes it) is that if she gets TOO rude and abusive, you will not allow her to be around you. She can either keep &amp;#39;swimming&amp;#39; or she can recognize that YOU know where the sides of the pool are and ask you for some direction. I&amp;#39;m afraid most true Ns choose to keep swimming. But at least she now has the option to get better - if she chooses to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdtrjs", "score_hidden": false, "stickied": false, "created": 1492479969.0, "created_utc": 1492451169.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dge09r2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ISeeTheFnords", "parent_id": "t1_dgdta4l", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "In that case, it probably does.  Listen to yourself, and heed.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In that case, it probably does.  Listen to yourself, and heed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge09r2", "score_hidden": false, "stickied": false, "created": 1492487286.0, "created_utc": 1492458486.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dgebndw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xplosm", "parent_id": "t1_dgdta4l", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Expect them (both aunt and nCuz) to fly to your apartment. Try to plan for that case. They will emotionally blackmail you. You need a support circle and tons of support, even if that support comes from your own being.\n\nSorry you have been putting up with their shit.\n\nBest of luck and stay safe!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Expect them (both aunt and nCuz) to fly to your apartment. Try to plan for that case. They will emotionally blackmail you. You need a support circle and tons of support, even if that support comes from your own being.&lt;/p&gt;\n\n&lt;p&gt;Sorry you have been putting up with their shit.&lt;/p&gt;\n\n&lt;p&gt;Best of luck and stay safe!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgebndw", "score_hidden": false, "stickied": false, "created": 1492501101.0, "created_utc": 1492472301.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdta4l", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "tiinymermaid", "parent_id": "t1_dgdt7sp", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "I felt like the biggest turd ever. I would offer the very shirt off my back for a stranger if they asked. I really just cant be around my nCousin any more. I feel like my mental sanity depends on it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I felt like the biggest turd ever. I would offer the very shirt off my back for a stranger if they asked. I really just cant be around my nCousin any more. I feel like my mental sanity depends on it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdta4l", "score_hidden": false, "stickied": false, "created": 1492479438.0, "created_utc": 1492450638.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdt7sp", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "wdjm", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Good job! The first step is always the hardest. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good job! The first step is always the hardest. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdt7sp", "score_hidden": false, "stickied": false, "created": 1492479368.0, "created_utc": 1492450568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dge9tvb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Durbee", "parent_id": "t1_dge8xxa", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yay for the Enforcer!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yay for the Enforcer!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge9tvb", "score_hidden": false, "stickied": false, "created": 1492498732.0, "created_utc": 1492469932.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8xxa", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tiinymermaid", "parent_id": "t1_dge857q", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "My bf who lives with me is calling himself \"The Enforcer\". He says if she happens to show up (i dont know how she knows where my apartment is! no one except my mom has my address) and she wont listen to me, he will just call the cops. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My bf who lives with me is calling himself &amp;quot;The Enforcer&amp;quot;. He says if she happens to show up (i dont know how she knows where my apartment is! no one except my mom has my address) and she wont listen to me, he will just call the cops. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge8xxa", "score_hidden": false, "stickied": false, "created": 1492497567.0, "created_utc": 1492468767.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dge857q", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Durbee", "parent_id": "t1_dge1gsr", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Prepare yourself for her to try to cross your boundaries that week after finals.  Be ok with not answering her calls or opening your door to her knocks.  She may try it.  If you think you may be tempted to give in to her, plan to be away or have a friend stay over.\n\nYou're doing a really great job.  I hope she doesn't get to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Prepare yourself for her to try to cross your boundaries that week after finals.  Be ok with not answering her calls or opening your door to her knocks.  She may try it.  If you think you may be tempted to give in to her, plan to be away or have a friend stay over.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re doing a really great job.  I hope she doesn&amp;#39;t get to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge857q", "score_hidden": false, "stickied": false, "created": 1492496531.0, "created_utc": 1492467731.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dge1gsr", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "tiinymermaid", "parent_id": "t1_dge0i6f", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Not gonna lie, I was really scared. I don't want to \"tear the family apart\" and create any drama, and I'm pretty dang scared the next time my nCousin shows up unannounced she will torment me. If that's the case, I'll probably be enjoying my non-toxic life and will just leave the area :p", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not gonna lie, I was really scared. I don&amp;#39;t want to &amp;quot;tear the family apart&amp;quot; and create any drama, and I&amp;#39;m pretty dang scared the next time my nCousin shows up unannounced she will torment me. If that&amp;#39;s the case, I&amp;#39;ll probably be enjoying my non-toxic life and will just leave the area :p&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge1gsr", "score_hidden": false, "stickied": false, "created": 1492488632.0, "created_utc": 1492459832.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0i6f", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Psychotic_Jester", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Super proud of you for setting that healthy boundary. Coming from a total stranger off the internet that should mean a lot. :P\n\nBut really, I get so sad and frustrated when I read peoples stories about how much the N's in their lives walk all over them. Not AT the posters but just that they haven't yet found their voice to stand up for themselves that I wish everyone had. Reading this post made me feel happy for you. :) Please hold onto that courage and don't let it go!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Super proud of you for setting that healthy boundary. Coming from a total stranger off the internet that should mean a lot. :P&lt;/p&gt;\n\n&lt;p&gt;But really, I get so sad and frustrated when I read peoples stories about how much the N&amp;#39;s in their lives walk all over them. Not AT the posters but just that they haven&amp;#39;t yet found their voice to stand up for themselves that I wish everyone had. Reading this post made me feel happy for you. :) Please hold onto that courage and don&amp;#39;t let it go!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge0i6f", "score_hidden": false, "stickied": false, "created": 1492487547.0, "created_utc": 1492458747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dgdtrtq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nibblers_momma", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "YAAAS! Good for you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;YAAAS! Good for you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdtrtq", "score_hidden": false, "stickied": false, "created": 1492479977.0, "created_utc": 1492451177.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dgdxvid", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "laynecp1105", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Excellent! Well done! You have to take up for yourself and have healthy, consistent boundaries.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent! Well done! You have to take up for yourself and have healthy, consistent boundaries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgdxvid", "score_hidden": false, "stickied": false, "created": 1492484566.0, "created_utc": 1492455766.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dge0scn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Talithathinks", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Good for you!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good for you!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge0scn", "score_hidden": false, "stickied": false, "created": 1492487866.0, "created_utc": 1492459066.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dgeepy6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gothicsoulx", "parent_id": "t1_dge8zr2", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Yep \"familia es familia\" it's their favorite phrase! And they talk so loud. Drama for them it's the norm, bet is because they love soap operas yuck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep &amp;quot;familia es familia&amp;quot; it&amp;#39;s their favorite phrase! And they talk so loud. Drama for them it&amp;#39;s the norm, bet is because they love soap operas yuck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgeepy6", "score_hidden": false, "stickied": false, "created": 1492505001.0, "created_utc": 1492476201.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8zr2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tiinymermaid", "parent_id": "t1_dge7psf", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "It really is!! Especially with family, you let them walk all over you because \"familia es familia\" 🙄 The drama within Puerto Rican families stresses me out soooo much lol, sometimes I wonder how we're all not narcs", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really is!! Especially with family, you let them walk all over you because &amp;quot;familia es familia&amp;quot; 🙄 The drama within Puerto Rican families stresses me out soooo much lol, sometimes I wonder how we&amp;#39;re all not narcs&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge8zr2", "score_hidden": false, "stickied": false, "created": 1492497633.0, "created_utc": 1492468833.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge7psf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Gothicsoulx", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Hey! My parents are also from Puerto Rico (me too actually).  And I think is more normal to us to have trouble saying no. Like is a cultural thing to be a yes person to the family. That's how we are raised, add to that having family with narcissistic tendencies and you know how it goes...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey! My parents are also from Puerto Rico (me too actually).  And I think is more normal to us to have trouble saying no. Like is a cultural thing to be a yes person to the family. That&amp;#39;s how we are raised, add to that having family with narcissistic tendencies and you know how it goes...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge7psf", "score_hidden": false, "stickied": false, "created": 1492495987.0, "created_utc": 1492467187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dge3ilq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jointhedeep", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Good job, well done. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good job, well done. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge3ilq", "score_hidden": false, "stickied": false, "created": 1492490917.0, "created_utc": 1492462117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dgege3g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PattyIce32", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Well done!  Saying no sounds pretty simple but can be hard.  Once you start doing it, it becomes empowering.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well done!  Saying no sounds pretty simple but can be hard.  Once you start doing it, it becomes empowering.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dgege3g", "score_hidden": false, "stickied": false, "created": 1492507071.0, "created_utc": 1492478271.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2we9n", "removal_reason": null, "link_id": "t3_65x0if", "likes": null, "replies": "", "user_reports": [], "id": "dge9co2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "adilthedestroyer", "parent_id": "t3_65x0if", "subreddit_name_prefixed": "r/raisedbynarcissists", "controversiality": 0, "body": "Ask a restraining order, ncousin but she lost family rights ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ask a restraining order, ncousin but she lost family rights &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raisedbynarcissists", "name": "t1_dge9co2", "score_hidden": false, "stickied": false, "created": 1492498105.0, "created_utc": 1492469305.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]