[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Economics", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65a2gj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "jimrosenz", "saved": false, "mod_reports": [], "name": "t3_65a2gj", "subreddit_name_prefixed": "r/Economics", "approved_by": null, "over_18": false, "domain": "brookings.edu", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Economics/comments/65a2gj/how_to_lift_the_us_mobility_rate_from_50_to_68_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492166467.0, "url": "https://www.brookings.edu/blog/social-mobility-memos/2017/04/13/how-to-lift-the-u-s-mobility-rate-from-50-to-68-in-three-simple-steps/amp/", "author_flair_text": null, "quarantine": false, "title": "How to lift the U.S. mobility rate from 50% to 68% in three simple steps", "created_utc": 1492137667.0, "distinguished": null, "media": null, "upvote_ratio": 0.71, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dgau8zl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mylon", "parent_id": "t1_dg8rdxj", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Please stop saying \"middle class\" when you really mean \"median class\".  If someone works for a wage and relies upon that wage, they are working class.  This describes most median class people.\n\nWe should strive for a real middle class, and not settle for a comfortable median class.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please stop saying &amp;quot;middle class&amp;quot; when you really mean &amp;quot;median class&amp;quot;.  If someone works for a wage and relies upon that wage, they are working class.  This describes most median class people.&lt;/p&gt;\n\n&lt;p&gt;We should strive for a real middle class, and not settle for a comfortable median class.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgau8zl", "score_hidden": false, "stickied": false, "created": 1492302702.0, "created_utc": 1492273902.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rdxj", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "tcoop6231", "parent_id": "t3_65a2gj", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Also worth noting that a large number of Americans are immigrants. Their parents were typically quite poor in Mexico, China, etc. Even if they are merely middle class here, their incomes have probably quadrupled relative to their parents living standards. \n\nHow does Chetty account for immigration?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also worth noting that a large number of Americans are immigrants. Their parents were typically quite poor in Mexico, China, etc. Even if they are merely middle class here, their incomes have probably quadrupled relative to their parents living standards. &lt;/p&gt;\n\n&lt;p&gt;How does Chetty account for immigration?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg8rdxj", "score_hidden": false, "stickied": false, "created": 1492173056.0, "created_utc": 1492144256.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dg9fti0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GlebZheglov", "parent_id": "t1_dg99qxh", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Thanks for the heads up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the heads up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg9fti0", "score_hidden": false, "stickied": false, "created": 1492219238.0, "created_utc": 1492190438.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99qxh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrDannyOcean", "parent_id": "t1_dg99n3k", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "FYI, including google links like that gets your comment caught in the spam filter.  I manually approved you, just thought you'd want to know for future reference.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FYI, including google links like that gets your comment caught in the spam filter.  I manually approved you, just thought you&amp;#39;d want to know for future reference.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg99qxh", "score_hidden": false, "stickied": false, "created": 1492212346.0, "created_utc": 1492183546.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dg9f88t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GlebZheglov", "parent_id": "t1_dg9aw42", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Many researchers have begun to avoid the IGE as a statistic of measuring relative mobility because it's a poor indicator of true relative mobility. The IGE measures by percentage the decrease (or possibly increase) in income disparity between different families from the parents income to the children's income when they grow up. Pew sums it up nicely, \"The IGE measures the strength of the relationship between the income of parents and that of\nchildren. It is not, strictly speaking, a measure of economic mobility, but it is often used as such because it refers to the persistence in economic standing across generations. If one compares, for example, children from families making $50,000 per year with those from families making 20 percent more ($60,000 per year), the IGE tells us how much of that 20 percent difference is preserved when the children become adults with incomes of their own.\" You can see, then, how rising inequality is already baked into the IGE. Because there isn't perfect relative mobility rates, the rich still tend to stay mostly rich while the poor still tend to stay mostly poor. The rising inequality makes the intergenerational comparisons of the gap worse than in countries with much less inequality. Because the great gatsby curve uses the IGE, it would be obvious that countries with rising income inequalities would have poorer IGE results. Researchers have begun to shift to statistics that measure relative mobility rates at much purer levels. Chetty and many other economists now use the Spearman rank correlation (Korak mainly uses IGC in his paper but includes Spearman results). Spearman is similar to the IGE in the sense that it measures the persistence of a gap between the richest and poorest kids in adulthood. But instead of using income, it uses ranks. For example (I'm using simple numbers), if a child is in the 0th percentile of the nation for income, and another child is on the 100th percentile, and then in adulthood the poor child is in the 40th while the rich child in the 60th, Spearman rank correlation would output a number of 20. The gap between the rich child and the poor child (initially at 100) has fallen to 20. Here, rising income inequality is not already baked into this statistic. When measuring relative mobility rates with better statistics such as Spearman, there really is no correlation between income inequality and relative mobility rates. \n\nYour point regarding absolute mobility rates, upon further clarification, is obvious. If real income doesn't grow for the median and we measure absolute mobility with real income for the median, then we should find that absolute mobility rates are constant and 0 for that median. Chetty's argument is not that the way we increase or decrease absolute mobility rates for the median is with wage growth (I think everyone on this planet would agree with that), it's that a better distribution of income would increase absolute mobility rates more than pursuing only higher aggregate wage growth (you still obviously need some wage growth). I disagree with some of the underlying assumptions he makes which leads me to disagree with him that his paper demonstrates that higher income inequality leads to a reduction in absolute mobility rates. While I disagree with him, it doesn't change the fact that he believes that increasing income inequality leads to lower absolute mobility rates.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many researchers have begun to avoid the IGE as a statistic of measuring relative mobility because it&amp;#39;s a poor indicator of true relative mobility. The IGE measures by percentage the decrease (or possibly increase) in income disparity between different families from the parents income to the children&amp;#39;s income when they grow up. Pew sums it up nicely, &amp;quot;The IGE measures the strength of the relationship between the income of parents and that of\nchildren. It is not, strictly speaking, a measure of economic mobility, but it is often used as such because it refers to the persistence in economic standing across generations. If one compares, for example, children from families making $50,000 per year with those from families making 20 percent more ($60,000 per year), the IGE tells us how much of that 20 percent difference is preserved when the children become adults with incomes of their own.&amp;quot; You can see, then, how rising inequality is already baked into the IGE. Because there isn&amp;#39;t perfect relative mobility rates, the rich still tend to stay mostly rich while the poor still tend to stay mostly poor. The rising inequality makes the intergenerational comparisons of the gap worse than in countries with much less inequality. Because the great gatsby curve uses the IGE, it would be obvious that countries with rising income inequalities would have poorer IGE results. Researchers have begun to shift to statistics that measure relative mobility rates at much purer levels. Chetty and many other economists now use the Spearman rank correlation (Korak mainly uses IGC in his paper but includes Spearman results). Spearman is similar to the IGE in the sense that it measures the persistence of a gap between the richest and poorest kids in adulthood. But instead of using income, it uses ranks. For example (I&amp;#39;m using simple numbers), if a child is in the 0th percentile of the nation for income, and another child is on the 100th percentile, and then in adulthood the poor child is in the 40th while the rich child in the 60th, Spearman rank correlation would output a number of 20. The gap between the rich child and the poor child (initially at 100) has fallen to 20. Here, rising income inequality is not already baked into this statistic. When measuring relative mobility rates with better statistics such as Spearman, there really is no correlation between income inequality and relative mobility rates. &lt;/p&gt;\n\n&lt;p&gt;Your point regarding absolute mobility rates, upon further clarification, is obvious. If real income doesn&amp;#39;t grow for the median and we measure absolute mobility with real income for the median, then we should find that absolute mobility rates are constant and 0 for that median. Chetty&amp;#39;s argument is not that the way we increase or decrease absolute mobility rates for the median is with wage growth (I think everyone on this planet would agree with that), it&amp;#39;s that a better distribution of income would increase absolute mobility rates more than pursuing only higher aggregate wage growth (you still obviously need some wage growth). I disagree with some of the underlying assumptions he makes which leads me to disagree with him that his paper demonstrates that higher income inequality leads to a reduction in absolute mobility rates. While I disagree with him, it doesn&amp;#39;t change the fact that he believes that increasing income inequality leads to lower absolute mobility rates.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg9f88t", "score_hidden": false, "stickied": false, "created": 1492218560.0, "created_utc": 1492189760.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9aw42", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baazaa", "parent_id": "t1_dg99n3k", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "So the great gatsby curve is only a phenomenon if you're looking at intergenerational earnings elasticity? I haven't dug into the literature just assumed all the economists and sociologists who mentioned this were accurate. Interesting...\n\nChetty's point is mostly about the share of income being captured by the very top, thus lowering median wage growth. His counterfactual is just 'imagine if that money was shared equally'. What I'm thinking of is whether inequality would have any impact on absolute mobility assuming the median wage is constant (this almost describes the US over the last couple of decades). I don't see how it would have much impact, whereas relative mobility could at least theoretically be reduced due to poverty traps or types of segregation or whatever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So the great gatsby curve is only a phenomenon if you&amp;#39;re looking at intergenerational earnings elasticity? I haven&amp;#39;t dug into the literature just assumed all the economists and sociologists who mentioned this were accurate. Interesting...&lt;/p&gt;\n\n&lt;p&gt;Chetty&amp;#39;s point is mostly about the share of income being captured by the very top, thus lowering median wage growth. His counterfactual is just &amp;#39;imagine if that money was shared equally&amp;#39;. What I&amp;#39;m thinking of is whether inequality would have any impact on absolute mobility assuming the median wage is constant (this almost describes the US over the last couple of decades). I don&amp;#39;t see how it would have much impact, whereas relative mobility could at least theoretically be reduced due to poverty traps or types of segregation or whatever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg9aw42", "score_hidden": false, "stickied": false, "created": 1492213688.0, "created_utc": 1492184888.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99n3k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GlebZheglov", "parent_id": "t1_dg90rc2", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Chetty disagrees with you (although I'm still not convinced that income inequality affects absolute mobility). In his paper he specifically states that relative mobility rates are unaffected by income inequality while absolute mobility rates are. The reason he's come to this conclusion is his own study, https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=http://inequality.stanford.edu/sites/default/files/SOTU_2015_economic-mobility.pdf&amp;ved=0ahUKEwi-oIqNn6TTAhUM3GMKHT58CRkQFggrMAM&amp;usg=AFQjCNF4Jdi6s2RDNxs_BOTsvNxaRQdNng&amp;sig2=nNDfIUM914Oyc9V64az0-w. It shows relative mobility rates as staying constant while income inequality has risen quite a bit. A second point of evidence that defeats your point is relative mobility rates in different countries. Miles Korak did a study on relative mobility rates in Canada, Sweden, and America and found upward relative mobility to be virtually the same. You wouldn't expect this to be true, with Sweden having much lower inequality and America havong much higher. Link to that study: https://web.archive.org/web/20150401075918/http:/www2.sofi.su.se/~mjl/docs/Cross_country_mobility_March_21_2014.pdf", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chetty disagrees with you (although I&amp;#39;m still not convinced that income inequality affects absolute mobility). In his paper he specifically states that relative mobility rates are unaffected by income inequality while absolute mobility rates are. The reason he&amp;#39;s come to this conclusion is his own study, &lt;a href=\"https://www.google.com/url?sa=t&amp;amp;source=web&amp;amp;rct=j&amp;amp;url=http://inequality.stanford.edu/sites/default/files/SOTU_2015_economic-mobility.pdf&amp;amp;ved=0ahUKEwi-oIqNn6TTAhUM3GMKHT58CRkQFggrMAM&amp;amp;usg=AFQjCNF4Jdi6s2RDNxs_BOTsvNxaRQdNng&amp;amp;sig2=nNDfIUM914Oyc9V64az0-w\"&gt;https://www.google.com/url?sa=t&amp;amp;source=web&amp;amp;rct=j&amp;amp;url=http://inequality.stanford.edu/sites/default/files/SOTU_2015_economic-mobility.pdf&amp;amp;ved=0ahUKEwi-oIqNn6TTAhUM3GMKHT58CRkQFggrMAM&amp;amp;usg=AFQjCNF4Jdi6s2RDNxs_BOTsvNxaRQdNng&amp;amp;sig2=nNDfIUM914Oyc9V64az0-w&lt;/a&gt;. It shows relative mobility rates as staying constant while income inequality has risen quite a bit. A second point of evidence that defeats your point is relative mobility rates in different countries. Miles Korak did a study on relative mobility rates in Canada, Sweden, and America and found upward relative mobility to be virtually the same. You wouldn&amp;#39;t expect this to be true, with Sweden having much lower inequality and America havong much higher. Link to that study: &lt;a href=\"https://web.archive.org/web/20150401075918/http:/www2.sofi.su.se/%7Emjl/docs/Cross_country_mobility_March_21_2014.pdf\"&gt;https://web.archive.org/web/20150401075918/http:/www2.sofi.su.se/~mjl/docs/Cross_country_mobility_March_21_2014.pdf&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg99n3k", "score_hidden": false, "stickied": false, "created": 1492212218.0, "created_utc": 1492183418.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dgafyif", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "OliverSparrow", "parent_id": "t1_dg90rc2", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Is that not more or less what I said?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is that not more or less what I said?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgafyif", "score_hidden": false, "stickied": false, "created": 1492272167.0, "created_utc": 1492243367.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90rc2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baazaa", "parent_id": "t1_dg8y1qp", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Absolute income mobility shouldn't be impacted too much by inequality. You're comparing children to their parents, in dollar terms not in terms of rank. It's relative mobility that tends to suffer due to inequality as people find it more difficult to move up or down as income spreads out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolute income mobility shouldn&amp;#39;t be impacted too much by inequality. You&amp;#39;re comparing children to their parents, in dollar terms not in terms of rank. It&amp;#39;s relative mobility that tends to suffer due to inequality as people find it more difficult to move up or down as income spreads out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg90rc2", "score_hidden": false, "stickied": false, "created": 1492197809.0, "created_utc": 1492169009.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y1qp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "OliverSparrow", "parent_id": "t3_65a2gj", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "The figure of 50% does sound like the product of a random walk: shock! Half the population are below the average! But what you are seeing is the outcome of mobility and a double fat tailed distribution. If the extremes of the rich end and the poor end have more, you get less migration in the middle, as somewhat poor get very poor and somewhat rich get richer. Like you rubbed the lamp and a magic Gini appeared. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The figure of 50% does sound like the product of a random walk: shock! Half the population are below the average! But what you are seeing is the outcome of mobility and a double fat tailed distribution. If the extremes of the rich end and the poor end have more, you get less migration in the middle, as somewhat poor get very poor and somewhat rich get richer. Like you rubbed the lamp and a magic Gini appeared. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg8y1qp", "score_hidden": false, "stickied": false, "created": 1492189302.0, "created_utc": 1492160502.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dg95ujv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MasterBerter", "parent_id": "t1_dg8uci1", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "only 5% chance of coincidence", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;only 5% chance of coincidence&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg95ujv", "score_hidden": false, "stickied": false, "created": 1492207318.0, "created_utc": 1492178518.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dg8uctp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xkcd_transcriber", "parent_id": "t1_dg8uci1", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "[Image](https://imgs.xkcd.com/comics/significant.png)\n\n[Mobile](https://m.xkcd.com/882/)\n\n**Title:** Significant\n\n**Title-text:** 'So, uh, we did the green study again and got no link\\. It was probably a\\-\\-' 'RESEARCH CONFLICTED ON GREEN JELLY BEAN\\/ACNE LINK; MORE STUDY RECOMMENDED\\!'\n\n[Comic Explanation](https://www.explainxkcd.com/wiki/index.php/882#Explanation)\n\n**Stats:** This comic has been referenced 592 times, representing 0.3819% of referenced xkcds.\n\n---\n^[xkcd.com](https://www.xkcd.com) ^| ^[xkcd sub](https://www.reddit.com/r/xkcd/) ^| ^[Problems/Bugs?](https://www.reddit.com/r/xkcd_transcriber/) ^| ^[Statistics](http://xkcdref.info/statistics/) ^| ^[Stop Replying](https://reddit.com/message/compose/?to=xkcd_transcriber&amp;subject=ignore%20me&amp;message=ignore%20me) ^| ^[Delete](https://reddit.com/message/compose/?to=xkcd_transcriber&amp;subject=delete&amp;message=delete%20t1_dg8uctp)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://imgs.xkcd.com/comics/significant.png\"&gt;Image&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://m.xkcd.com/882/\"&gt;Mobile&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Title:&lt;/strong&gt; Significant&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Title-text:&lt;/strong&gt; &amp;#39;So, uh, we did the green study again and got no link. It was probably a--&amp;#39; &amp;#39;RESEARCH CONFLICTED ON GREEN JELLY BEAN/ACNE LINK; MORE STUDY RECOMMENDED!&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.explainxkcd.com/wiki/index.php/882#Explanation\"&gt;Comic Explanation&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Stats:&lt;/strong&gt; This comic has been referenced 592 times, representing 0.3819% of referenced xkcds.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.xkcd.com\"&gt;xkcd.com&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/xkcd/\"&gt;xkcd sub&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/xkcd_transcriber/\"&gt;Problems/Bugs?&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"http://xkcdref.info/statistics/\"&gt;Statistics&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://reddit.com/message/compose/?to=xkcd_transcriber&amp;amp;subject=ignore%20me&amp;amp;message=ignore%20me\"&gt;Stop Replying&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://reddit.com/message/compose/?to=xkcd_transcriber&amp;amp;subject=delete&amp;amp;message=delete%20t1_dg8uctp\"&gt;Delete&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg8uctp", "score_hidden": false, "stickied": false, "created": 1492178933.0, "created_utc": 1492150133.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8uci1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "envatted_love", "parent_id": "t1_dg8s7uf", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "[Relevant xkcd](https://xkcd.com/882/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://xkcd.com/882/\"&gt;Relevant xkcd&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg8uci1", "score_hidden": false, "stickied": false, "created": 1492178912.0, "created_utc": 1492150112.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dg8wy0b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Casapaz", "parent_id": "t1_dg8s7uf", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Whaddya know: US has highest standardized mean life expectancy excluding injuries in OECD:\nhttp://www.forbes.com/sites/theapothecary/2011/11/23/the-myth-of-americans-poor-life-expectancy/\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whaddya know: US has highest standardized mean life expectancy excluding injuries in OECD:\n&lt;a href=\"http://www.forbes.com/sites/theapothecary/2011/11/23/the-myth-of-americans-poor-life-expectancy/\"&gt;http://www.forbes.com/sites/theapothecary/2011/11/23/the-myth-of-americans-poor-life-expectancy/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg8wy0b", "score_hidden": false, "stickied": false, "created": 1492185773.0, "created_utc": 1492156973.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8s7uf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Zenitram", "parent_id": "t1_dg8ql0u", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Hack the P yo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hack the P yo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg8s7uf", "score_hidden": false, "stickied": false, "created": 1492174564.0, "created_utc": 1492145764.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dg9n0kp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thewimsey", "parent_id": "t1_dg8ql0u", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "&gt; This sounds like alternative facts.\n\nIt's actually how science works. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This sounds like alternative facts.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s actually how science works. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg9n0kp", "score_hidden": false, "stickied": false, "created": 1492227792.0, "created_utc": 1492198992.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ql0u", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Casapaz", "parent_id": "t3_65a2gj", "subreddit_name_prefixed": "r/Economics", "controversiality": 1, "body": "\"we showed that even small changes in methodology can produce big changes in results.\"\n\nThis sounds like alternative facts. ", "edited": 1492143717.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;we showed that even small changes in methodology can produce big changes in results.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This sounds like alternative facts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg8ql0u", "score_hidden": false, "stickied": false, "created": 1492171714.0, "created_utc": 1492142914.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65a2gj", "likes": null, "replies": "", "user_reports": [], "id": "dgaoobq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thewimsey", "parent_id": "t1_dg9y14n", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "&gt; So they proposed to lift mobility by statistical manipulation. \n\nNo, they suggested that mobility was incorrectly shown to depressed by statistical manipulation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So they proposed to lift mobility by statistical manipulation. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, they suggested that mobility was incorrectly shown to depressed by statistical manipulation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgaoobq", "score_hidden": false, "stickied": false, "created": 1492294572.0, "created_utc": 1492265772.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y14n", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "sethstorm", "parent_id": "t3_65a2gj", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "So they proposed to lift mobility by statistical manipulation.  On the other hand, one could fix the mobility problem by removing the downward pressure of certain labor market distortions such as:  \n\n * Guest worker fraud and abuse, which has negatively impacted IT/CS.\n * Strict enforcement of pre-1965 Immigration Act laws to deal with lower skill work.  \n\nIt wouldn't hurt to also look at geographic mobility as well - making relocation compensation possible for any citizen, not just the well-heeled.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So they proposed to lift mobility by statistical manipulation.  On the other hand, one could fix the mobility problem by removing the downward pressure of certain labor market distortions such as:  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Guest worker fraud and abuse, which has negatively impacted IT/CS.&lt;/li&gt;\n&lt;li&gt;Strict enforcement of pre-1965 Immigration Act laws to deal with lower skill work.&lt;br/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;It wouldn&amp;#39;t hurt to also look at geographic mobility as well - making relocation compensation possible for any citizen, not just the well-heeled.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dg9y14n", "score_hidden": false, "stickied": false, "created": 1492241826.0, "created_utc": 1492213026.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]