[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Economics", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65om3e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "lughnasadh", "saved": false, "mod_reports": [], "name": "t3_65om3e", "subreddit_name_prefixed": "r/Economics", "approved_by": null, "over_18": false, "domain": "theguardian.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Economics/comments/65om3e/old_economics_is_based_on_false_laws_of_physics/", "num_reports": null, "locked": false, "stickied": false, "created": 1492369618.0, "url": "https://www.theguardian.com/global-development-professionals-network/2017/apr/06/kate-raworth-doughnut-economics-new-economics", "author_flair_text": null, "quarantine": false, "title": "Old economics is based on false ‘laws of physics’ – new economics can save us", "created_utc": 1492340818.0, "distinguished": null, "media": null, "upvote_ratio": 0.58, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": "", "user_reports": [], "id": "dgcqaoi", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "mmplx", "parent_id": "t3_65om3e", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "The problem with this \"new economics\" is that it doesn't​ exist as the separate, revolutionary theory some people would like to believe (maybe to avoid the effort of serious study). There are lots of interesting ideas from behavioral economics, from game theory, from information economics, from complex systems theory and abm simulation, etc. which are best seen as extensions or modifications of the classical framework, or at least they are better understood when you start from the classical framework and advance at a respectfully moderate pace. People who think hard about these issues will humbly recognize the intellectual magnificence of the classical framework as well as its limitations. The designers of this framework weren't naive, often they were more aware of their own shortcomings than most of their critics. When I was an economics student, arrogant freshmen and sophomores would argue about every basic perfection tenet as if they have discovered something *new*, something that even nobel laureates glossed over somehow, implying that these prominent intellectual figures were either imbecile or ill-intentioned. They liked to think of themselves as prophets of a new paradigm, as  reincarnations of Copernicus or Galileo. The superficiality of this heterodox, wannabe, critique may be dismaying. I prefer to believe in new Jesus, who could as well save us.           ", "edited": 1492395123.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem with this &amp;quot;new economics&amp;quot; is that it doesn&amp;#39;t​ exist as the separate, revolutionary theory some people would like to believe (maybe to avoid the effort of serious study). There are lots of interesting ideas from behavioral economics, from game theory, from information economics, from complex systems theory and abm simulation, etc. which are best seen as extensions or modifications of the classical framework, or at least they are better understood when you start from the classical framework and advance at a respectfully moderate pace. People who think hard about these issues will humbly recognize the intellectual magnificence of the classical framework as well as its limitations. The designers of this framework weren&amp;#39;t naive, often they were more aware of their own shortcomings than most of their critics. When I was an economics student, arrogant freshmen and sophomores would argue about every basic perfection tenet as if they have discovered something &lt;em&gt;new&lt;/em&gt;, something that even nobel laureates glossed over somehow, implying that these prominent intellectual figures were either imbecile or ill-intentioned. They liked to think of themselves as prophets of a new paradigm, as  reincarnations of Copernicus or Galileo. The superficiality of this heterodox, wannabe, critique may be dismaying. I prefer to believe in new Jesus, who could as well save us.           &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgcqaoi", "score_hidden": false, "stickied": false, "created": 1492413022.0, "created_utc": 1492384222.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": "", "user_reports": [], "id": "dgcvzky", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "neededanaccountname", "parent_id": "t3_65om3e", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "It's hard to discern what this article is proposing. The economy must be \"adaptive\" and we must tend to it \"like gardeners,\" which seem like agreeable statements in the abstract, but it doesn't outline a thing that we must specifically do. We're supposed to let the markets run their natural course, but commit to \"pruning and weeding\" along the way. In its criticism of classical economics it pointed out two economic predictions that were largely speculative and seem to have failed, but what about more solid models like supply and demand? Supply and demand is incredibly solid and fairly constant throughout economic observations. We're not going downplay the importance of that in this new \"garden\" are we? Interesting article which provided two good critiques of misshapen economic models, but overall it doesn't give us much to work with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard to discern what this article is proposing. The economy must be &amp;quot;adaptive&amp;quot; and we must tend to it &amp;quot;like gardeners,&amp;quot; which seem like agreeable statements in the abstract, but it doesn&amp;#39;t outline a thing that we must specifically do. We&amp;#39;re supposed to let the markets run their natural course, but commit to &amp;quot;pruning and weeding&amp;quot; along the way. In its criticism of classical economics it pointed out two economic predictions that were largely speculative and seem to have failed, but what about more solid models like supply and demand? Supply and demand is incredibly solid and fairly constant throughout economic observations. We&amp;#39;re not going downplay the importance of that in this new &amp;quot;garden&amp;quot; are we? Interesting article which provided two good critiques of misshapen economic models, but overall it doesn&amp;#39;t give us much to work with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgcvzky", "score_hidden": false, "stickied": false, "created": 1492420668.0, "created_utc": 1492391868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": "", "user_reports": [], "id": "dgd6onp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "elgul", "parent_id": "t3_65om3e", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "\"Follow the laws of nature, not the laws of physics\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Follow the laws of nature, not the laws of physics&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgd6onp", "score_hidden": false, "stickied": false, "created": 1492437564.0, "created_utc": 1492408764.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": "", "user_reports": [], "id": "dgcian8", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Ponderay", "parent_id": "t1_dgch2cg", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "The article basically boils down to economists should analyize policy.   I'm sure the author will be overjoyed to realize that's currently a [big part](https://www.aeaweb.org/articles?id=10.1257/jep.24.2.3) of economics and will issue a correction.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The article basically boils down to economists should analyize policy.   I&amp;#39;m sure the author will be overjoyed to realize that&amp;#39;s currently a &lt;a href=\"https://www.aeaweb.org/articles?id=10.1257/jep.24.2.3\"&gt;big part&lt;/a&gt; of economics and will issue a correction.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgcian8", "score_hidden": false, "stickied": false, "created": 1492402401.0, "created_utc": 1492373601.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgch2cg", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "BEE_REAL_", "parent_id": "t3_65om3e", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "More flaming garbage from The Guardian, the Breitbart of the left\n\nThis article is shockingly ignorant. It's clear the author has absolutely no knowledge of economics past 101 level and doesn't even seem to know that there is a level of economics above 101 level. Nearly everything in this article is a total misrepresentation of both economics and the beliefs of economists. And to add to that, its only refutation of these \"economic laws of physics (which only the author seems to take as such)\" is vague references to current events. Add to that the fact that the author is trying to sell you her shitty book and it should be IMMEDIATELY obvious that this article is horseshit and shouldn't be taken seriously\n\n&gt; Realising that the economy is ever-evolving is an empowering insight\n\nWOW GENIUS IVE NEVER SEEN ANYONE SAY THAT BEFORE WHAT A VISIONARY\n\nAlso tagging /u/Ponderay because the author seems to think environmental economics doesn't exist", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More flaming garbage from The Guardian, the Breitbart of the left&lt;/p&gt;\n\n&lt;p&gt;This article is shockingly ignorant. It&amp;#39;s clear the author has absolutely no knowledge of economics past 101 level and doesn&amp;#39;t even seem to know that there is a level of economics above 101 level. Nearly everything in this article is a total misrepresentation of both economics and the beliefs of economists. And to add to that, its only refutation of these &amp;quot;economic laws of physics (which only the author seems to take as such)&amp;quot; is vague references to current events. Add to that the fact that the author is trying to sell you her shitty book and it should be IMMEDIATELY obvious that this article is horseshit and shouldn&amp;#39;t be taken seriously&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Realising that the economy is ever-evolving is an empowering insight&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;WOW GENIUS IVE NEVER SEEN ANYONE SAY THAT BEFORE WHAT A VISIONARY&lt;/p&gt;\n\n&lt;p&gt;Also tagging &lt;a href=\"/u/Ponderay\"&gt;/u/Ponderay&lt;/a&gt; because the author seems to think environmental economics doesn&amp;#39;t exist&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgch2cg", "score_hidden": false, "stickied": false, "created": 1492400813.0, "created_utc": 1492372013.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": "", "user_reports": [], "id": "dgdjdaa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ponderay", "parent_id": "t1_dgczfom", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "&gt;It's a bit muddled which is a disappointing and consistent problem it seems with \"new economics.\" It's no secret I think economics suffers from physics envy which this article echos. The way I see it economists want to present their area of study as sterile and observatory; they're just reporting on how the world works without injecting their own bias. .\n\nHow does this differ from other fields?\n\n[re physics envy](http://noahpinionblog.blogspot.com/2015/05/economists-dont-have-physics-envy.html)\n\n\n&gt; GDP growth from what I've seen is still the go to cure all for economic woes.\n\n Economists talk about [health effects](https://www.brookings.edu/bpea-articles/mortality-and-morbidity-in-the-21st-century/) [often](https://www.princeton.edu/~jcurrie/cv/cv.pdf) for instance.  We recognize that natural resources can utility from [their very existence](https://www.aeaweb.org/articles?id=10.1257/jep.26.4.3).  Behavioral econ has studied several deviations from \"only gdp provides utility\". Even macro people recognize that leisure is important.  \n\nIt's easy to just state platitudes about how economics ignores X but you need to be specific and actually acknowledge the full breadth of econ.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s a bit muddled which is a disappointing and consistent problem it seems with &amp;quot;new economics.&amp;quot; It&amp;#39;s no secret I think economics suffers from physics envy which this article echos. The way I see it economists want to present their area of study as sterile and observatory; they&amp;#39;re just reporting on how the world works without injecting their own bias. .&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How does this differ from other fields?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://noahpinionblog.blogspot.com/2015/05/economists-dont-have-physics-envy.html\"&gt;re physics envy&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;GDP growth from what I&amp;#39;ve seen is still the go to cure all for economic woes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Economists talk about &lt;a href=\"https://www.brookings.edu/bpea-articles/mortality-and-morbidity-in-the-21st-century/\"&gt;health effects&lt;/a&gt; &lt;a href=\"https://www.princeton.edu/%7Ejcurrie/cv/cv.pdf\"&gt;often&lt;/a&gt; for instance.  We recognize that natural resources can utility from &lt;a href=\"https://www.aeaweb.org/articles?id=10.1257/jep.26.4.3\"&gt;their very existence&lt;/a&gt;.  Behavioral econ has studied several deviations from &amp;quot;only gdp provides utility&amp;quot;. Even macro people recognize that leisure is important.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s easy to just state platitudes about how economics ignores X but you need to be specific and actually acknowledge the full breadth of econ.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgdjdaa", "score_hidden": false, "stickied": false, "created": 1492467889.0, "created_utc": 1492439089.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczfom", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "louieanderson", "parent_id": "t1_dgcie1u", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "It's a bit muddled which is a disappointing and consistent problem it seems with \"new economics.\" It's no secret I think economics suffers from physics envy which this article echos. The way I see it economists want to present their area of study as sterile and observatory; they're just reporting on how the world works without injecting their own bias. These are not new issues in the [philosophy of science,](https://en.wikipedia.org/wiki/The_Structure_of_Scientific_Revolutions) but economics seems to have been slow to address them. For example the desperate search for economic solutions that involve as little intervention as possible; for an extreme example the philosophy of Alan Greenspan. Yes even Friedman and Hayek were not totally \"hands off\" but there is is definitely a disagreement to degree with the new economist pushing for a strongly interventionist approach.\n\nThe approach of dispassionately forming models also produces issues for determining policy or measuring success. Particularly it seems U.S. economists eschews measures like \"happiness indexes\" or other measures of well-being relying, traditionally, on things like GDP per capita and annual growth. GDP growth from what I've seen is still the go to cure all for economic woes. Granted there has been more nuance recently, particularly regarding concerns over decoupling of wages from productivity.\n\nThere was another recent thread with a washington post article, the links of which contained contributions from economists discussing the new economics movement. Even mainstream critics don't view it favorably but concede some trouble in economics, at least for how research is transmitted to the public and policy. [Brad Delong's take is less forgiving and he names names.](http://www.bradford-delong.com/2017/03/the-need-for-a-reformation-of-authority-and-hierarchy-among-economists-in-the-public-sphere.html)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a bit muddled which is a disappointing and consistent problem it seems with &amp;quot;new economics.&amp;quot; It&amp;#39;s no secret I think economics suffers from physics envy which this article echos. The way I see it economists want to present their area of study as sterile and observatory; they&amp;#39;re just reporting on how the world works without injecting their own bias. These are not new issues in the &lt;a href=\"https://en.wikipedia.org/wiki/The_Structure_of_Scientific_Revolutions\"&gt;philosophy of science,&lt;/a&gt; but economics seems to have been slow to address them. For example the desperate search for economic solutions that involve as little intervention as possible; for an extreme example the philosophy of Alan Greenspan. Yes even Friedman and Hayek were not totally &amp;quot;hands off&amp;quot; but there is is definitely a disagreement to degree with the new economist pushing for a strongly interventionist approach.&lt;/p&gt;\n\n&lt;p&gt;The approach of dispassionately forming models also produces issues for determining policy or measuring success. Particularly it seems U.S. economists eschews measures like &amp;quot;happiness indexes&amp;quot; or other measures of well-being relying, traditionally, on things like GDP per capita and annual growth. GDP growth from what I&amp;#39;ve seen is still the go to cure all for economic woes. Granted there has been more nuance recently, particularly regarding concerns over decoupling of wages from productivity.&lt;/p&gt;\n\n&lt;p&gt;There was another recent thread with a washington post article, the links of which contained contributions from economists discussing the new economics movement. Even mainstream critics don&amp;#39;t view it favorably but concede some trouble in economics, at least for how research is transmitted to the public and policy. &lt;a href=\"http://www.bradford-delong.com/2017/03/the-need-for-a-reformation-of-authority-and-hierarchy-among-economists-in-the-public-sphere.html\"&gt;Brad Delong&amp;#39;s take is less forgiving and he names names.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgczfom", "score_hidden": false, "stickied": false, "created": 1492425374.0, "created_utc": 1492396574.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcie1u", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Ponderay", "parent_id": "t1_dgc1ywx", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "I'm really confused on what the article even means.   Note how all its examples either come from:\n\n1) the last 19th century.\n2) 1950's research agendas (Kuznuts) or the EKC which is interesting but doesn't really drive environmental policy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really confused on what the article even means.   Note how all its examples either come from:&lt;/p&gt;\n\n&lt;p&gt;1) the last 19th century.\n2) 1950&amp;#39;s research agendas (Kuznuts) or the EKC which is interesting but doesn&amp;#39;t really drive environmental policy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgcie1u", "score_hidden": false, "stickied": false, "created": 1492402517.0, "created_utc": 1492373717.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1s", "removal_reason": null, "link_id": "t3_65om3e", "likes": null, "replies": "", "user_reports": [], "id": "dgceh5v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "klabboy", "parent_id": "t1_dgc1ywx", "subreddit_name_prefixed": "r/Economics", "controversiality": 0, "body": "Economics is an extremely new science. Perhaps one day with massive amounts of data over various types of economies, we can approach a physics like prediction based on mathematical modeling. But until then. Its just not going to happen. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Economics is an extremely new science. Perhaps one day with massive amounts of data over various types of economies, we can approach a physics like prediction based on mathematical modeling. But until then. Its just not going to happen. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgceh5v", "score_hidden": false, "stickied": false, "created": 1492397396.0, "created_utc": 1492368596.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1ywx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "louieanderson", "parent_id": "t3_65om3e", "subreddit_name_prefixed": "r/Economics", "controversiality": 1, "body": "This probably warrants a trigger warning for \"very serious\" economists who like to think economics is a science. The so called hard sciences have already had to endure their own soul-searching in regards to what they profess to practice as method and their own human foibles as Noah Smith as noted in referencing the work of [Lakatos](https://plato.stanford.edu/entries/lakatos/#ImprPoppScie). Economics despite it's shift to more rigorously mathematical and statistical methods has not been so introspective regarding the sociological problems inherent in any research paradigm, although as I understand it behavioral economics is making good inroads.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This probably warrants a trigger warning for &amp;quot;very serious&amp;quot; economists who like to think economics is a science. The so called hard sciences have already had to endure their own soul-searching in regards to what they profess to practice as method and their own human foibles as Noah Smith as noted in referencing the work of &lt;a href=\"https://plato.stanford.edu/entries/lakatos/#ImprPoppScie\"&gt;Lakatos&lt;/a&gt;. Economics despite it&amp;#39;s shift to more rigorously mathematical and statistical methods has not been so introspective regarding the sociological problems inherent in any research paradigm, although as I understand it behavioral economics is making good inroads.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Economics", "name": "t1_dgc1ywx", "score_hidden": false, "stickied": false, "created": 1492380102.0, "created_utc": 1492351302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]