[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "cscareerquestions", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hope I&amp;#39;m not the only one. It is not that I&amp;#39;ve lost interest in other things, but it&amp;#39;s more that I feel I need to live and breath programming in order to advance my career, or even to just stay afloat. I have to blame it on the fact that the programming world is becoming insanely competitive. I feel like my friends and family are worried about me. Whenever my parents ask what I did over the weekend, I always tell them the truth -- that I spent the entire weekend working on some programming projects or puzzles. I turn down many social events because I feel guilty if I didn&amp;#39;t spend my free time learning more about programming. Any non-programming books I get from Christmas or birthday, I never pick up to read, because the programming books or articles I feel I need to read take priority. I somewhat envy people who have jobs that pay around the same (e.g. Pharmacist) but all they need to know was learned at school and all they have to do is work 9-to-5 and they don&amp;#39;t have to &amp;quot;keep their skills sharp&amp;quot; or &amp;quot;learn the latest syntax&amp;quot;. It is, however, possible that I&amp;#39;m just an insecure person in that I feel I need to do a lot of extra work in order to stay competitive with the guys from India with 15+ years of experience and all the tens (hundreds?) of thousands of CS grads that get pumped out of school every year. Sorry about the depressing post, but I&amp;#39;m curious whether anyone else here feels the same way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hope I'm not the only one. It is not that I've lost interest in other things, but it's more that I feel I need to live and breath programming in order to advance my career, or even to just stay afloat. I have to blame it on the fact that the programming world is becoming insanely competitive. I feel like my friends and family are worried about me. Whenever my parents ask what I did over the weekend, I always tell them the truth -- that I spent the entire weekend working on some programming projects or puzzles. I turn down many social events because I feel guilty if I didn't spend my free time learning more about programming. Any non-programming books I get from Christmas or birthday, I never pick up to read, because the programming books or articles I feel I need to read take priority. I somewhat envy people who have jobs that pay around the same (e.g. Pharmacist) but all they need to know was learned at school and all they have to do is work 9-to-5 and they don't have to \"keep their skills sharp\" or \"learn the latest syntax\". It is, however, possible that I'm just an insecure person in that I feel I need to do a lot of extra work in order to stay competitive with the guys from India with 15+ years of experience and all the tens (hundreds?) of thousands of CS grads that get pumped out of school every year. Sorry about the depressing post, but I'm curious whether anyone else here feels the same way.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "651zt5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 54, "report_reasons": null, "author": "mscorlib", "saved": false, "mod_reports": [], "name": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "approved_by": null, "over_18": false, "domain": "self.cscareerquestions", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sdpm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/cscareerquestions/comments/651zt5/has_your_programming_career_taken_over_your_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492070058.0, "url": "https://www.reddit.com/r/cscareerquestions/comments/651zt5/has_your_programming_career_taken_over_your_life/", "author_flair_text": null, "quarantine": false, "title": "Has your programming career taken over your life?", "created_utc": 1492041258.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 65, "visited": false, "subreddit_type": "public", "ups": 54}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg85jhf", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MiscBrahBert", "parent_id": "t1_dg815cn", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I think you're missing the entire point of the post...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re missing the entire point of the post...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg85jhf", "score_hidden": false, "stickied": false, "created": 1492143398.0, "created_utc": 1492114598.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg815cn", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "paekprk2", "parent_id": "t1_dg794lw", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt; There was a part time prof at my college who was an ex-Google, MS veteran and just really good at his stuff. When he wrote code during live sessions it seemed like art.\n\nCould you elaborate more on this professor of yours and his skills? That's pretty admirable. I have a hard time finding people who can be role model material. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There was a part time prof at my college who was an ex-Google, MS veteran and just really good at his stuff. When he wrote code during live sessions it seemed like art.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Could you elaborate more on this professor of yours and his skills? That&amp;#39;s pretty admirable. I have a hard time finding people who can be role model material. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg815cn", "score_hidden": false, "stickied": false, "created": 1492138601.0, "created_utc": 1492109801.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg794lw", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "ConstipaatedDragon", "parent_id": "t1_dg70rld", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Just to provide a counterpoint, I think the OP has some merit to his view. I used to be like that in college (and immediately after) too...there is huge pressure promulgated by the image of the typical whiz genius hacker who knows so much. \n\nThere was a part time prof at my college who was an ex-Google, MS veteran and just **really** good at his stuff. When he wrote code during live sessions it seemed like art. I sort of made him a role model. When I asked him how I could be him, he pretty much shrugged and said its been my life for the past 17 years I haven't done much else (he's around 38-39).   \n\nAnyways, so I tried to become good at algorithms by reading several books and research papers. Then I made a compiler. Then I started on functional programming and spent lots of time on that. After this I started some level stuff on OSes ec...etc etc blah blah blah. I was even declining good paid work as I thought it was mostly crud and wouldn't carry learning value.\n\nThis continued till about 6 months ago till I just stopped caring out of the blue. I do think it definitely made me a better engineer (I couldn't have landed my current job if I hadn't learned some of that stuff) but it wasn't worth it for the stress and damaged relationships.\n\nTakeaways:\n \n- IF you want to do good, THEN you do need to spend time to keep up. This is especially for those stuck in CRUD-y web/app dev jobs (not in those rare companies doing interesting work with intrinsic learning value).\n \n- However, CS isn't alone in this. I know federal bureaucrats and doctors who genuinely think their jobs are meaningful and they put late hours, prioritizing them over everything.\n \n- More importantly, **Everything has a cost**. The time you burn on leetcode isn't coming back and you could have spent it in about a million other ways. *Figure out whats important to you*, and prioritize that. Many would be happier with a perhaps slightly less successful career if they get a better family life and more time with their kids. ", "edited": 1492066186.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to provide a counterpoint, I think the OP has some merit to his view. I used to be like that in college (and immediately after) too...there is huge pressure promulgated by the image of the typical whiz genius hacker who knows so much. &lt;/p&gt;\n\n&lt;p&gt;There was a part time prof at my college who was an ex-Google, MS veteran and just &lt;strong&gt;really&lt;/strong&gt; good at his stuff. When he wrote code during live sessions it seemed like art. I sort of made him a role model. When I asked him how I could be him, he pretty much shrugged and said its been my life for the past 17 years I haven&amp;#39;t done much else (he&amp;#39;s around 38-39).   &lt;/p&gt;\n\n&lt;p&gt;Anyways, so I tried to become good at algorithms by reading several books and research papers. Then I made a compiler. Then I started on functional programming and spent lots of time on that. After this I started some level stuff on OSes ec...etc etc blah blah blah. I was even declining good paid work as I thought it was mostly crud and wouldn&amp;#39;t carry learning value.&lt;/p&gt;\n\n&lt;p&gt;This continued till about 6 months ago till I just stopped caring out of the blue. I do think it definitely made me a better engineer (I couldn&amp;#39;t have landed my current job if I hadn&amp;#39;t learned some of that stuff) but it wasn&amp;#39;t worth it for the stress and damaged relationships.&lt;/p&gt;\n\n&lt;p&gt;Takeaways:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;IF you want to do good, THEN you do need to spend time to keep up. This is especially for those stuck in CRUD-y web/app dev jobs (not in those rare companies doing interesting work with intrinsic learning value).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;However, CS isn&amp;#39;t alone in this. I know federal bureaucrats and doctors who genuinely think their jobs are meaningful and they put late hours, prioritizing them over everything.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;More importantly, &lt;strong&gt;Everything has a cost&lt;/strong&gt;. The time you burn on leetcode isn&amp;#39;t coming back and you could have spent it in about a million other ways. &lt;em&gt;Figure out whats important to you&lt;/em&gt;, and prioritize that. Many would be happier with a perhaps slightly less successful career if they get a better family life and more time with their kids. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg794lw", "score_hidden": false, "stickied": false, "created": 1492094520.0, "created_utc": 1492065720.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg78ryl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "slicer8181", "parent_id": "t1_dg70rld", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Amen to that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amen to that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg78ryl", "score_hidden": false, "stickied": false, "created": 1492093628.0, "created_utc": 1492064828.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70rld", "gilded": 0, "archived": false, "score": 107, "report_reasons": null, "author": "yuga_d", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Bruh, you are stressing yourself out. There are plenty of us who don't worry about job security and work only 9 to 5, no weekends. \n\nI have a family. I'm not gonna be doing leetcode all weekend, I'm not gonna read programming blogs to stay ahead, I'm not worried about people taking my job because I do ok at work. If I'm interested in something I'll spend some time reading up on it or I will volunteer to help a friend with a website but this doesn't have to be a rat race. \n\nThis doesn't have to be a rat race.\n\nedit: people are saying they're struggling to stay up to date in this field. What? I am a backend Java dev, I've spent some time getting up to date on Java 8 - that's it. I'm not working my ass off just trying to stay relevant. What fields are you all in that you're just struggling to stay afloat?", "edited": 1492100574.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bruh, you are stressing yourself out. There are plenty of us who don&amp;#39;t worry about job security and work only 9 to 5, no weekends. &lt;/p&gt;\n\n&lt;p&gt;I have a family. I&amp;#39;m not gonna be doing leetcode all weekend, I&amp;#39;m not gonna read programming blogs to stay ahead, I&amp;#39;m not worried about people taking my job because I do ok at work. If I&amp;#39;m interested in something I&amp;#39;ll spend some time reading up on it or I will volunteer to help a friend with a website but this doesn&amp;#39;t have to be a rat race. &lt;/p&gt;\n\n&lt;p&gt;This doesn&amp;#39;t have to be a rat race.&lt;/p&gt;\n\n&lt;p&gt;edit: people are saying they&amp;#39;re struggling to stay up to date in this field. What? I am a backend Java dev, I&amp;#39;ve spent some time getting up to date on Java 8 - that&amp;#39;s it. I&amp;#39;m not working my ass off just trying to stay relevant. What fields are you all in that you&amp;#39;re just struggling to stay afloat?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg70rld", "score_hidden": false, "stickied": false, "created": 1492080215.0, "created_utc": 1492051415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 107}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7d5b5", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "pragmojo", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "This is the wrong place to ask.  Keep in mind you're speaking to a community of people who subscribed to a sub just because they thought it might help them get ahead in the job market - if there are neurotic, obsessive workaholics who believe you have to minmax your life priorities around coding and nothing else you will find them here. \n\nPersonally I am a freelancer, and I have no trouble getting work.  I write code outside of work every morning but only because it's a project I'm interested in.  I never worry about what other developers think I should be up to date on, and I have plenty of free time to spend with my girlfriend and on my hobbies.  I know how to work with people in a modern software development practice, I am confident I can pick up any specific technologies I might need for a project during the project, and I have a deep portfolio proving my results.  That's enough.\n\nIMHO being content in life is it's own skill worth practicing.  It sounds like programming has become the source of your anxiety and stress, and the activity you go to to abate that stress.  It sounds like you might also be sublimating your other anxieties (e.g. relating to missing out on a social life) through programming.  You might want to be careful with relying on any one thing to meet too many of your needs.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the wrong place to ask.  Keep in mind you&amp;#39;re speaking to a community of people who subscribed to a sub just because they thought it might help them get ahead in the job market - if there are neurotic, obsessive workaholics who believe you have to minmax your life priorities around coding and nothing else you will find them here. &lt;/p&gt;\n\n&lt;p&gt;Personally I am a freelancer, and I have no trouble getting work.  I write code outside of work every morning but only because it&amp;#39;s a project I&amp;#39;m interested in.  I never worry about what other developers think I should be up to date on, and I have plenty of free time to spend with my girlfriend and on my hobbies.  I know how to work with people in a modern software development practice, I am confident I can pick up any specific technologies I might need for a project during the project, and I have a deep portfolio proving my results.  That&amp;#39;s enough.&lt;/p&gt;\n\n&lt;p&gt;IMHO being content in life is it&amp;#39;s own skill worth practicing.  It sounds like programming has become the source of your anxiety and stress, and the activity you go to to abate that stress.  It sounds like you might also be sublimating your other anxieties (e.g. relating to missing out on a social life) through programming.  You might want to be careful with relying on any one thing to meet too many of your needs.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7d5b5", "score_hidden": false, "stickied": false, "created": 1492106229.0, "created_utc": 1492077429.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7tbvm", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "S-AllGoodMan", "parent_id": "t1_dg7d6l6", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Spreading his semaphores", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Spreading his semaphores&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7tbvm", "score_hidden": false, "stickied": false, "created": 1492130282.0, "created_utc": 1492101482.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d6l6", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "AppleSmoker", "parent_id": "t1_dg77y8d", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "race condition could be a problem", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;race condition could be a problem&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7d6l6", "score_hidden": false, "stickied": false, "created": 1492106333.0, "created_utc": 1492077533.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77y8d", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "usersi", "parent_id": "t1_dg76kms", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Multithreading", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Multithreading&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg77y8d", "score_hidden": false, "stickied": false, "created": 1492091708.0, "created_utc": 1492062908.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76kms", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "WagwanKenobi", "parent_id": "t1_dg76gxj", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "scalability bro", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;scalability bro&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg76kms", "score_hidden": false, "stickied": false, "created": 1492088896.0, "created_utc": 1492060096.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 35}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76gxj", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "ThePandaGuitar", "parent_id": "t1_dg76ajv", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "accounting for all edge cases", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;accounting for all edge cases&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg76gxj", "score_hidden": false, "stickied": false, "created": 1492088719.0, "created_utc": 1492059919.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 43}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76ajv", "gilded": 0, "archived": false, "score": 76, "report_reasons": null, "author": "WagwanKenobi", "parent_id": "t1_dg6x15q", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt; significant other**s**\n\nwe got a playa over here", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;significant other&lt;strong&gt;s&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;we got a playa over here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg76ajv", "score_hidden": false, "stickied": false, "created": 1492088416.0, "created_utc": 1492059616.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 76}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6x15q", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "ormula", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I chose programming because learning new things is what I find interesting. \n\nIt does not consume my life. I hang out with friends, with my significant others, play video games, etc etc. But at the end of the day, I do read programming blogs on the weekend because I love learning and love programming. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I chose programming because learning new things is what I find interesting. &lt;/p&gt;\n\n&lt;p&gt;It does not consume my life. I hang out with friends, with my significant others, play video games, etc etc. But at the end of the day, I do read programming blogs on the weekend because I love learning and love programming. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg6x15q", "score_hidden": false, "stickied": false, "created": 1492075561.0, "created_utc": 1492046761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7f7tx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BigWigly", "parent_id": "t1_dg759jl", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "This is me right now", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is me right now&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7f7tx", "score_hidden": false, "stickied": false, "created": 1492111839.0, "created_utc": 1492083039.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg759jl", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "darexinfinity", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "When actively on the job hunt, definitely feels like it's taking over my life. Just because I've worked for X amount of years doing outstanding work doesn't mean I know how to solve leetcode problems, and yet this seems to be my only barrier between me and a job offer. As soon I get home I start doing problems until I'm too hungry or I take an unintentional nap (I'm writing this as I'm too hungry to do another problem). On the weekends it's what I do 50-75% of the day. \n\nOutside of active job seeking is a different story though. I wouldn't touch any code outside of work. \n\nIf you feel like you're doomed if you don't stay ahead and that your job is causing it, then maybe you should start actively applying elsewhere. I personally know that there jobs out there that have decent job security and work-life balance, you may not find a job like that on your first try or perhaps it may come with it's own set of flaws, but that peace of mind you desire is not impossible to find.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When actively on the job hunt, definitely feels like it&amp;#39;s taking over my life. Just because I&amp;#39;ve worked for X amount of years doing outstanding work doesn&amp;#39;t mean I know how to solve leetcode problems, and yet this seems to be my only barrier between me and a job offer. As soon I get home I start doing problems until I&amp;#39;m too hungry or I take an unintentional nap (I&amp;#39;m writing this as I&amp;#39;m too hungry to do another problem). On the weekends it&amp;#39;s what I do 50-75% of the day. &lt;/p&gt;\n\n&lt;p&gt;Outside of active job seeking is a different story though. I wouldn&amp;#39;t touch any code outside of work. &lt;/p&gt;\n\n&lt;p&gt;If you feel like you&amp;#39;re doomed if you don&amp;#39;t stay ahead and that your job is causing it, then maybe you should start actively applying elsewhere. I personally know that there jobs out there that have decent job security and work-life balance, you may not find a job like that on your first try or perhaps it may come with it&amp;#39;s own set of flaws, but that peace of mind you desire is not impossible to find.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg759jl", "score_hidden": false, "stickied": false, "created": 1492086694.0, "created_utc": 1492057894.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg77pnc", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "MagicPistol", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I'm just an automation/qa engineer so my experience is different.\n\nI never work more than 40 hours a week. I never think about my job or programming outside of work. In fact, my job/career is like my lowest priority right now lol.\n\nI may not have the best salary, but I'm still very happy with it and that's all that matters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just an automation/qa engineer so my experience is different.&lt;/p&gt;\n\n&lt;p&gt;I never work more than 40 hours a week. I never think about my job or programming outside of work. In fact, my job/career is like my lowest priority right now lol.&lt;/p&gt;\n\n&lt;p&gt;I may not have the best salary, but I&amp;#39;m still very happy with it and that&amp;#39;s all that matters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg77pnc", "score_hidden": false, "stickied": false, "created": 1492091187.0, "created_utc": 1492062387.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg8awqk", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "badlcuk", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "You should consider a therapist, this kind of obsession/fear is not healthy. You won't even pick up a cool book you are _given_ because its not about programming? You avoid socialization so you can study? This really sounds to be impacting many aspects of your life. I feel really concerned for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should consider a therapist, this kind of obsession/fear is not healthy. You won&amp;#39;t even pick up a cool book you are &lt;em&gt;given&lt;/em&gt; because its not about programming? You avoid socialization so you can study? This really sounds to be impacting many aspects of your life. I feel really concerned for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg8awqk", "score_hidden": false, "stickied": false, "created": 1492149743.0, "created_utc": 1492120943.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg83jl3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "palindromes232", "parent_id": "t1_dg7iksl", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt; I've got too many places to be and too much things to do after work to spend sitting in front of NetBeans or something coding all night.\n\nLike play Battlefield and watch TV.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve got too many places to be and too much things to do after work to spend sitting in front of NetBeans or something coding all night.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like play Battlefield and watch TV.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg83jl3", "score_hidden": false, "stickied": false, "created": 1492141208.0, "created_utc": 1492112408.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7iksl", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ThomasJCarcetti", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "No. \n\nWhen I go home every day I forget all about programming and just play Battlefield one or watch TV. Then I go to sleep. \n\nAin't no way I could spend all day programming like a robot. I at least try to do enough of that at work. I've got too many places to be and too much things to do after work to spend sitting in front of NetBeans or something coding all night. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. &lt;/p&gt;\n\n&lt;p&gt;When I go home every day I forget all about programming and just play Battlefield one or watch TV. Then I go to sleep. &lt;/p&gt;\n\n&lt;p&gt;Ain&amp;#39;t no way I could spend all day programming like a robot. I at least try to do enough of that at work. I&amp;#39;ve got too many places to be and too much things to do after work to spend sitting in front of NetBeans or something coding all night. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7iksl", "score_hidden": false, "stickied": false, "created": 1492117821.0, "created_utc": 1492089021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7vupv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ccricers", "parent_id": "t1_dg70bfe", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "Fuck yea it's a treadmill. It's especially true in web dev. It's like a free to play game (very easy to get in) but it's sooo grindy that if you stop playing for a while you get easily left in the dust.\n\nAlso I don't know what the work culture is like for tech in the Bay Area, but in Chicago I can barely tell it's here. Nobody here is jogging with VR goggles and drinking soylent juice. I never hear anyone talk about programming outside of work.\n\nBtw does the Big 4 have an aversion to the name \"Bob\" or something? :p", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck yea it&amp;#39;s a treadmill. It&amp;#39;s especially true in web dev. It&amp;#39;s like a free to play game (very easy to get in) but it&amp;#39;s sooo grindy that if you stop playing for a while you get easily left in the dust.&lt;/p&gt;\n\n&lt;p&gt;Also I don&amp;#39;t know what the work culture is like for tech in the Bay Area, but in Chicago I can barely tell it&amp;#39;s here. Nobody here is jogging with VR goggles and drinking soylent juice. I never hear anyone talk about programming outside of work.&lt;/p&gt;\n\n&lt;p&gt;Btw does the Big 4 have an aversion to the name &amp;quot;Bob&amp;quot; or something? :p&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7vupv", "score_hidden": false, "stickied": false, "created": 1492132962.0, "created_utc": 1492104162.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70bfe", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "angel20000", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "this is the biggest downside to software engineering that you don't hear about, it's a treadmill. You have to keep moving and improving or else you'll fall behind. If you got passion and love coding and love trading other aspects of your life for it, enjoy your time working at a big-4(or working to get into and then succeed in one). If not, you can try to find a comfy government job where you spend your day in a room with an older gentleman named Bob with whom you churn out simple CRUD work and then zip out the door to enjoy your social life once the clock hits 5.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is the biggest downside to software engineering that you don&amp;#39;t hear about, it&amp;#39;s a treadmill. You have to keep moving and improving or else you&amp;#39;ll fall behind. If you got passion and love coding and love trading other aspects of your life for it, enjoy your time working at a big-4(or working to get into and then succeed in one). If not, you can try to find a comfy government job where you spend your day in a room with an older gentleman named Bob with whom you churn out simple CRUD work and then zip out the door to enjoy your social life once the clock hits 5.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg70bfe", "score_hidden": false, "stickied": false, "created": 1492079638.0, "created_utc": 1492050838.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7h5jc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "v89_cs", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "The solution is to specialize.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The solution is to specialize.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7h5jc", "score_hidden": false, "stickied": false, "created": 1492115607.0, "created_utc": 1492086807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7k9th", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Eindacor_DS", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I don't really care or want to be the best programmer out there. I stay sharp enough to be able to do my job well, but other than that I work to live. If I really pushed myself and spent all my time bettering my skills I could probably make more money, but I don't really think it's worth sacrificing my free time and mental health.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really care or want to be the best programmer out there. I stay sharp enough to be able to do my job well, but other than that I work to live. If I really pushed myself and spent all my time bettering my skills I could probably make more money, but I don&amp;#39;t really think it&amp;#39;s worth sacrificing my free time and mental health.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7k9th", "score_hidden": false, "stickied": false, "created": 1492120136.0, "created_utc": 1492091336.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7u93j", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "angel20000", "parent_id": "t1_dg7ponk", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "If you don't want to be doing that until you retire at 70, I suggest changing fields. Fields like medicine have you put in an initially hard effort for a set number of years but afterwards you aren't expected to do it in your free time. Computer science demands a moderate effort over your entire life to stay relevant, unless you slip into management in which case you make more and get off the crazy treadmill. That's what I'm aspiring for. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you don&amp;#39;t want to be doing that until you retire at 70, I suggest changing fields. Fields like medicine have you put in an initially hard effort for a set number of years but afterwards you aren&amp;#39;t expected to do it in your free time. Computer science demands a moderate effort over your entire life to stay relevant, unless you slip into management in which case you make more and get off the crazy treadmill. That&amp;#39;s what I&amp;#39;m aspiring for. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7u93j", "score_hidden": false, "stickied": false, "created": 1492131265.0, "created_utc": 1492102465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ponk", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "derek565", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "This is what stresses me out so much as a college student. I feel like I always have to be studying, working, or doing side projects just to keep up. I've become an isolated and hollow person only focused on programming when I don't even have passion for it...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what stresses me out so much as a college student. I feel like I always have to be studying, working, or doing side projects just to keep up. I&amp;#39;ve become an isolated and hollow person only focused on programming when I don&amp;#39;t even have passion for it...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7ponk", "score_hidden": false, "stickied": false, "created": 1492126399.0, "created_utc": 1492097599.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7l27z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Nyxtia", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Yes I think what your saying is true but you have to balance fun time with learning time. \n\nTo be honest that extra few hours you spend thinking you'll finish something sooner or learn something faster is better spent away from the computer, relaxed, calm or well rested. I'll always go walk my dog when I get stuck with a difficult problem or just do something else and find when I get back I can look at the issue from a new less stubborn perspective and solve it within minutes. And if you don't solve it after coming back then you were still probably more productive. \n\nWe are humans and naturally we will get frustrated or stubbornly suspect something and unless those things don't happen to you, taking a break will help you. \n\nWhat could also happen is addiction. You could be continuously hooked into what you're doing in that case you'd be enjoying what your doing and breaking away is something you'll ha e to convince yourself to do. Sometimes I get so invested I forget to eat and I have to remind myself and pry myself to go eat something. ", "edited": 1492092679.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I think what your saying is true but you have to balance fun time with learning time. &lt;/p&gt;\n\n&lt;p&gt;To be honest that extra few hours you spend thinking you&amp;#39;ll finish something sooner or learn something faster is better spent away from the computer, relaxed, calm or well rested. I&amp;#39;ll always go walk my dog when I get stuck with a difficult problem or just do something else and find when I get back I can look at the issue from a new less stubborn perspective and solve it within minutes. And if you don&amp;#39;t solve it after coming back then you were still probably more productive. &lt;/p&gt;\n\n&lt;p&gt;We are humans and naturally we will get frustrated or stubbornly suspect something and unless those things don&amp;#39;t happen to you, taking a break will help you. &lt;/p&gt;\n\n&lt;p&gt;What could also happen is addiction. You could be continuously hooked into what you&amp;#39;re doing in that case you&amp;#39;d be enjoying what your doing and breaking away is something you&amp;#39;ll ha e to convince yourself to do. Sometimes I get so invested I forget to eat and I have to remind myself and pry myself to go eat something. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7l27z", "score_hidden": false, "stickied": false, "created": 1492121143.0, "created_utc": 1492092343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7q73s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GvsuMRB", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I think the most difficult thing nowadays is the expectation that you are an expert in X technologies, programming languages, and frameworks. Combined with X number of versions for each of the above listed, it's nigh impossible to be a master of all. I definitely feel like a jack of all trades, master of none. The speed at which technology changes in our field makes it hard to keep up. \n\nCombined with the competition the op mentioned, I think there is value if programmers banded together to fight for the pay and amenities that we deserve. \n\nAgain, it kind of goes hand in hand with the 10,000 hours rule. Today's society values niche experts or \"monomaths\" and gone are the days of the polymath, but I still strive to be a polymath. \n\nThe field is a double edged sword, on one hand, it's great, and on the other, it's a giant tedious pain in the ass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the most difficult thing nowadays is the expectation that you are an expert in X technologies, programming languages, and frameworks. Combined with X number of versions for each of the above listed, it&amp;#39;s nigh impossible to be a master of all. I definitely feel like a jack of all trades, master of none. The speed at which technology changes in our field makes it hard to keep up. &lt;/p&gt;\n\n&lt;p&gt;Combined with the competition the op mentioned, I think there is value if programmers banded together to fight for the pay and amenities that we deserve. &lt;/p&gt;\n\n&lt;p&gt;Again, it kind of goes hand in hand with the 10,000 hours rule. Today&amp;#39;s society values niche experts or &amp;quot;monomaths&amp;quot; and gone are the days of the polymath, but I still strive to be a polymath. &lt;/p&gt;\n\n&lt;p&gt;The field is a double edged sword, on one hand, it&amp;#39;s great, and on the other, it&amp;#39;s a giant tedious pain in the ass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7q73s", "score_hidden": false, "stickied": false, "created": 1492126942.0, "created_utc": 1492098142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7vt1z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "waba99", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I used to work for a startup, doing 24 hour days twice a month or more and was only getting paid what a mid-level dev would make.  I didn't have time to see friends or family at nights or on the weekends because we would frequently be called in to work on Saturdays or just not leave on Fridays.  All of this time spent working meant I also had absolutely no time nor motivation to explore programming concepts on the side.  Finally, I decided enough was enough, I wasn't happy at all, and started looking for a new job.\n\nMy second job search was multitudes better than my first and I ended up landing a job at a big tech corporation despite not brushing up on the newest frameworks or relearning algorithmic problems.  The pay is better, my teammates and I work 9 - 5 no weekends, and I feel more productive than ever.\n\nDo yourself a favor and just try taking a weekend off and disconnect from your computer, take up a hobby, learn to meditate or hit the gym.  Chances are you will feel more refreshed and will be able to learn in more capacity.  As an engineer you must be cognizant of your limits in order to avoid burnout.  It's kind of like not working out to hard at the gym so you can go again tomorrow without injury.\n\nAs an anecdote, most of the engineers from India of various levels of experience are very very low skill.  The education that they receive just does not compare to the education available elsewhere and it's definitely something you should not waste your energy on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to work for a startup, doing 24 hour days twice a month or more and was only getting paid what a mid-level dev would make.  I didn&amp;#39;t have time to see friends or family at nights or on the weekends because we would frequently be called in to work on Saturdays or just not leave on Fridays.  All of this time spent working meant I also had absolutely no time nor motivation to explore programming concepts on the side.  Finally, I decided enough was enough, I wasn&amp;#39;t happy at all, and started looking for a new job.&lt;/p&gt;\n\n&lt;p&gt;My second job search was multitudes better than my first and I ended up landing a job at a big tech corporation despite not brushing up on the newest frameworks or relearning algorithmic problems.  The pay is better, my teammates and I work 9 - 5 no weekends, and I feel more productive than ever.&lt;/p&gt;\n\n&lt;p&gt;Do yourself a favor and just try taking a weekend off and disconnect from your computer, take up a hobby, learn to meditate or hit the gym.  Chances are you will feel more refreshed and will be able to learn in more capacity.  As an engineer you must be cognizant of your limits in order to avoid burnout.  It&amp;#39;s kind of like not working out to hard at the gym so you can go again tomorrow without injury.&lt;/p&gt;\n\n&lt;p&gt;As an anecdote, most of the engineers from India of various levels of experience are very very low skill.  The education that they receive just does not compare to the education available elsewhere and it&amp;#39;s definitely something you should not waste your energy on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7vt1z", "score_hidden": false, "stickied": false, "created": 1492132913.0, "created_utc": 1492104113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7xbl5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DanteAtWork", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Where do you want your career to go though? I feel like you are going to burn yourself out if you are trying to be the best in the room at such an accelerated rate. Some people are just naturally really good at this field and it comes to them as second nature and some have to work hard to keep up and move ahead. This isn't to say you won't grow in your career, it just may take longer. \n\nI had a professor that taught some really complicated classes, anything from low level machine language and processor architecture to distributed computing on heterogeneous systems. He told us one day when he just went over a really hard subject, \"Look, if I made this look easy and you are just staring at this like it's the hardest thing you've ever seen, that's fine. I've been doing this for 35 years, both academically and professionally. That's 1.5 times as most of you have been alive. It comes with time and practice and one day you'll make it seem easy too.\" So just keep that in mind. \n\nWith age comes grace in this field usually. Just keep working hard to get your work done and do a little extra research to try to branch out and it'll all be fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do you want your career to go though? I feel like you are going to burn yourself out if you are trying to be the best in the room at such an accelerated rate. Some people are just naturally really good at this field and it comes to them as second nature and some have to work hard to keep up and move ahead. This isn&amp;#39;t to say you won&amp;#39;t grow in your career, it just may take longer. &lt;/p&gt;\n\n&lt;p&gt;I had a professor that taught some really complicated classes, anything from low level machine language and processor architecture to distributed computing on heterogeneous systems. He told us one day when he just went over a really hard subject, &amp;quot;Look, if I made this look easy and you are just staring at this like it&amp;#39;s the hardest thing you&amp;#39;ve ever seen, that&amp;#39;s fine. I&amp;#39;ve been doing this for 35 years, both academically and professionally. That&amp;#39;s 1.5 times as most of you have been alive. It comes with time and practice and one day you&amp;#39;ll make it seem easy too.&amp;quot; So just keep that in mind. &lt;/p&gt;\n\n&lt;p&gt;With age comes grace in this field usually. Just keep working hard to get your work done and do a little extra research to try to branch out and it&amp;#39;ll all be fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7xbl5", "score_hidden": false, "stickied": false, "created": 1492134524.0, "created_utc": 1492105724.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg79995", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ConstipaatedDragon", "parent_id": "t1_dg7388s", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "If you can move to a product management career its not so bad. No one can code forever man...eventually you'll get burned out in 10-15 years. \n\nIn most companies the natural promotion path is to management etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you can move to a product management career its not so bad. No one can code forever man...eventually you&amp;#39;ll get burned out in 10-15 years. &lt;/p&gt;\n\n&lt;p&gt;In most companies the natural promotion path is to management etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg79995", "score_hidden": false, "stickied": false, "created": 1492094844.0, "created_utc": 1492066044.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7388s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bang_ding_ow", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Not taken over my life exactly, but I do have anxiety about advancing my career. I have ended up in a position where I spend less than 50% of my time doing hands-on development. It feels like most decent Java jobs want candidates who have NoSQL experience, are also database experts, and happen to know Angular/ReactJS. I might also be slightly overpaid because I'm not finding much at or above my current salary. I'm currently debating whether it's better to take a hands-on development role and further my technical skills OR pursue more of a technical lead/management role. Or just stay where I'm at. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not taken over my life exactly, but I do have anxiety about advancing my career. I have ended up in a position where I spend less than 50% of my time doing hands-on development. It feels like most decent Java jobs want candidates who have NoSQL experience, are also database experts, and happen to know Angular/ReactJS. I might also be slightly overpaid because I&amp;#39;m not finding much at or above my current salary. I&amp;#39;m currently debating whether it&amp;#39;s better to take a hands-on development role and further my technical skills OR pursue more of a technical lead/management role. Or just stay where I&amp;#39;m at. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7388s", "score_hidden": false, "stickied": false, "created": 1492083593.0, "created_utc": 1492054793.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7lcqj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "terjon", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Get into management then.  People skills tend to not get outdated and also develop fairly easily as long as you have thick skin and are willing to hear people out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get into management then.  People skills tend to not get outdated and also develop fairly easily as long as you have thick skin and are willing to hear people out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7lcqj", "score_hidden": false, "stickied": false, "created": 1492121508.0, "created_utc": 1492092708.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7ypg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Not_Ayn_Rand", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I don't mean to be offensive and correct me if I'm mistaken, but this post sounds quite like what people with eating disorders say about working out and calorie counting. Have you thought about talking to a therapist? If it's making you depressed, it could be a mental health issue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t mean to be offensive and correct me if I&amp;#39;m mistaken, but this post sounds quite like what people with eating disorders say about working out and calorie counting. Have you thought about talking to a therapist? If it&amp;#39;s making you depressed, it could be a mental health issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7ypg9", "score_hidden": false, "stickied": false, "created": 1492135996.0, "created_utc": 1492107196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7yrrw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sesleri", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I don't find any of this realistic at all.  I do not touch programming outside of my work hours lol.  \n\n&gt;they don't have to \"keep their skills sharp\" or \"learn the latest syntax\".\n\nUhh what?  I don't do this outside of work at all and I do fine.\n\n&gt;Whenever my parents ask what I did over the weekend, I always tell them the truth -- that I spent the entire weekend working on some programming projects or puzzles. I turn down many social events because I feel guilty if I didn't spend my free time learning more about programming. \n\nLOL ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t find any of this realistic at all.  I do not touch programming outside of my work hours lol.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;they don&amp;#39;t have to &amp;quot;keep their skills sharp&amp;quot; or &amp;quot;learn the latest syntax&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Uhh what?  I don&amp;#39;t do this outside of work at all and I do fine.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Whenever my parents ask what I did over the weekend, I always tell them the truth -- that I spent the entire weekend working on some programming projects or puzzles. I turn down many social events because I feel guilty if I didn&amp;#39;t spend my free time learning more about programming. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;LOL &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7yrrw", "score_hidden": false, "stickied": false, "created": 1492136064.0, "created_utc": 1492107264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7o6w3", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "librarybro92", "parent_id": "t1_dg767oz", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "Wrong, as I said, only a handful of very specialized specialities have to keep up on current research to the same degree as good software developers keep up with present technologies. The hours and work-life balance are *highly* speciality specific -- anyone with a background in medicine would know that. Also, how does being a medical scribe *not* give me the right to talk about medicine?? Get a clue buddy -- I didn't bother to check your post history like you did mine: it's quite obvious you've never had first-hand experience in the realm of medicine. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wrong, as I said, only a handful of very specialized specialities have to keep up on current research to the same degree as good software developers keep up with present technologies. The hours and work-life balance are &lt;em&gt;highly&lt;/em&gt; speciality specific -- anyone with a background in medicine would know that. Also, how does being a medical scribe &lt;em&gt;not&lt;/em&gt; give me the right to talk about medicine?? Get a clue buddy -- I didn&amp;#39;t bother to check your post history like you did mine: it&amp;#39;s quite obvious you&amp;#39;ve never had first-hand experience in the realm of medicine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7o6w3", "score_hidden": false, "stickied": false, "created": 1492124780.0, "created_utc": 1492095980.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg767oz", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6ujn5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "[deleted]", "edited": 1492060323.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg767oz", "score_hidden": false, "stickied": false, "created": 1492088281.0, "created_utc": 1492059481.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg8g4f7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "librarybro92", "parent_id": "t1_dg7v1c7", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Wow, I'm just so appalled at the incompetence, especially *if* you were a former medical student. So, I've spent &gt; 4 months in six (6) different medical specialties as a scribe/medical assistant actually seeing patient care from beginning to end (with writing the SOAP notes as the cherry on top) and apparently I don't know \"jack shit\"? Yet, if you actually went to medical school and survived to third year, you were quite literally just a glorified version of a pre-med with a white-coat on shadowing. If I don't know \"jack shit\" about patient care, LOL, what makes you think you do?\n\n\nAlso, I'll use one of your phrases, your experience is \"not the norm\". You went to an ACADEMIC institution. Obviously the interns, residents, and fresh attending's use UTD like it's the bible. Go to any public/private institution with seasoned physicians, and I **guarantee** they don't go home to read pages and pages of NEJM. If you know anything about medicine, you'd know seasoned physicians don't have that luxury. The exception to this rule being highly specialized physicians (which if you recall I mentioned in an earlier post): radiation oncologists, oncologists, dermatologists, etc. In your own words, these are \"not the norm\". \n\n&gt;On peds rotation, the pediatricians used AAP guidelines regularly... all of their cases are not the cold (again, you don't know anything about patient management)\n\n\nOkay, they use AAP guidelines, how does this relate to the original point of my post? In regards to the cold/URI comment, you clearly missed *the point*. Pediatricians/GP's do not treat patients with extremely rare or complex diseases at the frequency that you're suggesting. This isn't even the case at academic institutions. Adult GP's, for example, treat mostly CHRONIC conditions, as mentioned in [this study](http://www.mayoclinicproceedings.org/article/S0025-6196(12\\)01036-1/abstract). Some of these conditions are: HTN, HLD, DM, anxiety/bipolar/depression, upper respiratory conditions, and back pain. Hardly sounds like the type of stuff that would require reading countless pages of JAMA on. \n\n\n&gt;irregular and long hours at the hospital + studying and doing research publications + charting in your free time + debt + being on call + all of the recent literature about rampant depression/suicide/mental health issues for doctors makes it much more demanding than CS\n\n\nTo OP: Most of what this guy is saying is true, hence why I mentioned \"medical school + residency\" is tough. Yet, charting, ability to pay off debt, being on call, and having to keep up with literature are HIGHLY specialty specific. The difference between medicine and CS, IMO, is that medicine is VERY front-loaded. You get thrown into the grinder and you're in there for at least 7 years. After you become an attending, depending on your specialty, you can enjoy the good life (with the sacrifice having been losing your 20's). CS, on the other hand, is medium to back-loaded. A fresh 21 year old CS grad with a decent portfolio + contacts will easily get a $70k+ job within a matter of months. They'll constantly have to deal with the stress of staying relevant, but enjoy the good-life for 15-20 years. However, as they say when engineer's hit their 40's, the industry likes to \"take them out and shoot them\". Ageism is a far greater problem in the realm of engineering, and if you pursue this track, be sure to start working on your management skills. There will always be fresh grads who are up to date on the newest technologies, willing to do your job for less. Hence why CS is back-loaded.\n\n\n\n", "edited": 1492128519.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, I&amp;#39;m just so appalled at the incompetence, especially &lt;em&gt;if&lt;/em&gt; you were a former medical student. So, I&amp;#39;ve spent &amp;gt; 4 months in six (6) different medical specialties as a scribe/medical assistant actually seeing patient care from beginning to end (with writing the SOAP notes as the cherry on top) and apparently I don&amp;#39;t know &amp;quot;jack shit&amp;quot;? Yet, if you actually went to medical school and survived to third year, you were quite literally just a glorified version of a pre-med with a white-coat on shadowing. If I don&amp;#39;t know &amp;quot;jack shit&amp;quot; about patient care, LOL, what makes you think you do?&lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;ll use one of your phrases, your experience is &amp;quot;not the norm&amp;quot;. You went to an ACADEMIC institution. Obviously the interns, residents, and fresh attending&amp;#39;s use UTD like it&amp;#39;s the bible. Go to any public/private institution with seasoned physicians, and I &lt;strong&gt;guarantee&lt;/strong&gt; they don&amp;#39;t go home to read pages and pages of NEJM. If you know anything about medicine, you&amp;#39;d know seasoned physicians don&amp;#39;t have that luxury. The exception to this rule being highly specialized physicians (which if you recall I mentioned in an earlier post): radiation oncologists, oncologists, dermatologists, etc. In your own words, these are &amp;quot;not the norm&amp;quot;. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;On peds rotation, the pediatricians used AAP guidelines regularly... all of their cases are not the cold (again, you don&amp;#39;t know anything about patient management)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Okay, they use AAP guidelines, how does this relate to the original point of my post? In regards to the cold/URI comment, you clearly missed &lt;em&gt;the point&lt;/em&gt;. Pediatricians/GP&amp;#39;s do not treat patients with extremely rare or complex diseases at the frequency that you&amp;#39;re suggesting. This isn&amp;#39;t even the case at academic institutions. Adult GP&amp;#39;s, for example, treat mostly CHRONIC conditions, as mentioned in &lt;a href=\"http://www.mayoclinicproceedings.org/article/S0025-6196(12)01036-1/abstract\"&gt;this study&lt;/a&gt;. Some of these conditions are: HTN, HLD, DM, anxiety/bipolar/depression, upper respiratory conditions, and back pain. Hardly sounds like the type of stuff that would require reading countless pages of JAMA on. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;irregular and long hours at the hospital + studying and doing research publications + charting in your free time + debt + being on call + all of the recent literature about rampant depression/suicide/mental health issues for doctors makes it much more demanding than CS&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To OP: Most of what this guy is saying is true, hence why I mentioned &amp;quot;medical school + residency&amp;quot; is tough. Yet, charting, ability to pay off debt, being on call, and having to keep up with literature are HIGHLY specialty specific. The difference between medicine and CS, IMO, is that medicine is VERY front-loaded. You get thrown into the grinder and you&amp;#39;re in there for at least 7 years. After you become an attending, depending on your specialty, you can enjoy the good life (with the sacrifice having been losing your 20&amp;#39;s). CS, on the other hand, is medium to back-loaded. A fresh 21 year old CS grad with a decent portfolio + contacts will easily get a $70k+ job within a matter of months. They&amp;#39;ll constantly have to deal with the stress of staying relevant, but enjoy the good-life for 15-20 years. However, as they say when engineer&amp;#39;s hit their 40&amp;#39;s, the industry likes to &amp;quot;take them out and shoot them&amp;quot;. Ageism is a far greater problem in the realm of engineering, and if you pursue this track, be sure to start working on your management skills. There will always be fresh grads who are up to date on the newest technologies, willing to do your job for less. Hence why CS is back-loaded.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg8g4f7", "score_hidden": false, "stickied": false, "created": 1492156662.0, "created_utc": 1492127862.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7v1c7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7mitx", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "[deleted]", "edited": 1492105099.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7v1c7", "score_hidden": false, "stickied": false, "created": 1492132090.0, "created_utc": 1492103290.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg80yt2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thisathrowawaytbhfam", "parent_id": "t1_dg7qy90", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Medical bootcamp", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Medical bootcamp&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg80yt2", "score_hidden": false, "stickied": false, "created": 1492138402.0, "created_utc": 1492109602.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7s5oo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "librarybro92", "parent_id": "t1_dg7qy90", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Sadly, most schools require you to take the pre-req's: General biology (1 year course), general chemistry (1 year course), organic chemistry (1 year course), general physics (1 year course), and at least Calculus I. Most CS programs cover the math and physics requirement, which would mean you'd have to take biology, chemistry, and organic chemistry. You could enroll in an online or on-campus post-bacc program -- you could easily finish gen chem and gen biology in 1 year (together) while working a 40 hour work week. Organic chemistry is doable alone in your second year. Then you'd have to study for (and do well on) the MCAT (prep time: 1-3 months of solid studying). Add in a 4-6 letters of recommendation, a few volunteering hours, and a few shadowing hours -- you'd be an excellent candidate. Medical schools absolutely love engineers/non-traditional students -- they tend to be more mature, disciplined, and great problem-solvers. As many will tell you, one of the most challenging parts of medical school is jumping through all the hoops just to *get in*. \n\n\nNote: At one of the medical schools I interviewed at, the interviewer was a fourth year medical student and former software engineer -- now he's heading off to a residency in emergency medicine! Definitely is doable, but not a walk in the park.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sadly, most schools require you to take the pre-req&amp;#39;s: General biology (1 year course), general chemistry (1 year course), organic chemistry (1 year course), general physics (1 year course), and at least Calculus I. Most CS programs cover the math and physics requirement, which would mean you&amp;#39;d have to take biology, chemistry, and organic chemistry. You could enroll in an online or on-campus post-bacc program -- you could easily finish gen chem and gen biology in 1 year (together) while working a 40 hour work week. Organic chemistry is doable alone in your second year. Then you&amp;#39;d have to study for (and do well on) the MCAT (prep time: 1-3 months of solid studying). Add in a 4-6 letters of recommendation, a few volunteering hours, and a few shadowing hours -- you&amp;#39;d be an excellent candidate. Medical schools absolutely love engineers/non-traditional students -- they tend to be more mature, disciplined, and great problem-solvers. As many will tell you, one of the most challenging parts of medical school is jumping through all the hoops just to &lt;em&gt;get in&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Note: At one of the medical schools I interviewed at, the interviewer was a fourth year medical student and former software engineer -- now he&amp;#39;s heading off to a residency in emergency medicine! Definitely is doable, but not a walk in the park.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7s5oo", "score_hidden": false, "stickied": false, "created": 1492129029.0, "created_utc": 1492100229.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qy90", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "michaelconnery1985", "parent_id": "t1_dg7mitx", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Hypothetically, how would a switch from being an undergrad in CS --&gt; working full time as a software engineer to pursuing a career in the medical field be? Would one need to go back and redo a bachelor's, or can he go to med school using his CS bachelor's?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hypothetically, how would a switch from being an undergrad in CS --&amp;gt; working full time as a software engineer to pursuing a career in the medical field be? Would one need to go back and redo a bachelor&amp;#39;s, or can he go to med school using his CS bachelor&amp;#39;s?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7qy90", "score_hidden": false, "stickied": false, "created": 1492127745.0, "created_utc": 1492098945.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mitx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "librarybro92", "parent_id": "t1_dg76x8f", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "Haha, this guy says \"You don't know what you're talking about\" when I've worked as a medical scribe/medical assistant for 2+ years and four (4) members of my immediately family are ATTENDING physicians. I forget, what are your credentials to talk about either profession again? \n\n\nI've worked with IM doc's, EM doc's, pediatricians, surgeons (trauma/general), orthopedics, radiation oncologists, AND have shadowed a pathologist and a radiologist. A few of them used UpToDate to determine the most appropriate treatment for (x) disease/ailment, but this is mostly for the odd rare case or two. Why a pediatrician would look up how to treat a cold, for example, on UpToDate makes absolutely no sense. Surgeons, FYI, do not even have the time to read peer-reviewed articles, aside from *perhaps* neurosurgeons on their off days.\n\n\nMore so, the discussion is RELATIVE to CS/Software Development. Are you honestly suggesting treatment modalities change in medicine as rapidly as technology changes in the realm of computer science? Clearly, you have no clue what you're talking about -- don't let the upvotes fool you, this is a **cs**careerquestions, expect bias. ", "edited": 1492096277.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, this guy says &amp;quot;You don&amp;#39;t know what you&amp;#39;re talking about&amp;quot; when I&amp;#39;ve worked as a medical scribe/medical assistant for 2+ years and four (4) members of my immediately family are ATTENDING physicians. I forget, what are your credentials to talk about either profession again? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve worked with IM doc&amp;#39;s, EM doc&amp;#39;s, pediatricians, surgeons (trauma/general), orthopedics, radiation oncologists, AND have shadowed a pathologist and a radiologist. A few of them used UpToDate to determine the most appropriate treatment for (x) disease/ailment, but this is mostly for the odd rare case or two. Why a pediatrician would look up how to treat a cold, for example, on UpToDate makes absolutely no sense. Surgeons, FYI, do not even have the time to read peer-reviewed articles, aside from &lt;em&gt;perhaps&lt;/em&gt; neurosurgeons on their off days.&lt;/p&gt;\n\n&lt;p&gt;More so, the discussion is RELATIVE to CS/Software Development. Are you honestly suggesting treatment modalities change in medicine as rapidly as technology changes in the realm of computer science? Clearly, you have no clue what you&amp;#39;re talking about -- don&amp;#39;t let the upvotes fool you, this is a &lt;strong&gt;cs&lt;/strong&gt;careerquestions, expect bias. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7mitx", "score_hidden": false, "stickied": false, "created": 1492122893.0, "created_utc": 1492094093.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76x8f", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg742q3", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg76x8f", "score_hidden": false, "stickied": false, "created": 1492089549.0, "created_utc": 1492060749.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg742q3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "librarybro92", "parent_id": "t1_dg6yj5e", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "In the beginning (med school + residency) sure. Perhaps also if you enter a super-specialized field like Radiation Oncology (or any form of Oncology for that matter). However, a general practitioner mostly has to know how to manage chronic and/or common diseases. Diabetes and high blood pressure are big ones -- the medications for these haven't changed in decades, and if there's any groundbreaking research, *everyone* will know about it. Aside from 1-2 hours of charting at home almost daily, my siblings (general practitioners) never read journals or the latest research. As I said, the hardest part is surviving medical school + residency, once you're done, it's a walk in the park unless you LITERALLY murder someone in (x) practice. And they're making &gt; $150k.\n\n\nSource: Four doctors in my immediate family. + I have worked as a medical assistant.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the beginning (med school + residency) sure. Perhaps also if you enter a super-specialized field like Radiation Oncology (or any form of Oncology for that matter). However, a general practitioner mostly has to know how to manage chronic and/or common diseases. Diabetes and high blood pressure are big ones -- the medications for these haven&amp;#39;t changed in decades, and if there&amp;#39;s any groundbreaking research, &lt;em&gt;everyone&lt;/em&gt; will know about it. Aside from 1-2 hours of charting at home almost daily, my siblings (general practitioners) never read journals or the latest research. As I said, the hardest part is surviving medical school + residency, once you&amp;#39;re done, it&amp;#39;s a walk in the park unless you LITERALLY murder someone in (x) practice. And they&amp;#39;re making &amp;gt; $150k.&lt;/p&gt;\n\n&lt;p&gt;Source: Four doctors in my immediate family. + I have worked as a medical assistant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg742q3", "score_hidden": false, "stickied": false, "created": 1492084856.0, "created_utc": 1492056056.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7ebbd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Haversoe", "parent_id": "t1_dg72t6f", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt; This sub seems to start becoming obsessed with the idea that a career in software development means you have to devote half your life outside of work to learning.\n\nThere are people on this sub with a bad case of *martyr syndrome*. With such folks, rationality has long since gone out the window.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This sub seems to start becoming obsessed with the idea that a career in software development means you have to devote half your life outside of work to learning.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There are people on this sub with a bad case of &lt;em&gt;martyr syndrome&lt;/em&gt;. With such folks, rationality has long since gone out the window.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7ebbd", "score_hidden": false, "stickied": false, "created": 1492109612.0, "created_utc": 1492080812.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72t6f", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "greenbead", "parent_id": "t1_dg70f7h", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "20 hours a week? Where did you come up with that insane figure?\n\nThis sub seems to be starting to become obsessed with the idea that a career in software development means you *have* to devote half your life outside of work to learning. News flash, that's simply not true. \n\nI work on side projects for maybe a couple hours each week because I enjoy working on them, but I would be perfectly fine if I didn't. And no, I don't work on simple CRUD applications. I'm a backend engineer who works on some pretty complex systems. \n\nAnd the other people I work with? Almost no one works on side projects outside of work. Only a couple of them do. But we are all highly competent developers. \n\nI guess I just have to add this to the list of this sub's vastly incorrect ideas about how the industry works for 95% of software developers. ", "edited": 1492086588.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;20 hours a week? Where did you come up with that insane figure?&lt;/p&gt;\n\n&lt;p&gt;This sub seems to be starting to become obsessed with the idea that a career in software development means you &lt;em&gt;have&lt;/em&gt; to devote half your life outside of work to learning. News flash, that&amp;#39;s simply not true. &lt;/p&gt;\n\n&lt;p&gt;I work on side projects for maybe a couple hours each week because I enjoy working on them, but I would be perfectly fine if I didn&amp;#39;t. And no, I don&amp;#39;t work on simple CRUD applications. I&amp;#39;m a backend engineer who works on some pretty complex systems. &lt;/p&gt;\n\n&lt;p&gt;And the other people I work with? Almost no one works on side projects outside of work. Only a couple of them do. But we are all highly competent developers. &lt;/p&gt;\n\n&lt;p&gt;I guess I just have to add this to the list of this sub&amp;#39;s vastly incorrect ideas about how the industry works for 95% of software developers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg72t6f", "score_hidden": false, "stickied": false, "created": 1492082984.0, "created_utc": 1492054184.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7z3pu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sesleri", "parent_id": "t1_dg70f7h", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt; vs. a programmer putting in 20 hours per week keeping up with changing tech\n\nwtf are you even talking about?  Such nonsense.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;vs. a programmer putting in 20 hours per week keeping up with changing tech&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;wtf are you even talking about?  Such nonsense.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7z3pu", "score_hidden": false, "stickied": false, "created": 1492136419.0, "created_utc": 1492107619.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70f7h", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6yj5e", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg70f7h", "score_hidden": false, "stickied": false, "created": 1492079774.0, "created_utc": 1492050974.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yj5e", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "PsylentKnight", "parent_id": "t1_dg6ujn5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "As I understand it doctors have to read tons of journals to keep up to date on the latest research and medicines.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As I understand it doctors have to read tons of journals to keep up to date on the latest research and medicines.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg6yj5e", "score_hidden": false, "stickied": false, "created": 1492077415.0, "created_utc": 1492048615.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7vrcy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Haversoe", "parent_id": "t1_dg7mse1", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt; I think it's a mistake to suggest \"cut-throat competition\", \"massive sacrifice\", and \"inhuman workloads\" are only present in medicine. \n\nI agree completely and didn't mean to imply otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think it&amp;#39;s a mistake to suggest &amp;quot;cut-throat competition&amp;quot;, &amp;quot;massive sacrifice&amp;quot;, and &amp;quot;inhuman workloads&amp;quot; are only present in medicine. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree completely and didn&amp;#39;t mean to imply otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7vrcy", "score_hidden": false, "stickied": false, "created": 1492132865.0, "created_utc": 1492104065.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mse1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "librarybro92", "parent_id": "t1_dg7eh1x", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Could make the argument that people in SE did the same to get into nice cushy positions at the Big 4's. I think it's a mistake to suggest \"cut-throat competition\", \"massive sacrifice\", and \"inhuman workloads\" are only present in medicine. You can find those two attributes in virtually every profession, from finance to technology to medicine. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could make the argument that people in SE did the same to get into nice cushy positions at the Big 4&amp;#39;s. I think it&amp;#39;s a mistake to suggest &amp;quot;cut-throat competition&amp;quot;, &amp;quot;massive sacrifice&amp;quot;, and &amp;quot;inhuman workloads&amp;quot; are only present in medicine. You can find those two attributes in virtually every profession, from finance to technology to medicine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7mse1", "score_hidden": false, "stickied": false, "created": 1492123202.0, "created_utc": 1492094402.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7eh1x", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Haversoe", "parent_id": "t1_dg77ryk", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "OP sees a fella on third base and concludes that he must have just magically appeared there. There's no notion at all of the massive sacrifice, cut-throat competition and inhuman workloads (and indignities) suffered through to get there.\n\nAnd, by golly, *Daddy's a doc and I've never seen Daddy do shit,* ergo doctors have it easy. It's really hard to believe someone with a child's understanding of inference could excel at a logical task like CS.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP sees a fella on third base and concludes that he must have just magically appeared there. There&amp;#39;s no notion at all of the massive sacrifice, cut-throat competition and inhuman workloads (and indignities) suffered through to get there.&lt;/p&gt;\n\n&lt;p&gt;And, by golly, &lt;em&gt;Daddy&amp;#39;s a doc and I&amp;#39;ve never seen Daddy do shit,&lt;/em&gt; ergo doctors have it easy. It&amp;#39;s really hard to believe someone with a child&amp;#39;s understanding of inference could excel at a logical task like CS.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7eh1x", "score_hidden": false, "stickied": false, "created": 1492110041.0, "created_utc": 1492081241.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7im0y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "henry589", "parent_id": "t1_dg77ryk", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Yea becoming a doctor is way harder to get into. I rather do programming.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea becoming a doctor is way harder to get into. I rather do programming.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7im0y", "score_hidden": false, "stickied": false, "created": 1492117871.0, "created_utc": 1492089071.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7naj5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "librarybro92", "parent_id": "t1_dg77ryk", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Then what is \"the rule\"? You keep mentioning how (x) speciality is \"not the norm\", which apparently is every speciality anyone mentions. Then what is \"the norm\"? I'll tell you, it's primary care. Pediatricians, family medicine, and psychiatry all fit into that category. Guess what, a good selection of them have stable 7/8/9 to 5 jobs. If they don't have the luxury of scribes, add in an hour or two to that for charting. Aside from pediatrics, the latter two typically command salaries ranging from $150k to $250k. If they make partner, multiply those values by 2-3. Not a bad lifestyle for \"the norm\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then what is &amp;quot;the rule&amp;quot;? You keep mentioning how (x) speciality is &amp;quot;not the norm&amp;quot;, which apparently is every speciality anyone mentions. Then what is &amp;quot;the norm&amp;quot;? I&amp;#39;ll tell you, it&amp;#39;s primary care. Pediatricians, family medicine, and psychiatry all fit into that category. Guess what, a good selection of them have stable 7/8/9 to 5 jobs. If they don&amp;#39;t have the luxury of scribes, add in an hour or two to that for charting. Aside from pediatrics, the latter two typically command salaries ranging from $150k to $250k. If they make partner, multiply those values by 2-3. Not a bad lifestyle for &amp;quot;the norm&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7naj5", "score_hidden": false, "stickied": false, "created": 1492123779.0, "created_utc": 1492094979.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77ryk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg77hig", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "[deleted]", "edited": 1492104835.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg77ryk", "score_hidden": false, "stickied": false, "created": 1492091321.0, "created_utc": 1492062521.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77hig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mscorlib", "parent_id": "t1_dg77602", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "Huh? My dad is a doc and has tons of time (and $$$). All he has to do to keep his license is a take a test every 5 years, which he crams for the night before. I know a dermatologist who only works 3 days per week.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh? My dad is a doc and has tons of time (and $$$). All he has to do to keep his license is a take a test every 5 years, which he crams for the night before. I know a dermatologist who only works 3 days per week.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg77hig", "score_hidden": false, "stickied": false, "created": 1492090698.0, "created_utc": 1492061898.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77602", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6vh01", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "[deleted]", "edited": 1492061591.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg77602", "score_hidden": false, "stickied": false, "created": 1492090029.0, "created_utc": 1492061229.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vh01", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "mscorlib", "parent_id": "t1_dg6ujn5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "Yes, if I had a time machine I would highly consider a career in medicine. Nowadays there are a lot of six-figure non-M.D. jobs in the medical industry (Nurse Practicioner, Physician's Assistant, Wound Specialist, etc.). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, if I had a time machine I would highly consider a career in medicine. Nowadays there are a lot of six-figure non-M.D. jobs in the medical industry (Nurse Practicioner, Physician&amp;#39;s Assistant, Wound Specialist, etc.). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg6vh01", "score_hidden": false, "stickied": false, "created": 1492073627.0, "created_utc": 1492044827.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ujn5", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "librarybro92", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "Posts like these really make me think I *should* go to medical school. IMO, programming *can* be easier once you get your foot in the door (i.e., your first job) and transition into some form of government work -- I hear they're the most stable and pretty slow on adding in new technology, but you'll mostly be doing odd CRUD work. On the other hand, medicine = a hectic lifestyle for 7+ years (med school + residency), but for the most part, once you're done, you are done. Sure, you have to keep up with content due to re-certifications, but usually, you can get caught up on these things with a weekend course. Programming, on the other hand, seems to move so quickly such that there's some new fad/language everyone's using every 2 years. I'm curious OP, would you have considered a career in medicine?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Posts like these really make me think I &lt;em&gt;should&lt;/em&gt; go to medical school. IMO, programming &lt;em&gt;can&lt;/em&gt; be easier once you get your foot in the door (i.e., your first job) and transition into some form of government work -- I hear they&amp;#39;re the most stable and pretty slow on adding in new technology, but you&amp;#39;ll mostly be doing odd CRUD work. On the other hand, medicine = a hectic lifestyle for 7+ years (med school + residency), but for the most part, once you&amp;#39;re done, you are done. Sure, you have to keep up with content due to re-certifications, but usually, you can get caught up on these things with a weekend course. Programming, on the other hand, seems to move so quickly such that there&amp;#39;s some new fad/language everyone&amp;#39;s using every 2 years. I&amp;#39;m curious OP, would you have considered a career in medicine?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg6ujn5", "score_hidden": false, "stickied": false, "created": 1492072543.0, "created_utc": 1492043743.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg79aaw", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "ConstipaatedDragon", "parent_id": "t1_dg77pn9", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Same. The plan is to somehow a million dollars in a decade and hit the road.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same. The plan is to somehow a million dollars in a decade and hit the road.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg79aaw", "score_hidden": false, "stickied": false, "created": 1492094917.0, "created_utc": 1492066117.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77pn9", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "RealTalkOnly", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 1, "body": "You're right, it is an arms race, and as you're probably aware all this talk of the so called \"tech talent shortage\" is utter bs.\n\nAt this point I don't care about keeping up to date since I'm not actively on the job market and I know that anything hot now will become obsolete in 18 months. I'm just stashing my money away and planning to take a looong break after my current job. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right, it is an arms race, and as you&amp;#39;re probably aware all this talk of the so called &amp;quot;tech talent shortage&amp;quot; is utter bs.&lt;/p&gt;\n\n&lt;p&gt;At this point I don&amp;#39;t care about keeping up to date since I&amp;#39;m not actively on the job market and I know that anything hot now will become obsolete in 18 months. I&amp;#39;m just stashing my money away and planning to take a looong break after my current job. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg77pn9", "score_hidden": false, "stickied": false, "created": 1492091187.0, "created_utc": 1492062387.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7sd75", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "yuga_d", "parent_id": "t1_dg7hyym", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "The level of ridiculous is getting insane in this sub.\n\nMEDICINE IS LESS STRESSFUL THAN CS?\n\nPHARMACY IS EASIER THAN CS?\n\nWTF is going on here? Pharmacists need a chemistry or biology degree and 4 more years of school. If you think you're so smart, why don't you cruise through O chem 1 and 2 and physical chem for chemists and then advanced pharmacology for 4 years so you can \"chill\" at Walgreens for $120k a year?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The level of ridiculous is getting insane in this sub.&lt;/p&gt;\n\n&lt;p&gt;MEDICINE IS LESS STRESSFUL THAN CS?&lt;/p&gt;\n\n&lt;p&gt;PHARMACY IS EASIER THAN CS?&lt;/p&gt;\n\n&lt;p&gt;WTF is going on here? Pharmacists need a chemistry or biology degree and 4 more years of school. If you think you&amp;#39;re so smart, why don&amp;#39;t you cruise through O chem 1 and 2 and physical chem for chemists and then advanced pharmacology for 4 years so you can &amp;quot;chill&amp;quot; at Walgreens for $120k a year?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7sd75", "score_hidden": false, "stickied": false, "created": 1492129250.0, "created_utc": 1492100450.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7i4rp", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "zagbag", "parent_id": "t1_dg7i2yn", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Great, thanks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great, thanks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7i4rp", "score_hidden": false, "stickied": false, "created": 1492117156.0, "created_utc": 1492088356.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7i2yn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "614GoBucks", "parent_id": "t1_dg7i18j", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Lol alright.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol alright.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7i2yn", "score_hidden": false, "stickied": false, "created": 1492117079.0, "created_utc": 1492088279.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7i18j", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "zagbag", "parent_id": "t1_dg7hyym", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt;  Their schooling is harder\n\n\nNo, it isn't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Their schooling is harder&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, it isn&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7i18j", "score_hidden": false, "stickied": false, "created": 1492117007.0, "created_utc": 1492088207.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7hyym", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "614GoBucks", "parent_id": "t1_dg7f87d", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Whaaaaat? Go into their field if it's so easy. Their schooling is harder than computer science, that's for sure. They get rewarded for that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whaaaaat? Go into their field if it&amp;#39;s so easy. Their schooling is harder than computer science, that&amp;#39;s for sure. They get rewarded for that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7hyym", "score_hidden": false, "stickied": false, "created": 1492116912.0, "created_utc": 1492088112.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg7yxbe", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Sesleri", "parent_id": "t1_dg7wcym", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "&gt;They take boxes off shelves, they diagnose the common cold and make absolute bank doing so.\n\nI listen to a standup call, spend some time tinkering with code, drink coffee, browse reddit, go home and make absolute bank doing so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;They take boxes off shelves, they diagnose the common cold and make absolute bank doing so.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I listen to a standup call, spend some time tinkering with code, drink coffee, browse reddit, go home and make absolute bank doing so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7yxbe", "score_hidden": false, "stickied": false, "created": 1492136227.0, "created_utc": 1492107427.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_651zt5", "likes": null, "replies": "", "user_reports": [], "id": "dg8hv4k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dukelu", "parent_id": "t1_dg7wcym", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "The situation might be different from places to places. From what I observed, retail pharmacists have to deal with long work hours and shitty customers all the time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The situation might be different from places to places. From what I observed, retail pharmacists have to deal with long work hours and shitty customers all the time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg8hv4k", "score_hidden": false, "stickied": false, "created": 1492159068.0, "created_utc": 1492130268.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7wcym", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "zagbag", "parent_id": "t1_dg7ti03", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "This is all very anecdotal but I befriended a few of them from their time in college through to their working life. They take boxes off shelves, they diagnose the common cold and make absolute bank doing so. \nPerhaps your jurisdiction has differing pressures but the majority of pharmacists here live charmed lives and fucking know it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is all very anecdotal but I befriended a few of them from their time in college through to their working life. They take boxes off shelves, they diagnose the common cold and make absolute bank doing so. \nPerhaps your jurisdiction has differing pressures but the majority of pharmacists here live charmed lives and fucking know it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7wcym", "score_hidden": false, "stickied": false, "created": 1492133501.0, "created_utc": 1492104701.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ti03", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dukelu", "parent_id": "t1_dg7f87d", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Lol, pharmacists are with zero pressure jobs? You are so out of touch that it is ridiculous. Go talk to some pharmacists and see what they think about their job. Smh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol, pharmacists are with zero pressure jobs? You are so out of touch that it is ridiculous. Go talk to some pharmacists and see what they think about their job. Smh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7ti03", "score_hidden": false, "stickied": false, "created": 1492130465.0, "created_utc": 1492101665.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7f87d", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "zagbag", "parent_id": "t3_651zt5", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "I hate professionals like pharmacists with zero pressure jobs but high pay. \nReally makes me sick given the work I've put in just to stay relevant. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate professionals like pharmacists with zero pressure jobs but high pay. \nReally makes me sick given the work I&amp;#39;ve put in just to stay relevant. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dg7f87d", "score_hidden": false, "stickied": false, "created": 1492111861.0, "created_utc": 1492083061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]