[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "cscareerquestions", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello &lt;a href=\"/r/cscareerquestions\"&gt;/r/cscareerquestions&lt;/a&gt;!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry if this ends up being a long post, I&amp;#39;ll try to keep it short. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Disclaimer before we continue: I know this kind of question is, for the most part, off-topic. If some moderator feel like it shouldn&amp;#39;t be here please delete and excuse me.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;A little bit of background, I started university like ten years ago (in Argentina it&amp;#39;d be something like Software Engineer/Scientist Bs) but I dropped out after two years because of strictly personal and health related issues.&lt;/p&gt;\n\n&lt;p&gt;Long story short, after dropping out I managed to get a job as a QA tester and  I&amp;#39;ve been doing the same for like five, six-ish years. Finally I got bored of it. I&amp;#39;d love to &lt;strong&gt;make&lt;/strong&gt; stuff, not test it. &lt;/p&gt;\n\n&lt;p&gt;So, I started some online course. Then I started another one. Then I read books. Then I started some Udacity course. I went from Java, to Python, to Java for Android again and I&amp;#39;m now finishing the first (sincerely easy) FreeCodeCamp projects.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if it&amp;#39;s lack of motivation or maybe I&amp;#39;m too stupid to understand all these but I can&amp;#39;t pass basic algorithms and structures. I don&amp;#39;t know how to put all these things together into a cohesive projecct/program/app/game/whatever. I made some Python scripts (to download torrents, to organize some folder), but they look &lt;strong&gt;like hacks more than cohesive pieces of code&lt;/strong&gt;. I made a few Android apps, they look terrible and I&amp;#39;m not sure if they&amp;#39;re efficient in &lt;strong&gt;any&lt;/strong&gt; way (I&amp;#39;m extremely worried about the hack-y way I write code). &lt;/p&gt;\n\n&lt;p&gt;I think my main problem is that I don&amp;#39;t really know &lt;strong&gt;what do I want to do&lt;/strong&gt;. One day  I have a great idea for a videogame so I fire up Unity (ok, that&amp;#39;s not programming per-se but you get it). Another day I feel like writing a Python script (I like Python but I can&amp;#39;t really explain why). Another day &amp;quot;hey why not a webpage that cross-reference movies so I can find what to watch next&amp;quot; (that&amp;#39;d be like an impossible project for me right now but I&amp;#39;d start to just realize it).&lt;/p&gt;\n\n&lt;p&gt;Now that I&amp;#39;m working on FreeCodeCamp projects I feel a bit more empowered by the fact that every time I edit the CSS I &lt;strong&gt;see&lt;/strong&gt; a result. But, stupid excuse ahead, I don&amp;#39;t really feel passion about designing web-pages. I prefer desktop apps for whatever reason I can&amp;#39;t put my finger on.&lt;/p&gt;\n\n&lt;p&gt;So, &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr:\n* What do I do to finish projects? How do I go from &amp;quot;I kinda know bubble sort&amp;quot; to &amp;quot;hey look at this cool project I&amp;#39;m working on&amp;quot;? \n* What to do when you don&amp;#39;t really know what to do? How did you decide between web and desktop, front-end vs back-end, Java vs C++, etc.?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Thanks and sorry again if it&amp;#39;s the kind of question that don&amp;#39;t belong here. Stay safe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello /r/cscareerquestions!\n\nI'm sorry if this ends up being a long post, I'll try to keep it short. \n\n*Disclaimer before we continue: I know this kind of question is, for the most part, off-topic. If some moderator feel like it shouldn't be here please delete and excuse me.*\n\nA little bit of background, I started university like ten years ago (in Argentina it'd be something like Software Engineer/Scientist Bs) but I dropped out after two years because of strictly personal and health related issues.\n\nLong story short, after dropping out I managed to get a job as a QA tester and  I've been doing the same for like five, six-ish years. Finally I got bored of it. I'd love to **make** stuff, not test it. \n\nSo, I started some online course. Then I started another one. Then I read books. Then I started some Udacity course. I went from Java, to Python, to Java for Android again and I'm now finishing the first (sincerely easy) FreeCodeCamp projects.\n\nI don't know if it's lack of motivation or maybe I'm too stupid to understand all these but I can't pass basic algorithms and structures. I don't know how to put all these things together into a cohesive projecct/program/app/game/whatever. I made some Python scripts (to download torrents, to organize some folder), but they look **like hacks more than cohesive pieces of code**. I made a few Android apps, they look terrible and I'm not sure if they're efficient in **any** way (I'm extremely worried about the hack-y way I write code). \n\nI think my main problem is that I don't really know **what do I want to do**. One day  I have a great idea for a videogame so I fire up Unity (ok, that's not programming per-se but you get it). Another day I feel like writing a Python script (I like Python but I can't really explain why). Another day \"hey why not a webpage that cross-reference movies so I can find what to watch next\" (that'd be like an impossible project for me right now but I'd start to just realize it).\n\nNow that I'm working on FreeCodeCamp projects I feel a bit more empowered by the fact that every time I edit the CSS I **see** a result. But, stupid excuse ahead, I don't really feel passion about designing web-pages. I prefer desktop apps for whatever reason I can't put my finger on.\n\nSo, \n\n**tl;dr:\n* What do I do to finish projects? How do I go from \"I kinda know bubble sort\" to \"hey look at this cool project I'm working on\"? \n* What to do when you don't really know what to do? How did you decide between web and desktop, front-end vs back-end, Java vs C++, etc.?**\n\nThanks and sorry again if it's the kind of question that don't belong here. Stay safe.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65orng", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "AirieFenix", "saved": false, "mod_reports": [], "name": "t3_65orng", "subreddit_name_prefixed": "r/cscareerquestions", "approved_by": null, "over_18": false, "domain": "self.cscareerquestions", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sdpm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/cscareerquestions/comments/65orng/career_advise_qa_who_is_lost_learning_to_code_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492372679.0, "url": "https://www.reddit.com/r/cscareerquestions/comments/65orng/career_advise_qa_who_is_lost_learning_to_code_and/", "author_flair_text": null, "quarantine": false, "title": "[Career advise] QA who is lost learning to code and don't know how to level up to a hirable/decent level", "created_utc": 1492343879.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_65orng", "likes": null, "replies": "", "user_reports": [], "id": "dgc2ypk", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "CarlsVolta", "parent_id": "t3_65orng", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "A really good option for you could be to move into a job that allows you to learn to automate testing as part of the job. Python is used by some companies. It seems that people who want to test and can automate are pretty sought after, and you'll get some valuable experience on the job and likely some support from more experienced devs. Plus you'll be getting the job largely on the basis of your existing experience and getting to improve on something you'd prefer to do.\n\nTesters.io is a good Slack group of testers and is great for automation support.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A really good option for you could be to move into a job that allows you to learn to automate testing as part of the job. Python is used by some companies. It seems that people who want to test and can automate are pretty sought after, and you&amp;#39;ll get some valuable experience on the job and likely some support from more experienced devs. Plus you&amp;#39;ll be getting the job largely on the basis of your existing experience and getting to improve on something you&amp;#39;d prefer to do.&lt;/p&gt;\n\n&lt;p&gt;Testers.io is a good Slack group of testers and is great for automation support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dgc2ypk", "score_hidden": false, "stickied": false, "created": 1492381708.0, "created_utc": 1492352908.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_65orng", "likes": null, "replies": "", "user_reports": [], "id": "dgcb7ns", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "qa_otto", "parent_id": "t3_65orng", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Everything starts out hacky until you need the code to do a lot more. Most code snippets are one offs and are just to accomplish a quick task. Once something becomes business critical then it needs to be re-written to be maintainable and testable. \n\nLook for opportunities to automate things at work and become familiar with writing unit tests.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything starts out hacky until you need the code to do a lot more. Most code snippets are one offs and are just to accomplish a quick task. Once something becomes business critical then it needs to be re-written to be maintainable and testable. &lt;/p&gt;\n\n&lt;p&gt;Look for opportunities to automate things at work and become familiar with writing unit tests.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dgcb7ns", "score_hidden": false, "stickied": false, "created": 1492393045.0, "created_utc": 1492364245.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdpm", "removal_reason": null, "link_id": "t3_65orng", "likes": null, "replies": "", "user_reports": [], "id": "dgcg76r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MajesticBosom", "parent_id": "t3_65orng", "subreddit_name_prefixed": "r/cscareerquestions", "controversiality": 0, "body": "Check out the Big Nerd Ranch's Guide to Android Programming. Also Python Crash Course. Follow through all the projects in these textbooks and you'll have a good foundation for making small projects with both.  This is just how I learned, not sure if this is the level of depth you're looking for or what your level of experience is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check out the Big Nerd Ranch&amp;#39;s Guide to Android Programming. Also Python Crash Course. Follow through all the projects in these textbooks and you&amp;#39;ll have a good foundation for making small projects with both.  This is just how I learned, not sure if this is the level of depth you&amp;#39;re looking for or what your level of experience is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "cscareerquestions", "name": "t1_dgcg76r", "score_hidden": false, "stickied": false, "created": 1492399682.0, "created_utc": 1492370882.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]