[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "EatCheapAndHealthy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m at my lowest point rn and I constantly feel drained and anxious, partially cause of my SHIT diet and me being a picky eater doesn&amp;#39;t help.... No one alround me wants to help/and or they all eat just as bad and I just feel stuck and need advice :(((  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm at my lowest point rn and I constantly feel drained and anxious, partially cause of my SHIT diet and me being a picky eater doesn't help.... No one alround me wants to help/and or they all eat just as bad and I just feel stuck and need advice :(((  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650grl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "Blacc_dad", "saved": false, "mod_reports": [], "name": "t3_650grl", "subreddit_name_prefixed": "r/EatCheapAndHealthy", "approved_by": null, "over_18": false, "domain": "self.EatCheapAndHealthy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vvpi", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/EatCheapAndHealthy/comments/650grl/need_help_introducing_fruits_and_vegetables_into/", "num_reports": null, "locked": false, "stickied": false, "created": 1492054827.0, "url": "https://www.reddit.com/r/EatCheapAndHealthy/comments/650grl/need_help_introducing_fruits_and_vegetables_into/", "author_flair_text": null, "quarantine": false, "title": "Need help introducing fruits and vegetables into my diet....", "created_utc": 1492026027.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vvpi", "removal_reason": null, "link_id": "t3_650grl", "likes": null, "replies": "", "user_reports": [], "id": "dg6jnrk", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RagaKat", "parent_id": "t3_650grl", "subreddit_name_prefixed": "r/EatCheapAndHealthy", "controversiality": 0, "body": "Can't help you too much because we don't know in what ways you are picky. \n\nStep one would be to find a way to enjoy cooking, if you don't already. Making everything at home and avoiding processed foods is a good place to start. Then just try to gradually work more and more veggies into your meals. Making things like chili, stir fry, soups, quiches, casseroles are good ways to sneak them in. Don't make them the focus of the meal but try to add more and more until you actually enjoy them. \n\nAlso just try cooking them different ways. Even if you're picky, you don't know what you like until you try it. Roasting, grilling, boiling, sauteing. \n\nSome ways you could try cooking them that might make them more appealing to you: \n\nRoast green beans or asparagus with olive oil, some garlic, and then top with parmesan. Roast brussels sprouts with balsamic. Wrap a small handful of green beans in prosciutto and then bake it. Make kale chips- coating kale with olive oil and then whatever spices or flavors you want (I like garlic and parmesan) and then baking them or putting it in the dehydrator. Saute some carrots in a honey glaze. Make a loaded cauliflower chowder. Stuffed zucchinis, stuffed peppers, stuffed mushrooms. Eggplant parmesan or eggplant lasagna. Fajitas and go heavy on the peppers and onions. Smoothies are a good way to work in both fruit and veggies. \n\nIf you're super picky to the point where you haven't even tried most veggies and fruit, what you could do is pick one each week, find a recipe you think looks good that incorporates it, and try it out to see how you feel about it. Then eventually you'll find what you like and what you don't and can focus on the ones you like. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t help you too much because we don&amp;#39;t know in what ways you are picky. &lt;/p&gt;\n\n&lt;p&gt;Step one would be to find a way to enjoy cooking, if you don&amp;#39;t already. Making everything at home and avoiding processed foods is a good place to start. Then just try to gradually work more and more veggies into your meals. Making things like chili, stir fry, soups, quiches, casseroles are good ways to sneak them in. Don&amp;#39;t make them the focus of the meal but try to add more and more until you actually enjoy them. &lt;/p&gt;\n\n&lt;p&gt;Also just try cooking them different ways. Even if you&amp;#39;re picky, you don&amp;#39;t know what you like until you try it. Roasting, grilling, boiling, sauteing. &lt;/p&gt;\n\n&lt;p&gt;Some ways you could try cooking them that might make them more appealing to you: &lt;/p&gt;\n\n&lt;p&gt;Roast green beans or asparagus with olive oil, some garlic, and then top with parmesan. Roast brussels sprouts with balsamic. Wrap a small handful of green beans in prosciutto and then bake it. Make kale chips- coating kale with olive oil and then whatever spices or flavors you want (I like garlic and parmesan) and then baking them or putting it in the dehydrator. Saute some carrots in a honey glaze. Make a loaded cauliflower chowder. Stuffed zucchinis, stuffed peppers, stuffed mushrooms. Eggplant parmesan or eggplant lasagna. Fajitas and go heavy on the peppers and onions. Smoothies are a good way to work in both fruit and veggies. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re super picky to the point where you haven&amp;#39;t even tried most veggies and fruit, what you could do is pick one each week, find a recipe you think looks good that incorporates it, and try it out to see how you feel about it. Then eventually you&amp;#39;ll find what you like and what you don&amp;#39;t and can focus on the ones you like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EatCheapAndHealthy", "name": "t1_dg6jnrk", "score_hidden": false, "stickied": false, "created": 1492059310.0, "created_utc": 1492030510.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vvpi", "removal_reason": null, "link_id": "t3_650grl", "likes": null, "replies": "", "user_reports": [], "id": "dg6impf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jimbagarooatron", "parent_id": "t3_650grl", "subreddit_name_prefixed": "r/EatCheapAndHealthy", "controversiality": 0, "body": "Learn to love fruit, veg, and cooking. Doing this makes this substantially easier and you'll be able to make food a focal point of your day instead of juat a quick comfort. Have anything you want but make sure you cook or make it. I know you said you're a picky eater but there are all kinds of fantastic flavors out there and you're bound to like some. \n\nWhen it comes to fruit just find your favorites and keep them handy. I love having a tub of grapes and blueberries in the fridge and having some in the afternoon. They're cool, sweet, and really refreshing on a warm day. Also strawberries, Greek yogurt, and honey makes a great and filling dessert. Bananas are filling and easy to keep around. \n\nWhen it comes to veg I find this even easier. Having a sandwich or wrap? Add some spinach to it. Making pasta for dinner? Make your own sauce with peppers, onion, and mushrooms. Sauces are super easy. One carton pasasata, seasoning, and veg. Add it all to a pot and simmer for a bit. Add the cooked pasta and you're away. Fancy something comforting? Cut some carrots and a sweet potato into wedges. Toss in some oil, rosemary, and salt and pepper. Place on a tray and put in the oven till crispy (20-30 mins). \n\nCooking has become so easy and something I love doing. Just having the ingredients to had is usually half the battle and the other half is starting. I recommend putting on some music while cooking. It helps me to relax and enjoy it instead of seeing it as a means to an end. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Learn to love fruit, veg, and cooking. Doing this makes this substantially easier and you&amp;#39;ll be able to make food a focal point of your day instead of juat a quick comfort. Have anything you want but make sure you cook or make it. I know you said you&amp;#39;re a picky eater but there are all kinds of fantastic flavors out there and you&amp;#39;re bound to like some. &lt;/p&gt;\n\n&lt;p&gt;When it comes to fruit just find your favorites and keep them handy. I love having a tub of grapes and blueberries in the fridge and having some in the afternoon. They&amp;#39;re cool, sweet, and really refreshing on a warm day. Also strawberries, Greek yogurt, and honey makes a great and filling dessert. Bananas are filling and easy to keep around. &lt;/p&gt;\n\n&lt;p&gt;When it comes to veg I find this even easier. Having a sandwich or wrap? Add some spinach to it. Making pasta for dinner? Make your own sauce with peppers, onion, and mushrooms. Sauces are super easy. One carton pasasata, seasoning, and veg. Add it all to a pot and simmer for a bit. Add the cooked pasta and you&amp;#39;re away. Fancy something comforting? Cut some carrots and a sweet potato into wedges. Toss in some oil, rosemary, and salt and pepper. Place on a tray and put in the oven till crispy (20-30 mins). &lt;/p&gt;\n\n&lt;p&gt;Cooking has become so easy and something I love doing. Just having the ingredients to had is usually half the battle and the other half is starting. I recommend putting on some music while cooking. It helps me to relax and enjoy it instead of seeing it as a means to an end. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EatCheapAndHealthy", "name": "t1_dg6impf", "score_hidden": false, "stickied": false, "created": 1492058218.0, "created_utc": 1492029418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vvpi", "removal_reason": null, "link_id": "t3_650grl", "likes": null, "replies": "", "user_reports": [], "id": "dg6sjsz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lets_Call_It_Wit", "parent_id": "t3_650grl", "subreddit_name_prefixed": "r/EatCheapAndHealthy", "controversiality": 0, "body": "I'm not sure if this is the advice you're looking for, but exposure is a good way to force it. Keep trying things in different ways until you find a preparation you like, and then build from there.\n\nExample: I used to hate mushrooms. When I became a vegetarian, I figured I was going to need to learn to coexist with them, as they are in damn near every restaurant veggie friendly meal. So I started trying hem in different ways. I figured out that I liked them when ground as a part of a veggie burger. That helped me get used to the taste. From there, I worked them into things like pasta sauce, ragu, and hash.\n\n4 years later and I like them! They aren't like, my favorite food, but I enjoy eating things with them in them now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if this is the advice you&amp;#39;re looking for, but exposure is a good way to force it. Keep trying things in different ways until you find a preparation you like, and then build from there.&lt;/p&gt;\n\n&lt;p&gt;Example: I used to hate mushrooms. When I became a vegetarian, I figured I was going to need to learn to coexist with them, as they are in damn near every restaurant veggie friendly meal. So I started trying hem in different ways. I figured out that I liked them when ground as a part of a veggie burger. That helped me get used to the taste. From there, I worked them into things like pasta sauce, ragu, and hash.&lt;/p&gt;\n\n&lt;p&gt;4 years later and I like them! They aren&amp;#39;t like, my favorite food, but I enjoy eating things with them in them now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EatCheapAndHealthy", "name": "t1_dg6sjsz", "score_hidden": false, "stickied": false, "created": 1492070092.0, "created_utc": 1492041292.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vvpi", "removal_reason": null, "link_id": "t3_650grl", "likes": null, "replies": "", "user_reports": [], "id": "dg7pifo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pajamakitten", "parent_id": "t3_650grl", "subreddit_name_prefixed": "r/EatCheapAndHealthy", "controversiality": 0, "body": "I was a picky eater and I got over it by simply cooking vegetables and eating them. You don't have to polish off a whole plate but you need to try a few bites and do that several times to acquire a taste for new foods. It's a marathon, not a sprint. In the meantime you could try smoothies, soups and blending up vegetables in a pasta sauce.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was a picky eater and I got over it by simply cooking vegetables and eating them. You don&amp;#39;t have to polish off a whole plate but you need to try a few bites and do that several times to acquire a taste for new foods. It&amp;#39;s a marathon, not a sprint. In the meantime you could try smoothies, soups and blending up vegetables in a pasta sauce.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EatCheapAndHealthy", "name": "t1_dg7pifo", "score_hidden": false, "stickied": false, "created": 1492126214.0, "created_utc": 1492097414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vvpi", "removal_reason": null, "link_id": "t3_650grl", "likes": null, "replies": "", "user_reports": [], "id": "dg9af6w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "greatleveler", "parent_id": "t3_650grl", "subreddit_name_prefixed": "r/EatCheapAndHealthy", "controversiality": 0, "body": "Most people hate vegetables because they don't give themselves permission to make them taste good by adding fats, acids, spices and salt. \n\nTry a tablespoon of butter in a bowl of broccoli with salt and see if you like it. \n\nBake a sweet potato and drop a thick wedge of butter and sprinkle on some cinnamon. If you are feeling indulgent, sprinkle a little sugar. It won't kill you. Tons of vitamins and maybe 30 extra sugar calories. \n\nChop up carrots and put them in a skillet with olive oil and water to let the carrots steam, then add salt and rosemary. \n\nYou can make any bland tomato taste great by adding a vinegar of choice. This is why you like pico de gallo at he Mexican restaurant but not sliced tomatoes. Vinegar brings out the flavor. \n\nHere is the key to change from a non-veggie eater to a veggie eater: find a gateway. Maybe you like guacamole. Try eating it more and find new ways to eat avocados. Maybe there is a salad you like when you go to the Japanese steakhouse. Learn to make that dressing. Maybe you like bell peppers in fajitas. Learn to skillet fry bell peppers at home and eat them as a side. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most people hate vegetables because they don&amp;#39;t give themselves permission to make them taste good by adding fats, acids, spices and salt. &lt;/p&gt;\n\n&lt;p&gt;Try a tablespoon of butter in a bowl of broccoli with salt and see if you like it. &lt;/p&gt;\n\n&lt;p&gt;Bake a sweet potato and drop a thick wedge of butter and sprinkle on some cinnamon. If you are feeling indulgent, sprinkle a little sugar. It won&amp;#39;t kill you. Tons of vitamins and maybe 30 extra sugar calories. &lt;/p&gt;\n\n&lt;p&gt;Chop up carrots and put them in a skillet with olive oil and water to let the carrots steam, then add salt and rosemary. &lt;/p&gt;\n\n&lt;p&gt;You can make any bland tomato taste great by adding a vinegar of choice. This is why you like pico de gallo at he Mexican restaurant but not sliced tomatoes. Vinegar brings out the flavor. &lt;/p&gt;\n\n&lt;p&gt;Here is the key to change from a non-veggie eater to a veggie eater: find a gateway. Maybe you like guacamole. Try eating it more and find new ways to eat avocados. Maybe there is a salad you like when you go to the Japanese steakhouse. Learn to make that dressing. Maybe you like bell peppers in fajitas. Learn to skillet fry bell peppers at home and eat them as a side. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EatCheapAndHealthy", "name": "t1_dg9af6w", "score_hidden": false, "stickied": false, "created": 1492213146.0, "created_utc": 1492184346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vvpi", "removal_reason": null, "link_id": "t3_650grl", "likes": null, "replies": "", "user_reports": [], "id": "dg6h9zx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zooloretti", "parent_id": "t3_650grl", "subreddit_name_prefixed": "r/EatCheapAndHealthy", "controversiality": 0, "body": "Take cut up fruit in tupperware to work for a snack. \n\nKeep baby spinach in the fridge and stir a handful into anything you're cooking. Same goes for frozen peas and corn. Buy jars of baby food (the pure veg kind) and mix into anything saucey like pasta sauce or pulled pork.\n\nTake raw carrot, sticks of red pepper, cherry tomatoes, a boiled egg, a couple of strawberries, some snow peas, couple of slices of cheese, a few crackers and some hummus to work for lunch.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take cut up fruit in tupperware to work for a snack. &lt;/p&gt;\n\n&lt;p&gt;Keep baby spinach in the fridge and stir a handful into anything you&amp;#39;re cooking. Same goes for frozen peas and corn. Buy jars of baby food (the pure veg kind) and mix into anything saucey like pasta sauce or pulled pork.&lt;/p&gt;\n\n&lt;p&gt;Take raw carrot, sticks of red pepper, cherry tomatoes, a boiled egg, a couple of strawberries, some snow peas, couple of slices of cheese, a few crackers and some hummus to work for lunch.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EatCheapAndHealthy", "name": "t1_dg6h9zx", "score_hidden": false, "stickied": false, "created": 1492056821.0, "created_utc": 1492028021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]