[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "gamegrumps", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Well, let&amp;#39;s get to it right out of the gate. I already assume the reaction this may receive, so let&amp;#39;s get down to those bullet points right at the outset.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;&amp;quot;Don&amp;#39;t like it, don&amp;#39;t watch it.&amp;quot; I don&amp;#39;t. Yet I used to like Game Grumps. I still will sometimes rewatch some series like Super Mario World 3D or Super Mario Sunshine. However, that does not mean I don&amp;#39;t care, and if you care about something, you want what is best for it. To say &amp;quot;don&amp;#39;t watch&amp;quot; is to say &amp;quot;stop caring.&amp;quot; And, honestly, that just projects that you yourself do not care about it either, because you are telling someone to just accept what they think isn&amp;#39;t working and can be improved on, in spite of their feelings.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Yeah, this was first posted on the oh-so-hated rantgrumps subreddit. Someone called me out for not putting it here in the Main Sub, so I&amp;#39;m taking them up on it. I did not because, well, like I already said, I assume how this&amp;#39;ll go already.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Alternatively, you, the people here at the Main Sub, can show me up and prove me wrong. This is a case where I want to be wrong; I&amp;#39;d rather be the dick, instead of it being downvoted to oblivion, or repeating the aforementioned Point #1 above, or what have you.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;With that out of the way, time to throw the meat to the wolves. No, that&amp;#39;s not an insult, it&amp;#39;s just a saying.&lt;/p&gt;\n\n&lt;p&gt;Comedy, as a medium, is easy to learn and difficult to master. Good comedy is organic. It doesn&amp;#39;t come from forcing a joke into a situation; it&amp;#39;s predicated on timing, situation, context, and format. Even the more abstract humor relies on these building blocks, however, this is especially true of improv comedy, as the nature of improv is on-the-feet thinking and development of a natural sense of these factors as they come up, which is essentially what being a Let&amp;#39;s Player is, to a degree. It varies based on channel and personality of that channel, but I think it&amp;#39;s safe to say that Game Grumps falls fairly close within the spectrum.&lt;/p&gt;\n\n&lt;p&gt;This is where growth comes into play. For a comedian, especially an improv comedian, they need to grow as an entertainer via developing that natural sense that I mentioned earlier until it becomes like second nature to them, and to then continue to adapt as new situations and new contexts arise either from your own bits or from external influences - in other words, you must compensate change by changing yourself and your jokes to match. And this is where we come into the problems of Game Grumps as a platform of entertainment.&lt;/p&gt;\n\n&lt;p&gt;Instead of growing, the show has become stagnant by appealing to, lastly, the &amp;quot;lowest common denominator.&amp;quot; I&amp;#39;d like to explain this through contrast. Let&amp;#39;s look at South Park, a show that has cut its teeth and made its name on the same kind of low-brow toilet humor. However, it at least attempts to use that low-brow humor in a smart way. Either through some kind of commentary, or through subversion, or lampshading. Or even just being gross for the sake of it. However, they still try to vary the routine to some extent. Granted, they are a scripted show and not improv, but it still serves the point.&lt;/p&gt;\n\n&lt;p&gt;Game Grumps, on the other hand, to put it frankly, has sacrificed potential growth for a steady stream of lowest common denominator. They are akin to something like, say, Jerry Springer. A predictable one-trick pony. Wheel out the idiots and the trailer trash, encourage them to bitch at each other, then leave them to duke it out on set. However, at least Springer is willing to publicly demonstrate self-awareness and admit his show is absolute garbage with no redeeming value.&lt;/p&gt;\n\n&lt;p&gt;Now, that is NOT to say that GG is &amp;quot;absolute garbage with no redeeming value.&amp;quot; Though it is skirting the water&amp;#39;s edge of that particular sinkhole. Without growth, there is no improvement; I think that is a point that is by no means controversial. I feel safe in saying we can all universally agree to that. So, answer me this:&lt;/p&gt;\n\n&lt;p&gt;What is the situation about randomly singing about dicks? How does the timing of &amp;quot;I&amp;#39;m going to pre&amp;quot; play into the humor? What is the context of screaming &amp;quot;my pussy?&amp;quot; And how does a shrill, irritating voice support the format?&lt;/p&gt;\n\n&lt;p&gt;Feel free to prove me wrong, but I&amp;#39;ll answer those myself: There is none, it doesn&amp;#39;t, there is none, and it doesn&amp;#39;t, respectively. So why is it supposed to be funny? Because it appeals to a a kind of humor that would find the mere mention of &amp;quot;penis&amp;quot; as inherently hilarious. Think carefully about what I just said there. Do you see why I refer to it as &amp;quot;lowest common denominator?&amp;quot; Because it is a humor that requires no set up, nor any punchline. The humor exist simply because a subject exist. It cannot get any more simple than that, there is no further division to be had.&lt;/p&gt;\n\n&lt;p&gt;So what does this mean in regards to their viewership? Well, let me ask this: do you really want to be treated like that? That you&amp;#39;re so basic that you&amp;#39;ll laugh at anything put in front of you? Because this is, essentially, what is going on here, or at least, that seems to be how the Grumps, and specifically Arin, see his audience. Perhaps not in such a negative way as I express, but nonetheless, the sentiment appears to be the same. That is also not to say the viewership IS a lowest common denominator; instead, the implication is that, that is how the audience is being treated and there is complacency within the audience to it.&lt;/p&gt;\n\n&lt;p&gt;The point is, in other words, that he does not need to try to have that audience. That he can attract an audience with minimal effort. To those who think I&amp;#39;m wrong, do me a favor, an experiment, if you will. Remember that these episodes are recorded in bulk, with a session being a number of episodes.&lt;/p&gt;\n\n&lt;p&gt;Pick a bunch of videos from this year, 2017. Play them back to back for a few hours, the length of one of their sessions, I don&amp;#39;t know how long those sessions usually last. Don&amp;#39;t watch, just listen. Or maybe do something on the side, but try to actually pay attention to what&amp;#39;s being said. See how often he tells the same jokes, how often he uses the same voices. When he makes a joke pay attention to his set ups and his punchlines, and how often he does have a set up or a punchline. And at the end of it, ask yourself: is this what you want for the show? Should you demand better? Because if you do that, hopefully you see the problems I&amp;#39;ve talk about in full view. All the stuff I asked you to pay attention to happened in the span of a single session (or at least that&amp;#39;s the idea).&lt;/p&gt;\n\n&lt;p&gt;If you love something, wouldn&amp;#39;t you want the best for it? So ask yourself, is this course really the best for the show? Some of us say no.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Well, let's get to it right out of the gate. I already assume the reaction this may receive, so let's get down to those bullet points right at the outset.\n\n1. \"Don't like it, don't watch it.\" I don't. Yet I used to like Game Grumps. I still will sometimes rewatch some series like Super Mario World 3D or Super Mario Sunshine. However, that does not mean I don't care, and if you care about something, you want what is best for it. To say \"don't watch\" is to say \"stop caring.\" And, honestly, that just projects that you yourself do not care about it either, because you are telling someone to just accept what they think isn't working and can be improved on, in spite of their feelings.\n\n2. Yeah, this was first posted on the oh-so-hated rantgrumps subreddit. Someone called me out for not putting it here in the Main Sub, so I'm taking them up on it. I did not because, well, like I already said, I assume how this'll go already.\n\n3. Alternatively, you, the people here at the Main Sub, can show me up and prove me wrong. This is a case where I want to be wrong; I'd rather be the dick, instead of it being downvoted to oblivion, or repeating the aforementioned Point #1 above, or what have you.\n\n\nWith that out of the way, time to throw the meat to the wolves. No, that's not an insult, it's just a saying.\n\n\nComedy, as a medium, is easy to learn and difficult to master. Good comedy is organic. It doesn't come from forcing a joke into a situation; it's predicated on timing, situation, context, and format. Even the more abstract humor relies on these building blocks, however, this is especially true of improv comedy, as the nature of improv is on-the-feet thinking and development of a natural sense of these factors as they come up, which is essentially what being a Let's Player is, to a degree. It varies based on channel and personality of that channel, but I think it's safe to say that Game Grumps falls fairly close within the spectrum.\n\nThis is where growth comes into play. For a comedian, especially an improv comedian, they need to grow as an entertainer via developing that natural sense that I mentioned earlier until it becomes like second nature to them, and to then continue to adapt as new situations and new contexts arise either from your own bits or from external influences - in other words, you must compensate change by changing yourself and your jokes to match. And this is where we come into the problems of Game Grumps as a platform of entertainment.\n\nInstead of growing, the show has become stagnant by appealing to, lastly, the \"lowest common denominator.\" I'd like to explain this through contrast. Let's look at South Park, a show that has cut its teeth and made its name on the same kind of low-brow toilet humor. However, it at least attempts to use that low-brow humor in a smart way. Either through some kind of commentary, or through subversion, or lampshading. Or even just being gross for the sake of it. However, they still try to vary the routine to some extent. Granted, they are a scripted show and not improv, but it still serves the point.\n\nGame Grumps, on the other hand, to put it frankly, has sacrificed potential growth for a steady stream of lowest common denominator. They are akin to something like, say, Jerry Springer. A predictable one-trick pony. Wheel out the idiots and the trailer trash, encourage them to bitch at each other, then leave them to duke it out on set. However, at least Springer is willing to publicly demonstrate self-awareness and admit his show is absolute garbage with no redeeming value.\n\nNow, that is NOT to say that GG is \"absolute garbage with no redeeming value.\" Though it is skirting the water's edge of that particular sinkhole. Without growth, there is no improvement; I think that is a point that is by no means controversial. I feel safe in saying we can all universally agree to that. So, answer me this:\n\nWhat is the situation about randomly singing about dicks? How does the timing of \"I'm going to pre\" play into the humor? What is the context of screaming \"my pussy?\" And how does a shrill, irritating voice support the format?\n\nFeel free to prove me wrong, but I'll answer those myself: There is none, it doesn't, there is none, and it doesn't, respectively. So why is it supposed to be funny? Because it appeals to a a kind of humor that would find the mere mention of \"penis\" as inherently hilarious. Think carefully about what I just said there. Do you see why I refer to it as \"lowest common denominator?\" Because it is a humor that requires no set up, nor any punchline. The humor exist simply because a subject exist. It cannot get any more simple than that, there is no further division to be had.\n\nSo what does this mean in regards to their viewership? Well, let me ask this: do you really want to be treated like that? That you're so basic that you'll laugh at anything put in front of you? Because this is, essentially, what is going on here, or at least, that seems to be how the Grumps, and specifically Arin, see his audience. Perhaps not in such a negative way as I express, but nonetheless, the sentiment appears to be the same. That is also not to say the viewership IS a lowest common denominator; instead, the implication is that, that is how the audience is being treated and there is complacency within the audience to it.\n\nThe point is, in other words, that he does not need to try to have that audience. That he can attract an audience with minimal effort. To those who think I'm wrong, do me a favor, an experiment, if you will. Remember that these episodes are recorded in bulk, with a session being a number of episodes.\n\nPick a bunch of videos from this year, 2017. Play them back to back for a few hours, the length of one of their sessions, I don't know how long those sessions usually last. Don't watch, just listen. Or maybe do something on the side, but try to actually pay attention to what's being said. See how often he tells the same jokes, how often he uses the same voices. When he makes a joke pay attention to his set ups and his punchlines, and how often he does have a set up or a punchline. And at the end of it, ask yourself: is this what you want for the show? Should you demand better? Because if you do that, hopefully you see the problems I've talk about in full view. All the stuff I asked you to pay attention to happened in the span of a single session (or at least that's the idea).\n\nIf you love something, wouldn't you want the best for it? So ask yourself, is this course really the best for the show? Some of us say no.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64xg6n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 44, "report_reasons": null, "author": "S_G_Redbear", "saved": false, "mod_reports": [], "name": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "approved_by": null, "over_18": false, "domain": "self.gamegrumps", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2ulfu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/gamegrumps/comments/64xg6n/comedy_growth_and_lowest_common_denominator/", "num_reports": null, "locked": false, "stickied": false, "created": 1492023800.0, "url": "https://www.reddit.com/r/gamegrumps/comments/64xg6n/comedy_growth_and_lowest_common_denominator/", "author_flair_text": null, "quarantine": false, "title": "Comedy, Growth, and Lowest Common Denominator", "created_utc": 1491995000.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 57, "visited": false, "subreddit_type": "public", "ups": 44}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6k6yq", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg5ru2t", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Oh trust me, I have no issue with dick jokes. However, the thing about toilet humor is it is best with either in lunacy or in subversion of expectation. In other words, either by being so extreme that it becomes humorously ridiculous, or that the punchline is unexpected to the setup.\n\nFor example, take the one you mention. The setup is that it's an Obama impression, something that kind of toys with both in that it's something you'd never imagine Obama saying. That's where the humor of it comes in. The Obama impression is the setup.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh trust me, I have no issue with dick jokes. However, the thing about toilet humor is it is best with either in lunacy or in subversion of expectation. In other words, either by being so extreme that it becomes humorously ridiculous, or that the punchline is unexpected to the setup.&lt;/p&gt;\n\n&lt;p&gt;For example, take the one you mention. The setup is that it&amp;#39;s an Obama impression, something that kind of toys with both in that it&amp;#39;s something you&amp;#39;d never imagine Obama saying. That&amp;#39;s where the humor of it comes in. The Obama impression is the setup.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6k6yq", "score_hidden": false, "stickied": false, "created": 1492059907.0, "created_utc": 1492031107.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6kgie", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg5y8y4", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "To counterpoint, though, some degree of quality is expected. Unlike, say, a standard networked show on the television, Let's Players and the like are often self-promoted and often the sole individual actually working on their own channel, or they might hire someone to do editing.\n\nTo be honest, Game Grumps is an exception to the rule in terms of the size of its employment and their roles. So, sure, it's free, but at the same time, the model is true of any of them, and each must deliver to an acceptable degree or simply not grow beyond maybe a few thousand at most.\n\nThus I generally don't find the \"it's free\" argument to be all that applicable, because that's just the nature of the beast as a whole.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To counterpoint, though, some degree of quality is expected. Unlike, say, a standard networked show on the television, Let&amp;#39;s Players and the like are often self-promoted and often the sole individual actually working on their own channel, or they might hire someone to do editing.&lt;/p&gt;\n\n&lt;p&gt;To be honest, Game Grumps is an exception to the rule in terms of the size of its employment and their roles. So, sure, it&amp;#39;s free, but at the same time, the model is true of any of them, and each must deliver to an acceptable degree or simply not grow beyond maybe a few thousand at most.&lt;/p&gt;\n\n&lt;p&gt;Thus I generally don&amp;#39;t find the &amp;quot;it&amp;#39;s free&amp;quot; argument to be all that applicable, because that&amp;#39;s just the nature of the beast as a whole.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6kgie", "score_hidden": false, "stickied": false, "created": 1492060210.0, "created_utc": 1492031410.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg67jgq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SnakeInABox7", "parent_id": "t1_dg5y8y4", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "This is a great point. I went to the Houston live show and it was an experience unlike anything I had ever witnessed. They were fantastic, and the format really worked. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great point. I went to the Houston live show and it was an experience unlike anything I had ever witnessed. They were fantastic, and the format really worked. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg67jgq", "score_hidden": false, "stickied": false, "created": 1492046856.0, "created_utc": 1492018056.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y8y4", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Fallopius", "parent_id": "t1_dg5ru2t", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "To piggyback on this, I don't know what the consensus is on the live shows but I went to one in vancouver and both of them we're really 'On'. They were engaging and trying to make everyone laugh and I saw almost none of this basic humor. \n\nAnd although their videos can get annoying for various reasons, such as they suck at the game I don't think the format allows for really strong jokes. For the live shows they have that set up that most comedians have: Prep time, practice, and audience feedback. The show just doesn't have that so you can't really expect a miracle in every episode. \n\nPlus I realize this is a variation on the \"don't like, don't watch\" argument but this show is free to watch. maybe I would be up in arms about the content if I paid for the subscription but I don't and I'm pretty impressed with the quality based on the fact that I pay nothing for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To piggyback on this, I don&amp;#39;t know what the consensus is on the live shows but I went to one in vancouver and both of them we&amp;#39;re really &amp;#39;On&amp;#39;. They were engaging and trying to make everyone laugh and I saw almost none of this basic humor. &lt;/p&gt;\n\n&lt;p&gt;And although their videos can get annoying for various reasons, such as they suck at the game I don&amp;#39;t think the format allows for really strong jokes. For the live shows they have that set up that most comedians have: Prep time, practice, and audience feedback. The show just doesn&amp;#39;t have that so you can&amp;#39;t really expect a miracle in every episode. &lt;/p&gt;\n\n&lt;p&gt;Plus I realize this is a variation on the &amp;quot;don&amp;#39;t like, don&amp;#39;t watch&amp;quot; argument but this show is free to watch. maybe I would be up in arms about the content if I paid for the subscription but I don&amp;#39;t and I&amp;#39;m pretty impressed with the quality based on the fact that I pay nothing for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5y8y4", "score_hidden": false, "stickied": false, "created": 1492036914.0, "created_utc": 1492008114.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6h3n1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Obskulum", "parent_id": "t1_dg5ru2t", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Yeah, Arin's been making dick jokes since the early days. Did we already forget *MIX DA FUCK OUT OF EM, AND WHADDYA GET?*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, Arin&amp;#39;s been making dick jokes since the early days. Did we already forget &lt;em&gt;MIX DA FUCK OUT OF EM, AND WHADDYA GET?&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6h3n1", "score_hidden": false, "stickied": false, "created": 1492056638.0, "created_utc": 1492027838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ru2t", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "A1phyn", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I think it's well established that the Grumps only ever try to make each other laugh - even if it means repeating the same joke over and over again. \n\nPersonally, I think you're seeing things you want to see, such as Arin supposedly viewing his audience as \"basic\" for liking jokes about penises, whereas in reality his humor has always been the same style since his NewGrounds days, so how can that be the case? Arin does these jokes because they make him laugh, make other people laugh, or both. The thing that binds most of the Grumps audience together is the idea that people of above-average intellect can still enjoy crude jokes such as penises, sexual references and pooping, which South Park, one of your examples, also proves. Hell, the Grumps themselves prove this to be true, too: both Danny and Arin are very intelligent and yet Danny still lost it when Arin said \"I'm gonna pre\" in his Obama voice. Plus, the Grump audience has always been vocal about which jokes are good and which aren't - jokes about pedophilia, for instance, and now I don't think I've heard a single pedophilic joke for a long time.    \n\nOnto growth: put simply you cannot force growth, it has to come naturally. And sometimes growth stops or moves at a snail's pace - not because you're doing something wrong but because everything has a limit. You can try and force yourself to grow even more by experimenting with things like format tweaks, new humor, and new shows, but are you growing what you already have or are you making something new? Do these new things make you happy and satisfied that your idea is reaching its fullest potential? The answers are rarely as simple as they seem and can destroy your idea completely by turning it into something you never wanted. \n     \nYou want to see the Grumps improve and grow, which I commend. I also want to see the same thing. Can their jokes get repetitive? Absolutely. Are they still funny? To me they sure as hell are. Does that mean you're wrong? Absolutely not, but they will change and grow at their own pace because, ultimately, Game Grumps is about Arin and Dan making each other laugh and inviting us along for the ride.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s well established that the Grumps only ever try to make each other laugh - even if it means repeating the same joke over and over again. &lt;/p&gt;\n\n&lt;p&gt;Personally, I think you&amp;#39;re seeing things you want to see, such as Arin supposedly viewing his audience as &amp;quot;basic&amp;quot; for liking jokes about penises, whereas in reality his humor has always been the same style since his NewGrounds days, so how can that be the case? Arin does these jokes because they make him laugh, make other people laugh, or both. The thing that binds most of the Grumps audience together is the idea that people of above-average intellect can still enjoy crude jokes such as penises, sexual references and pooping, which South Park, one of your examples, also proves. Hell, the Grumps themselves prove this to be true, too: both Danny and Arin are very intelligent and yet Danny still lost it when Arin said &amp;quot;I&amp;#39;m gonna pre&amp;quot; in his Obama voice. Plus, the Grump audience has always been vocal about which jokes are good and which aren&amp;#39;t - jokes about pedophilia, for instance, and now I don&amp;#39;t think I&amp;#39;ve heard a single pedophilic joke for a long time.    &lt;/p&gt;\n\n&lt;p&gt;Onto growth: put simply you cannot force growth, it has to come naturally. And sometimes growth stops or moves at a snail&amp;#39;s pace - not because you&amp;#39;re doing something wrong but because everything has a limit. You can try and force yourself to grow even more by experimenting with things like format tweaks, new humor, and new shows, but are you growing what you already have or are you making something new? Do these new things make you happy and satisfied that your idea is reaching its fullest potential? The answers are rarely as simple as they seem and can destroy your idea completely by turning it into something you never wanted. &lt;/p&gt;\n\n&lt;p&gt;You want to see the Grumps improve and grow, which I commend. I also want to see the same thing. Can their jokes get repetitive? Absolutely. Are they still funny? To me they sure as hell are. Does that mean you&amp;#39;re wrong? Absolutely not, but they will change and grow at their own pace because, ultimately, Game Grumps is about Arin and Dan making each other laugh and inviting us along for the ride.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5ru2t", "score_hidden": false, "stickied": false, "created": 1492027719.0, "created_utc": 1491998919.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6ng7n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "milesrhoden", "parent_id": "t1_dg6lb0q", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "&gt; I don't see it as \"awesome\" that you repeatedly do a joke your partner actively loathes\n\nI meant that Arin and Dan having that conversation was awesome because we witnessed them reconciling their opinions. I helped me to hear Arin say he enjoyed doing the annoying voice because I hadn't considered his side of it; I had just thought it was annoying. In any case, Arin has stopped doing the voice. He edits himself on our behalf and that makes me appreciate him all the more.\n\nI've seen other youtubers go out of their way to address commenter hate in their videos and it always sucks to watch. I've never felt that way about Arin or Danny.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t see it as &amp;quot;awesome&amp;quot; that you repeatedly do a joke your partner actively loathes&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I meant that Arin and Dan having that conversation was awesome because we witnessed them reconciling their opinions. I helped me to hear Arin say he enjoyed doing the annoying voice because I hadn&amp;#39;t considered his side of it; I had just thought it was annoying. In any case, Arin has stopped doing the voice. He edits himself on our behalf and that makes me appreciate him all the more.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen other youtubers go out of their way to address commenter hate in their videos and it always sucks to watch. I&amp;#39;ve never felt that way about Arin or Danny.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ng7n", "score_hidden": false, "stickied": false, "created": 1492063777.0, "created_utc": 1492034977.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6lb0q", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg5ud06", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "This was brought up in, ahem, let's say \"the other place.\" And the problem with it for some of us is there is Arin and there is \"Arin.\" There is the man, and there is the character, which he openly admits as a thing. And it is often hard to separate the two because it is not a consistent character. It often deviates from his personal feelings.\n\nSee, I don't see it as \"awesome\" that you repeatedly do a joke your partner actively loathes. I see that as being a dick. And the problem is Dan must react to the character because that is what is given to  him, and some of us hate \"Arin.\" That it's a character too often used, too often too extreme to be entertaining. And it can be hard to determine when it's Arin or \"Arin.\"\n\nWhere Arin may actually enjoy a game, but he uses \"Arin\" to fake-rage at it. Or he might be genuinely frustrated with a game and speaking for himself personally. Or an in-between, where he's using \"Arin\" in a hyperbolic way. This is what i mean by its inconsistent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was brought up in, ahem, let&amp;#39;s say &amp;quot;the other place.&amp;quot; And the problem with it for some of us is there is Arin and there is &amp;quot;Arin.&amp;quot; There is the man, and there is the character, which he openly admits as a thing. And it is often hard to separate the two because it is not a consistent character. It often deviates from his personal feelings.&lt;/p&gt;\n\n&lt;p&gt;See, I don&amp;#39;t see it as &amp;quot;awesome&amp;quot; that you repeatedly do a joke your partner actively loathes. I see that as being a dick. And the problem is Dan must react to the character because that is what is given to  him, and some of us hate &amp;quot;Arin.&amp;quot; That it&amp;#39;s a character too often used, too often too extreme to be entertaining. And it can be hard to determine when it&amp;#39;s Arin or &amp;quot;Arin.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Where Arin may actually enjoy a game, but he uses &amp;quot;Arin&amp;quot; to fake-rage at it. Or he might be genuinely frustrated with a game and speaking for himself personally. Or an in-between, where he&amp;#39;s using &amp;quot;Arin&amp;quot; in a hyperbolic way. This is what i mean by its inconsistent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6lb0q", "score_hidden": false, "stickied": false, "created": 1492061189.0, "created_utc": 1492032389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg5yesn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MisterSympa", "parent_id": "t1_dg5ud06", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "&gt; Breath of the Wild - Part 01 Danny tells Arin that his high-pitched voice \"is pretty much his most hated voice,\" (which it is) and Arin sincerely defends it.\n\nI need to start watching that series.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Breath of the Wild - Part 01 Danny tells Arin that his high-pitched voice &amp;quot;is pretty much his most hated voice,&amp;quot; (which it is) and Arin sincerely defends it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I need to start watching that series.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5yesn", "score_hidden": false, "stickied": false, "created": 1492037100.0, "created_utc": 1492008300.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7i0vg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MisterSympa", "parent_id": "t1_dg6q2qn", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "&gt; His woman voice saying \"I'm cumming!\" and such.\n\nI don't know why, but that is the funniest thing on earth to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;His woman voice saying &amp;quot;I&amp;#39;m cumming!&amp;quot; and such.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t know why, but that is the funniest thing on earth to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7i0vg", "score_hidden": false, "stickied": false, "created": 1492116992.0, "created_utc": 1492088192.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6q2qn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bad-r0bot", "parent_id": "t1_dg5ud06", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I'd like to add that Arin commonly falls back to fart and poop noises along with pussy and pre. His woman voice saying \"I'm cumming!\" and such... I try to skip as fast as possible.\n\nEither way, I'll stick with them till it doesn't fit my humor anymore or I get too busy t o watch them play.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to add that Arin commonly falls back to fart and poop noises along with pussy and pre. His woman voice saying &amp;quot;I&amp;#39;m cumming!&amp;quot; and such... I try to skip as fast as possible.&lt;/p&gt;\n\n&lt;p&gt;Either way, I&amp;#39;ll stick with them till it doesn&amp;#39;t fit my humor anymore or I get too busy t o watch them play.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6q2qn", "score_hidden": false, "stickied": false, "created": 1492067037.0, "created_utc": 1492038237.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ud06", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "milesrhoden", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "&gt; How does the timing of \"I'm going to pre\" play into the humor? What is the context of screaming \"my pussy?\"\n\nThis is a fair point and I also hate these jokes. They are clearly \"you-had-to-be-there-when-it-started\" jokes and we as an audience were not.\n\nThat said, Game Grumps is more than a comedy show. It's basically a talk show where we listen to 2 friends laughing together. It's also a long-form story of their lives. Arin (and to a lesser extent Danny) can get (understandably) frustrated with the demands of the show and its audience, but they always make the show regardless. Sometimes Arin says a thing **because** everyone is telling him not to say it (\"I'm gonna pre\"). I respect that because he gets WAY MORE criticism than I can comprehend and telling a few unpopular jokes is a healthy way to vent those frustrations to the audience. I don't mind because Arin (and Danny) ultimately work through all of it to bring us a show.\n\nLike any show, it has good days and bad days, but I've never felt like they don't care. For example, in Breath of the Wild - Part 01 Danny tells Arin that his high-pitched voice \"is pretty much his most hated voice,\" (which it is) and Arin sincerely defends it. **That was awesome to hear.** I honestly hadn't considered how much fun the voice was for Arin. I mean, I want that voice to stop but it's clear **they are working on the show and having those difficult conversations, sometimes right in front of us.** Dan even re-watches old series on a pretty regular basis and it shows. And Arin's in-game progress in Breath of the Wild has been awesome. I waste TONS of time in that game, but Arin only gets 15 minutes and he really makes it count **for our benefit** while he also does a comedy show.\n\nIt's downright inspirational what they put up with. I respect their hard work and IMO, GG the best let's play channel there is, full stop.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How does the timing of &amp;quot;I&amp;#39;m going to pre&amp;quot; play into the humor? What is the context of screaming &amp;quot;my pussy?&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a fair point and I also hate these jokes. They are clearly &amp;quot;you-had-to-be-there-when-it-started&amp;quot; jokes and we as an audience were not.&lt;/p&gt;\n\n&lt;p&gt;That said, Game Grumps is more than a comedy show. It&amp;#39;s basically a talk show where we listen to 2 friends laughing together. It&amp;#39;s also a long-form story of their lives. Arin (and to a lesser extent Danny) can get (understandably) frustrated with the demands of the show and its audience, but they always make the show regardless. Sometimes Arin says a thing &lt;strong&gt;because&lt;/strong&gt; everyone is telling him not to say it (&amp;quot;I&amp;#39;m gonna pre&amp;quot;). I respect that because he gets WAY MORE criticism than I can comprehend and telling a few unpopular jokes is a healthy way to vent those frustrations to the audience. I don&amp;#39;t mind because Arin (and Danny) ultimately work through all of it to bring us a show.&lt;/p&gt;\n\n&lt;p&gt;Like any show, it has good days and bad days, but I&amp;#39;ve never felt like they don&amp;#39;t care. For example, in Breath of the Wild - Part 01 Danny tells Arin that his high-pitched voice &amp;quot;is pretty much his most hated voice,&amp;quot; (which it is) and Arin sincerely defends it. &lt;strong&gt;That was awesome to hear.&lt;/strong&gt; I honestly hadn&amp;#39;t considered how much fun the voice was for Arin. I mean, I want that voice to stop but it&amp;#39;s clear &lt;strong&gt;they are working on the show and having those difficult conversations, sometimes right in front of us.&lt;/strong&gt; Dan even re-watches old series on a pretty regular basis and it shows. And Arin&amp;#39;s in-game progress in Breath of the Wild has been awesome. I waste TONS of time in that game, but Arin only gets 15 minutes and he really makes it count &lt;strong&gt;for our benefit&lt;/strong&gt; while he also does a comedy show.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s downright inspirational what they put up with. I respect their hard work and IMO, GG the best let&amp;#39;s play channel there is, full stop.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5ud06", "score_hidden": false, "stickied": false, "created": 1492031933.0, "created_utc": 1492003133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6fgtd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Eric_The_Human_", "parent_id": "t1_dg6648v", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Exactly. I do let's plays occasionally and it's more about what makes my best friend and I bust up. When you focus on trying to make people laugh is when it becomes forced and unnatural. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. I do let&amp;#39;s plays occasionally and it&amp;#39;s more about what makes my best friend and I bust up. When you focus on trying to make people laugh is when it becomes forced and unnatural. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6fgtd", "score_hidden": false, "stickied": false, "created": 1492054971.0, "created_utc": 1492026171.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6648v", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "geleiademocoto", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I just think you're taking it too seriously and overthinking it. They just sit there and say whatever comes to their mind. If what makes them laugh isn't what makes you laugh, it's nobody's fault. It happens. It's just a youtube show, man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just think you&amp;#39;re taking it too seriously and overthinking it. They just sit there and say whatever comes to their mind. If what makes them laugh isn&amp;#39;t what makes you laugh, it&amp;#39;s nobody&amp;#39;s fault. It happens. It&amp;#39;s just a youtube show, man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6648v", "score_hidden": false, "stickied": false, "created": 1492045421.0, "created_utc": 1492016621.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6kitv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg66yl4", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "That is, however, only a part of their usual recording session time, which I thought was around six or eight hours?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is, however, only a part of their usual recording session time, which I thought was around six or eight hours?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6kitv", "score_hidden": false, "stickied": false, "created": 1492060284.0, "created_utc": 1492031484.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66yl4", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ThisGuyIsntEvenDendi", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "&gt;Pick a bunch of videos from this year, 2017. Play them back to back for a few hours\n\nI wonder if you actually tried this or if you just assumed it would support your point, like you assumed a lot of other stuff in this post to get out of actually having a discussion with anyone. I did try this and counted about 4 repeated jokes (give or take one that was a repeat of a much, much older joke) in ~3 hours. All things considered, I'm alright with that, honestly even a bit surprised with how low it was myself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Pick a bunch of videos from this year, 2017. Play them back to back for a few hours&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wonder if you actually tried this or if you just assumed it would support your point, like you assumed a lot of other stuff in this post to get out of actually having a discussion with anyone. I did try this and counted about 4 repeated jokes (give or take one that was a repeat of a much, much older joke) in ~3 hours. All things considered, I&amp;#39;m alright with that, honestly even a bit surprised with how low it was myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg66yl4", "score_hidden": false, "stickied": false, "created": 1492046280.0, "created_utc": 1492017480.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7hfr8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MisterSympa", "parent_id": "t1_dg6ldlk", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I feel ya. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel ya. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7hfr8", "score_hidden": false, "stickied": false, "created": 1492116074.0, "created_utc": 1492087274.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ldlk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg5y8fu", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Hey, fair enough. I mean, if people still enjoy it, good for them (as sarcastic as it sounds, I mean it sincerely).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, fair enough. I mean, if people still enjoy it, good for them (as sarcastic as it sounds, I mean it sincerely).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ldlk", "score_hidden": false, "stickied": false, "created": 1492061274.0, "created_utc": 1492032474.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y8fu", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MisterSympa", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "You're not wrong, I'm just not sick of it yet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not wrong, I&amp;#39;m just not sick of it yet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5y8fu", "score_hidden": false, "stickied": false, "created": 1492036898.0, "created_utc": 1492008098.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6fln1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Eric_The_Human_", "parent_id": "t1_dg5zn3j", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Yea I've always described game grumps as a visual podcast after (I think) Jon mentioned it being one in a very early episode. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea I&amp;#39;ve always described game grumps as a visual podcast after (I think) Jon mentioned it being one in a very early episode. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6fln1", "score_hidden": false, "stickied": false, "created": 1492055106.0, "created_utc": 1492026306.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zn3j", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "americanbaseball", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I personally only watch this show because I like listening to two friends just having fun together, and it's clear that they are, so I don't really mind that they repeat the same jokes. I mean, Grumps has always been about Lowest Common Denominator humor. It's not like they are regressing in terms of their humor style, they just aren't changing very much. Which I understand can also be frustrating, but also keep in mind that they have millions of fans with millions of opinions. It's fine that you have a well thought out opinion but I'm going to be brutally honest, it matters just as much as mine on this situation. Not at all. Arin has brought this up on the show before even, he doesn't care about trying to find something that will make everyone in the audience laugh, he worries about making himself laugh and making Dan laugh, and if it makes him laugh, it will probably make others laugh. It doesn't work for every joke, but there are still outstanding moments on this show and it comes organically, not trying to force something or try to do something to appeal to everyone. \n\nAlso, I have no problem with them repeating the jokes within one session, I mean to us it's the same jokes for two weeks, but to them it's the same jokes for a few hours which honestly seems reasonable. I mean, when I'm hanging out with friends for a few hours we might make the same jokes as long as it makes sense organically. I'm with the other people here in saying I'd really rather not try to force growth or force humor into a show just for the sake of a portion of the audience. It seems unfair to the other portion of the audience that doesn't mind. Because at the end of the day, it's their show, not our show and they can do whatever they please. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally only watch this show because I like listening to two friends just having fun together, and it&amp;#39;s clear that they are, so I don&amp;#39;t really mind that they repeat the same jokes. I mean, Grumps has always been about Lowest Common Denominator humor. It&amp;#39;s not like they are regressing in terms of their humor style, they just aren&amp;#39;t changing very much. Which I understand can also be frustrating, but also keep in mind that they have millions of fans with millions of opinions. It&amp;#39;s fine that you have a well thought out opinion but I&amp;#39;m going to be brutally honest, it matters just as much as mine on this situation. Not at all. Arin has brought this up on the show before even, he doesn&amp;#39;t care about trying to find something that will make everyone in the audience laugh, he worries about making himself laugh and making Dan laugh, and if it makes him laugh, it will probably make others laugh. It doesn&amp;#39;t work for every joke, but there are still outstanding moments on this show and it comes organically, not trying to force something or try to do something to appeal to everyone. &lt;/p&gt;\n\n&lt;p&gt;Also, I have no problem with them repeating the jokes within one session, I mean to us it&amp;#39;s the same jokes for two weeks, but to them it&amp;#39;s the same jokes for a few hours which honestly seems reasonable. I mean, when I&amp;#39;m hanging out with friends for a few hours we might make the same jokes as long as it makes sense organically. I&amp;#39;m with the other people here in saying I&amp;#39;d really rather not try to force growth or force humor into a show just for the sake of a portion of the audience. It seems unfair to the other portion of the audience that doesn&amp;#39;t mind. Because at the end of the day, it&amp;#39;s their show, not our show and they can do whatever they please. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5zn3j", "score_hidden": false, "stickied": false, "created": 1492038493.0, "created_utc": 1492009693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6ncmh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RainbowTuba", "parent_id": "t1_dg6ll3c", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I agree that \"don't like, don't watch\" is bad, and I do agree that some of the Grumps humor is very repetitive and annoying.\n\nSadly, I don't see any way out of it. That's just Arin. It's always been Arin. It's gotten worse​, but that's because fans complained Arin into not bothering to read comments. Arin got a lot of hate for a while and now he pretty much ignores criticism, good or bad.\n\nJust my opinion, as you have yours.\n\nI love the Grumps, I watch them every day consistently, but there are moments where watching is a chore (every \"suck my dick\" song, entirety of OOT after episode 4, Mario 64, etc), i just feel like that lengthy dissertations on the Grumps quality of humor are pointless. I don't see them doing anything about it. People have been complaining admit the SMD song for literally years ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that &amp;quot;don&amp;#39;t like, don&amp;#39;t watch&amp;quot; is bad, and I do agree that some of the Grumps humor is very repetitive and annoying.&lt;/p&gt;\n\n&lt;p&gt;Sadly, I don&amp;#39;t see any way out of it. That&amp;#39;s just Arin. It&amp;#39;s always been Arin. It&amp;#39;s gotten worse​, but that&amp;#39;s because fans complained Arin into not bothering to read comments. Arin got a lot of hate for a while and now he pretty much ignores criticism, good or bad.&lt;/p&gt;\n\n&lt;p&gt;Just my opinion, as you have yours.&lt;/p&gt;\n\n&lt;p&gt;I love the Grumps, I watch them every day consistently, but there are moments where watching is a chore (every &amp;quot;suck my dick&amp;quot; song, entirety of OOT after episode 4, Mario 64, etc), i just feel like that lengthy dissertations on the Grumps quality of humor are pointless. I don&amp;#39;t see them doing anything about it. People have been complaining admit the SMD song for literally years &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ncmh", "score_hidden": false, "stickied": false, "created": 1492063651.0, "created_utc": 1492034851.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ll3c", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg6ddyy", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "\"I am definitely over the \"suck my dick\" song Arin always sings. That needs to die in a fire.\"\n\nA lot of us feel the same about especially a few select jokes of theirs. We want to enjoy the content, really we do, but we simply cannot anymore due to what problems we feel have been building up for a while.\n\nThat's why we hate \"don't like, don't watch,\" because we still care even if we don't enjoy the content, because we **want** to enjoy it again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I am definitely over the &amp;quot;suck my dick&amp;quot; song Arin always sings. That needs to die in a fire.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A lot of us feel the same about especially a few select jokes of theirs. We want to enjoy the content, really we do, but we simply cannot anymore due to what problems we feel have been building up for a while.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why we hate &amp;quot;don&amp;#39;t like, don&amp;#39;t watch,&amp;quot; because we still care even if we don&amp;#39;t enjoy the content, because we &lt;strong&gt;want&lt;/strong&gt; to enjoy it again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ll3c", "score_hidden": false, "stickied": false, "created": 1492061519.0, "created_utc": 1492032719.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ddyy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RainbowTuba", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "To paraphrase a recent Dan quote from a Kirby episode: \"How dare we say what makes us laugh!\"\n\nThese guys are lucky enough to make a profession out of sitting on a couch and making each other laugh. In that frame, I love watching them. \n\nI am definitely over the \"suck my dick\" song Arin always sings. That needs to die in a fire.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To paraphrase a recent Dan quote from a Kirby episode: &amp;quot;How dare we say what makes us laugh!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;These guys are lucky enough to make a profession out of sitting on a couch and making each other laugh. In that frame, I love watching them. &lt;/p&gt;\n\n&lt;p&gt;I am definitely over the &amp;quot;suck my dick&amp;quot; song Arin always sings. That needs to die in a fire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ddyy", "score_hidden": false, "stickied": false, "created": 1492052833.0, "created_utc": 1492024033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6ozhb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "YaMeenz", "parent_id": "t1_dg6m61b", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Honestly, if they cut back to three 20-30 minute episodes a week, I would be fine with that.\n\nSorry if I've misinterpreted you, because I do agree with most of what you're saying.  I think a lot of it has to do with Arin and Dan having already said what they've had to say and haven't had anything new to \"refresh\" the programming.  I still enjoy it, but I totally get why that gets old.\n\nEdit: THAT BEING SAID, I have taken extensive breaks from Game Grumps in the past, and have recently slimmed down the content I watch to 2-3 channels.  That has helped me better enjoy it, even if it does wear down on me at times.", "edited": 1492037188.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, if they cut back to three 20-30 minute episodes a week, I would be fine with that.&lt;/p&gt;\n\n&lt;p&gt;Sorry if I&amp;#39;ve misinterpreted you, because I do agree with most of what you&amp;#39;re saying.  I think a lot of it has to do with Arin and Dan having already said what they&amp;#39;ve had to say and haven&amp;#39;t had anything new to &amp;quot;refresh&amp;quot; the programming.  I still enjoy it, but I totally get why that gets old.&lt;/p&gt;\n\n&lt;p&gt;Edit: THAT BEING SAID, I have taken extensive breaks from Game Grumps in the past, and have recently slimmed down the content I watch to 2-3 channels.  That has helped me better enjoy it, even if it does wear down on me at times.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ozhb", "score_hidden": false, "stickied": false, "created": 1492065689.0, "created_utc": 1492036889.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m61b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg6br2z", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "1. Oh absolutely, I wasn't saying it should be like South Park. Rather, my point with referencing South Park is a bit more diversity and practice with the humor would be beneficial. And actually, speaking about content, some feel it may be too much content. That it's being spread too thinly.\n\n2. I don't think it'd have to go to that extreme, though. I think it's safe to say some form of compromised between the two methods can be reached, or at least learned from.\n\n3+ (cause last paragraph). Yes, I do agree there. It likely isn't to change, and for some of us, that's a shame. Maybe it is an overestimation, sure, yet at the same time, Early Dan era was pretty great, and I don't think my sense of humor has changed in only a few years.\n\nAs I said before, some consider it as, I think best described, as an oversaturation from their high content production. That perhaps rationing it out a bit better could help strengthen the show by offering more downtime.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Oh absolutely, I wasn&amp;#39;t saying it should be like South Park. Rather, my point with referencing South Park is a bit more diversity and practice with the humor would be beneficial. And actually, speaking about content, some feel it may be too much content. That it&amp;#39;s being spread too thinly.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t think it&amp;#39;d have to go to that extreme, though. I think it&amp;#39;s safe to say some form of compromised between the two methods can be reached, or at least learned from.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;3+ (cause last paragraph). Yes, I do agree there. It likely isn&amp;#39;t to change, and for some of us, that&amp;#39;s a shame. Maybe it is an overestimation, sure, yet at the same time, Early Dan era was pretty great, and I don&amp;#39;t think my sense of humor has changed in only a few years.&lt;/p&gt;\n\n&lt;p&gt;As I said before, some consider it as, I think best described, as an oversaturation from their high content production. That perhaps rationing it out a bit better could help strengthen the show by offering more downtime.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6m61b", "score_hidden": false, "stickied": false, "created": 1492062215.0, "created_utc": 1492033415.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6br2z", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "YaMeenz", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I might be a bit late, but I want to add some short counter points that you might appreciate.\n\n1. South Park, a written show that has evolved over the years to stay relevant, is very different than an improvised format like let's plays, not to mention they have less hands and put out way more content annually than South Park.\n\n2.  Let's plays are incredibly basic forms of entertainment, period.  You're not going to find super sophisticated humor, it's just people talking over a video game. The only way for them to develop and evolve is to add a larger editing element to the episodes.  Look at Funhaus for example, they trim an hour of gameplay down to 10-20 minute videos with a larger emphasis on visual editing.  If Game Grumps wants to evolve in this manner AND keep up with the current schedule, they will have to play significantly longer for less content.\n\n3. I honestly don't thing they are trying to pander to some mainstream audience; they just find immature humor funny.  This can be a little hit or miss, but can lead to great moments(e.g. Obama watches Game Grumps).  I think you're maybe overestimating the potential humor of Arin and Danny. \n\nI understand your frustrations with Game Grumps becoming \"stagnant\" but that's what it is, and that's what it's always been.  They do seem to be trying to push a more creative element into their programming with Doodle Dudes, which I think has a lot of potential, but I highly doubt they will change their let's play format anytime soon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I might be a bit late, but I want to add some short counter points that you might appreciate.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;South Park, a written show that has evolved over the years to stay relevant, is very different than an improvised format like let&amp;#39;s plays, not to mention they have less hands and put out way more content annually than South Park.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Let&amp;#39;s plays are incredibly basic forms of entertainment, period.  You&amp;#39;re not going to find super sophisticated humor, it&amp;#39;s just people talking over a video game. The only way for them to develop and evolve is to add a larger editing element to the episodes.  Look at Funhaus for example, they trim an hour of gameplay down to 10-20 minute videos with a larger emphasis on visual editing.  If Game Grumps wants to evolve in this manner AND keep up with the current schedule, they will have to play significantly longer for less content.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I honestly don&amp;#39;t thing they are trying to pander to some mainstream audience; they just find immature humor funny.  This can be a little hit or miss, but can lead to great moments(e.g. Obama watches Game Grumps).  I think you&amp;#39;re maybe overestimating the potential humor of Arin and Danny. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I understand your frustrations with Game Grumps becoming &amp;quot;stagnant&amp;quot; but that&amp;#39;s what it is, and that&amp;#39;s what it&amp;#39;s always been.  They do seem to be trying to push a more creative element into their programming with Doodle Dudes, which I think has a lot of potential, but I highly doubt they will change their let&amp;#39;s play format anytime soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6br2z", "score_hidden": false, "stickied": false, "created": 1492051132.0, "created_utc": 1492022332.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg5swic", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "chazzywizz", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "To be completely honest i don't watch gg for the comedy, if i laugh then great but i watch it to be entertained and there's a difference. I watch it cause i like Arin and Danny and I like watching them play fun or not so fun (get it) games. I did prefer them when they had original funny stories to tell but the current breath of the wild play through is great because the game is great and the hosts are enjoyable, this is all subjective mind you and if you watch it for the humour i understand being less interested in it now than before", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be completely honest i don&amp;#39;t watch gg for the comedy, if i laugh then great but i watch it to be entertained and there&amp;#39;s a difference. I watch it cause i like Arin and Danny and I like watching them play fun or not so fun (get it) games. I did prefer them when they had original funny stories to tell but the current breath of the wild play through is great because the game is great and the hosts are enjoyable, this is all subjective mind you and if you watch it for the humour i understand being less interested in it now than before&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5swic", "score_hidden": false, "stickied": false, "created": 1492029648.0, "created_utc": 1492000848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6j9uh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "morrocc", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "If GG were a scripted comedy show, I'd agree with you 100%. If \"I'm gonna pre\" and \"looks like you have a baby penis\" were jokes that were written into a script and practiced by Arin and Dan to get their delivery just right, I'd agree that the humor is lazy and appeals to the lowest common denominator. It's akin to the writing in Big Bang Theory where Sheldon just has to say \"Bazinga\" or other characters just need to reference a bunch of stereotypical \"nerdy\" things to get a laugh. But GG isn't scripted, nor is it strictly a comedy show. The show has always been about two friends playing games and just enjoying each other's company. That doesn't strictly mean they have to focus on the audience in their recording sessions. \n\nCase in point: how do you talk to your closest friends? If you're like me, your conversations meander between in-depth discussions about life and what we are dealing with at the moment (be it some piece of media we really like, an issue we're having with someone at work, or our changing outlook on the world around us); or attempts to make each other laugh which, given enough time, will ultimately devolve into the inside jokes we've developed with each other over the years. Arin and Danny do the same thing, and it just so happens that they managed to develop an audience that shares their humor and outlook on life. \n\nDoes the humor fall flat for the audience sometimes? Sure, but that's because they aren't trying to make the audience laugh. I doubt I could make thousands of people laugh at some of the inside jokes I've developed with my friends. Do their conversations sometimes get repetitive? Absolutely. But, try carrying on a conversation for hours on end for four straight years, and I bet you'd run into the same issues. Those problems are simply inherent to the GG format of two friends playing games and hanging out with each other. \n\nNow, does the format need to change? Sure. I'd personally prefer they stayed away from current releases and stick with obscure games from the 80s and 90s and wish they'd finish more games, but I think we'd still run into the same issues given enough time. \n\nAll of that being said, I have felt that, over the last year or so, Arin and Danny have been \"treading water\" so to speak. Aside from a few episodes here and there, neither of them have felt like they've been really energetic or passionate (aside from Arin rage). I feel like that has largely to do with their current workload. Not only are they recording GG episodes; they're also working on that Dan Harmon/Jesse Cox web series, performing GG Live and NSP/Starbomb shows across the country, and, for Danny in particular, working on two new NSP albums. Right now, they are stretched thin in terms of creativity and energy, and I think that is rubbing off on the actual recording sessions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If GG were a scripted comedy show, I&amp;#39;d agree with you 100%. If &amp;quot;I&amp;#39;m gonna pre&amp;quot; and &amp;quot;looks like you have a baby penis&amp;quot; were jokes that were written into a script and practiced by Arin and Dan to get their delivery just right, I&amp;#39;d agree that the humor is lazy and appeals to the lowest common denominator. It&amp;#39;s akin to the writing in Big Bang Theory where Sheldon just has to say &amp;quot;Bazinga&amp;quot; or other characters just need to reference a bunch of stereotypical &amp;quot;nerdy&amp;quot; things to get a laugh. But GG isn&amp;#39;t scripted, nor is it strictly a comedy show. The show has always been about two friends playing games and just enjoying each other&amp;#39;s company. That doesn&amp;#39;t strictly mean they have to focus on the audience in their recording sessions. &lt;/p&gt;\n\n&lt;p&gt;Case in point: how do you talk to your closest friends? If you&amp;#39;re like me, your conversations meander between in-depth discussions about life and what we are dealing with at the moment (be it some piece of media we really like, an issue we&amp;#39;re having with someone at work, or our changing outlook on the world around us); or attempts to make each other laugh which, given enough time, will ultimately devolve into the inside jokes we&amp;#39;ve developed with each other over the years. Arin and Danny do the same thing, and it just so happens that they managed to develop an audience that shares their humor and outlook on life. &lt;/p&gt;\n\n&lt;p&gt;Does the humor fall flat for the audience sometimes? Sure, but that&amp;#39;s because they aren&amp;#39;t trying to make the audience laugh. I doubt I could make thousands of people laugh at some of the inside jokes I&amp;#39;ve developed with my friends. Do their conversations sometimes get repetitive? Absolutely. But, try carrying on a conversation for hours on end for four straight years, and I bet you&amp;#39;d run into the same issues. Those problems are simply inherent to the GG format of two friends playing games and hanging out with each other. &lt;/p&gt;\n\n&lt;p&gt;Now, does the format need to change? Sure. I&amp;#39;d personally prefer they stayed away from current releases and stick with obscure games from the 80s and 90s and wish they&amp;#39;d finish more games, but I think we&amp;#39;d still run into the same issues given enough time. &lt;/p&gt;\n\n&lt;p&gt;All of that being said, I have felt that, over the last year or so, Arin and Danny have been &amp;quot;treading water&amp;quot; so to speak. Aside from a few episodes here and there, neither of them have felt like they&amp;#39;ve been really energetic or passionate (aside from Arin rage). I feel like that has largely to do with their current workload. Not only are they recording GG episodes; they&amp;#39;re also working on that Dan Harmon/Jesse Cox web series, performing GG Live and NSP/Starbomb shows across the country, and, for Danny in particular, working on two new NSP albums. Right now, they are stretched thin in terms of creativity and energy, and I think that is rubbing off on the actual recording sessions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6j9uh", "score_hidden": false, "stickied": false, "created": 1492058893.0, "created_utc": 1492030093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg66fq6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ShanTechNi", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I feel so smart all of a sudden!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel so smart all of a sudden!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg66fq6", "score_hidden": false, "stickied": false, "created": 1492045747.0, "created_utc": 1492016947.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg5xj3z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pizzaweed74", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "This kind of thread has popped up in the subreddit since the show's first year. I don't really have anything to add to this discussion, this is just more of an observation to try and maybe comfort some people I guess, and this is all obviously opinion, but I just want to say that after watching this show for almost 5 years, its quality always seems to oscillate back and forth. It's a characteristic Game Grumps has always had, even when you think it keeps getting less and less natural, more forced, more repetitive, more derivative and cheap, it somehow comes back into form. \n\nI remember it having major dips near the end of Jon's era, and somewhen after Dan ran out of stories to tell and became more comfortable with the show and Arin's mannerisms, and started being more of a yes man. Some people were mad, some defended it, it lasted a while but it eventually dissipated. It's back now with people complaining about their lack of originality and lethargy. And I agree, I'd say it's in a big dip right now and the only saving graces are Doodle Doods and some of the episodes with guests IMO. But after quitting watching the show and coming back an embarassing amount of times already, I think it's worth it to stop watching for a month or two and come back afterwards. \n\nI don't know how they surpass it when the show is in bad form, but they always seem to do it somehow. For me OneyPlays has been a good alternative, in the meantime. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This kind of thread has popped up in the subreddit since the show&amp;#39;s first year. I don&amp;#39;t really have anything to add to this discussion, this is just more of an observation to try and maybe comfort some people I guess, and this is all obviously opinion, but I just want to say that after watching this show for almost 5 years, its quality always seems to oscillate back and forth. It&amp;#39;s a characteristic Game Grumps has always had, even when you think it keeps getting less and less natural, more forced, more repetitive, more derivative and cheap, it somehow comes back into form. &lt;/p&gt;\n\n&lt;p&gt;I remember it having major dips near the end of Jon&amp;#39;s era, and somewhen after Dan ran out of stories to tell and became more comfortable with the show and Arin&amp;#39;s mannerisms, and started being more of a yes man. Some people were mad, some defended it, it lasted a while but it eventually dissipated. It&amp;#39;s back now with people complaining about their lack of originality and lethargy. And I agree, I&amp;#39;d say it&amp;#39;s in a big dip right now and the only saving graces are Doodle Doods and some of the episodes with guests IMO. But after quitting watching the show and coming back an embarassing amount of times already, I think it&amp;#39;s worth it to stop watching for a month or two and come back afterwards. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how they surpass it when the show is in bad form, but they always seem to do it somehow. For me OneyPlays has been a good alternative, in the meantime. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5xj3z", "score_hidden": false, "stickied": false, "created": 1492036071.0, "created_utc": 1492007271.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6g7gp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Revolsin", "parent_id": "t1_dg5t1ne", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "&gt;about games they actually care about finishing\n\nUhhhh, were we watching the same show? They have a worse track record for finishing stuff than GG. They basically couldn't care less. Sometimes they'll even put up a finale thumbnail halfway into one so they never have to go back to it. \n\nOneyplays is great, but them being great has nothing to do with wanting to finish games.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;about games they actually care about finishing&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Uhhhh, were we watching the same show? They have a worse track record for finishing stuff than GG. They basically couldn&amp;#39;t care less. Sometimes they&amp;#39;ll even put up a finale thumbnail halfway into one so they never have to go back to it. &lt;/p&gt;\n\n&lt;p&gt;Oneyplays is great, but them being great has nothing to do with wanting to finish games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6g7gp", "score_hidden": false, "stickied": false, "created": 1492055718.0, "created_utc": 1492026918.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5t1ne", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "YouGotDoddified", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "You're right, but there's not a lot that can be done about it.\n\nSince the start of the year, there's been 13 series of games played. Of those 13, they've completed **three.** The best part is that basically noone cares about it. They'll have the odd group of people asking what happened to X series, but there's no real incentive to see a game through to the end unless it's incredibly popular. Start a new game; ride the new-game hype momentum for 2-3 episodes of talking about cool stuff they'll never get to/yelling about how bad the game is; move on to the next. \n\nAppealing to the lowest common denominator is probably super easy and profitable, which is why they're doing it. A significant enough number of GG fans are kids, teens and young adults who are used to the 'Egoraptor' personality that involves lots of yelling, swearing and poopy-ass-dicks. They're not going to care about content quality or commitment to finishing a game- **they just want to listen to the Arin and Danny talk about stupid shit.** If that pulls in the regular viewers, then why should they try to improve?\n___\nIf you want classic GG-style humour with legitimately funny commentary about games they actually care about finishing, watch [OneyPlays](https://www.youtube.com/user/OneysVideoHole) and pray the Grumps don't hire him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right, but there&amp;#39;s not a lot that can be done about it.&lt;/p&gt;\n\n&lt;p&gt;Since the start of the year, there&amp;#39;s been 13 series of games played. Of those 13, they&amp;#39;ve completed &lt;strong&gt;three.&lt;/strong&gt; The best part is that basically noone cares about it. They&amp;#39;ll have the odd group of people asking what happened to X series, but there&amp;#39;s no real incentive to see a game through to the end unless it&amp;#39;s incredibly popular. Start a new game; ride the new-game hype momentum for 2-3 episodes of talking about cool stuff they&amp;#39;ll never get to/yelling about how bad the game is; move on to the next. &lt;/p&gt;\n\n&lt;p&gt;Appealing to the lowest common denominator is probably super easy and profitable, which is why they&amp;#39;re doing it. A significant enough number of GG fans are kids, teens and young adults who are used to the &amp;#39;Egoraptor&amp;#39; personality that involves lots of yelling, swearing and poopy-ass-dicks. They&amp;#39;re not going to care about content quality or commitment to finishing a game- &lt;strong&gt;they just want to listen to the Arin and Danny talk about stupid shit.&lt;/strong&gt; If that pulls in the regular viewers, then why should they try to improve?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;If you want classic GG-style humour with legitimately funny commentary about games they actually care about finishing, watch &lt;a href=\"https://www.youtube.com/user/OneysVideoHole\"&gt;OneyPlays&lt;/a&gt; and pray the Grumps don&amp;#39;t hire him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5t1ne", "score_hidden": false, "stickied": false, "created": 1492029883.0, "created_utc": 1492001083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6m7w7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg5ta0m", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I refer you to bulletpoint #1.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I refer you to bulletpoint #1.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6m7w7", "score_hidden": false, "stickied": false, "created": 1492062278.0, "created_utc": 1492033478.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ta0m", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "Mystic_Taco", "parent_id": "t1_dg5szqm", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Never said they were wrong.  I like the content they make,  so I will watch,  if your don't then don't watch", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never said they were wrong.  I like the content they make,  so I will watch,  if your don&amp;#39;t then don&amp;#39;t watch&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5ta0m", "score_hidden": false, "stickied": false, "created": 1492030259.0, "created_utc": 1492001459.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5szqm", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "chazzywizz", "parent_id": "t1_dg5qnqo", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "But consider this....................... It isn't funny to them, they don't like it, it should go, and a large number of people feel the same way. You can't just say someone's wrong because you disagree? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But consider this....................... It isn&amp;#39;t funny to them, they don&amp;#39;t like it, it should go, and a large number of people feel the same way. You can&amp;#39;t just say someone&amp;#39;s wrong because you disagree? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5szqm", "score_hidden": false, "stickied": false, "created": 1492029795.0, "created_utc": 1492000995.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qnqo", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Mystic_Taco", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "But consider this....................... It's funny, we like it, so it should stay", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But consider this....................... It&amp;#39;s funny, we like it, so it should stay&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5qnqo", "score_hidden": false, "stickied": false, "created": 1492025223.0, "created_utc": 1491996423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg684nv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AGlassBox", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I have thought that the Grumps have recently been very funny. These most recent episodes may be the funniest I've seen in a while. \n\nThe repeated jokes, stop being funny, sure, but it's really unfair to say that that is ALL they do. They are hanging out. Have you ever gotten into an annoying voice with friends, unable to stop even after it stopped being funny? I know I have, but they also tell some genuinely interesting stories, and some well though out jokes as well. \n\n   They are not just comedy, but kind of create this feeling of hanging out with your buds. Sometimes I gotta take a break from Grumps, cuz I don't care to hear dick jokes for a while. They absolutely have some better jokes in there, but they also have the baser, crass humor. \n\nWhen you get down to it, they are just two dudes, with lives. Of Course I want to see them grow, and in my opinion they have. Quite a bit. They take classes and things, which they mention, but with any comedian there are ups and downs, especially in something as laid back and casual as a let's play.\n\nAs far as I see, they are getting better. That's my honest opinion. I think the bathroom humor is funny, but it does get old, but there are some really great jokes in there besides those. That's just my opinion. I like them, and have been more into them then ever recently", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have thought that the Grumps have recently been very funny. These most recent episodes may be the funniest I&amp;#39;ve seen in a while. &lt;/p&gt;\n\n&lt;p&gt;The repeated jokes, stop being funny, sure, but it&amp;#39;s really unfair to say that that is ALL they do. They are hanging out. Have you ever gotten into an annoying voice with friends, unable to stop even after it stopped being funny? I know I have, but they also tell some genuinely interesting stories, and some well though out jokes as well. &lt;/p&gt;\n\n&lt;p&gt;They are not just comedy, but kind of create this feeling of hanging out with your buds. Sometimes I gotta take a break from Grumps, cuz I don&amp;#39;t care to hear dick jokes for a while. They absolutely have some better jokes in there, but they also have the baser, crass humor. &lt;/p&gt;\n\n&lt;p&gt;When you get down to it, they are just two dudes, with lives. Of Course I want to see them grow, and in my opinion they have. Quite a bit. They take classes and things, which they mention, but with any comedian there are ups and downs, especially in something as laid back and casual as a let&amp;#39;s play.&lt;/p&gt;\n\n&lt;p&gt;As far as I see, they are getting better. That&amp;#39;s my honest opinion. I think the bathroom humor is funny, but it does get old, but there are some really great jokes in there besides those. That&amp;#39;s just my opinion. I like them, and have been more into them then ever recently&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg684nv", "score_hidden": false, "stickied": false, "created": 1492047446.0, "created_utc": 1492018646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg68njn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BZeeB", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Def agree.  I think a great example of a 'level-up' in terms of let's play comedy is anything to do with Griffin McElroy.\n\nHe does [monster factory](https://www.youtube.com/watch?v=bn4x_BRqIpI), carboys, [cool-games inc.](https://www.youtube.com/watch?v=N_lyPkBsbDM) on polygon and the My Brother, My Brother, and Me Podcast.\n\nBut you def see a lot of cuts esp with monster factory - to showcase those best lines.  Something game grumps never does - due to their high output volume to keepup with youtube's ad revenue policies.  Trying to come up with comedy while also trying to focus on a game is super tough.  Esp since they do these long recording sessions to capture all the content. Being 'On' for 8+ hours is really taxing.\n\nI wonder if they prepped a bit - at least on like something to goof around on like let's bring up icejj-fish, joke yoda, etc it would help them (similar to how my brother my brother, and me operate using yahoo questions to spark the comedy).  I'd love to see Arin expand on his personas too.\n\nGo back and look at Trauma Center, Sonic Boom, Wind Waker, etc - def some of my favorites.", "edited": 1492020016.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Def agree.  I think a great example of a &amp;#39;level-up&amp;#39; in terms of let&amp;#39;s play comedy is anything to do with Griffin McElroy.&lt;/p&gt;\n\n&lt;p&gt;He does &lt;a href=\"https://www.youtube.com/watch?v=bn4x_BRqIpI\"&gt;monster factory&lt;/a&gt;, carboys, &lt;a href=\"https://www.youtube.com/watch?v=N_lyPkBsbDM\"&gt;cool-games inc.&lt;/a&gt; on polygon and the My Brother, My Brother, and Me Podcast.&lt;/p&gt;\n\n&lt;p&gt;But you def see a lot of cuts esp with monster factory - to showcase those best lines.  Something game grumps never does - due to their high output volume to keepup with youtube&amp;#39;s ad revenue policies.  Trying to come up with comedy while also trying to focus on a game is super tough.  Esp since they do these long recording sessions to capture all the content. Being &amp;#39;On&amp;#39; for 8+ hours is really taxing.&lt;/p&gt;\n\n&lt;p&gt;I wonder if they prepped a bit - at least on like something to goof around on like let&amp;#39;s bring up icejj-fish, joke yoda, etc it would help them (similar to how my brother my brother, and me operate using yahoo questions to spark the comedy).  I&amp;#39;d love to see Arin expand on his personas too.&lt;/p&gt;\n\n&lt;p&gt;Go back and look at Trauma Center, Sonic Boom, Wind Waker, etc - def some of my favorites.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg68njn", "score_hidden": false, "stickied": false, "created": 1492047972.0, "created_utc": 1492019172.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg67r5q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Parker4815", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 1, "body": "I don't get why posts like these keep appearing. It's an internet show. Just let them do what they feel comfortable with doing and telling the jokes that they tell. If you don't find them funny any more, then that's fine, you really don't have to watch. It's not going back to the way it used to be.\n\nYou treat this like it's got a team of writers behind the show, test audiences, massive PR teams like an actual TV show. But it's just a bunch of friends making videos whilst playing games and made a living from it. Yes they could be richer, and more popular and bigger on YouTube, but they seem happy with doing what they do. That's all that should matter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t get why posts like these keep appearing. It&amp;#39;s an internet show. Just let them do what they feel comfortable with doing and telling the jokes that they tell. If you don&amp;#39;t find them funny any more, then that&amp;#39;s fine, you really don&amp;#39;t have to watch. It&amp;#39;s not going back to the way it used to be.&lt;/p&gt;\n\n&lt;p&gt;You treat this like it&amp;#39;s got a team of writers behind the show, test audiences, massive PR teams like an actual TV show. But it&amp;#39;s just a bunch of friends making videos whilst playing games and made a living from it. Yes they could be richer, and more popular and bigger on YouTube, but they seem happy with doing what they do. That&amp;#39;s all that should matter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg67r5q", "score_hidden": false, "stickied": false, "created": 1492047069.0, "created_utc": 1492018269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6ls5e", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg680ow", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Not necessarily more scripted, but more broad. Or perhaps more observational. If you want the best example of it, something like Rifftrax. Not that I'm saying it needs to be entirely that, mind, or as good.\n\nMore than anything, I'd say it's a matter of diversity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not necessarily more scripted, but more broad. Or perhaps more observational. If you want the best example of it, something like Rifftrax. Not that I&amp;#39;m saying it needs to be entirely that, mind, or as good.&lt;/p&gt;\n\n&lt;p&gt;More than anything, I&amp;#39;d say it&amp;#39;s a matter of diversity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ls5e", "score_hidden": false, "stickied": false, "created": 1492061752.0, "created_utc": 1492032952.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg680ow", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "penpenw", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Ask yourself: are you obsessed with colons? \n\nAnswer me this: does Bruno Mars is gay?\n\nAll jokes aside, I feel like you have a fair amount of points here but I feel like this all comes down to a different in sense of humour. I feel like what you're asking is that the show becomes less spur of the moment and more scripted. Yes, there seems to be this mass dislike with the \"I'm gonna pre\" joke (which is hilariously meta in itself) but they're riffing off the top of their heads. Due to the nature of the show itself, they don't follow what many would consider to be \"comedy rules\" like the rule of three. It's messy, it's unkempt but that's always been what Game Grumps was and is. I would disagree that the quality of their comedy has gone down or they're playing to a less mature audience. The D-Club is one of the most revered jokes from the show and it consists of nothing but dick jokes.\n\nThis is an interesting perspective but I just don't subscribe to it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ask yourself: are you obsessed with colons? &lt;/p&gt;\n\n&lt;p&gt;Answer me this: does Bruno Mars is gay?&lt;/p&gt;\n\n&lt;p&gt;All jokes aside, I feel like you have a fair amount of points here but I feel like this all comes down to a different in sense of humour. I feel like what you&amp;#39;re asking is that the show becomes less spur of the moment and more scripted. Yes, there seems to be this mass dislike with the &amp;quot;I&amp;#39;m gonna pre&amp;quot; joke (which is hilariously meta in itself) but they&amp;#39;re riffing off the top of their heads. Due to the nature of the show itself, they don&amp;#39;t follow what many would consider to be &amp;quot;comedy rules&amp;quot; like the rule of three. It&amp;#39;s messy, it&amp;#39;s unkempt but that&amp;#39;s always been what Game Grumps was and is. I would disagree that the quality of their comedy has gone down or they&amp;#39;re playing to a less mature audience. The D-Club is one of the most revered jokes from the show and it consists of nothing but dick jokes.&lt;/p&gt;\n\n&lt;p&gt;This is an interesting perspective but I just don&amp;#39;t subscribe to it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg680ow", "score_hidden": false, "stickied": false, "created": 1492047334.0, "created_utc": 1492018534.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7gt0r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg72y0o", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "That's a good question. It's nothing specific, it's a gradual thing, but around Sonic Boom has been floated out there. Good ones were ones like Mario Sunshine, Mario 3D World, Kirby's Dream Course (not the modded one).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a good question. It&amp;#39;s nothing specific, it&amp;#39;s a gradual thing, but around Sonic Boom has been floated out there. Good ones were ones like Mario Sunshine, Mario 3D World, Kirby&amp;#39;s Dream Course (not the modded one).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7gt0r", "score_hidden": false, "stickied": false, "created": 1492115015.0, "created_utc": 1492086215.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72y0o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nick700", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "When would you say was their best time period? And when did the decline to this period begin?\n\nI'd like to watch some and compare ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When would you say was their best time period? And when did the decline to this period begin?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to watch some and compare &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg72y0o", "score_hidden": false, "stickied": false, "created": 1492083178.0, "created_utc": 1492054378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7gv2p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg75vpi", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "See, it seems to me like 12~17 is actually fairly extreme in terms of demographics. Though I admit I was always a bit different than others around me, so it may simply be that I cannot relate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See, it seems to me like 12~17 is actually fairly extreme in terms of demographics. Though I admit I was always a bit different than others around me, so it may simply be that I cannot relate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7gv2p", "score_hidden": false, "stickied": false, "created": 1492115114.0, "created_utc": 1492086314.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75vpi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "seykitty", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "You really opened this with a chip on your shoulder. I'm not entirely sure why.\n\nI'm sick so I can't really engage you well. My brain isn't entirely there. I would like to point out that here the 'lowest common denominator' would be the common age of their viewers. You pander TO your audience in order to get $$$. That might sound harsh, but I believe that's why a lot of these jokes are getting extraordinarily long shelf life. In a common audience of 12-17 y/o you're going to get a lot of mileage out of 'MYYYY PUUUSSSSSSSSSY'. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really opened this with a chip on your shoulder. I&amp;#39;m not entirely sure why.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick so I can&amp;#39;t really engage you well. My brain isn&amp;#39;t entirely there. I would like to point out that here the &amp;#39;lowest common denominator&amp;#39; would be the common age of their viewers. You pander TO your audience in order to get $$$. That might sound harsh, but I believe that&amp;#39;s why a lot of these jokes are getting extraordinarily long shelf life. In a common audience of 12-17 y/o you&amp;#39;re going to get a lot of mileage out of &amp;#39;MYYYY PUUUSSSSSSSSSY&amp;#39;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg75vpi", "score_hidden": false, "stickied": false, "created": 1492087719.0, "created_utc": 1492058919.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7cccw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Throrface", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Your whole critique is based on judging the Game Grumps as comedians and evaluating their comedy and it seems like you expect to laugh while watching the show.\n\nI don't watch the show for that. I treat it as a talk show, and the main thing that interests me is the people in the talk show. The Grumps are like my proxy friends. The most interesting thing for me is when they \"real talk\" about what new is happening in their lives. When something makes me smirk while I watch, it's a plus, but it's just like talking with a real friend (or... being out with two friends and being the third guy that never talks but enjoys the company). You don't expect from your friend a good and varied routine of original jokes with good delivery and timing and whatnot. You expect a conversation... hopefully pleasant... and you crack jokes as you feel like.\n\nSo yeah. I think you and I just have wildly differing expectations from the show. I can say for myself that I love watching Game Grumps, and I'm a 27yo dude who is not particularly amused by toilet humour.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your whole critique is based on judging the Game Grumps as comedians and evaluating their comedy and it seems like you expect to laugh while watching the show.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t watch the show for that. I treat it as a talk show, and the main thing that interests me is the people in the talk show. The Grumps are like my proxy friends. The most interesting thing for me is when they &amp;quot;real talk&amp;quot; about what new is happening in their lives. When something makes me smirk while I watch, it&amp;#39;s a plus, but it&amp;#39;s just like talking with a real friend (or... being out with two friends and being the third guy that never talks but enjoys the company). You don&amp;#39;t expect from your friend a good and varied routine of original jokes with good delivery and timing and whatnot. You expect a conversation... hopefully pleasant... and you crack jokes as you feel like.&lt;/p&gt;\n\n&lt;p&gt;So yeah. I think you and I just have wildly differing expectations from the show. I can say for myself that I love watching Game Grumps, and I&amp;#39;m a 27yo dude who is not particularly amused by toilet humour.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7cccw", "score_hidden": false, "stickied": false, "created": 1492103759.0, "created_utc": 1492074959.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg84ax3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jnb64", "parent_id": "t1_dg7h683", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I think it's more a combination of...\n\nA) They have what? 4000-odd videos now? Anybody would run out of things to say. And...\n\nB) Dan really isn't much of a gamer. Lots of JonGrumps was them actually talking about games. DanGrumps is basically a podcast about Dan and Arin's lives, with occasional discussion about the game they're playing. Exacerbating this is that Dan doesn't have strong opinions, whereas Jon and Arin both do, so they'd debate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s more a combination of...&lt;/p&gt;\n\n&lt;p&gt;A) They have what? 4000-odd videos now? Anybody would run out of things to say. And...&lt;/p&gt;\n\n&lt;p&gt;B) Dan really isn&amp;#39;t much of a gamer. Lots of JonGrumps was them actually talking about games. DanGrumps is basically a podcast about Dan and Arin&amp;#39;s lives, with occasional discussion about the game they&amp;#39;re playing. Exacerbating this is that Dan doesn&amp;#39;t have strong opinions, whereas Jon and Arin both do, so they&amp;#39;d debate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg84ax3", "score_hidden": false, "stickied": false, "created": 1492142030.0, "created_utc": 1492113230.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7h683", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg7d31i", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "I do wonder if perhaps the channel expanded too quickly, and thus to compensate, they had to make that sacrifice to keep up with that expansion, knowingly or otherwise.\n\nCause now the problem is if they slow down, or if they take a break, or anything that disrupts current pace, it could have serious damage, yet those are also the best options. So it's a damned if you do, damned if you don't, situations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do wonder if perhaps the channel expanded too quickly, and thus to compensate, they had to make that sacrifice to keep up with that expansion, knowingly or otherwise.&lt;/p&gt;\n\n&lt;p&gt;Cause now the problem is if they slow down, or if they take a break, or anything that disrupts current pace, it could have serious damage, yet those are also the best options. So it&amp;#39;s a damned if you do, damned if you don&amp;#39;t, situations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7h683", "score_hidden": false, "stickied": false, "created": 1492115638.0, "created_utc": 1492086838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d31i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jnb64", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Remember when Jon and Arin played Yoshi's Island and they made fun of sub-grubbing Youtube channels who ask for subs and have a Subscribe end card.\n\nRemember when Jon and Arin would police each other against \"just making silly voices\" and \"just making noises\" because they had integrity and didn't want to just be like PewDiePie?\n\nEverything Grumps is today, Jon and Arin made fun of and swore against in the first year. Don't get me wrong, I understand it. Grumps is Too Big To Fail -- they *have* to play the game and give up *some* degree of their integrity to stay afloat. They're employing over a dozen people, now, it would be irresponsible to be a stickler at the expense of views and money.\n\nStill...it is sad. It's sad that the world works in such a way that you have to give up your integrity to get ahead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember when Jon and Arin played Yoshi&amp;#39;s Island and they made fun of sub-grubbing Youtube channels who ask for subs and have a Subscribe end card.&lt;/p&gt;\n\n&lt;p&gt;Remember when Jon and Arin would police each other against &amp;quot;just making silly voices&amp;quot; and &amp;quot;just making noises&amp;quot; because they had integrity and didn&amp;#39;t want to just be like PewDiePie?&lt;/p&gt;\n\n&lt;p&gt;Everything Grumps is today, Jon and Arin made fun of and swore against in the first year. Don&amp;#39;t get me wrong, I understand it. Grumps is Too Big To Fail -- they &lt;em&gt;have&lt;/em&gt; to play the game and give up &lt;em&gt;some&lt;/em&gt; degree of their integrity to stay afloat. They&amp;#39;re employing over a dozen people, now, it would be irresponsible to be a stickler at the expense of views and money.&lt;/p&gt;\n\n&lt;p&gt;Still...it is sad. It&amp;#39;s sad that the world works in such a way that you have to give up your integrity to get ahead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7d31i", "score_hidden": false, "stickied": false, "created": 1492106033.0, "created_utc": 1492077233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg5zfsl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "paladinarndt", "parent_id": "t1_dg5yfa5", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Reading is hard. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading is hard. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5zfsl", "score_hidden": false, "stickied": false, "created": 1492038265.0, "created_utc": 1492009465.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yfa5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MisterSympa", "parent_id": "t1_dg5ti3n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "Did you not read any of the beginning?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you not read any of the beginning?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5yfa5", "score_hidden": false, "stickied": false, "created": 1492037116.0, "created_utc": 1492008316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg6df53", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RainbowTuba", "parent_id": "t1_dg5ti3n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "It's almost like you didn't bother to read even two sentences!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s almost like you didn&amp;#39;t bother to read even two sentences!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6df53", "score_hidden": false, "stickied": false, "created": 1492052866.0, "created_utc": 1492024066.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg63kyq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MagicBlacksmith", "parent_id": "t1_dg5ti3n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 1, "body": "Oh, blow me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, blow me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg63kyq", "score_hidden": false, "stickied": false, "created": 1492042790.0, "created_utc": 1492013990.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ti3n", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "Onlyusemifeet", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "...Just go to rantgrumps bruh. There is an entire sub dedicated to whiners like you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;...Just go to rantgrumps bruh. There is an entire sub dedicated to whiners like you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg5ti3n", "score_hidden": false, "stickied": false, "created": 1492030617.0, "created_utc": 1492001817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ulfu", "removal_reason": null, "link_id": "t3_64xg6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7gzia", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "S_G_Redbear", "parent_id": "t1_dg6ugtw", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "And? It's not like I spent months on it. It was like less than an hour. And besides, critical thinking is a good thing to practice and it helps promote brain stimulation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And? It&amp;#39;s not like I spent months on it. It was like less than an hour. And besides, critical thinking is a good thing to practice and it helps promote brain stimulation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg7gzia", "score_hidden": false, "stickied": false, "created": 1492115324.0, "created_utc": 1492086524.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ugtw", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "TerryB2HQ", "parent_id": "t3_64xg6n", "subreddit_name_prefixed": "r/gamegrumps", "controversiality": 0, "body": "When you type a novel critiquing someone/a brand/company far more successful than you will ever be, instead of making something of your own life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you type a novel critiquing someone/a brand/company far more successful than you will ever be, instead of making something of your own life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamegrumps", "name": "t1_dg6ugtw", "score_hidden": false, "stickied": false, "created": 1492072455.0, "created_utc": 1492043655.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]