[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "simpleliving", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;how did you find the balance between choosing to live a simple life, or trying to chase a dream? i mean, dreams are just dreams, but sometimes you can work toward a goal.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;i&amp;#39;m stuck between wanting to live a simple life, or maybe entering the rat race and trying to &amp;quot;make it&amp;quot;. i just don&amp;#39;t know if it&amp;#39;s worth the try, it&amp;#39;s just that i always hear people say they regret not trying. not to be pessimistic, but most attempts at dreams fail, and i dont want to waste years of my life for nothing.&lt;/p&gt;\n\n&lt;p&gt;should i let go of silly fantasies and settle, but make thebest out of it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "how did you find the balance between choosing to live a simple life, or trying to chase a dream? i mean, dreams are just dreams, but sometimes you can work toward a goal.\n\n------\ni'm stuck between wanting to live a simple life, or maybe entering the rat race and trying to \"make it\". i just don't know if it's worth the try, it's just that i always hear people say they regret not trying. not to be pessimistic, but most attempts at dreams fail, and i dont want to waste years of my life for nothing.\n\nshould i let go of silly fantasies and settle, but make thebest out of it?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pann", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "[deleted]", "saved": false, "mod_reports": [], "name": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "approved_by": null, "over_18": false, "domain": "self.simpleliving", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r0za", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/simpleliving/comments/65pann/struggling_to_find_the_balance/", "num_reports": null, "locked": false, "stickied": false, "created": 1492380878.0, "url": "https://www.reddit.com/r/simpleliving/comments/65pann/struggling_to_find_the_balance/", "author_flair_text": null, "quarantine": false, "title": "struggling to find the balance?", "created_utc": 1492352078.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgcx2sg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "furysawa", "parent_id": "t1_dgc56mb", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "As /u/shenanigansintensify mentions about the marriage between /r/financialindependence and /r/simpleliving (which I subscribe to as well, and am one of the many who aim for FI/RE), there is some pragmatism that you should consider when chasing dreams. I personally have never seen the rat race as \"making it\" and it is a brutal experience. Contrarily I find great value in being free of the rat race, financial burden, and wage slavery while doing the simple things I love. \n\nBut if I had any advice to give, the younger you are and the less responsibilities you carry the better when chasing after wilder dreams. In your early to mid 20's you have room to make mistakes and take bigger financial risks because you still have time on your side--particularly if you don't have children or a mortgage that is. But back to pragmatism, it can be lofty for example, to believe you can run a business and find immediate wealth and success--if that is what you are looking for. Goals require pragmatism and careful calculation of risk.\n\nI also think it's the wrong approach to think of the time you spend towards a goal as \"wasted time\" if not achieved. Everything in life is an experience to draw wisdom from and the pursuit has value too. Additionally, I don't see a conflict of interest between living simply and joining the rat race. You can definitely do both.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As &lt;a href=\"/u/shenanigansintensify\"&gt;/u/shenanigansintensify&lt;/a&gt; mentions about the marriage between &lt;a href=\"/r/financialindependence\"&gt;/r/financialindependence&lt;/a&gt; and &lt;a href=\"/r/simpleliving\"&gt;/r/simpleliving&lt;/a&gt; (which I subscribe to as well, and am one of the many who aim for FI/RE), there is some pragmatism that you should consider when chasing dreams. I personally have never seen the rat race as &amp;quot;making it&amp;quot; and it is a brutal experience. Contrarily I find great value in being free of the rat race, financial burden, and wage slavery while doing the simple things I love. &lt;/p&gt;\n\n&lt;p&gt;But if I had any advice to give, the younger you are and the less responsibilities you carry the better when chasing after wilder dreams. In your early to mid 20&amp;#39;s you have room to make mistakes and take bigger financial risks because you still have time on your side--particularly if you don&amp;#39;t have children or a mortgage that is. But back to pragmatism, it can be lofty for example, to believe you can run a business and find immediate wealth and success--if that is what you are looking for. Goals require pragmatism and careful calculation of risk.&lt;/p&gt;\n\n&lt;p&gt;I also think it&amp;#39;s the wrong approach to think of the time you spend towards a goal as &amp;quot;wasted time&amp;quot; if not achieved. Everything in life is an experience to draw wisdom from and the pursuit has value too. Additionally, I don&amp;#39;t see a conflict of interest between living simply and joining the rat race. You can definitely do both.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgcx2sg", "score_hidden": false, "stickied": false, "created": 1492422081.0, "created_utc": 1492393281.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc56mb", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "shenanigansintensify", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "It's not like simpleliving is a relgion. I subscribe to this sub because I like elements of it and can incorporate what I like into my life. \n\nRecently I started following /r/financialindependence and learning about FI/RE (financial independence/retire early) - the overall premise as I understand it is that you aim to earn large amounts of money early in life and invest wisely while living far below your means so that eventually you can live off of your investments and not have to work at all. So you may be very ambitious in your career and financial goals while living a simple life otherwise.\n\nThere's no reason to prioritize simple living over your dreams - if you feel passionate about something that doesn't seem compatible with simple living, maybe simple living isn't for you. Or just apply principles of living simply to your life while pursuing your dreams to the extent that it doesn't interfere. Your life is what you make it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not like simpleliving is a relgion. I subscribe to this sub because I like elements of it and can incorporate what I like into my life. &lt;/p&gt;\n\n&lt;p&gt;Recently I started following &lt;a href=\"/r/financialindependence\"&gt;/r/financialindependence&lt;/a&gt; and learning about FI/RE (financial independence/retire early) - the overall premise as I understand it is that you aim to earn large amounts of money early in life and invest wisely while living far below your means so that eventually you can live off of your investments and not have to work at all. So you may be very ambitious in your career and financial goals while living a simple life otherwise.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no reason to prioritize simple living over your dreams - if you feel passionate about something that doesn&amp;#39;t seem compatible with simple living, maybe simple living isn&amp;#39;t for you. Or just apply principles of living simply to your life while pursuing your dreams to the extent that it doesn&amp;#39;t interfere. Your life is what you make it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgc56mb", "score_hidden": false, "stickied": false, "created": 1492385018.0, "created_utc": 1492356218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgc4jja", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "wafflekoan", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "You only have one life. And your life is basically the only thing you truly have. So I think it's best to live it the way you want, so long as it doesn't hurt others.\n\nI've achieved my \"silly\" dream. I'm a novelist. I get to spend my days writing stories. But life is still stressful and often difficult and definitely not perfect. I love that I've been able to achieve this, I wouldn't trade it for anything, but I've still got struggles. There is no promised land... when you achieve your dream, be it something like I do or your goal of living a simple life, there will still be obstacles. That's life.\n\nThere's nothing silly about going after something. It's what life is actually about. Do you think, at the end, you'll regret not doing the thing you dream of? Then it's probably something you should do. I know that if I had continued down the \"settle\" path I was on, I most definitely would have regretted it. Now, even though I still have my problems, I know what living the dream feels like. I feel almost the same as I did before, but now I'm in *control*. And that difference informs me that the risk I took was worth it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You only have one life. And your life is basically the only thing you truly have. So I think it&amp;#39;s best to live it the way you want, so long as it doesn&amp;#39;t hurt others.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve achieved my &amp;quot;silly&amp;quot; dream. I&amp;#39;m a novelist. I get to spend my days writing stories. But life is still stressful and often difficult and definitely not perfect. I love that I&amp;#39;ve been able to achieve this, I wouldn&amp;#39;t trade it for anything, but I&amp;#39;ve still got struggles. There is no promised land... when you achieve your dream, be it something like I do or your goal of living a simple life, there will still be obstacles. That&amp;#39;s life.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing silly about going after something. It&amp;#39;s what life is actually about. Do you think, at the end, you&amp;#39;ll regret not doing the thing you dream of? Then it&amp;#39;s probably something you should do. I know that if I had continued down the &amp;quot;settle&amp;quot; path I was on, I most definitely would have regretted it. Now, even though I still have my problems, I know what living the dream feels like. I feel almost the same as I did before, but now I&amp;#39;m in &lt;em&gt;control&lt;/em&gt;. And that difference informs me that the risk I took was worth it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgc4jja", "score_hidden": false, "stickied": false, "created": 1492384115.0, "created_utc": 1492355315.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgc35f1", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "RusticSet", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "I can relate somewhat, but my situation is different.   I enjoy competing with horses, and that clashes a little bit with the type of simple living that I'm attracted to.\nHere's a few questions to ask yourself that may shed light on what's important to you.\nWhat is this \"making it\" that you are writing about?  Is it a higher income, a job title, above average socio economic status?  \nWhat do YOU consider to be a successful life?\nWhat activities bring you happiness or joy?\nAnother phrase that may help you to look through a different lense is \"right livlihood\".  What is the right livlihood for me?  For some reason that seems easier to answer than using words like career, business, job,   and so on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate somewhat, but my situation is different.   I enjoy competing with horses, and that clashes a little bit with the type of simple living that I&amp;#39;m attracted to.\nHere&amp;#39;s a few questions to ask yourself that may shed light on what&amp;#39;s important to you.\nWhat is this &amp;quot;making it&amp;quot; that you are writing about?  Is it a higher income, a job title, above average socio economic status?&lt;br/&gt;\nWhat do YOU consider to be a successful life?\nWhat activities bring you happiness or joy?\nAnother phrase that may help you to look through a different lense is &amp;quot;right livlihood&amp;quot;.  What is the right livlihood for me?  For some reason that seems easier to answer than using words like career, business, job,   and so on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgc35f1", "score_hidden": false, "stickied": false, "created": 1492381995.0, "created_utc": 1492353195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgc4y2m", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Acealone9", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "OP what you do mean by making it? Being rich? Being admired? Making a difference in the world? I'd like to hear more detail about what you mean. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP what you do mean by making it? Being rich? Being admired? Making a difference in the world? I&amp;#39;d like to hear more detail about what you mean. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgc4y2m", "score_hidden": false, "stickied": false, "created": 1492384687.0, "created_utc": 1492355887.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgc5ym0", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "LeanFIREThrowaway", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "You could always try \"making it\" for a year or so and see how you feel about it. It's not an all or nothing situation--if you enter the rat race and decide it's not for you, you can always quit and find something else.\n\nIf there's anything I've learned in life, it's that sometimes you just can't know until you try it. Sure, it doesn't always work out, but at least you'll know for sure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could always try &amp;quot;making it&amp;quot; for a year or so and see how you feel about it. It&amp;#39;s not an all or nothing situation--if you enter the rat race and decide it&amp;#39;s not for you, you can always quit and find something else.&lt;/p&gt;\n\n&lt;p&gt;If there&amp;#39;s anything I&amp;#39;ve learned in life, it&amp;#39;s that sometimes you just can&amp;#39;t know until you try it. Sure, it doesn&amp;#39;t always work out, but at least you&amp;#39;ll know for sure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgc5ym0", "score_hidden": false, "stickied": false, "created": 1492386087.0, "created_utc": 1492357287.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgc4mol", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "biacktuesday", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "I don't know about the finding balance part as I am still chasing my dreams, working, in grad school, and trying to be a good family member, significant other, and friend. Balance is probably what I need to work on more than anything else.\n\nWhat I wonder in your situation is: does trying to chase your dream for a few years and it not working out mean it was a waste?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about the finding balance part as I am still chasing my dreams, working, in grad school, and trying to be a good family member, significant other, and friend. Balance is probably what I need to work on more than anything else.&lt;/p&gt;\n\n&lt;p&gt;What I wonder in your situation is: does trying to chase your dream for a few years and it not working out mean it was a waste?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgc4mol", "score_hidden": false, "stickied": false, "created": 1492384237.0, "created_utc": 1492355437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgciamb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "getridoferrything11", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "I started this journey in November. I didn't do a single massive purge, but I gradually worked my way down through my things whilst simultaneously making lifestyle changes (eating meat less, going organic, deciding to start exercising, no TV at all rather than simply no cable, etc)\n\nI have found that the deeper down the rabbit hole I get, the more freedom I get. I know you might not believe me as you're coming here saying that you feel conflicted, but I can promise you that I was the same way. When I first started becoming a minimalist I remember thinking to myself - \"there is no way I will get rid of x!\", yet here I am now, so much farther down the road. Every time I taste a little more freedom, I yearn for even more of it.\n\nThe deeper/longer you go with this, the more free you become. What is worth more than your freedom? \n\nBtw, there is nothing wrong with having a job, no shame in that at ALL. How are you going to live without an income, unless you already have been setting up investments to prepare for FIRE/LEANFIRE?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started this journey in November. I didn&amp;#39;t do a single massive purge, but I gradually worked my way down through my things whilst simultaneously making lifestyle changes (eating meat less, going organic, deciding to start exercising, no TV at all rather than simply no cable, etc)&lt;/p&gt;\n\n&lt;p&gt;I have found that the deeper down the rabbit hole I get, the more freedom I get. I know you might not believe me as you&amp;#39;re coming here saying that you feel conflicted, but I can promise you that I was the same way. When I first started becoming a minimalist I remember thinking to myself - &amp;quot;there is no way I will get rid of x!&amp;quot;, yet here I am now, so much farther down the road. Every time I taste a little more freedom, I yearn for even more of it.&lt;/p&gt;\n\n&lt;p&gt;The deeper/longer you go with this, the more free you become. What is worth more than your freedom? &lt;/p&gt;\n\n&lt;p&gt;Btw, there is nothing wrong with having a job, no shame in that at ALL. How are you going to live without an income, unless you already have been setting up investments to prepare for FIRE/LEANFIRE?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgciamb", "score_hidden": false, "stickied": false, "created": 1492402400.0, "created_utc": 1492373600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgc7arb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dig_trace", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "&gt; how did you find the balance between choosing to live a simple life, or trying to chase a dream?\n\nI find there's no balance to be struck here.  Getting rid of all the excess in my life gives me time to focus on what is most important.  My career, my health, good times with friends, *these are important*.\n\nThink of your distractions.  Do you want to exchange time with friends for time at work?  Probably not.  Do you want to exchange time in front of the TV, or shopping for the newest iPad, etc, for time spent on your career?  That seems far more likely.", "edited": 1492359509.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;how did you find the balance between choosing to live a simple life, or trying to chase a dream?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I find there&amp;#39;s no balance to be struck here.  Getting rid of all the excess in my life gives me time to focus on what is most important.  My career, my health, good times with friends, &lt;em&gt;these are important&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Think of your distractions.  Do you want to exchange time with friends for time at work?  Probably not.  Do you want to exchange time in front of the TV, or shopping for the newest iPad, etc, for time spent on your career?  That seems far more likely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgc7arb", "score_hidden": false, "stickied": false, "created": 1492387903.0, "created_utc": 1492359103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgcaij4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HaveMyUpboats", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "Like everything else, you pick the good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like everything else, you pick the good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgcaij4", "score_hidden": false, "stickied": false, "created": 1492392117.0, "created_utc": 1492363317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgccqkw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chippychips4t", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "My thoughts would be if you are young with a \"safety net\" of family and friends and no responsibilities go for you dreams- at least you can tell yourself you went after them, even if it doesnt work quite as imagined. I do however think there is also a time in life when the best course of action is to be honest and realistic with yourself. Particually if you have kids and elderly parents to support. It just depends on your life situation and your own conscience and values.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My thoughts would be if you are young with a &amp;quot;safety net&amp;quot; of family and friends and no responsibilities go for you dreams- at least you can tell yourself you went after them, even if it doesnt work quite as imagined. I do however think there is also a time in life when the best course of action is to be honest and realistic with yourself. Particually if you have kids and elderly parents to support. It just depends on your life situation and your own conscience and values.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgccqkw", "score_hidden": false, "stickied": false, "created": 1492395054.0, "created_utc": 1492366254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgcjcnl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hpcross10", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "Life is all about the ~betweens~ life sways from simple to driven back and forth, and like driving country roads to cities there are spaces between that connect experiences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life is all about the ~betweens~ life sways from simple to driven back and forth, and like driving country roads to cities there are spaces between that connect experiences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgcjcnl", "score_hidden": false, "stickied": false, "created": 1492403764.0, "created_utc": 1492374964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgck2yi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mister_Mist", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "Personally, I always wanted to live a simple life of self-sufficiency but that requires money to get started. \n\nSo then I got educated at University and entered the dreaded rat-race in order to earn enough to achieve my dream. It was OK at times but a total nightmare at other not to mention exhausting. But keeping myself fit got me through it.\n\nSo now I am really am living the dream! But is was damned hard work getting here! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I always wanted to live a simple life of self-sufficiency but that requires money to get started. &lt;/p&gt;\n\n&lt;p&gt;So then I got educated at University and entered the dreaded rat-race in order to earn enough to achieve my dream. It was OK at times but a total nightmare at other not to mention exhausting. But keeping myself fit got me through it.&lt;/p&gt;\n\n&lt;p&gt;So now I am really am living the dream! But is was damned hard work getting here! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgck2yi", "score_hidden": false, "stickied": false, "created": 1492404698.0, "created_utc": 1492375898.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgctj51", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wh33t", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "\"Have realistic dreams that fall in line with your own personal moral code\"\n\nMy two cents. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Have realistic dreams that fall in line with your own personal moral code&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My two cents. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgctj51", "score_hidden": false, "stickied": false, "created": 1492417410.0, "created_utc": 1492388610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dged2zx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pteroc", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "a very wise man once said, \"don't let your dreams be dreams... make your dreams come true!\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a very wise man once said, &amp;quot;don&amp;#39;t let your dreams be dreams... make your dreams come true!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dged2zx", "score_hidden": false, "stickied": false, "created": 1492502942.0, "created_utc": 1492474142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0za", "removal_reason": null, "link_id": "t3_65pann", "likes": null, "replies": "", "user_reports": [], "id": "dgf4ldn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Xiphos462", "parent_id": "t3_65pann", "subreddit_name_prefixed": "r/simpleliving", "controversiality": 0, "body": "Simple life to me is just having enough that if the shit were to hit the fan (laid off, fired quit) you have more than enough to get by and can take an entry level job in a new/different industry and not have to borrow or eat ramen for months until you move up the ladder.\n\nThat same set up is ideal for pursuing your dream whatever that may be. When you get the mortgage, the car note, the baby, credit cards you still owe on, yada yada those are all anchors that keep you tethered to the same \"Settle down\" cycle. It limits your choices and you're never free to pursue anything else, even if it's still a 9-5er in a different industry that fits you where you may have to start off lower.\n\nAnd \"rat race\".  A lot of people subscribe to it but i bet they couldnt define it. That's why their lives suck. they compare themselves to everyone else, want attention from everyone else for things that the others are accomplishing also, therefore it's not much of an accomplishment and they end up crabs in a bucket. You're really only racing yourself, not others.and if it's yourself that you're racing with you decide the length of the race, the turns, when you want to stop, when you want to throttle, etc. nobody else does.", "edited": 1492524163.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Simple life to me is just having enough that if the shit were to hit the fan (laid off, fired quit) you have more than enough to get by and can take an entry level job in a new/different industry and not have to borrow or eat ramen for months until you move up the ladder.&lt;/p&gt;\n\n&lt;p&gt;That same set up is ideal for pursuing your dream whatever that may be. When you get the mortgage, the car note, the baby, credit cards you still owe on, yada yada those are all anchors that keep you tethered to the same &amp;quot;Settle down&amp;quot; cycle. It limits your choices and you&amp;#39;re never free to pursue anything else, even if it&amp;#39;s still a 9-5er in a different industry that fits you where you may have to start off lower.&lt;/p&gt;\n\n&lt;p&gt;And &amp;quot;rat race&amp;quot;.  A lot of people subscribe to it but i bet they couldnt define it. That&amp;#39;s why their lives suck. they compare themselves to everyone else, want attention from everyone else for things that the others are accomplishing also, therefore it&amp;#39;s not much of an accomplishment and they end up crabs in a bucket. You&amp;#39;re really only racing yourself, not others.and if it&amp;#39;s yourself that you&amp;#39;re racing with you decide the length of the race, the turns, when you want to stop, when you want to throttle, etc. nobody else does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "simpleliving", "name": "t1_dgf4ldn", "score_hidden": true, "stickied": false, "created": 1492552400.0, "created_utc": 1492523600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]