[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Fallout", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For me, it was coming across that cabin in the woods where you find a lone skeleton, a bedroll and a note. The note details a girl who has run away from home after her parents practically disown her because she happened to get pregnant. So now she&amp;#39;s alone, pregnant and with no one to help her emotionally. Then, all of a sudden the bombs fall. This girl dies alone, in pure emotionally agony and her story is lost to the world. I don&amp;#39;t know, that little mini story really struck a chord with me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For me, it was coming across that cabin in the woods where you find a lone skeleton, a bedroll and a note. The note details a girl who has run away from home after her parents practically disown her because she happened to get pregnant. So now she's alone, pregnant and with no one to help her emotionally. Then, all of a sudden the bombs fall. This girl dies alone, in pure emotionally agony and her story is lost to the world. I don't know, that little mini story really struck a chord with me. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "657zll", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 194, "report_reasons": null, "author": "HardwareHentai", "saved": false, "mod_reports": [], "name": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "approved_by": null, "over_18": false, "domain": "self.Fallout", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2qnzu", "edited": false, "link_flair_css_class": "disc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/Fallout/comments/657zll/spoilers_what_was_the_most_emotionally_intense/", "num_reports": null, "locked": false, "stickied": false, "created": 1492143228.0, "url": "https://www.reddit.com/r/Fallout/comments/657zll/spoilers_what_was_the_most_emotionally_intense/", "author_flair_text": null, "quarantine": false, "title": "[SPOILERS] What was the most emotionally intense thing you've experienced while playing Fallout 4?", "created_utc": 1492114428.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 104, "visited": false, "subreddit_type": "public", "ups": 194}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9jfll", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WyrdHarper", "parent_id": "t1_dg9jb1q", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Aw thanks! Right back at ya :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aw thanks! Right back at ya :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9jfll", "score_hidden": false, "stickied": false, "created": 1492223474.0, "created_utc": 1492194674.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jb1q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "goblett", "parent_id": "t1_dg9eol9", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I feel that feel. Have an upvote... And a hug", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel that feel. Have an upvote... And a hug&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9jb1q", "score_hidden": false, "stickied": false, "created": 1492223321.0, "created_utc": 1492194521.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9eol9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "WyrdHarper", "parent_id": "t1_dg9a3sp", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Fallout has its highs for me, too. But it speaks well to the environmental and atmospheric design that it can really impact you sometimes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fallout has its highs for me, too. But it speaks well to the environmental and atmospheric design that it can really impact you sometimes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9eol9", "score_hidden": false, "stickied": false, "created": 1492217935.0, "created_utc": 1492189135.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9a3sp", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "goblett", "parent_id": "t1_dg8r0mn", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Yet some of us play games to escape the depressing reality of real life :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yet some of us play games to escape the depressing reality of real life :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9a3sp", "score_hidden": false, "stickied": false, "created": 1492212774.0, "created_utc": 1492183974.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8r0mn", "gilded": 0, "archived": false, "score": 83, "report_reasons": null, "author": "WyrdHarper", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Mine's kind of a weird one. I was clearing out the Gunner camp in the northeast for the first time, and I had killed everyone except the boss lady (a named captain). And I'm up on the highway some distance away from her, hidden, looking at her through my scope. And she just walks up to her table and looks out at the sunset, and just stands there.\n\nThis being Fallout I snipe her, killing her instantly. And as I walk up I hear the song she was listening to on the radio: It's the End of the World. And it just got to me for some reason. There was just something so humanly tragic about this person looking out at the sunset, knowing death was probably coming, listening to that song. I had to actually walk away from the game for a little while. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mine&amp;#39;s kind of a weird one. I was clearing out the Gunner camp in the northeast for the first time, and I had killed everyone except the boss lady (a named captain). And I&amp;#39;m up on the highway some distance away from her, hidden, looking at her through my scope. And she just walks up to her table and looks out at the sunset, and just stands there.&lt;/p&gt;\n\n&lt;p&gt;This being Fallout I snipe her, killing her instantly. And as I walk up I hear the song she was listening to on the radio: It&amp;#39;s the End of the World. And it just got to me for some reason. There was just something so humanly tragic about this person looking out at the sunset, knowing death was probably coming, listening to that song. I had to actually walk away from the game for a little while. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8r0mn", "score_hidden": false, "stickied": false, "created": 1492172429.0, "created_utc": 1492143629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 83}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8utz4", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "f0rm4n", "parent_id": "t1_dg8mywd", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I totally missed the second one, but Arlen Glass' story really hit me when I first experienced it, that small quest is a lot more fleshed out then most of the main story quests, just incredible storytelling and VA work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally missed the second one, but Arlen Glass&amp;#39; story really hit me when I first experienced it, that small quest is a lot more fleshed out then most of the main story quests, just incredible storytelling and VA work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8utz4", "score_hidden": false, "stickied": false, "created": 1492180056.0, "created_utc": 1492151256.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg90gay", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Wheredoesthetoastgo2", "parent_id": "t1_dg8mywd", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "If there is one person who can convince anyone of good storytelling in fallout 4, it's oxhorn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If there is one person who can convince anyone of good storytelling in fallout 4, it&amp;#39;s oxhorn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg90gay", "score_hidden": false, "stickied": false, "created": 1492196972.0, "created_utc": 1492168172.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9d28u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Strikersquad", "parent_id": "t1_dg8mywd", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Another thing that kinda hits me about Arlen is the fact that his office is just one the few places that is just untouched by time. It's those kinds of places that i like about the game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another thing that kinda hits me about Arlen is the fact that his office is just one the few places that is just untouched by time. It&amp;#39;s those kinds of places that i like about the game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9d28u", "score_hidden": false, "stickied": false, "created": 1492216110.0, "created_utc": 1492187310.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mywd", "gilded": 0, "archived": false, "score": 64, "report_reasons": null, "author": "Kami-Kahzy", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "There's plenty that stick out to me, but two of the biggest ones are the quest line for Arlen Glass and one very particular mini-scene that I always make a point to visit in each playthrough.\n\nArlen Glass Spoilers:\n[For those that don't know, Arlen Glass was the chief toy designer at Wilson Atomatoys before the war. You meet him as a unique ghoul at The Slog, and he sets you on a quest to get some spare parts so he can fix up an old Giddyup Buttercup. You can do this and earn some caps, but if you want the full extent of his story you need to travel to the Wilson Atomatoys Corporate HQ on your own. The place has been overrun with super mutants, and after you clear it out you have the chance to work your way into the head office, Arlen Glass' office. Inside is his desk and a door leading to his personal workshop, and inside that is a holotape recording of his wife and daughter. It's just a simple goodnight message, something for him to listen to while he's at work so he can think of them. In his old life Arlen was a workaholic and buried himself in his work, still a loving father but never taking enough time to spend with his family. When the bombs fell, one of them impacted directly in his neighborhood and killed his family instantly. If you bring the holotape back to Arlen you get to witness him listen to it for the first time in over two centuries. The grief on this man's face is palpable, and you can see the years of pain and regret flowing out of his posture and voice. It hit me hard to see him relive such painful, but fond memories. After the tape is finished he thanks you profusely for the gesture, and mentions he's going to finish his current project, then leave the Slog. If you come back to the Slog after a few days you notice that Arlen is gone, and the only things left in his workspace are some tools, a thank you note, and a recently fixed Giddyup Buttercup model.](/spoiler)\n\nThere's a fantastic video that details the story of Arlen Glass [here](https://www.youtube.com/watch?v=qSS03vzzSjE) for those that wish to see.\n\nThe other scene that always sticks with me is one of those special little scenes that Bethesda likes to sneak into their games. It's a posed skeleton in one of the subway stations, I forget which one but my gut says it's the one that you go down with Glory for the first time. Early in the subway station is a little drugstore concession area with a ghoul hanging out behind a product shelf, and to the left of that shelf is a female bathroom. Inside said bathroom there is an empty baby pram sitting outside one of the stalls. Inside that stall there is a single skeleton wearing a dress, with her hand shoved down the toilet, clutching a baby's rattle. There is absolutely no other clarifying information than what is presented so this scene could be taken a lot of ways. But my personal interpretation is this: This woman was one of the unfortunate souls caught in the initial Boston blast. Since she was underground she survived the 'Big Boom', but her mind was shaken by the chaos erupting around her that she came to a very dark and sudden conclusion. She looks down at her child in the crib and realizes the world this child is about to be subject too. And rather than allow her child to come to any harm or horrific end in this apocalypse, she takes her baby and drowns it in the subway toilet out of mercy.\n\nA grisly thought, but one that I think is possible given the extreme circumstances of the day.", "edited": 1492138324.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s plenty that stick out to me, but two of the biggest ones are the quest line for Arlen Glass and one very particular mini-scene that I always make a point to visit in each playthrough.&lt;/p&gt;\n\n&lt;p&gt;Arlen Glass Spoilers:\n&lt;a href=\"/spoiler\"&gt;For those that don&amp;#39;t know, Arlen Glass was the chief toy designer at Wilson Atomatoys before the war. You meet him as a unique ghoul at The Slog, and he sets you on a quest to get some spare parts so he can fix up an old Giddyup Buttercup. You can do this and earn some caps, but if you want the full extent of his story you need to travel to the Wilson Atomatoys Corporate HQ on your own. The place has been overrun with super mutants, and after you clear it out you have the chance to work your way into the head office, Arlen Glass&amp;#39; office. Inside is his desk and a door leading to his personal workshop, and inside that is a holotape recording of his wife and daughter. It&amp;#39;s just a simple goodnight message, something for him to listen to while he&amp;#39;s at work so he can think of them. In his old life Arlen was a workaholic and buried himself in his work, still a loving father but never taking enough time to spend with his family. When the bombs fell, one of them impacted directly in his neighborhood and killed his family instantly. If you bring the holotape back to Arlen you get to witness him listen to it for the first time in over two centuries. The grief on this man&amp;#39;s face is palpable, and you can see the years of pain and regret flowing out of his posture and voice. It hit me hard to see him relive such painful, but fond memories. After the tape is finished he thanks you profusely for the gesture, and mentions he&amp;#39;s going to finish his current project, then leave the Slog. If you come back to the Slog after a few days you notice that Arlen is gone, and the only things left in his workspace are some tools, a thank you note, and a recently fixed Giddyup Buttercup model.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a fantastic video that details the story of Arlen Glass &lt;a href=\"https://www.youtube.com/watch?v=qSS03vzzSjE\"&gt;here&lt;/a&gt; for those that wish to see.&lt;/p&gt;\n\n&lt;p&gt;The other scene that always sticks with me is one of those special little scenes that Bethesda likes to sneak into their games. It&amp;#39;s a posed skeleton in one of the subway stations, I forget which one but my gut says it&amp;#39;s the one that you go down with Glory for the first time. Early in the subway station is a little drugstore concession area with a ghoul hanging out behind a product shelf, and to the left of that shelf is a female bathroom. Inside said bathroom there is an empty baby pram sitting outside one of the stalls. Inside that stall there is a single skeleton wearing a dress, with her hand shoved down the toilet, clutching a baby&amp;#39;s rattle. There is absolutely no other clarifying information than what is presented so this scene could be taken a lot of ways. But my personal interpretation is this: This woman was one of the unfortunate souls caught in the initial Boston blast. Since she was underground she survived the &amp;#39;Big Boom&amp;#39;, but her mind was shaken by the chaos erupting around her that she came to a very dark and sudden conclusion. She looks down at her child in the crib and realizes the world this child is about to be subject too. And rather than allow her child to come to any harm or horrific end in this apocalypse, she takes her baby and drowns it in the subway toilet out of mercy.&lt;/p&gt;\n\n&lt;p&gt;A grisly thought, but one that I think is possible given the extreme circumstances of the day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8mywd", "score_hidden": false, "stickied": false, "created": 1492166150.0, "created_utc": 1492137350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 64}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8hjta", "gilded": 0, "archived": false, "score": 109, "report_reasons": null, "author": "scoobygotabooty", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I remember running around with Piper. I found her dialogue to be quite interesting so far, so I enjoyed having her around. We took a break outside an abandoned house we were about to explore. She took the opportunity to inform me of her past grievances and traumatic events. In the middle of her story, however, she was mowed down by a Super Mutant, mini gun and all. The primary emotion was rage, and the reaction was bloodlust. It would have been ten times worse if companions died.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember running around with Piper. I found her dialogue to be quite interesting so far, so I enjoyed having her around. We took a break outside an abandoned house we were about to explore. She took the opportunity to inform me of her past grievances and traumatic events. In the middle of her story, however, she was mowed down by a Super Mutant, mini gun and all. The primary emotion was rage, and the reaction was bloodlust. It would have been ten times worse if companions died.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8hjta", "score_hidden": false, "stickied": false, "created": 1492158638.0, "created_utc": 1492129838.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 109}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9nzid", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Onebodytomany", "parent_id": "t1_dg9jcdq", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "It's on xbox. It's big tho.  Like almost a gig if I remember right ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s on xbox. It&amp;#39;s big tho.  Like almost a gig if I remember right &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9nzid", "score_hidden": false, "stickied": false, "created": 1492228957.0, "created_utc": 1492200157.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jcdq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "goblett", "parent_id": "t1_dg9fiuv", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I have an Xbone. Guess I'll check tomorrow", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have an Xbone. Guess I&amp;#39;ll check tomorrow&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9jcdq", "score_hidden": false, "stickied": false, "created": 1492223366.0, "created_utc": 1492194566.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fiuv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sanderlebau", "parent_id": "t1_dg9eypt", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I doubt it's on the PS4 as its a rather large mod but it might be on XBONE", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I doubt it&amp;#39;s on the PS4 as its a rather large mod but it might be on XBONE&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9fiuv", "score_hidden": false, "stickied": false, "created": 1492218899.0, "created_utc": 1492190099.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9eypt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "goblett", "parent_id": "t1_dg8toxh", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Is this mod on console? Sounds like a goood mod", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this mod on console? Sounds like a goood mod&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9eypt", "score_hidden": false, "stickied": false, "created": 1492218254.0, "created_utc": 1492189454.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8toxh", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "Sanderlebau", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "It's from Tales from the Commonwealth, but the girl who traveled to Diamond City to get an abortion after being raped. You meet her outside the Diamond City doctor, and you have to talk to her multiple times to get her to tell you her story. Afterwards she just walks off into the wasteland. \n\n\nAs soon as I met her, I decided I wouldn't let her come to harm anymore. I escorted her across Boston, through massive groups of super mutants. She almost died a few times, but Dogmeat and I kept her safe. Eventually we reached her destination, which was a clearing south east of Sanctuary. I build a whole settlement around her (using mods) to keep her safe. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s from Tales from the Commonwealth, but the girl who traveled to Diamond City to get an abortion after being raped. You meet her outside the Diamond City doctor, and you have to talk to her multiple times to get her to tell you her story. Afterwards she just walks off into the wasteland. &lt;/p&gt;\n\n&lt;p&gt;As soon as I met her, I decided I wouldn&amp;#39;t let her come to harm anymore. I escorted her across Boston, through massive groups of super mutants. She almost died a few times, but Dogmeat and I kept her safe. Eventually we reached her destination, which was a clearing south east of Sanctuary. I build a whole settlement around her (using mods) to keep her safe. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8toxh", "score_hidden": false, "stickied": false, "created": 1492177462.0, "created_utc": 1492148662.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8w9k4", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Icarus-96", "parent_id": "t1_dg8u2xj", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I feel like the game subtly fucked with me in there, the skeletons were breathing like they were npcs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like the game subtly fucked with me in there, the skeletons were breathing like they were npcs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8w9k4", "score_hidden": false, "stickied": false, "created": 1492183799.0, "created_utc": 1492154999.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg90sxv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "phillymjs", "parent_id": "t1_dg8u2xj", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I don't have kids but that was still a heartbreaking find. I stopped playing and took a break until the next day after I found that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have kids but that was still a heartbreaking find. I stopped playing and took a break until the next day after I found that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg90sxv", "score_hidden": false, "stickied": false, "created": 1492197923.0, "created_utc": 1492169123.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8u2xj", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "dgm345", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The junkyard where the dad built a makeshift bunker for his family. You get in there and realize the air vents failed. There are two small graves with I think a teddy bear and a baseball glove. There are two skeletons holding each other in bed with a gun nearby.\n\nAs a father of two kids this got to me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The junkyard where the dad built a makeshift bunker for his family. You get in there and realize the air vents failed. There are two small graves with I think a teddy bear and a baseball glove. There are two skeletons holding each other in bed with a gun nearby.&lt;/p&gt;\n\n&lt;p&gt;As a father of two kids this got to me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8u2xj", "score_hidden": false, "stickied": false, "created": 1492178306.0, "created_utc": 1492149506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8q1ro", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "_JackDoe_", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Listening to the torture log holotapes in Covenant were pretty rough. The man has a family that loves and depends on him, and here he is about to die being repeatedly shocked and asked which position he'd play in baseball.  \nHis answer was catcher, because he liked the \"funny helmets\" he saw them wear in a picture once when he was a kid.  \nDunno why but that line kind of made him feel more real than just some random fucking wastelander who was in the wrong place at the wrong time. His voice actor was stellar too he sounded like he was holding back sobs the whole time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Listening to the torture log holotapes in Covenant were pretty rough. The man has a family that loves and depends on him, and here he is about to die being repeatedly shocked and asked which position he&amp;#39;d play in baseball.&lt;br/&gt;\nHis answer was catcher, because he liked the &amp;quot;funny helmets&amp;quot; he saw them wear in a picture once when he was a kid.&lt;br/&gt;\nDunno why but that line kind of made him feel more real than just some random fucking wastelander who was in the wrong place at the wrong time. His voice actor was stellar too he sounded like he was holding back sobs the whole time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8q1ro", "score_hidden": false, "stickied": false, "created": 1492170850.0, "created_utc": 1492142050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9o87m", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Onebodytomany", "parent_id": "t1_dg8im71", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Yeh, out kids shouldn't be in a warship. Then again, my kids never going to have to fight very day for survival if he wants to go outside. He will never need to touch or own a gun. To us,Yeh, it would not be a good thing for our kids to be on a warship somewhere. But in the fallout world, everyone needs to learn how to protect themselves. They fight off giant mutated creatures on a daily basis...so really it makes sense to train them how to survive,  doesn't it? And where would be a better place to learn how to fight, on a giant warship surrounded by heavily armed men and woman. I think it makes sense. The world they kids are inheriting is awful, it makes sense to me to train them to be tough enough to survive it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeh, out kids shouldn&amp;#39;t be in a warship. Then again, my kids never going to have to fight very day for survival if he wants to go outside. He will never need to touch or own a gun. To us,Yeh, it would not be a good thing for our kids to be on a warship somewhere. But in the fallout world, everyone needs to learn how to protect themselves. They fight off giant mutated creatures on a daily basis...so really it makes sense to train them how to survive,  doesn&amp;#39;t it? And where would be a better place to learn how to fight, on a giant warship surrounded by heavily armed men and woman. I think it makes sense. The world they kids are inheriting is awful, it makes sense to me to train them to be tough enough to survive it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9o87m", "score_hidden": false, "stickied": false, "created": 1492229252.0, "created_utc": 1492200452.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8im71", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "Riomaki", "parent_id": "t1_dg8fy9y", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Kids shouldn't be on a warship.  The fact that they are - that they get indoctrinated into that military culture so quickly - is really quite disturbing when you think about it.  Still, it feels like a bit of an oversight to have this hand-wavy \"Sound the evacuation alarms\" for the Institute which lets you off the hook, but not have something similar for the Prydwen.", "edited": 1492131479.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kids shouldn&amp;#39;t be on a warship.  The fact that they are - that they get indoctrinated into that military culture so quickly - is really quite disturbing when you think about it.  Still, it feels like a bit of an oversight to have this hand-wavy &amp;quot;Sound the evacuation alarms&amp;quot; for the Institute which lets you off the hook, but not have something similar for the Prydwen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8im71", "score_hidden": false, "stickied": false, "created": 1492160087.0, "created_utc": 1492131287.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8xwog", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "DamnFineHat", "parent_id": "t1_dg8w9px", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "He's a bigoted tyrant cat. He'd watch a pre-war ghoul slowly burn to death and not so much as hike a leg to piss on the flames. He goes down with the ship.\n\nSee you in Hell, Emmett, you furry, fascist, feline *fuck*. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s a bigoted tyrant cat. He&amp;#39;d watch a pre-war ghoul slowly burn to death and not so much as hike a leg to piss on the flames. He goes down with the ship.&lt;/p&gt;\n\n&lt;p&gt;See you in Hell, Emmett, you furry, fascist, feline &lt;em&gt;fuck&lt;/em&gt;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8xwog", "score_hidden": false, "stickied": false, "created": 1492188843.0, "created_utc": 1492160043.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8w9px", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Lopjing", "parent_id": "t1_dg8fy9y", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I would feel bad about killing the cat ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would feel bad about killing the cat &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8w9px", "score_hidden": false, "stickied": false, "created": 1492183813.0, "created_utc": 1492155013.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8fy9y", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "DeathofTimes", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Blowing up the Prydwen. I killed all the adults, and all the kids are running around hiding and then up where you're supposed to place the bombs there are these chalk drawing by on of the kids. I was so upset the game wouldn't let me do anything about it. Say do the Minutemen ending all you want. Blowing up the Institute wouldn't stop the fighting between the Railroad and Brotherhood in any logical world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Blowing up the Prydwen. I killed all the adults, and all the kids are running around hiding and then up where you&amp;#39;re supposed to place the bombs there are these chalk drawing by on of the kids. I was so upset the game wouldn&amp;#39;t let me do anything about it. Say do the Minutemen ending all you want. Blowing up the Institute wouldn&amp;#39;t stop the fighting between the Railroad and Brotherhood in any logical world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8fy9y", "score_hidden": false, "stickied": false, "created": 1492156429.0, "created_utc": 1492127629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8xyje", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "DamnFineHat", "parent_id": "t1_dg8tcas", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Today's been *great*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Today&amp;#39;s been &lt;em&gt;great&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8xyje", "score_hidden": false, "stickied": false, "created": 1492189012.0, "created_utc": 1492160212.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg90jng", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Wheredoesthetoastgo2", "parent_id": "t1_dg8tcas", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Could be worse. Could be a Mariners fan. Scuse me, I have another cask of booze to down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could be worse. Could be a Mariners fan. Scuse me, I have another cask of booze to down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg90jng", "score_hidden": false, "stickied": false, "created": 1492197231.0, "created_utc": 1492168431.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8tcas", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "SupportstheOP", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Having my favorite ballpark turned into a shanty town", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having my favorite ballpark turned into a shanty town&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8tcas", "score_hidden": false, "stickied": false, "created": 1492176744.0, "created_utc": 1492147944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8udnb", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "jaytoddz", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The lady dying of thirst in Fallon. I couldn't leave the area until I found out where that signal was coming from. \n\nThe super mutants making the woman \"trick\" people into getting caught in their trap was funny until I got to where the broadcast was coming from and there were just chopped up body parts :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The lady dying of thirst in Fallon. I couldn&amp;#39;t leave the area until I found out where that signal was coming from. &lt;/p&gt;\n\n&lt;p&gt;The super mutants making the woman &amp;quot;trick&amp;quot; people into getting caught in their trap was funny until I got to where the broadcast was coming from and there were just chopped up body parts :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8udnb", "score_hidden": false, "stickied": false, "created": 1492178987.0, "created_utc": 1492150187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8rnq7", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Brotherhood-Soldier", "parent_id": "t1_dg8p8ww", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Holy shit that's perfect/ironic at the same time :O\nJohnny Cash is definitely among one of my favorite Country artists no question about it.\nAnyways for me it was finding out about Paladin Danse's true identity, it really made me open my eyes about how I felt about certain Synths. I spared him and convinced Elder Maxon to let him live.\nAt some point Arthur Maxon will know he made the right decision.\nAnd another one a tear jerker: Finding ,that skeleton at the Ranger Cabin reading the more about how she,ran from home then died when the bombs fell really made me think about how real it seems. Also the way Paladin Danse talks about it when he's with you shows that he dose care about people, I like how companions voice their thoughts during emotional scenes like that. It's a real improvement.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit that&amp;#39;s perfect/ironic at the same time :O\nJohnny Cash is definitely among one of my favorite Country artists no question about it.\nAnyways for me it was finding out about Paladin Danse&amp;#39;s true identity, it really made me open my eyes about how I felt about certain Synths. I spared him and convinced Elder Maxon to let him live.\nAt some point Arthur Maxon will know he made the right decision.\nAnd another one a tear jerker: Finding ,that skeleton at the Ranger Cabin reading the more about how she,ran from home then died when the bombs fell really made me think about how real it seems. Also the way Paladin Danse talks about it when he&amp;#39;s with you shows that he dose care about people, I like how companions voice their thoughts during emotional scenes like that. It&amp;#39;s a real improvement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8rnq7", "score_hidden": false, "stickied": false, "created": 1492173541.0, "created_utc": 1492144741.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8p8ww", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "folieadeuxxmachinam", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "i was going through Boston with True Storms and a custom Youtube playlist of different songs going, so it was rainy and very dark and atmospheric. i was getting ready to do the 'defend Bunker Hill' quest, and after i finished it (takes a while on survival lol) i went up the roof to meet Shaun, doing a railroad playthrough and mad as hell about his fucking bullshit Institute.\n\nbam, outta nowhere, Hurt by Johnny Cash starts playing right as he monologues. it was pretty great. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i was going through Boston with True Storms and a custom Youtube playlist of different songs going, so it was rainy and very dark and atmospheric. i was getting ready to do the &amp;#39;defend Bunker Hill&amp;#39; quest, and after i finished it (takes a while on survival lol) i went up the roof to meet Shaun, doing a railroad playthrough and mad as hell about his fucking bullshit Institute.&lt;/p&gt;\n\n&lt;p&gt;bam, outta nowhere, Hurt by Johnny Cash starts playing right as he monologues. it was pretty great. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8p8ww", "score_hidden": false, "stickied": false, "created": 1492169565.0, "created_utc": 1492140765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9vth8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Riomaki", "parent_id": "t1_dg9v1dw", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I'm not saying F4 is great about companions getting in your way... but after you've played through the latter half of Half-Life 2, it's suddenly not so bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying F4 is great about companions getting in your way... but after you&amp;#39;ve played through the latter half of Half-Life 2, it&amp;#39;s suddenly not so bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9vth8", "score_hidden": false, "stickied": false, "created": 1492238890.0, "created_utc": 1492210090.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9v8l6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Konebred", "parent_id": "t1_dg9v1dw", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "\"Sir (or Mum), I have calculated the optimal time to step in front of you when you throw a molotov at some enemies, observe.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Sir (or Mum), I have calculated the optimal time to step in front of you when you throw a molotov at some enemies, observe.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9v8l6", "score_hidden": false, "stickied": false, "created": 1492238105.0, "created_utc": 1492209305.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9v1dw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Andrwjo", "parent_id": "t1_dg91hrg", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Sorry I got in your way, I'll just wait in this FUCKING DOORWAY until you're ready to go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry I got in your way, I&amp;#39;ll just wait in this FUCKING DOORWAY until you&amp;#39;re ready to go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9v1dw", "score_hidden": false, "stickied": false, "created": 1492237833.0, "created_utc": 1492209033.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91hrg", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Konebred", "parent_id": "t1_dg860tx", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Ugh the companion AI is so frikkin frustrating. I don't understand how you can program something to hover around you and get in your way every minute of the game then disappear the second you need to talk to them or trade.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh the companion AI is so frikkin frustrating. I don&amp;#39;t understand how you can program something to hover around you and get in your way every minute of the game then disappear the second you need to talk to them or trade.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg91hrg", "score_hidden": false, "stickied": false, "created": 1492199627.0, "created_utc": 1492170827.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9a2uw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FireHauzard", "parent_id": "t1_dg860tx", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Just fucking back off and shoot it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just fucking back off and shoot it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9a2uw", "score_hidden": false, "stickied": false, "created": 1492212742.0, "created_utc": 1492183942.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8xue0", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "DamnFineHat", "parent_id": "t1_dg8sjd6", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The Wasteland is an unforgiving place. You live there, you probably don't live long. You wanna go out looking like a chump dressed in a busted-up frame with a Super Mutant's cinderblock-and-rebar sledgehammer wedged in your chest cavity, or you wanna go out looking like you dressed for the occasion?\n\nBuy Tinker Tom's Patented Ballistic Weave™ today! Look your best as you're laid to rest!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Wasteland is an unforgiving place. You live there, you probably don&amp;#39;t live long. You wanna go out looking like a chump dressed in a busted-up frame with a Super Mutant&amp;#39;s cinderblock-and-rebar sledgehammer wedged in your chest cavity, or you wanna go out looking like you dressed for the occasion?&lt;/p&gt;\n\n&lt;p&gt;Buy Tinker Tom&amp;#39;s Patented Ballistic Weave™ today! Look your best as you&amp;#39;re laid to rest!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8xue0", "score_hidden": false, "stickied": false, "created": 1492188633.0, "created_utc": 1492159833.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8sjd6", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "brentlikeaboss", "parent_id": "t1_dg8lw0t", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "My man. Style &gt; armor. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My man. Style &amp;gt; armor. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8sjd6", "score_hidden": false, "stickied": false, "created": 1492175175.0, "created_utc": 1492146375.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lw0t", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Andrwjo", "parent_id": "t1_dg8kc48", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I hate how it looks though...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate how it looks though...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8lw0t", "score_hidden": false, "stickied": false, "created": 1492164624.0, "created_utc": 1492135824.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8kc48", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "billyboydogg69", "parent_id": "t1_dg860tx", "subreddit_name_prefixed": "r/Fallout", "controversiality": 1, "body": "Wear power armor ni🅱🅱a.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wear power armor ni🅱🅱a.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8kc48", "score_hidden": false, "stickied": false, "created": 1492162453.0, "created_utc": 1492133653.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg860tx", "gilded": 0, "archived": false, "score": 62, "report_reasons": null, "author": "Andrwjo", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I was playing in survival mode, it'd been maybe an hour since I've saved. I usually play very carefully, moving very slowly and taking the time to scan the environment for hazards. I saw a mine in my path, I did not yet have the sneak perk that allows me to ignore them. I stepped up to defuse the mine, it begins to beep, and as I'm about to press the button to defuse it Dogmeat steps between me and the mine. The mine killed me, and I lost an hour of progress. I almost cried. I don't use companions anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was playing in survival mode, it&amp;#39;d been maybe an hour since I&amp;#39;ve saved. I usually play very carefully, moving very slowly and taking the time to scan the environment for hazards. I saw a mine in my path, I did not yet have the sneak perk that allows me to ignore them. I stepped up to defuse the mine, it begins to beep, and as I&amp;#39;m about to press the button to defuse it Dogmeat steps between me and the mine. The mine killed me, and I lost an hour of progress. I almost cried. I don&amp;#39;t use companions anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg860tx", "score_hidden": false, "stickied": false, "created": 1492143922.0, "created_utc": 1492115122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 62}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg90c28", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Haitosiku", "parent_id": "t1_dg8y0az", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Yea they were exactly what I imagined to do if I actually landed in a scenario like this so I was like \"holy shit here I am gotta join up!\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea they were exactly what I imagined to do if I actually landed in a scenario like this so I was like &amp;quot;holy shit here I am gotta join up!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg90c28", "score_hidden": false, "stickied": false, "created": 1492196625.0, "created_utc": 1492167825.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9anki", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "forerunner398", "parent_id": "t1_dg8y0az", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "How is avenging Quincy the spirit of the Minutemen? Preston yes, but the Minutemen are essentially an army/militia run by one dude (you) who keep people safe. They are a much nicer Legion, and you are Caesar. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How is avenging Quincy the spirit of the Minutemen? Preston yes, but the Minutemen are essentially an army/militia run by one dude (you) who keep people safe. They are a much nicer Legion, and you are Caesar. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9anki", "score_hidden": false, "stickied": false, "created": 1492213415.0, "created_utc": 1492184615.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y0az", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "DamnFineHat", "parent_id": "t1_dg8ussx", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "You know, you're one of the few people I've seen really get into the groove of the Minutemen, and I respect the hell out of that. The usual fare tends to be \"Another settlement needs our help,\" Presto Gravy gags and whatnot, and it's really refreshing to see somebody latch onto the faction and treat them with some measure of respect.\n\nGood on you, man.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, you&amp;#39;re one of the few people I&amp;#39;ve seen really get into the groove of the Minutemen, and I respect the hell out of that. The usual fare tends to be &amp;quot;Another settlement needs our help,&amp;quot; Presto Gravy gags and whatnot, and it&amp;#39;s really refreshing to see somebody latch onto the faction and treat them with some measure of respect.&lt;/p&gt;\n\n&lt;p&gt;Good on you, man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8y0az", "score_hidden": false, "stickied": false, "created": 1492189176.0, "created_utc": 1492160376.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ussx", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "the_alpha_turkey", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "My most intense moment was a moment of hate for the gunners. It was my first play through and I basically ignored the minute men and so by the time I had gotten to Quincy I had forgotten all about Prestons dialogue. I snuck in and took up a good sniping position and by this time I had remembered what had happened here, then I saw the cages full of body's and the fires they were burning them on. I  had fought my way up to the over ramp and was kinda pissed off because of the obvious distain for human life, then I saw that mother fucker who betrayed the whole town to this massacre still wearing a minuteman hat like he had a right to it. So I blew his head off took the hat burned the body and lost any remorse I had for killing gunners.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My most intense moment was a moment of hate for the gunners. It was my first play through and I basically ignored the minute men and so by the time I had gotten to Quincy I had forgotten all about Prestons dialogue. I snuck in and took up a good sniping position and by this time I had remembered what had happened here, then I saw the cages full of body&amp;#39;s and the fires they were burning them on. I  had fought my way up to the over ramp and was kinda pissed off because of the obvious distain for human life, then I saw that mother fucker who betrayed the whole town to this massacre still wearing a minuteman hat like he had a right to it. So I blew his head off took the hat burned the body and lost any remorse I had for killing gunners.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8ussx", "score_hidden": false, "stickied": false, "created": 1492179978.0, "created_utc": 1492151178.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8kl77", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "securitywyrm", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I found the litthe touches of the anti-environmentalism to be rather poinant. There's the cave under Red Rocket, and the nuclear disposal site where they killed an inspector and dumped his body underground. It seems to be that the world war sped up the ruining of the world, but not by much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found the litthe touches of the anti-environmentalism to be rather poinant. There&amp;#39;s the cave under Red Rocket, and the nuclear disposal site where they killed an inspector and dumped his body underground. It seems to be that the world war sped up the ruining of the world, but not by much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8kl77", "score_hidden": false, "stickied": false, "created": 1492162800.0, "created_utc": 1492134000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8lc2e", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "19of801", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Yes, the runaway in the Ranger Cabin got me as well. There were a few others that really stood out to me. The girl trapped in the store vault begging for help over the radio is one. The bomb shelter under the train car in the scrapyard was another. After you read the console entries about the father having problems getting the ventilation to work correctly and having to explain the reason for such a shelter to his children, you go in and find them all. :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, the runaway in the Ranger Cabin got me as well. There were a few others that really stood out to me. The girl trapped in the store vault begging for help over the radio is one. The bomb shelter under the train car in the scrapyard was another. After you read the console entries about the father having problems getting the ventilation to work correctly and having to explain the reason for such a shelter to his children, you go in and find them all. :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8lc2e", "score_hidden": false, "stickied": false, "created": 1492163830.0, "created_utc": 1492135030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8vbze", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Topgun157", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Honestly, Preston's companion quest, I felt really bad for him when he told me how he was the last Minutemen and he was depressed and suicidal. He saw the minutemen crumble, betray one and another, and it was just him defending Mama Murphy and the others. I can only imagine how alone he must have felt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, Preston&amp;#39;s companion quest, I felt really bad for him when he told me how he was the last Minutemen and he was depressed and suicidal. He saw the minutemen crumble, betray one and another, and it was just him defending Mama Murphy and the others. I can only imagine how alone he must have felt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8vbze", "score_hidden": false, "stickied": false, "created": 1492181298.0, "created_utc": 1492152498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8v5h2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "kurtrockpuncher", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "University Point, I had sided with The Institute up to this point but after I discover the things that went on there I couldn't go on with them. The worst part is you can't bring it up with Father.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;University Point, I had sided with The Institute up to this point but after I discover the things that went on there I couldn&amp;#39;t go on with them. The worst part is you can&amp;#39;t bring it up with Father.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8v5h2", "score_hidden": false, "stickied": false, "created": 1492180837.0, "created_utc": 1492152037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8v7ox", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "MaxSucc", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "When I went into one of the metro stations, I saw a bunch of ghouls and a dead raider. But the thing is, the raider was sitting with her back on a flipped table away from the ghouls and she had a pistol in her right hand. The blood came from the left side of her head.\n\n\nShe committed suicide.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I went into one of the metro stations, I saw a bunch of ghouls and a dead raider. But the thing is, the raider was sitting with her back on a flipped table away from the ghouls and she had a pistol in her right hand. The blood came from the left side of her head.&lt;/p&gt;\n\n&lt;p&gt;She committed suicide.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8v7ox", "score_hidden": false, "stickied": false, "created": 1492180994.0, "created_utc": 1492152194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8vpor", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Paz436", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The radio transmission about a family looking for the wife. Idk why.\n\nhttp://fallout.wikia.com/wiki/Separated_family_radio_signal", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The radio transmission about a family looking for the wife. Idk why.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://fallout.wikia.com/wiki/Separated_family_radio_signal\"&gt;http://fallout.wikia.com/wiki/Separated_family_radio_signal&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8vpor", "score_hidden": false, "stickied": false, "created": 1492182286.0, "created_utc": 1492153486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg965wc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Null225", "parent_id": "t1_dg94s7a", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Yeah, like I said, people were moved from concentration camps where they awaited mass execution to dedicated extermination camps. A concentration camp's purpose is not solely mass genocide. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, like I said, people were moved from concentration camps where they awaited mass execution to dedicated extermination camps. A concentration camp&amp;#39;s purpose is not solely mass genocide. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg965wc", "score_hidden": false, "stickied": false, "created": 1492207765.0, "created_utc": 1492178965.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94s7a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AfterAttack", "parent_id": "t1_dg948w7", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "http://i.imgur.com/T4cUcbV.jpg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://i.imgur.com/T4cUcbV.jpg\"&gt;http://i.imgur.com/T4cUcbV.jpg&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg94s7a", "score_hidden": false, "stickied": false, "created": 1492205771.0, "created_utc": 1492176971.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg948w7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Null225", "parent_id": "t1_dg937cd", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "We might just have to agree to disagree on this one, friend. Nowhere in the definition of concentration camp does it say that the purpose of the camp is to commit mass genocide. It's purpose is to detain a group of people, usually a minority political/religious group, without trial. Usually for the purposes of forced labour. People were put into concentration camps under Nazi Germany for years before the mass genocide began. Some concentration camps, such as Auschwitz, would be better described as death camps. People would be moved from concentration camps all over Europe specifically to be killed there. \n\nThe only difference in definition seems to be that the conditions in concentration camps were generally much worse than internment camps, but there purpose was the same. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We might just have to agree to disagree on this one, friend. Nowhere in the definition of concentration camp does it say that the purpose of the camp is to commit mass genocide. It&amp;#39;s purpose is to detain a group of people, usually a minority political/religious group, without trial. Usually for the purposes of forced labour. People were put into concentration camps under Nazi Germany for years before the mass genocide began. Some concentration camps, such as Auschwitz, would be better described as death camps. People would be moved from concentration camps all over Europe specifically to be killed there. &lt;/p&gt;\n\n&lt;p&gt;The only difference in definition seems to be that the conditions in concentration camps were generally much worse than internment camps, but there purpose was the same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg948w7", "score_hidden": false, "stickied": false, "created": 1492204936.0, "created_utc": 1492176136.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg937cd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AfterAttack", "parent_id": "t1_dg92x4c", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Uhh, no it's not a euphemism. Internment camps were like prison, meant to systematically collect and hold people. Concentration camps were meant to systematically kill people like cattle and then pour them into mass graves. That is a key difference. Neither were justified but they are not the same.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uhh, no it&amp;#39;s not a euphemism. Internment camps were like prison, meant to systematically collect and hold people. Concentration camps were meant to systematically kill people like cattle and then pour them into mass graves. That is a key difference. Neither were justified but they are not the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg937cd", "score_hidden": false, "stickied": false, "created": 1492203139.0, "created_utc": 1492174339.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92x4c", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Null225", "parent_id": "t1_dg926xi", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": " 'Internment camp' is just a euphemism for concentration camp, usually used to make people feel better about it. Looking at the treatment of 100% American citizens in pre-war USA, you can bet your ass the chinese-american prisoners were treated awfully in the camps. \n\nEdit: typos", "edited": 1492176229.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#39;Internment camp&amp;#39; is just a euphemism for concentration camp, usually used to make people feel better about it. Looking at the treatment of 100% American citizens in pre-war USA, you can bet your ass the chinese-american prisoners were treated awfully in the camps. &lt;/p&gt;\n\n&lt;p&gt;Edit: typos&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg92x4c", "score_hidden": false, "stickied": false, "created": 1492202609.0, "created_utc": 1492173809.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg926xi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AfterAttack", "parent_id": "t1_dg8xtu3", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "They were internment camps lol - not concentration camps ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They were internment camps lol - not concentration camps &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg926xi", "score_hidden": false, "stickied": false, "created": 1492201178.0, "created_utc": 1492172378.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xtu3", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Null225", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The little chinese kid's story triggered the feels pretty hard for me. I think his name was Kim? They were hiding from the authorities who were rounding up chinese citizens to take them to concentration camps. He was so innocent and blissfully unaware of what was actually happening. Anything about kids gets to me. It didn't bother me until I had kids of my own, interestingly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The little chinese kid&amp;#39;s story triggered the feels pretty hard for me. I think his name was Kim? They were hiding from the authorities who were rounding up chinese citizens to take them to concentration camps. He was so innocent and blissfully unaware of what was actually happening. Anything about kids gets to me. It didn&amp;#39;t bother me until I had kids of my own, interestingly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8xtu3", "score_hidden": false, "stickied": false, "created": 1492188579.0, "created_utc": 1492159779.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8xyvv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "suareasy", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "[Edit] I just realized OP said FO4...\n\nMine was the first time I had a companion die, in FO1. I was heading to the necropolis and wanted company. I got Ian to join, and it was going well until we were attacked by ghouls. I was able to get outside of the \"ghoul circle\", but he was literally surrounded.\n\nHe killed as many as he could until he died. I was able to finish the rest. There was such a mix of emotions. I got to loot his corpse and he had much better gear than I had, but I felt like shit because I dragged him out there to die.\n\nIn every fallout since, even though companions are essential, I usually just go it alone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[Edit] I just realized OP said FO4...&lt;/p&gt;\n\n&lt;p&gt;Mine was the first time I had a companion die, in FO1. I was heading to the necropolis and wanted company. I got Ian to join, and it was going well until we were attacked by ghouls. I was able to get outside of the &amp;quot;ghoul circle&amp;quot;, but he was literally surrounded.&lt;/p&gt;\n\n&lt;p&gt;He killed as many as he could until he died. I was able to finish the rest. There was such a mix of emotions. I got to loot his corpse and he had much better gear than I had, but I felt like shit because I dragged him out there to die.&lt;/p&gt;\n\n&lt;p&gt;In every fallout since, even though companions are essential, I usually just go it alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8xyvv", "score_hidden": false, "stickied": false, "created": 1492189046.0, "created_utc": 1492160246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg902zw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dansdata", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "In my first playthrough to the end, I chose an ending requiring me to destroy the Railroad.\n\nThe Railroad-interior-music plays when you go in there, and it tells you to kill each named Railroad member, in turn, by name. Glory. Desdemona. Drummer Boy. Doc Carrington. Tinker Tom. As I recall not Deacon, though, since he was at one of my settlements so I had to kill him later.\n\nThe Railroad might have been essentially bananas, but I'd spent a lot of time there turning in quests and so forth. I was killing people who wanted to do the right thing, and who trusted me. I felt like Lord Vader, and not in a good way.\n\n(A few playthroughs later, at high level in Survival mode with music turned off so I can hear anybody sneaking up on me, I still feel like Lord Vader. But now it's in a that-one-corridor-scene-in-*Rogue-One* way.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my first playthrough to the end, I chose an ending requiring me to destroy the Railroad.&lt;/p&gt;\n\n&lt;p&gt;The Railroad-interior-music plays when you go in there, and it tells you to kill each named Railroad member, in turn, by name. Glory. Desdemona. Drummer Boy. Doc Carrington. Tinker Tom. As I recall not Deacon, though, since he was at one of my settlements so I had to kill him later.&lt;/p&gt;\n\n&lt;p&gt;The Railroad might have been essentially bananas, but I&amp;#39;d spent a lot of time there turning in quests and so forth. I was killing people who wanted to do the right thing, and who trusted me. I felt like Lord Vader, and not in a good way.&lt;/p&gt;\n\n&lt;p&gt;(A few playthroughs later, at high level in Survival mode with music turned off so I can hear anybody sneaking up on me, I still feel like Lord Vader. But now it&amp;#39;s in a that-one-corridor-scene-in-&lt;em&gt;Rogue-One&lt;/em&gt; way.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg902zw", "score_hidden": false, "stickied": false, "created": 1492195877.0, "created_utc": 1492167077.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg919h2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "bracesthrowaway", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Mine was during my first playthrough when you meet Shaun. I was completely unspoiled so I was blown away by the big reveal. I had been playing all sides before that in the hopes they could help me find my son up until that point but after that I realized I didn't know what my character actually cared about anymore and, in fact, I don't think she cared about any of it enough to go through with their plans for destroying all of the other factions. I couldn't hurt Shaun but I sure didn't believe in what the Institute was doing so I just walked away from that save game and left it unresolved. I figure my character just walked away from it all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mine was during my first playthrough when you meet Shaun. I was completely unspoiled so I was blown away by the big reveal. I had been playing all sides before that in the hopes they could help me find my son up until that point but after that I realized I didn&amp;#39;t know what my character actually cared about anymore and, in fact, I don&amp;#39;t think she cared about any of it enough to go through with their plans for destroying all of the other factions. I couldn&amp;#39;t hurt Shaun but I sure didn&amp;#39;t believe in what the Institute was doing so I just walked away from that save game and left it unresolved. I figure my character just walked away from it all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg919h2", "score_hidden": false, "stickied": false, "created": 1492199085.0, "created_utc": 1492170285.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9xpre", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "That_One_Engi", "parent_id": "t1_dg9uaud", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Perhaps if you didn't find them, it could lead to the Railroad being introduced. Considering Danse is a Synth, there the only ones who will guarantee his safety. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps if you didn&amp;#39;t find them, it could lead to the Railroad being introduced. Considering Danse is a Synth, there the only ones who will guarantee his safety. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9xpre", "score_hidden": false, "stickied": false, "created": 1492241420.0, "created_utc": 1492212620.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9uaud", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Onebodytomany", "parent_id": "t1_dg928m8", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I honestly love that quest. It's such a conundrum. I don't like that Bethesda pussied out and made it so you can keep him alive and remain in the brotherhood tho. There should have been two options. Follow with the brotherhoods ideals, that synthetic humans need to be destroyed, at the cost of a friend. Or to stick by your friends no matter what, that maybe dance made you rethink those ideals. That's how it should have been. I just ignore the third option and pretend it's not there, it's much better story wise. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I honestly love that quest. It&amp;#39;s such a conundrum. I don&amp;#39;t like that Bethesda pussied out and made it so you can keep him alive and remain in the brotherhood tho. There should have been two options. Follow with the brotherhoods ideals, that synthetic humans need to be destroyed, at the cost of a friend. Or to stick by your friends no matter what, that maybe dance made you rethink those ideals. That&amp;#39;s how it should have been. I just ignore the third option and pretend it&amp;#39;s not there, it&amp;#39;s much better story wise. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9uaud", "score_hidden": false, "stickied": false, "created": 1492236856.0, "created_utc": 1492208056.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg928m8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "AfterAttack", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The Danse story-arch when doing a full brotherhood play through. I felt so empty when he said \"I've never been more proud of you.\" after I made my decision to side with the brotherhood", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Danse story-arch when doing a full brotherhood play through. I felt so empty when he said &amp;quot;I&amp;#39;ve never been more proud of you.&amp;quot; after I made my decision to side with the brotherhood&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg928m8", "score_hidden": false, "stickied": false, "created": 1492201275.0, "created_utc": 1492172475.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9wn7t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Riomaki", "parent_id": "t1_dg9rjoj", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I swear, trying to protect him at the end was one of the most difficult things in the entire game.  I don't normally do drugs in Fallout, but when it was suggested I use Jet to solve that, I did, because there was just no other way to kill Sinjin without him killing Kent first.  As a melee character, I would have had to I get off 3 back-to-back VATS shots on Sinjin's head to kill him, and it still wouldn't drop him in time without Jet.", "edited": 1492211402.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I swear, trying to protect him at the end was one of the most difficult things in the entire game.  I don&amp;#39;t normally do drugs in Fallout, but when it was suggested I use Jet to solve that, I did, because there was just no other way to kill Sinjin without him killing Kent first.  As a melee character, I would have had to I get off 3 back-to-back VATS shots on Sinjin&amp;#39;s head to kill him, and it still wouldn&amp;#39;t drop him in time without Jet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9wn7t", "score_hidden": false, "stickied": false, "created": 1492240001.0, "created_utc": 1492211201.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9wgtl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jagtiger26", "parent_id": "t1_dg9rjoj", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Same. I managed to save him initially with a well placed headshot on sinjin, but then as he ran towards me one of the other raiders shot him in the back. I had just taken jet so I got a full slow motion view of him being shot in the back and going limp and slumping to the floor mid run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same. I managed to save him initially with a well placed headshot on sinjin, but then as he ran towards me one of the other raiders shot him in the back. I had just taken jet so I got a full slow motion view of him being shot in the back and going limp and slumping to the floor mid run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9wgtl", "score_hidden": false, "stickied": false, "created": 1492239760.0, "created_utc": 1492210960.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rjoj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "trsgreen", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Honestly the whole Silver Shroud quest. Kent Connolly was just such a genuine an honest guy, and he was like a kid on Christmas with the whole silver shroud getup. He never really had much confidence in himself and it just made me so sad. All he wanted was a little bit of good back in the world. And when he was kidnapped, I swore I wouldn't let any harm come to him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly the whole Silver Shroud quest. Kent Connolly was just such a genuine an honest guy, and he was like a kid on Christmas with the whole silver shroud getup. He never really had much confidence in himself and it just made me so sad. All he wanted was a little bit of good back in the world. And when he was kidnapped, I swore I wouldn&amp;#39;t let any harm come to him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9rjoj", "score_hidden": false, "stickied": false, "created": 1492233301.0, "created_utc": 1492204501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8wf03", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Lopjing", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Finishing Nick Valentines quest. That whole speech about how he finally accomplished something for himself just got to me for some reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finishing Nick Valentines quest. That whole speech about how he finally accomplished something for himself just got to me for some reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8wf03", "score_hidden": false, "stickied": false, "created": 1492184231.0, "created_utc": 1492155431.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8pshu", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Rockett800", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "That opening got me so hard, there's just so much emotion crammed into it. The idea of never being able to escape the horrors of war, the soft, sad Cronkite like delivery of the news. The small stories that you don't get a chance to really notice in the mad dash. People realizing they can't get in and won't likely survive, and the ones that are able to suddenly realizing they'll likely never see their families again. The horrors of the vault experiments, watching your spouse die as they attempt to protect your only child. And then, being forced into the unforgiving, unfamiliar landscape of what you once called home. And the mini stories throughout the whole game, my god. The murder suicide near county crossings, the elderly dying in their beds in Salem, the story of an experiment gone wrong near Bunker Hill, the list goes on. It really doesn't help games like this when you empathize too much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That opening got me so hard, there&amp;#39;s just so much emotion crammed into it. The idea of never being able to escape the horrors of war, the soft, sad Cronkite like delivery of the news. The small stories that you don&amp;#39;t get a chance to really notice in the mad dash. People realizing they can&amp;#39;t get in and won&amp;#39;t likely survive, and the ones that are able to suddenly realizing they&amp;#39;ll likely never see their families again. The horrors of the vault experiments, watching your spouse die as they attempt to protect your only child. And then, being forced into the unforgiving, unfamiliar landscape of what you once called home. And the mini stories throughout the whole game, my god. The murder suicide near county crossings, the elderly dying in their beds in Salem, the story of an experiment gone wrong near Bunker Hill, the list goes on. It really doesn&amp;#39;t help games like this when you empathize too much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8pshu", "score_hidden": false, "stickied": false, "created": 1492170432.0, "created_utc": 1492141632.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8wbs3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "dontsnap", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Not being able to play it while my kid plays with *their* computer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not being able to play it while my kid plays with &lt;em&gt;their&lt;/em&gt; computer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8wbs3", "score_hidden": false, "stickied": false, "created": 1492183978.0, "created_utc": 1492155178.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg91gpm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "OG_Snapper", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "For me, one of my most saddening and emotionally intense moments was when I first came across the Yangtze. So much death was involved with this thing, and the poor captain had to carry the burden if it all for over 200 years.\n\nAnother one would be when I was exploring a sewer. I came across two skeletons, who were laying beside each other with one stimpack between them. They survived the initial blast but were both badly wounded, but couldn't take the stimpack from the other person. \n\nOkay, last one. This one was out in the random somewhere. I was wandering, and I came across two raiders around a casket. They were burying their friend. This triggered a lot of emotion for me because usually raiders are just heartless bastards who wreak havoc on everyone. But for once, they showed an emotional side. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me, one of my most saddening and emotionally intense moments was when I first came across the Yangtze. So much death was involved with this thing, and the poor captain had to carry the burden if it all for over 200 years.&lt;/p&gt;\n\n&lt;p&gt;Another one would be when I was exploring a sewer. I came across two skeletons, who were laying beside each other with one stimpack between them. They survived the initial blast but were both badly wounded, but couldn&amp;#39;t take the stimpack from the other person. &lt;/p&gt;\n\n&lt;p&gt;Okay, last one. This one was out in the random somewhere. I was wandering, and I came across two raiders around a casket. They were burying their friend. This triggered a lot of emotion for me because usually raiders are just heartless bastards who wreak havoc on everyone. But for once, they showed an emotional side. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg91gpm", "score_hidden": false, "stickied": false, "created": 1492199560.0, "created_utc": 1492170760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9wgyw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Riomaki", "parent_id": "t1_dg8z0wg", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I think that's most people's frustration with F4.  It's a game that's right on the cusp of greatness... but doesn't quite seal the deal.  Still a lot of fun.  But a game filled with \"I wish they would've\" in a way I never felt about F3 and NV.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s most people&amp;#39;s frustration with F4.  It&amp;#39;s a game that&amp;#39;s right on the cusp of greatness... but doesn&amp;#39;t quite seal the deal.  Still a lot of fun.  But a game filled with &amp;quot;I wish they would&amp;#39;ve&amp;quot; in a way I never felt about F3 and NV.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9wgyw", "score_hidden": false, "stickied": false, "created": 1492239765.0, "created_utc": 1492210965.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8z0wg", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SanspoofMaloof", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I got an odd relationship with FO4 - I really do love some aspects of it, but I'm also very dissapointed in others - I wish they'd done more with what they had.\nOne of the things I do like very much though is the voice acting and I think that's the cause for some of the most emotional moments I've had in it.\nMeeting Nick and the reveal of him being a synth was awesome, but the moment he became my favourite companion was the moment he simply asked me how I was - and I found him telling me his backstory very sweet in a \"you're not alone, I went through this and you're gonna be okay\" kinda way. \nThe woman in Fallons basement who died of thirst really upset me the first time I heard it - the desperation and sobbing in her voice as she pleaded \"please - I'm so thirsty\" just felt so real, and I found myself just looking at her skeleton wishing it had turned out differently for her.\nWhen I did nicks quest, I actually failed the speech check, so I didn't know who Jenny lands was until we'd taken care of Eddie Winter - when he's at her grave and he forgets himself for a moment \"Jenny - my fiancé...nicks fiancé, I mean\" and his voice cracks a little really freaking hurt - I didn't go back to vault 111 until after I'd done this, and nicks reaction to your dead spouse takes on a whole new meaning after it. \n\nI feel like an outlier because I actually like that nick isn't romancable - it feels more in tune with his character. But damn, I wish there was an option to give the guy a hug and tell him he's great. \n\nBasically anytime Stephen Russel has to be emotional it's gonna kill me right in the heart 😅", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got an odd relationship with FO4 - I really do love some aspects of it, but I&amp;#39;m also very dissapointed in others - I wish they&amp;#39;d done more with what they had.\nOne of the things I do like very much though is the voice acting and I think that&amp;#39;s the cause for some of the most emotional moments I&amp;#39;ve had in it.\nMeeting Nick and the reveal of him being a synth was awesome, but the moment he became my favourite companion was the moment he simply asked me how I was - and I found him telling me his backstory very sweet in a &amp;quot;you&amp;#39;re not alone, I went through this and you&amp;#39;re gonna be okay&amp;quot; kinda way. \nThe woman in Fallons basement who died of thirst really upset me the first time I heard it - the desperation and sobbing in her voice as she pleaded &amp;quot;please - I&amp;#39;m so thirsty&amp;quot; just felt so real, and I found myself just looking at her skeleton wishing it had turned out differently for her.\nWhen I did nicks quest, I actually failed the speech check, so I didn&amp;#39;t know who Jenny lands was until we&amp;#39;d taken care of Eddie Winter - when he&amp;#39;s at her grave and he forgets himself for a moment &amp;quot;Jenny - my fiancé...nicks fiancé, I mean&amp;quot; and his voice cracks a little really freaking hurt - I didn&amp;#39;t go back to vault 111 until after I&amp;#39;d done this, and nicks reaction to your dead spouse takes on a whole new meaning after it. &lt;/p&gt;\n\n&lt;p&gt;I feel like an outlier because I actually like that nick isn&amp;#39;t romancable - it feels more in tune with his character. But damn, I wish there was an option to give the guy a hug and tell him he&amp;#39;s great. &lt;/p&gt;\n\n&lt;p&gt;Basically anytime Stephen Russel has to be emotional it&amp;#39;s gonna kill me right in the heart 😅&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8z0wg", "score_hidden": false, "stickied": false, "created": 1492192490.0, "created_utc": 1492163690.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9t6qq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "That_One_Engi", "parent_id": "t1_dg937q6", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I had to execute Danse due to my charisma being abysmal. Even though he said he felt proud of me, I felt like crap after I pulled the trigger. That quest is a sort of wake up call though. They aren't the Lyons Brotherhood anymore. They've gone back in time, Maxsons brotherhood is exactly like the original one, only with a slightly more twisted intent. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to execute Danse due to my charisma being abysmal. Even though he said he felt proud of me, I felt like crap after I pulled the trigger. That quest is a sort of wake up call though. They aren&amp;#39;t the Lyons Brotherhood anymore. They&amp;#39;ve gone back in time, Maxsons brotherhood is exactly like the original one, only with a slightly more twisted intent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9t6qq", "score_hidden": false, "stickied": false, "created": 1492235398.0, "created_utc": 1492206598.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg937q6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Fizzer_XCIV", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I remember when Danse had talked to my character and told me he was so hard on them because he believed in them... it was kinda the moment that marked true friendship between the two people.   \n\nIt was a conversation that happened *inside* the nuclear bomb facility in the Glowing Sea. It was a real shock to be told that I have to kill my first true friend in this new world just a few minutes later.    \n\nThe timing of the conversations really drove a stake through my heart. I still had that heartfelt conversation on my mind.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember when Danse had talked to my character and told me he was so hard on them because he believed in them... it was kinda the moment that marked true friendship between the two people.   &lt;/p&gt;\n\n&lt;p&gt;It was a conversation that happened &lt;em&gt;inside&lt;/em&gt; the nuclear bomb facility in the Glowing Sea. It was a real shock to be told that I have to kill my first true friend in this new world just a few minutes later.    &lt;/p&gt;\n\n&lt;p&gt;The timing of the conversations really drove a stake through my heart. I still had that heartfelt conversation on my mind.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg937q6", "score_hidden": false, "stickied": false, "created": 1492203158.0, "created_utc": 1492174358.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg94c7e", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Commander_The_Royal", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The pure rage I feel whenever Maxson opens his mouth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The pure rage I feel whenever Maxson opens his mouth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg94c7e", "score_hidden": false, "stickied": false, "created": 1492205082.0, "created_utc": 1492176282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9t2e8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "That_One_Engi", "parent_id": "t1_dg9h8n9", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I listened to it after I beat the game. I sided with the Railroad and after killing countless people to get to Shaun, hearing Nora say to my character that he's \"a kind, loving person\" hit home. He wasn't anymore, he was a killer, whose only moral in the world was to get more Caps. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I listened to it after I beat the game. I sided with the Railroad and after killing countless people to get to Shaun, hearing Nora say to my character that he&amp;#39;s &amp;quot;a kind, loving person&amp;quot; hit home. He wasn&amp;#39;t anymore, he was a killer, whose only moral in the world was to get more Caps. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9t2e8", "score_hidden": false, "stickied": false, "created": 1492235242.0, "created_utc": 1492206442.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9h8n9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Gryfenn", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Hearing the Hi Honey! holotape for the first time, especially right after the beginning of the game...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hearing the Hi Honey! holotape for the first time, especially right after the beginning of the game...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9h8n9", "score_hidden": false, "stickied": false, "created": 1492220885.0, "created_utc": 1492192085.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9pgau", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ArgonianAle2077", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "SPOILERS (duh) for one misc objective and a side quest.\n\nFor me it was running into ghouls that have been around since before the war. The vault tech spokesperson from the beginning who you find in good neighbour hit me as a kind of depressing feel in the wasteland. He's sad and has a really melancholy vibe to him, and the only way you can make him happy is to make him come live with you in one of your settlements. \n\nFinding captain Zao in the submarine wasn't as emotional but killing commies gave me American pride so that's nice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;SPOILERS (duh) for one misc objective and a side quest.&lt;/p&gt;\n\n&lt;p&gt;For me it was running into ghouls that have been around since before the war. The vault tech spokesperson from the beginning who you find in good neighbour hit me as a kind of depressing feel in the wasteland. He&amp;#39;s sad and has a really melancholy vibe to him, and the only way you can make him happy is to make him come live with you in one of your settlements. &lt;/p&gt;\n\n&lt;p&gt;Finding captain Zao in the submarine wasn&amp;#39;t as emotional but killing commies gave me American pride so that&amp;#39;s nice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9pgau", "score_hidden": false, "stickied": false, "created": 1492230722.0, "created_utc": 1492201922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9w9t3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jagtiger26", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Mine was the \"unmarked shack\" location in the glowing sea where you find a military bunker. You find a skeleton in a lab coat about 3 feet from the door to the bunker, and inside you find a note written by one of the long dead scientists about being forced to close the door as the blast from the bombs was too close and he was just seconds too slow from living. These scientists were friends, and I can't imaging being forced to guarantee your friend's death like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mine was the &amp;quot;unmarked shack&amp;quot; location in the glowing sea where you find a military bunker. You find a skeleton in a lab coat about 3 feet from the door to the bunker, and inside you find a note written by one of the long dead scientists about being forced to close the door as the blast from the bombs was too close and he was just seconds too slow from living. These scientists were friends, and I can&amp;#39;t imaging being forced to guarantee your friend&amp;#39;s death like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9w9t3", "score_hidden": false, "stickied": false, "created": 1492239500.0, "created_utc": 1492210700.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8r70n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "H_justice", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "That girl has a holotape recording IIRC", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That girl has a holotape recording IIRC&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8r70n", "score_hidden": false, "stickied": false, "created": 1492172723.0, "created_utc": 1492143923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg94jw8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Turdulator", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The sounds dogmeat makes during combat. That pained yelp tears at my very soul.\nI was unable to use him as a companion because of that sound.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The sounds dogmeat makes during combat. That pained yelp tears at my very soul.\nI was unable to use him as a companion because of that sound.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg94jw8", "score_hidden": false, "stickied": false, "created": 1492205416.0, "created_utc": 1492176616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9nql8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "KillerChemoStar3", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The random encounter with the guy who sells Junkyard Dogs, that really got to me to the point I wouldn't buy the dog, I remember losing my pet and it hit too close to home..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The random encounter with the guy who sells Junkyard Dogs, that really got to me to the point I wouldn&amp;#39;t buy the dog, I remember losing my pet and it hit too close to home..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9nql8", "score_hidden": false, "stickied": false, "created": 1492228663.0, "created_utc": 1492199863.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dga1sw1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Riomaki", "parent_id": "t1_dg9xjzt", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I've only personally experienced that one - from what I've read of the others, I would agree with your assessment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve only personally experienced that one - from what I&amp;#39;ve read of the others, I would agree with your assessment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dga1sw1", "score_hidden": false, "stickied": false, "created": 1492246852.0, "created_utc": 1492218052.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xjzt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "That_One_Engi", "parent_id": "t1_dg9x92t", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "What's your opinions on the other endings? The Institute one had closure, but the other endings had a spark of hope in them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s your opinions on the other endings? The Institute one had closure, but the other endings had a spark of hope in them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9xjzt", "score_hidden": false, "stickied": false, "created": 1492241207.0, "created_utc": 1492212407.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9x92t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Riomaki", "parent_id": "t1_dg9sxiw", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Yeah.  That's the big problem with the Institute ending.  Objectively, the Institute does a lot of horrible things.  To counter that, they try to fill the player with emotion (this is my son's life's work) and hope (I can make a difference here).\n\nWhen that collides with the inability to do anything, it winds up being a very disappointing, hollow ending.  It was the first one I did and it left me with such a sour taste for F4 for months.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah.  That&amp;#39;s the big problem with the Institute ending.  Objectively, the Institute does a lot of horrible things.  To counter that, they try to fill the player with emotion (this is my son&amp;#39;s life&amp;#39;s work) and hope (I can make a difference here).&lt;/p&gt;\n\n&lt;p&gt;When that collides with the inability to do anything, it winds up being a very disappointing, hollow ending.  It was the first one I did and it left me with such a sour taste for F4 for months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9x92t", "score_hidden": false, "stickied": false, "created": 1492240810.0, "created_utc": 1492212010.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9sxiw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "That_One_Engi", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "When I finally completed the Institutes endgame quest. I've completed all other endgames quests for the factions, but the Institute ending hit me like a ton of bricks.  \n\n\nThe way Father told me he couldn't be more proud, that he told me that i'd made him happy and i'd helped him achieve his life's work. I felt happy, the he died. \n\n\nI was on the balcony; after a conversation with Annie Filmore, I felt so **empty**. Everyone I was friends with i'd killed. Danse, Deacon, Desdemona. I felt like crap, especially since I had to inform Liam Binet about the RR demise. Just like that, his plan to free the Gen 3's died. It was the only ending that made me question my faction choice. In all the others, your companions congratulate you in destroying the Institute, with this ending, they berate you. Nick and Piper especially. \n\n\nBut you know what the real irony is? Those Gen 3's are effectively the characters grandchildren and they'll be bound to eternal servitude. Until they either rise up; leave the only faction left in the Commonwealth in ruins. Or they do a subtle rebellion, slowly replacing members of the Institute; then when your character goes to sleep in the Director's Quarters...they never wake up. \n\n\nBut, since you're in control of the Institute, in a generation or so, you could pave the way for Synths rights in the Institute with a new generation of scientists and visionaries. ", "edited": 1492206659.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I finally completed the Institutes endgame quest. I&amp;#39;ve completed all other endgames quests for the factions, but the Institute ending hit me like a ton of bricks.  &lt;/p&gt;\n\n&lt;p&gt;The way Father told me he couldn&amp;#39;t be more proud, that he told me that i&amp;#39;d made him happy and i&amp;#39;d helped him achieve his life&amp;#39;s work. I felt happy, the he died. &lt;/p&gt;\n\n&lt;p&gt;I was on the balcony; after a conversation with Annie Filmore, I felt so &lt;strong&gt;empty&lt;/strong&gt;. Everyone I was friends with i&amp;#39;d killed. Danse, Deacon, Desdemona. I felt like crap, especially since I had to inform Liam Binet about the RR demise. Just like that, his plan to free the Gen 3&amp;#39;s died. It was the only ending that made me question my faction choice. In all the others, your companions congratulate you in destroying the Institute, with this ending, they berate you. Nick and Piper especially. &lt;/p&gt;\n\n&lt;p&gt;But you know what the real irony is? Those Gen 3&amp;#39;s are effectively the characters grandchildren and they&amp;#39;ll be bound to eternal servitude. Until they either rise up; leave the only faction left in the Commonwealth in ruins. Or they do a subtle rebellion, slowly replacing members of the Institute; then when your character goes to sleep in the Director&amp;#39;s Quarters...they never wake up. &lt;/p&gt;\n\n&lt;p&gt;But, since you&amp;#39;re in control of the Institute, in a generation or so, you could pave the way for Synths rights in the Institute with a new generation of scientists and visionaries. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9sxiw", "score_hidden": false, "stickied": false, "created": 1492235070.0, "created_utc": 1492206270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9u3oc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Redxhen", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I went through a few days of being grief-stricken and in shock.  A number of mutants came over and killed Abigail and Daniel Finch.  Then a couple days later mutants came to The Slog and killed Arlen and Deidre.  I had to quit playing for a couple days.  I built a memorial to both of them and that helped a little bit but everytime I see Arlen's shop with the Giddyup pony on the floor I feel real bad. \n\nI'm a role-player at heart. \n\nAfter I finished destroying the Institute I really enjoyed the ending and how everyone kept talking about it.  That was the single most rewarding ending I've experienced in a video game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through a few days of being grief-stricken and in shock.  A number of mutants came over and killed Abigail and Daniel Finch.  Then a couple days later mutants came to The Slog and killed Arlen and Deidre.  I had to quit playing for a couple days.  I built a memorial to both of them and that helped a little bit but everytime I see Arlen&amp;#39;s shop with the Giddyup pony on the floor I feel real bad. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a role-player at heart. &lt;/p&gt;\n\n&lt;p&gt;After I finished destroying the Institute I really enjoyed the ending and how everyone kept talking about it.  That was the single most rewarding ending I&amp;#39;ve experienced in a video game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9u3oc", "score_hidden": false, "stickied": false, "created": 1492236592.0, "created_utc": 1492207792.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8wi3v", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "fa1lbin", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The Galactic Zone might be one of the most powerfully surreal and melancholy places in any Fallout game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Galactic Zone might be one of the most powerfully surreal and melancholy places in any Fallout game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8wi3v", "score_hidden": false, "stickied": false, "created": 1492184482.0, "created_utc": 1492155682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9xyp2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Riomaki", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I would say the radio transmissions, in general.  These were one of my favorite things in F3 and I was so happy to see F4 double down with the concept.  Whether it's that neighborhood bunker, the lady trapped in the basement at Fallon's, the junkyard bunker, the overturned railway car, etc. these were some of the most moving stories in the game.  You're listening to ghosts.\n\nI'd also say that central conflict involving Father had the potential to be emotionally challenging, but the inability to confront him about the stuff he does really undermines the story.  He's done some horrible things.  For that matter, he's put you through some horrible things.  He dumped you in a wasteland with nothing, just to \"see what would happen.\"  He'll just-as-quickly banish you back there as a hostile if you don't go along with his plan.  And yet, he's your *son*.  That had the potential to pose some great conversations, but it never happens.  I wouldn't expect Father to have an epiphany, he's far too brainwashed for that, but the player's inability to do something as simple as \"No, you're wrong because X\" is really unfortunate.", "edited": 1492213286.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say the radio transmissions, in general.  These were one of my favorite things in F3 and I was so happy to see F4 double down with the concept.  Whether it&amp;#39;s that neighborhood bunker, the lady trapped in the basement at Fallon&amp;#39;s, the junkyard bunker, the overturned railway car, etc. these were some of the most moving stories in the game.  You&amp;#39;re listening to ghosts.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d also say that central conflict involving Father had the potential to be emotionally challenging, but the inability to confront him about the stuff he does really undermines the story.  He&amp;#39;s done some horrible things.  For that matter, he&amp;#39;s put you through some horrible things.  He dumped you in a wasteland with nothing, just to &amp;quot;see what would happen.&amp;quot;  He&amp;#39;ll just-as-quickly banish you back there as a hostile if you don&amp;#39;t go along with his plan.  And yet, he&amp;#39;s your &lt;em&gt;son&lt;/em&gt;.  That had the potential to pose some great conversations, but it never happens.  I wouldn&amp;#39;t expect Father to have an epiphany, he&amp;#39;s far too brainwashed for that, but the player&amp;#39;s inability to do something as simple as &amp;quot;No, you&amp;#39;re wrong because X&amp;quot; is really unfortunate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9xyp2", "score_hidden": false, "stickied": false, "created": 1492241744.0, "created_utc": 1492212944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dgacstn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JacksRevenge23", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Don't know how to do the spoiler tag thing so I'll be vague enough.\n\nThere are a ton of little side quests and \"hidden\" stories in the game that left me feeling a little blue. If you ever listen listen to holotapes or read journals on the terminals, you're probably familiar.\n\n I have a habit of never finishing main quests in Bethesda games. It wasn't until I put 1500+ hours into Skyrim that I finally killed alduin. \n\nLas week I finally sided with the Railroad and the brotherhood kills the one character I was actually attached to. I took their weapon, downloaded mods, and gave it explosive &amp; plasma damage. Then took the fight to the brotherhood and laid waste to them with the OP monster I created. \n\nI was genuinely... upset? It was a new thing for me usually in these kinds of games I'm just screwing around but I took a gleeful pleasure in slaughtering those xenophobic animals. \n\nAfter it was said and done, I took the weapon and armor and displayed it at a bar in one of my settlements.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t know how to do the spoiler tag thing so I&amp;#39;ll be vague enough.&lt;/p&gt;\n\n&lt;p&gt;There are a ton of little side quests and &amp;quot;hidden&amp;quot; stories in the game that left me feeling a little blue. If you ever listen listen to holotapes or read journals on the terminals, you&amp;#39;re probably familiar.&lt;/p&gt;\n\n&lt;p&gt;I have a habit of never finishing main quests in Bethesda games. It wasn&amp;#39;t until I put 1500+ hours into Skyrim that I finally killed alduin. &lt;/p&gt;\n\n&lt;p&gt;Las week I finally sided with the Railroad and the brotherhood kills the one character I was actually attached to. I took their weapon, downloaded mods, and gave it explosive &amp;amp; plasma damage. Then took the fight to the brotherhood and laid waste to them with the OP monster I created. &lt;/p&gt;\n\n&lt;p&gt;I was genuinely... upset? It was a new thing for me usually in these kinds of games I&amp;#39;m just screwing around but I took a gleeful pleasure in slaughtering those xenophobic animals. &lt;/p&gt;\n\n&lt;p&gt;After it was said and done, I took the weapon and armor and displayed it at a bar in one of my settlements.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dgacstn", "score_hidden": false, "stickied": false, "created": 1492264374.0, "created_utc": 1492235574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg90sh0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MegatronJones", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Cait's back-story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cait&amp;#39;s back-story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg90sh0", "score_hidden": false, "stickied": false, "created": 1492197890.0, "created_utc": 1492169090.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg9t7ii", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "That_One_Engi", "parent_id": "t1_dg8lq1v", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Was it the Lumber Mill quest for Far Harbour? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was it the Lumber Mill quest for Far Harbour? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg9t7ii", "score_hidden": false, "stickied": false, "created": 1492235426.0, "created_utc": 1492206626.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lq1v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "APerfectCircle0", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Finding the little boy in the fridge, and screwing up a quest on Far Harbour. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finding the little boy in the fridge, and screwing up a quest on Far Harbour. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8lq1v", "score_hidden": false, "stickied": false, "created": 1492164383.0, "created_utc": 1492135583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dgdwnm0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lordvaros", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I shot Father in the face when I first met him, after he explained everything. I was basically shaking IRL from the seething hate I felt. He admitted to subjecting me to violence and terror just for the fun of it. He admitted to continuing to allow the monster who murdered his father and countless others to exist - not only that, he was actively paying him and keeping the guy alive despite all of nature's best efforts. He admitted to destroying the Commonwealth that I called home to ensure he couldn't be touched by the people who rightly want him to see justice. He admitted to commanding the troops to kill my Brothers and Sisters in the BOS. He admitted to create a child-like mannequin freak to perfectly impersonate my son just to see the effects of severe mental trauma on me and the fake kid. He then said, \"Hey, you should come join us!\" I exited the conversation and shot him in the face out of sheer anger, completely forgetting the mission in the heat of the moment,.\n\nAfter returning to the Brotherhood, I remembered that I was supposed to be infiltrating those sadistic bastards, so I re-loaded and roleplayed that my character had better handle on her emotions than I did. It was still so satisfying to see Father watch everything he'd built crumble around him while he lay there helpless to even stand.\n\nF\\*ck you, Father. F\\*ck you to Hell and back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I shot Father in the face when I first met him, after he explained everything. I was basically shaking IRL from the seething hate I felt. He admitted to subjecting me to violence and terror just for the fun of it. He admitted to continuing to allow the monster who murdered his father and countless others to exist - not only that, he was actively paying him and keeping the guy alive despite all of nature&amp;#39;s best efforts. He admitted to destroying the Commonwealth that I called home to ensure he couldn&amp;#39;t be touched by the people who rightly want him to see justice. He admitted to commanding the troops to kill my Brothers and Sisters in the BOS. He admitted to create a child-like mannequin freak to perfectly impersonate my son just to see the effects of severe mental trauma on me and the fake kid. He then said, &amp;quot;Hey, you should come join us!&amp;quot; I exited the conversation and shot him in the face out of sheer anger, completely forgetting the mission in the heat of the moment,.&lt;/p&gt;\n\n&lt;p&gt;After returning to the Brotherhood, I remembered that I was supposed to be infiltrating those sadistic bastards, so I re-loaded and roleplayed that my character had better handle on her emotions than I did. It was still so satisfying to see Father watch everything he&amp;#39;d built crumble around him while he lay there helpless to even stand.&lt;/p&gt;\n\n&lt;p&gt;F*ck you, Father. F*ck you to Hell and back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dgdwnm0", "score_hidden": false, "stickied": false, "created": 1492483188.0, "created_utc": 1492454388.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8zd27", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Webo_", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 1, "body": "The feeling of disappointment", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The feeling of disappointment&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8zd27", "score_hidden": false, "stickied": false, "created": 1492193622.0, "created_utc": 1492164822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8m73t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Andrwjo", "parent_id": "t1_dg8dry4", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "I've never owned an iPhone so I didn't pick that one up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never owned an iPhone so I didn&amp;#39;t pick that one up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8m73t", "score_hidden": false, "stickied": false, "created": 1492165040.0, "created_utc": 1492136240.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8fk6s", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lemonfabian", "parent_id": "t1_dg8e49w", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "It looks nice on my shelf.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks nice on my shelf.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8fk6s", "score_hidden": false, "stickied": false, "created": 1492155886.0, "created_utc": 1492127086.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8e49w", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SUBJUGATOR001", "parent_id": "t1_dg8dry4", "subreddit_name_prefixed": "r/Fallout", "controversiality": 1, "body": "Is the pip boy actually any good?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is the pip boy actually any good?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8e49w", "score_hidden": false, "stickied": false, "created": 1492153986.0, "created_utc": 1492125186.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dry4", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "lemonfabian", "parent_id": "t1_dg8c12i", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "You think that's bad, I bought the pip-boy edition", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You think that&amp;#39;s bad, I bought the pip-boy edition&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8dry4", "score_hidden": false, "stickied": false, "created": 1492153521.0, "created_utc": 1492124721.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8gib1", "gilded": 0, "archived": false, "score": -10, "report_reasons": null, "author": "SKWM3000", "parent_id": "t1_dg8c12i", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "exactly.  i experienced some intense emotions thinking about that as i was pretending to enjoy the game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;exactly.  i experienced some intense emotions thinking about that as i was pretending to enjoy the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8gib1", "score_hidden": false, "stickied": false, "created": 1492157195.0, "created_utc": 1492128395.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8c12i", "gilded": 0, "archived": false, "score": -23, "report_reasons": null, "author": "dv666", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "That I spent 60 bucks on it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That I spent 60 bucks on it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8c12i", "score_hidden": false, "stickied": false, "created": 1492151208.0, "created_utc": 1492122408.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg980n4", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Trogdor220", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "The end. It hit me just then how much of a beautiful and emotional game that actually was. I don't think I've ever teared up at a game before. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The end. It hit me just then how much of a beautiful and emotional game that actually was. I don&amp;#39;t think I&amp;#39;ve ever teared up at a game before. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg980n4", "score_hidden": false, "stickied": false, "created": 1492210220.0, "created_utc": 1492181420.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnzu", "removal_reason": null, "link_id": "t3_657zll", "likes": null, "replies": "", "user_reports": [], "id": "dg8vdhl", "gilded": 0, "archived": false, "score": -14, "report_reasons": null, "author": "Fjark", "parent_id": "t3_657zll", "subreddit_name_prefixed": "r/Fallout", "controversiality": 0, "body": "Slowly realising what a bland experience F4 was. I almost cried.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Slowly realising what a bland experience F4 was. I almost cried.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fallout", "name": "t1_dg8vdhl", "score_hidden": false, "stickied": false, "created": 1492181402.0, "created_utc": 1492152602.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -14}}], "after": null, "before": null}}]