[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lotr", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to start by saying I&amp;#39;m sorry if any of these questions are answered in the books and I just didn&amp;#39;t pick up on them.&lt;/p&gt;\n\n&lt;p&gt;1) When he changes is it Gandalf himself taking on the title or does some higher being give him the title?&lt;/p&gt;\n\n&lt;p&gt;2) If it was a higher being was it more the killing of the Balrog or was it sacrificing himself for the Fellowship that caused it? Also is he more powerful as Gandalf the White than he was as Gandalf the Gray?&lt;/p&gt;\n\n&lt;p&gt;3) Was making him &amp;quot;the White&amp;quot; to spite Saruman or was it because the Wizards need a leader of the &amp;quot;White&amp;quot; title and Saruman left it?&lt;/p&gt;\n\n&lt;p&gt;4) When he told Aragorn, Gimli, and Legolas that he was &amp;quot;Saruman as he should be&amp;quot; did he forget who he was at the time and actually think he was Saruman or did he mean something more along the lines that he wasn&amp;#39;t going to go down the same path Saruman had?&lt;/p&gt;\n\n&lt;p&gt;Thank you to anyone who can answer these and sorry if any of them seem stupid to ask or don&amp;#39;t fully make sense how I worded them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'd like to start by saying I'm sorry if any of these questions are answered in the books and I just didn't pick up on them.\n\n1) When he changes is it Gandalf himself taking on the title or does some higher being give him the title?\n\n2) If it was a higher being was it more the killing of the Balrog or was it sacrificing himself for the Fellowship that caused it? Also is he more powerful as Gandalf the White than he was as Gandalf the Gray?\n\n3) Was making him \"the White\" to spite Saruman or was it because the Wizards need a leader of the \"White\" title and Saruman left it?\n\n4) When he told Aragorn, Gimli, and Legolas that he was \"Saruman as he should be\" did he forget who he was at the time and actually think he was Saruman or did he mean something more along the lines that he wasn't going to go down the same path Saruman had?\n\nThank you to anyone who can answer these and sorry if any of them seem stupid to ask or don't fully make sense how I worded them.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64t4mr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "TheBratPrince1760", "saved": false, "mod_reports": [], "name": "t3_64t4mr", "subreddit_name_prefixed": "r/lotr", "approved_by": null, "over_18": false, "domain": "self.lotr", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rfb9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/lotr/comments/64t4mr/some_questions_i_have_about_gandalfs_change_from/", "num_reports": null, "locked": false, "stickied": false, "created": 1491967942.0, "url": "https://www.reddit.com/r/lotr/comments/64t4mr/some_questions_i_have_about_gandalfs_change_from/", "author_flair_text": null, "quarantine": false, "title": "Some questions I have about Gandalf's change from \"Gray\" to \"White\"", "created_utc": 1491939142.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_64t4mr", "likes": null, "replies": "", "user_reports": [], "id": "dg51ols", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "rakino", "parent_id": "t3_64t4mr", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "Most of what we know about this (beyond the LotR) comes from this letter:\n\nLetter 156\n\n&gt; Gandalf alone fully passes the tests, on a moral plane anyway (he makes mistakes of judgement). For in his condition it was for him a sacrifice to perish on the Bridge in defence of his companions, less perhaps than for a mortal Man or Hobbit, since he had a far greater inner power than they; but also more, since it was a humbling and abnegation of himself in conformity to 'the Rules': for all he could know at that moment he was the only person who could direct the resistance to Sauron successfully, and all his mission was vain. He was handing over to the Authority that ordained the Rules, and giving up personal hope of success.\n\n&gt; That I should say is what the Authority wished, as a set-off to Saruman. The 'wizards', as such, had failed; or if you like: the crisis had become too grave and needed an enhancement of power. So Gandalf sacrificed himself, was accepted, and enhanced, and returned. 'Yes, that was the name. I was Gandalf.' Of course he remains similar in personality and idiosyncrasy, but both his wisdom and power are much greater. When he speaks he commands attention; the old Gandalf could not have dealt so with Théoden, nor with Saruman. He is still under the obligation of concealing his power and of teaching rather than forcing or dominating wills, but where the physical powers of the Enemy are too great for the good will of the opposers to be effective he can act in emergency as an 'angel' – no more violently than the release of St Peter from prison.\n\n...\n\n&gt;In the end before he departs for ever he sums himself up: 'I was the enemy of Sauron'. He might have added: 'for that purpose I was sent to Middle-earth'. But by that he would at the end have meant more than at the beginning. He was sent by a mere prudent plan of the angelic Valar or governors; but Authority had taken up this plan and enlarged it, at the moment of its failure. 'Naked I was sent back – for a brief time, until my task is done'. Sent back by whom, and whence? Not by the 'gods' whose business is only with this embodied world and its time; for he passed 'out of thought and time'. \n\nAnd letter 181:\n\n&gt;Gandalf is a 'created' person; though possibly a spirit that existed before in the physical world. His function as a 'wizard' is an *angelos* or messenger from the Valar or Rulers: to assist the rational creatures of Middle-earth to resist Sauron, a power too great for them unaided. But since in the view of this tale &amp; mythology Power – when it dominates or seeks to dominate other wills and minds (except by the assent of their reason) – is evil, these 'wizards' were incarnated in the life-forms of Middle-earth, and so suffered the pains both of mind and body. They were also, for the same reason, thus involved in the peril of the incarnate: the possibility of 'fall', of sin, if you will. The chief form this would take with them would be impatience, leading to the desire to force others to their own good ends, and so inevitably at last to mere desire to make their own wills effective by any means. To this evil Saruman succumbed. Gandalf did not. But the situation became so much the worse by the fall of Saruman, that the 'good' were obliged to greater effort and sacrifice. Thus Gandalf faced and suffered death; and came back or was sent back, as he says, with enhanced power. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most of what we know about this (beyond the LotR) comes from this letter:&lt;/p&gt;\n\n&lt;p&gt;Letter 156&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gandalf alone fully passes the tests, on a moral plane anyway (he makes mistakes of judgement). For in his condition it was for him a sacrifice to perish on the Bridge in defence of his companions, less perhaps than for a mortal Man or Hobbit, since he had a far greater inner power than they; but also more, since it was a humbling and abnegation of himself in conformity to &amp;#39;the Rules&amp;#39;: for all he could know at that moment he was the only person who could direct the resistance to Sauron successfully, and all his mission was vain. He was handing over to the Authority that ordained the Rules, and giving up personal hope of success.&lt;/p&gt;\n\n&lt;p&gt;That I should say is what the Authority wished, as a set-off to Saruman. The &amp;#39;wizards&amp;#39;, as such, had failed; or if you like: the crisis had become too grave and needed an enhancement of power. So Gandalf sacrificed himself, was accepted, and enhanced, and returned. &amp;#39;Yes, that was the name. I was Gandalf.&amp;#39; Of course he remains similar in personality and idiosyncrasy, but both his wisdom and power are much greater. When he speaks he commands attention; the old Gandalf could not have dealt so with Théoden, nor with Saruman. He is still under the obligation of concealing his power and of teaching rather than forcing or dominating wills, but where the physical powers of the Enemy are too great for the good will of the opposers to be effective he can act in emergency as an &amp;#39;angel&amp;#39; – no more violently than the release of St Peter from prison.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In the end before he departs for ever he sums himself up: &amp;#39;I was the enemy of Sauron&amp;#39;. He might have added: &amp;#39;for that purpose I was sent to Middle-earth&amp;#39;. But by that he would at the end have meant more than at the beginning. He was sent by a mere prudent plan of the angelic Valar or governors; but Authority had taken up this plan and enlarged it, at the moment of its failure. &amp;#39;Naked I was sent back – for a brief time, until my task is done&amp;#39;. Sent back by whom, and whence? Not by the &amp;#39;gods&amp;#39; whose business is only with this embodied world and its time; for he passed &amp;#39;out of thought and time&amp;#39;. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And letter 181:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gandalf is a &amp;#39;created&amp;#39; person; though possibly a spirit that existed before in the physical world. His function as a &amp;#39;wizard&amp;#39; is an &lt;em&gt;angelos&lt;/em&gt; or messenger from the Valar or Rulers: to assist the rational creatures of Middle-earth to resist Sauron, a power too great for them unaided. But since in the view of this tale &amp;amp; mythology Power – when it dominates or seeks to dominate other wills and minds (except by the assent of their reason) – is evil, these &amp;#39;wizards&amp;#39; were incarnated in the life-forms of Middle-earth, and so suffered the pains both of mind and body. They were also, for the same reason, thus involved in the peril of the incarnate: the possibility of &amp;#39;fall&amp;#39;, of sin, if you will. The chief form this would take with them would be impatience, leading to the desire to force others to their own good ends, and so inevitably at last to mere desire to make their own wills effective by any means. To this evil Saruman succumbed. Gandalf did not. But the situation became so much the worse by the fall of Saruman, that the &amp;#39;good&amp;#39; were obliged to greater effort and sacrifice. Thus Gandalf faced and suffered death; and came back or was sent back, as he says, with enhanced power. &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dg51ols", "score_hidden": false, "stickied": false, "created": 1491978981.0, "created_utc": 1491950181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_64t4mr", "likes": null, "replies": "", "user_reports": [], "id": "dg4spw1", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "MikeOfThePalace", "parent_id": "t3_64t4mr", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "Gandalf stayed true to his mission (the only one of the Wizards truly to do so), and died in the service of it. He was sent back by God with a power-up to complete his task of helping the people of Middle-earth stand against Sauron.\n\nHe was clothed in white by Galadriel, to show, as you quote, that he was \"Saruman as he should have been.\" Gandalf was the inspiring symbol that Saruman could have been, but fell from.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gandalf stayed true to his mission (the only one of the Wizards truly to do so), and died in the service of it. He was sent back by God with a power-up to complete his task of helping the people of Middle-earth stand against Sauron.&lt;/p&gt;\n\n&lt;p&gt;He was clothed in white by Galadriel, to show, as you quote, that he was &amp;quot;Saruman as he should have been.&amp;quot; Gandalf was the inspiring symbol that Saruman could have been, but fell from.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dg4spw1", "score_hidden": false, "stickied": false, "created": 1491968463.0, "created_utc": 1491939663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_64t4mr", "likes": null, "replies": "", "user_reports": [], "id": "dg6edw2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ReinierPersoon", "parent_id": "t3_64t4mr", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "(this is all my interpretation, I'm not saying I'm correct)\n\nTake note how Saruman stopped being 'the White' long before: he called himself Saruman of the many colours when he took Gandalf prisoned, and essentially betrayed their mission (although he had turned from that long ago). \n\nGaladriel wanted Gandalf to be the leader of the White Council. Círdan gave him Narya. Gandalf the Grey seems to have been destined to be the leader against Sauron, as he essentially becomes the last of the Istari (Sauron became a turncoat, and the others are all MIA, even Radagast disappears), which seems to give him the authority to cast out Saruman by breaking his staff. And he is clad in white in Lothlórien, so he essentially replaces Saruman (although he walks around still covered in grey rags according to Gimli, until he receives Shadowfax (who happens to be grey). \n\nI don't think the colours were an actual hierarchy, but there is a lot of use of colours in the book. Gandalf walks around in a grey, tattered cloak, but whenever he reveals his powes he throws back his cloak, or takes it off. He does it when Aragorn and Co meet Gandalf the White for the first time, he does it at Théoden's place. \n\nHere is when Aragorn and Co draw weapons on Gandalf:\n\n&gt; The old man took no notice, but stooped and sat himself on a low flat\nstone. Then his grey cloak drew apart, and they saw, beyond doubt, that he was\nclothed beneath all in white.\n\n&gt; 'Saruman!' cried Gimli, springing towards him with axe in hand. 'speak!\nTell us where you have hidden our friends! What have you done with them?\nSpeak, or I will make a dint in your hat that even a wizard will find it hard\nto deal with!'\n\n&gt; The old man was too quick for him. He sprang to his feet and leaped to\nthe top of a large rock. There he stood, grown suddenly tall, towering above\nthem. His hood and his grey rags were flung away. His white garments shone. He\nlifted up his staff, and Gimli's axe leaped from his grasp and fell ringing on\nthe ground. The sword of Aragorn, stiff in his motionless hand, blazed with a\nsudden fire. Legolas gave a great shout and shot an arrow high into the air:\nit vanished in a flash of flame.\n\n&gt; 'Mithrandir!' he cried. 'Mithrandir!'\n\n 'Well met, I say to you again. Legolas!' said the old man.\n They all gazed at him. His hair was white as snow in the sunshine; and\ngleaming white was his robe; the eyes under his deep brows were bright,\npiercing as the rays of the sun; power was in his hand. Between wonder, joy,\nand fear they stood and found no words to say.\n\nHe immediately responds to the name Mithrandir. But then:\n\n&gt; At last Aragorn stirred. 'Gandalf!' he said. 'Beyond all hope you return\nto us in our need! What veil was over my sight? Gandalf!' Gimli said nothing,\nhut sank to his knees, shading his eyes.\n\n 'Gandalf,' the old man repeated, as if recalling from old memory a long\ndisused word. 'Yes, that was the name. I was Gandalf.'\n\n He stepped down from the rock, and picking up his grey cloak wrapped it\nabout him: it seemed as if the sun had been shining, but now was hid in cloud\nagain. 'Yes, you may still call me Gandalf,' he said, and the voice was the\nvoice of their old friend and guide. 'Get up, my good Gimli! No blame to you,\nand no harm done to me. Indeed my friends, none of you have any weapon that\ncould hurt me. Be merry! We meet again. At the turn of the tide. The great\nstorm is coming, but the tide has turned.'\n\nOk, his reaction to 'Gandalf' is strange. But the Elves in Lothlórien would have called him Mithrandir instead of Gandalf. Ok...\n\n&gt; He laid his hand on Gimli's head, and the Dwarf looked up and laughed\nsuddenly. 'Gandalf!' he said. 'But you are all in white!'\n\n 'Yes, I am white now,' said Gandalf. 'Indeed I _am_ Saruman, one might\nalmost say, Saruman as he should have been. But come now, tell me of\nyourselves! I have passed through fire and deep water, since we parted. I have\nforgotten much that I thought I knew, and learned again much that I had\nforgotten. I can see many things far off, but many things that are close at\nhand I cannot see. Tell me of yourselves!'\n\nSo he has forgotten much, and seen things far off. Hm. There are a few instances where Gandalf the White seems to see things in a supernatural way, 'with the sight that was given to him' he saw all that happened at the Battle of the Pelennor Fields for example, the things that happened when he was dealing with Denethor in Rath Dínen. \n\nNow why would Gandalf seem so confused that he doesn't know his name? Well, there are several things that happened. He had a 10 day fight with the Balrog, then he died and his soul left Creation altogether: \n\n&gt;  I threw down my enemy, and he fell from the high place and\nbroke the mountain-side where he smote it in his ruin. Then darkness took me;\nand I strayed out of thought and time, and I wandered far on roads that I will\nnot tell.\n\nOut of thought and time. And then he was sent back by Eru (God).  But there is also something else that happens: \n\n&gt;  The Ring now has passed beyond my\nhelp, or the help of any of the Company that set out from Rivendell. Very\nnearly it was revealed to the Enemy, but it escaped. I had some part in that:\nfor I sat in a high place, and I strove with the Dark Tower; and the Shadow\npassed. Then I was weary, very weary; and I walked long in dark thought.'\n\nWhen Frodo was on Amon Hen, wearing the Ring, and nearly discovered by Sauron, Gandalf apparently struggled with Sauron (he was the Voice that Frodo heard when he felt the Eye at Amon Hen). We know that for example Aragorn and Denethor are strongly affected when they meet Sauron through a palantír.\n\nGandalf also talks about meeting Treebeard:\n\n&gt;  I saw him four days ago striding among the trees, and I\nthink he saw me, for he paused; but I did not speak, for I was heavy with\nthought, and weary after my struggle with the Eye of Mordor; and he did not\nspeak either, nor call my name.\n\nSo Gandalf may have forgotten some stuff about his life as an incarnation of an old man rather than the primeval Maia spirit that he is. Because 'Gandalf' wasn't his original identitity and body anyway. And of course he went through an enormous ordeal: Balrog, death, yanked out of Creation altogether, sent back to his broken body on the mountain top, lying there for days while hearing the sorrows of the world, getting healed in Lothlórien, and going after the Fellowship at good speed, and struggling with Sauron from a distance. \n\nMost (all?) of the quotes here are from the chapter The White Rider, one of the most interesting chapters of LotR in my opinion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(this is all my interpretation, I&amp;#39;m not saying I&amp;#39;m correct)&lt;/p&gt;\n\n&lt;p&gt;Take note how Saruman stopped being &amp;#39;the White&amp;#39; long before: he called himself Saruman of the many colours when he took Gandalf prisoned, and essentially betrayed their mission (although he had turned from that long ago). &lt;/p&gt;\n\n&lt;p&gt;Galadriel wanted Gandalf to be the leader of the White Council. Círdan gave him Narya. Gandalf the Grey seems to have been destined to be the leader against Sauron, as he essentially becomes the last of the Istari (Sauron became a turncoat, and the others are all MIA, even Radagast disappears), which seems to give him the authority to cast out Saruman by breaking his staff. And he is clad in white in Lothlórien, so he essentially replaces Saruman (although he walks around still covered in grey rags according to Gimli, until he receives Shadowfax (who happens to be grey). &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think the colours were an actual hierarchy, but there is a lot of use of colours in the book. Gandalf walks around in a grey, tattered cloak, but whenever he reveals his powes he throws back his cloak, or takes it off. He does it when Aragorn and Co meet Gandalf the White for the first time, he does it at Théoden&amp;#39;s place. &lt;/p&gt;\n\n&lt;p&gt;Here is when Aragorn and Co draw weapons on Gandalf:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The old man took no notice, but stooped and sat himself on a low flat\nstone. Then his grey cloak drew apart, and they saw, beyond doubt, that he was\nclothed beneath all in white.&lt;/p&gt;\n\n&lt;p&gt;&amp;#39;Saruman!&amp;#39; cried Gimli, springing towards him with axe in hand. &amp;#39;speak!\nTell us where you have hidden our friends! What have you done with them?\nSpeak, or I will make a dint in your hat that even a wizard will find it hard\nto deal with!&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;The old man was too quick for him. He sprang to his feet and leaped to\nthe top of a large rock. There he stood, grown suddenly tall, towering above\nthem. His hood and his grey rags were flung away. His white garments shone. He\nlifted up his staff, and Gimli&amp;#39;s axe leaped from his grasp and fell ringing on\nthe ground. The sword of Aragorn, stiff in his motionless hand, blazed with a\nsudden fire. Legolas gave a great shout and shot an arrow high into the air:\nit vanished in a flash of flame.&lt;/p&gt;\n\n&lt;p&gt;&amp;#39;Mithrandir!&amp;#39; he cried. &amp;#39;Mithrandir!&amp;#39;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#39;Well met, I say to you again. Legolas!&amp;#39; said the old man.\n They all gazed at him. His hair was white as snow in the sunshine; and\ngleaming white was his robe; the eyes under his deep brows were bright,\npiercing as the rays of the sun; power was in his hand. Between wonder, joy,\nand fear they stood and found no words to say.&lt;/p&gt;\n\n&lt;p&gt;He immediately responds to the name Mithrandir. But then:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At last Aragorn stirred. &amp;#39;Gandalf!&amp;#39; he said. &amp;#39;Beyond all hope you return\nto us in our need! What veil was over my sight? Gandalf!&amp;#39; Gimli said nothing,\nhut sank to his knees, shading his eyes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#39;Gandalf,&amp;#39; the old man repeated, as if recalling from old memory a long\ndisused word. &amp;#39;Yes, that was the name. I was Gandalf.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;He stepped down from the rock, and picking up his grey cloak wrapped it\nabout him: it seemed as if the sun had been shining, but now was hid in cloud\nagain. &amp;#39;Yes, you may still call me Gandalf,&amp;#39; he said, and the voice was the\nvoice of their old friend and guide. &amp;#39;Get up, my good Gimli! No blame to you,\nand no harm done to me. Indeed my friends, none of you have any weapon that\ncould hurt me. Be merry! We meet again. At the turn of the tide. The great\nstorm is coming, but the tide has turned.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;Ok, his reaction to &amp;#39;Gandalf&amp;#39; is strange. But the Elves in Lothlórien would have called him Mithrandir instead of Gandalf. Ok...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He laid his hand on Gimli&amp;#39;s head, and the Dwarf looked up and laughed\nsuddenly. &amp;#39;Gandalf!&amp;#39; he said. &amp;#39;But you are all in white!&amp;#39;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#39;Yes, I am white now,&amp;#39; said Gandalf. &amp;#39;Indeed I &lt;em&gt;am&lt;/em&gt; Saruman, one might\nalmost say, Saruman as he should have been. But come now, tell me of\nyourselves! I have passed through fire and deep water, since we parted. I have\nforgotten much that I thought I knew, and learned again much that I had\nforgotten. I can see many things far off, but many things that are close at\nhand I cannot see. Tell me of yourselves!&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;So he has forgotten much, and seen things far off. Hm. There are a few instances where Gandalf the White seems to see things in a supernatural way, &amp;#39;with the sight that was given to him&amp;#39; he saw all that happened at the Battle of the Pelennor Fields for example, the things that happened when he was dealing with Denethor in Rath Dínen. &lt;/p&gt;\n\n&lt;p&gt;Now why would Gandalf seem so confused that he doesn&amp;#39;t know his name? Well, there are several things that happened. He had a 10 day fight with the Balrog, then he died and his soul left Creation altogether: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I threw down my enemy, and he fell from the high place and\nbroke the mountain-side where he smote it in his ruin. Then darkness took me;\nand I strayed out of thought and time, and I wandered far on roads that I will\nnot tell.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Out of thought and time. And then he was sent back by Eru (God).  But there is also something else that happens: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Ring now has passed beyond my\nhelp, or the help of any of the Company that set out from Rivendell. Very\nnearly it was revealed to the Enemy, but it escaped. I had some part in that:\nfor I sat in a high place, and I strove with the Dark Tower; and the Shadow\npassed. Then I was weary, very weary; and I walked long in dark thought.&amp;#39;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When Frodo was on Amon Hen, wearing the Ring, and nearly discovered by Sauron, Gandalf apparently struggled with Sauron (he was the Voice that Frodo heard when he felt the Eye at Amon Hen). We know that for example Aragorn and Denethor are strongly affected when they meet Sauron through a palantír.&lt;/p&gt;\n\n&lt;p&gt;Gandalf also talks about meeting Treebeard:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I saw him four days ago striding among the trees, and I\nthink he saw me, for he paused; but I did not speak, for I was heavy with\nthought, and weary after my struggle with the Eye of Mordor; and he did not\nspeak either, nor call my name.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So Gandalf may have forgotten some stuff about his life as an incarnation of an old man rather than the primeval Maia spirit that he is. Because &amp;#39;Gandalf&amp;#39; wasn&amp;#39;t his original identitity and body anyway. And of course he went through an enormous ordeal: Balrog, death, yanked out of Creation altogether, sent back to his broken body on the mountain top, lying there for days while hearing the sorrows of the world, getting healed in Lothlórien, and going after the Fellowship at good speed, and struggling with Sauron from a distance. &lt;/p&gt;\n\n&lt;p&gt;Most (all?) of the quotes here are from the chapter The White Rider, one of the most interesting chapters of LotR in my opinion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dg6edw2", "score_hidden": false, "stickied": false, "created": 1492053860.0, "created_utc": 1492025060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_64t4mr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_64t4mr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_64t4mr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_64t4mr", "likes": null, "replies": "", "user_reports": [], "id": "dg6yomv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheBratPrince1760", "parent_id": "t1_dg6xoq1", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "I'm hoping to eventually read more of Tolkin's work when I get the money to get more books ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m hoping to eventually read more of Tolkin&amp;#39;s work when I get the money to get more books &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dg6yomv", "score_hidden": false, "stickied": false, "created": 1492077606.0, "created_utc": 1492048806.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xoq1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bigwillyb123", "parent_id": "t1_dg6q17c", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "If you wanna expand your mind more, you can read a tiny bit about the two Blue Wizards as well, along with Radaghast the Brown (whose mission *may* have been different)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you wanna expand your mind more, you can read a tiny bit about the two Blue Wizards as well, along with Radaghast the Brown (whose mission &lt;em&gt;may&lt;/em&gt; have been different)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dg6xoq1", "score_hidden": false, "stickied": false, "created": 1492076366.0, "created_utc": 1492047566.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6q17c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheBratPrince1760", "parent_id": "t1_dg6pksx", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "I appreciate your simple answer just as much ad the detailed ones I'm just really bad about responding on here. Thank you for the answer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate your simple answer just as much ad the detailed ones I&amp;#39;m just really bad about responding on here. Thank you for the answer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dg6q17c", "score_hidden": false, "stickied": false, "created": 1492066983.0, "created_utc": 1492038183.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pksx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bigwillyb123", "parent_id": "t3_64t4mr", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "These answers are extremely detailed, good on all of you for giving such complete answers. However, seeing as OP hasn't responded, he may be looking for something simpler.\n\n1) When he changes, he died. He was dead, and Eru (basically God) pulled him out of the universe, rehabilitated him, made him more powerful, re-formed his body, and sent him back to Earth. He obtained the title of The White once he returned, but like his other nicknames (the Grey Pilgrim, ect) it was probably given to him by someone. Perhaps it was Galadriel.\n\n2) Gandalf was sent to Middle-Earth to do one thing: Rally the free peoples against Sauron and defeat him. In dying from the battle, he failed his mission, but unlike Saruman, he didn't willfully abandon it. He wasn't able to use his full power in human form, so he died along with the Balrog. Eru must have decided he should be given another shot. Also yes, he's vastly more powerful, but it's fairer to say he was let use more of his power.\n\n3) It may have been a bit of both, it's mostly because Saruman the Many Colored abandoned his title and mission but Gandalf had not, so there was an open spot for the new \"leader\" of the Istari.\n\n4) Again, Saruman was blessed with incredible power to do the same thing as Gandalf, rally the free peoples of Middle-Earth against Sauron. But since he abandoned his mission, the Fellowship (and the world) needed a new powerful player on their side. The Grey died, The White abandoned his mission, so Gandalf was sent back to take Saruman's place and fulfill his purpose. So you're right in that he was saying \"The old Saruman fucked up, I'm the new Saruman basically, so direct all White-related inquiries to me.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These answers are extremely detailed, good on all of you for giving such complete answers. However, seeing as OP hasn&amp;#39;t responded, he may be looking for something simpler.&lt;/p&gt;\n\n&lt;p&gt;1) When he changes, he died. He was dead, and Eru (basically God) pulled him out of the universe, rehabilitated him, made him more powerful, re-formed his body, and sent him back to Earth. He obtained the title of The White once he returned, but like his other nicknames (the Grey Pilgrim, ect) it was probably given to him by someone. Perhaps it was Galadriel.&lt;/p&gt;\n\n&lt;p&gt;2) Gandalf was sent to Middle-Earth to do one thing: Rally the free peoples against Sauron and defeat him. In dying from the battle, he failed his mission, but unlike Saruman, he didn&amp;#39;t willfully abandon it. He wasn&amp;#39;t able to use his full power in human form, so he died along with the Balrog. Eru must have decided he should be given another shot. Also yes, he&amp;#39;s vastly more powerful, but it&amp;#39;s fairer to say he was let use more of his power.&lt;/p&gt;\n\n&lt;p&gt;3) It may have been a bit of both, it&amp;#39;s mostly because Saruman the Many Colored abandoned his title and mission but Gandalf had not, so there was an open spot for the new &amp;quot;leader&amp;quot; of the Istari.&lt;/p&gt;\n\n&lt;p&gt;4) Again, Saruman was blessed with incredible power to do the same thing as Gandalf, rally the free peoples of Middle-Earth against Sauron. But since he abandoned his mission, the Fellowship (and the world) needed a new powerful player on their side. The Grey died, The White abandoned his mission, so Gandalf was sent back to take Saruman&amp;#39;s place and fulfill his purpose. So you&amp;#39;re right in that he was saying &amp;quot;The old Saruman fucked up, I&amp;#39;m the new Saruman basically, so direct all White-related inquiries to me.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dg6pksx", "score_hidden": false, "stickied": false, "created": 1492066414.0, "created_utc": 1492037614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]