[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lotr", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We know that it begins when Aragorn becomes King of Gondor and it&amp;#39;s named &amp;quot;Era of the men&amp;quot; but what happens in it?  What happens to the Haradrims and Easterlings? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We know that it begins when Aragorn becomes King of Gondor and it's named \"Era of the men\" but what happens in it?  What happens to the Haradrims and Easterlings? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vpjg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "Orsobruno3300", "saved": false, "mod_reports": [], "name": "t3_65vpjg", "subreddit_name_prefixed": "r/lotr", "approved_by": null, "over_18": false, "domain": "self.lotr", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rfb9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/lotr/comments/65vpjg/what_happens_in_the_fourth_era/", "num_reports": null, "locked": false, "stickied": false, "created": 1492466487.0, "url": "https://www.reddit.com/r/lotr/comments/65vpjg/what_happens_in_the_fourth_era/", "author_flair_text": null, "quarantine": false, "title": "What happens in the fourth Era?", "created_utc": 1492437687.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_65vpjg", "likes": null, "replies": "", "user_reports": [], "id": "dgdkg6z", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "EyeceEyeceBaby", "parent_id": "t3_65vpjg", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "Just a small note up front: The Fourth Age doesn't begin with Aragorn's crowning. It's exact beginning varies depending on your source. In Gondor, it began March 25, 3021 (second anniversary of the Ring's destruction). In the Shire, it began with the start of the following year, though they continued to count years in Shire Reckoning. There's also a line about the Third Age ending with the departure of Frodo and Bilbo in September, 3021.\n\nTolkien really didn't write a whole lot about the Fourth Age. As for what happened to the Haradrim and Easterlings, the only information we're given can be found in *The Return of the King*:\n\n&gt;In the days that followed his crowning the King sat on his throne in the Hall of the Kings and pronounced his judgements. And embassies came from many lands and peoples, from the East and the South, and from the borders of Mirkwood, and from Dunland in the west. And the King pardoned the Easterlings that had given themselves up, and sent them away free, and he made peace with the peoples of Harad; and the slaves of Mordor he released and gave to them all the lands about Lake Núrnen to be their own.\n\nAragorn probably claimed or reconquered parts of those kingdoms as we also have this line from the Appendices:\n\n&gt;In Gondor the King Elessar now ruled, and in Arnor also. In all the lands of those realms of old he was king, save in Rohan only;\n\nIn *The Atlas of Middle-earth* this is interpreted to mean he is King of all the lands of Arnor and Gondor at their greatest historical extent (except Rohan), which would look something like [this](http://imgur.com/a/TKGWK). As you can see, this would mean exerting control over lands formerly held by the Easterlings, the Haradrim and the Corsairs. Whether this was done forcefully or the lands were ceded peacefully is unknown. Given the first quote above, it was probably peaceful with Harad at least.\n\nFinally, Tolkien did write a few pages of a new tale set during the rule of Aragorn's son, Eldarion. It's incomplete and he found it \"both sinister and depressing\" and, ultimately, \"not worth doing.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just a small note up front: The Fourth Age doesn&amp;#39;t begin with Aragorn&amp;#39;s crowning. It&amp;#39;s exact beginning varies depending on your source. In Gondor, it began March 25, 3021 (second anniversary of the Ring&amp;#39;s destruction). In the Shire, it began with the start of the following year, though they continued to count years in Shire Reckoning. There&amp;#39;s also a line about the Third Age ending with the departure of Frodo and Bilbo in September, 3021.&lt;/p&gt;\n\n&lt;p&gt;Tolkien really didn&amp;#39;t write a whole lot about the Fourth Age. As for what happened to the Haradrim and Easterlings, the only information we&amp;#39;re given can be found in &lt;em&gt;The Return of the King&lt;/em&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In the days that followed his crowning the King sat on his throne in the Hall of the Kings and pronounced his judgements. And embassies came from many lands and peoples, from the East and the South, and from the borders of Mirkwood, and from Dunland in the west. And the King pardoned the Easterlings that had given themselves up, and sent them away free, and he made peace with the peoples of Harad; and the slaves of Mordor he released and gave to them all the lands about Lake Núrnen to be their own.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Aragorn probably claimed or reconquered parts of those kingdoms as we also have this line from the Appendices:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In Gondor the King Elessar now ruled, and in Arnor also. In all the lands of those realms of old he was king, save in Rohan only;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In &lt;em&gt;The Atlas of Middle-earth&lt;/em&gt; this is interpreted to mean he is King of all the lands of Arnor and Gondor at their greatest historical extent (except Rohan), which would look something like &lt;a href=\"http://imgur.com/a/TKGWK\"&gt;this&lt;/a&gt;. As you can see, this would mean exerting control over lands formerly held by the Easterlings, the Haradrim and the Corsairs. Whether this was done forcefully or the lands were ceded peacefully is unknown. Given the first quote above, it was probably peaceful with Harad at least.&lt;/p&gt;\n\n&lt;p&gt;Finally, Tolkien did write a few pages of a new tale set during the rule of Aragorn&amp;#39;s son, Eldarion. It&amp;#39;s incomplete and he found it &amp;quot;both sinister and depressing&amp;quot; and, ultimately, &amp;quot;not worth doing.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dgdkg6z", "score_hidden": false, "stickied": false, "created": 1492469316.0, "created_utc": 1492440516.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_65vpjg", "likes": null, "replies": "", "user_reports": [], "id": "dgdkcpd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_Igep_", "parent_id": "t3_65vpjg", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "It's all in the appendices but from what I remember, Gimli makes a colony in the caverns of Helm's Deep, Aragorn is king and dies in FA 120, Pippin becomes Thain of the Shire and Merry something similar, Sam becomes mayor 7 times and has kids. When Aragorn dies, Legolas builds a ship and takes Gimli with him to the West, and when Rosie dies, Sam sails to the West. Merry and Pippin die of old age and are put next to the tomb of Aragorn in Minas Tirith.\n\nThat's how the Fellowship ends, and I think that's pretty much all the info we have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s all in the appendices but from what I remember, Gimli makes a colony in the caverns of Helm&amp;#39;s Deep, Aragorn is king and dies in FA 120, Pippin becomes Thain of the Shire and Merry something similar, Sam becomes mayor 7 times and has kids. When Aragorn dies, Legolas builds a ship and takes Gimli with him to the West, and when Rosie dies, Sam sails to the West. Merry and Pippin die of old age and are put next to the tomb of Aragorn in Minas Tirith.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s how the Fellowship ends, and I think that&amp;#39;s pretty much all the info we have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dgdkcpd", "score_hidden": false, "stickied": false, "created": 1492469192.0, "created_utc": 1492440392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_65vpjg", "likes": null, "replies": "", "user_reports": [], "id": "dgekf9j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Belegorn", "parent_id": "t3_65vpjg", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "There was much re-ordering of the realm and after Aragorn became king he still \"*had many enemies to subdue*\" (The House of Eorl) and did so far east of Rhûn and South of Umbar. Faramir was made Prince of Ithilien where Elves from Greenwood the Great dwelt, and he cleansed former strongholds of Gondor of enemies. Aragorn made the Shire off limits to Men.\n\n&gt; Also to be Prince of Ithilien, the greatest noble after Dol Amroth in the revived Númenórean state of Gondor, soon to be of imperial power and prestige, was not a 'market-garden job' as you term it. Until much had been done by the restored King, the P. of Ithilien would be the resident march-warden of Gondor, in its main eastward outpost - and also would have many duties in rehabilitating the lost territory, and clearing it of outlaws and orc-remnants, not to speak of the dreadful vale of Minas Ithil (Morgul). I did not, naturally, go into details about the way in which Aragorn, as King of Gondor, would govern the realm. But it was clear that there was much fighting, and in the early years of A.'s reign expeditions against enemies in the East. The chief commanders, under the King, would be Faramir and Imrahil; and one of these would normally be a military commander at home in the King's absence. A Númenórean king was monarch, with the power of unquestioned decision in debate; but he governed the realm with the frame of ancient law, of which he was administrator (and interpreter) but not the maker. In all debatable matters of importance domestic, or external, however, even Denethor had a Council, and at least listened to what the Lords of the Fiefs and the Captains of the Forces had to say. Aragorn re-established the Great Council of Gondor, and in that Faramir, who remained by inheritance the Steward (or representative of the King during his absence abroad, or sickness, or between his death and the accession of his heir) would [be] the chief counsellor. (The Letters of J.R.R.Tolkien, Letter 244)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was much re-ordering of the realm and after Aragorn became king he still &amp;quot;&lt;em&gt;had many enemies to subdue&lt;/em&gt;&amp;quot; (The House of Eorl) and did so far east of Rhûn and South of Umbar. Faramir was made Prince of Ithilien where Elves from Greenwood the Great dwelt, and he cleansed former strongholds of Gondor of enemies. Aragorn made the Shire off limits to Men.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Also to be Prince of Ithilien, the greatest noble after Dol Amroth in the revived Númenórean state of Gondor, soon to be of imperial power and prestige, was not a &amp;#39;market-garden job&amp;#39; as you term it. Until much had been done by the restored King, the P. of Ithilien would be the resident march-warden of Gondor, in its main eastward outpost - and also would have many duties in rehabilitating the lost territory, and clearing it of outlaws and orc-remnants, not to speak of the dreadful vale of Minas Ithil (Morgul). I did not, naturally, go into details about the way in which Aragorn, as King of Gondor, would govern the realm. But it was clear that there was much fighting, and in the early years of A.&amp;#39;s reign expeditions against enemies in the East. The chief commanders, under the King, would be Faramir and Imrahil; and one of these would normally be a military commander at home in the King&amp;#39;s absence. A Númenórean king was monarch, with the power of unquestioned decision in debate; but he governed the realm with the frame of ancient law, of which he was administrator (and interpreter) but not the maker. In all debatable matters of importance domestic, or external, however, even Denethor had a Council, and at least listened to what the Lords of the Fiefs and the Captains of the Forces had to say. Aragorn re-established the Great Council of Gondor, and in that Faramir, who remained by inheritance the Steward (or representative of the King during his absence abroad, or sickness, or between his death and the accession of his heir) would [be] the chief counsellor. (The Letters of J.R.R.Tolkien, Letter 244)&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dgekf9j", "score_hidden": false, "stickied": false, "created": 1492511916.0, "created_utc": 1492483116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_65vpjg", "likes": null, "replies": "", "user_reports": [], "id": "dgemdgl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Salicias", "parent_id": "t3_65vpjg", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "Besides what happened right after the change that everyone has mentioned, I always assumed the era of men was the gradual transition to today. The elfs left middle Earth and everyone else eventually died out or became basically hidden from man's eyes as they took over and memory of past ages faded. I always figured that was the intention, to tie it to us; to make it more real.\n\nI don't know if there was anything written that inspired this belief or if it was just a childhood theory. Time for a reread.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Besides what happened right after the change that everyone has mentioned, I always assumed the era of men was the gradual transition to today. The elfs left middle Earth and everyone else eventually died out or became basically hidden from man&amp;#39;s eyes as they took over and memory of past ages faded. I always figured that was the intention, to tie it to us; to make it more real.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if there was anything written that inspired this belief or if it was just a childhood theory. Time for a reread.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dgemdgl", "score_hidden": false, "stickied": false, "created": 1492514404.0, "created_utc": 1492485604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_65vpjg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rfb9", "removal_reason": null, "link_id": "t3_65vpjg", "likes": null, "replies": "", "user_reports": [], "id": "dgdikae", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Orsobruno3300", "parent_id": "t1_dgdihtc", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "I did read them, I remember that Aragorn lived 200+ years and his son 100+ years. Aragorn also got 2 daughters if I remember correctly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did read them, I remember that Aragorn lived 200+ years and his son 100+ years. Aragorn also got 2 daughters if I remember correctly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dgdikae", "score_hidden": false, "stickied": false, "created": 1492466775.0, "created_utc": 1492437975.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdihtc", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Oubliette_occupant", "parent_id": "t3_65vpjg", "subreddit_name_prefixed": "r/lotr", "controversiality": 0, "body": "Iirc correctly Arnor and Gondor are reunited, but I don have specifics. You've read the appendicies, yah?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Iirc correctly Arnor and Gondor are reunited, but I don have specifics. You&amp;#39;ve read the appendicies, yah?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lotr", "name": "t1_dgdihtc", "score_hidden": false, "stickied": false, "created": 1492466677.0, "created_utc": 1492437877.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]