[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Fantasy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m riding the coat tails of another thread posted today about them doing a re-read for the first time in 6-7 years &lt;a href=\"/u/tkinsey3\"&gt;u/tkinsey3&lt;/a&gt; and I figured since this review was already 80% done I&amp;#39;d tweak it and post it to ride the coattails of that review - I figure it might help bring the point home that these series are worth reading, and absolutely worth re-reading as well. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Intro&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;I&amp;#39;ve already watched the series, is this really worth reading? It seems long....&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I would argue for most people who love the show would also love the books, maybe even a little more especially if you&amp;#39;re into the complexity and background plots. &lt;/p&gt;\n\n&lt;p&gt;After season 3, there are major drifts away from the books with characters missing, huge plot changes, and a bunch of other stuff that &lt;em&gt;will&lt;/em&gt; keep the novels fresh and exciting. By season 6 many plot lines are utterly unrecognizable from their book counter points. To be brief: Jaime never goes to Dorne, nor does Bronn and there&amp;#39;s no &amp;quot;bad pussy&amp;quot;, (and those sand snakes aren&amp;#39;t cringey). Sansa is NOT being married to Ramsay Snow, and Brienne is in the riverlands looking for her, not at Winterfell. There&amp;#39;s lots of stuff like that, so here&amp;#39;s my spiel on why the first three are 5 star books.&lt;/p&gt;\n\n&lt;p&gt;Even before the major changes to the plot and characters there&amp;#39;s a level of depth that&amp;#39;s missing, and I don&amp;#39;t think the show could have done anything about it. You get inner dialogue and thoughts and memories from these characters that are almost completely gone from the show. It wouldn&amp;#39;t make sense for it to be on the show so it&amp;#39;s not something I&amp;#39;m knocking it for, but it does amplify the awesome of the books. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Characters&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Man oh man are there a ton of POV&amp;#39;s and characters in these books! I think that Georges strength outside of his world building would absolutely be his character development. I feel like I have pages and pages of stuff I could say about how wonderful, believable, likable, hate-able his characters are, and how masterfully well done the arcs are for each character, and how sometimes he even plays arcs off of multiple characters (Looking at you Jaime and Brienne). &lt;/p&gt;\n\n&lt;p&gt;There are 14 main POV&amp;#39;s. Yes, that&amp;#39;s right. Add to that 10 more POV&amp;#39;s that are more like side characters (my personal favorite is Davos). Then there are prologue and epilogue characters that only show up once for each. &lt;/p&gt;\n\n&lt;p&gt;The major detraction I see people cite for huge casts of characters is that you don&amp;#39;t get to spend enough time with each one to get to know them, care about them, and invest in their story. Even with just the prologue and epilogue characters you get to know them in a single chapter. I find that remarkable. It takes unbelievable sense of &amp;quot;humanity&amp;quot; and characterization to pull that off and IMHO he does it exceedingly well. &lt;/p&gt;\n\n&lt;p&gt;There are just too many characters to talk about them all here in this blurb, but I&amp;#39;ll highlight one that I love, one that I have a love-hate relationship with, and one that I fucking despise. &lt;/p&gt;\n\n&lt;p&gt;LOVE LOVE LOVE ME SOME BARRISTON SELMY. Barriston the Bold, the most badass gray haired warrior I&amp;#39;ve read about, he reminds me a lot of Dalinar Kholin except he doesn&amp;#39;t really want to lead. He has an almost unwavering sense of honor that&amp;#39;s known throughout the world. He&amp;#39;s an older, more mature protagonist with a wealth of life experiences that&amp;#39;s so intriguing to read about since much of the cast is under 40. This guy was ousted by the brat Joffrey Baratheon from the White Knights (the royal guard) and cut his way through multiple guards sent to stop him when he was leaving the city. He treks halfway around the world to find someone to serve, because that&amp;#39;s his purpose in life in his eyes. To serve, to protect, to die for the rightful heir to the throne. We get to see deep regrets come to the surface, we get to see memories of things that have happened before most people were born in this series, and I love him to bits and pieces. &lt;/p&gt;\n\n&lt;p&gt;LOVE-HATE. Catelyn Stark. This is a character steeped in tragedy, bitterness, and woe. Before we get to really see her in action in her POV&amp;#39;s we get this &lt;em&gt;very&lt;/em&gt; brutal dialogue between her and another character, Jon Snow. We&amp;#39;ve already gotten to know and somewhat sympathize with Jon, so seeing her lash out for something he never could have prevented (existing) telling him she wished he had died was shocking and an interesting intro to a character. We see her give great advice, and we see her give terrible advice through her sons campaign against the Iron Throne. There are a few things she told her son that could have saved the war, but then she does something that almost certainly will lose the war for them as well. She goes through unspeakable loss through the books and even though she wasn&amp;#39;t the most likable character created, it&amp;#39;s hard not to feel for her through her losses. &lt;/p&gt;\n\n&lt;p&gt;HATE-HATE Fuck you, Cersei. This bitch is full of fire and impulsive and stupid behaviors. We get to see flash backs of her past, and she was a bitch then too. This isn&amp;#39;t a terrible spoiler - she kills a &amp;quot;friend&amp;quot; of hers in childhood by pushing her down a well and tortures her baby brother because she blames him (Tyrion) for her mothers death. She turns on people the moment they question her, family included. She berates her children when they don&amp;#39;t do what she wants them to do, and also spoils them retarded, defending even the most heinous of acts. I blame her for much of what Joffrey turns into - which is a pathological murderous bag of fuck sticks. &lt;/p&gt;\n\n&lt;p&gt;So, you could say that this book elicits strong emotions. I like that, even when I hate it. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Plot/Setting&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This has a very traditional medieval feel to it, and actually since Martin loves history much of this is historically accurate - as in the technology available, foods, agriculture techniques and all that jazz. &lt;/p&gt;\n\n&lt;p&gt;The plot is extensive. There&amp;#39;s a war for the throne and what&amp;#39;s cool is you get to see it from like 5 different perspectives. You literally see all sides of the war from people involved, to people looking in. There&amp;#39;s also a subplot for another character that&amp;#39;s taking place on an entirely different continent so you get to explore different cultures, magics, peoples and cities on top of the traditional medieval setting. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Pacing/tone&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Ok, so here&amp;#39;s where my opinion may vary from others, and really the more people I talk to about this series, the more opinions I get on this topic. &lt;/p&gt;\n\n&lt;p&gt;The pace is steady for books 1 and 2, fast for 3, and slows back down in books 4 and 5. My first reaction to reading book 4 and 5 when they were  first published was not overwhelmingly good - mainly because some of my favorite characters didn&amp;#39;t show up in book 4 at all, and I had been waiting on that for years, then it would be years before I saw Tyrion again. &lt;/p&gt;\n\n&lt;p&gt;The reason this happened was because book 4 got split into 2 different books that are actually happening within the same timeline. So, Chapter 1 of Book 4 is happening at roughly the same time as chapter 1 of book 5. This negative impact can be entirely ignored if you want to go to Boiled Leather which gives you a list of chapters that is roughly a straight through read in chronological order. You&amp;#39;d be reading both books 4 and 5 at the same time. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://boiledleather.com/post/25902554148/a-new-readerfriendly-combined-reading-order-for-a\"&gt;http://boiledleather.com/post/25902554148/a-new-readerfriendly-combined-reading-order-for-a&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;However, I also had a more negative reaction to books 4 and 5 at first because that was back in a time where I was really focused on plot, and I was coming off of reading book 3 which was packed full of action. My reading tastes changed, and now I actually look for more slow burn, intricate, complicated world building with character arcs and themes that flow from one book to the next. Upon re-reading and getting older/tastes changing books 4 and 5 are held in the same esteem as the first three, &lt;em&gt;for me in my opinion&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Writing Style&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Verbose and descriptive. If you get annoyed with a lot of food descriptions, setting descriptions and character descriptions this may not be for you. I used to get annoyed with a bit until I realized he was telling an under-story with much of it. What I mean by that is, with this series there&amp;#39;s a WEALTH of unspoken plot. For instance, you may be introduced to a character who remains unnamed in the first book, but whose description would be like &amp;quot;long greasy black curls, hooked nose, with a scar&amp;quot;. 4 books later that same character pops up again named and part of the plot. Back in book 1 that character IS significant, you just don&amp;#39;t know it yet. &lt;/p&gt;\n\n&lt;p&gt;The re-read value of this series is off the charts insane. I have re-read this at LEAST 2 dozen times per book and I still pick things up and have &amp;quot;AH HAH&amp;quot; moments. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Other Thoughts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t like books 4 and 5? that&amp;#39;s okay, I get it. &lt;/p&gt;\n\n&lt;p&gt;Not sure if we&amp;#39;re going to see a conclusion to this series? That&amp;#39;s fair, I get it. &lt;/p&gt;\n\n&lt;p&gt;Please, lets not have this turn into a shit show on Martins behalf though. Dude has pushed out some amazing literature and I really believe it deserves the 5 stars I&amp;#39;m giving it. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm riding the coat tails of another thread posted today about them doing a re-read for the first time in 6-7 years u/tkinsey3 and I figured since this review was already 80% done I'd tweak it and post it to ride the coattails of that review - I figure it might help bring the point home that these series are worth reading, and absolutely worth re-reading as well. \n\n**Intro**\n\n*\"I've already watched the series, is this really worth reading? It seems long....\"*\n\nI would argue for most people who love the show would also love the books, maybe even a little more especially if you're into the complexity and background plots. \n\nAfter season 3, there are major drifts away from the books with characters missing, huge plot changes, and a bunch of other stuff that *will* keep the novels fresh and exciting. By season 6 many plot lines are utterly unrecognizable from their book counter points. To be brief: Jaime never goes to Dorne, nor does Bronn and there's no \"bad pussy\", (and those sand snakes aren't cringey). Sansa is NOT being married to Ramsay Snow, and Brienne is in the riverlands looking for her, not at Winterfell. There's lots of stuff like that, so here's my spiel on why the first three are 5 star books.\n\nEven before the major changes to the plot and characters there's a level of depth that's missing, and I don't think the show could have done anything about it. You get inner dialogue and thoughts and memories from these characters that are almost completely gone from the show. It wouldn't make sense for it to be on the show so it's not something I'm knocking it for, but it does amplify the awesome of the books. \n\n\n**Characters**\n\nMan oh man are there a ton of POV's and characters in these books! I think that Georges strength outside of his world building would absolutely be his character development. I feel like I have pages and pages of stuff I could say about how wonderful, believable, likable, hate-able his characters are, and how masterfully well done the arcs are for each character, and how sometimes he even plays arcs off of multiple characters (Looking at you Jaime and Brienne). \n\nThere are 14 main POV's. Yes, that's right. Add to that 10 more POV's that are more like side characters (my personal favorite is Davos). Then there are prologue and epilogue characters that only show up once for each. \n\nThe major detraction I see people cite for huge casts of characters is that you don't get to spend enough time with each one to get to know them, care about them, and invest in their story. Even with just the prologue and epilogue characters you get to know them in a single chapter. I find that remarkable. It takes unbelievable sense of \"humanity\" and characterization to pull that off and IMHO he does it exceedingly well. \n\nThere are just too many characters to talk about them all here in this blurb, but I'll highlight one that I love, one that I have a love-hate relationship with, and one that I fucking despise. \n\nLOVE LOVE LOVE ME SOME BARRISTON SELMY. Barriston the Bold, the most badass gray haired warrior I've read about, he reminds me a lot of Dalinar Kholin except he doesn't really want to lead. He has an almost unwavering sense of honor that's known throughout the world. He's an older, more mature protagonist with a wealth of life experiences that's so intriguing to read about since much of the cast is under 40. This guy was ousted by the brat Joffrey Baratheon from the White Knights (the royal guard) and cut his way through multiple guards sent to stop him when he was leaving the city. He treks halfway around the world to find someone to serve, because that's his purpose in life in his eyes. To serve, to protect, to die for the rightful heir to the throne. We get to see deep regrets come to the surface, we get to see memories of things that have happened before most people were born in this series, and I love him to bits and pieces. \n\nLOVE-HATE. Catelyn Stark. This is a character steeped in tragedy, bitterness, and woe. Before we get to really see her in action in her POV's we get this *very* brutal dialogue between her and another character, Jon Snow. We've already gotten to know and somewhat sympathize with Jon, so seeing her lash out for something he never could have prevented (existing) telling him she wished he had died was shocking and an interesting intro to a character. We see her give great advice, and we see her give terrible advice through her sons campaign against the Iron Throne. There are a few things she told her son that could have saved the war, but then she does something that almost certainly will lose the war for them as well. She goes through unspeakable loss through the books and even though she wasn't the most likable character created, it's hard not to feel for her through her losses. \n\nHATE-HATE Fuck you, Cersei. This bitch is full of fire and impulsive and stupid behaviors. We get to see flash backs of her past, and she was a bitch then too. This isn't a terrible spoiler - she kills a \"friend\" of hers in childhood by pushing her down a well and tortures her baby brother because she blames him (Tyrion) for her mothers death. She turns on people the moment they question her, family included. She berates her children when they don't do what she wants them to do, and also spoils them retarded, defending even the most heinous of acts. I blame her for much of what Joffrey turns into - which is a pathological murderous bag of fuck sticks. \n\nSo, you could say that this book elicits strong emotions. I like that, even when I hate it. \n\n**Plot/Setting**\n\nThis has a very traditional medieval feel to it, and actually since Martin loves history much of this is historically accurate - as in the technology available, foods, agriculture techniques and all that jazz. \n\nThe plot is extensive. There's a war for the throne and what's cool is you get to see it from like 5 different perspectives. You literally see all sides of the war from people involved, to people looking in. There's also a subplot for another character that's taking place on an entirely different continent so you get to explore different cultures, magics, peoples and cities on top of the traditional medieval setting. \n\n**Pacing/tone**\n\nOk, so here's where my opinion may vary from others, and really the more people I talk to about this series, the more opinions I get on this topic. \n\nThe pace is steady for books 1 and 2, fast for 3, and slows back down in books 4 and 5. My first reaction to reading book 4 and 5 when they were  first published was not overwhelmingly good - mainly because some of my favorite characters didn't show up in book 4 at all, and I had been waiting on that for years, then it would be years before I saw Tyrion again. \n\nThe reason this happened was because book 4 got split into 2 different books that are actually happening within the same timeline. So, Chapter 1 of Book 4 is happening at roughly the same time as chapter 1 of book 5. This negative impact can be entirely ignored if you want to go to Boiled Leather which gives you a list of chapters that is roughly a straight through read in chronological order. You'd be reading both books 4 and 5 at the same time. \n\nhttp://boiledleather.com/post/25902554148/a-new-readerfriendly-combined-reading-order-for-a\n\nHowever, I also had a more negative reaction to books 4 and 5 at first because that was back in a time where I was really focused on plot, and I was coming off of reading book 3 which was packed full of action. My reading tastes changed, and now I actually look for more slow burn, intricate, complicated world building with character arcs and themes that flow from one book to the next. Upon re-reading and getting older/tastes changing books 4 and 5 are held in the same esteem as the first three, *for me in my opinion*. \n\n\n**Writing Style**\n\nVerbose and descriptive. If you get annoyed with a lot of food descriptions, setting descriptions and character descriptions this may not be for you. I used to get annoyed with a bit until I realized he was telling an under-story with much of it. What I mean by that is, with this series there's a WEALTH of unspoken plot. For instance, you may be introduced to a character who remains unnamed in the first book, but whose description would be like \"long greasy black curls, hooked nose, with a scar\". 4 books later that same character pops up again named and part of the plot. Back in book 1 that character IS significant, you just don't know it yet. \n\nThe re-read value of this series is off the charts insane. I have re-read this at LEAST 2 dozen times per book and I still pick things up and have \"AH HAH\" moments. \n\n**Other Thoughts**\n\nDon't like books 4 and 5? that's okay, I get it. \n\nNot sure if we're going to see a conclusion to this series? That's fair, I get it. \n\nPlease, lets not have this turn into a shit show on Martins behalf though. Dude has pushed out some amazing literature and I really believe it deserves the 5 stars I'm giving it. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Review", "id": "64r06d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 61, "report_reasons": null, "author": "Esmerelda-Weatherwax", "saved": false, "mod_reports": [], "name": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "approved_by": null, "over_18": false, "domain": "self.Fantasy", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/rQ0G_12D17AugwlkH1Z7RMPr-RBfzFGgr2OJJCGMdKw.jpg?s=9af1a1dd7e63e213bf020bc8a3055c9f", "width": 1200, "height": 628}, "resolutions": [{"url": "https://i.redditmedia.com/rQ0G_12D17AugwlkH1Z7RMPr-RBfzFGgr2OJJCGMdKw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=da57e0e4ea0d62ea73524079661ca2d9", "width": 108, "height": 56}, {"url": "https://i.redditmedia.com/rQ0G_12D17AugwlkH1Z7RMPr-RBfzFGgr2OJJCGMdKw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=015e8e9b13cd07440cab4dd141db61e9", "width": 216, "height": 113}, {"url": "https://i.redditmedia.com/rQ0G_12D17AugwlkH1Z7RMPr-RBfzFGgr2OJJCGMdKw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=a783385fcebffcc086a622c6a8a5bc9a", "width": 320, "height": 167}, {"url": "https://i.redditmedia.com/rQ0G_12D17AugwlkH1Z7RMPr-RBfzFGgr2OJJCGMdKw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=3f339ca4619ce9cb4a7f6e9b8a6c7a99", "width": 640, "height": 334}, {"url": "https://i.redditmedia.com/rQ0G_12D17AugwlkH1Z7RMPr-RBfzFGgr2OJJCGMdKw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=bb51cdfa892cbea28447b9cef1838756", "width": 960, "height": 502}, {"url": "https://i.redditmedia.com/rQ0G_12D17AugwlkH1Z7RMPr-RBfzFGgr2OJJCGMdKw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=b4252fe2e400dcff2a50dd170e1ef06f", "width": 1080, "height": 565}], "variants": {}, "id": "oDgqgoDZK1IYLn7WWQJmE08tiNtV454fqualNVETkEU"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qknd", "edited": 1491922226.0, "link_flair_css_class": "review", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Fantasy/comments/64r06d/grannys_5_star_series_review_asoiaf/", "num_reports": null, "locked": false, "stickied": false, "created": 1491948259.0, "url": "https://www.reddit.com/r/Fantasy/comments/64r06d/grannys_5_star_series_review_asoiaf/", "author_flair_text": "Reading Champion 2016", "quarantine": false, "title": "Grannys 5 Star Series Review - ASOIAF", "created_utc": 1491919459.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 98, "visited": false, "subreddit_type": "public", "ups": 61}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4mgyt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "javilla", "parent_id": "t1_dg4cwpj", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "This is repeated over and over now adays. Has happened to Harry Potter as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is repeated over and over now adays. Has happened to Harry Potter as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4mgyt", "score_hidden": false, "stickied": false, "created": 1491961709.0, "created_utc": 1491932909.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cwpj", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "specialagentmgscarn", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "There is a kind of hipster-like coolness to hating on ASOIAF. \"Oh, everyone else likes this? Look at me, look how badass I am for disliking it.\" I know that you can dislike these books legitimately, but I think there are a lot of people who dislike it for the cool factor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a kind of hipster-like coolness to hating on ASOIAF. &amp;quot;Oh, everyone else likes this? Look at me, look how badass I am for disliking it.&amp;quot; I know that you can dislike these books legitimately, but I think there are a lot of people who dislike it for the cool factor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4cwpj", "score_hidden": false, "stickied": false, "created": 1491951179.0, "created_utc": 1491922379.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4bccc", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "oooooo, I'm expecting some discontented people in this thread, I'm also expecting a much lower % with more downvotes. It's sort of like Rothfuss, there was a honeymoon phase, and now it's like everyone wants a divorce. *I'm still holding out hope man*. ", "edited": 1491926504.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oooooo, I&amp;#39;m expecting some discontented people in this thread, I&amp;#39;m also expecting a much lower % with more downvotes. It&amp;#39;s sort of like Rothfuss, there was a honeymoon phase, and now it&amp;#39;s like everyone wants a divorce. &lt;em&gt;I&amp;#39;m still holding out hope man&lt;/em&gt;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4bccc", "score_hidden": false, "stickied": false, "created": 1491949331.0, "created_utc": 1491920531.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg4njjs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4mvid", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Haha, better and better. Your wedding sounds like the most fun ever.\n\nI have been a gamer since I could hold a joystick. I took a day off work when Witcher 3 came out. I'm hopeless. \n\nPortal is one of my all time favorites! If you're into puzzle games of that nature, have you tried The Talos Principle? It goes on sale a lot and it's pretty great. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, better and better. Your wedding sounds like the most fun ever.&lt;/p&gt;\n\n&lt;p&gt;I have been a gamer since I could hold a joystick. I took a day off work when Witcher 3 came out. I&amp;#39;m hopeless. &lt;/p&gt;\n\n&lt;p&gt;Portal is one of my all time favorites! If you&amp;#39;re into puzzle games of that nature, have you tried The Talos Principle? It goes on sale a lot and it&amp;#39;s pretty great. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4njjs", "score_hidden": false, "stickied": false, "created": 1491962884.0, "created_utc": 1491934084.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mvid", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4lrkj", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Do you play video games at all? My wedding theme was nerd related things, and my wedding cake was the Companion cube which was vanilla, and chocolate mini cup cakes shaped like \"The Cake is a Lie\" cake. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you play video games at all? My wedding theme was nerd related things, and my wedding cake was the Companion cube which was vanilla, and chocolate mini cup cakes shaped like &amp;quot;The Cake is a Lie&amp;quot; cake. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4mvid", "score_hidden": false, "stickied": false, "created": 1491962151.0, "created_utc": 1491933351.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4lrkj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4loil", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I think we might be nerd sisters from another dimension or something. That's awesome. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think we might be nerd sisters from another dimension or something. That&amp;#39;s awesome. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4lrkj", "score_hidden": false, "stickied": false, "created": 1491960939.0, "created_utc": 1491932139.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4loil", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4ln7w", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "wanna really nerd out? the inner light song was used at my wedding. ", "edited": 1491933203.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wanna really nerd out? the inner light song was used at my wedding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4loil", "score_hidden": false, "stickied": false, "created": 1491960847.0, "created_utc": 1491932047.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ln7w", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4l91t", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I have a picture of Spock on the wall of my book nook. I tell everyone my favorite Trek movie is 2, but really it's 4. \n\nI cry at The Inner Light every single time.\n\nI have made Star Trek cross-stitch. \n\nI, too, am stoked. lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a picture of Spock on the wall of my book nook. I tell everyone my favorite Trek movie is 2, but really it&amp;#39;s 4. &lt;/p&gt;\n\n&lt;p&gt;I cry at The Inner Light every single time.&lt;/p&gt;\n\n&lt;p&gt;I have made Star Trek cross-stitch. &lt;/p&gt;\n\n&lt;p&gt;I, too, am stoked. lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4ln7w", "score_hidden": false, "stickied": false, "created": 1491960808.0, "created_utc": 1491932008.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4l91t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4kzy5", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I am a huge trek nerd. enormous trekkie. im so super stoked for a new series. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a huge trek nerd. enormous trekkie. im so super stoked for a new series. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4l91t", "score_hidden": false, "stickied": false, "created": 1491960383.0, "created_utc": 1491931583.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg6yr7s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AmethystOrator", "parent_id": "t1_dg6g6i6", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "For me, there are two different sorts of people here.  I completely agree with you on those who people who *can* let go, but don't.  Which sounds like who you've been dealing with.  If someone is able to make the conscious decision then they absolutely should.  \n\nBut then there are others, perhaps the especially sensitive, those who went through extremely tough situations and developed uncontrollable flashbacks, perhaps anxiety.  Or other types of situations that may well be unhealthy.  I feel like those people might not be so easily controlled and directed to a better path.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me, there are two different sorts of people here.  I completely agree with you on those who people who &lt;em&gt;can&lt;/em&gt; let go, but don&amp;#39;t.  Which sounds like who you&amp;#39;ve been dealing with.  If someone is able to make the conscious decision then they absolutely should.  &lt;/p&gt;\n\n&lt;p&gt;But then there are others, perhaps the especially sensitive, those who went through extremely tough situations and developed uncontrollable flashbacks, perhaps anxiety.  Or other types of situations that may well be unhealthy.  I feel like those people might not be so easily controlled and directed to a better path.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg6yr7s", "score_hidden": false, "stickied": false, "created": 1492077699.0, "created_utc": 1492048899.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6g6i6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg6eu03", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I can't imagine nursing that sort of anger against the wisps of memories of who a person was when they were 16. It's absurd, and unhealthy. I say this as someone who was bullied, too. \n\nCarrie Fisher said it very well. \"Resentment is like drinking poison and waiting for the other person to die.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t imagine nursing that sort of anger against the wisps of memories of who a person was when they were 16. It&amp;#39;s absurd, and unhealthy. I say this as someone who was bullied, too. &lt;/p&gt;\n\n&lt;p&gt;Carrie Fisher said it very well. &amp;quot;Resentment is like drinking poison and waiting for the other person to die.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg6g6i6", "score_hidden": false, "stickied": false, "created": 1492055691.0, "created_utc": 1492026891.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6eu03", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AmethystOrator", "parent_id": "t1_dg5tzf6", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Thanks.  And yeah, that mindset seems ridiculous.  Even if they knew for a fact that a former bully is enjoying something, then so what?  *Lots* of people enjoy almost everything.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks.  And yeah, that mindset seems ridiculous.  Even if they knew for a fact that a former bully is enjoying something, then so what?  &lt;em&gt;Lots&lt;/em&gt; of people enjoy almost everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg6eu03", "score_hidden": false, "stickied": false, "created": 1492054322.0, "created_utc": 1492025522.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tzf6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg59ea5", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Ok that's a legit complaint. I don't read Trek lit but I totally understand that must be frustrating for fans.\n\nThe people I encountered were seriously whining because the new Trek movies had a broad appeal and \"might be enjoyed by the kind of people who bullied me in high school\", which was just like, *dude.* You're 40 years old. *Move on*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok that&amp;#39;s a legit complaint. I don&amp;#39;t read Trek lit but I totally understand that must be frustrating for fans.&lt;/p&gt;\n\n&lt;p&gt;The people I encountered were seriously whining because the new Trek movies had a broad appeal and &amp;quot;might be enjoyed by the kind of people who bullied me in high school&amp;quot;, which was just like, &lt;em&gt;dude.&lt;/em&gt; You&amp;#39;re 40 years old. &lt;em&gt;Move on&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5tzf6", "score_hidden": false, "stickied": false, "created": 1492031370.0, "created_utc": 1492002570.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59ea5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AmethystOrator", "parent_id": "t1_dg4kzy5", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I would agree *except* that there was some sort of legal clause in the contract with Abrams that has resulted in huge problems for most of the ongoing Trek lit.  I'm uncertain of all the details, but my understanding is that all of the novels set just before Romulus blows have been in some form of a holding pattern where they're legally uncertain if they're allowed to catch up to the same time as that movie.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would agree &lt;em&gt;except&lt;/em&gt; that there was some sort of legal clause in the contract with Abrams that has resulted in huge problems for most of the ongoing Trek lit.  I&amp;#39;m uncertain of all the details, but my understanding is that all of the novels set just before Romulus blows have been in some form of a holding pattern where they&amp;#39;re legally uncertain if they&amp;#39;re allowed to catch up to the same time as that movie.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg59ea5", "score_hidden": false, "stickied": false, "created": 1491989190.0, "created_utc": 1491960390.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kzy5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4kjnc", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I agree completely! I just think the complaining is awfully short sighted - the movies were such a success that now we get a new Trek TV show, a format in which they can easily explore the deeper themes and philosophical questions that old school Trek fans crave. \n\n&gt; you and I.... we agree on shit a lot. \n\nI have always thought so! Half the time I go to post in a thread and I'm like, \"Oh, Esme said it already. Cool.\" :D", "edited": 1491931517.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree completely! I just think the complaining is awfully short sighted - the movies were such a success that now we get a new Trek TV show, a format in which they can easily explore the deeper themes and philosophical questions that old school Trek fans crave. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you and I.... we agree on shit a lot. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have always thought so! Half the time I go to post in a thread and I&amp;#39;m like, &amp;quot;Oh, Esme said it already. Cool.&amp;quot; :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4kzy5", "score_hidden": false, "stickied": false, "created": 1491960106.0, "created_utc": 1491931306.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kjnc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4kf0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "The new Trek does have a different feel to it, but it doesn't deserve all the shit it's getting either. The movies in Trek have always been more action-adventure than the show counterparts where it slowed down and did character stuff and some philosophical stuff like Measure of a Man, and that was true for TOS and Next Gen. \n\nyou and I.... we agree on shit a lot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The new Trek does have a different feel to it, but it doesn&amp;#39;t deserve all the shit it&amp;#39;s getting either. The movies in Trek have always been more action-adventure than the show counterparts where it slowed down and did character stuff and some philosophical stuff like Measure of a Man, and that was true for TOS and Next Gen. &lt;/p&gt;\n\n&lt;p&gt;you and I.... we agree on shit a lot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4kjnc", "score_hidden": false, "stickied": false, "created": 1491959606.0, "created_utc": 1491930806.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4rtou", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4rno0", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Or even when they don't *shit* on it, they're just weirdly proud of not having read it. Literally you're proud of having done nothing at all. WTF.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or even when they don&amp;#39;t &lt;em&gt;shit&lt;/em&gt; on it, they&amp;#39;re just weirdly proud of not having read it. Literally you&amp;#39;re proud of having done nothing at all. WTF.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4rtou", "score_hidden": false, "stickied": false, "created": 1491967495.0, "created_utc": 1491938695.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rno0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cantforgivethedog", "parent_id": "t1_dg4kf0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I've seen this too, \"Have you read them?\" \"NO, Why would I?\"\n\n......... so you haven't read them, but you want to shit on them. Make sense! :D ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen this too, &amp;quot;Have you read them?&amp;quot; &amp;quot;NO, Why would I?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;......... so you haven&amp;#39;t read them, but you want to shit on them. Make sense! :D &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4rno0", "score_hidden": false, "stickied": false, "created": 1491967314.0, "created_utc": 1491938514.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg5gsbx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "palaeologos", "parent_id": "t1_dg4kf0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Seems to me a person who plays MMOs and disparages a popular fantasy series is in the position of a person who hates REM and loudly champions Blink 182.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seems to me a person who plays MMOs and disparages a popular fantasy series is in the position of a person who hates REM and loudly champions Blink 182.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5gsbx", "score_hidden": false, "stickied": false, "created": 1491999898.0, "created_utc": 1491971098.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kf0y", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I have spotted a few of my former MMO guildmate pals who are super into Fantasy posting image macros about not liking ASoIaF, proudly never having read the books or watched the show. Being weirdly hipster-ish about it. Like, you're going to base your identity around not liking a thing? Well, ok then.\n\nI found it baffling, but these are people who cry about the new Star Trek movies because \"Pull up the ladder, the Chads have found our treehouse :(\" so I think there's a bit of maladjusted nerd discontent going on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have spotted a few of my former MMO guildmate pals who are super into Fantasy posting image macros about not liking ASoIaF, proudly never having read the books or watched the show. Being weirdly hipster-ish about it. Like, you&amp;#39;re going to base your identity around not liking a thing? Well, ok then.&lt;/p&gt;\n\n&lt;p&gt;I found it baffling, but these are people who cry about the new Star Trek movies because &amp;quot;Pull up the ladder, the Chads have found our treehouse :(&amp;quot; so I think there&amp;#39;s a bit of maladjusted nerd discontent going on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4kf0y", "score_hidden": false, "stickied": false, "created": 1491959465.0, "created_utc": 1491930665.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4jyr6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "virgineyes09", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Yeaaaah people really get a kick out of loudly declaring their dislike for ASOIAF. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeaaaah people really get a kick out of loudly declaring their dislike for ASOIAF. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4jyr6", "score_hidden": false, "stickied": false, "created": 1491958967.0, "created_utc": 1491930167.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4tg3g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PointXIV", "parent_id": "t1_dg4qchk", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Definitely. And it's a little juvenile that it bothers me at all. I just wish they would *try* other books, even if they still think ASOIAF is their favorite.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely. And it&amp;#39;s a little juvenile that it bothers me at all. I just wish they would &lt;em&gt;try&lt;/em&gt; other books, even if they still think ASOIAF is their favorite.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4tg3g", "score_hidden": false, "stickied": false, "created": 1491969244.0, "created_utc": 1491940444.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qchk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4m73o", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; have never read another fantasy series declaring it the best fantasy series ever\n\nThis happens a lot with people who read a fantastic book as their first book within a genre. I used to argue that Harry Potter was the best thing ever, then Pratchett. Now it's like, there is *no such thing* as the best thing ever, but I get why they get excited. I honestly think it's a good thing, several of my friends dabbled in fantasy books after getting hooked on that show. It didn't last, but it was nice to talk to them about the few books they did pick up as a consequence of GoT/ASOIAF\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;have never read another fantasy series declaring it the best fantasy series ever&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This happens a lot with people who read a fantastic book as their first book within a genre. I used to argue that Harry Potter was the best thing ever, then Pratchett. Now it&amp;#39;s like, there is &lt;em&gt;no such thing&lt;/em&gt; as the best thing ever, but I get why they get excited. I honestly think it&amp;#39;s a good thing, several of my friends dabbled in fantasy books after getting hooked on that show. It didn&amp;#39;t last, but it was nice to talk to them about the few books they did pick up as a consequence of GoT/ASOIAF&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4qchk", "score_hidden": false, "stickied": false, "created": 1491965922.0, "created_utc": 1491937122.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4m73o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PointXIV", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I fall into that a bit, but it's a by-product of my friends who have never read another fantasy series declaring it the best fantasy series ever. I think a lot of elitism that comes with disliking ASOIAF stems from interactions like that. \n\nGranted, I have read through the first three books, so maybe I'm an outlier.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fall into that a bit, but it&amp;#39;s a by-product of my friends who have never read another fantasy series declaring it the best fantasy series ever. I think a lot of elitism that comes with disliking ASOIAF stems from interactions like that. &lt;/p&gt;\n\n&lt;p&gt;Granted, I have read through the first three books, so maybe I&amp;#39;m an outlier.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4m73o", "score_hidden": false, "stickied": false, "created": 1491961408.0, "created_utc": 1491932608.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4rlsk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cantforgivethedog", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "here here! I haven't read this series yet, but I'm thinking that I'm going to. I wanted something complex coming off of Malazan. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;here here! I haven&amp;#39;t read this series yet, but I&amp;#39;m thinking that I&amp;#39;m going to. I wanted something complex coming off of Malazan. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4rlsk", "score_hidden": false, "stickied": false, "created": 1491967258.0, "created_utc": 1491938458.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4rstk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZuFFuLuZ", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I think it's because the first books were great and then got progressively worse. I loved the series at first, but stopped a few hundred pages into book 4. It was just a bunch of new places and characters and so on, but it wasn't going anywhere and there was no end in sight. It felt to me like he has this great plan for this series, but doesn't know how to wrap it all up and get to the end. That's probably also why the next one is taking so long.  \nSo I decided that my time was better spent reading other books and watching the TV show. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s because the first books were great and then got progressively worse. I loved the series at first, but stopped a few hundred pages into book 4. It was just a bunch of new places and characters and so on, but it wasn&amp;#39;t going anywhere and there was no end in sight. It felt to me like he has this great plan for this series, but doesn&amp;#39;t know how to wrap it all up and get to the end. That&amp;#39;s probably also why the next one is taking so long.&lt;br/&gt;\nSo I decided that my time was better spent reading other books and watching the TV show. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4rstk", "score_hidden": false, "stickied": false, "created": 1491967469.0, "created_utc": 1491938669.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4eemr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "North_South_Side", "parent_id": "t1_dg4b97s", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Meh, I loved the first 3, 4-5 were slow and boring, 5 was better. But overall there's just so much padding. I still like the series, but it took a hit hard by getting so stretched out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Meh, I loved the first 3, 4-5 were slow and boring, 5 was better. But overall there&amp;#39;s just so much padding. I still like the series, but it took a hit hard by getting so stretched out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4eemr", "score_hidden": false, "stickied": false, "created": 1491952875.0, "created_utc": 1491924075.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4b97s", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "kaldtdyrr", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "That was a well-thought-out review and I agree with you on most counts. By the way, is it just me, or is it now 'cool' to ostentatiously dislike *ASOIAF*? It sure seems like it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was a well-thought-out review and I agree with you on most counts. By the way, is it just me, or is it now &amp;#39;cool&amp;#39; to ostentatiously dislike &lt;em&gt;ASOIAF&lt;/em&gt;? It sure seems like it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4b97s", "score_hidden": false, "stickied": false, "created": 1491949223.0, "created_utc": 1491920423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4cpet", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4cmj8", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I was thoroughly enjoying myself not having a clue I was missing out on subtext stuff. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was thoroughly enjoying myself not having a clue I was missing out on subtext stuff. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4cpet", "score_hidden": false, "stickied": false, "created": 1491950947.0, "created_utc": 1491922147.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cmj8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "CoffeeArchives", "parent_id": "t1_dg4cgth", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I still feel like most of it goes over my head (minus the things I can pick up on with my knowledge from the show). I don't think you need any of that extra stuff to fully enjoy the series, they are excellent books for \"casual\" readers, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I still feel like most of it goes over my head (minus the things I can pick up on with my knowledge from the show). I don&amp;#39;t think you need any of that extra stuff to fully enjoy the series, they are excellent books for &amp;quot;casual&amp;quot; readers, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4cmj8", "score_hidden": false, "stickied": false, "created": 1491950856.0, "created_utc": 1491922056.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cgth", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4brpz", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; People can and do write essay after essay analyzing passages from ASOIAF. When two characters talk to each other, there's the surface level meaning, the word choice that reflects their upbringing, and nuanced subtext that hints at hidden motivations.\n\nI was pretty young when I first started on this series, my older cousin gave them to me (mom couldn't figure out where I learned the word cunt - she blamed HBO - I kept my books!). All of this hidden context and hidden meaning with background shit going on that's not outright explained went WOOSH right over my head. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;People can and do write essay after essay analyzing passages from ASOIAF. When two characters talk to each other, there&amp;#39;s the surface level meaning, the word choice that reflects their upbringing, and nuanced subtext that hints at hidden motivations.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I was pretty young when I first started on this series, my older cousin gave them to me (mom couldn&amp;#39;t figure out where I learned the word cunt - she blamed HBO - I kept my books!). All of this hidden context and hidden meaning with background shit going on that&amp;#39;s not outright explained went WOOSH right over my head. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4cgth", "score_hidden": false, "stickied": false, "created": 1491950671.0, "created_utc": 1491921871.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4brpz", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "CoffeeArchives", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I started reading the series after season 4 of Game of Thrones and was worried that I'd have to power through the first few books to catch up and get to the new and \"good stuff\" I was craving. Holy crap, I was blown away by the quality of the books.\n\nLike Esme said, there's whole story arcs that aren't in the show, and some of them are *great*. You get inside your favorite characters' heads, learn the history of the world, and get a bunch of fun little things like in-world song lyrics. \n\nAlso, there's a reason why these books take so long to write. Leaving aside the question of sheer massiveness, everything is crafted with care. People can and do write essay after essay analyzing passages from ASOIAF. When two characters talk to each other, there's the surface level meaning, the word choice that reflects their upbringing, and nuanced subtext that hints at hidden motivations. Seriously, these books are fantastically impressive in multiple ways.\n\nI loved reading the series, even with having seen the show first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started reading the series after season 4 of Game of Thrones and was worried that I&amp;#39;d have to power through the first few books to catch up and get to the new and &amp;quot;good stuff&amp;quot; I was craving. Holy crap, I was blown away by the quality of the books.&lt;/p&gt;\n\n&lt;p&gt;Like Esme said, there&amp;#39;s whole story arcs that aren&amp;#39;t in the show, and some of them are &lt;em&gt;great&lt;/em&gt;. You get inside your favorite characters&amp;#39; heads, learn the history of the world, and get a bunch of fun little things like in-world song lyrics. &lt;/p&gt;\n\n&lt;p&gt;Also, there&amp;#39;s a reason why these books take so long to write. Leaving aside the question of sheer massiveness, everything is crafted with care. People can and do write essay after essay analyzing passages from ASOIAF. When two characters talk to each other, there&amp;#39;s the surface level meaning, the word choice that reflects their upbringing, and nuanced subtext that hints at hidden motivations. Seriously, these books are fantastically impressive in multiple ways.&lt;/p&gt;\n\n&lt;p&gt;I loved reading the series, even with having seen the show first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4brpz", "score_hidden": false, "stickied": false, "created": 1491949848.0, "created_utc": 1491921048.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4k26f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4jolg", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt;In short, he's a little nutty. \n\nThis is pretty much why I stopped reading theories. Once we exhausted the text to the point where we reached Bolt-On theory and people were taking it seriously I was like, \"Hmm. Ok, I'm good.\"\n\n&gt;these people are devoted to the text, and what George has said to expect from his series, and what not to expect. Not a whole lot of foil going on. Foil is fun when it's not taken seriously.\n\nThis sounds fabulous. Thanks for the recommendation! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In short, he&amp;#39;s a little nutty. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is pretty much why I stopped reading theories. Once we exhausted the text to the point where we reached Bolt-On theory and people were taking it seriously I was like, &amp;quot;Hmm. Ok, I&amp;#39;m good.&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;these people are devoted to the text, and what George has said to expect from his series, and what not to expect. Not a whole lot of foil going on. Foil is fun when it&amp;#39;s not taken seriously.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This sounds fabulous. Thanks for the recommendation! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4k26f", "score_hidden": false, "stickied": false, "created": 1491959073.0, "created_utc": 1491930273.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jolg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4jhll", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Preston Jacobs is a youtuber who does a lot of more tin foil theories. So, he utterly rejects R + L = J, and says all the references to blue flowers is *coincidence* and that you can't trust prophecy. In short, he's a little nutty. He did a whole thing on a \"Dragon Riding X Gene\" where he tried to go through and track all of the dragon riders from the past and see if there was something hereditary there... despite George saying this isn't sci fi and sometimes he has trouble with keeping eye color straight. \n\nThat kind of thing. The people who love him are fervently behind him and don't really listen to counter points even when it includes text and GRRM quotations about his own series...\n\n&gt; LOL if only you could have seen my eyes light up at that sentence.\n\n:D :D Yay! New podcast for you! I actually need to go back and see what they've posted, I haven't been back in months. \n\nUnlike Preston Jacobs, these people are devoted to the text, and what George has said to expect from his series, and what not to expect. Not a whole lot of foil going on. Foil is fun when it's not taken seriously.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Preston Jacobs is a youtuber who does a lot of more tin foil theories. So, he utterly rejects R + L = J, and says all the references to blue flowers is &lt;em&gt;coincidence&lt;/em&gt; and that you can&amp;#39;t trust prophecy. In short, he&amp;#39;s a little nutty. He did a whole thing on a &amp;quot;Dragon Riding X Gene&amp;quot; where he tried to go through and track all of the dragon riders from the past and see if there was something hereditary there... despite George saying this isn&amp;#39;t sci fi and sometimes he has trouble with keeping eye color straight. &lt;/p&gt;\n\n&lt;p&gt;That kind of thing. The people who love him are fervently behind him and don&amp;#39;t really listen to counter points even when it includes text and GRRM quotations about his own series...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;LOL if only you could have seen my eyes light up at that sentence.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;:D :D Yay! New podcast for you! I actually need to go back and see what they&amp;#39;ve posted, I haven&amp;#39;t been back in months. &lt;/p&gt;\n\n&lt;p&gt;Unlike Preston Jacobs, these people are devoted to the text, and what George has said to expect from his series, and what not to expect. Not a whole lot of foil going on. Foil is fun when it&amp;#39;s not taken seriously.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4jolg", "score_hidden": false, "stickied": false, "created": 1491958662.0, "created_utc": 1491929862.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4kk55", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4k75a", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "LOL shit talk away, it's pretty funny. :)\n\nI see the tinfoil as an unfortunate side effect of any series with a long wait between the entries. People exhaust the text and then keep digging - when you dig so long and so hard you're going to start coming up with some wacky shit eventually.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LOL shit talk away, it&amp;#39;s pretty funny. :)&lt;/p&gt;\n\n&lt;p&gt;I see the tinfoil as an unfortunate side effect of any series with a long wait between the entries. People exhaust the text and then keep digging - when you dig so long and so hard you&amp;#39;re going to start coming up with some wacky shit eventually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4kk55", "score_hidden": false, "stickied": false, "created": 1491959621.0, "created_utc": 1491930821.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4k75a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4jhll", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Also, I guess it's not fair to shit talk Preston Jacobs that badly, he has some not-tinfoil stuff too\n\nHe has a great \"What you're missing\" series that explains episode by episode changes and things that are left out from the series. \n\nhttps://www.youtube.com/watch?v=qWU5zs9BsEI\n\nThis is how he gained popularity. \n\nIt all just kind of went downhill when he started with his Dragon Riding X Gene sorts of shanannigans, and the theories got wilder and wilder\n\nhttps://www.youtube.com/watch?v=4aoFCZGr3LY \n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, I guess it&amp;#39;s not fair to shit talk Preston Jacobs that badly, he has some not-tinfoil stuff too&lt;/p&gt;\n\n&lt;p&gt;He has a great &amp;quot;What you&amp;#39;re missing&amp;quot; series that explains episode by episode changes and things that are left out from the series. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=qWU5zs9BsEI\"&gt;https://www.youtube.com/watch?v=qWU5zs9BsEI&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is how he gained popularity. &lt;/p&gt;\n\n&lt;p&gt;It all just kind of went downhill when he started with his Dragon Riding X Gene sorts of shanannigans, and the theories got wilder and wilder&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=4aoFCZGr3LY\"&gt;https://www.youtube.com/watch?v=4aoFCZGr3LY&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4k75a", "score_hidden": false, "stickied": false, "created": 1491959226.0, "created_utc": 1491930426.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jhll", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4iz9f", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; I have gotten into so many inane debates before I learned my lesson over on r/asoiaf. People who love Preston Jacobs are hard to debate with..... \n\nI'm not familiar with him, are we talking RB is a vampire type shit? I haven't been reading theories for a little while now. I always liked bryndenbfish a lot when I did, his ideas about the Stannis battleplan and the GNC were super compelling.\n\n&gt;I do too, with most of the stuff they changed from book to show. There are some things that I really did not like at all but, meh. It is what it is.\n\nI'm in the same boat. I think they have gone off the rails on a lot of things but there's a part of me that is pleased that there will be *an* ending of sorts. And the show is still good fun even if it makes me roll my eyes a fair bit.\n\n&gt;My main bone to pick with D &amp; D is giving the readers spoilers for no reason, not for what they did in the show. \"Oh, well, we got the idea from George he's doing it in the books\". WTFWTFWTF\n\nOMG somehow I avoided knowing that. That's awful.\n\n&gt;LONG ass pod casts though, like 2 hours for some of them. \n\nLOL if only you could have seen my eyes light up at that sentence. :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have gotten into so many inane debates before I learned my lesson over on &lt;a href=\"/r/asoiaf\"&gt;r/asoiaf&lt;/a&gt;. People who love Preston Jacobs are hard to debate with..... &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not familiar with him, are we talking RB is a vampire type shit? I haven&amp;#39;t been reading theories for a little while now. I always liked bryndenbfish a lot when I did, his ideas about the Stannis battleplan and the GNC were super compelling.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I do too, with most of the stuff they changed from book to show. There are some things that I really did not like at all but, meh. It is what it is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m in the same boat. I think they have gone off the rails on a lot of things but there&amp;#39;s a part of me that is pleased that there will be &lt;em&gt;an&lt;/em&gt; ending of sorts. And the show is still good fun even if it makes me roll my eyes a fair bit.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My main bone to pick with D &amp;amp; D is giving the readers spoilers for no reason, not for what they did in the show. &amp;quot;Oh, well, we got the idea from George he&amp;#39;s doing it in the books&amp;quot;. WTFWTFWTF&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;OMG somehow I avoided knowing that. That&amp;#39;s awful.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;LONG ass pod casts though, like 2 hours for some of them. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;LOL if only you could have seen my eyes light up at that sentence. :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4jhll", "score_hidden": false, "stickied": false, "created": 1491958452.0, "created_utc": 1491929652.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4o95k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4nnsz", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "debating theories can be so much fun as long as it stays calm and upbeat. the minute people take it personally you think something different is when it goes down the tubes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;debating theories can be so much fun as long as it stays calm and upbeat. the minute people take it personally you think something different is when it goes down the tubes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4o95k", "score_hidden": false, "stickied": false, "created": 1491963676.0, "created_utc": 1491934876.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4nnsz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JiveMurloc", "parent_id": "t1_dg4mznr", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Yeah, I get that. If I was inclined to argue theories I would probably feel the same way. But I try not to debate on the internet, it's like herding cats. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I get that. If I was inclined to argue theories I would probably feel the same way. But I try not to debate on the internet, it&amp;#39;s like herding cats. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4nnsz", "score_hidden": false, "stickied": false, "created": 1491963018.0, "created_utc": 1491934218.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mznr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4ln1q", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Ohhh, I love Bolt-On and Time Traveling Fetus, when it's all in good fun it's hilarious. It's when you start getting your panties in a bunch and calling me things like \"pretencious bitch\" because I don't agree with your tin foil theories it's a problem. That sub has a LOT more modding involved in it, it's also partly why I left. Part because I felt like I exhausted myself on it, and part because people can take themselves WAY too seriously.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ohhh, I love Bolt-On and Time Traveling Fetus, when it&amp;#39;s all in good fun it&amp;#39;s hilarious. It&amp;#39;s when you start getting your panties in a bunch and calling me things like &amp;quot;pretencious bitch&amp;quot; because I don&amp;#39;t agree with your tin foil theories it&amp;#39;s a problem. That sub has a LOT more modding involved in it, it&amp;#39;s also partly why I left. Part because I felt like I exhausted myself on it, and part because people can take themselves WAY too seriously.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4mznr", "score_hidden": false, "stickied": false, "created": 1491962279.0, "created_utc": 1491933479.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ln1q", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "JiveMurloc", "parent_id": "t1_dg4iz9f", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "r/asoiaf is my other favorite subreddit. For the cool, plausible and well thought out theories. But also for the insane batshit crazy ones like Bolt-On and Time Traveling Fetus. I don't read it on a regular basis and I almost never comment (except in live show threads) but when I do pop in, there's always something interesting to read. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/asoiaf\"&gt;r/asoiaf&lt;/a&gt; is my other favorite subreddit. For the cool, plausible and well thought out theories. But also for the insane batshit crazy ones like Bolt-On and Time Traveling Fetus. I don&amp;#39;t read it on a regular basis and I almost never comment (except in live show threads) but when I do pop in, there&amp;#39;s always something interesting to read. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4ln1q", "score_hidden": false, "stickied": false, "created": 1491960803.0, "created_utc": 1491932003.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iz9f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4its3", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; This, the obvious R+L\n\nI have gotten into so many inane debates before I learned my lesson over on r/asoiaf. People who love Preston Jacobs are hard to debate with..... (he thinks it's Ashara Dayne + Brandon = J) Despite the fact Brandon was dead before the date of conception. \n\n&gt;  sadly the show felt this was necessary for a TV audience, but I understand their choice.\n\nI do too, with *most* of the stuff they changed from book to show. There are some things that I really did *not* like at all but, meh. It is what it is. My main bone to pick with D &amp; D is giving the readers spoilers for no reason, not for what they did in the show. \"Oh, well, we got the idea from George he's doing it in the books\". WTFWTFWTF\n\nhttp://radiowesteros.com/\n\nThese guys softened me to Catelyn *and* Sansa, two characters which during my first reads would have to hate-read through. \n\nIt's not just theories, it's character analysis, theme analysis and all that good stuff. LONG ass pod casts though, like 2 hours for some of them. \n", "edited": 1491929379.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This, the obvious R+L&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have gotten into so many inane debates before I learned my lesson over on &lt;a href=\"/r/asoiaf\"&gt;r/asoiaf&lt;/a&gt;. People who love Preston Jacobs are hard to debate with..... (he thinks it&amp;#39;s Ashara Dayne + Brandon = J) Despite the fact Brandon was dead before the date of conception. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;sadly the show felt this was necessary for a TV audience, but I understand their choice.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I do too, with &lt;em&gt;most&lt;/em&gt; of the stuff they changed from book to show. There are some things that I really did &lt;em&gt;not&lt;/em&gt; like at all but, meh. It is what it is. My main bone to pick with D &amp;amp; D is giving the readers spoilers for no reason, not for what they did in the show. &amp;quot;Oh, well, we got the idea from George he&amp;#39;s doing it in the books&amp;quot;. WTFWTFWTF&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://radiowesteros.com/\"&gt;http://radiowesteros.com/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;These guys softened me to Catelyn &lt;em&gt;and&lt;/em&gt; Sansa, two characters which during my first reads would have to hate-read through. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not just theories, it&amp;#39;s character analysis, theme analysis and all that good stuff. LONG ass pod casts though, like 2 hours for some of them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4iz9f", "score_hidden": false, "stickied": false, "created": 1491957906.0, "created_utc": 1491929106.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4its3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BookWol", "parent_id": "t1_dg4i4yj", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "No naysaying here, for me you're pretty spot-on. \n\n&gt;I didn't catch this on my own, I'll admit r/asoiaf blew my fucking mind with this one. \n\nThis, the obvious R+L and \"whodunit\" at the PW were a few of the ones I picked up on, my husband was like \"WTF?!\" when I casually mentioned \"whodunit\" one day. He genuinely thought it was Tyrion. There were tons of other ones I missed, though, that I started to discover after seeing the online theories. Like you I have been reading them for well over a decade so I caught things on rereading that I definitely didn't the first couple of times.\n\nIt's crazy impressive how he weaves the under-stories in so intricately, and as a reader I am always *very* pleased when an author respects us enough not to beat us over the head with clues, or to point at it later and say \"look what I did!\" because the temptation must be huge - sadly the show felt this was necessary for a TV audience, but I understand their choice.\n\nI haven't listened to Radio Westeros! I'll definitely check that out, I really love all the theories, even the total tinfoil ones make me laugh. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No naysaying here, for me you&amp;#39;re pretty spot-on. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I didn&amp;#39;t catch this on my own, I&amp;#39;ll admit &lt;a href=\"/r/asoiaf\"&gt;r/asoiaf&lt;/a&gt; blew my fucking mind with this one. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This, the obvious R+L and &amp;quot;whodunit&amp;quot; at the PW were a few of the ones I picked up on, my husband was like &amp;quot;WTF?!&amp;quot; when I casually mentioned &amp;quot;whodunit&amp;quot; one day. He genuinely thought it was Tyrion. There were tons of other ones I missed, though, that I started to discover after seeing the online theories. Like you I have been reading them for well over a decade so I caught things on rereading that I definitely didn&amp;#39;t the first couple of times.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s crazy impressive how he weaves the under-stories in so intricately, and as a reader I am always &lt;em&gt;very&lt;/em&gt; pleased when an author respects us enough not to beat us over the head with clues, or to point at it later and say &amp;quot;look what I did!&amp;quot; because the temptation must be huge - sadly the show felt this was necessary for a TV audience, but I understand their choice.&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t listened to Radio Westeros! I&amp;#39;ll definitely check that out, I really love all the theories, even the total tinfoil ones make me laugh. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4its3", "score_hidden": false, "stickied": false, "created": 1491957741.0, "created_utc": 1491928941.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4i4yj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4hz9e", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Thanks! Appreciate it! I figured I'd get a lot of naysayers to this. \n\n&gt; Gosh, Wyman Manderly sure is enjoying those three pies isn't he? Interesting that he insisted on having a slice of each one. I wonder why that is.\n\nI didn't catch this on my own, I'll admit r/asoiaf blew my fucking mind with this one. \n\nHave you listened to the podcast Radio Westeros? They do a break down of all these different theories - my favorite is the one on prophecies. It breaks down all the creepy as shit the Ghost of Highheart is saying and she's proven to be a reliable prophet/seer of sorts. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! Appreciate it! I figured I&amp;#39;d get a lot of naysayers to this. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gosh, Wyman Manderly sure is enjoying those three pies isn&amp;#39;t he? Interesting that he insisted on having a slice of each one. I wonder why that is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I didn&amp;#39;t catch this on my own, I&amp;#39;ll admit &lt;a href=\"/r/asoiaf\"&gt;r/asoiaf&lt;/a&gt; blew my fucking mind with this one. &lt;/p&gt;\n\n&lt;p&gt;Have you listened to the podcast Radio Westeros? They do a break down of all these different theories - my favorite is the one on prophecies. It breaks down all the creepy as shit the Ghost of Highheart is saying and she&amp;#39;s proven to be a reliable prophet/seer of sorts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4i4yj", "score_hidden": false, "stickied": false, "created": 1491956974.0, "created_utc": 1491928174.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hz9e", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "BookWol", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Fabulous write up, very much in line with my own feelings on the series, even down to the immediate dislike/disappointment with books 4/5 (partly through having waited for them in my case, I expect) and their massive improvement upon rereading. \n\n&gt;I used to get annoyed with a bit until I realized he was telling an under-story with much of it. What I mean by that is, with this series there's a WEALTH of unspoken plot. For instance, you may be introduced to a character who remains unnamed in the first book, but whose description would be like \"long greasy black curls, hooked nose, with a scar\". 4 books later that same character pops up again named and part of the plot. Back in book 1 that character IS significant, you just don't know it yet. \n\nThis is something I'd like to expand on - you touch on the under-story connecting unnamed characters and making them important later, but the thing that I find really enchanting about ASoIaF is the *secret* under-stories. The ones he hides inside the plot and only ever hints at that you will only notice if you are seriously paying attention. \n\nGosh, Wyman Manderly sure is enjoying those three pies isn't he? Interesting that he insisted on having a slice of each one. I wonder why that is. I could assume it's because he's described as a bit of a gluttonous bastard, but I'd be wrong. \n\nIn order for me to know the real reason, I must have:\n\n* Paid attention to the history between the Manderlys and the Freys\n* Paid attention to the rules of guest right\n* Paid attention to the story of the Rat Cook\n* Paid attention when someone went missing\n* Pieced it all together without any direct dialogue or narrative stating what actually happened\n\nThis is where Martin really shines for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fabulous write up, very much in line with my own feelings on the series, even down to the immediate dislike/disappointment with books 4/5 (partly through having waited for them in my case, I expect) and their massive improvement upon rereading. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I used to get annoyed with a bit until I realized he was telling an under-story with much of it. What I mean by that is, with this series there&amp;#39;s a WEALTH of unspoken plot. For instance, you may be introduced to a character who remains unnamed in the first book, but whose description would be like &amp;quot;long greasy black curls, hooked nose, with a scar&amp;quot;. 4 books later that same character pops up again named and part of the plot. Back in book 1 that character IS significant, you just don&amp;#39;t know it yet. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is something I&amp;#39;d like to expand on - you touch on the under-story connecting unnamed characters and making them important later, but the thing that I find really enchanting about ASoIaF is the &lt;em&gt;secret&lt;/em&gt; under-stories. The ones he hides inside the plot and only ever hints at that you will only notice if you are seriously paying attention. &lt;/p&gt;\n\n&lt;p&gt;Gosh, Wyman Manderly sure is enjoying those three pies isn&amp;#39;t he? Interesting that he insisted on having a slice of each one. I wonder why that is. I could assume it&amp;#39;s because he&amp;#39;s described as a bit of a gluttonous bastard, but I&amp;#39;d be wrong. &lt;/p&gt;\n\n&lt;p&gt;In order for me to know the real reason, I must have:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Paid attention to the history between the Manderlys and the Freys&lt;/li&gt;\n&lt;li&gt;Paid attention to the rules of guest right&lt;/li&gt;\n&lt;li&gt;Paid attention to the story of the Rat Cook&lt;/li&gt;\n&lt;li&gt;Paid attention when someone went missing&lt;/li&gt;\n&lt;li&gt;Pieced it all together without any direct dialogue or narrative stating what actually happened&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This is where Martin really shines for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4hz9e", "score_hidden": false, "stickied": false, "created": 1491956804.0, "created_utc": 1491928004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4jtr4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4jl96", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I KNOW and my god, when Lena Heady sent out that picture of stones in the shape of a heart I got *so pumped*. HERE IT COMES HERE IT COMES.... then it didn't. \n\nJesus Christ, Lena. Way to break a womans heart. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I KNOW and my god, when Lena Heady sent out that picture of stones in the shape of a heart I got &lt;em&gt;so pumped&lt;/em&gt;. HERE IT COMES HERE IT COMES.... then it didn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Jesus Christ, Lena. Way to break a womans heart. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4jtr4", "score_hidden": false, "stickied": false, "created": 1491958817.0, "created_utc": 1491930017.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jl96", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "UnsealedMTG", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; Catelyn Stark This is a character steeped in tragedy, bitterness, and woe.\n\nYessssss. My favorite thing about ASOIAF is that it is like half a dozen Greek tradgedies at once. And like true Greek tragedies, the characters have a key \"flaw\"--one characteristic that represents the core of their character and also seeds their doom. For Catelyn, it is adherence to an idea of family duty above all. It is the best of her, but it also what animates her treatment of Jon, as he is a threat to the family that is her everything. [](#s \"It indirectly leads to her death--she isn't able to stave off Rob's marriage because she is on the outs for freeing Jaime in order to save Sansa and Arya. That marriage is the proximate cause of the Red Wedding\"). \n\n[Major, Major five-alarm no shit spoiler for people who haven't read the books even if they have seen the show. Maybe will even spoil the show, not sure.](#s \"Her current incarnation, a very dark echo of her tragic flaw, is the most exciting book plot that the show has not touched and seems like it may not touch\")\n\nOther characters have their own flaws of this kind--Tywin's desire never to be laughed at, Ned's honor, Ser Jorah's romantic nature. They all make compelling stories. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Catelyn Stark This is a character steeped in tragedy, bitterness, and woe.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yessssss. My favorite thing about ASOIAF is that it is like half a dozen Greek tradgedies at once. And like true Greek tragedies, the characters have a key &amp;quot;flaw&amp;quot;--one characteristic that represents the core of their character and also seeds their doom. For Catelyn, it is adherence to an idea of family duty above all. It is the best of her, but it also what animates her treatment of Jon, as he is a threat to the family that is her everything. &lt;a href=\"#s\" title=\"It indirectly leads to her death--she isn&amp;#39;t able to stave off Rob&amp;#39;s marriage because she is on the outs for freeing Jaime in order to save Sansa and Arya. That marriage is the proximate cause of the Red Wedding\"&gt;&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"#s\" title=\"Her current incarnation, a very dark echo of her tragic flaw, is the most exciting book plot that the show has not touched and seems like it may not touch\"&gt;Major, Major five-alarm no shit spoiler for people who haven&amp;#39;t read the books even if they have seen the show. Maybe will even spoil the show, not sure.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Other characters have their own flaws of this kind--Tywin&amp;#39;s desire never to be laughed at, Ned&amp;#39;s honor, Ser Jorah&amp;#39;s romantic nature. They all make compelling stories. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4jl96", "score_hidden": false, "stickied": false, "created": 1491958561.0, "created_utc": 1491929761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4it4g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4ing4", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "It's actually been a couple years for me as well. I burned myself out living on r/asoiaf for many years. I was basically as active there as I am here now - but ya know.... broader scope of things to talk about here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s actually been a couple years for me as well. I burned myself out living on &lt;a href=\"/r/asoiaf\"&gt;r/asoiaf&lt;/a&gt; for many years. I was basically as active there as I am here now - but ya know.... broader scope of things to talk about here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4it4g", "score_hidden": false, "stickied": false, "created": 1491957722.0, "created_utc": 1491928922.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ing4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "LittlePlasticCastle", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I *love* the characters in these books, and absolutely agree, re-reads are amazing. I am sad I haven't had a chance to reread them in years :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I &lt;em&gt;love&lt;/em&gt; the characters in these books, and absolutely agree, re-reads are amazing. I am sad I haven&amp;#39;t had a chance to reread them in years :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4ing4", "score_hidden": false, "stickied": false, "created": 1491957547.0, "created_utc": 1491928747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4n5js", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "knobbodiwork", "parent_id": "t1_dg4m5bi", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Yeah that was one of the (many) things I really did not like about the show, [how](#s \"they fucked up Jaime's redemption storyline so hard.\")", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah that was one of the (many) things I really did not like about the show, &lt;a href=\"#s\" title=\"they fucked up Jaime&amp;#39;s redemption storyline so hard.\"&gt;how&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4n5js", "score_hidden": false, "stickied": false, "created": 1491962459.0, "created_utc": 1491933659.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg5in0h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lemerney2", "parent_id": "t1_dg4pn90", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Also when she was born Jaime's sword hand was clutching her foot. And because Jamie has already lost his sword hand it is pretty good foreshadowing for her losing her foot and the bond between them finally severing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also when she was born Jaime&amp;#39;s sword hand was clutching her foot. And because Jamie has already lost his sword hand it is pretty good foreshadowing for her losing her foot and the bond between them finally severing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5in0h", "score_hidden": false, "stickied": false, "created": 1492003325.0, "created_utc": 1491974525.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4pu8v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4pn90", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Yep, she was complaining about her foot hurting a few times after it was cut during her walk in the tail end of the book. I need this to be true. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, she was complaining about her foot hurting a few times after it was cut during her walk in the tail end of the book. I need this to be true. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4pu8v", "score_hidden": false, "stickied": false, "created": 1491965395.0, "created_utc": 1491936595.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pn90", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "_Bloodyraven", "parent_id": "t1_dg4n8kl", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Is it infected?? Did I miss that info too? I know her feet were cut during the walk. I never thought this way. If it comes true what a symbolic event it will be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it infected?? Did I miss that info too? I know her feet were cut during the walk. I never thought this way. If it comes true what a symbolic event it will be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4pn90", "score_hidden": false, "stickied": false, "created": 1491965190.0, "created_utc": 1491936390.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4n8kl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4m5bi", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "[Cersei the Monstress](#s \" The shit she does to her hand maids and the Blue Bard by giving them to Qyburn is when I went from serious dislike, to outright DISGUST. That poor dude.... She knows he didn't do anything wrong. She's sitting there watching his boots fill with blood and she just walks away and never thinks about it again. Oh hey Uncle, can you help me? NO WELL FUCK YOU. Jaime, I've fucked multiple people and now I'm not attracted to you anymore because you gained a heart when you lost your hand. JAIME COME SAVE ME.  Go fuck yourself go fuck yourself go fuck yourself. Oh, and ya know that passage about Jaime holding onto her foot as they were born.... well.... Jaime has lost that hand. And Cersei may lose her foot. In the end of book 5 it's infected. Duh-nuh-nuh. Officially severing the link\")", "edited": 1491936671.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"#s\" title=\" The shit she does to her hand maids and the Blue Bard by giving them to Qyburn is when I went from serious dislike, to outright DISGUST. That poor dude.... She knows he didn&amp;#39;t do anything wrong. She&amp;#39;s sitting there watching his boots fill with blood and she just walks away and never thinks about it again. Oh hey Uncle, can you help me? NO WELL FUCK YOU. Jaime, I&amp;#39;ve fucked multiple people and now I&amp;#39;m not attracted to you anymore because you gained a heart when you lost your hand. JAIME COME SAVE ME.  Go fuck yourself go fuck yourself go fuck yourself. Oh, and ya know that passage about Jaime holding onto her foot as they were born.... well.... Jaime has lost that hand. And Cersei may lose her foot. In the end of book 5 it&amp;#39;s infected. Duh-nuh-nuh. Officially severing the link\"&gt;Cersei the Monstress&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4n8kl", "score_hidden": false, "stickied": false, "created": 1491962550.0, "created_utc": 1491933750.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4m5bi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "_Bloodyraven", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I love your reviews. \n\nI loathe Cersei. [AFFC/ADWD spoiler](/s \"every time I read her chapter when she is with the High Sparrow, I was like 'suffer you bitch.'\")\n\nI just feel the TV show toned down much on her and didn't portray any of her cruelty.\n\nJaime on the other hand is so likeable and [spoiler] (/s \"finally he is changing.\"). Again the show deviated. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love your reviews. &lt;/p&gt;\n\n&lt;p&gt;I loathe Cersei. &lt;a href=\"/s\" title=\"every time I read her chapter when she is with the High Sparrow, I was like &amp;#39;suffer you bitch.&amp;#39;\"&gt;AFFC/ADWD spoiler&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I just feel the TV show toned down much on her and didn&amp;#39;t portray any of her cruelty.&lt;/p&gt;\n\n&lt;p&gt;Jaime on the other hand is so likeable and &lt;a href=\"/s\" title=\"finally he is changing.\"&gt;spoiler&lt;/a&gt;. Again the show deviated. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4m5bi", "score_hidden": false, "stickied": false, "created": 1491961353.0, "created_utc": 1491932553.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4pxu4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4pkbo", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Why thank you :) don't let that stop you from posting reviews though, I basically never visit r/books I haven't posted anything there in a long time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why thank you :) don&amp;#39;t let that stop you from posting reviews though, I basically never visit &lt;a href=\"/r/books\"&gt;r/books&lt;/a&gt; I haven&amp;#39;t posted anything there in a long time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4pxu4", "score_hidden": false, "stickied": false, "created": 1491965500.0, "created_utc": 1491936700.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pkbo", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Pepperman94", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I recently also finished rereading the series and thought about posting a review on /r/books but since you posted a review here I won't bother. You said everything I was going to say but better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recently also finished rereading the series and thought about posting a review on &lt;a href=\"/r/books\"&gt;/r/books&lt;/a&gt; but since you posted a review here I won&amp;#39;t bother. You said everything I was going to say but better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4pkbo", "score_hidden": false, "stickied": false, "created": 1491965106.0, "created_utc": 1491936306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4rbl6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GenyaSafin", "parent_id": "t1_dg4r6p7", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Cool. I will definitely try it, but maybe not right away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool. I will definitely try it, but maybe not right away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4rbl6", "score_hidden": false, "stickied": false, "created": 1491966950.0, "created_utc": 1491938150.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4r6p7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4r1tk", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I've only done it once because I found it sort of a pain in the ass, but it did give me a much different perspective on the timeline of events. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve only done it once because I found it sort of a pain in the ass, but it did give me a much different perspective on the timeline of events. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4r6p7", "score_hidden": false, "stickied": false, "created": 1491966806.0, "created_utc": 1491938006.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4rqqw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cantforgivethedog", "parent_id": "t1_dg4r1tk", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I think this is how I'm going to be doing it the first way through. I love Tyrion on the show, so I wouldn't want to miss out on him for a whole book. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is how I&amp;#39;m going to be doing it the first way through. I love Tyrion on the show, so I wouldn&amp;#39;t want to miss out on him for a whole book. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4rqqw", "score_hidden": false, "stickied": false, "created": 1491967406.0, "created_utc": 1491938606.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4r1tk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GenyaSafin", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Man, I just read book 4 and 5, but this mixed reading order makes me want to read them again just to see what's it's like. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, I just read book 4 and 5, but this mixed reading order makes me want to read them again just to see what&amp;#39;s it&amp;#39;s like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4r1tk", "score_hidden": false, "stickied": false, "created": 1491966664.0, "created_utc": 1491937864.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg5a3gm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheLadyMelandra", "parent_id": "t1_dg54vj3", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Nothing wrong with that. Snow on the roof doesn't mean there's not a fire in the furnace.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing wrong with that. Snow on the roof doesn&amp;#39;t mean there&amp;#39;s not a fire in the furnace.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5a3gm", "score_hidden": false, "stickied": false, "created": 1491990096.0, "created_utc": 1491961296.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg54vj3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg54s6j", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "my *god yes*. \n\nO.O \n\nOh, snap. did i just realize i crush on older dudes in books?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;my &lt;em&gt;god yes&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;O.O &lt;/p&gt;\n\n&lt;p&gt;Oh, snap. did i just realize i crush on older dudes in books?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg54vj3", "score_hidden": false, "stickied": false, "created": 1491983254.0, "created_utc": 1491954454.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg54s6j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheLadyMelandra", "parent_id": "t1_dg4x5u4", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Dalinar Kholin's running a close second.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dalinar Kholin&amp;#39;s running a close second.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg54s6j", "score_hidden": false, "stickied": false, "created": 1491983125.0, "created_utc": 1491954325.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4x5u4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4wo63", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; Selmy. If it's possible to have a crush on a fictional character, then Barristan's it for me.\n\nsilver haired fox &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Selmy. If it&amp;#39;s possible to have a crush on a fictional character, then Barristan&amp;#39;s it for me.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;silver haired fox &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4x5u4", "score_hidden": false, "stickied": false, "created": 1491973412.0, "created_utc": 1491944612.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wo63", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TheLadyMelandra", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": " ASOIF is what got me back into reading after an absence of many years. I started re-reading, but got sidetracked by so many other books. I'll probably re-read Feast and Dance if Winds of Winter is ever released, but, right now, there are so many other books out there to read.\n\nAnd Esme, I agree with you 110% about Barristan Selmy. If it's possible to have a crush on a fictional character, then Barristan's it for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ASOIF is what got me back into reading after an absence of many years. I started re-reading, but got sidetracked by so many other books. I&amp;#39;ll probably re-read Feast and Dance if Winds of Winter is ever released, but, right now, there are so many other books out there to read.&lt;/p&gt;\n\n&lt;p&gt;And Esme, I agree with you 110% about Barristan Selmy. If it&amp;#39;s possible to have a crush on a fictional character, then Barristan&amp;#39;s it for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4wo63", "score_hidden": false, "stickied": false, "created": 1491972847.0, "created_utc": 1491944047.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg54ebh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4zpsj", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "damn.... not much man honestly. Not to this scope anyway. KKC has a lot of the underlying plot thing, but its just 1 dudes story not this 24 POV ridiculousness. Accursed Kings has a lot of the political nutbaggery and backstabbery - but no dragons and shit. \n\nmalazan has a ton of complexity, a lot of characters, but its not geounded in the sort of reality feel of this. malazan is so \"epic\" in every sense of the word while this feels like exaggerated reality. \n\nthere are many books that have aspects of ASOIAF, but i havent personally read one that has everything, the scope of POVS, the ridiculous amount of under story, the ridiculous amount of interwoven themes with sex and violence and well developed characters. i would probably say Malazan comes the closest that ive read. \n\nmaybe someone else has some other suggestions? \n\nand my personal favorite series of all time is **Discworld**", "edited": 1491954961.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;damn.... not much man honestly. Not to this scope anyway. KKC has a lot of the underlying plot thing, but its just 1 dudes story not this 24 POV ridiculousness. Accursed Kings has a lot of the political nutbaggery and backstabbery - but no dragons and shit. &lt;/p&gt;\n\n&lt;p&gt;malazan has a ton of complexity, a lot of characters, but its not geounded in the sort of reality feel of this. malazan is so &amp;quot;epic&amp;quot; in every sense of the word while this feels like exaggerated reality. &lt;/p&gt;\n\n&lt;p&gt;there are many books that have aspects of ASOIAF, but i havent personally read one that has everything, the scope of POVS, the ridiculous amount of under story, the ridiculous amount of interwoven themes with sex and violence and well developed characters. i would probably say Malazan comes the closest that ive read. &lt;/p&gt;\n\n&lt;p&gt;maybe someone else has some other suggestions? &lt;/p&gt;\n\n&lt;p&gt;and my personal favorite series of all time is &lt;strong&gt;Discworld&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg54ebh", "score_hidden": false, "stickied": false, "created": 1491982598.0, "created_utc": 1491953798.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4zpsj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "xSHODANx", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Is this your favorite series overall? What other series or authors are most immediately comparable to your experience with ASOIAF?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this your favorite series overall? What other series or authors are most immediately comparable to your experience with ASOIAF?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4zpsj", "score_hidden": false, "stickied": false, "created": 1491976490.0, "created_utc": 1491947690.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg5dyr6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Zathoth", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I wasn't going to read ASOIAF until it was done, I felt like I could wait (I only need one Kingkiller in my life), but this thread makes me really want to XD", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t going to read ASOIAF until it was done, I felt like I could wait (I only need one Kingkiller in my life), but this thread makes me really want to XD&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5dyr6", "score_hidden": false, "stickied": false, "created": 1491995420.0, "created_utc": 1491966620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4llvp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "_Bloodyraven", "parent_id": "t1_dg4edu7", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Hahaha, His horn voices are THE best!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hahaha, His horn voices are THE best!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4llvp", "score_hidden": false, "stickied": false, "created": 1491960768.0, "created_utc": 1491931968.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4hzu7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4hu9j", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I *thought* he was supposed to be Pycelle but didn't want to misspeak about that. Glover did do an awesome job, really, the vast majority of the cast acting and writing was superb. \n\nI've actually never watched GRRM's Beauty and the Beast, but I probably should get around to that at some point, I think I've read everything he's written ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I &lt;em&gt;thought&lt;/em&gt; he was supposed to be Pycelle but didn&amp;#39;t want to misspeak about that. Glover did do an awesome job, really, the vast majority of the cast acting and writing was superb. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve actually never watched GRRM&amp;#39;s Beauty and the Beast, but I probably should get around to that at some point, I think I&amp;#39;ve read everything he&amp;#39;s written &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4hzu7", "score_hidden": false, "stickied": false, "created": 1491956820.0, "created_utc": 1491928020.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hu9j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "WanderingWayfarer", "parent_id": "t1_dg4ez6e", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "It sucks that Dotrice got sick and wasn't able to play Grand Maester Pycelle, although I would have had a harder time hating Pycelle due to my fondness for Roy. Julian Glover did a great job with the character though, and at least Roy got to be involved with ASOIAF through the audiobooks and his role in season 2 as the Pyromancer.\n\nI really dug the fact Martin met Dotrice while writing for the Beauty and the Beast TV series, which I loved as a little kid. It was weird finding out years later that I was already familiar with Martins work through B&amp;tB, and distinctly remembering some of the episodes he wrote from The Twilight Zone reboot(especially \"The Last Defender of Camelot\"), as well as the \"Sandkings\" episode of the Outer Limits reboot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sucks that Dotrice got sick and wasn&amp;#39;t able to play Grand Maester Pycelle, although I would have had a harder time hating Pycelle due to my fondness for Roy. Julian Glover did a great job with the character though, and at least Roy got to be involved with ASOIAF through the audiobooks and his role in season 2 as the Pyromancer.&lt;/p&gt;\n\n&lt;p&gt;I really dug the fact Martin met Dotrice while writing for the Beauty and the Beast TV series, which I loved as a little kid. It was weird finding out years later that I was already familiar with Martins work through B&amp;amp;tB, and distinctly remembering some of the episodes he wrote from The Twilight Zone reboot(especially &amp;quot;The Last Defender of Camelot&amp;quot;), as well as the &amp;quot;Sandkings&amp;quot; episode of the Outer Limits reboot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4hu9j", "score_hidden": false, "stickied": false, "created": 1491956652.0, "created_utc": 1491927852.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ez6e", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4ey7x", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "as a fun tidbit, he made it into the show, he was Helene the Pyromancer. Roy was supposed to have a larger role but got sick and had to cancel. \n\nhttps://www.youtube.com/watch?v=bPchuBy9OtI \n\nspoilers for season 3? I think? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;as a fun tidbit, he made it into the show, he was Helene the Pyromancer. Roy was supposed to have a larger role but got sick and had to cancel. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=bPchuBy9OtI\"&gt;https://www.youtube.com/watch?v=bPchuBy9OtI&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;spoilers for season 3? I think? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4ez6e", "score_hidden": false, "stickied": false, "created": 1491953503.0, "created_utc": 1491924703.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ey7x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "QueenofShadesmar", "parent_id": "t1_dg4edu7", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I remember that! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember that! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4ey7x", "score_hidden": false, "stickied": false, "created": 1491953472.0, "created_utc": 1491924672.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4edu7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4ebo7", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "If we include audiobooks, yes. Also remember, I've been reading these for over 15 years. I used to go to sleep listening to Roy Dotrice in college - pretty much every night. It was a weird thing, but his voice puts me to sleep and makes me feel warm and fuzzy. *Disclaimer* a lot of people do not like this guys narration because of how he does women. It makes me giggle. I used to have one of his horn blowing scenes as my cell phone ringer. \n\nAAOOOO--OOOO-OOOO", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If we include audiobooks, yes. Also remember, I&amp;#39;ve been reading these for over 15 years. I used to go to sleep listening to Roy Dotrice in college - pretty much every night. It was a weird thing, but his voice puts me to sleep and makes me feel warm and fuzzy. &lt;em&gt;Disclaimer&lt;/em&gt; a lot of people do not like this guys narration because of how he does women. It makes me giggle. I used to have one of his horn blowing scenes as my cell phone ringer. &lt;/p&gt;\n\n&lt;p&gt;AAOOOO--OOOO-OOOO&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4edu7", "score_hidden": false, "stickied": false, "created": 1491952850.0, "created_utc": 1491924050.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ebo7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "North_South_Side", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "2 dozen times per book?\n\n????????", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;2 dozen times per book?&lt;/p&gt;\n\n&lt;p&gt;????????&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4ebo7", "score_hidden": false, "stickied": false, "created": 1491952784.0, "created_utc": 1491923984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wotc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4whaf", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "...... you made a long, long post quoting a ton of books off his website, and continued to go on about this topic after i more or less said yeah youre right, theres probably things that historians could point out as wrong. and then i say it again, trying to bow out again. and now im saying it for a third time. it was 1 line in the review and i included it solely because i took grrm at his word. im an engineer not a historian. from the way you reacted you would have thought that was the title of the post \"How ASOIAF is historically accurate\". im over it! bye! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;...... you made a long, long post quoting a ton of books off his website, and continued to go on about this topic after i more or less said yeah youre right, theres probably things that historians could point out as wrong. and then i say it again, trying to bow out again. and now im saying it for a third time. it was 1 line in the review and i included it solely because i took grrm at his word. im an engineer not a historian. from the way you reacted you would have thought that was the title of the post &amp;quot;How ASOIAF is historically accurate&amp;quot;. im over it! bye! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4wotc", "score_hidden": false, "stickied": false, "created": 1491972868.0, "created_utc": 1491944068.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4whaf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Hergrim", "parent_id": "t1_dg4vjfc", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I'm not coming after you like a dog with a bone. Seriously, all I did was make one little statement, which was only a little FYI and then continued to respond to your comments because I felt the need to defend myself once you started taking my comments out of context, and also because there was a discussion to be had. Maybe I got a little frustrated, but that's because I have the \"It's super historically accurate\" \"No it isn't\" \"Well fuck you, it's fantasy, not history\" conversation a lot, and I apologize for that, but I haven't been going after you particularly hard or with any ill intent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not coming after you like a dog with a bone. Seriously, all I did was make one little statement, which was only a little FYI and then continued to respond to your comments because I felt the need to defend myself once you started taking my comments out of context, and also because there was a discussion to be had. Maybe I got a little frustrated, but that&amp;#39;s because I have the &amp;quot;It&amp;#39;s super historically accurate&amp;quot; &amp;quot;No it isn&amp;#39;t&amp;quot; &amp;quot;Well fuck you, it&amp;#39;s fantasy, not history&amp;quot; conversation a lot, and I apologize for that, but I haven&amp;#39;t been going after you particularly hard or with any ill intent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4whaf", "score_hidden": false, "stickied": false, "created": 1491972626.0, "created_utc": 1491943826.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vjfc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4usfk", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "no, my defense is i took the author at his word in interviews about his love of history and desire to keep things fairly accurate. my weirded outness is someone coming at me like a dog with a bone over the smallest and least significant parts of an extensive review focused mostly on characters after admitting that yeah theres probably stuff in there historians would gawk at. anyone who reads fantasy knows the majority of fantasy books will not be historically accurate so im surprised youre still continuing with this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no, my defense is i took the author at his word in interviews about his love of history and desire to keep things fairly accurate. my weirded outness is someone coming at me like a dog with a bone over the smallest and least significant parts of an extensive review focused mostly on characters after admitting that yeah theres probably stuff in there historians would gawk at. anyone who reads fantasy knows the majority of fantasy books will not be historically accurate so im surprised youre still continuing with this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4vjfc", "score_hidden": false, "stickied": false, "created": 1491971576.0, "created_utc": 1491942776.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4usfk", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Hergrim", "parent_id": "t1_dg4ufgz", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "*sigh*\n\nSee, this is what I hate about the fantasy community. One moment it's praising a book for being historically accurate and then, when it's pointed out that the book isn't historically accurate, it immediately hides behind the \"it's fantasy, of course it's not realistic\" defence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;sigh&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;See, this is what I hate about the fantasy community. One moment it&amp;#39;s praising a book for being historically accurate and then, when it&amp;#39;s pointed out that the book isn&amp;#39;t historically accurate, it immediately hides behind the &amp;quot;it&amp;#39;s fantasy, of course it&amp;#39;s not realistic&amp;quot; defence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4usfk", "score_hidden": false, "stickied": false, "created": 1491970732.0, "created_utc": 1491941932.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ufgz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4txtd", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "this is so off the point i was trying to make with this post....i would hope no one would read a story with undead and dragons and think its 100% accurate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is so off the point i was trying to make with this post....i would hope no one would read a story with undead and dragons and think its 100% accurate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4ufgz", "score_hidden": false, "stickied": false, "created": 1491970331.0, "created_utc": 1491941531.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4txtd", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Hergrim", "parent_id": "t1_dg4tq8b", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt;you said there is a surprising amount of accuracy to it. \n\nI said that it's sometimes surprising what he gets right, given how much he gets wrong. That's what I intended and thought was implicit, at least, even if it wasn't explicit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you said there is a surprising amount of accuracy to it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I said that it&amp;#39;s sometimes surprising what he gets right, given how much he gets wrong. That&amp;#39;s what I intended and thought was implicit, at least, even if it wasn&amp;#39;t explicit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4txtd", "score_hidden": false, "stickied": false, "created": 1491969781.0, "created_utc": 1491940981.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tq8b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4szt6", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "look, i dont know what you want. the historically accurate bit was a very, very small part of my review, and now im regretting mentioning it at all despite the fact you said there is a surprising amount of accuracy to it. ive watched him in interviews say he wanted to keep it at least somewhat authentic, and decided to put that in my review. this was nkt a recommendation for a history lesson, its a *fantasy* with a fair amount of accurate info. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;look, i dont know what you want. the historically accurate bit was a very, very small part of my review, and now im regretting mentioning it at all despite the fact you said there is a surprising amount of accuracy to it. ive watched him in interviews say he wanted to keep it at least somewhat authentic, and decided to put that in my review. this was nkt a recommendation for a history lesson, its a &lt;em&gt;fantasy&lt;/em&gt; with a fair amount of accurate info. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4tq8b", "score_hidden": false, "stickied": false, "created": 1491969547.0, "created_utc": 1491940747.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4szt6", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Hergrim", "parent_id": "t1_dg4qsf5", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt;He is a student of popular history and likes the story aspect of them. But he does like the sensation of not knowing what is going to happen next.\n\n[SSM 28.6.2015](http://www.westeros.org/Citadel/SSM/Entry/12432)\n\n&gt;. I don't have any other language besides English, and there's a paucity of good popular English language histories about medieval Spain, medieval Germany, and the like.\n\n&gt;And in about a week I will be travelling to Spain, coincidentally enough, where I plan to search for some good popular histories as well.\n\n&gt;Can you recommend any good English language popular histories? I stress \"popular.\" I am not looking for academic tomes about changing patterns of land use, but anecdotal history rich in details of battles, betrayals, love affairs, murders, and similar juicy stuff.\n\n[SSM Historical Influences](http://www.westeros.org/Citadel/SSM/Entry/Historical_Influences/)\n\nOf the books he recommends on his website, only one really qualifies as being close to academic history: TOURNAMENTS. Of the remainder, THE MEDIEVAL WARFARE SOURCE BOOK is written by an academic who specialises in the area and draws on a wide range of sources, and the LIFE IN A X books are also written by academics who specialise in medieval history, but each book draws from very old and very limited sources. A DISTANT MIRROR is written by a historian, and I haven't had a chance to read it so far, but elements of the blurb (specifically re: knights) suggest that some Maurice Keen or Matthew Strickland might be needed to add perspective and balance out some ahistorical thinking. THE DICTIONARY OF HERALDRY is likely of use, but was over 90 years old by the time GRRM was writing ASOIAF. GREAT CITIES OF THE ANCIENT WORLD, MEDIEVAL SWORDMANSHIP and THE MEDIEVAL SOLDIER were all written by enthusiasts, not historians.\n\nSeriously, with one exception and one caveat, all the books are pure pop history. There's no Delbrück or Contamine, no Duby or Pounds, no Hanawalt or Karras. It's all severely lacking.\n\nEdit:\n\n&gt;I wasn't trying to imply it's impeccable authentic world, I'm sure there are bits in there historians would gawk over, I was just giving tone and setting as an overall setting as medieval, much of it is accurate which you admitted.\n\nI did no such thing. I said he puts a veneer and occasionally gets things right. The setting is about three or four mutually exclusive time periods jammed together, with no real understanding of how each period actually worked, and shouldn't even be medieval in nature. Actually, everyone and all the animals should have been long dead, but that's a worldbuilding issue, not a historical accuracy issue.", "edited": 1491940867.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He is a student of popular history and likes the story aspect of them. But he does like the sensation of not knowing what is going to happen next.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.westeros.org/Citadel/SSM/Entry/12432\"&gt;SSM 28.6.2015&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;. I don&amp;#39;t have any other language besides English, and there&amp;#39;s a paucity of good popular English language histories about medieval Spain, medieval Germany, and the like.&lt;/p&gt;\n\n&lt;p&gt;And in about a week I will be travelling to Spain, coincidentally enough, where I plan to search for some good popular histories as well.&lt;/p&gt;\n\n&lt;p&gt;Can you recommend any good English language popular histories? I stress &amp;quot;popular.&amp;quot; I am not looking for academic tomes about changing patterns of land use, but anecdotal history rich in details of battles, betrayals, love affairs, murders, and similar juicy stuff.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.westeros.org/Citadel/SSM/Entry/Historical_Influences/\"&gt;SSM Historical Influences&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Of the books he recommends on his website, only one really qualifies as being close to academic history: TOURNAMENTS. Of the remainder, THE MEDIEVAL WARFARE SOURCE BOOK is written by an academic who specialises in the area and draws on a wide range of sources, and the LIFE IN A X books are also written by academics who specialise in medieval history, but each book draws from very old and very limited sources. A DISTANT MIRROR is written by a historian, and I haven&amp;#39;t had a chance to read it so far, but elements of the blurb (specifically re: knights) suggest that some Maurice Keen or Matthew Strickland might be needed to add perspective and balance out some ahistorical thinking. THE DICTIONARY OF HERALDRY is likely of use, but was over 90 years old by the time GRRM was writing ASOIAF. GREAT CITIES OF THE ANCIENT WORLD, MEDIEVAL SWORDMANSHIP and THE MEDIEVAL SOLDIER were all written by enthusiasts, not historians.&lt;/p&gt;\n\n&lt;p&gt;Seriously, with one exception and one caveat, all the books are pure pop history. There&amp;#39;s no Delbrück or Contamine, no Duby or Pounds, no Hanawalt or Karras. It&amp;#39;s all severely lacking.&lt;/p&gt;\n\n&lt;p&gt;Edit:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I wasn&amp;#39;t trying to imply it&amp;#39;s impeccable authentic world, I&amp;#39;m sure there are bits in there historians would gawk over, I was just giving tone and setting as an overall setting as medieval, much of it is accurate which you admitted.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I did no such thing. I said he puts a veneer and occasionally gets things right. The setting is about three or four mutually exclusive time periods jammed together, with no real understanding of how each period actually worked, and shouldn&amp;#39;t even be medieval in nature. Actually, everyone and all the animals should have been long dead, but that&amp;#39;s a worldbuilding issue, not a historical accuracy issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4szt6", "score_hidden": false, "stickied": false, "created": 1491968756.0, "created_utc": 1491939956.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qsf5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Esmerelda-Weatherwax", "parent_id": "t1_dg4qpxo", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; GRRM hates academic history\n\nI can't tell you how many interviews I've watched where he's said the opposite, it all started with flags of ships in the harbor he watched going by as a kid.\n\n&gt; Martin has put a medieval veneer over Westeros, and can surprise you with the aspects he gets right, but he really isn't interested in making an authentic medieval world. \n\nI wasn't trying to imply it's *impeccable* authentic world, I'm sure there are bits in there historians would gawk over, I was just giving tone and setting as an overall setting as medieval, much of it is accurate which you admitted. \n", "edited": 1491939122.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;GRRM hates academic history&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can&amp;#39;t tell you how many interviews I&amp;#39;ve watched where he&amp;#39;s said the opposite, it all started with flags of ships in the harbor he watched going by as a kid.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Martin has put a medieval veneer over Westeros, and can surprise you with the aspects he gets right, but he really isn&amp;#39;t interested in making an authentic medieval world. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wasn&amp;#39;t trying to imply it&amp;#39;s &lt;em&gt;impeccable&lt;/em&gt; authentic world, I&amp;#39;m sure there are bits in there historians would gawk over, I was just giving tone and setting as an overall setting as medieval, much of it is accurate which you admitted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4qsf5", "score_hidden": false, "stickied": false, "created": 1491966396.0, "created_utc": 1491937596.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64r06d", "likes": null, "replies": "", "user_reports": [], "id": "dg4tvht", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "girlifiedplumber", "parent_id": "t1_dg4tf3x", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "relax.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;relax.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4tvht", "score_hidden": false, "stickied": false, "created": 1491969710.0, "created_utc": 1491940910.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tf3x", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Hergrim", "parent_id": "t1_dg4rpme", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt;You've got a bit of tunnel vision going on, that was a long review with the briefest of mentions about historical accuracy being a part of it\n\nSo you want me to just say \"Oh yeah, how great are the books/this review\" instead of engaging in constructive discussion?\n\n&gt;which you then admit is part of it.\n\nI said that he puts on a veneer of historical accuracy, not that historical accuracy is a part of his books. GRRM gets the occasional thing right, like how colourful it all was, and then he goes and makes it acceptable and not particularly uncommon for a 14 year old to be \"wedded and bedded\" or has farmboys on plough horses break a shield wall.\n\n&gt;It's not like this was recommended for a historical fiction thread.\n\nNo, but every time someone talks about historically accurate GRRM creates confirmation bias in a dozen people who now think everything they read in ASOIAF is accurate and realistic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;ve got a bit of tunnel vision going on, that was a long review with the briefest of mentions about historical accuracy being a part of it&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So you want me to just say &amp;quot;Oh yeah, how great are the books/this review&amp;quot; instead of engaging in constructive discussion?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;which you then admit is part of it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I said that he puts on a veneer of historical accuracy, not that historical accuracy is a part of his books. GRRM gets the occasional thing right, like how colourful it all was, and then he goes and makes it acceptable and not particularly uncommon for a 14 year old to be &amp;quot;wedded and bedded&amp;quot; or has farmboys on plough horses break a shield wall.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s not like this was recommended for a historical fiction thread.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, but every time someone talks about historically accurate GRRM creates confirmation bias in a dozen people who now think everything they read in ASOIAF is accurate and realistic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4tf3x", "score_hidden": false, "stickied": false, "created": 1491969214.0, "created_utc": 1491940414.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rpme", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cantforgivethedog", "parent_id": "t1_dg4qpxo", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "You've got a bit of tunnel vision going on, that was a long review with the briefest of mentions about historical accuracy being a part of it..... which you then admit is part of it. It's not like this was recommended for a historical fiction thread. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve got a bit of tunnel vision going on, that was a long review with the briefest of mentions about historical accuracy being a part of it..... which you then admit is part of it. It&amp;#39;s not like this was recommended for a historical fiction thread. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4rpme", "score_hidden": false, "stickied": false, "created": 1491967372.0, "created_utc": 1491938572.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qpxo", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Hergrim", "parent_id": "t3_64r06d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt;This has a very traditional medieval feel to it, and actually since Martin loves history much of this is historically accurate - as in the technology available, foods, agriculture techniques and all that jazz.\n\nI want to disagree here. There is quite a lot that is the historically accurate, and a historian over on /r/asoiaf has had a couple of [threads](https://www.reddit.com/r/asoiaf/comments/5ntdpi/ask_the_medievalist_nerd_anything_spoilers_main/) on the [subject.](https://www.reddit.com/r/asoiaf/comments/5zgn57/ask_the_medievalist_nerd_ii_electric_boogaloo/) Martin has put a medieval veneer over Westeros, and can surprise you with the aspects he gets right, but he really isn't interested in making an authentic medieval world. From a military stand point in particular, GRRM is pretty awful.\n\nAnd, lest anyone take this as me hating ASOIAF because it's cool to do so, I do enjoy the books for what they are. I just hate people telling me how historically accurate they are. GRRM hates academic history and only reads pop history for crying out loud.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This has a very traditional medieval feel to it, and actually since Martin loves history much of this is historically accurate - as in the technology available, foods, agriculture techniques and all that jazz.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I want to disagree here. There is quite a lot that is the historically accurate, and a historian over on &lt;a href=\"/r/asoiaf\"&gt;/r/asoiaf&lt;/a&gt; has had a couple of &lt;a href=\"https://www.reddit.com/r/asoiaf/comments/5ntdpi/ask_the_medievalist_nerd_anything_spoilers_main/\"&gt;threads&lt;/a&gt; on the &lt;a href=\"https://www.reddit.com/r/asoiaf/comments/5zgn57/ask_the_medievalist_nerd_ii_electric_boogaloo/\"&gt;subject.&lt;/a&gt; Martin has put a medieval veneer over Westeros, and can surprise you with the aspects he gets right, but he really isn&amp;#39;t interested in making an authentic medieval world. From a military stand point in particular, GRRM is pretty awful.&lt;/p&gt;\n\n&lt;p&gt;And, lest anyone take this as me hating ASOIAF because it&amp;#39;s cool to do so, I do enjoy the books for what they are. I just hate people telling me how historically accurate they are. GRRM hates academic history and only reads pop history for crying out loud.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg4qpxo", "score_hidden": false, "stickied": false, "created": 1491966324.0, "created_utc": 1491937524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]