[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Fantasy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Book: Gardens of the Moon&lt;/p&gt;\n\n&lt;p&gt;Rating 3/5&lt;/p&gt;\n\n&lt;p&gt;Square: To Read &amp;gt; 1 year.&lt;/p&gt;\n\n&lt;p&gt;Finished: April 4&lt;/p&gt;\n\n&lt;p&gt;Oh boy....&lt;/p&gt;\n\n&lt;p&gt;This is a book that makes me scratch my head - do I give a rating based on the best parts, or the worst parts? If the best, this hits the 4 or 5 stars, if the worst, this would be a &amp;quot;0, do not read&amp;quot; level... So why the wide range?&lt;/p&gt;\n\n&lt;p&gt;One, it feels like Erikson has purposely looked at fantasy books and said &amp;quot;I want to do the opposite&amp;quot;... He has built a world that has an enormous history and a lot of details, and then hidden it all (which is good) but then much of the motivation for the &amp;quot;movers and shakers&amp;quot; is dependent on knowing that hidden history (which is sorta bad). Also he throws out the &amp;quot;constructed language vocab&amp;quot; all over the place, and then refuses to explain it in the story... (an index is very inconvenient on epubs).&lt;/p&gt;\n\n&lt;p&gt;So onto the story. To be fair, the first part (maybe third) is all a bit of a blur. We are dumped in the middle of the action and not given ANY explanation of what is going on. You just have to try to understand the plethora of Significant Names and Important Events that are paraded in front of you. I think i spent too much time trying to understand what it all meant that I probably lost track of the plot for a while. It also didn&amp;#39;t help that there was no real &amp;quot;main character&amp;quot; we were following, but a whole series of PoV characters which didn&amp;#39;t seem to have much connection to each other and who never explained their motivations (even in their own thoughts).&lt;/p&gt;\n\n&lt;p&gt;The basic gist is - Big Empire in conquering lands, opposed by strange forces (Tiiste Ande, think of your basic &amp;#39;sorcerous elves of darkness&amp;#39;) and a proxy war going on in an independent city yet to fall to either side.&lt;/p&gt;\n\n&lt;p&gt;At about the half way mark this book (maybe earlier, 35%?) it swaps from being a confusing mess into being a tight story with some characters I cared about. At about this point we are concentrated on the city of Darujhistan, which is the last of the 7 free cities and next on the Malazan Empire&amp;#39;s hit list. All the plot threads (the Malazan, the semi-rebellious soldiers, a street thief, some assassins, the Lord of the Tiiste Ande, some mages, some local politicos... yeah, lots of them) are concentrating around the same thing - who will control the future of the the City. It made me become very invested in what was happening, and it was BEAUTIFUL to see how the repercussions of each plot thread affected the outcomes of the others. It puts the reader in a position of knowing more than the characters about &amp;#39;whats going on&amp;#39;, and builds a nice feeling of seeing some plans heading down a very bad direction - I wanted to yell at some of the character &amp;quot;no! don&amp;#39;t do that!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;One thing that still rankles me is the whole &amp;#39;manipulative higher powers&amp;#39;. There is a whole bunch of gods/ascendants doing their thing in the background of this story, effectively having a proxy war by way of using various mortals.... It seems to pop up in a lot of epic-fantsy, and damnit it is just frustratingly annoying. It reeks of laziness to have &amp;#39;powers&amp;#39; with no clear motivations being the driving factor in a story... (rant end)&lt;/p&gt;\n\n&lt;p&gt;But some of the characters are awesome. I loved Wiskeyjack and his troops (the bridgeburners) who are constantly sent on suicide missions, but always find a way to mostly survive. I also love the whole mess of characters based in Darujhistan: Kruppe (the fool), Baruk (the alchemist), Crokus (the lovelorn thief), Coll (the drunk warrior).&lt;/p&gt;\n\n&lt;p&gt;But I suppose my tastes for more low-magic fantasy spoiled this a bit for me. Nevertheless I am going to come back to this series in the future!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Book: Gardens of the Moon\n\nRating 3/5\n\nSquare: To Read &gt; 1 year.\n\nFinished: April 4\n\nOh boy....\n\nThis is a book that makes me scratch my head - do I give a rating based on the best parts, or the worst parts? If the best, this hits the 4 or 5 stars, if the worst, this would be a \"0, do not read\" level... So why the wide range?\n\nOne, it feels like Erikson has purposely looked at fantasy books and said \"I want to do the opposite\"... He has built a world that has an enormous history and a lot of details, and then hidden it all (which is good) but then much of the motivation for the \"movers and shakers\" is dependent on knowing that hidden history (which is sorta bad). Also he throws out the \"constructed language vocab\" all over the place, and then refuses to explain it in the story... (an index is very inconvenient on epubs).\n\nSo onto the story. To be fair, the first part (maybe third) is all a bit of a blur. We are dumped in the middle of the action and not given ANY explanation of what is going on. You just have to try to understand the plethora of Significant Names and Important Events that are paraded in front of you. I think i spent too much time trying to understand what it all meant that I probably lost track of the plot for a while. It also didn't help that there was no real \"main character\" we were following, but a whole series of PoV characters which didn't seem to have much connection to each other and who never explained their motivations (even in their own thoughts).\n\nThe basic gist is - Big Empire in conquering lands, opposed by strange forces (Tiiste Ande, think of your basic 'sorcerous elves of darkness') and a proxy war going on in an independent city yet to fall to either side.\n\nAt about the half way mark this book (maybe earlier, 35%?) it swaps from being a confusing mess into being a tight story with some characters I cared about. At about this point we are concentrated on the city of Darujhistan, which is the last of the 7 free cities and next on the Malazan Empire's hit list. All the plot threads (the Malazan, the semi-rebellious soldiers, a street thief, some assassins, the Lord of the Tiiste Ande, some mages, some local politicos... yeah, lots of them) are concentrating around the same thing - who will control the future of the the City. It made me become very invested in what was happening, and it was BEAUTIFUL to see how the repercussions of each plot thread affected the outcomes of the others. It puts the reader in a position of knowing more than the characters about 'whats going on', and builds a nice feeling of seeing some plans heading down a very bad direction - I wanted to yell at some of the character \"no! don't do that!\"\n\nOne thing that still rankles me is the whole 'manipulative higher powers'. There is a whole bunch of gods/ascendants doing their thing in the background of this story, effectively having a proxy war by way of using various mortals.... It seems to pop up in a lot of epic-fantsy, and damnit it is just frustratingly annoying. It reeks of laziness to have 'powers' with no clear motivations being the driving factor in a story... (rant end)\n\nBut some of the characters are awesome. I loved Wiskeyjack and his troops (the bridgeburners) who are constantly sent on suicide missions, but always find a way to mostly survive. I also love the whole mess of characters based in Darujhistan: Kruppe (the fool), Baruk (the alchemist), Crokus (the lovelorn thief), Coll (the drunk warrior).\n\nBut I suppose my tastes for more low-magic fantasy spoiled this a bit for me. Nevertheless I am going to come back to this series in the future!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64tm0y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "Dionysus_Eye", "saved": false, "mod_reports": [], "name": "t3_64tm0y", "subreddit_name_prefixed": "r/Fantasy", "approved_by": null, "over_18": false, "domain": "self.Fantasy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qknd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Fantasy/comments/64tm0y/2017_fantasy_bingo_read_gardens_of_the_moon/", "num_reports": null, "locked": false, "stickied": false, "created": 1491972477.0, "url": "https://www.reddit.com/r/Fantasy/comments/64tm0y/2017_fantasy_bingo_read_gardens_of_the_moon/", "author_flair_text": null, "quarantine": false, "title": "2017 Fantasy Bingo Read: Gardens of the Moon", "created_utc": 1491943677.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": "", "user_reports": [], "id": "dg5ixxy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Flaminkgo", "parent_id": "t1_dg52mrm", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I'll second all this.\n\nI almost gave up about 30% through GotM, I'm so glad I didn't. You will feel lost a lot, you will feel like you're missing something and go back looking for it. Trust Erikson, everything is delivered when it's meant to be, my god when it clicks and you see all the threads coming together, it's incredible!\n\nTo add, the chain of dogs (storyline of book 2) is the greatest thing I've ever read, nothing comes close and I don't know if it ever will. If you're not hooked after book 2 or 3 than I doubt you will be further on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll second all this.&lt;/p&gt;\n\n&lt;p&gt;I almost gave up about 30% through GotM, I&amp;#39;m so glad I didn&amp;#39;t. You will feel lost a lot, you will feel like you&amp;#39;re missing something and go back looking for it. Trust Erikson, everything is delivered when it&amp;#39;s meant to be, my god when it clicks and you see all the threads coming together, it&amp;#39;s incredible!&lt;/p&gt;\n\n&lt;p&gt;To add, the chain of dogs (storyline of book 2) is the greatest thing I&amp;#39;ve ever read, nothing comes close and I don&amp;#39;t know if it ever will. If you&amp;#39;re not hooked after book 2 or 3 than I doubt you will be further on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5ixxy", "score_hidden": false, "stickied": false, "created": 1492003939.0, "created_utc": 1491975139.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52mrm", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "TriscuitCracker", "parent_id": "t3_64tm0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Glad you liked it! You are very right in GoTM that it can be hard at first. What you are feeling is perfectly normal. \n\nRead this spoiler free review of Malazan, it sums up very well why it is my favorite series of all time.  [Malazan spoiler-free review](https://wordwhiskey.wordpress.com/2014/11/12/things-i-love-the-malazan-book-of-the-fallen/)\n\nThe first book, Gardens of the Moon is the hardest. Erikson wrote this book 9 years before the rest of them, and it shows a bit in pacing problems and such. He is an archeologist and an anthropologist by trade so that's why his lore and world building is second to none. Every location is a millenia old and has stories to tell, every character has a history, every race you meet has it's own drama.  It does get easier the more used you get to Eriksen's style. It can be confusing at first, I won't lie, It has a cast of hundreds, a ton of plot thrown at you, you feel like you got dropped into a foreign country with no guidebook and you don't speak the language. This is normal! Malazan does not spoonfeed you very much, you have to piece togther characters and plotlines and how the world works. Eriksen's books tend to start off slow, characters, plot, history, a lot of introspective philosophy, theres' a LOT in these books. Keep reading and all will become clear over time. But nearly every book ends with the last 200 pages with you sweaty, breathless, weepy, exhilerated and it's 5 in the morning and you have to work at 7 but you don't care because you just had an epic experience and will be thinking about it all day and you can't wait to read the next one. Stick with it until Book 3 if you can, if you don't like it by then, you're not going to. Erikson trusts in the reader to figure things out. The glossary and the dramatis personae at the back of the book are your best friends. If you're confused, just keep reading, it will more than likely be answered. Don't worry about the manipulative higher powers...you will see they are a very important part of the overall arcing story. Erikson wrote this series to turn on their heads a lot of fantasy tropes. Good luck! Come over to r/Malazan if you have any question or Impressions! We love new readers! \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad you liked it! You are very right in GoTM that it can be hard at first. What you are feeling is perfectly normal. &lt;/p&gt;\n\n&lt;p&gt;Read this spoiler free review of Malazan, it sums up very well why it is my favorite series of all time.  &lt;a href=\"https://wordwhiskey.wordpress.com/2014/11/12/things-i-love-the-malazan-book-of-the-fallen/\"&gt;Malazan spoiler-free review&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The first book, Gardens of the Moon is the hardest. Erikson wrote this book 9 years before the rest of them, and it shows a bit in pacing problems and such. He is an archeologist and an anthropologist by trade so that&amp;#39;s why his lore and world building is second to none. Every location is a millenia old and has stories to tell, every character has a history, every race you meet has it&amp;#39;s own drama.  It does get easier the more used you get to Eriksen&amp;#39;s style. It can be confusing at first, I won&amp;#39;t lie, It has a cast of hundreds, a ton of plot thrown at you, you feel like you got dropped into a foreign country with no guidebook and you don&amp;#39;t speak the language. This is normal! Malazan does not spoonfeed you very much, you have to piece togther characters and plotlines and how the world works. Eriksen&amp;#39;s books tend to start off slow, characters, plot, history, a lot of introspective philosophy, theres&amp;#39; a LOT in these books. Keep reading and all will become clear over time. But nearly every book ends with the last 200 pages with you sweaty, breathless, weepy, exhilerated and it&amp;#39;s 5 in the morning and you have to work at 7 but you don&amp;#39;t care because you just had an epic experience and will be thinking about it all day and you can&amp;#39;t wait to read the next one. Stick with it until Book 3 if you can, if you don&amp;#39;t like it by then, you&amp;#39;re not going to. Erikson trusts in the reader to figure things out. The glossary and the dramatis personae at the back of the book are your best friends. If you&amp;#39;re confused, just keep reading, it will more than likely be answered. Don&amp;#39;t worry about the manipulative higher powers...you will see they are a very important part of the overall arcing story. Erikson wrote this series to turn on their heads a lot of fantasy tropes. Good luck! Come over to &lt;a href=\"/r/Malazan\"&gt;r/Malazan&lt;/a&gt; if you have any question or Impressions! We love new readers! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg52mrm", "score_hidden": false, "stickied": false, "created": 1491980214.0, "created_utc": 1491951414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": "", "user_reports": [], "id": "dg5q60c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "themad95", "parent_id": "t1_dg5l19z", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Yes, it indeed gets better. The writing and characterisation improved massively since book 2. If you manage to finish book 1, definitely give book 2 a try. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, it indeed gets better. The writing and characterisation improved massively since book 2. If you manage to finish book 1, definitely give book 2 a try. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5q60c", "score_hidden": false, "stickied": false, "created": 1492024028.0, "created_utc": 1491995228.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": "", "user_reports": [], "id": "dg6hisy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lowry4president", "parent_id": "t1_dg5l19z", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I had a list of books to read. The I had to have surgery so I decided to start deadhouse gates during my bedridden phase and rehab....I've been reading malazan since. Every other book on my to read list became less important. When I finish a book i throw in a small easily readable book or two As a buffer so I don't burn out ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a list of books to read. The I had to have surgery so I decided to start deadhouse gates during my bedridden phase and rehab....I&amp;#39;ve been reading malazan since. Every other book on my to read list became less important. When I finish a book i throw in a small easily readable book or two As a buffer so I don&amp;#39;t burn out &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg6hisy", "score_hidden": false, "stickied": false, "created": 1492057077.0, "created_utc": 1492028277.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5l19z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Dionysus_Eye", "parent_id": "t1_dg52v51", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "wait.. it gets _better_?\n\nI am going to read the rest for sure... just there are so many _other_ books i also want to read :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wait.. it gets &lt;em&gt;better&lt;/em&gt;?&lt;/p&gt;\n\n&lt;p&gt;I am going to read the rest for sure... just there are so many &lt;em&gt;other&lt;/em&gt; books i also want to read :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5l19z", "score_hidden": false, "stickied": false, "created": 1492008799.0, "created_utc": 1491979999.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52v51", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "p0x0rz", "parent_id": "t3_64tm0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "As Triscuit said, this book is very rough compared to the rest of the series. In every measurable way, book 2 and beyond are far better than book 1. Characters, plotting, action, all of it. I will say that much remains a mystery all the way until the end, and there are some things that are never fully explained (because the characters involved don't understand it...No author explanations here!), but you've got enough of a picture and understanding by the end that it feels enormously rewarding to suss everything out. \n\nThis is a highly rewarding series of books, but there's definitely a lot of effort involved, on some levels. That said, as I said, it gets much easier to read and is way, way better after book one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As Triscuit said, this book is very rough compared to the rest of the series. In every measurable way, book 2 and beyond are far better than book 1. Characters, plotting, action, all of it. I will say that much remains a mystery all the way until the end, and there are some things that are never fully explained (because the characters involved don&amp;#39;t understand it...No author explanations here!), but you&amp;#39;ve got enough of a picture and understanding by the end that it feels enormously rewarding to suss everything out. &lt;/p&gt;\n\n&lt;p&gt;This is a highly rewarding series of books, but there&amp;#39;s definitely a lot of effort involved, on some levels. That said, as I said, it gets much easier to read and is way, way better after book one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg52v51", "score_hidden": false, "stickied": false, "created": 1491980523.0, "created_utc": 1491951723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": "", "user_reports": [], "id": "dg5qoda", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TRAIANVS", "parent_id": "t3_64tm0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt;He has built a world that has an enormous history and a lot of details, and then hidden it all (which is good) but then much of the motivation for the \"movers and shakers\" is dependent on knowing that hidden history (which is sorta bad).\n\nI think you hit the nail on the head here for why GotM is so hard to get through the first time. But this is also why GotM is so much better on a reread, because then you know a lot more about what is going on behind the scenes so you can really just enjoy the ride.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He has built a world that has an enormous history and a lot of details, and then hidden it all (which is good) but then much of the motivation for the &amp;quot;movers and shakers&amp;quot; is dependent on knowing that hidden history (which is sorta bad).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think you hit the nail on the head here for why GotM is so hard to get through the first time. But this is also why GotM is so much better on a reread, because then you know a lot more about what is going on behind the scenes so you can really just enjoy the ride.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5qoda", "score_hidden": false, "stickied": false, "created": 1492025265.0, "created_utc": 1491996465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": "", "user_reports": [], "id": "dg5s8kn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MattieShoes", "parent_id": "t3_64tm0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I read the first three and gave up.  The world is fine, but I cannot stand the way the author writes.  It's like chewing on tinfoil.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read the first three and gave up.  The world is fine, but I cannot stand the way the author writes.  It&amp;#39;s like chewing on tinfoil.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg5s8kn", "score_hidden": false, "stickied": false, "created": 1492028481.0, "created_utc": 1491999681.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_64tm0y", "likes": null, "replies": "", "user_reports": [], "id": "dg66h62", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vacavillionaire", "parent_id": "t3_64tm0y", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt; One, it feels like Erikson has purposely looked at fantasy books and said \"I want to do the opposite\"... \n\n\n\n\nHit the nail on the head with this one. This is pretty true for the entire series, though that isn't to say that he refuses all fantasy conventions and tropes, just that he makes an effort to subvert many of them.\n\n\n\nFor what its worth, the sequel is worth it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One, it feels like Erikson has purposely looked at fantasy books and said &amp;quot;I want to do the opposite&amp;quot;... &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hit the nail on the head with this one. This is pretty true for the entire series, though that isn&amp;#39;t to say that he refuses all fantasy conventions and tropes, just that he makes an effort to subvert many of them.&lt;/p&gt;\n\n&lt;p&gt;For what its worth, the sequel is worth it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dg66h62", "score_hidden": false, "stickied": false, "created": 1492045788.0, "created_utc": 1492016988.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]