[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Fantasy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So Friday I had the day off and as an avid nature photographer I decided to get some pictures of some shore birds at the Five Rivers Delta area near Mobile, Alabama.  I rented a kayak and headed out on the Delta, as I have done before.  For some reason I noticed that there were many more alligators in evidence than I have ever seen before - usually they are pretty shy buy this time they were just everywhere and floating on top of the water, not appearing spooky when approached (I later found out this has to do with the fact this is egg laying season).   So I get out quite a ways and am taking some pictures when the current (which was quite strong) shoves the kayak up against some kind of stump.  I overbalance and tip the kayak and land in the water.   Now the water was only about two foot deep, though cold, so that wasn&amp;#39;t a problem.  What I didn&amp;#39;t realize was that the bottom of the delta is evidently a quicksand like muck and I sank in up to my thighs and couldn&amp;#39;t move.  I was literally stuck.  With alligators all around!  Thank goodness I was able to search my memory back through all the fantasy books I have ever read and remember how to deal with quicksand.  There are actually quite a few books where this happens!  So using my fantasy skills I was able to eventually free myself (which took about 45 minutes) get back in the kayak and paddle back without any other casualty than my camera lens.   I was out in the middle of nowhere and don&amp;#39;t know how I would have gotten loose without my fantasy skills!  I bet those pesky alligators were just waiting for me to tire in the muck before closing in.  And I don&amp;#39;t know when or how anybody would have ever found me if I hadn&amp;#39;t been able to get loose - it is seriously this big marsh with high grasses and I didn&amp;#39;t have a phone with me.  Presumably the kayak rental place would have looked for me eventually, but it would have been like finding a needle in a haystack...&lt;/p&gt;\n\n&lt;p&gt;So anybody else ever saved their life with things they learned reading a fantasy novel?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So Friday I had the day off and as an avid nature photographer I decided to get some pictures of some shore birds at the Five Rivers Delta area near Mobile, Alabama.  I rented a kayak and headed out on the Delta, as I have done before.  For some reason I noticed that there were many more alligators in evidence than I have ever seen before - usually they are pretty shy buy this time they were just everywhere and floating on top of the water, not appearing spooky when approached (I later found out this has to do with the fact this is egg laying season).   So I get out quite a ways and am taking some pictures when the current (which was quite strong) shoves the kayak up against some kind of stump.  I overbalance and tip the kayak and land in the water.   Now the water was only about two foot deep, though cold, so that wasn't a problem.  What I didn't realize was that the bottom of the delta is evidently a quicksand like muck and I sank in up to my thighs and couldn't move.  I was literally stuck.  With alligators all around!  Thank goodness I was able to search my memory back through all the fantasy books I have ever read and remember how to deal with quicksand.  There are actually quite a few books where this happens!  So using my fantasy skills I was able to eventually free myself (which took about 45 minutes) get back in the kayak and paddle back without any other casualty than my camera lens.   I was out in the middle of nowhere and don't know how I would have gotten loose without my fantasy skills!  I bet those pesky alligators were just waiting for me to tire in the muck before closing in.  And I don't know when or how anybody would have ever found me if I hadn't been able to get loose - it is seriously this big marsh with high grasses and I didn't have a phone with me.  Presumably the kayak rental place would have looked for me eventually, but it would have been like finding a needle in a haystack...\n\nSo anybody else ever saved their life with things they learned reading a fantasy novel?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qe0c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 113, "report_reasons": null, "author": "thebookwhisperer", "saved": false, "mod_reports": [], "name": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "approved_by": null, "over_18": false, "domain": "self.Fantasy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qknd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Fantasy/comments/65qe0c/reading_fantasy_saved_my_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492393920.0, "url": "https://www.reddit.com/r/Fantasy/comments/65qe0c/reading_fantasy_saved_my_life/", "author_flair_text": null, "quarantine": false, "title": "Reading fantasy saved my life!", "created_utc": 1492365120.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 113}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcm3cq", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "emailanimal", "parent_id": "t1_dgch6l9", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Ditto, and yeah, hooray for those life skills learned from reading fantasy.\n\nTo OP: so what *did* you do? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ditto, and yeah, hooray for those life skills learned from reading fantasy.&lt;/p&gt;\n\n&lt;p&gt;To OP: so what &lt;em&gt;did&lt;/em&gt; you do? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcm3cq", "score_hidden": false, "stickied": false, "created": 1492407336.0, "created_utc": 1492378536.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgch6l9", "gilded": 0, "archived": false, "score": 103, "report_reasons": null, "author": "TreyWriter", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Not gonna lie, I thought before reading that this would be about the magic of stories helping you through your depression or something like that.  You know what, though?  I'm not even disappointed.  Solid real life story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not gonna lie, I thought before reading that this would be about the magic of stories helping you through your depression or something like that.  You know what, though?  I&amp;#39;m not even disappointed.  Solid real life story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgch6l9", "score_hidden": false, "stickied": false, "created": 1492400968.0, "created_utc": 1492372168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 103}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcelrr", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "jenile", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "&gt;bottom of the delta is evidently a quicksand like muck and I sank in up to my thighs and couldn't move\n\nomg! See... quicksand is a legitimate fear and not just a plot device in every eighties tv show!\n\n\nNot from fantasy but I totally Mcgyver'd my way out of being stuck in the snow one time.\n\nIt was freezing cold...we're talking -25 here, and I had my old 86 Grand Prix car which was a big ass boat, ran on propane and had bald tires. I got stuck in the stupid empty lot with no one to call, my husband was in camp and there was two kids under 6 in the back seat. so I pulled all my car floor mats out and used them for traction to get out of the hole, and kept doing that til I was out of the damned lot and I never drove that way again, even years later when I owned a truck.\n\nedited-- i should add that this was years before the wonderful invention of cell phones. Don't know how I lived without them.", "edited": 1492368972.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;bottom of the delta is evidently a quicksand like muck and I sank in up to my thighs and couldn&amp;#39;t move&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;omg! See... quicksand is a legitimate fear and not just a plot device in every eighties tv show!&lt;/p&gt;\n\n&lt;p&gt;Not from fantasy but I totally Mcgyver&amp;#39;d my way out of being stuck in the snow one time.&lt;/p&gt;\n\n&lt;p&gt;It was freezing cold...we&amp;#39;re talking -25 here, and I had my old 86 Grand Prix car which was a big ass boat, ran on propane and had bald tires. I got stuck in the stupid empty lot with no one to call, my husband was in camp and there was two kids under 6 in the back seat. so I pulled all my car floor mats out and used them for traction to get out of the hole, and kept doing that til I was out of the damned lot and I never drove that way again, even years later when I owned a truck.&lt;/p&gt;\n\n&lt;p&gt;edited-- i should add that this was years before the wonderful invention of cell phones. Don&amp;#39;t know how I lived without them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcelrr", "score_hidden": false, "stickied": false, "created": 1492397572.0, "created_utc": 1492368772.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgda05p", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "luffyuk", "parent_id": "t1_dgcja5d", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "why didn't you just cast a spell to part the water and sand?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why didn&amp;#39;t you just cast a spell to part the water and sand?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgda05p", "score_hidden": false, "stickied": false, "created": 1492446129.0, "created_utc": 1492417329.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcja5d", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "thebookwhisperer", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Well to get out first thing was I stayed calm and didn't panic.  Actually I was most upset about my camera not about the muck.   The main problem was the muck was so heavy and thick I could not move my legs or pull them up and I didn't want to chance sinking further.  So I slowly started working on one leg trying to wiggle it around and get a loosening around it.  This took a long time.  Once I had one leg a bit loose I kind of leaned over and shove reaching for a bit of fallen tree (it was just out of reach but with time and wiggling I just touched it.)  Holding on to that limb and some marsh grass I slowly pulled myself parallel and eventually got that one leg free by semi floating and hanging onto the branch on my belly (and that water was really gross let me tell you - the stench on my ride home).   So then I was able to finally reach the kayak paddle and use that to pull the kayak towards me (luckily it hadn't strayed to far).  So then I pulled myself over the kayak and starting wiggling to free the other leg, giving myself a little traction by pushing on the branch with my free leg.   Eventually I was able to get both legs free and back in the kayak.  I estimate the entire process took anywhere from 45 minutes to an hour and a half.  Difficult to tell time in those kinds of situations.   The key was staying calm and not panicing.  I kept thinking if I splash around and make noise an alligator would be attracted by thinking they had a stuck prey item.   And let me tell you I saw some big gators that morning.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well to get out first thing was I stayed calm and didn&amp;#39;t panic.  Actually I was most upset about my camera not about the muck.   The main problem was the muck was so heavy and thick I could not move my legs or pull them up and I didn&amp;#39;t want to chance sinking further.  So I slowly started working on one leg trying to wiggle it around and get a loosening around it.  This took a long time.  Once I had one leg a bit loose I kind of leaned over and shove reaching for a bit of fallen tree (it was just out of reach but with time and wiggling I just touched it.)  Holding on to that limb and some marsh grass I slowly pulled myself parallel and eventually got that one leg free by semi floating and hanging onto the branch on my belly (and that water was really gross let me tell you - the stench on my ride home).   So then I was able to finally reach the kayak paddle and use that to pull the kayak towards me (luckily it hadn&amp;#39;t strayed to far).  So then I pulled myself over the kayak and starting wiggling to free the other leg, giving myself a little traction by pushing on the branch with my free leg.   Eventually I was able to get both legs free and back in the kayak.  I estimate the entire process took anywhere from 45 minutes to an hour and a half.  Difficult to tell time in those kinds of situations.   The key was staying calm and not panicing.  I kept thinking if I splash around and make noise an alligator would be attracted by thinking they had a stuck prey item.   And let me tell you I saw some big gators that morning.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcja5d", "score_hidden": false, "stickied": false, "created": 1492403674.0, "created_utc": 1492374874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcho0m", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "mentos_mentat", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Well? How do you do that?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well? How do you do that?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcho0m", "score_hidden": false, "stickied": false, "created": 1492401593.0, "created_utc": 1492372793.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcicif", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bacon8er8", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "But how'd you get out?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But how&amp;#39;d you get out?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcicif", "score_hidden": false, "stickied": false, "created": 1492402463.0, "created_utc": 1492373663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcmfvm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Callaghan-cs", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "In the eventuality that I get stuck into quick sand, can you tell how did you get out of it, please?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the eventuality that I get stuck into quick sand, can you tell how did you get out of it, please?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcmfvm", "score_hidden": false, "stickied": false, "created": 1492407790.0, "created_utc": 1492378990.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcsyn9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "justsharkie", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "RIP Camera lens. You were luckily the only victim, but will be missed.\n\nThat must have been so awful though! Being stuck with no way to get out other than having patience and prior fantasy knowledge is insane. I know I would've become alligator food within the amount of time it took you to get out.\n\nSleep well - you've earned it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;RIP Camera lens. You were luckily the only victim, but will be missed.&lt;/p&gt;\n\n&lt;p&gt;That must have been so awful though! Being stuck with no way to get out other than having patience and prior fantasy knowledge is insane. I know I would&amp;#39;ve become alligator food within the amount of time it took you to get out.&lt;/p&gt;\n\n&lt;p&gt;Sleep well - you&amp;#39;ve earned it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcsyn9", "score_hidden": false, "stickied": false, "created": 1492416653.0, "created_utc": 1492387853.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgd1mnq", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "scrollbreak", "parent_id": "t1_dgcyqq3", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "The OP has clearly learnt the art of cliffhangers from fantasy as well!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The OP has clearly learnt the art of cliffhangers from fantasy as well!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgd1mnq", "score_hidden": false, "stickied": false, "created": 1492428489.0, "created_utc": 1492399689.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyqq3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "darrelldrake", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "WHAT DID YOU DO, MAN?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;WHAT DID YOU DO, MAN?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcyqq3", "score_hidden": false, "stickied": false, "created": 1492424406.0, "created_utc": 1492395606.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcuk3z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dragon_morgan", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Reminds me of [this meme](https://s-media-cache-ak0.pinimg.com/736x/ec/2e/c5/ec2ec5db8e1b4f31b551cd3c928d0895.jpg). I think this is the first time I've ever heard of someone getting stuck in quicksand in real life. I'm glad you got out all right! Very sorry about the camera lens though :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reminds me of &lt;a href=\"https://s-media-cache-ak0.pinimg.com/736x/ec/2e/c5/ec2ec5db8e1b4f31b551cd3c928d0895.jpg\"&gt;this meme&lt;/a&gt;. I think this is the first time I&amp;#39;ve ever heard of someone getting stuck in quicksand in real life. I&amp;#39;m glad you got out all right! Very sorry about the camera lens though :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcuk3z", "score_hidden": false, "stickied": false, "created": 1492418797.0, "created_utc": 1492389997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcwxzz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ChapterOne_Loomings", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Also thought this was a mental health saving type thing, which would have been really great, don't get me wrong.  Surprised that it was an actual skill involving gators.  Very impressed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also thought this was a mental health saving type thing, which would have been really great, don&amp;#39;t get me wrong.  Surprised that it was an actual skill involving gators.  Very impressed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcwxzz", "score_hidden": false, "stickied": false, "created": 1492421900.0, "created_utc": 1492393100.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgcxq4g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "darkazoth", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "You should post some pictures of the area where this happened whenever you can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should post some pictures of the area where this happened whenever you can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgcxq4g", "score_hidden": false, "stickied": false, "created": 1492422983.0, "created_utc": 1492394183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgddb4k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_YouDontKnowMe_", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "That is some /r/thalassophobia shit right there.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is some &lt;a href=\"/r/thalassophobia\"&gt;/r/thalassophobia&lt;/a&gt; shit right there.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgddb4k", "score_hidden": false, "stickied": false, "created": 1492456900.0, "created_utc": 1492428100.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65qe0c", "likes": null, "replies": "", "user_reports": [], "id": "dgdmbw2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "songwind", "parent_id": "t3_65qe0c", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "No life saving for me, though it has helped me out on tests and in trivia games from time to time. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No life saving for me, though it has helped me out on tests and in trivia games from time to time. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgdmbw2", "score_hidden": false, "stickied": false, "created": 1492471619.0, "created_utc": 1492442819.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]