[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Fantasy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Book&lt;/strong&gt;: &lt;a href=\"https://www.goodreads.com/book/show/21122672-full-fathom-five\"&gt;Full Fathom Five&lt;/a&gt; by Max Gladstone&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Rating&lt;/strong&gt;: 4/5&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Square&lt;/strong&gt;: New Weird (or AMA Author, Not the First Book in a series)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Finished&lt;/strong&gt;: 17 April&lt;/p&gt;\n\n&lt;p&gt;This is a confusing book, but wonderful in the confusion it generates :)&lt;/p&gt;\n\n&lt;p&gt;First up - how to classify? Its a fantasy in that there is magic, undead sorcerers, gods, golems etc... but it is set in a &amp;quot;modern&amp;quot; seeming world, with talk of return on investments, financial markets, world wars etc... I guess I&amp;#39;m going to put it in &amp;quot;urban-fantasy&amp;quot; but it seems to be coming to that genre from a mirror direction - instead of our own modern world with &amp;quot;fantasy&amp;quot; thrown in, this book is a magical world that has evolved to match the &amp;quot;technology&amp;quot; of our modern world...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll be honest, and say that the first half of this book felt like a pain to read. It felt too close to home - with bureaucratic annoyances and a character going through a general malaise towards life... &amp;quot;Kai&amp;quot; (one of the main PoV characters) could have been just about any mid-level investment banker, her attitudes and opinions were very familiar - and depressing.&lt;/p&gt;\n\n&lt;p&gt;But of course, the worldbuilding of this magical place put a strange twist on this. Mr Gladstone took a old mythic trope - that you can sell your soul - and extrapolated that onwards in a fantastic way. Prayer and soul-stuff is literally the currency of this world - and so there is a whole market based around it. In this &amp;quot;modern&amp;quot; magic world there is an international marketplace for prayer and soul-stuff. So priests are the &amp;quot;investment bankers&amp;quot; of this world. It is fascinating! Kai is a &amp;quot;investment banker&amp;quot; who makes Idols - non sentient gods - that allow worshippers to pick and choose what returns they want on their investments, and to keep their investments (souls) away from the Gods and Magicians of this world...&lt;/p&gt;\n\n&lt;p&gt;Once it clicked, the way everything flowed out from this basic idea was astounding. What would you do if you were an investment banker and your &amp;quot;investment account&amp;quot; suddenly came alive and started spending money itself? What would your bosses do?&lt;/p&gt;\n\n&lt;p&gt;So this was two main stories intertwined - Kai is the priest who discovers that the Idols are being &amp;quot;killed off&amp;quot;, and due to a rash action gets involved in a legal case where her Order is being sued for &amp;quot;financial mismanagement&amp;quot;. The other story is about a street kid (Izza) in a gang of thieves who&amp;#39;s goddess (The Blue Lady) died and left them with nothing, and is struggling to get enough soul-stuff to buy her way off the island and into a better life.&lt;/p&gt;\n\n&lt;p&gt;But the two stories are linked - the death of the Blue Lady and the &amp;quot;death&amp;quot; of the Idol happen at the same time.&lt;/p&gt;\n\n&lt;p&gt;Like I said, the first half of this novel is intellectually interesting in that I liked the worldbuilding and extrapolation of ideas, but I could never really connect to either of the PoV characters, and the flow of the writing seemed to go on a little too much. Everything felt somewhat held at a distance. I kept on getting tired and putting the book down. But that all changed at the halfway point where the link between the stories became crystal clear, and the characters each made a solid decision about what they were doing... Everyone had a driving goal and was acting to try to make it happen. &lt;/p&gt;\n\n&lt;p&gt;The story developed some serious pace!&lt;/p&gt;\n\n&lt;p&gt;I pretty much read the rest of the book in a single day (yeah, I&amp;#39;ll get to those chores in a little while) because all that boring first half full of day to day minutia suddenly becomes very important. &lt;a href=\"#s\" title=\"My favourite scene is when Kai is held at knifepoint by Izza, and she uses her training as a saleswoman (which is totally out of a telemarketing handbook!) to defuse the situation and get Izza onto her side.\"&gt;spoiler&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I have to say that Max Gladstone is doing a fantastic job, he is taking some old fantasy tropes that often feel overdone or tired, and imagining how the modern world would look if those tropes were a reality.. It is amazing, and the characters are &amp;quot;everyday&amp;quot; people, with everyday worries and concerns and dreams, but with the added complications of being in a world where gods really can eat your soul :)&lt;/p&gt;\n\n&lt;p&gt;PS - would people agree that this counts as &amp;quot;new weird?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Book**: [Full Fathom Five](https://www.goodreads.com/book/show/21122672-full-fathom-five) by Max Gladstone\n\n**Rating**: 4/5\n\n**Square**: New Weird (or AMA Author, Not the First Book in a series)\n\n**Finished**: 17 April\n\nThis is a confusing book, but wonderful in the confusion it generates :)\n\nFirst up - how to classify? Its a fantasy in that there is magic, undead sorcerers, gods, golems etc... but it is set in a \"modern\" seeming world, with talk of return on investments, financial markets, world wars etc... I guess I'm going to put it in \"urban-fantasy\" but it seems to be coming to that genre from a mirror direction - instead of our own modern world with \"fantasy\" thrown in, this book is a magical world that has evolved to match the \"technology\" of our modern world...\n\nI'll be honest, and say that the first half of this book felt like a pain to read. It felt too close to home - with bureaucratic annoyances and a character going through a general malaise towards life... \"Kai\" (one of the main PoV characters) could have been just about any mid-level investment banker, her attitudes and opinions were very familiar - and depressing.\n\nBut of course, the worldbuilding of this magical place put a strange twist on this. Mr Gladstone took a old mythic trope - that you can sell your soul - and extrapolated that onwards in a fantastic way. Prayer and soul-stuff is literally the currency of this world - and so there is a whole market based around it. In this \"modern\" magic world there is an international marketplace for prayer and soul-stuff. So priests are the \"investment bankers\" of this world. It is fascinating! Kai is a \"investment banker\" who makes Idols - non sentient gods - that allow worshippers to pick and choose what returns they want on their investments, and to keep their investments (souls) away from the Gods and Magicians of this world...\n\nOnce it clicked, the way everything flowed out from this basic idea was astounding. What would you do if you were an investment banker and your \"investment account\" suddenly came alive and started spending money itself? What would your bosses do?\n\nSo this was two main stories intertwined - Kai is the priest who discovers that the Idols are being \"killed off\", and due to a rash action gets involved in a legal case where her Order is being sued for \"financial mismanagement\". The other story is about a street kid (Izza) in a gang of thieves who's goddess (The Blue Lady) died and left them with nothing, and is struggling to get enough soul-stuff to buy her way off the island and into a better life.\n\nBut the two stories are linked - the death of the Blue Lady and the \"death\" of the Idol happen at the same time.\n\nLike I said, the first half of this novel is intellectually interesting in that I liked the worldbuilding and extrapolation of ideas, but I could never really connect to either of the PoV characters, and the flow of the writing seemed to go on a little too much. Everything felt somewhat held at a distance. I kept on getting tired and putting the book down. But that all changed at the halfway point where the link between the stories became crystal clear, and the characters each made a solid decision about what they were doing... Everyone had a driving goal and was acting to try to make it happen. \n\nThe story developed some serious pace!\n\nI pretty much read the rest of the book in a single day (yeah, I'll get to those chores in a little while) because all that boring first half full of day to day minutia suddenly becomes very important. [spoiler](#s \"My favourite scene is when Kai is held at knifepoint by Izza, and she uses her training as a saleswoman (which is totally out of a telemarketing handbook!) to defuse the situation and get Izza onto her side.\")\n\nI have to say that Max Gladstone is doing a fantastic job, he is taking some old fantasy tropes that often feel overdone or tired, and imagining how the modern world would look if those tropes were a reality.. It is amazing, and the characters are \"everyday\" people, with everyday worries and concerns and dreams, but with the added complications of being in a world where gods really can eat your soul :)\n\nPS - would people agree that this counts as \"new weird?\"", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Review", "id": "65uk7l", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "Dionysus_Eye", "saved": false, "mod_reports": [], "name": "t3_65uk7l", "subreddit_name_prefixed": "r/Fantasy", "approved_by": null, "over_18": false, "domain": "self.Fantasy", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/5CgcfB7vZWltICaxpmKm78vxJdYVugCiEzwYlNu1XJU.jpg?s=ece9e6bca9fd5e8131dc9753f036bdf9", "width": 475, "height": 475}, "resolutions": [{"url": "https://i.redditmedia.com/5CgcfB7vZWltICaxpmKm78vxJdYVugCiEzwYlNu1XJU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=ddca90f45efc95b8ac863519087a67a7", "width": 108, "height": 108}, {"url": "https://i.redditmedia.com/5CgcfB7vZWltICaxpmKm78vxJdYVugCiEzwYlNu1XJU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=f6cfad8c17cbe76b8e9dbbebbe6ef758", "width": 216, "height": 216}, {"url": "https://i.redditmedia.com/5CgcfB7vZWltICaxpmKm78vxJdYVugCiEzwYlNu1XJU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=8f0562809c4f9afaf81c366a3e7519e3", "width": 320, "height": 320}], "variants": {}, "id": "x0fy44gyQVkmcVryaJdh2wA30qG2qZ_ST2ArMvj4_aQ"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qknd", "edited": 1492430537.0, "link_flair_css_class": "review", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Fantasy/comments/65uk7l/2017_fantasy_bingo_read_full_fathom_five/", "num_reports": null, "locked": false, "stickied": false, "created": 1492450048.0, "url": "https://www.reddit.com/r/Fantasy/comments/65uk7l/2017_fantasy_bingo_read_full_fathom_five/", "author_flair_text": null, "quarantine": false, "title": "2017 Fantasy Bingo Read: Full Fathom Five", "created_utc": 1492421248.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65uk7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65uk7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65uk7l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65uk7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdjous", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RubiscoTheGeek", "parent_id": "t1_dgdhbbg", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I haven't read any New Weird, but that wikipedia definition sounds like the Craft Sequence to me. I also found this definition\n&gt;Descend into shadowy cities, grotesque rituals, chaotic festivals, and deadly cults. Plunge into terrifying domains, where bodies are remade into surreal monstrosities, where the desperate rage against brutal tyrants. Where everything is lethal and no one is innocent, where Peake began and Lovecraft left off—this is where you will find the New Weird. Edgy, urban fiction with a visceral immediacy, the New Weird has descended from classic fantasy and dime-store pulp novels, from horror and detective comics, from thrillers and noir. All grown-up, it emerges from the chrysalis of nostalgia as newly literate, shocking, and utterly innovative.\n\nwhich again really feels like this series.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t read any New Weird, but that wikipedia definition sounds like the Craft Sequence to me. I also found this definition&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Descend into shadowy cities, grotesque rituals, chaotic festivals, and deadly cults. Plunge into terrifying domains, where bodies are remade into surreal monstrosities, where the desperate rage against brutal tyrants. Where everything is lethal and no one is innocent, where Peake began and Lovecraft left off—this is where you will find the New Weird. Edgy, urban fiction with a visceral immediacy, the New Weird has descended from classic fantasy and dime-store pulp novels, from horror and detective comics, from thrillers and noir. All grown-up, it emerges from the chrysalis of nostalgia as newly literate, shocking, and utterly innovative.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;which again really feels like this series.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgdjous", "score_hidden": false, "stickied": false, "created": 1492468328.0, "created_utc": 1492439528.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65uk7l", "likes": null, "replies": "", "user_reports": [], "id": "dge77g5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LeftwordMovement", "parent_id": "t1_dgdhbbg", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I think the issue with this definition is that it would exclude some Mieville (like Kraken) when I think the entirety of his oeurvre falls into that. Area X would also be eliminated by this definition when I think it's probably a part of it. Although that could be surrealism or magical realism. \n\nGenre distinctions are silly.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the issue with this definition is that it would exclude some Mieville (like Kraken) when I think the entirety of his oeurvre falls into that. Area X would also be eliminated by this definition when I think it&amp;#39;s probably a part of it. Although that could be surrealism or magical realism. &lt;/p&gt;\n\n&lt;p&gt;Genre distinctions are silly.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dge77g5", "score_hidden": false, "stickied": false, "created": 1492495344.0, "created_utc": 1492466544.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhbbg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Dionysus_Eye", "parent_id": "t1_dgdfkps", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "hmm.. going to [wikipedia:](https://en.wikipedia.org/wiki/New_Weird)\n\n\"a type of urban, secondary-world fiction that subverts the romanticized ideas about place found in traditional fantasy, largely by choosing realistic, complex real-world models as the jumping off point for creation of settings that may combine elements of both science fiction and fantasy\"\n\nomg.. can you get anymore vague... sigh.. But for what it's worth it seems to cover all those bases.... but.. I read \"Un Lun Dun\" by Mieville and it felt nothing like it (although that is more YA and sort of fairytale-ish, so not sure it counts either...)\n\nWhat I understand is a \"real world\" (aka complex) version of fantasy which has elements of fantasy and scifi... and generally leaves us somewhat unsettled.. Feels like a crossroads of horror/scifi/fantasy... Which this (Craft sequence) most assuredly slips into. Heck - communication by nightmare as a verison of a telephone/VR system. :)\n\nAgreed - this whole \"new weird\" thing is hard to pin down. Feels very much like a new name for something that has existed for a while... Have you read [Snail on the Slope](https://www.goodreads.com/book/show/34440863-the-snail-on-the-slope)? That seems to hit a lot of the same beats, but is a russian novel from the 60s!", "edited": 1492436347.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hmm.. going to &lt;a href=\"https://en.wikipedia.org/wiki/New_Weird\"&gt;wikipedia:&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;a type of urban, secondary-world fiction that subverts the romanticized ideas about place found in traditional fantasy, largely by choosing realistic, complex real-world models as the jumping off point for creation of settings that may combine elements of both science fiction and fantasy&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;omg.. can you get anymore vague... sigh.. But for what it&amp;#39;s worth it seems to cover all those bases.... but.. I read &amp;quot;Un Lun Dun&amp;quot; by Mieville and it felt nothing like it (although that is more YA and sort of fairytale-ish, so not sure it counts either...)&lt;/p&gt;\n\n&lt;p&gt;What I understand is a &amp;quot;real world&amp;quot; (aka complex) version of fantasy which has elements of fantasy and scifi... and generally leaves us somewhat unsettled.. Feels like a crossroads of horror/scifi/fantasy... Which this (Craft sequence) most assuredly slips into. Heck - communication by nightmare as a verison of a telephone/VR system. :)&lt;/p&gt;\n\n&lt;p&gt;Agreed - this whole &amp;quot;new weird&amp;quot; thing is hard to pin down. Feels very much like a new name for something that has existed for a while... Have you read &lt;a href=\"https://www.goodreads.com/book/show/34440863-the-snail-on-the-slope\"&gt;Snail on the Slope&lt;/a&gt;? That seems to hit a lot of the same beats, but is a russian novel from the 60s!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgdhbbg", "score_hidden": false, "stickied": false, "created": 1492464889.0, "created_utc": 1492436089.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfkps", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "The_Real_JS", "parent_id": "t1_dgdevsa", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Okay, so I've read a bit of NW, but I've never really figured out how to define it. That said, I probably wouldn't put Gladstone in the category. What he does is different, and exciting, and certainly a little bit strange, but he's... I'm not sure. There's a certain feel to NW that Gladstone doesn't have. \n\nThat's just my opinion, and I'll defer to those who have a better grasp of the genre. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so I&amp;#39;ve read a bit of NW, but I&amp;#39;ve never really figured out how to define it. That said, I probably wouldn&amp;#39;t put Gladstone in the category. What he does is different, and exciting, and certainly a little bit strange, but he&amp;#39;s... I&amp;#39;m not sure. There&amp;#39;s a certain feel to NW that Gladstone doesn&amp;#39;t have. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s just my opinion, and I&amp;#39;ll defer to those who have a better grasp of the genre. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgdfkps", "score_hidden": false, "stickied": false, "created": 1492461928.0, "created_utc": 1492433128.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdevsa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lrich1024", "parent_id": "t3_65uk7l", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Not sure about the New Weird thing. I've never heard it called such, but I haven't read it either. I think /u/MikeofthePalace and /u/The_Real_JS have, perhaps they can shed some light here.\n\nThanks for the review, it sounds like an interesting book.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure about the New Weird thing. I&amp;#39;ve never heard it called such, but I haven&amp;#39;t read it either. I think &lt;a href=\"/u/MikeofthePalace\"&gt;/u/MikeofthePalace&lt;/a&gt; and &lt;a href=\"/u/The_Real_JS\"&gt;/u/The_Real_JS&lt;/a&gt; have, perhaps they can shed some light here.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the review, it sounds like an interesting book.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgdevsa", "score_hidden": false, "stickied": false, "created": 1492460572.0, "created_utc": 1492431772.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65uk7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdqqld", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "barb4ry1", "parent_id": "t3_65uk7l", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "Thank you for excellent review. I'll have to consider this one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for excellent review. I&amp;#39;ll have to consider this one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgdqqld", "score_hidden": false, "stickied": false, "created": 1492476607.0, "created_utc": 1492447807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qknd", "removal_reason": null, "link_id": "t3_65uk7l", "likes": null, "replies": "", "user_reports": [], "id": "dgdjt9l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EltaninAntenna", "parent_id": "t3_65uk7l", "subreddit_name_prefixed": "r/Fantasy", "controversiality": 0, "body": "I don't know about \"New Weird\". I prefer just \"modern Fantasy\", as opposed to \"stuff with elves in\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about &amp;quot;New Weird&amp;quot;. I prefer just &amp;quot;modern Fantasy&amp;quot;, as opposed to &amp;quot;stuff with elves in&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Fantasy", "name": "t1_dgdjt9l", "score_hidden": false, "stickied": false, "created": 1492468488.0, "created_utc": 1492439688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]